{"link": "https://www.themoviedb.org/tv/76420?language=en", "title": "Wyatt Cenac's Problem Areas", "resume": "Follow comedian and writer Wyatt Cenac as he explores America’s most pressing issues. Traveling to different parts of the country, Cenac brings unique perspectives to systemic issues, while tackling more benign everyday inconveniences with comedic solutions.", "rate": 0, "genre": ["Comedy", "Documentary"], "cast": ["Wyatt Cenac"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76420   Expand Wyatt Cenac's Problem Areas   (2018) User Score  Play Trailer Overview Follow comedian and writer Wyatt Cenac as he explores America’s most pressing issues. Traveling to different parts of the country, Cenac brings unique perspectives to systemic issues, while tackling more benign everyday inconveniences with comedic solutions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wyatt Cenac Himself - Host Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Wyatt Cenac's Problem Areas premiered on April 13, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply For God's sake Open 0 by Bloodshot77\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wyatt Cenac's Problem Areas. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  30m Homepage   https://www.hbo.com/wyatt-cenacs-problem-areas Genres Comedy Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 47 Elizabeth Jennings E 2 Edytor 2 oldboy3 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}