{"link": "https://www.themoviedb.org/tv/42953?language=en", "title": "Rin: Daughters of Mnemosyne", "resume": "Rin Asogi is an immortal private detective with a thirst for vodka and a talent for attracting things that go bump in the night. In a series of nightmarish vignettes spanning sixty-five years, Rin's lush body is sadistically pierced, blown up, and mulched to a bloody pulp. The fiend behind her tortured existence is Apos, an eternal being obsessed with sacrificing Rin to Yggdrasil, the tree of all life. While Rin struggles to unravel the secrets of her endless agony, Apos lurks in the shadows, eager to tear into her ripe body and devour the memories of her countless lives. Rin's no stranger to the realm of the dead, but her next visit could last forever.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Animation", "Mystery", "Drama"], "cast": ["Akira Ishida", "Rie Kugimiya", "Rie Tanaka", "Sayaka Ohara", "Clarine Harp"], "character": ["Eipos", "Mimi", "Sayara Yamanobe", "Laura", "Laura (English Dub)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42953   Expand Rin: Daughters of Mnemosyne   (2008) User Score Overview Rin Asogi is an immortal private detective with a thirst for vodka and a talent for attracting things that go bump in the night. In a series of nightmarish vignettes spanning sixty-five years, Rin's lush body is sadistically pierced, blown up, and mulched to a bloody pulp. The fiend behind her tortured existence is Apos, an eternal being obsessed with sacrificing Rin to Yggdrasil, the tree of all life. While Rin struggles to unravel the secrets of her endless agony, Apos lurks in the shadows, eager to tear into her ripe body and devour the memories of her countless lives. Rin's no stranger to the realm of the dead, but her next visit could last forever.  Featured Crew Hiroshi Ônogi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akira Ishida Eipos Rie Kugimiya Mimi Rie Tanaka Sayara Yamanobe Sayaka Ohara Laura Clarine Harp Laura (English Dub) Full Cast & Crew Last Season Season 1 2008 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2004-07-25 Elfen Lied 7.6    2010-07-05 Highschool of the Dead 7.0  Facts Original Name  Mnemosyne－ムネモシュネの娘たち－ Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.rin-asougi.com/ Genres Sci-Fi & Fantasy Action & Adventure Animation Mystery Drama Keywords immortality nudity supernatural gore horror ecchi anime fan service yuri Content Score 93 Almost there... Top Contributors 55 WillofOwn 10 sp1ti 5 Sergiojamon b 5 blazingcd  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}