{"link": "https://www.themoviedb.org/tv/5632?language=en", "title": "Goodnight Sweetheart", "resume": "Goodnight Sweetheart is a British sitcom that ran for six series on BBC1 from 1993 to 1999. It stars Nicholas Lyndhurst as Gary Sparrow, an accidental time traveller who leads a double life after discovering a time portal allowing him to travel between the London of the 1990s and the same area during the Second World War.\nThe show was created by Laurence Marks and Maurice Gran, also creators of Birds of a Feather and The New Statesman. The creators wrote the first series, while subsequent episodes were by a team of writers.\nAlthough originally made for the BBC the series has subsequently been repeated on ITV3. Series 1-6 is now being broadcast on GOLD.\nFor his starring role, Lyndhurst won the Most Popular Comedy Performer at the National Television Awards twice in 1998 and 1999.", "rate": 83, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Nicholas Lyndhurst", "Victor McGuire", "Dervla Kirwan", "Michelle Holmes", "Elizabeth Carling"], "character": ["Gary Sparrow", "Ron Wheatcroft", "Phoebe Sparrow", "Yvonne Sparrow", "Phoebe Sparrow"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5632   Expand Goodnight Sweetheart   (1993) User Score Overview Goodnight Sweetheart is a British sitcom that ran for six series on BBC1 from 1993 to 1999. It stars Nicholas Lyndhurst as Gary Sparrow, an accidental time traveller who leads a double life after discovering a time portal allowing him to travel between the London of the 1990s and the same area during the Second World War. The show was created by Laurence Marks and Maurice Gran, also creators of Birds of a Feather and The New Statesman. The creators wrote the first series, while subsequent episodes were by a team of writers. Although originally made for the BBC the series has subsequently been repeated on ITV3. Series 1-6 is now being broadcast on GOLD. For his starring role, Lyndhurst won the Most Popular Comedy Performer at the National Television Awards twice in 1998 and 1999. Featured Crew Laurence Marks Creator Maurice Gran Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Lyndhurst Gary Sparrow Victor McGuire Ron Wheatcroft Dervla Kirwan Phoebe Sparrow Michelle Holmes Yvonne Sparrow Elizabeth Carling Phoebe Sparrow Full Cast & Crew Last Season Season 6 1999 | 10 Episodes Season 6 of Goodnight Sweetheart premiered on April 20, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   1976-02-20 Open All Hours 7.7    1962-01-04 Steptoe and Son 8.2    1974-09-05 Porridge 8.3    1991-01-03 The Brittas Empire 7.1    1985-09-01 In Sickness and in Health 7.9    1986-05-01 Bread 7.4    1995-09-14 They Think It's All Over 7.3    1990-01-04 One Foot in the Grave 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Drama Sci-Fi & Fantasy Keywords fantasy london england double life pub world war ii surreal time travel bigamy policeman time traveler sitcom wartime romance life during wartime 1940s british intelligence british humour married man affair Content Score 93 Almost there... Top Contributors O 43 Ozbourne PO 13 Pete Owen N 10 Notamymerrick f 7 ftlocation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}