{"link": "https://www.themoviedb.org/tv/1486?language=en", "title": "21 Jump Street", "resume": "21 Jump Street is an American police procedural crime drama television series that aired on the Fox Network and in first run syndication from April 12, 1987, to April 27, 1991, with a total of 103 episodes. The series focuses on a squad of youthful-looking undercover police officers investigating crimes in high schools, colleges, and other teenage venues. It was originally going to be titled Jump Street Chapel, after the deconsecrated church building in which the unit has its headquarters, but was changed at Fox's request so as not to mislead viewers into thinking it was a religious program.\nCreated by Patrick Hasburgh and Stephen J. Cannell, the series was produced by Patrick Hasburgh Productions and Stephen J. Cannell Productions in association with 20th Century Fox Television. Executive Producers included Hasburgh, Cannell, Steve Beers and Bill Nuss. The show was an early hit for the fledgling Fox Network, and was created to attract a younger audience. The final season aired in first-run syndication mainly on local Fox affiliates. It was later rerun on the FX cable network from 1996 to 1998.\nThe series provided a spark to Johnny Depp's nascent acting career, garnering him national recognition as a teen idol. Depp found this status irritating, but he continued on the series under his contract and was paid $45,000 per episode. Eventually he was released from his contract after the fourth season. A spin-off series, Booker, was produced for the character of Dennis Booker; it ran one season, from September 1989 to June 1990. A film adaptation starring Jonah Hill and Channing Tatum was released on March 16, 2012.", "rate": 61, "genre": ["Crime", "Mystery", "Action", "Adventure"], "cast": ["Johnny Depp", "Dustin Nguyen", "Holly Robinson Peete", "Steven Williams", "Peter DeLuise"], "character": ["Tommy Hanson", "Officer Harry Truman Ioki", "Officer Judy Hoffs", "Captain Adam Fuller", "Officer Doug Penhall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1486   Expand 21 Jump Street   (1987) User Score  Play Trailer Overview 21 Jump Street is an American police procedural crime drama television series that aired on the Fox Network and in first run syndication from April 12, 1987, to April 27, 1991, with a total of 103 episodes. The series focuses on a squad of youthful-looking undercover police officers investigating crimes in high schools, colleges, and other teenage venues. It was originally going to be titled Jump Street Chapel, after the deconsecrated church building in which the unit has its headquarters, but was changed at Fox's request so as not to mislead viewers into thinking it was a religious program. Created by Patrick Hasburgh and Stephen J. Cannell, the series was produced by Patrick Hasburgh Productions and Stephen J. Cannell Productions in association with 20th Century Fox Television. Executive Producers included Hasburgh, Cannell, Steve Beers and Bill Nuss. The show was an early hit for the fledgling Fox Network, and was created to attract a younger audience. The final season aired in first-run syndication mainly on local Fox affiliates. It was later rerun on the FX cable network from 1996 to 1998. The series provided a spark to Johnny Depp's nascent acting career, garnering him national recognition as a teen idol. Depp found this status irritating, but he continued on the series under his contract and was paid $45,000 per episode. Eventually he was released from his contract after the fourth season. A spin-off series, Booker, was produced for the character of Dennis Booker; it ran one season, from September 1989 to June 1990. A film adaptation starring Jonah Hill and Channing Tatum was released on March 16, 2012. Featured Crew Stephen J. Cannell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  11 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johnny Depp Tommy Hanson Dustin Nguyen Officer Harry Truman Ioki Holly Robinson Peete Officer Judy Hoffs Steven Williams Captain Adam Fuller Peter DeLuise Officer Doug Penhall Full Cast & Crew Last Season Season 5 1990 | 22 Episodes Season 5 of 21 Jump Street premiered on October 13, 1990. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for 21 Jump Street. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  5 Recommendations   1992-07-08 Melrose Place 4.9    1980-10-04 Thundarr the Barbarian 6.3    1979-09-22 Hart to Hart 6.5    2002-09-29 Boomtown 8.4    1984-09-20 Who's the Boss? 6.4    1998-10-23 Brimstone 7.6    1985-09-01 Jayce and The Wheeled Warriors 6.8    1954-09-12 Lassie 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Mystery Action & Adventure Keywords undercover agent undercover police precinct Content Score 100 Yes! Looking good! Top Contributors 10 Banana d 10 denis S 8 Samara 8 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}