{"link": "https://www.themoviedb.org/tv/9877?language=en", "title": "Family Law", "resume": "Family Law is a television drama starring Kathleen Quinlan as divorced lawyer Lynn Holt, who attempted to start her own law firm after her husband left both her and their law practice, taking all of their clients with him. The series aired on CBS from 1999 to 2002 and was created by Paul Haggis.\nThe show also starred Christopher McDonald as opportunistic, ambulance-chasing attorney Rex Weller, Julie Warner as Lynn's friend Danni, and Dixie Carter as \"pit bull\" divorce attorney Randi King. Later cast additions included Tony Danza, Cristián de la Fuente, Salli Richardson and little person actress Meredith Eaton as Emily Resnick, an ambitious attorney hoping to make partner.\nEdwin Starr's 1970 hit song, \"War\" was used as the series' opening title theme.", "rate": 90, "genre": ["Drama"], "cast": ["Christopher McDonald", "Kathleen Quinlan", "Julie Warner", "Dixie Carter", "Cristián de la Fuente"], "character": ["Andres Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9877   Expand Family Law   (1999) User Score Overview Family Law is a television drama starring Kathleen Quinlan as divorced lawyer Lynn Holt, who attempted to start her own law firm after her husband left both her and their law practice, taking all of their clients with him. The series aired on CBS from 1999 to 2002 and was created by Paul Haggis. The show also starred Christopher McDonald as opportunistic, ambulance-chasing attorney Rex Weller, Julie Warner as Lynn's friend Danni, and Dixie Carter as \"pit bull\" divorce attorney Randi King. Later cast additions included Tony Danza, Cristián de la Fuente, Salli Richardson and little person actress Meredith Eaton as Emily Resnick, an ambitious attorney hoping to make partner. Edwin Starr's 1970 hit song, \"War\" was used as the series' opening title theme. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher McDonald Kathleen Quinlan Julie Warner Dixie Carter Cristián de la Fuente Andres Diaz Full Cast & Crew Last Season Season 3 2001 | 22 Episodes Season 3 of Family Law premiered on September 24, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Family Law. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords lawyer law firm divorce lawyer Content Score 86 Almost there... Top Contributors 9 Banana i 3 ismax935 3 Zlogorek S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}