{"link": "https://www.themoviedb.org/tv/5133?language=en", "title": "Leave It to Beaver", "resume": "Leave It to Beaver is an American television situation comedy about an inquisitive and often naïve boy named Theodore \"The Beaver\" Cleaver and his adventures at home, in school, and around his suburban neighborhood. The show also starred Barbara Billingsley and Hugh Beaumont as Beaver's parents, June and Ward Cleaver, and Tony Dow as Beaver's brother Wally. The show has attained an iconic status in the US, with the Cleavers exemplifying the idealized suburban family of the mid-20th century.\nThe show was created by writers Joe Connelly and Bob Mosher. These veterans of radio and early television found inspiration for the show's characters, plots, and dialogue in the lives, experiences, and conversations of their own children. Leave It to Beaver is one of the first primetime sitcom series written from a child's point-of-view. Like several television dramas and sitcoms of the late 1950s and early 1960s, Leave It to Beaver is a glimpse at middle-class, white American boyhood. In a typical episode Beaver got into some sort of trouble, then faced his parents for reprimand and correction. However, neither parent was omniscient; indeed, the series often showed the parents debating their approach to child rearing, and some episodes were built around parental gaffes.", "rate": 71, "genre": ["Comedy"], "cast": ["Jerry Mathers", "Barbara Billingsley", "Hugh Beaumont", "Tony Dow"], "character": ["Theodore 'Beaver' Cleaver", "June Cleaver", "Ward Cleaver", "Wally Cleaver"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5133   Expand Leave It to Beaver   (1957) User Score Overview Leave It to Beaver is an American television situation comedy about an inquisitive and often naïve boy named Theodore \"The Beaver\" Cleaver and his adventures at home, in school, and around his suburban neighborhood. The show also starred Barbara Billingsley and Hugh Beaumont as Beaver's parents, June and Ward Cleaver, and Tony Dow as Beaver's brother Wally. The show has attained an iconic status in the US, with the Cleavers exemplifying the idealized suburban family of the mid-20th century. The show was created by writers Joe Connelly and Bob Mosher. These veterans of radio and early television found inspiration for the show's characters, plots, and dialogue in the lives, experiences, and conversations of their own children. Leave It to Beaver is one of the first primetime sitcom series written from a child's point-of-view. Like several television dramas and sitcoms of the late 1950s and early 1960s, Leave It to Beaver is a glimpse at middle-class, white American boyhood. In a typical episode Beaver got into some sort of trouble, then faced his parents for reprimand and correction. However, neither parent was omniscient; indeed, the series often showed the parents debating their approach to child rearing, and some episodes were built around parental gaffes. Featured Crew Bob Mosher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Mathers Theodore 'Beaver' Cleaver Barbara Billingsley June Cleaver Hugh Beaumont Ward Cleaver Tony Dow Wally Cleaver Full Cast & Crew Last Season Season 6 1962 | 38 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Spelling of Beaver's first name Open 4 by  PT 100 Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1960-09-29 My Three Sons 6.0    1962-09-26 The Beverly Hillbillies 6.6    1961-10-03 The Dick Van Dyke Show 8.2    1960-10-03 The Andy Griffith Show 7.4    1954-10-03 Father Knows Best 8.6    1969-09-11 Room 222 5.8    1965-09-15 Green Acres 6.9    1989-02-28 Coach 6.8  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords kids sitcom Content Score 93 Almost there... Top Contributors 6 Banana 5 TheOneManBoxOffice 4 lineker RW 4 Rich Wannen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}