{"link": "https://www.themoviedb.org/tv/13897?language=en", "title": "Ben Casey", "resume": "Ben Casey is an American medical drama series which ran on ABC from 1961 to 1966. The show was known for its opening titles, which consisted of a hand drawing the symbols \"♂, ♀, ✳, †, ∞\" on a chalkboard, as cast member Sam Jaffe intoned, \"Man, woman, birth, death, infinity.\" Neurosurgeon Joseph Ransohoff was a medical consultant for the show and may have influenced the personality of the title character.", "rate": 68, "genre": ["Drama"], "cast": ["Vince Edwards", "Sam Jaffe", "Jim McMullan", "Franchot Tone", "Marlyn Mason"], "character": ["Ben Casey", "David Zorba", "Dr. Daniel Niles Freeland"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13897   Expand Ben Casey   (1961) User Score Overview Ben Casey is an American medical drama series which ran on ABC from 1961 to 1966. The show was known for its opening titles, which consisted of a hand drawing the symbols \"♂, ♀, ✳, †, ∞\" on a chalkboard, as cast member Sam Jaffe intoned, \"Man, woman, birth, death, infinity.\" Neurosurgeon Joseph Ransohoff was a medical consultant for the show and may have influenced the personality of the title character. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vince Edwards Ben Casey Sam Jaffe David Zorba Jim McMullan Franchot Tone Dr. Daniel Niles Freeland Marlyn Mason Full Cast & Crew Last Season Season 5 1965 | 26 Episodes Season 5 of Ben Casey premiered on September 13, 1965. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply ♂, ♀, ✳, †, ∞ Open 0 by PT 100\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1955-10-03 Captain Kangaroo 6.4    1958-09-24 The Donna Reed Show 6.7    1969-09-11 Room 222 5.8    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1961-09-27 Dr. Kildare 5.8    1990-06-28 Waiting for God 7.8    1958-10-10 77 Sunset Strip 7.9    1960-10-07 Route 66 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords surgeon Content Score 86 Almost there... Top Contributors 12 lineker PE 3 Patrick E. Abe 1 janar 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}