{"link": "https://www.themoviedb.org/tv/37305?language=en", "title": "Soul Eater", "resume": "Set at the \"Death Weapon Meister Academy\", the series revolves around three teams, each consisting of a weapon meister and weapon that can transform into a humanoid. Trying to make the latter a \"death scythe\" and thus fit for use by the academy's headmaster Shinigami, the personification of death, they must collect the souls of 99 evil humans and one witch, in that order; otherwise, they will have to start all over again.", "rate": 71, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Chiaki Omigawa", "Kouki Uchiyama", "Yumiko Kobayashi", "Kaori Nazuka", "Mamoru Miyano"], "character": ["Maka Albarn", "Soul Eater Evans", "Black Star", "Tsubaki Nakatsukasa", "Death the Kid"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37305   Expand Soul Eater   (2008) User Score Overview Set at the \"Death Weapon Meister Academy\", the series revolves around three teams, each consisting of a weapon meister and weapon that can transform into a humanoid. Trying to make the latter a \"death scythe\" and thus fit for use by the academy's headmaster Shinigami, the personification of death, they must collect the souls of 99 evil humans and one witch, in that order; otherwise, they will have to start all over again. Featured Crew Atsushi Ohkubo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chiaki Omigawa Maka Albarn Kouki Uchiyama Soul Eater Evans Yumiko Kobayashi Black Star Kaori Nazuka Tsubaki Nakatsukasa Mamoru Miyano Death the Kid Full Cast & Crew Last Season Season 1 2008 | 51 Episodes Season 1 of Soul Eater premiered on April  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  15 Posters  5 Recommendations   2013-04-04 The Devil Is a Part-Timer! 7.1    2014-05-16 Magi: Adventure of Sinbad 6.7    2014-04-05 The Irregular at Magic High School 6.8    2011-04-16 Deadman Wonderland 7.1    2013-04-07 Gargantia on the Verdurous Planet 6.8    2005-10-04 Hell Girl 7.0    2003-10-08 Gunslinger Girl 7.0    2014-10-12 Fate/stay night [Unlimited Blade Works] 6.8  Facts Original Name  ソウルイーター Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.souleater.tv/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords witch school based on manga demon shounen anime Content Score 93 Almost there... Top Contributors 13 sp1ti K 8 Kuroneko45 t 8 tmdb983464 6 Maralz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}