{"link": "https://www.themoviedb.org/tv/45527?language=en", "title": "Nodame Cantabile", "resume": "Shinichi Chiaki is a first class musician whose dream is to play among the elites in Europe. Coming from a distinguished family, he is an infamous perfectionist; not only is he highly critical of himself, but of others as well. The only thing stopping Chiaki from leaving for Europe is his fear of flying. As a result, he's grounded in Japan.\nDuring his 4th year at Japan's top music university, Chiaki happens to meet Noda Megumi—or as she refers to herself, Nodame. On the surface, she seems to be an unkempt girl with no direction in life. However, when Chiaki hears Nodame play the piano for the first time, he is in awe at the kind of music she plays. To Chiaki's dismay, Nodame moves into the apartment next to his and finds out that she is head-over-heels in love with him.", "rate": 80, "genre": ["Animation", "Drama"], "cast": ["Tomokazu Seki", "Ayako Kawasumi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45527   Expand Nodame Cantabile   (2007) User Score Overview Shinichi Chiaki is a first class musician whose dream is to play among the elites in Europe. Coming from a distinguished family, he is an infamous perfectionist; not only is he highly critical of himself, but of others as well. The only thing stopping Chiaki from leaving for Europe is his fear of flying. As a result, he's grounded in Japan. During his 4th year at Japan's top music university, Chiaki happens to meet Noda Megumi—or as she refers to herself, Nodame. On the surface, she seems to be an unkempt girl with no direction in life. However, when Chiaki hears Nodame play the piano for the first time, he is in awe at the kind of music she plays. To Chiaki's dismay, Nodame moves into the apartment next to his and finds out that she is head-over-heels in love with him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomokazu Seki Ayako Kawasumi Full Cast & Crew Last Season Nodame Cantabile: Finale 2010 | 11 Episodes Season 3 of Nodame Cantabile premiered on January 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nodame Cantabile. You can help by rating TV shows you've seen. Facts Original Name  のだめカンタービレ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors EK 9 Edgar Kent t 5 tmdb983464 d 4 dankzel m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}