{"link": "https://www.themoviedb.org/tv/2840?language=en", "title": "Earth: Final Conflict", "resume": "Earth: Final Conflict is a Canadian science fiction television series based on story ideas created by Gene Roddenberry, and produced under the guidance of his widow, Majel Barrett-Roddenberry. It was not produced, filmed or broadcast until after his death. It ran for five seasons between October 6, 1997, and May 20, 2002.\nThe original title for the show was Battleground: Earth, but the producers changed it because it sounded too much like L. Ron Hubbard's novel, Battlefield Earth. The executive producer was Majel Barrett-Roddenberry. She also appeared in some early episodes as the character Dr Julianne Belman. Barrett was in possession of notes Roddenberry kept of story and series ideas; after his death, these notes provided the basis for this series.", "rate": 68, "genre": ["Sci-Fi", "Fantasy", "Drama", "Action", "Adventure"], "cast": ["Jayne Heitmeyer", "Lisa Howard", "Von Flores", "David Hemblen", "Anita La Selva"], "character": ["Renee Palmer", "Lili Marquette", "Ronald Sandoval", "Jonathan Doors", "Zo'or"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2840   Expand Earth: Final Conflict   (1997) User Score Overview Earth: Final Conflict is a Canadian science fiction television series based on story ideas created by Gene Roddenberry, and produced under the guidance of his widow, Majel Barrett-Roddenberry. It was not produced, filmed or broadcast until after his death. It ran for five seasons between October 6, 1997, and May 20, 2002. The original title for the show was Battleground: Earth, but the producers changed it because it sounded too much like L. Ron Hubbard's novel, Battlefield Earth. The executive producer was Majel Barrett-Roddenberry. She also appeared in some early episodes as the character Dr Julianne Belman. Barrett was in possession of notes Roddenberry kept of story and series ideas; after his death, these notes provided the basis for this series. Featured Crew Gene Roddenberry Creator Majel Barrett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jayne Heitmeyer Renee Palmer Lisa Howard Lili Marquette Von Flores Ronald Sandoval David Hemblen Jonathan Doors Anita La Selva Zo'or Full Cast & Crew Last Season Season 5 2001 | 22 Episodes Season 5 of Earth: Final Conflict premiered on October  1, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I don't get it Open 10 by  Jayhn1111 Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   2009-03-03 The Listener 5.3    1998-09-25 The Crow: Stairway to Heaven 6.4    1989-09-19 Doogie Howser, M.D. 5.7    1994-11-06 Earth 2 7.4    1964-09-17 Bewitched 7.1    1994-01-19 seaQuest DSV 6.7    1986-03-25 Perfect Strangers 6.6    1999-04-03 The Lost World 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 41m Homepage   http://www.efc.com/ Genres Sci-Fi & Fantasy Drama Action & Adventure Keywords alien alien invasion alien contact first contact Content Score 93 Almost there... Top Contributors 22 Nero Kosonen 12 Banana 10 galani m 8 misak0007  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}