{"link": "https://www.themoviedb.org/tv/68950?language=en", "title": "Doubt", "resume": "A successful defense lawyer at a boutique firm becomes romantically involved with a client who may or may not be guilty of a brutal crime.", "rate": 34, "genre": ["Drama"], "cast": ["Katherine Heigl", "Dulé Hill", "Steven Pasquale", "Laverne Cox", "Dreama Walker"], "character": ["Sadie Ellis", "Albert Cobb", "Billy Brennan", "Cameron Wirth", "Tiffany Simon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68950   Expand Doubt   (2017) User Score  Play Trailer Overview A successful defense lawyer at a boutique firm becomes romantically involved with a client who may or may not be guilty of a brutal crime. Featured Crew Tony Phelan Creator Joan Rater Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine Heigl Sadie Ellis Dulé Hill Albert Cobb Steven Pasquale Billy Brennan Laverne Cox Cameron Wirth Dreama Walker Tiffany Simon Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Doubt premiered on February 15, 2017. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Why Does Laverne Cox always cross her legs....? Open 2 by  Knixon K Really enjoying this.  And a question. Open 0 by Knixon\n      \n     Cancelled! Open 3 by  clunybrown2017 Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2017-02-02 Powerless 5.8    2017-02-19 The Good Fight 7.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbs.com/shows/doubt/ Genres Drama Keywords romance lawyer courtroom drama Content Score 100 Yes! Looking good! Top Contributors u 25 urielalmeida 21 Elizabeth Jennings 10 Banana 6 Gabriel W. Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}