{"link": "https://www.themoviedb.org/tv/32730?language=en", "title": "The Event", "resume": "The Event is an emotional, high-octane conspiracy thriller that follows Sean Walker, an everyman who investigates the mysterious disappearance of his would-be fiancée Leila, and unwittingly begins to expose the biggest cover-up in U.S. history.", "rate": 64, "genre": ["Action", "Adventure", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Jason Ritter", "Sarah Roemer", "Laura Innes", "Blair Underwood", "Ian Anthony Dale"], "character": ["Sean Walker", "Leila Buchanan", "Sophia Maguire", "President Elias Martinez", "Simon Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32730   Expand The Event   (2010) User Score  Play Trailer Overview The Event is an emotional, high-octane conspiracy thriller that follows Sean Walker, an everyman who investigates the mysterious disappearance of his would-be fiancée Leila, and unwittingly begins to expose the biggest cover-up in U.S. history. Featured Crew Nick Wauters Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Ritter Sean Walker Sarah Roemer Leila Buchanan Laura Innes Sophia Maguire Blair Underwood President Elias Martinez Ian Anthony Dale Simon Lee Full Cast & Crew Last Season Season 1 2010 | 22 Episodes Season 1 of The Event premiered on September 20, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply R Heroes was cancelled for this garbage?!? Open 0 by Rickers\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  11 Recommendations   2009-09-24 FlashForward 6.9    2011-02-07 Outcasts 6.2    2009-11-03 V 6.2    2011-09-26 Terra Nova 6.3    2012-01-16 Alcatraz 5.9    2006-09-20 Jericho 7.5    2008-11-23 Survivors 7.2    2010-06-07 Persons Unknown 6.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.nbc.com/the-event/ Genres Action & Adventure Drama Mystery Sci-Fi & Fantasy Keywords alien conspiracy Content Score 100 Yes! Looking good! Top Contributors 47 Banana t 22 tinu88 20 United600 CM 8 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}