{"link": "https://www.themoviedb.org/tv/75208?language=en", "title": "Devilman: Crybaby", "resume": "Akira Fudo learns from his best friend Ryo Asuka that demons will revive and reclaim the world from humans. With humans hopeless against this threat, Ryo suggests combining with a demon. With this, Akira becomes Devilman, a being with the power of demon but with a human heart.", "rate": 77, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75208   Expand Devilman: Crybaby   (2018) User Score  Play Trailer Overview Akira Fudo learns from his best friend Ryo Asuka that demons will revive and reclaim the world from humans. With humans hopeless against this threat, Ryo suggests combining with a demon. With this, Akira becomes Devilman, a being with the power of demon but with a human heart. Featured Crew Masaaki Yuasa Creator Ichiro Okouchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Devilman: Crybaby premiered on January  5, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  2 Posters  5 Recommendations   2016-11-07 The Sound of Your Heart 8.0    2014-05-16 Magi: Adventure of Sinbad 6.7    2014-10-12 Fate/stay night [Unlimited Blade Works] 6.8    2015-10-03 K-Project 6.3    2012-10-07 Magi 7.5    2014-04-05 The Irregular at Magic High School 6.8    2012-10-05 Blast of Tempest 7.7    2008-10-30 Wakfu 8.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://devilman-crybaby.com Genres Animation Keywords horror satan based on manga demon anime Content Score 71 Just a little bit more... Top Contributors 28 YabukiJoe1 22 sp1ti M 12 Migi 7 kazuza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}