{"link": "https://www.themoviedb.org/tv/11174?language=en", "title": "The Professionals", "resume": "The lives of Bodie and Doyle, top agents for Britain's CI5 (Criminal Intelligence 5), and their controller, George Cowley. \nThe mandate of CI5 was to fight terrorism and similar high-profile crimes. Cowley, a hard ex-MI5 operative, hand-picked each of his men. Bodie is a cynical ex-SAS paratrooper and mercenary whose nature ran to controlled violence, while his partner, Doyle, comes to CI5 from the regular police force, and is more of an open minded liberal. Their relationship is often contentious, but they are the top men in their field, and the ones to whom Cowley always assigned to the toughest cases.", "rate": 77, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Gordon Jackson", "Martin Shaw", "Lewis Collins", "Bridget Brice", "Steve Alder"], "character": ["George Cowley", "Doyle", "Bodie", "Betty, Cowley's secretary", "Murphy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11174   Expand The Professionals   (1977) User Score  Play Trailer Overview The lives of Bodie and Doyle, top agents for Britain's CI5 (Criminal Intelligence 5), and their controller, George Cowley.  The mandate of CI5 was to fight terrorism and similar high-profile crimes. Cowley, a hard ex-MI5 operative, hand-picked each of his men. Bodie is a cynical ex-SAS paratrooper and mercenary whose nature ran to controlled violence, while his partner, Doyle, comes to CI5 from the regular police force, and is more of an open minded liberal. Their relationship is often contentious, but they are the top men in their field, and the ones to whom Cowley always assigned to the toughest cases. Featured Crew Brian Clemens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gordon Jackson George Cowley Martin Shaw Doyle Lewis Collins Bodie Bridget Brice Betty, Cowley's secretary Steve Alder Murphy Full Cast & Crew Last Season Season 5 1982 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  6 Recommendations   2011-07-04 Pointless Celebrities 7.5    1986-05-01 Bread 7.4    1986-09-01 Brush Strokes 7.8    1979-07-10 Sapphire & Steel 8.0    Match of the Day 2 5.3    1990-09-27 Rab C. Nesbitt 7.1    1981-02-26 Hi-de-Hi! 7.3    1984-03-07 Fresh Fields 7.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Action & Adventure Crime Drama Keywords great britain partnership police procedural ci5 sas Content Score 100 Yes! Looking good! Top Contributors 25 Elizabeth Jennings 22 Crip K 17 Karlosd3 15 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}