{"link": "https://www.themoviedb.org/tv/36536?language=en", "title": "Black Widow", "resume": "Carmen, the daughter of a notorious Amsterdam drug lord, reluctantly takes charge of the family's smuggling business in order to clear her husband's debts.", "rate": 82, "genre": ["Crime", "Drama"], "cast": ["Monic Hendrickx", "Sigrid ten Napel", "Stijn Taverne", "Niels Gomperts", "Loek Peters"], "character": ["Carmen van Walraven-de Rue", "Natalie van Walraven", "Boris van Walraven", "Lucien van Walraven", "Berry Reitens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36536   Expand Black Widow   (2010) User Score  Play Trailer Overview Carmen, the daughter of a notorious Amsterdam drug lord, reluctantly takes charge of the family's smuggling business in order to clear her husband's debts. Featured Crew Diederik Van Rooijen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Monic Hendrickx Carmen van Walraven-de Rue Sigrid ten Napel Natalie van Walraven Stijn Taverne Boris van Walraven Niels Gomperts Lucien van Walraven Loek Peters Berry Reitens Full Cast & Crew Last Season Season 5 2017 | 10 Episodes Season 5 of Black Widow premiered on August 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Black Widow. You can help by rating TV shows you've seen. Facts Original Name  Penoza Status  Ended Networks Certification 12 Meaning Take care with children under 12. Type  Scripted Original Language  Dutch; Flemish Runtime  50m Homepage   http://penoza.kro.nl/ Genres Crime Drama Keywords mobster organized crime mafia family criminal organization Content Score 100 Yes! Looking good! Top Contributors J 46 Jordi0686 44 BudsieBuds 7 42 7Bee-NL e 38 exepti0n  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}