{"link": "https://www.themoviedb.org/tv/2235?language=en", "title": "Goof Troop", "resume": "Disney's Goof Troop is an Animated Comedy television series from The Walt Disney Company featuring Goofy as a father figure and bonding with his son Max, and Pete, as his neighbor. Created by Peter Montgomery, the main series of 65 episodes ran in syndication from 1992 to 1993 on The Disney Afternoon, while an additional thirteen episodes ran on Saturday mornings on ABC. One Christmas special was also produced, which ran in syndication.", "rate": 65, "genre": ["Animation"], "cast": ["Nancy Cartwright", "Dana Hill", "Bill Farmer", "April Winchell", "Jim Cummings"], "character": ["Pistol Pete", "Peg Pete", "Pete"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2235   Expand Goof Troop   (1992) User Score Overview Disney's Goof Troop is an Animated Comedy television series from The Walt Disney Company featuring Goofy as a father figure and bonding with his son Max, and Pete, as his neighbor. Created by Peter Montgomery, the main series of 65 episodes ran in syndication from 1992 to 1993 on The Disney Afternoon, while an additional thirteen episodes ran on Saturday mornings on ABC. One Christmas special was also produced, which ran in syndication. Featured Crew Robert Taylor Creator Karen Peterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nancy Cartwright Pistol Pete Dana Hill Bill Farmer April Winchell Peg Pete Jim Cummings Pete Full Cast & Crew Last Season Season 2 1992 | 14 Episodes Season 2 of Goof Troop premiered on September 12, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   1996-09-02 Quack Pack 6.9    1991-09-07 Taz-Mania 6.3    1991-09-08 Darkwing Duck 7.3    1990-09-14 Tiny Toon Adventures 7.3    1995-09-08 Timon & Pumbaa 5.7    1994-09-05 Aladdin 6.2    1992-07-25 TaleSpin 7.3    1990-09-10 Captain Planet and the Planeteers 5.9  Facts Status  Ended Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  23m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 10 BlackDelivery P 9 Prototyp206 a 5 adltata C 5 Chrisch  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}