{"link": "https://www.themoviedb.org/tv/60904?language=en", "title": "TripTank", "resume": "TripTank is Comedy Central’s newest animated experience, executive produced by ShadowMachine’s Alex Bulkley and Corey Campodonico. The weekly, eight-episode half-hour series, showcases a wide range of fast-paced, hard-hitting animated comedy shorts presented in an anthology style, weaving together stand-alone and recurring narrative pieces.", "rate": 46, "genre": ["Animation", "Comedy"], "cast": ["Eric Magnussen", "Dana Snyder", "Jonah Ray"], "character": ["Roy", "Dana", "Steve"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60904   Expand TripTank   (2014) User Score Overview TripTank is Comedy Central’s newest animated experience, executive produced by ShadowMachine’s Alex Bulkley and Corey Campodonico. The weekly, eight-episode half-hour series, showcases a wide range of fast-paced, hard-hitting animated comedy shorts presented in an anthology style, weaving together stand-alone and recurring narrative pieces. Featured Crew Matt Mariska Creator Andy Sipes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Magnussen Roy Dana Snyder Dana Jonah Ray Steve Full Cast & Crew Last Season Season 2 2015 | 20 Episodes Season 2 of TripTank premiered on September 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2012-01-19 Unsupervised 6.6    1994-12-19 The Head 7.3    2015-08-24 We Bare Bears 7.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://cc.com/shows/triptank Genres Animation Comedy Keywords satire sketch comedy Content Score 64 We're so close, yet so far. Top Contributors 12 Banana 10 BudsieBuds 5 OmgImAlexis z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}