{"link": "https://www.themoviedb.org/tv/4716?language=en", "title": "Digging for the Truth", "resume": "Digging for the Truth was a History Channel television series. The first three seasons of the show focused on host Josh Bernstein, who journeyed on various explorations of historical icons and mysteries. Bernstein is the president and CEO of BOSS and has a degree in anthropology and psychology from Cornell University. The show airs every Monday night at 9:00 EST on the History Channel. The series premiered in January, 2005 and has since become the highest-rated series in the history of The History Channel, which was surprising given the previous show \"Time Titans\" from the production crew never made it past the pilot. The third season premiered on January 22, 2007, with a 2-hour special event on the quest for Atlantis.\nBernstein announced on February 20, 2007, that he would be leaving The History Channel and Digging for the Truth, and would, as of April, join The Discovery Channel as an executive producer and host of a new prime-time series and specials. Hunter Ellis, host of Tactical to Practical and Man, Moment, Machine for The History Channel, then replaced Josh Bernstein as host.", "rate": 93, "genre": ["Documentary"], "cast": ["Josh Bernstein", "Hunter Ellis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4716   Expand Digging for the Truth   (2005) User Score  Play Trailer Overview Digging for the Truth was a History Channel television series. The first three seasons of the show focused on host Josh Bernstein, who journeyed on various explorations of historical icons and mysteries. Bernstein is the president and CEO of BOSS and has a degree in anthropology and psychology from Cornell University. The show airs every Monday night at 9:00 EST on the History Channel. The series premiered in January, 2005 and has since become the highest-rated series in the history of The History Channel, which was surprising given the previous show \"Time Titans\" from the production crew never made it past the pilot. The third season premiered on January 22, 2007, with a 2-hour special event on the quest for Atlantis. Bernstein announced on February 20, 2007, that he would be leaving The History Channel and Digging for the Truth, and would, as of April, join The Discovery Channel as an executive producer and host of a new prime-time series and specials. Hunter Ellis, host of Tactical to Practical and Man, Moment, Machine for The History Channel, then replaced Josh Bernstein as host. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Bernstein Hunter Ellis Full Cast & Crew Last Season Season 4 2007 | 8 Episodes Season 4 of Digging for the Truth premiered on September  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Digging for the Truth. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.history.com/minisites/diggingforthetruth/ Genres Documentary Keywords history mystery Content Score 64 We're so close, yet so far. Top Contributors 19 waaw 5 jmbrunod TB 2 TMDb Bot 1 amian123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}