{"link": "https://www.themoviedb.org/tv/76796?language=en", "title": "Collateral", "resume": "When a pizza delivery driver is shot dead in south London, a tenacious detective goes after the people traffickers behind his murder and unravels a conspiracy that goes to the top.", "rate": 57, "genre": ["Drama", "Crime", "Mystery"], "cast": ["Carey Mulligan", "Billie Piper", "Jeany Spark", "John Simm", "Nathaniel Martello-White"], "character": ["DI Kip Glaspie", "Karen Mars", "Sandrine Shaw", "David Mars", "Nathan Bilk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76796   Expand Collateral   (2018) User Score  Play Trailer Overview When a pizza delivery driver is shot dead in south London, a tenacious detective goes after the people traffickers behind his murder and unravels a conspiracy that goes to the top. Featured Crew David Hare Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carey Mulligan DI Kip Glaspie Billie Piper Karen Mars Jeany Spark Sandrine Shaw John Simm David Mars Nathaniel Martello-White Nathan Bilk Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of Collateral premiered on February 12, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply SB Blatant agenda pushing (character spoilers) Open 4 by  Strange Bedfellows Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  7 Recommendations   2017-11-02 Borderliner 6.7    2017-09-25 Alias Grace 7.5    2018-05-04 The Rain 6.1  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b09s7hcl Genres Drama Crime Mystery Keywords conspiracy murder investigation Content Score 100 Yes! Looking good! Top Contributors 54 Elizabeth Jennings 18 midnightmark 11 EveDemocracy 8 Lewis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}