{"link": "https://www.themoviedb.org/tv/320?language=en", "title": "Fear Factor", "resume": "Fear Factor is an American sports stunt/dare reality game show. It originally aired between 2001 and 2006, when it was canceled. It was later revived in 2011, only to be cancelled again on May 13, 2012. After its second cancellation, a two-part special aired in July 2012. The original Dutch version was called Now or Neverland. When Endemol USA and NBC adapted it to the American market in 2001, they changed the name to Fear Factor. The show pits contestants against each other in a variety of stunts for a grand prize, usually of US $50,000. From Seasons One to Five, the contestants were generally three men and three women, all competing for themselves, but in Season Six, the show moved to a permanent format of four teams of two people, each with a pre-existing relationship with one another. The show was hosted by comedian and UFC commentator Joe Rogan, executive produced by Matt Kunitz and David A. Hurwitz and directed by J. Rupert Thompson.", "rate": 46, "genre": ["Reality"], "cast": ["Joe Rogan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 320   Expand Fear Factor   (2001) User Score  Play Trailer Overview Fear Factor is an American sports stunt/dare reality game show. It originally aired between 2001 and 2006, when it was canceled. It was later revived in 2011, only to be cancelled again on May 13, 2012. After its second cancellation, a two-part special aired in July 2012. The original Dutch version was called Now or Neverland. When Endemol USA and NBC adapted it to the American market in 2001, they changed the name to Fear Factor. The show pits contestants against each other in a variety of stunts for a grand prize, usually of US $50,000. From Seasons One to Five, the contestants were generally three men and three women, all competing for themselves, but in Season Six, the show moved to a permanent format of four teams of two people, each with a pre-existing relationship with one another. The show was hosted by comedian and UFC commentator Joe Rogan, executive produced by Matt Kunitz and David A. Hurwitz and directed by J. Rupert Thompson. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Rogan Full Cast & Crew Last Season Season 7 2011 | 9 Episodes Season 7 of Fear Factor premiered on December 12, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fear Factor. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2005-12-05 Cash Cab 7.7    1968-09-14 The Adventures of Batman 7.4    2009-09-21 Accidentally on Purpose 4.8    2004-12-18 W.I.T.C.H. 6.6    1985-09-24 Growing Pains 6.1    2008-12-03 Man v. Food 6.7    1987-01-20 Unsolved Mysteries 7.4    1995-05-28 Dr. Katz, Professional Therapist 7.6  Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.fearfactorcasting.com/ Genres Reality Keywords stunt fear fear factor Content Score 64 We're so close, yet so far. Top Contributors 14 Banana z 4 zurman1 5 4 5lucina5 e 2 elianastev  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}