{"link": "https://www.themoviedb.org/tv/661?language=en", "title": "The Young Indiana Jones Chronicles", "resume": "The Young Indiana Jones Chronicles is an American television series that aired on ABC from March 4, 1992, to July 24, 1993. Filming took place in various locations around Wilmington, North Carolina and on the campus of UNCW. The series was an Amblin Entertainment/Lucasfilm production in association with Paramount Network Television.\nThe series explores the childhood and youth of the fictional character Indiana Jones and primarily stars Sean Patrick Flanery and Corey Carrier as the title character, with George Hall playing an elderly version of Jones for the bookends of most episodes, though Harrison Ford bookended one episode. The show was created and executively produced by George Lucas, who also created, co-wrote and executively produced the Indiana Jones feature films.\nDue to its enormous budget, the series was cancelled in 1993. However, following the series' cancellation, four made-for-television films were produced from 1994 to 1996 in an attempt to continue the series. In 1999, the series was re-edited into 22 television films under the title The Adventures of Young Indiana Jones.", "rate": 63, "genre": ["Action", "Adventure", "Drama"], "cast": ["Sean Patrick Flanery", "Corey Carrier", "Lloyd Owen", "Ruth de Sosa", "George Hall"], "character": ["Henry \"Indiana\" Jones, Jr.", "Young Indiana Jones", "Professor Henry Jones, Sr.", "Anna Jones", "Old Indiana Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 661   Expand The Young Indiana Jones Chronicles   (1992) User Score Overview The Young Indiana Jones Chronicles is an American television series that aired on ABC from March 4, 1992, to July 24, 1993. Filming took place in various locations around Wilmington, North Carolina and on the campus of UNCW. The series was an Amblin Entertainment/Lucasfilm production in association with Paramount Network Television. The series explores the childhood and youth of the fictional character Indiana Jones and primarily stars Sean Patrick Flanery and Corey Carrier as the title character, with George Hall playing an elderly version of Jones for the bookends of most episodes, though Harrison Ford bookended one episode. The show was created and executively produced by George Lucas, who also created, co-wrote and executively produced the Indiana Jones feature films. Due to its enormous budget, the series was cancelled in 1993. However, following the series' cancellation, four made-for-television films were produced from 1994 to 1996 in an attempt to continue the series. In 1999, the series was re-edited into 22 television films under the title The Adventures of Young Indiana Jones. Featured Crew George Lucas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sean Patrick Flanery Henry \"Indiana\" Jones, Jr. Corey Carrier Young Indiana Jones Lloyd Owen Professor Henry Jones, Sr. Ruth de Sosa Anna Jones George Hall Old Indiana Jones Full Cast & Crew Last Season Season 3 1995 | 8 Episodes Season 3 of The Young Indiana Jones Chronicles premiered on January 15, 1995. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Young Indiana Jones Chronicles. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1993-01-20 Time Trax 6.6    2001-03-04 The Lone Gunmen 6.9    1984-05-06 V: The Final Battle 7.3    1990-07-12 Northern Exposure 8.1    1993-09-21 NYPD Blue 6.5    1962-02-23 Benny Hill 8.3    1978-03-10 The Incredible Hulk 6.4    1986-03-25 Perfect Strangers 6.6  Facts Status  Cancelled Networks Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.youngindy.com/ Genres Action & Adventure Drama Keywords history prequel based on movie indiana jones treasure hunter Content Score 93 Almost there... Top Contributors b 20 bmorr72 11 Banana d 9 denis p 6 pepitopajas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}