{"link": "https://www.themoviedb.org/tv/69555?language=en", "title": "Workin' Moms", "resume": "Four women juggle love, careers, and parenthood. They support, challenge, and try not to judge each other as life throws them curveballs. Whether it is an identity crisis, a huge job opportunity, postpartum depression, or an unplanned pregnancy – they face both the good and bad with grace and humour.", "rate": 55, "genre": ["Comedy"], "cast": ["Katherine Barrell", "Dani Kind", "Jessalyn Wanlim", "Novie Edwards"], "character": ["Alicia Rutherford", "Anne", "Jenny Matthews", "Sheila"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69555   Expand Workin' Moms   (2017) User Score  Play Trailer Overview Four women juggle love, careers, and parenthood. They support, challenge, and try not to judge each other as life throws them curveballs. Whether it is an identity crisis, a huge job opportunity, postpartum depression, or an unplanned pregnancy – they face both the good and bad with grace and humour. Featured Crew Catherine Reitman Creator Philip Sternberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine Barrell Alicia Rutherford Dani Kind Anne Jessalyn Wanlim Jenny Matthews Novie Edwards Sheila Full Cast & Crew Current Season Season 2 2018 | 13 Episodes Season 2 of Workin' Moms premiered on January  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Workin' Moms. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cbc.ca/workinmoms/ Genres Comedy Keywords job parenthood Content Score 100 Yes! Looking good! Top Contributors z 22 zyck 9 marxc88 6 szab 6 Marco  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}