{"link": "https://www.themoviedb.org/tv/367?language=en", "title": "Klovn", "resume": "Klovn is a Danish sitcom, which first aired on the Danish TV channel TV2 Zulu. It focuses on the life of the main character Frank and Casper. The show builds its comedy around quiet everyday situations, social awkwardness, uncomfortable silences and general faux pas.\nKlovn shares many concepts with the American sitcom Curb Your Enthusiasm by Larry David, notably the main concept of a semi-retired comedian encountering humorous and embarrassing situations, along with his wife, friends and celebrity acquaintances. The show is also held in a pseudo-realistic style, where a first-time viewer might be in doubt of whether or not the show is staged. Even the score is similar. In spite of this, in its closing credits, the show is claimed to be an original idea by Casper Christensen and Frank Hvam.\nThe sitcom consists of 60 episodes spread over 6 seasons, each episode lasting 25 minutes. The sixth season, which is said to be the last, aired between 23 February and 27 April 2009.\nOn 16 December 2010 Klown, a movie based on the series, with an original plotline, was released.", "rate": 78, "genre": ["Comedy"], "cast": ["Frank Hvam", "Casper Christensen", "Mia Lyhne", "Iben Hjejle", "Claire Ross-Brown"], "character": ["Frank", "Casper", "Mia", "Iben", "Claire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 367   Expand Klovn   (2005) User Score Overview Klovn is a Danish sitcom, which first aired on the Danish TV channel TV2 Zulu. It focuses on the life of the main character Frank and Casper. The show builds its comedy around quiet everyday situations, social awkwardness, uncomfortable silences and general faux pas. Klovn shares many concepts with the American sitcom Curb Your Enthusiasm by Larry David, notably the main concept of a semi-retired comedian encountering humorous and embarrassing situations, along with his wife, friends and celebrity acquaintances. The show is also held in a pseudo-realistic style, where a first-time viewer might be in doubt of whether or not the show is staged. Even the score is similar. In spite of this, in its closing credits, the show is claimed to be an original idea by Casper Christensen and Frank Hvam. The sitcom consists of 60 episodes spread over 6 seasons, each episode lasting 25 minutes. The sixth season, which is said to be the last, aired between 23 February and 27 April 2009. On 16 December 2010 Klown, a movie based on the series, with an original plotline, was released. Featured Crew Casper Christensen Creator Frank Hvam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Hvam Frank Casper Christensen Casper Mia Lyhne Mia Iben Hjejle Iben Claire Ross-Brown Claire Full Cast & Crew Last Season Season 6 2009 | 10 Episodes Season 6 of Klovn premiered on February 23, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2001-07-09 The Office 8.1    2012-04-22 Veep 7.2    2001-06-03 Six Feet Under 8.2    2003-11-02 Arrested Development 8.2    2005-03-24 The Office 8.0    2013-07-11 Orange Is the New Black 7.4    1990-04-08 Twin Peaks 8.1    2014-04-15 Fargo 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://zulu.tv2.dk/klovn/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 d00ziie 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}