{"link": "https://www.themoviedb.org/tv/46671?language=en", "title": "The Future Diary", "resume": "Yukiteru Amano (Yuki) is a loner who never really interact with people and prefers writing a diary on his cell phone with his only companion being an imaginary friend named Deus Ex Machina, the God of Time and Space. However, Yuki soon learns that Deus is not a figment of his imagination but real when Deus makes him a participant in a battle royale with eleven others. Within this \"Diary Game\", the contestants are given special diaries that can predict the future with each diary having unique features that gives them both advantages and disadvantages.", "rate": 68, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Eri Sendai", "Akira Ishida", "Minoru Shiraishi", "Asami Sanada", "Masahiko Tanaka"], "character": ["Tsubaki Kasugano", "Aru Akise", "Oji Kosaka", "Reisuke Hojo", "Keigo Kurusu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46671   Expand The Future Diary   (2011) User Score  Play Trailer Overview Yukiteru Amano (Yuki) is a loner who never really interact with people and prefers writing a diary on his cell phone with his only companion being an imaginary friend named Deus Ex Machina, the God of Time and Space. However, Yuki soon learns that Deus is not a figment of his imagination but real when Deus makes him a participant in a battle royale with eleven others. Within this \"Diary Game\", the contestants are given special diaries that can predict the future with each diary having unique features that gives them both advantages and disadvantages. Featured Crew Sakae Esuno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  24 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eri Sendai Tsubaki Kasugano Akira Ishida Aru Akise Minoru Shiraishi Oji Kosaka Asami Sanada Reisuke Hojo Masahiko Tanaka Keigo Kurusu Full Cast & Crew Last Season Season 1 2011 | 26 Episodes Season 1 of The Future Diary premiered on October  9, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Future Diary. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  24 Posters  3 Recommendations   2011-04-16 Deadman Wonderland 7.1    2014-07-06 Akame ga Kill! 7.0    2015-07-05 Charlotte 6.8    2015-01-10 Death Parade 7.3    2015-07-12 God Eater 6.4    2012-01-10 Another 7.2    2016-04-09 Tanaka-kun is Always Listless 8.0    2014-07-03 Tokyo Ghoul 7.2  Facts Original Name  未来日記 Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.future-diary.tv/ Genres Action & Adventure Animation Drama Keywords obsession based on manga anime Content Score 100 Yes! Looking good! Top Contributors 16 camil2312 13 sp1ti p 12 psy4trik 9 Derians  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}