{"link": "https://www.themoviedb.org/tv/30877?language=en", "title": "Brigada", "resume": "Brigada, also known as Law of the Lawless, is a Russian 15-episode crime mini-series that debuted in 2002. It became very popular, but received mixed reviews due to accusations in aestheticization of violence. The miniseries follows the story of four best friends from 1989 to 2000, mainly concentrating on the leader of the group, Sasha Belov.", "rate": 74, "genre": ["Action", "Adventure", "Drama", "Crime"], "cast": ["Sergei Bezrukov", "Dmitriy Dyuzhev", "Vladimir Vdovichenkov", "Pavel Maykov", "Andrei Panin"], "character": ["Александр Белов (Саша Белый)", "Kholmogorov Cosmos (Cosmos)", "Валерий Филатов (Фил)", "Виктор Пчёлкин (Пчёла)", "Владимир Каверин"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30877   Expand Brigada   (2002) User Score Overview Brigada, also known as Law of the Lawless, is a Russian 15-episode crime mini-series that debuted in 2002. It became very popular, but received mixed reviews due to accusations in aestheticization of violence. The miniseries follows the story of four best friends from 1989 to 2000, mainly concentrating on the leader of the group, Sasha Belov. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sergei Bezrukov Александр Белов (Саша Белый) Dmitriy Dyuzhev Kholmogorov Cosmos (Cosmos) Vladimir Vdovichenkov Валерий Филатов (Фил) Pavel Maykov Виктор Пчёлкин (Пчёла) Andrei Panin Владимир Каверин Full Cast & Crew Last Season Season 1 2002 | 15 Episodes Season 1 of Brigada premiered on September 23, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  6 Recommendations   2007-08-03 Masters of Science Fiction 6.2    1973-08-11 Seventeen Moments of Spring 7.5    1969-01-01 Nu, pogodi! 6.8  Facts Original Name  Бригада Status  Ended Network Certification 18+ Meaning Restricted to People 18 or Older. Type  Scripted Original Language  Russian Runtime  52m Homepage   http://russia.tv/brand/show/brand_id/22965/ Genres Action & Adventure Drama Crime Keywords criminal Content Score 93 Almost there... Top Contributors 27 West@ 13 Elizabeth Jennings 9 Atanas 9 Fludogenerator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}