{"link": "https://www.themoviedb.org/tv/3091?language=en", "title": "Family Affairs", "resume": "Family Affairs is a British soap opera that was aired on Channel 5. First broadcast on 30 March 1997, there were five, thirty-minute episodes shown per week. It did not gain high ratings. Subsequently producers rejuvenated the cast, the style and changed the fictional location. On 2 August 2005, Channel 5 announced they would not renew Family Affairs. Production ceased on 4 November, and the final episode was broadcast on 30 December 2005. The series was shot on video to give a film look. In 1999 and 2004, single episodes switches to standard video presentation were carried out. Producer Sean O'Connor implemented the format from September 2005 until the final episode.", "rate": 0, "genre": ["Drama", "Soap"], "cast": ["Rocky Marshall", "Liz Crowther", "Richard Hawley", "Florence Hoath", "Nicola Duffett"], "character": ["Duncan Hart", "Annie Hart", "Dave Matthews", "Cat MacKenzie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3091   Expand Family Affairs   (1997) User Score Overview Family Affairs is a British soap opera that was aired on Channel 5. First broadcast on 30 March 1997, there were five, thirty-minute episodes shown per week. It did not gain high ratings. Subsequently producers rejuvenated the cast, the style and changed the fictional location. On 2 August 2005, Channel 5 announced they would not renew Family Affairs. Production ceased on 4 November, and the final episode was broadcast on 30 December 2005. The series was shot on video to give a film look. In 1999 and 2004, single episodes switches to standard video presentation were carried out. Producer Sean O'Connor implemented the format from September 2005 until the final episode. Featured Crew Mal Young Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rocky Marshall Duncan Hart Liz Crowther Annie Hart Richard Hawley Dave Matthews Florence Hoath Nicola Duffett Cat MacKenzie Full Cast & Crew Last Season Season 9 2005 | 258 Episodes Season 9 of Family Affairs premiered on January  3, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Family Affairs. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Family Affairs. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Soap Keywords london england soap opera Content Score 79 Pump it up! We're close now. Top Contributors 8 lineker 7 Banana 1 MrRadical a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}