{"link": "https://www.themoviedb.org/tv/2443?language=en", "title": "Buck Rogers in the 25th Century", "resume": "Buck Rogers in the 25th Century is an American science fiction adventure television series produced by Universal Studios. The series ran for two seasons between 1979–1981, and the feature-length pilot episode for the series was released as a theatrical film several months before the series aired. The film and series were developed by Glen A. Larson and Leslie Stevens, based upon the character Buck Rogers created in 1928 by Philip Francis Nowlan that had previously been featured in comic strips, novellas, a serial film, and on television and radio.", "rate": 72, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Gil Gerard", "Erin Gray", "Mel Blanc", "Tim O'Connor", "William Conrad"], "character": ["Buck Rogers", "Wilma Deering"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2443   Expand Buck Rogers in the 25th Century   (1979) User Score  Play Trailer Overview Buck Rogers in the 25th Century is an American science fiction adventure television series produced by Universal Studios. The series ran for two seasons between 1979–1981, and the feature-length pilot episode for the series was released as a theatrical film several months before the series aired. The film and series were developed by Glen A. Larson and Leslie Stevens, based upon the character Buck Rogers created in 1928 by Philip Francis Nowlan that had previously been featured in comic strips, novellas, a serial film, and on television and radio. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  1 Images Backdrops  10 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gil Gerard Buck Rogers Erin Gray Wilma Deering Mel Blanc Tim O'Connor William Conrad Full Cast & Crew Last Season Season 2 1981 | 13 Episodes Season 2 of Buck Rogers in the 25th Century premiered on January 15, 1981. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply The GREATEST censor ownage in the history of tv Open 0 by rooprect\n      \n     third  season Open 1 by  thomasguide2 M Bidi bidi bidi bidi Open 4 by  Moonglum9 Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  5 Recommendations   1964-09-14 Voyage to the Bottom of the Sea 7.4    1974-01-18 The Six Million Dollar Man 6.6    1982-03-13 T. J. Hooker 6.1    1976-01-14 The Bionic Woman 6.2    1978-09-17 Battlestar Galactica 6.9    1973-10-24 Kojak 7.4    1976-10-03 Quincy, M.E. 7.0    1966-09-12 The Monkees 6.3  Facts Status  Ended Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  89m Homepage  - Genres Sci-Fi & Fantasy Keywords future Content Score 100 Yes! Looking good! Top Contributors 19 SuperMario M 12 Michael 11 Banana 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}