{"link": "https://www.themoviedb.org/tv/54866?language=en", "title": "Nowhere Boys", "resume": "Four teenage boys get lost in the forest and discover, when they return home, that they are in an alternate world identical to theirs except for one startling difference - they were never born.", "rate": 69, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Kamil Ellis", "Joe Klocek", "Jordie Race-Coldrey", "Luca Sardelis", "William McKenna"], "character": ["Luke", "Heath", "Jesse", "Nicco", "Ben"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54866   Expand Nowhere Boys   (2013) User Score  Play Trailer Overview Four teenage boys get lost in the forest and discover, when they return home, that they are in an alternate world identical to theirs except for one startling difference - they were never born. Featured Crew Tony Ayres Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kamil Ellis Luke Joe Klocek Heath Jordie Race-Coldrey Jesse Luca Sardelis Nicco William McKenna Ben Full Cast & Crew Last Season Series 3 2016 | 13 Episodes Season 3 of Nowhere Boys premiered on November 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2014-08-23 Intruders 6.5    2010-07-11 The Glades 6.3    2012-09-25 The Mindy Project 5.6    2016-06-01 Cleverman 5.7    2016-03-07 Damien 6.5    2015-09-30 Code Black 7.0    2012-01-08 House of Lies 6.4    2016-01-26 Outsiders 6.7  Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/abc3/games/nowhereboys/ Genres Action & Adventure Sci-Fi & Fantasy Keywords australia magic mystery teenager teenage boy parallel world lost alternate reality Content Score 100 Yes! Looking good! Top Contributors 64 United600 22 Elizabeth Jennings 22 Banana 10 MattCK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}