{"link": "https://www.themoviedb.org/tv/60808?language=en", "title": "No Game, No Life", "resume": "Genius gamer siblings (plus being NEET & hikikomori) Sora and Shiro are known as the undefeatable “__” (blank). Their talents and skills are so good they are considered as urban legend. One day, a young boy named Tet appears before them, claiming to be the “God” of another dimension where Sora and Shiro are summoned to, in which no violence is allowed and everything is decided by a game. Of the 16 different races residing in this world, “Humanity” is the weakest. After having the vast majority of their lands captured by the other races and being driven to the brink of extinction, Sora and Shiro challenge these one-of-a-kind battles of the intellectual powers in order to save Humanity.", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Yoshitsugu Matsuoka", "Kayano Ai", "Youko Hikasa", "Yuka Iguchi", "Jun Fukushima"], "character": ["Sora", "Shiro", "Stephanie Dola", "Clammy Zell", "Ex-King"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60808   Expand No Game, No Life   (2014) User Score Overview Genius gamer siblings (plus being NEET & hikikomori) Sora and Shiro are known as the undefeatable “__” (blank). Their talents and skills are so good they are considered as urban legend. One day, a young boy named Tet appears before them, claiming to be the “God” of another dimension where Sora and Shiro are summoned to, in which no violence is allowed and everything is decided by a game. Of the 16 different races residing in this world, “Humanity” is the weakest. After having the vast majority of their lands captured by the other races and being driven to the brink of extinction, Sora and Shiro challenge these one-of-a-kind battles of the intellectual powers in order to save Humanity. Featured Crew Atsuko Ishizuka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshitsugu Matsuoka Sora Kayano Ai Shiro Youko Hikasa Stephanie Dola Yuka Iguchi Clammy Zell Jun Fukushima Ex-King Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of No Game, No Life premiered on April  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2012-10-04 BTOOOM! 6.3    2012-10-04 Love, Chunibyo & Other Delusions 7.6    2014-10-07 Yona of the Dawn 7.5    2015-10-03 Chivalry of a Failed Knight 7.9    2014-01-05 Noragami 7.4    2015-07-05 Charlotte 6.8    2013-07-08 Blood Lad 6.8    2014-10-08 Parasyte -the maxim- 7.5  Facts Original Name  ノーゲーム･ノーライフ Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://ngnl.jp/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords fantasy games strategy Content Score 93 Almost there... Top Contributors 29 Elizabeth Jennings 27 benf45 11 TripleZGamer 10 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}