{"link": "https://www.themoviedb.org/tv/59117?language=en", "title": "Yukon Men", "resume": "Yukon Men is an unscripted American cable television series aired on the Discovery Channel. It is produced by Paper Route Productions.\nThe series details the harsh life in the Alaskan village of Tanana where the population make their living by hunting and trapping game. It premiered on August 24, 2012. The show's prominent themes are community and survival. The television show is named after the nearby Yukon river and not the Yukon territory in Canada.", "rate": 55, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59117   Expand Yukon Men   (2012) User Score Overview Yukon Men is an unscripted American cable television series aired on the Discovery Channel. It is produced by Paper Route Productions. The series details the harsh life in the Alaskan village of Tanana where the population make their living by hunting and trapping game. It premiered on August 24, 2012. The show's prominent themes are community and survival. The television show is named after the nearby Yukon river and not the Yukon territory in Canada. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2017 | 9 Episodes Season 6 of Yukon Men premiered on April 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yukon Men. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.discovery.com/tv-shows/yukon-men Genres Reality Keywords yukon Content Score 56 We're so close, yet so far. Top Contributors 26 Elizabeth Jennings H 3 HBO J 3 JLL e 2 empud  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}