{"link": "https://www.themoviedb.org/tv/39497?language=en", "title": "Transporter: The Series", "resume": "Transporter: The Series is an English-language French-Canadian action-adventure television series, spun off from the Transporter film series created by Luc Besson and Robert Mark Kamen. It is co-produced by the French Atlantique Productions and the Canadian boutique entertainment company QVF Inc. in association with broadcast partners M6, RTL, The Movie Network, Movie Central and HBO/Cinemax.\nThe series follows the events and concept of the film trilogy, continuing adventures of Frank Martin, a professional freelance courier driver for hire who will deliver anything, anywhere – no questions asked – for the right price, and lives by three \"unbreakable\" rules, which he constantly breaks. Chris Vance takes over the role of Frank from Jason Statham and is joined by Andrea Osvárt, who plays the leading female role in the series, starring as a former CIA agent and love interest for Frank, who organizes his missions, and François Berléand, the only returning actor from the film series, who reprises his role as Inspector Tarconi.\nTwelve episodes were ordered for 2012 with an overall budget of $40,000,000, or €30.000.000. The show premiered that year on October 11 in Germany on RTL, and on December 6 in France on M6. The Canadian premiere was on January 4, 2013 on HBO Canada and Super Écran 1. The broadcast started in India on 25th January 2013 on Sony PIX channel.", "rate": 59, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Chris Vance", "Violante Placido", "François Berléand"], "character": ["Frank Martin", "Caterina Boldieu", "Inspector Tarconi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39497   Expand Transporter: The Series   (2012) User Score  Play Trailer Overview Transporter: The Series is an English-language French-Canadian action-adventure television series, spun off from the Transporter film series created by Luc Besson and Robert Mark Kamen. It is co-produced by the French Atlantique Productions and the Canadian boutique entertainment company QVF Inc. in association with broadcast partners M6, RTL, The Movie Network, Movie Central and HBO/Cinemax. The series follows the events and concept of the film trilogy, continuing adventures of Frank Martin, a professional freelance courier driver for hire who will deliver anything, anywhere – no questions asked – for the right price, and lives by three \"unbreakable\" rules, which he constantly breaks. Chris Vance takes over the role of Frank from Jason Statham and is joined by Andrea Osvárt, who plays the leading female role in the series, starring as a former CIA agent and love interest for Frank, who organizes his missions, and François Berléand, the only returning actor from the film series, who reprises his role as Inspector Tarconi. Twelve episodes were ordered for 2012 with an overall budget of $40,000,000, or €30.000.000. The show premiered that year on October 11 in Germany on RTL, and on December 6 in France on M6. The Canadian premiere was on January 4, 2013 on HBO Canada and Super Écran 1. The broadcast started in India on 25th January 2013 on Sony PIX channel. Featured Crew Luc Besson Creator Robert Mark Kamen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Vance Frank Martin Violante Placido Caterina Boldieu François Berléand Inspector Tarconi Full Cast & Crew Last Season Season 2 2014 | 12 Episodes Season 2 of Transporter: The Series premiered on October  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  6 Recommendations   2003-07-06 Pasión de gavilanes 5.6    2012-10-20 Outback Truckers 7.0    2011-03-07 Crematorio 7.7    2010-07-11 The Glades 6.3    2008-07-11 Flashpoint 6.6    2012-09-27 Last Resort 6.8    2010-01-06 Republic of Doyle 7.3    2006-07-23 Fallen 5.6  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Italian Runtime  45m Homepage   http://www.themovienetwork.ca/transporter Genres Action & Adventure Crime Drama Keywords transporter vigilante security ex military Content Score 71 Just a little bit more... Top Contributors 14 Elizabeth Jennings 11 Philippe LeMarchand M 9 Megacine M 8 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}