{"link": "https://www.themoviedb.org/tv/13220?language=en", "title": "Play School", "resume": "Play School is an Australian Gold Logie award winning educational television show for children produced by the Australian Broadcasting Corporation and then Southern Star Entertainment in 2014. It is the longest-running children's show in Australia, and the second longest running children's show in the world.  \nIn 2016, Play School celebrated 50 years on the air.  An estimated 80% of pre-school children under six watch the programme at least once a week. \nIt is screened twice every weekday afternoon at 3:05 pm on ABC1 every day 9:30 am and weekday 4:30 pm on ABC2's ABC4 Kids.", "rate": 50, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13220   Expand Play School   (1966) User Score Overview Play School is an Australian Gold Logie award winning educational television show for children produced by the Australian Broadcasting Corporation and then Southern Star Entertainment in 2014. It is the longest-running children's show in Australia, and the second longest running children's show in the world.   In 2016, Play School celebrated 50 years on the air.  An estimated 80% of pre-school children under six watch the programme at least once a week.  It is screened twice every weekday afternoon at 3:05 pm on ABC1 every day 9:30 am and weekday 4:30 pm on ABC2's ABC4 Kids. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Create, Code, Go! 2017 | 5 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Play School. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Play School. You can help by rating TV shows you've seen. Facts Status  In Production Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.abc.net.au/abcforkids/sites/playschool/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 140 martybarlow 6 sykobanana 6 Danwagz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}