{"link": "https://www.themoviedb.org/tv/63915?language=en", "title": "The Adventures of Sherlock Holmes and Dr. Watson", "resume": "The Adventures of Sherlock Holmes and Dr. Watson is a series of five films produced by Lenfilm for the Soviet Central Television, split into eleven episodes, starring Vasily Livanov as Sherlock Holmes and Vitaly Solomin as Dr. Watson. They were directed by Igor Maslennikov and filmed in Russia (the then Soviet Union) between 1979 and 1986, and the series was one of the most successful in the history of Russian television.", "rate": 85, "genre": ["Action", "Adventure", "Mystery", "Drama"], "cast": ["Vasiliy Livanov", "Vitali Solomin", "Rina Zelyonaya", "Boris Klyuev", "Borislav Brondukov"], "character": ["Sherlock Holmes", "Dr. Watson", "Mrs. Hudson", "Mycroft Holmes", "Inspector Lestrade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63915   Expand The Adventures of Sherlock Holmes and Dr. Watson   (1979) User Score Overview The Adventures of Sherlock Holmes and Dr. Watson is a series of five films produced by Lenfilm for the Soviet Central Television, split into eleven episodes, starring Vasily Livanov as Sherlock Holmes and Vitaly Solomin as Dr. Watson. They were directed by Igor Maslennikov and filmed in Russia (the then Soviet Union) between 1979 and 1986, and the series was one of the most successful in the history of Russian television. Featured Crew Valeri Frid Creator Yuli Dunsky Creator Vladimir Valutskiy Creator Igor Maslennikov Creator Yuri Veksler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vasiliy Livanov Sherlock Holmes Vitali Solomin Dr. Watson Rina Zelyonaya Mrs. Hudson Boris Klyuev Mycroft Holmes Borislav Brondukov Inspector Lestrade Full Cast & Crew Last Season Season 5 1986 | 2 Episodes Season 5 of The Adventures of Sherlock Holmes and Dr. Watson premiered on March 12, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Sherlock Holmes and Dr. Watson. You can help by rating TV shows you've seen. Facts Original Name  Приключения Шерлока Холмса и доктора Ватсона Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Miniseries Original Language  Russian Runtime  70m Homepage  - Genres Action & Adventure Mystery Drama Keywords detective adventure sherlock holmes crime Content Score 100 Yes! Looking good! Top Contributors 93 Fludogenerator 56 zoroman2008N z 10 zurman1 8 gromo3eka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}