{"link": "https://www.themoviedb.org/tv/70215?language=en", "title": "The White Princess", "resume": "The story of Elizabeth of York, the White Queen's daughter, and her marriage to the Lancaster victor, Henry VII. Based on the Philippa Gregory book of the same name.", "rate": 81, "genre": ["Drama"], "cast": ["Jodie Comer", "Jacob Collins-Levy", "Rebecca Benson", "Kenneth Cranham", "Rossy de Palma"], "character": ["Princess Elizabeth", "Henry VII", "Margaret Plantagenet", "Cardinal Morton", "Isabella I of Castile"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70215   Expand The White Princess   (2017) User Score  Play Trailer Overview The story of Elizabeth of York, the White Queen's daughter, and her marriage to the Lancaster victor, Henry VII. Based on the Philippa Gregory book of the same name. Featured Crew Jamie Payne Creator Alex Kalymnios Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jodie Comer Princess Elizabeth Jacob Collins-Levy Henry VII Rebecca Benson Margaret Plantagenet Kenneth Cranham Cardinal Morton Rossy de Palma Isabella I of Castile Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of The White Princess premiered on April 16, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Margaret Plantagenet..... Open 0 by sheezcrazy\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  5 Recommendations   2017-06-11 The Loch 5.9    2017-01-09 Pure 6.6    2017-03-22 Shots Fired 6.0    2015-01-21 Wolf Hall 7.8    2016-10-16 Graves 5.4    2013-04-03 Rogue 7.1    2016-08-28 Victoria 6.5    2014-10-06 Grantchester 7.3  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   https://www.starz.com/series/thewhiteprincess Genres Drama Keywords princess england monarchy miniseries palace intrigue historical drama costume drama 15th century british royal family Content Score 100 Yes! Looking good! Top Contributors 80 Elizabeth Jennings TB 28 TMDb Bot 7 david8s95 s 6 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}