{"link": "https://www.themoviedb.org/tv/110?language=en", "title": "Less than Perfect", "resume": "Claude Casey moved up in the secretarial world of television news, from temp to the anchor's desk. After her boss hires her full time, Claude realizes she may be in over her head in this world of assistants fighting to get ahead. But Claude is determined to prove that though she may not be perfect, she's not going down without a fight.", "rate": 71, "genre": ["Comedy"], "cast": ["Sara Rue", "Zachary Levi", "Andrea Parker", "Andy Dick", "Sherri Shepherd"], "character": ["Claude Casey", "Kipp Steadman", "Lydia Weston", "Owen Kronsky", "Ramona Platt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 110   Expand Less than Perfect   (2002) User Score Overview Claude Casey moved up in the secretarial world of television news, from temp to the anchor's desk. After her boss hires her full time, Claude realizes she may be in over her head in this world of assistants fighting to get ahead. But Claude is determined to prove that though she may not be perfect, she's not going down without a fight. Featured Crew Terri Minsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sara Rue Claude Casey Zachary Levi Kipp Steadman Andrea Parker Lydia Weston Andy Dick Owen Kronsky Sherri Shepherd Ramona Platt Full Cast & Crew Last Season Season 4 2006 | 13 Episodes Season 4 of Less than Perfect premiered on April 18, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2011-02-10 Mad Dogs 7.3    2012-01-08 House of Lies 6.4    2009-09-23 Cougar Town 5.8    2012-08-08 Go On 6.2    2016-02-26 Fuller House 5.6  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage   http://abc.go.com/shows/less-than-perfect Genres Comedy Keywords television sitcom workplace comedy Content Score 93 Almost there... Top Contributors 6 Banana k 5 khedron s 3 speedycars S 3 SergeiAK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}