{"link": "https://www.themoviedb.org/tv/2995?language=en", "title": "MXC", "resume": "MXC is an American comedy television program that aired on Spike TV from 2003 to 2007. It is a re-edit of footage from the Japanese game show Takeshi's Castle which originally aired in Japan from 1986 to 1990. The re-edit created a new completely rewritten storyline, and new characters as a dub was added that centered on the game show hosts narrating the action as people tried to win points for their teams by surviving through different challenges. In the original program Takeshi's Castle, the characters Kenny and Vic are actually a count named Takeshi and his assistant creating challenges in order to fight off an opposing military leader and his troops.\nMXC was created and produced by RC Entertainment, Inc. in Los Angeles, California, and is the property of both Tokyo Broadcasting System and RC Entertainment. The special episode Almost Live is the property of Viacom International, which was filmed in the United States by the producers of MXC. In addition to this, MXC's distributor is Magnolia Home Entertainment.\nFor the first two seasons, MXC was an initialism for the show's former title: Most Extreme Elimination Challenge. Early commercials in 2003 promoted the show as just Most Extreme Elimination with the initials MXE.", "rate": 69, "genre": ["Comedy"], "cast": ["Mary Scheer", "Takeshi Kitano", "John Cervenka", "Sonemanma Higashi", "Christopher Darga"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2995   Expand MXC   (2003) User Score Overview MXC is an American comedy television program that aired on Spike TV from 2003 to 2007. It is a re-edit of footage from the Japanese game show Takeshi's Castle which originally aired in Japan from 1986 to 1990. The re-edit created a new completely rewritten storyline, and new characters as a dub was added that centered on the game show hosts narrating the action as people tried to win points for their teams by surviving through different challenges. In the original program Takeshi's Castle, the characters Kenny and Vic are actually a count named Takeshi and his assistant creating challenges in order to fight off an opposing military leader and his troops. MXC was created and produced by RC Entertainment, Inc. in Los Angeles, California, and is the property of both Tokyo Broadcasting System and RC Entertainment. The special episode Almost Live is the property of Viacom International, which was filmed in the United States by the producers of MXC. In addition to this, MXC's distributor is Magnolia Home Entertainment. For the first two seasons, MXC was an initialism for the show's former title: Most Extreme Elimination Challenge. Early commercials in 2003 promoted the show as just Most Extreme Elimination with the initials MXE. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Scheer Takeshi Kitano John Cervenka Sonemanma Higashi Christopher Darga Full Cast & Crew Last Season Season 5 2006 | 14 Episodes Season 5 of MXC premiered on November  9, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2000-01-14 Trigger Happy TV 7.3    2004-11-14 Tom Goes to the Mayor 7.2    1990-04-15 In Living Color 7.5    1995-10-14 MADtv 5.7    1982-02-01 Late Night with David Letterman 7.2    1995-11-03 Mr. Show with Bob and David 8.1    1993-09-13 Late Night with Conan O'Brien 7.3    1998-05-14 Celebrity Deathmatch 6.7  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.ifilm.com/show/21908 Genres Comedy Keywords game show Content Score 86 Almost there... Top Contributors 11 Banana 2 TheOneManBoxOffice 1 codenewfie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}