{"link": "https://www.themoviedb.org/tv/76061?language=en", "title": "Basilisk: The Ouka Ninja Scrolls", "resume": "The battle for succession that continued for three generations of shogun in the Keichou era culminated in a gruesome battle of ninja arts between the Kouga and Iga clans. Amidst a rain of flower petals, a man and woman who had decided to live for love were separated once again, beautiful in their transience. However, it is said that by the hand of Hattori Hanzo's adopted son, Kyouhachirou, these two flower petals, whether temporarily or permanently, were given life again and left two mementos behind. These children, born with a destiny of their own, were called Kouga Hachirou and Iga Hibiki. The former had eyes like his father's, and the latter had eyes like her mother's. It is now the Kan'ei era, and the land is at peace. As ninjas begin to disappear into the shadows after being deemed unnecessary, The Kouga and Iga clans ask a favor of Hachirou and Hibiki in hopes of reinforcing their foundations.", "rate": 33, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76061   Expand Basilisk: The Ouka Ninja Scrolls   (2018) User Score Overview The battle for succession that continued for three generations of shogun in the Keichou era culminated in a gruesome battle of ninja arts between the Kouga and Iga clans. Amidst a rain of flower petals, a man and woman who had decided to live for love were separated once again, beautiful in their transience. However, it is said that by the hand of Hattori Hanzo's adopted son, Kyouhachirou, these two flower petals, whether temporarily or permanently, were given life again and left two mementos behind. These children, born with a destiny of their own, were called Kouga Hachirou and Iga Hibiki. The former had eyes like his father's, and the latter had eyes like her mother's. It is now the Kan'ei era, and the land is at peace. As ninjas begin to disappear into the shadows after being deemed unnecessary, The Kouga and Iga clans ask a favor of Hachirou and Hibiki in hopes of reinforcing their foundations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 24 Episodes Season 1 of Basilisk: The Ouka Ninja Scrolls premiered on January  9, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Basilisk: The Ouka Ninja Scrolls. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Basilisk: The Ouka Ninja Scrolls. You can help by rating TV shows you've seen. Facts Original Name  バジリスク ～桜花忍法帖～ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://basilisk-ouka.jp/ Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords history seinen Content Score 56 We're so close, yet so far. Top Contributors D 11 Destr0y 8 sekaidown04 7 karaa 6 Iuri3D  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}