{"link": "https://www.themoviedb.org/tv/6323?language=en", "title": "Monsters", "resume": "Monsters is a syndicated horror anthology series which originally ran from 1988 to 1991 and reran on the Sci-Fi Channel during the 1990s. As of 2011, Monsters airs on NBC Universal's horror/suspense-themed cable channel Chiller in sporadic weekday marathons.\nIn a similar vein to Tales from the Darkside, Monsters shared the same producer, and in some ways succeeded the show. It differed in some respects nonetheless. While Tales sometimes dabbled in stories of science fiction and fantasy, this series was more strictly horror. As the name implies, each episode of Monsters featured a different monster which the story concerned, from the animatronic puppet of a fictional children's television program to mutated, weapon-wielding lab rats.\nSimilar to Tales, however, the stories in Monsters were rarely very straightforward action plots and often contained some ironic twist in which a character's conceit or greed would do him in, often with gruesome results. Adding to this was a sense of comedy often lost on horror productions which might in some instances lighten the audience's mood but in many cases added to the overall eeriness of the production.", "rate": 74, "genre": ["Mystery", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Kevin Nealon", "Wil Wheaton", "Jerry Stiller", "James Morrison", "Amy Stiller"], "character": ["Louis", "Kevin", "Victor", "Steven Rose, Ph.D.", "Anya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6323   Expand Monsters   (1988) User Score Overview Monsters is a syndicated horror anthology series which originally ran from 1988 to 1991 and reran on the Sci-Fi Channel during the 1990s. As of 2011, Monsters airs on NBC Universal's horror/suspense-themed cable channel Chiller in sporadic weekday marathons. In a similar vein to Tales from the Darkside, Monsters shared the same producer, and in some ways succeeded the show. It differed in some respects nonetheless. While Tales sometimes dabbled in stories of science fiction and fantasy, this series was more strictly horror. As the name implies, each episode of Monsters featured a different monster which the story concerned, from the animatronic puppet of a fictional children's television program to mutated, weapon-wielding lab rats. Similar to Tales, however, the stories in Monsters were rarely very straightforward action plots and often contained some ironic twist in which a character's conceit or greed would do him in, often with gruesome results. Adding to this was a sense of comedy often lost on horror productions which might in some instances lighten the audience's mood but in many cases added to the overall eeriness of the production. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Nealon Louis Wil Wheaton Kevin Jerry Stiller Victor James Morrison Steven Rose, Ph.D. Amy Stiller Anya Full Cast & Crew Last Season Season 3 1990 | 24 Episodes Season 3 of Monsters premiered on September 30, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1984-09-30 Tales from the Darkside 7.0  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Mystery Sci-Fi & Fantasy Drama Keywords horror anthology Content Score 86 Almost there... Top Contributors T 4 TwelveVacancies 3 Banana M 3 Magicus 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}