{"link": "https://www.themoviedb.org/tv/21720?language=en", "title": "House of Cards", "resume": "Charming chief whip Frances Urquhart plots revenge against his colleagues.", "rate": 84, "genre": ["Drama", "War", "Politics"], "cast": ["Ian Richardson", "Susannah Harker", "Malcolm Tierney", "Alphonsia Emmanuel", "Diane Fletcher"], "character": ["Francis Urquhart", "Mattie Storin", "Patrick Woolton", "Penny Guy", "Elizabeth Urquhart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21720   Expand House of Cards   (1990) User Score Overview Charming chief whip Frances Urquhart plots revenge against his colleagues. Featured Crew Andrew Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Richardson Francis Urquhart Susannah Harker Mattie Storin Malcolm Tierney Patrick Woolton Alphonsia Emmanuel Penny Guy Diane Fletcher Elizabeth Urquhart Full Cast & Crew Last Season House of Cards 1990 | 4 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for House of Cards. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  8 Recommendations   1993-11-21 To Play the King 8.6    1967-07-08 Callan 6.0    1992-02-23 So Haunt Me 6.0    1967-09-29 The Prisoner 7.6    1985-11-04 Edge of Darkness 8.4    1984-04-28 Robin of Sherwood 7.9    1998-11-09 Big Train 7.5    1984-02-26 Spitting Image 7.8  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b0082dzs Genres Drama War & Politics Keywords miniseries Content Score 93 Almost there... Top Contributors 24 Elizabeth Jennings 18 Banana 17 Marcus N 7 Noloter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}