{"link": "https://www.themoviedb.org/tv/34722?language=en", "title": "Angelic Layer", "resume": "12-year-old Misaki Suzuhara has just gotten involved in Angelic  Layer, a battling game using electronic dolls called angels. Even as a  newbie, Misaki shows advanced skills as she meets new friends and enters  Angelic Layer tournaments to fight the greatest Angelic Layer champions  of the nation.", "rate": 75, "genre": ["Drama", "Animation", "Comedy", "Action", "Adventure"], "cast": ["Ayako Kawasumi", "Chiemi Chiba", "Kikuko Inoue", "Houko Kuwashima", "Jun Fukuyama"], "character": ["Kaede Saito", "Arisu Fujisaki", "Shuko Suzuhara", "Sai Jounouchi", "Kotaro Kobayashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34722   Expand Angelic Layer   (2001) User Score Overview 12-year-old Misaki Suzuhara has just gotten involved in Angelic  Layer, a battling game using electronic dolls called angels. Even as a  newbie, Misaki shows advanced skills as she meets new friends and enters  Angelic Layer tournaments to fight the greatest Angelic Layer champions  of the nation. Featured Crew Satsuki Igarashi Creator Nanase Ohkawa Creator Mokona Apapa Creator Tsubaki Nekoi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayako Kawasumi Kaede Saito Chiemi Chiba Arisu Fujisaki Kikuko Inoue Shuko Suzuhara Houko Kuwashima Sai Jounouchi Jun Fukuyama Kotaro Kobayashi Full Cast & Crew Last Season Angelic Layer 2001 | 26 Episodes Season 1 of Angelic Layer premiered on April  1, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Angelic Layer. You can help by rating TV shows you've seen. Facts Original Name  機動天使エンジェリックレイヤー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Drama Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 20 tmdb983464 11 BrerFox 8 alexboom31 5 jcdarkbr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}