{"link": "https://www.themoviedb.org/tv/6964?language=en", "title": "Galileo", "resume": "Galileo is a Japanese television drama based on Detective Galileo, a novel by mystery writer Keigo Higashino. It narrates the events and cases encountered by Kaoru Utsumi, a rookie detective, and Manabu Yukawa, a university associate professor, while the two pair up to solve many mysterious cases. Galileo SP was aired on October 4, 2008 on the same day as the release of the film The Devotion of Suspect X.\nA second series began airing on Fuji TV on April 15, 2013. The second movie, titled Midsummer's Equation, premiered in both Japan and Hong Kong on June 29, 2013.", "rate": 78, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Kou Shibasaki", "Masaharu Fukuyama", "Yu Sawabe", "Kazuki Kitamura", "Ikkei Watanabe"], "character": ["Kaoru Utsumi", "Yukawa Manabu", "Otagawa Minoru", "Shunpei Kusanagi", "Hiromi Kuribayashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6964   Expand Galileo   (2007) User Score Overview Galileo is a Japanese television drama based on Detective Galileo, a novel by mystery writer Keigo Higashino. It narrates the events and cases encountered by Kaoru Utsumi, a rookie detective, and Manabu Yukawa, a university associate professor, while the two pair up to solve many mysterious cases. Galileo SP was aired on October 4, 2008 on the same day as the release of the film The Devotion of Suspect X. A second series began airing on Fuji TV on April 15, 2013. The second movie, titled Midsummer's Equation, premiered in both Japan and Hong Kong on June 29, 2013. Featured Crew Hiroshi Nishitani Creator Takeshi Narita Creator Kensaku Sawada Creator Mizuki Nishisaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kou Shibasaki Kaoru Utsumi Masaharu Fukuyama Yukawa Manabu Yu Sawabe Otagawa Minoru Kazuki Kitamura Shunpei Kusanagi Ikkei Watanabe Hiromi Kuribayashi Full Cast & Crew Last Season Season 2 2013 | 12 Episodes Season 2 of Galileo premiered on April 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Galileo. You can help by rating TV shows you've seen. Facts Original Name  ガリレオ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://wwwz.fujitv.co.jp/galileo Genres Comedy Drama Mystery Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 22 Kyuhwan Kim A 18 Aka75 15 kappa-papa z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}