{"link": "https://www.themoviedb.org/tv/88?language=en", "title": "As Time Goes By", "resume": "Two lovers are reunited after decades apart following a mutual misunderstanding.", "rate": 80, "genre": ["Comedy"], "cast": ["Judi Dench", "Philip Bretherton", "Geoffrey Palmer", "Jenny Funnell", "Moira Brooker"], "character": ["Jean Pargetter", "Alistair Deacon", "Lionel Hardcastle", "Sandy", "Judith \"Judy\" Hanson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 88   Expand As Time Goes By   (1992) User Score Overview Two lovers are reunited after decades apart following a mutual misunderstanding. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Judi Dench Jean Pargetter Philip Bretherton Alistair Deacon Geoffrey Palmer Lionel Hardcastle Jenny Funnell Sandy Moira Brooker Judith \"Judy\" Hanson Full Cast & Crew Last Season (uk) season 10 2005 | 1 Episode Season 10 of As Time Goes By premiered on December 26, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1996-09-19 Suddenly Susan 4.9    1978-09-24 Lillie 8.7    1965-09-01 Gidget 5.2    1982-03-23 Joanie Loves Chachi 2.4    1979-09-13 Benson 7.2    1981-01-16 Harper Valley 4.7    1994-03-29 Ellen 6.2    1970-09-17 The Flip Wilson Show 3.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://bbc.co.uk/programmes/b007nmzp Genres Comedy Keywords ex-lover misunderstanding second chance elderly middle age sitcom british humour missed opportunity Content Score 86 Almost there... Top Contributors 16 Banana 15 revengine O 3 Ozbourne 3 Luke  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}