{"link": "https://www.themoviedb.org/tv/2156?language=en", "title": "The Tyra Banks Show", "resume": "The Tyra Banks Show, also known as and shortened to Tyra or The Tyra Show, is an American talk show hosted by Tyra Banks. The last new episode aired on Friday, May 28, 2010. The show featured many special guest stars which include Mike Epps, Cheryl Tiegs, Miley Cyrus, LL Cool J, Rihanna, Michael Rapaport, and Robbi Morgan.", "rate": 32, "genre": ["Talk"], "cast": ["Tyra Banks"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2156   Expand The Tyra Banks Show   (2005) User Score Overview The Tyra Banks Show, also known as and shortened to Tyra or The Tyra Show, is an American talk show hosted by Tyra Banks. The last new episode aired on Friday, May 28, 2010. The show featured many special guest stars which include Mike Epps, Cheryl Tiegs, Miley Cyrus, LL Cool J, Rihanna, Michael Rapaport, and Robbi Morgan. Featured Crew Tyra Banks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tyra Banks Full Cast & Crew Last Season Season 4 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2003-12-03 Extreme Makeover: Home Edition 4.6    The Oprah Winfrey Show 4.1    1991-09-30 The Jerry Springer Show 3.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tyrashow.com Genres Talk Keywords talk show Content Score 64 We're so close, yet so far. Top Contributors 3 Banana D 2 Daniel 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}