{"link": "https://www.themoviedb.org/tv/72736?language=en", "title": "Frankie Drake Mysteries", "resume": "Toronto’s only female private detective in the 1920s takes on the cases the police don’t want or can’t handle. From airplanes and booze running to American G-men, Communists and union busters, Frankie’s fearless sense of adventure gets her into all kinds of trouble, but she always manages to find her way out.", "rate": 80, "genre": ["Drama"], "cast": ["Lauren Lee Smith", "Rebecca Liddiard", "Chantel Riley", "Sharron Matthews", "Grace Lynn Kung"], "character": ["Frankie Drake", "Mary Shaw", "Trudy Clarke", "Flo", "Whiskey Wendy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72736   Expand Frankie Drake Mysteries   (2017) User Score  Play Trailer Overview Toronto’s only female private detective in the 1920s takes on the cases the police don’t want or can’t handle. From airplanes and booze running to American G-men, Communists and union busters, Frankie’s fearless sense of adventure gets her into all kinds of trouble, but she always manages to find her way out. Featured Crew Carol Hay Creator Michelle Ricci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lauren Lee Smith Frankie Drake Rebecca Liddiard Mary Shaw Chantel Riley Trudy Clarke Sharron Matthews Flo Grace Lynn Kung Whiskey Wendy Full Cast & Crew Current Season Season 1 2017 | 11 Episodes Season 1 of Frankie Drake Mysteries premiered on November  6, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply b Anybody watching Open 0 by bgirlmagic\n      \n     t murdoch mysteries? Open 3 by  tmdb89189586 Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Frankie Drake Mysteries. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   http://www.cbc.ca/frankiedrake/ Genres Drama Keywords private detective female detective 1920s Content Score 100 Yes! Looking good! Top Contributors 36 Elizabeth Jennings t 21 tmdb21435511 t 6 tmdb42368388 5 Maretoh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}