{"link": "https://www.themoviedb.org/tv/9410?language=en", "title": "Basilisk", "resume": "The story takes place in the year 1614. Two ninja clans, Tsubagakure of the Iga and Manjidani of Kouga, battle each other to determine which grandson of Tokugawa Ieyasu will become the next shogun. The deadly competition between 10 elite ninja from each clan unleashes a centuries-old hatred that threatens to destroy all hope for peace between them.", "rate": 79, "genre": ["War", "Politics", "Action", "Adventure", "Animation", "Drama", "Crime"], "cast": ["Nana Mizuki", "Risa Hayamizu", "Kohsuke Toriumi", "Yasushi Miyabayashi", "Sho Hayami"], "character": ["Oboro Iga", "Kagerou", "Gennosuke Kouga", "Narrator", "Yakushiji Tenzen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9410   Expand Basilisk   (2005) User Score  Play Trailer Overview The story takes place in the year 1614. Two ninja clans, Tsubagakure of the Iga and Manjidani of Kouga, battle each other to determine which grandson of Tokugawa Ieyasu will become the next shogun. The deadly competition between 10 elite ninja from each clan unleashes a centuries-old hatred that threatens to destroy all hope for peace between them. Featured Crew Futaro Yamada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nana Mizuki Oboro Iga Risa Hayamizu Kagerou Kohsuke Toriumi Gennosuke Kouga Yasushi Miyabayashi Narrator Sho Hayami Yakushiji Tenzen Full Cast & Crew Last Season Basilisk 2005 | 24 Episodes Season 1 of Basilisk premiered on April 12, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations   2013-10-04 Kill la Kill 7.7    2001-10-10 Hellsing 7.2    1998-04-02 TRIGUN 7.7  Facts Original Name  バジリスク甲賀忍法帖 Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.basilisk.jp Genres War & Politics Action & Adventure Animation Drama Crime Keywords ninja fighter ninja female ninja ninja warrior anime Content Score 100 Yes! Looking good! Top Contributors 60 Micael Lopes M 18 Migi 10 sp1ti n 9 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}