{"link": "https://www.themoviedb.org/tv/66761?language=en", "title": "Medici: Masters of Florence", "resume": "The story of the Medici family of Florence, their ascent from simple merchants to power brokers sparking an economic and cultural revolution. Along the way, they also accrue a long list of powerful enemies.", "rate": 80, "genre": ["Drama", "War", "Politics"], "cast": ["Richard Madden", "Dustin Hoffman", "Guido Caprino", "Stuart Martin", "Tatjana Nardone"], "character": ["Cosimo de' Medici", "Giovanni de' Medici", "Marco Bello", "Lorenzo de' Medici", "Emilia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66761   Expand Medici: Masters of Florence   (2016) User Score Overview The story of the Medici family of Florence, their ascent from simple merchants to power brokers sparking an economic and cultural revolution. Along the way, they also accrue a long list of powerful enemies. Featured Crew Frank Spotnitz Creator Nicholas Meyer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Madden Cosimo de' Medici Dustin Hoffman Giovanni de' Medici Guido Caprino Marco Bello Stuart Martin Lorenzo de' Medici Tatjana Nardone Emilia Full Cast & Crew Last Season Original Air Date Original Air Date . (Absolute) Season 1 2016 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply the music and the voices Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations   2015-06-01 American Genius 7.0    2016-08-28 Victoria 6.5    2016-11-04 The Crown 8.1    2007-09-28 Moonlight 7.1    2013-10-25 Dracula 5.9    2003-10-30 Tru Calling 6.9    2007-04-01 The Tudors 7.5    2013-04-12 Da Vinci's Demons 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.raiplay.it/programmi/imedici/ Genres Drama War & Politics Keywords florence history art political intrigue  historical drama tuscany italian renaissance Content Score 100 Yes! Looking good! Top Contributors C 70 Cataloguer 39 Elizabeth Jennings 28 bstarko z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}