{"link": "https://www.themoviedb.org/tv/64365?language=en", "title": "DC Super Hero Girls", "resume": "At Super Hero High, iconic Super Heroes like Wonder Woman, Supergirl, Batgirl, Harley Quinn, Bumblebee, Poison Ivy, and Katana navigate all the twists and turns of high school. United by friendship, the DC Super Hero Girls empower kids to shine with confidence and courage, especially while they combat those overwhelming, exciting, and awesomely awkward moments of growing up (sometimes super powers can be super stressful!).", "rate": 75, "genre": ["Animation"], "cast": ["Grey DeLisle", "Tara Strong", "Teala Dunn", "Anais Fairweather", "Stephanie Sheh"], "character": ["Wonder Woman (voice)", "Harley Quinn / Poison Ivy (voice)", "Bumblebee (voice)", "Supergirl (voice)", "Katana (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64365   Expand DC Super Hero Girls   (2015) User Score Overview At Super Hero High, iconic Super Heroes like Wonder Woman, Supergirl, Batgirl, Harley Quinn, Bumblebee, Poison Ivy, and Katana navigate all the twists and turns of high school. United by friendship, the DC Super Hero Girls empower kids to shine with confidence and courage, especially while they combat those overwhelming, exciting, and awesomely awkward moments of growing up (sometimes super powers can be super stressful!). Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Grey DeLisle Wonder Woman (voice) Tara Strong Harley Quinn / Poison Ivy (voice) Teala Dunn Bumblebee (voice) Anais Fairweather Supergirl (voice) Stephanie Sheh Katana (voice) Full Cast & Crew Current Season Season 4 2018 | 8 Episodes Season 4 of DC Super Hero Girls premiered on January 18, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply d Harley Quinn Open 1 by  Halberstram Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on DC Super Hero Girls. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  3m Homepage   http://www.dcsuperherogirls.com/ Genres Animation Keywords dc comics superhero superheroine teen superhero Content Score 86 Almost there... Top Contributors R 18 Rebecca 8 Elizabeth Jennings s 7 sashimi 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}