{"link": "https://www.themoviedb.org/tv/66862?language=en", "title": "Showa and Genroku Era Lover's Suicide Through Rakugo", "resume": "When a certain man is released from prison, he knows exactly where he's heading first. After falling in love with a traditional comic storyteller's rendition of the story called \"Shinigami,\" he is determined to become his apprentice. The performer, Yakumo, has never taken an apprentice before, but to everyone's surprise, he accepts the eager ex-prisoner, nicknaming him \"Yotaro.\" As Yotaro happily begins his new life, he meets others in Yakumo's life, including Yakumo's ward Konatsu. Konatsu was the daughter of a famous storyteller, and Yakumo took her in after her father's tragic death. Konatsu loved her father's storytelling, and would love to become a performer in her own right—but that path is not available for women.", "rate": 82, "genre": ["Animation", "Drama"], "cast": ["Megumi Hayashibara", "Yu Kobayashi", "Akira Ishida", "Sanae Kobayashi", "Kouichi Yamadera"], "character": ["Miyokichi", "Konatsu", "Yakumo Yuurakutei", "Yakumo Yuurakutei", "Sukeroku Yuurakutei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66862   Expand Showa and Genroku Era Lover's Suicide Through Rakugo   (2016) User Score Overview When a certain man is released from prison, he knows exactly where he's heading first. After falling in love with a traditional comic storyteller's rendition of the story called \"Shinigami,\" he is determined to become his apprentice. The performer, Yakumo, has never taken an apprentice before, but to everyone's surprise, he accepts the eager ex-prisoner, nicknaming him \"Yotaro.\" As Yotaro happily begins his new life, he meets others in Yakumo's life, including Yakumo's ward Konatsu. Konatsu was the daughter of a famous storyteller, and Yakumo took her in after her father's tragic death. Konatsu loved her father's storytelling, and would love to become a performer in her own right—but that path is not available for women. Featured Crew Mamoru Hatakeyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Hayashibara Miyokichi Yu Kobayashi Konatsu Akira Ishida Yakumo Yuurakutei Sanae Kobayashi Yakumo Yuurakutei Kouichi Yamadera Sukeroku Yuurakutei Full Cast & Crew Last Season Descending Stories: Showa Genroku Rakugo Shinju 2017 | 12 Episodes Season 2 of Showa and Genroku Era Lover's Suicide Through Rakugo premiered on January  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2016-10-09 Poco's Udon World 8.3    2016-10-14 Fune wo Amu 7.5    2016-04-09 Tanaka-kun is Always Listless 8.0    2012-01-10 Daily Lives of High School Boys 7.3    2015-10-03 K-Project 6.3    2016-04-10 Flying Witch 6.5    2016-07-02 ReLIFE 7.0    2014-04-06 Haikyu!! 8.3  Facts Original Name  昭和元禄落語心中 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  26m Homepage   http://www.rakugo-shinju-anime.jp/ Genres Animation Drama Keywords based on manga rakugo anime itan Content Score 93 Almost there... Top Contributors s 22 sashimi C 17 Chintaran 16 sp1ti 13 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}