{"link": "https://www.themoviedb.org/tv/40244?language=en", "title": "The Client List", "resume": "Riley Parks delicately balances two starkly different lives -- one as a single mom in a conservative town struggling to provide for her family and the other as a savvy and ambitious businesswoman working with a rowdy, sexy and unpredictable group of women.", "rate": 54, "genre": ["Drama"], "cast": ["Jennifer Love Hewitt", "Loretta Devine", "Colin Egglesfield", "Rebecca Field", "Alicia Lagano"], "character": ["Riley Parks", "Georgia Cummings", "Evan Parks", "Lacey Jean", "Selena Ramos"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40244   Expand The Client List   (2012) User Score  Play Trailer Overview Riley Parks delicately balances two starkly different lives -- one as a single mom in a conservative town struggling to provide for her family and the other as a savvy and ambitious businesswoman working with a rowdy, sexy and unpredictable group of women. Featured Crew Suzanne Martin Creator Jordan Budde Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Love Hewitt Riley Parks Loretta Devine Georgia Cummings Colin Egglesfield Evan Parks Rebecca Field Lacey Jean Alicia Lagano Selena Ramos Full Cast & Crew Last Season Season 2 2013 | 15 Episodes Season 2 of The Client List premiered on March 10, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  7 Recommendations   2014-06-29 Reckless 5.5    2014-04-20 Filthy Riches 6.7    2015-08-23 Noble, My Love 7.4    2007-05-17 Embarrassing Bodies 6.8    2011-10-09 Brain Games 7.6    2013-01-07 Dicte 7.3    2012-10-20 Outback Truckers 7.0    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  40m Homepage   http://www.mylifetime.com/shows/the-client-list Genres Drama Keywords parent child relationship single mother massage therapist Content Score 100 Yes! Looking good! Top Contributors 113 Marr 🇳🇱 10 Travis Bell 7 flamme-demon b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}