{"link": "https://www.themoviedb.org/tv/16830?language=en", "title": "Hellsing", "resume": "Vampires exist. It is the duty of Hellsing, an organization sponsored by the British government, to hide that frightening fact and protect the blissfully unaware populace. Along with its own personal army, Hellsing also has a few secret weapons. Alucard, an incredibly powerful vampire, has been controlled by Hellsing for years. Although he dislikes being a servant to the Hellsing family, he certainly enjoys his job as Hellsing’s vampire exterminator. Seras is a fledgling vampire and a former police woman. Although reluctant to embrace her new self, she is still a valuable member of the organization. Integra Hellsing, the current leader, is usually fully capable of fulfilling her duty, but lately, vampire activity has been on the rise. Unfortunately, the cause is more alarming than anything she could have imagined...", "rate": 72, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Jouji Nakata", "Fumiko Orikasa", "Yoshiko Sakakibara", "Nachi Nozawa", "Motomu Kiyokawa"], "character": ["Alucard (voice)", "Seras Victoria (voice)", "Integra Fairbrook Wingates Hellsing (voice)", "Alexander Anderson (voice)", "Walter C. Dornez (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16830   Expand Hellsing   (2001) User Score Overview Vampires exist. It is the duty of Hellsing, an organization sponsored by the British government, to hide that frightening fact and protect the blissfully unaware populace. Along with its own personal army, Hellsing also has a few secret weapons. Alucard, an incredibly powerful vampire, has been controlled by Hellsing for years. Although he dislikes being a servant to the Hellsing family, he certainly enjoys his job as Hellsing’s vampire exterminator. Seras is a fledgling vampire and a former police woman. Although reluctant to embrace her new self, she is still a valuable member of the organization. Integra Hellsing, the current leader, is usually fully capable of fulfilling her duty, but lately, vampire activity has been on the rise. Unfortunately, the cause is more alarming than anything she could have imagined... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  12 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jouji Nakata Alucard (voice) Fumiko Orikasa Seras Victoria (voice) Yoshiko Sakakibara Integra Fairbrook Wingates Hellsing (voice) Nachi Nozawa Alexander Anderson (voice) Motomu Kiyokawa Walter C. Dornez (voice) Full Cast & Crew Last Season Season 1 2001 | 13 Episodes Season 1 of Hellsing premiered on October 10, 2001. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Hellsing. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  6 Recommendations   2006-02-10 Hellsing Ultimate 7.7    1995-10-04 Neon Genesis Evangelion 8.0    2004-07-25 Elfen Lied 7.6    2003-10-04 Fullmetal Alchemist 8.0    2004-05-20 Samurai Champloo 8.0    Paradise Kiss 9.0    2002-10-01 Ghost in the Shell: Stand Alone Complex 8.0    1998-04-02 TRIGUN 7.7  Facts Original Name  ヘルシング Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Drama Keywords vampire secret organization based on manga anime young king ours Content Score 86 Almost there... Top Contributors 40 sp1ti 13 Razze CM 11 Cherche Moi J 9 JessicaBeatriz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}