{"link": "https://www.themoviedb.org/tv/1467?language=en", "title": "Ideal", "resume": "Ideal is a British dark comedy sit-com, originally broadcast on digital channel BBC Three, created by Graham Duff and produced by BBC Comedy North and Baby Cow Productions. It stars Johnny Vegas as small-time cannabis dealer Moz.\nIt is set in Salford, Greater Manchester, chosen because Duff was familiar with the area having done many stand-up gigs there during his youth. Most of the series takes place in Moz's flat and revolves around the eclectic array of characters who visit Moz to buy cannabis, socialise or both.\nThe closing theme is \"Song of the Oss\" from the album Nuada: Music Inspired By the Film the Wicker Man composed by British band Candidate. The series also features a number of tracks by Californian hip hop group Ugly Duckling.\nIt was broadcast on BBC Three in the UK, on entertainment channel 3e in Ireland and on ABC2 in Australia.\nFirst broadcast in 2005, seven series have been shown; the most recent ended on 30 June 2011.\nAfter the seventh series aired, Ideal was cancelled by the BBC. Following the announcement, writer and creator Graham Duff wrote to fans: \"As some of you may have heard, the BBC have decided against commissioning an 8th series of Ideal. The reason given was that the new channel controller wanted to make a clean sweep. It is a source of both pride and frustration that, at the point of cancellation, Ideal was attracting its biggest ever audiences, its highest profile guest stars and its best ever reviews. And the show is now being screened in more countries than ever before - from America to Finland and beyond.\" Fans have launched a petition dedicated to saving the show.", "rate": 81, "genre": ["Comedy"], "cast": ["Johnny Vegas", "Graham Duff", "Nicola Reynolds", "Tom Goodman-Hill", "Sinead Matthews"], "character": ["Moz", "Brian", "Nicki", "PC", "Jenny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1467   Expand Ideal   (2005) User Score Overview Ideal is a British dark comedy sit-com, originally broadcast on digital channel BBC Three, created by Graham Duff and produced by BBC Comedy North and Baby Cow Productions. It stars Johnny Vegas as small-time cannabis dealer Moz. It is set in Salford, Greater Manchester, chosen because Duff was familiar with the area having done many stand-up gigs there during his youth. Most of the series takes place in Moz's flat and revolves around the eclectic array of characters who visit Moz to buy cannabis, socialise or both. The closing theme is \"Song of the Oss\" from the album Nuada: Music Inspired By the Film the Wicker Man composed by British band Candidate. The series also features a number of tracks by Californian hip hop group Ugly Duckling. It was broadcast on BBC Three in the UK, on entertainment channel 3e in Ireland and on ABC2 in Australia. First broadcast in 2005, seven series have been shown; the most recent ended on 30 June 2011. After the seventh series aired, Ideal was cancelled by the BBC. Following the announcement, writer and creator Graham Duff wrote to fans: \"As some of you may have heard, the BBC have decided against commissioning an 8th series of Ideal. The reason given was that the new channel controller wanted to make a clean sweep. It is a source of both pride and frustration that, at the point of cancellation, Ideal was attracting its biggest ever audiences, its highest profile guest stars and its best ever reviews. And the show is now being screened in more countries than ever before - from America to Finland and beyond.\" Fans have launched a petition dedicated to saving the show. Featured Crew Graham Duff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johnny Vegas Moz Graham Duff Brian Nicola Reynolds Nicki Tom Goodman-Hill PC Sinead Matthews Jenny Full Cast & Crew Last Season Season 7 2011 | 6 Episodes Season 7 of Ideal premiered on May 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2006-02-27 Snuff Box 8.2    1993-01-20 Time Trax 6.6    2006-09-14 That Mitchell and Webb Look 8.0    2009-11-09 Miranda 7.3    2010-10-01 The Increasingly Poor Decisions of Todd Margaret 7.0    2012-04-12 Derek 7.1    2007-09-26 Dirty Sexy Money 6.0    2004-01-29 Garth Marenghi's Darkplace 7.5  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006w7b3 Genres Comedy Keywords drug dealer northern england flat dark comedy surreal crime united kingdom sitcom manchester trippy Content Score 93 Almost there... Top Contributors 200 Markxist 24 69tunes 13 rudely_murray O 9 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}