{"link": "https://www.themoviedb.org/tv/71569?language=en", "title": "Song of Phoenix", "resume": "There are some relationships that are doomed from the start. During the Warring States period, Qu Yuan is born into a prominent family and grows up to be a prodigy scholar. But Qu Yuan bucks convention when he falls in love with Mo Chou Nu, a slave. Society forbids such class-breaking relationships, so the lovers decide to elope so that they can be together. Despite their efforts to lead a quiet life, Qu Yuan and Chou Nu become entangled in the political struggles of the power elites within the palace. Can their relationship survive the many obstacles?", "rate": 60, "genre": ["Drama"], "cast": ["Ma Ke", "Zhang Xinyu", "Qiao Zhenyu"], "character": ["Qu Yuan", "Mo Chou Nu", "King Huai of Chu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71569   Expand Song of Phoenix   (2017) User Score Overview There are some relationships that are doomed from the start. During the Warring States period, Qu Yuan is born into a prominent family and grows up to be a prodigy scholar. But Qu Yuan bucks convention when he falls in love with Mo Chou Nu, a slave. Society forbids such class-breaking relationships, so the lovers decide to elope so that they can be together. Despite their efforts to lead a quiet life, Qu Yuan and Chou Nu become entangled in the political struggles of the power elites within the palace. Can their relationship survive the many obstacles? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ma Ke Qu Yuan Zhang Xinyu Mo Chou Nu Qiao Zhenyu King Huai of Chu Full Cast & Crew Last Season Season 1 2017 | 70 Episodes Season 1 of Song of Phoenix premiered on April 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Song of Phoenix. You can help by rating TV shows you've seen. Facts Original Name  思美人 Status  Returning Series Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/5738318512?is_hot=1 Genres Drama Keywords china politics romance historical fiction Content Score 56 We're so close, yet so far. Top Contributors M 34 Maria180493 TB 2 TMDb Bot 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}