{"link": "https://www.themoviedb.org/tv/76874?language=en", "title": "Alexa & Katie", "resume": "Lifelong best friends Alexa and Katie are eagerly anticipating the start of their freshman year of high school. The pals confront a crisis that leaves them feeling like outsiders at a time when what seems to matter most is fitting in.", "rate": 70, "genre": ["Comedy"], "cast": ["Paris Berelc", "Isabel May", "Tiffani Thiessen", "Emery Kelly", "Adam Ian Cohen"], "character": ["Alexa Mendoza", "Katie Cooper", "Lori Mendoza", "Lucas Mendoza", "Cameron"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76874   Expand Alexa & Katie   (2018) User Score Overview Lifelong best friends Alexa and Katie are eagerly anticipating the start of their freshman year of high school. The pals confront a crisis that leaves them feeling like outsiders at a time when what seems to matter most is fitting in. Featured Crew Heather Wordham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paris Berelc Alexa Mendoza Isabel May Katie Cooper Tiffani Thiessen Lori Mendoza Emery Kelly Lucas Mendoza Adam Ian Cohen Cameron Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Alexa & Katie premiered on March 23, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Alexa & Katie. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  25m Homepage   https://www.netflix.com/title/80174285 Genres Comedy Keywords cancer girls Content Score 100 Yes! Looking good! Top Contributors 24 DarkMan 21 Elizabeth Jennings Y 6 YJ m 4 michl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}