{"link": "https://www.themoviedb.org/tv/21641?language=en", "title": "Good Luck Charlie", "resume": "Good Luck Charlie is an American television sitcom, which premiered on April 4, 2010, on Disney Channel. The series was created by Phil Baker and Drew Vaupen, who wanted to create a program that would appeal to entire families, as opposed to only children. It focuses on a Denver family, the Duncans, as they try to adjust to the births of their fourth and fifth children, Charlotte \"Charlie\" Duncan and Toby Duncan. In each episode, Teddy Duncan creates a video diary containing advice for Charlie about their family and life as a teenager. Teddy tries to show Charlie what she might go through when she is older in the video diaries for future reference. Each video diary ends with Teddy saying the eponymous phrase, \"Good luck, Charlie\".\nAmong other decisions, executives included adult-centric scenes and changed the series title from Oops to Love, Teddy and finally to Good Luck Charlie in order to ensure the series would appeal to all family members. Good Luck Charlie premiered on Disney Channel in the United States on April 4, 2010. It premiered in Canada on April 5, 2010, the United Kingdom and Ireland on May 14, 2010, and in Australia and New Zealand on July 23, 2010. Good Luck Charlie was renewed for a second season, with production beginning in August 2010 with a season premiere on February 20, 2011. A feature-length Christmas Disney Channel Original Movie based on the series entitled Good Luck Charlie, It's Christmas! began production in March 2011 for a December 2011 premiere.", "rate": 61, "genre": ["Comedy"], "cast": ["Bridgit Mendler", "Mia Talerico", "Leigh-Allyn Baker", "Eric Allan Kramer", "Bradley Steven Perry"], "character": ["Teddy Duncan", "Charlie Duncan", "Amy Duncan", "Bob Duncan", "Gabe Duncan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21641   Expand Good Luck Charlie   (2010) User Score Overview Good Luck Charlie is an American television sitcom, which premiered on April 4, 2010, on Disney Channel. The series was created by Phil Baker and Drew Vaupen, who wanted to create a program that would appeal to entire families, as opposed to only children. It focuses on a Denver family, the Duncans, as they try to adjust to the births of their fourth and fifth children, Charlotte \"Charlie\" Duncan and Toby Duncan. In each episode, Teddy Duncan creates a video diary containing advice for Charlie about their family and life as a teenager. Teddy tries to show Charlie what she might go through when she is older in the video diaries for future reference. Each video diary ends with Teddy saying the eponymous phrase, \"Good luck, Charlie\". Among other decisions, executives included adult-centric scenes and changed the series title from Oops to Love, Teddy and finally to Good Luck Charlie in order to ensure the series would appeal to all family members. Good Luck Charlie premiered on Disney Channel in the United States on April 4, 2010. It premiered in Canada on April 5, 2010, the United Kingdom and Ireland on May 14, 2010, and in Australia and New Zealand on July 23, 2010. Good Luck Charlie was renewed for a second season, with production beginning in August 2010 with a season premiere on February 20, 2011. A feature-length Christmas Disney Channel Original Movie based on the series entitled Good Luck Charlie, It's Christmas! began production in March 2011 for a December 2011 premiere. Featured Crew Phil Baker Creator Drew Vaupen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bridgit Mendler Teddy Duncan Mia Talerico Charlie Duncan Leigh-Allyn Baker Amy Duncan Eric Allan Kramer Bob Duncan Bradley Steven Perry Gabe Duncan Full Cast & Crew Last Season Season 4 2013 | 22 Episodes Season 4 of Good Luck Charlie premiered on April 28, 2013. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Gabe: Happy Birthday Bradley Steven Perry! Open 0 by wonder2wonder\n      \n     w Charlie: Happy Birthday Mia Talerico! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations   2011-12-02 Austin & Ally 5.8    2011-09-30 Jessie 6.3    2014-01-17 I Didn't Do It 6.8    2012-10-12 Dog With a Blog 5.3    2010-11-07 Shake It Up 2.8    2007-01-12 Cory in the House 5.4    2009-11-28 Big Time Rush 4.9    2008-09-26 The Suite Life on Deck 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 49m, 30m Homepage   http://www.tv.disney.go.com/disneychannel/goodluckcharlie/ Genres Comedy Keywords denver teenager family sitcom Content Score 93 Almost there... Top Contributors 11 Banana 5 Atanas z 5 zurman1 E 3 ENeMy_DaVe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}