{"link": "https://www.themoviedb.org/tv/3072?language=en", "title": "Stripperella", "resume": "Stripperella is an Adult animated series created by Stan Lee. The main character, voiced by and based on Pamela Anderson, is a stripper named Erotica Jones who is also the superheroine/secret agent Stripperella. The series was produced by The Firm and Spike Animation Studios. It is rated TV-MA in the United States.", "rate": 69, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Pamela Anderson", "Jill Talley", "Tom Kenny", "Maurice LaMarche", "Sirena Irwin"], "character": ["Stripperella"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3072   Expand Stripperella   (2003) User Score Overview Stripperella is an Adult animated series created by Stan Lee. The main character, voiced by and based on Pamela Anderson, is a stripper named Erotica Jones who is also the superheroine/secret agent Stripperella. The series was produced by The Firm and Spike Animation Studios. It is rated TV-MA in the United States. Featured Crew Stan Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pamela Anderson Stripperella Jill Talley Tom Kenny Maurice LaMarche Sirena Irwin Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Stripperella premiered on June 26, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1998-09-26 V.I.P. 4.5    1998-09-29 Felicity 6.5  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Action & Adventure Keywords superhero superheroine adult animation exotic dancer sex worker Content Score 93 Almost there... Top Contributors 17 Banana S 9 SunHomeMovie 3 rtentser D 3 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}