{"link": "https://www.themoviedb.org/tv/14755?language=en", "title": "She-Ra: Princess of Power", "resume": "She-Ra, He-Man's twin sister, is leading a group of freedom fighters known as the Great Rebellion in the hope of freeing their homeworld of Etheria from the tyrannical rule of Hordak and the Evil Horde.", "rate": 64, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Diane Pershing", "Melendy Britt", "George DiCenzo", "Linda Gary", "Erika Scheimer"], "character": ["Netossa / Spinnerella", "She-Ra / Princess Adora / Castaspella / Mermista / Catra / Octavia", "Bow / Sea Hawk / Hordak / Tung Lashor / Dylamug / Vultak", "Madame Razz / Glimmer / Sweet Bee / Shadow Weaver / Scorpia / Entrapta", "Queen Angella / Frosta / Perfuma / Peekablue / Flutterina / Spritina / Imp"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14755   Expand She-Ra: Princess of Power   (1985) User Score Overview She-Ra, He-Man's twin sister, is leading a group of freedom fighters known as the Great Rebellion in the hope of freeing their homeworld of Etheria from the tyrannical rule of Hordak and the Evil Horde. Featured Crew Mattel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diane Pershing Netossa / Spinnerella Melendy Britt She-Ra / Princess Adora / Castaspella / Mermista / Catra / Octavia George DiCenzo Bow / Sea Hawk / Hordak / Tung Lashor / Dylamug / Vultak Linda Gary Madame Razz / Glimmer / Sweet Bee / Shadow Weaver / Scorpia / Entrapta Erika Scheimer Queen Angella / Frosta / Perfuma / Peekablue / Flutterina / Spritina / Imp Full Cast & Crew Last Season Season 1 1985 | 65 Episodes Season 1 of She-Ra: Princess of Power premiered on September  9, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1983-09-05 He-Man and the Masters of the Universe 7.1    1986-09-13 The Real Ghostbusters 6.9    1984-11-05 Muppet Babies 7.2    1986-09-08 Defenders of the Earth 7.2    1979-09-22 The World's Greatest Super Friends 7.5    1977-09-10 The All-New Super Friends Hour 6.8    1986-09-08 SilverHawks 7.1    1985-09-30 M.A.S.K. 5.4  Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  24m Homepage   http://www.entertainmentrights.com/programming/article_340.asp Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords magic sword based on toy sword and planet sword and sorcery Content Score 93 Almost there... Top Contributors R 38 Rebecca RH 25 Rafael Herbert 16 mgoscar 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}