{"link": "https://www.themoviedb.org/tv/72089?language=en", "title": "Puppy Dog Pals", "resume": "Fun-loving pug puppies, brothers Bingo and Rolly, have thrill-seeking appetites that take them on exhilarating adventures in their neighborhood and around the globe.", "rate": 0, "genre": [], "cast": ["Issac Ryan Brown", "Sam Lavagnino", "Harland Williams", "Jessica DiCicco"], "character": ["Bingo", "Rolly", "Bob", "Hissy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72089   Expand Puppy Dog Pals   (2017) User Score Overview Fun-loving pug puppies, brothers Bingo and Rolly, have thrill-seeking appetites that take them on exhilarating adventures in their neighborhood and around the globe. Featured Crew Harland Williams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Issac Ryan Brown Bingo Sam Lavagnino Rolly Harland Williams Bob Jessica DiCicco Hissy Full Cast & Crew Last Season Season 1 2017 | 23 Episodes Season 1 of Puppy Dog Pals premiered on April 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Puppy Dog Pals. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  24m Homepage   http://watchdisneychannel.go.com/puppy-dog-pals-disney-channel Genres No genres have been added. Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 20 res1n o 6 ozzie74 k 4 koa250 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}