{"link": "https://www.themoviedb.org/tv/30905?language=en", "title": "Jungle Junction", "resume": "Jungle Junction is a current CGI animated children's television series created by Trevor Ricketts. It airs on Disney Junior in the United States and in the Netherlands, as well as Playhouse Disney in the United Kingdom and Ireland, Portugal, Spain, Turkey and on Playhouse Disney in Asia. It is produced in the UK by animation company Spider Eye Productions. In the United States, the programme was originally part of the Playhouse Disney daily block intended for preschoolers. On February 14, 2011, it was moved to the Disney Junior block, serving as Playhouse Disney's replacement.\nA second series of 26 episodes has been ordered by Disney.", "rate": 0, "genre": ["Animation"], "cast": ["Billy West", "Laraine Newman", "Jimmy Hibbert", "Dee Bradley Baker", "Jess Harnell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30905   Expand Jungle Junction   (2009) User Score Overview Jungle Junction is a current CGI animated children's television series created by Trevor Ricketts. It airs on Disney Junior in the United States and in the Netherlands, as well as Playhouse Disney in the United Kingdom and Ireland, Portugal, Spain, Turkey and on Playhouse Disney in Asia. It is produced in the UK by animation company Spider Eye Productions. In the United States, the programme was originally part of the Playhouse Disney daily block intended for preschoolers. On February 14, 2011, it was moved to the Disney Junior block, serving as Playhouse Disney's replacement. A second series of 26 episodes has been ordered by Disney. Featured Crew Trevor Ricketts Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy West Laraine Newman Jimmy Hibbert Dee Bradley Baker Jess Harnell Full Cast & Crew Last Season Season 2 2011 | 48 Episodes Season 2 of Jungle Junction premiered on February  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Jungle Junction. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www2.disney.co.uk/DisneyChannel/playhouse/junglejunction Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors В 8 Вадим R 7 Raabi2208 w 6 wil001 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}