{"link": "https://www.themoviedb.org/tv/2704?language=en", "title": "2point4 children", "resume": "2point4 children is a 1990s British sitcom that was created and written by Andrew Marshall. It follows the lives of the Porter family; an average family that is persistently faced with surreal situations and sheer bad luck.\nThe show was originally broadcast on BBC One from 1991 to 1999, and ran for eight series, ending in a special Millennium edition that would be the last due to the death of Gary Olsen, who died from cancer in 2000. The show is now repeated regularly in the UK on Gold, and in Australia on UKTV.\nThe title of the show refers to the once average size of a UK family. There are two children in the Porter family, however Andrew Marshall has indicated that the father, Ben, could be considered almost another child, making up the \"point four\".\nThe show regularly picked up large audiences of up to 14 million in the early 1990s, with an average of between 6 - 9 million, the final episode was viewed by 9.03 million people.\nIn 1997 a remake of the show debuted in the Netherlands: 'Kees & Co' starring Simone Kleinsma.", "rate": 87, "genre": ["Comedy"], "cast": ["Gary Olsen", "Belinda Lang", "Julia Hills", "Kim Benson"], "character": ["Ben Porter", "Bill Porter", "Rona Harris", "Christine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2704   Expand 2point4 children   (1991) User Score Overview 2point4 children is a 1990s British sitcom that was created and written by Andrew Marshall. It follows the lives of the Porter family; an average family that is persistently faced with surreal situations and sheer bad luck. The show was originally broadcast on BBC One from 1991 to 1999, and ran for eight series, ending in a special Millennium edition that would be the last due to the death of Gary Olsen, who died from cancer in 2000. The show is now repeated regularly in the UK on Gold, and in Australia on UKTV. The title of the show refers to the once average size of a UK family. There are two children in the Porter family, however Andrew Marshall has indicated that the father, Ben, could be considered almost another child, making up the \"point four\". The show regularly picked up large audiences of up to 14 million in the early 1990s, with an average of between 6 - 9 million, the final episode was viewed by 9.03 million people. In 1997 a remake of the show debuted in the Netherlands: 'Kees & Co' starring Simone Kleinsma. Featured Crew Andrew Marshall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Olsen Ben Porter Belinda Lang Bill Porter Julia Hills Rona Harris Kim Benson Christine Full Cast & Crew Last Season Season 8 1999 | 6 Episodes Season 8 of 2point4 children premiered on November 16, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 2point4 children. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  40m, 30m Homepage  - Genres Comedy Keywords family sitcom british humour Content Score 93 Almost there... Top Contributors N 116 Notamymerrick 14 Banana O 8 Ozbourne a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}