{"link": "https://www.themoviedb.org/tv/66370?language=en", "title": "Ode to Joy", "resume": "Can five single, independent career women who live in the Ode to Joy apartment building find fulfillment on their own terms? An Di is a successful business woman who has returned to China after studying in New York to find her younger brother. Qu Xiao Xiao is only 25 but already owns her own small business. Fang Sheng Mei grew up in poverty but has shed her “Princess of the Streets” background to work for a multinational company. Qiu Ying Ying is a 20-year-old small-town girl who is trying to make it in the big city. Guan Ju Er is a 20-year-old from a highly educated family, but she must discover what she wants out of life when enters the workforce for the first time. For these women, there is a man (or two) who is trying to get their attention. Dr. Zhao is a flirtatious, handsome doctor. Qi Dian is the stoic businessman. Wang Bai Chuan is Sheng Mei’s steadfast friend who has always carried a torch for her. Yao Bin is a second-generation chaebol. Tan Zong Ming is An Di’s boss who has been friend-zoned by her despite knowing her since their schooldays.", "rate": 80, "genre": ["Drama"], "cast": ["Liu Tao", "Jiang Xin", "Wang Zi Wen", "Yang Zi", "Qiao Xin"], "character": ["An Di", "Fan Shengmei", "Qu Xiaoxiao", "Qiu Yingying", "Guan Juer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66370   Expand Ode to Joy   (2016) User Score Overview Can five single, independent career women who live in the Ode to Joy apartment building find fulfillment on their own terms? An Di is a successful business woman who has returned to China after studying in New York to find her younger brother. Qu Xiao Xiao is only 25 but already owns her own small business. Fang Sheng Mei grew up in poverty but has shed her “Princess of the Streets” background to work for a multinational company. Qiu Ying Ying is a 20-year-old small-town girl who is trying to make it in the big city. Guan Ju Er is a 20-year-old from a highly educated family, but she must discover what she wants out of life when enters the workforce for the first time. For these women, there is a man (or two) who is trying to get their attention. Dr. Zhao is a flirtatious, handsome doctor. Qi Dian is the stoic businessman. Wang Bai Chuan is Sheng Mei’s steadfast friend who has always carried a torch for her. Yao Bin is a second-generation chaebol. Tan Zong Ming is An Di’s boss who has been friend-zoned by her despite knowing her since their schooldays.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Tao An Di Jiang Xin Fan Shengmei Wang Zi Wen Qu Xiaoxiao Yang Zi Qiu Yingying Qiao Xin Guan Juer Full Cast & Crew Last Season Season 2 2017 | 55 Episodes Season 2 of Ode to Joy premiered on May 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ode to Joy. You can help by rating TV shows you've seen. Facts Original Name  欢乐颂 Status  Returning Series Networks Zhejiang Television Certification  - Type  Scripted Original Language  Chinese Runtime  40m Homepage  - Genres Drama Keywords romance Content Score 86 Almost there... Top Contributors M 46 Maria180493 13 Elizabeth Jennings G 10 Giaten n 5 nova12324  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}