{"link": "https://www.themoviedb.org/tv/63463?language=en", "title": "THE iDOLM@STER", "resume": "THE IDOLM@STER follows 13 girls from the 765 Production Studio, whose sole goals is to become the top idols in the Japanese entertainment industry. Along with the laughs, struggles and tears that are inherently part of this journey, you will cheer for the girls of iDOLM@STER as they climb their way to the top!", "rate": 75, "genre": ["Animation", "Drama", "Music"], "cast": ["Eriko Nakamura", "Hiromi Hirata", "Naomi Wakabayashi", "Asami Shimoda", "Asami Shimoda"], "character": ["Haruka Amami (voice)", "Makoto Kikuchi (voice)", "Ritsuko Akizuki (voice)", "Ami Futami (voice)", "Mami Futami (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63463   Expand THE iDOLM@STER   (2011) User Score  Play Trailer Overview THE IDOLM@STER follows 13 girls from the 765 Production Studio, whose sole goals is to become the top idols in the Japanese entertainment industry. Along with the laughs, struggles and tears that are inherently part of this journey, you will cheer for the girls of iDOLM@STER as they climb their way to the top! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Eriko Nakamura Haruka Amami (voice) Hiromi Hirata Makoto Kikuchi (voice) Naomi Wakabayashi Ritsuko Akizuki (voice) Asami Shimoda Ami Futami (voice) Asami Shimoda Mami Futami (voice) Full Cast & Crew Last Season Season 1 2011 | 25 Episodes Season 1 of THE iDOLM@STER premiered on July  8, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on THE iDOLM@STER. You can help by rating TV shows you've seen. Facts Original Name  アイドルマスター Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   www.idolmaster.jp Genres Animation Drama Music Keywords music idol song contest anime Content Score 93 Almost there... Top Contributors 141 Marr 🇳🇱 TB 8 TMDb Bot 3 Jaime Neto 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}