{"link": "https://www.themoviedb.org/tv/71746?language=en", "title": "Lookout", "resume": "People lose loved ones in crimes and the criminals are not punished. The daily lives of these people are completely broken. They form a group to realize justice.", "rate": 62, "genre": ["Action", "Adventure"], "cast": ["Kim Young-kwang", "Lee Si-young", "Kim Tae-hoon", "Kim Seul-Gi", "Key"], "character": ["Jang Do-Han", "Jo Soo-Ji", "Kim Eun-Joong", "Seo Bo-Mi", "Kong Kyung-Soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71746   Expand Lookout   (2017) User Score Overview People lose loved ones in crimes and the criminals are not punished. The daily lives of these people are completely broken. They form a group to realize justice. Featured Crew Son Hyung-Suk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Young-kwang Jang Do-Han Lee Si-young Jo Soo-Ji Kim Tae-hoon Kim Eun-Joong Kim Seul-Gi Seo Bo-Mi Key Kong Kyung-Soo Full Cast & Crew Last Season Season 1 2017 | 32 Episodes Season 1 of Lookout premiered on May 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2017-07-17 The King in Love 5.4    2015-03-18 Angry Mom 8.3    2015-06-08 High Society 8.3    2016-11-04 Entourage 9.0    2017-04-17 My Secret Romance 7.6  Facts Original Name  파수꾼 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.imbc.com/broad/tv/drama/catcher/ Genres Action & Adventure Keywords thriller korea Content Score 93 Almost there... Top Contributors M 45 Maria180493 4 part-mozi 4 lelouchvib 3 oyu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}