{"link": "https://www.themoviedb.org/tv/73944?language=en", "title": "Black", "resume": "The story of a grim reaper who gets erased from the memories of the world for breaking the rules of heaven and falling in love with a mortal woman after inhabiting a human body.", "rate": 69, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Song Seung-heon", "Go Ara", "Lee El", "Kim Dong-jun", "Kim Won-hae"], "character": ["Grim Reaper Black", "Kang Ha-Ram", "Yoon Soo-Wan", "Oh Man-Soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73944   Expand Black   (2017) User Score Overview The story of a grim reaper who gets erased from the memories of the world for breaking the rules of heaven and falling in love with a mortal woman after inhabiting a human body. Featured Crew Kim Hong-sun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  7 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Seung-heon Grim Reaper Black Go Ara Kang Ha-Ram Lee El Yoon Soo-Wan Kim Dong-jun Oh Man-Soo Kim Won-hae Full Cast & Crew Current Season Season 1 2017 | 18 Episodes Season 1 of Black premiered on October 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  7 Recommendations   2017-09-04 Argon 6.8    2016-11-21 White Nights 8.0    2008-03-16 Fated to Love You 7.3    2011-08-08 Birdie Buddy 7.7    2015-07-22 Diamond Lover 6.9    2016-03-23 Click your Heart 7.0    2016-03-06 Refresh Man 7.0  Facts Original Name  블랙 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  75m Homepage   http://program.tving.com/ocn/black Genres Sci-Fi & Fantasy Keywords fantasy romance thriller grim reaper Content Score 100 Yes! Looking good! Top Contributors M 49 Maria180493 11 part-mozi 6 Elizabeth Jennings 4 JustZiya  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}