{"link": "https://www.themoviedb.org/tv/4594?language=en", "title": "Iron Chef", "resume": "Iron Chef is a Japanese television cooking show produced by Fuji Television. The series, which premiered on October 10, 1993, is a stylized cook-off featuring guest chefs challenging one of the show's resident \"Iron Chefs\" in a timed cooking battle built around a specific theme ingredient. The series ended on September 24, 1999, although occasional specials were produced until 2002. The series aired 309 episodes. Repeats are regularly aired on the Cooking Channel in the United States and on Special Broadcasting Service in Australia. Fuji TV will air a new version of the show, titled Iron Chef, beginning in October 26, 2012.", "rate": 69, "genre": ["Reality"], "cast": ["Hiroyuki Sakai"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4594   Expand Iron Chef   (1993) User Score Overview Iron Chef is a Japanese television cooking show produced by Fuji Television. The series, which premiered on October 10, 1993, is a stylized cook-off featuring guest chefs challenging one of the show's resident \"Iron Chefs\" in a timed cooking battle built around a specific theme ingredient. The series ended on September 24, 1999, although occasional specials were produced until 2002. The series aired 309 episodes. Repeats are regularly aired on the Cooking Channel in the United States and on Special Broadcasting Service in Australia. Fuji TV will air a new version of the show, titled Iron Chef, beginning in October 26, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroyuki Sakai Full Cast & Crew Last Season Season 7 1999 | 40 Episodes Season 7 of Iron Chef premiered on January  8, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1995-09-13 The Drew Carey Show 6.4    1996-01-09 3rd Rock from the Sun 7.3    2004-07-18 Entourage 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Reality Keywords competition cooking cooking competition Content Score 56 We're so close, yet so far. Top Contributors 3 Elizabeth Jennings 3 Banana 1 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}