{"link": "https://www.themoviedb.org/tv/80373?language=en", "title": "TKO: Total Knock Out", "resume": "This obstacle course competition features people from all walks of life, where one player races through daunting obstacles while four other contestants are manning battle stations along the course, firing over-the-top projectiles in an attempt to knock them off and slow them down. It's a physical and funny \"us versus them\" scenario, with the fastest finisher winning a cash prize.", "rate": 0, "genre": ["Reality", "Comedy"], "cast": ["Kevin Hart"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80373   Expand TKO: Total Knock Out   (2018) User Score  Play Trailer Overview This obstacle course competition features people from all walks of life, where one player races through daunting obstacles while four other contestants are manning battle stations along the course, firing over-the-top projectiles in an attempt to knock them off and slow them down. It's a physical and funny \"us versus them\" scenario, with the fastest finisher winning a cash prize. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Hart Himself Full Cast & Crew Next Season Season 1 2018 | 10 Episodes Season 1 of TKO: Total Knock Out is set to premiere on July 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   https://www.cbs.com/shows/total-knock-out/ Genres Reality Comedy Keywords game show Content Score 64 We're so close, yet so far. Top Contributors 44 technoj 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}