{"link": "https://www.themoviedb.org/tv/66103?language=en", "title": "Ace Attorney", "resume": "A rookie lawyer Ryuuichi Naruhodou stands up to save his defendants by proving their innocence from unusual cases! Is the defendant guilty or innocent...? Believing his client's innocence Naruhodou stands in court and battles his rival judges. With the word of \"OBJECTION!\" and limited evidence, Naruhodou makes a comeback when all odds are against him and seems like there is nothing more he can do. Don't miss out on the comical episodes between him and his mentor Chihiro Ayasato, assistant Mayoi Ayasato, rival prosecutor Reiji Mitsurugi, and numerous unique characters! The anime also depicts the childhood relationship between Naruhodou and his friends. With the skills inherited from his mentor Naruho reveals the truth!", "rate": 69, "genre": ["Animation", "Crime", "Drama", "Mystery"], "cast": ["Masashi Tamaki", "Yuuki Kaji", "Aoi Yuki", "Saori Yumiba"], "character": ["Reiji Mitsurugi (御剣 怜侍)", "Ryuuichi Naruhodou (成歩堂 龍一)", "Mayoi Ayasato (綾里 真宵)", "Mei Karuma (狩魔 冥)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66103   Expand Ace Attorney   (2016) User Score Overview A rookie lawyer Ryuuichi Naruhodou stands up to save his defendants by proving their innocence from unusual cases! Is the defendant guilty or innocent...? Believing his client's innocence Naruhodou stands in court and battles his rival judges. With the word of \"OBJECTION!\" and limited evidence, Naruhodou makes a comeback when all odds are against him and seems like there is nothing more he can do. Don't miss out on the comical episodes between him and his mentor Chihiro Ayasato, assistant Mayoi Ayasato, rival prosecutor Reiji Mitsurugi, and numerous unique characters! The anime also depicts the childhood relationship between Naruhodou and his friends. With the skills inherited from his mentor Naruho reveals the truth! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masashi Tamaki Reiji Mitsurugi (御剣 怜侍) Yuuki Kaji Ryuuichi Naruhodou (成歩堂 龍一) Aoi Yuki Mayoi Ayasato (綾里 真宵) Saori Yumiba Mei Karuma (狩魔 冥) Full Cast & Crew Last Season Season 1 2016 | 24 Episodes Season 1 of Ace Attorney premiered on April  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2016-07-01 The Morose Mononokean 8.0    2016-07-08 Alderamin on the Sky 7.4    2016-04-07 Bungo Stray Dogs 7.3    2015-07-05 Charlotte 6.8    2014-07-05 Barakamon 7.3    2013-10-04 Kill la Kill 7.7  Facts Original Name  Gyakuten Saiban Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.ytv.co.jp/animegyakuten/ Genres Animation Crime Drama Mystery Keywords court lawyer anime based on visual novel Content Score 86 Almost there... Top Contributors 49 sp1ti z 15 zurman1 12 iliass guendouz V 8 Vivienb  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}