{"link": "https://www.themoviedb.org/tv/62119?language=en", "title": "Banshee: Origins", "resume": "Banshee: Origins is a series of webisodes based on the American drama television series produced by Cinemax called Banshee. The series offers flashbacks in-between the time where Lucas Hood was arrested and when Sheriff Lucas Hood first arrived in Banshee.", "rate": 89, "genre": ["Drama", "Action", "Adventure"], "cast": ["Antony Starr", "Ivana Miličević", "Frankie Faison"], "character": ["Lucas Hood", "Carrie Hopewell", "Sugar Bates"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62119   Expand Banshee: Origins   (2013) User Score Overview Banshee: Origins is a series of webisodes based on the American drama television series produced by Cinemax called Banshee. The series offers flashbacks in-between the time where Lucas Hood was arrested and when Sheriff Lucas Hood first arrived in Banshee. Featured Crew David Schickler Creator Jonathan Tropper Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antony Starr Lucas Hood Ivana Miličević Carrie Hopewell Frankie Faison Sugar Bates Full Cast & Crew Last Season Season 4 2016 | 8 Episodes Season 4 of Banshee: Origins premiered on April  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2013-01-31 Do No Harm 6.6    2007-07-24 Damages 7.2    2013-09-29 Masters of Sex 6.6    2008-07-13 Generation Kill 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.welcometobanshee.com/ Genres Drama Action & Adventure Keywords sheriff vigilante ex-con Content Score 64 We're so close, yet so far. Top Contributors S 24 ShadowDraguna 16 Apollo 12 MrSwift 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}