{"link": "https://www.themoviedb.org/tv/24125?language=en", "title": "The Woody Woodpecker Show", "resume": "The Woody Woodpecker Show is a long-running 30-minute American television series mainly composed of the animated cartoon escapades of Woody Woodpecker and other Walter Lantz characters including Andy Panda, Chilly Willy, and Inspector Willoughby released by Walter Lantz Productions. The series was revived and reformatted several times, but has remained popular for nearly four decades and allowed the studio to continue making theatrical cartoons until 1972 when it shut down. It also kept the Walter Lantz/Universal \"cartunes\" made during the Golden Age of American animation a part of the American consciousness. The Woody Woodpecker Show was named the 88th best animated series by IGN.", "rate": 73, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24125   Expand The Woody Woodpecker Show   (1940) User Score Overview The Woody Woodpecker Show is a long-running 30-minute American television series mainly composed of the animated cartoon escapades of Woody Woodpecker and other Walter Lantz characters including Andy Panda, Chilly Willy, and Inspector Willoughby released by Walter Lantz Productions. The series was revived and reformatted several times, but has remained popular for nearly four decades and allowed the studio to continue making theatrical cartoons until 1972 when it shut down. It also kept the Walter Lantz/Universal \"cartunes\" made during the Golden Age of American animation a part of the American consciousness. The Woody Woodpecker Show was named the 88th best animated series by IGN. Featured Crew Walter Lantz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 1965 | 54 Episodes Season 6 of The Woody Woodpecker Show premiered on July 10, 1965. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1960-11-14 Popeye the Sailor 5.8    1975-09-06 The Tom and Jerry Show 7.6    1964-12-18 The Pink Panther Show 7.0    1968-09-14 Wacky Races 7.1    1958-10-02 The Huckleberry Hound Show 7.0    1964-09-20 The Porky Pig Show 4.7    1980-11-08 Richie Rich 5.8    1977-09-10 Captain Caveman and the Teen Angels 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors r 16 rockafe 12 Robson Guedes Vieira 6 andruxtor 4 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}