{"link": "https://www.themoviedb.org/tv/33466?language=en", "title": "Alice", "resume": "Alice is a 2009 television miniseries that was originally broadcast on Canadian cable television channel Showcase and an hour later on American cable television channel Syfy. The miniseries is a reimagining of the classic Lewis Carroll stories Alice's Adventures in Wonderland and Through the Looking-Glass, taking place about 150 years later with science fiction and additional fantasy elements added. The miniseries was produced by Reunion Pictures Inc., the company that is currently producing \"Continuum\", the acclaimed new television series for Showcase in Canada. Reunion Pictures Inc. also produced Tin Man, for SyFy Television, the highly successful 2007 adaptation of The Wonderful Wizard of Oz. The series is three hours long, split into two parts, which premiered on Sunday, December 6, 2009 and Monday, December 7, 2009 respectively. Writer and director Nick Willing previously directed a 1999 adaptation of the books which followed the story more closely; however, Alice is intended to be a modern interpretation, imagining how Wonderland might have evolved over the last 143 years. The mini-series was partially shot in the Kamloops, B.C., Canada area.", "rate": 65, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Matt Frewer", "Harry Dean Stanton", "Caterina Scorsone", "Alessandro Juliani", "Eugene Lipinski"], "character": ["White Knight", "Caterpillar", "Alice Hamilton", "Doctor Dee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33466   Expand Alice   (2009) User Score Overview Alice is a 2009 television miniseries that was originally broadcast on Canadian cable television channel Showcase and an hour later on American cable television channel Syfy. The miniseries is a reimagining of the classic Lewis Carroll stories Alice's Adventures in Wonderland and Through the Looking-Glass, taking place about 150 years later with science fiction and additional fantasy elements added. The miniseries was produced by Reunion Pictures Inc., the company that is currently producing \"Continuum\", the acclaimed new television series for Showcase in Canada. Reunion Pictures Inc. also produced Tin Man, for SyFy Television, the highly successful 2007 adaptation of The Wonderful Wizard of Oz. The series is three hours long, split into two parts, which premiered on Sunday, December 6, 2009 and Monday, December 7, 2009 respectively. Writer and director Nick Willing previously directed a 1999 adaptation of the books which followed the story more closely; however, Alice is intended to be a modern interpretation, imagining how Wonderland might have evolved over the last 143 years. The mini-series was partially shot in the Kamloops, B.C., Canada area. Featured Crew ktoswang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  17 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Frewer White Knight Harry Dean Stanton Caterpillar Caterina Scorsone Alice Hamilton Alessandro Juliani Eugene Lipinski Doctor Dee Full Cast & Crew Last Season Season 1 2009 | 2 Episodes Season 1 of Alice premiered on December  6, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Great miniseries! Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  17 Posters  9 Recommendations   2009-04-19 La prophétie de l'Oracle 4.8    2007-12-02 Tin Man 6.5    1998-05-20 The Human Body 8.3    1997-04-18 Lexx 7.0    1986-03-16 If Tomorrow Comes 6.5    2009-03-15 Kings 7.9    2009-07-12 Meteor 5.0    2004-09-09 Joey 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Sci-Fi & Fantasy Keywords fairy tale miniseries alice in wonderland fantasy world Content Score 93 Almost there... Top Contributors TB 36 TMDb Bot 8 Banana k 5 ktoswang z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}