{"link": "https://www.themoviedb.org/tv/76178?language=en", "title": "My Next Guest Needs No Introduction With David Letterman", "resume": "TV legend David Letterman teams up with fascinating global figures for in-depth interviews and curiosity-fueled excursions in this monthly talk show.", "rate": 80, "genre": ["Talk"], "cast": ["David Letterman"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76178   Expand My Next Guest Needs No Introduction With David Letterman   (2018) User Score  Play Trailer Overview TV legend David Letterman teams up with fascinating global figures for in-depth interviews and curiosity-fueled excursions in this monthly talk show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Letterman Himself - Host Full Cast & Crew Current Season Season 1 2018 | 7 Episodes Season 1 of My Next Guest Needs No Introduction With David Letterman premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The evolution of My Next Guest... Open 0 by Daddie0\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2018-01-19 Trolls: The Beat Goes On! 5.7    2017-11-17 Shot in the Dark 7.4    2006-03-13 Canada's Worst Handyman 5.0    2014-01-14 Friday Night Tykes 6.8    2012-09-04 Highway Thru Hell 7.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Talk Show Original Language  English Runtime  60m Homepage   https://www.netflix.com/letterman Genres Talk Keywords interview Content Score 64 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings Y 9 YJ MP 6 Mr. Peanutbutter 4 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}