{"link": "https://www.themoviedb.org/tv/10952?language=en", "title": "Rawhide", "resume": "Rawhide is an American Western series starring Eric Fleming and Clint Eastwood that aired for eight seasons on the CBS network on Friday nights, from January 9, 1959 to September 3, 1965, before moving to Tuesday nights from September 14, 1965 until January 4, 1966, with a total of 217 black-and-white episodes. The series was produced and sometimes directed by Charles Marquis Warren, who also produced early episodes of Gunsmoke.\nSpanning seven and a half years, Rawhide was the fifth-longest-running American television Western, exceeded only by eight years of Wagon Train, nine years of The Virginian, fourteen years of Bonanza, and twenty years of Gunsmoke.", "rate": 80, "genre": ["Western"], "cast": ["Clint Eastwood", "Paul Brinegar", "Sheb Wooley", "Eric Fleming", "Robert Cabal"], "character": ["Rowdy Yates"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10952   Expand Rawhide   (1959) User Score Overview Rawhide is an American Western series starring Eric Fleming and Clint Eastwood that aired for eight seasons on the CBS network on Friday nights, from January 9, 1959 to September 3, 1965, before moving to Tuesday nights from September 14, 1965 until January 4, 1966, with a total of 217 black-and-white episodes. The series was produced and sometimes directed by Charles Marquis Warren, who also produced early episodes of Gunsmoke. Spanning seven and a half years, Rawhide was the fifth-longest-running American television Western, exceeded only by eight years of Wagon Train, nine years of The Virginian, fourteen years of Bonanza, and twenty years of Gunsmoke. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clint Eastwood Rowdy Yates Paul Brinegar Sheb Wooley Eric Fleming Robert Cabal Full Cast & Crew Last Season Season 8 1965 | 13 Episodes Season 8 of Rawhide premiered on September 14, 1965. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1961-01-05 Mister Ed 7.4    1958-09-23 Sea Hunt 6.8    1957-09-18 Wagon Train 6.3    1952-12-05 The Abbott and Costello Show 5.6    1972-09-17 Anna and the King 5.0    1972-10-19 Colditz 9.0    1963-09-29 The Judy Garland Show 5.0    1952-10-01 This Is Your Life 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Western Keywords cattle drive wild west 19th century Content Score 86 Almost there... Top Contributors c 38 caoimhin 10 Banana 6 lineker G 4 Greaser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}