{"link": "https://www.themoviedb.org/tv/61096?language=en", "title": "Rush", "resume": "Dr. William Rush is not your average on-call doctor. He's not attached to any hospital, he's highly discreet no matter what the ailment as long as the client can pay his cash-only premium and the doctor can party with the best of them. He has no desire to change his life or how he lives it, until an old flame and his conscience begin to stir things up.", "rate": 72, "genre": ["Drama"], "cast": ["Tom Ellis", "Larenz Tate", "Sarah Habel", "Rick Gonzalez"], "character": ["Dr. William P. Rush", "Dr. Alex Burke", "Eve Parker", "Manny Maquis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61096   Expand Rush   (2014) User Score  Play Trailer Overview Dr. William Rush is not your average on-call doctor. He's not attached to any hospital, he's highly discreet no matter what the ailment as long as the client can pay his cash-only premium and the doctor can party with the best of them. He has no desire to change his life or how he lives it, until an old flame and his conscience begin to stir things up. Featured Crew Jonathan Levine Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Ellis Dr. William P. Rush Larenz Tate Dr. Alex Burke Sarah Habel Eve Parker Rick Gonzalez Manny Maquis Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Rush premiered on July 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2016-06-08 Power Monkeys 7.0    2016-10-12 Rosehaven 6.5    2006-01-01 In Justice 6.8    2012-08-30 Good Cop 6.6    2010-07-12 The Silence 6.8    2011-01-13 Kidnap and Ransom 7.6    2011-05-02 Case Sensitive 5.4    2004-07-19 The Grid 7.0  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.usanetwork.com/rush Genres Drama Keywords addiction los angeles doctor fixer Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings 9 Banana 5 tigriso1 M 4 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}