{"link": "https://www.themoviedb.org/tv/10821?language=en", "title": "Blue's Clues", "resume": "Blue's Clues is an American children's television show that premiered on September 8, 1996 on the cable television network Nickelodeon, and ran for ten years, until August 6, 2006. Producers Angela Santomero, Todd Kessler and Traci Paige Johnson combined concepts from child development and early-childhood education with innovative animation and production techniques that helped their viewers learn. It was hosted originally by Steve Burns, who left in 2002 to pursue a music career, and later by Donovan Patton. Burns was a crucial reason for the show's success, and rumors that surrounded his departure were an indication of the show's emergence as a cultural phenomenon. Blue's Clues became the highest-rated show for preschoolers on American commercial television and was crucial to Nickelodeon's growth. It has been called \"one of the most successful, critically acclaimed, and ground-breaking preschool television series of all time\". A spin-off called Blue's Room premiered in 2004.\nThe show's producers and creators presented material in narrative format instead of the more traditional magazine format, used repetition to reinforce its curriculum, and structured every episode the same way. They used research about child development and young children's viewing habits that had been conducted in the thirty years since the debut of Sesame Street in the U.S. They revolutionized the genre by inviting their viewers' involvement. Research was part of the creative and decision-making process in the production of the show, and was integrated into all aspects and stages of the creative process. Blue's Clues was the first cutout animation series for preschoolers, and resembled a storybook in its use of primary colors and its simple construction paper shapes of familiar objects with varied colors and textures. Its home-based setting was familiar to American children, but had a look unlike other children's TV shows. A live production of Blue's Clues, which used many of the production innovations developed by the show's creators, toured the U.S. starting in 1999. As of 2002, over 2 million people had attended over 1,000 performances.", "rate": 67, "genre": [], "cast": ["Steve Burns", "Donovan Patton", "Traci Paige Johnson", "Aleisha Allen", "Nick Balaban"], "character": ["Steve", "Joe Burns", "Blue", "Mr. Salt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10821   Expand Blue's Clues   (1996) User Score Overview Blue's Clues is an American children's television show that premiered on September 8, 1996 on the cable television network Nickelodeon, and ran for ten years, until August 6, 2006. Producers Angela Santomero, Todd Kessler and Traci Paige Johnson combined concepts from child development and early-childhood education with innovative animation and production techniques that helped their viewers learn. It was hosted originally by Steve Burns, who left in 2002 to pursue a music career, and later by Donovan Patton. Burns was a crucial reason for the show's success, and rumors that surrounded his departure were an indication of the show's emergence as a cultural phenomenon. Blue's Clues became the highest-rated show for preschoolers on American commercial television and was crucial to Nickelodeon's growth. It has been called \"one of the most successful, critically acclaimed, and ground-breaking preschool television series of all time\". A spin-off called Blue's Room premiered in 2004. The show's producers and creators presented material in narrative format instead of the more traditional magazine format, used repetition to reinforce its curriculum, and structured every episode the same way. They used research about child development and young children's viewing habits that had been conducted in the thirty years since the debut of Sesame Street in the U.S. They revolutionized the genre by inviting their viewers' involvement. Research was part of the creative and decision-making process in the production of the show, and was integrated into all aspects and stages of the creative process. Blue's Clues was the first cutout animation series for preschoolers, and resembled a storybook in its use of primary colors and its simple construction paper shapes of familiar objects with varied colors and textures. Its home-based setting was familiar to American children, but had a look unlike other children's TV shows. A live production of Blue's Clues, which used many of the production innovations developed by the show's creators, toured the U.S. starting in 1999. As of 2002, over 2 million people had attended over 1,000 performances. Featured Crew Traci Paige Johnson Creator Angela Santomero Creator Todd A. Kessler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Burns Steve Donovan Patton Joe Burns Traci Paige Johnson Blue Aleisha Allen Nick Balaban Mr. Salt Full Cast & Crew Last Season Season 7 2006 | 2 Episodes Season 7 of Blue's Clues premiered on July 27, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1997-10-20 Bear in the Big Blue House 7.2    1993-03-01 The Big Comfy Couch 7.0    2000-08-13 Dora the Explorer 4.2    2005-12-19 Deal or No Deal 5.2    1996-09-19 Suddenly Susan 4.9    1982-03-23 Joanie Loves Chachi 2.4    2005-09-06 Go, Diego, Go! 4.6    1961-09-24 The Bullwinkle Show 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Animexla 3 Zlogorek S 2 Samara 1 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}