{"link": "https://www.themoviedb.org/tv/36301?language=en", "title": "Hamburg Dockland", "resume": "Shows the interaction between Hamburg police officers and paramedics.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Sanna Englund", "Rhea Harder", "Harald Maack", "Gerit Kling", "Fabian Harloff"], "character": ["Polizeioberkommissarin Melanie Hansen", "Polizeimeisterin Franziska 'Franzi' Jung", "Polizeioberkommissar Jörn 'Wolle' Wollenberger", "Dr. Jasmin Jonas", "Dr. Philipp Haase"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36301   Expand Hamburg Dockland   (2007) User Score Overview Shows the interaction between Hamburg police officers and paramedics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanna Englund Polizeioberkommissarin Melanie Hansen Rhea Harder Polizeimeisterin Franziska 'Franzi' Jung Harald Maack Polizeioberkommissar Jörn 'Wolle' Wollenberger Gerit Kling Dr. Jasmin Jonas Fabian Harloff Dr. Philipp Haase Full Cast & Crew Current Season Season 12 2017 | 27 Episodes Season 12 of Hamburg Dockland premiered on October  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hamburg Dockland. You can help by rating TV shows you've seen. Facts Original Name  Notruf Hafenkante Status  Returning Series Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  43m Homepage   https://www.zdf.de/serien/notruf-hafenkante Genres Crime Drama Keywords police germany hamburg germany Content Score 86 Almost there... Top Contributors S 180 Samara r 15 rasch1967 10 Matthew Sanders n 9 nnwrz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}