{"link": "https://www.themoviedb.org/tv/11726?language=en", "title": "Spiral", "resume": "Spiral is a French television police drama series created by the TV production company Son et Lumière. The first eight episodes series started on Canal+ in France on 13 December 2005. It returned for a second series, partly funded by the BBC, of eight episodes on 12 May 2008, a third series of twelve episodes on 3 May 2010 and a fourth series of twelve episodes on 3 September 2012. A fifth and sixth series have been ordered.\nSpiral has been a great export success, with sales to broadcasters in some 70 countries, among them Australia, Denmark, Finland, Italy, Japan, Mexico, Switzerland, and the United Kingdom. The series was first shown in the UK on BBC Four during the summer of 2006. It was the channel's first French-language drama series, attracting a modest but loyal audience and firm critical approval. On 13 September 2009, BBC Four started showing the second series, on 2 April 2011 the third series and on 9 February 2013 the fourth series. In Australia, the first series was broadcast in 2008 on SBS One, the second series on SBS Two from September 2009 and the third series on SBS Two from mid-2012.\nSpiral debuted in North America via Netflix in September 2012; in November 2012, the small public-broadcasting network MHz Worldview began transmitting the series in the US.", "rate": 82, "genre": ["Drama", "Mystery", "Action", "Adventure"], "cast": ["Caroline Proust", "Philippe Duclos", "Audrey Fleurot", "Thierry Godard", "Fred Bianconi"], "character": ["Laure Berthaud", "François Roban", "Joséphine Karlsson", "Gilles \"Gilou\" Escoffier", "Fromentin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11726   Expand Spiral   (2005) User Score Overview Spiral is a French television police drama series created by the TV production company Son et Lumière. The first eight episodes series started on Canal+ in France on 13 December 2005. It returned for a second series, partly funded by the BBC, of eight episodes on 12 May 2008, a third series of twelve episodes on 3 May 2010 and a fourth series of twelve episodes on 3 September 2012. A fifth and sixth series have been ordered. Spiral has been a great export success, with sales to broadcasters in some 70 countries, among them Australia, Denmark, Finland, Italy, Japan, Mexico, Switzerland, and the United Kingdom. The series was first shown in the UK on BBC Four during the summer of 2006. It was the channel's first French-language drama series, attracting a modest but loyal audience and firm critical approval. On 13 September 2009, BBC Four started showing the second series, on 2 April 2011 the third series and on 9 February 2013 the fourth series. In Australia, the first series was broadcast in 2008 on SBS One, the second series on SBS Two from September 2009 and the third series on SBS Two from mid-2012. Spiral debuted in North America via Netflix in September 2012; in November 2012, the small public-broadcasting network MHz Worldview began transmitting the series in the US. Featured Crew Alexandra Clert Creator Guy-Patrick Sainderichin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  9 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Caroline Proust Laure Berthaud Philippe Duclos François Roban Audrey Fleurot Joséphine Karlsson Thierry Godard Gilles \"Gilou\" Escoffier Fred Bianconi Fromentin Full Cast & Crew Last Season Saison 6 2017 | 12 Episodes Season 6 of Spiral premiered on September 18, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply SB great series Open 0 by Strange Bedfellows\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  4 Recommendations   2002-09-29 Boomtown 8.4    2012-12-30 Salamander 6.9    2015-10-07 The Principal 5.7    2005-01-14 Wallander 6.2    2016-09-25 Nobel 8.5    2009-02-02 Whitechapel 7.5    2002-05-13 Spooks 7.5    2010-08-15 Vexed 7.2  Facts Original Name  Engrenages Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  48m, 52m Homepage   http://www.canalplus.fr/index.php?pid=2471 Genres Drama Mystery Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 17 kwagi_movie S 14 Shady12 W 8 Waldner11 5 rantamplan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}