{"link": "https://www.themoviedb.org/tv/34141?language=en", "title": "D.Gray-man", "resume": "Darkness is moving in, and young exorcist Allen Walker is humanity’s greatest hope against the wicked forces conspiring to bring civilization to its knees. Akuma – cruel spirits born of tragedy and lost souls – lurk in every shadow, willing and eager to do the bidding of their leader, the dread Millennium Earl. With an eye cursed to see evil in its truest form and blessed with an arm to slay soul-devouring demons, Allen stands ready to confront the gathering evil. Should he fail, Innocence will be lost forever. The war to decide the fate of mankind has begun – and the carnage will be endless.", "rate": 83, "genre": ["Action", "Adventure", "Animation", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Toshiyuki Morikawa", "Katsuyuki Konishi", "Sanae Kobayashi", "Kenichi Suzumura", "Takeshi Aono"], "character": ["Tyki Mikk", "Komui Lee", "Allen Walker", "Lavi", "Bookman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34141   Expand D.Gray-man   (2006) User Score Overview Darkness is moving in, and young exorcist Allen Walker is humanity’s greatest hope against the wicked forces conspiring to bring civilization to its knees. Akuma – cruel spirits born of tragedy and lost souls – lurk in every shadow, willing and eager to do the bidding of their leader, the dread Millennium Earl. With an eye cursed to see evil in its truest form and blessed with an arm to slay soul-devouring demons, Allen stands ready to confront the gathering evil. Should he fail, Innocence will be lost forever. The war to decide the fate of mankind has begun – and the carnage will be endless. Featured Crew Osamu Nabeshima Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiyuki Morikawa Tyki Mikk Katsuyuki Konishi Komui Lee Sanae Kobayashi Allen Walker Kenichi Suzumura Lavi Takeshi Aono Bookman Full Cast & Crew Last Season Season 2 2007 | 52 Episodes Season 2 of D.Gray-man premiered on October  2, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  6 Recommendations   2002-01-08 Full Metal Panic! 6.6    2011-10-02 Fate/Zero 7.9    2007-07-27 Baccano! 8.4    2007-10-04 Clannad 7.5  Facts Original Name  ディー・グレイマン Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/dgray-man/home Genres Action & Adventure Animation Mystery Sci-Fi & Fantasy Keywords fantasy supernatural super power shounen anime bishonen Content Score 93 Almost there... Top Contributors 35 WillofOwn 6 benf45 z 5 zurman1 s 4 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}