{"link": "https://www.themoviedb.org/tv/20193?language=en", "title": "Mobile Suit Gundam Seed Destiny", "resume": "Mobile Suit Gundam SEED Destiny is an anime television series, acting as a sequel of Mobile Suit Gundam SEED by Sunrise. It retains most of the staff from Gundam SEED, including Director Mitsuo Fukuda. Set two years after the original Mobile Suit Gundam SEED, the plot follows the new character Shinn Asuka, a soldier from ZAFT, composed of humans born genetically enhanced labelled as Coordinators. As ZAFT is about to enter into another war against the regular human race, the Naturals, the series focuses on Shinn's as well as various returning characters' involvement in the war. The series spanned 50 episodes, aired in Japan from October 9, 2004 to October 1, 2005 on the Japan News Network television stations Tokyo Broadcasting System and Mainichi Broadcasting System.\nIn December 2005, Sunrise aired a special episode that remade the events from the series' last episode. A series of four films compilating the series has also been released in Japan. Gundam SEED was adapted into various manga adaptations and light novels published by Kodansha and Kadokawa Shoten. Bandai Entertainment licensed the series for North America release, and has published it in DVD volumes. Some episodes also aired in Canada, while the compilations films were also released in DVDs. The first manga was licensed and published by Del Rey Manga. Various types of merchandising have also been released, including CD soundtracks and video games.", "rate": 85, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20193   Expand Mobile Suit Gundam Seed Destiny   (2004) User Score Overview Mobile Suit Gundam SEED Destiny is an anime television series, acting as a sequel of Mobile Suit Gundam SEED by Sunrise. It retains most of the staff from Gundam SEED, including Director Mitsuo Fukuda. Set two years after the original Mobile Suit Gundam SEED, the plot follows the new character Shinn Asuka, a soldier from ZAFT, composed of humans born genetically enhanced labelled as Coordinators. As ZAFT is about to enter into another war against the regular human race, the Naturals, the series focuses on Shinn's as well as various returning characters' involvement in the war. The series spanned 50 episodes, aired in Japan from October 9, 2004 to October 1, 2005 on the Japan News Network television stations Tokyo Broadcasting System and Mainichi Broadcasting System. In December 2005, Sunrise aired a special episode that remade the events from the series' last episode. A series of four films compilating the series has also been released in Japan. Gundam SEED was adapted into various manga adaptations and light novels published by Kodansha and Kadokawa Shoten. Bandai Entertainment licensed the series for North America release, and has published it in DVD volumes. Some episodes also aired in Canada, while the compilations films were also released in DVDs. The first manga was licensed and published by Del Rey Manga. Various types of merchandising have also been released, including CD soundtracks and video games. Featured Crew Yoshiyuki Tomino Creator Hajime Yatate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2004 | 50 Episodes Season 1 of Mobile Suit Gundam Seed Destiny premiered on October  9, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam Seed Destiny. You can help by rating TV shows you've seen. Facts Original Name  機動戦士ガンダムSEED DESTINY Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.gundam-seed-d.net/ Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 17 Jenazad 12 fmsonic i 4 i90i90 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}