{"link": "https://www.themoviedb.org/tv/62066?language=en", "title": "Ask God For Forgiveness... Not Me", "resume": "The story of Renata Flores del Angel, a young woman from a wealthy family who falls for Pablo Ramos, the foreman of her father's estate.", "rate": 15, "genre": ["Drama"], "cast": ["Zuria Vega", "Mark Tacher", "Rebecca Jones", "Sergio Goyri", "Sabine Moussier"], "character": ["Abigail Rios / Abigail Ramos Flores", "Mateo López-Guerra Fuentes", "Renata Flores del Ángel de López-Guerra", "Fausto López-Guerra", "Macaria Rios"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62066   Expand Ask God For Forgiveness... Not Me   (2015) User Score Overview The story of Renata Flores del Angel, a young woman from a wealthy family who falls for Pablo Ramos, the foreman of her father's estate. Featured Crew Caridad Bravo Adams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zuria Vega Abigail Rios / Abigail Ramos Flores Mark Tacher Mateo López-Guerra Fuentes Rebecca Jones Renata Flores del Ángel de López-Guerra Sergio Goyri Fausto López-Guerra Sabine Moussier Macaria Rios Full Cast & Crew Last Season Season 1 2015 | 123 Episodes Season 1 of Ask God For Forgiveness... Not Me premiered on January 19, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ask God For Forgiveness... Not Me. You can help by rating TV shows you've seen. Facts Original Name  Que te perdone Dios... yo no Status  Returning Series Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Drama Keywords telenovela Content Score 79 Pump it up! We're close now. Top Contributors s 33 shiff7 5 Elizabeth Jennings CM 4 Cherche Moi O 1 Onnovelas1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}