{"link": "https://www.themoviedb.org/tv/62152?language=en", "title": "My Sunshine", "resume": "While studying at university, Zhao Mosheng fell in love at first sight with law student He Yichen. Through various incidents where Mosheng \"stalked\" Yichen on campus, Mosheng's cheerful personality charmed Yichen, and they gradually became college sweethearts. When Yichen's foster sister Yimei challenged Mosheng for Yichen's attention, Mosheng turned directly to Yichen for clarification, but did not expect to receive a cold response from him. Mistaking that Yichen and Yimei are a couple, Mosheng followed her father's arrangements and moved to the United States to continue her studies. Seven years later, Mosheng - who is now a professional photographer - returns to China, and coincidentally bumps into the unforgettable Yichen.", "rate": 74, "genre": ["Drama"], "cast": ["Wallace Chung", "Tiffany Tang", "Tan Kai", "Mi Lu", "Janice Wu"], "character": ["He Yi Chen", "Zhao Mo Sheng", "Ying Hui", "Xiao Xiao", "Zhao Mo Sheng (young)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62152   Expand My Sunshine   (2015) User Score  Play Trailer Overview While studying at university, Zhao Mosheng fell in love at first sight with law student He Yichen. Through various incidents where Mosheng \"stalked\" Yichen on campus, Mosheng's cheerful personality charmed Yichen, and they gradually became college sweethearts. When Yichen's foster sister Yimei challenged Mosheng for Yichen's attention, Mosheng turned directly to Yichen for clarification, but did not expect to receive a cold response from him. Mistaking that Yichen and Yimei are a couple, Mosheng followed her father's arrangements and moved to the United States to continue her studies. Seven years later, Mosheng - who is now a professional photographer - returns to China, and coincidentally bumps into the unforgettable Yichen. Featured Crew Gu Man Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wallace Chung He Yi Chen Tiffany Tang Zhao Mo Sheng Tan Kai Ying Hui Mi Lu Xiao Xiao Janice Wu Zhao Mo Sheng (young) Full Cast & Crew Last Season Season 1 2015 | 36 Episodes Season 1 of My Sunshine premiered on January 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  2 Recommendations   2015-09-12 Goldie & Bear 5.4    2015-07-22 Diamond Lover 6.9    2014-02-23 Griselda Blanco: The Black Widow 6.2    2016-03-06 Refresh Man 7.0  Facts Original Name  何以笙箫默 Status  Ended Networks JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.croton.com.cn/Pc/page/TVDetials.aspx?id=95 Genres Drama Keywords china shanghai love triangle foster sister college love Content Score 100 Yes! Looking good! Top Contributors 55 Wendy M 32 Maria180493 5 Elizabeth Jennings 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}