{"link": "https://www.themoviedb.org/tv/5715?language=en", "title": "The Lone Gunmen", "resume": "After years of playing second fiddle to Agents Mulder and Scully on  The X-Files, the trio of computer-hacking conspiracy geeks popularly known as The Lone Gunmen are finally heading out on their own. Never ones to stray far from the center of corporate and government intrigue, the threesome play like a misguided Mission Impossible team, embarking on a series of comic adventures that simultaneously highlight their genius and ineptitude.", "rate": 69, "genre": ["Drama", "Comedy"], "cast": ["Zuleikha Robinson", "Dean Haglund", "Tom Braidwood", "Bruce Harwood"], "character": ["Yves Adele Harlow", "Richard Langly", "Melvin Frohike", "John Fitzgerald Byers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5715   Expand The Lone Gunmen   (2001) User Score Overview After years of playing second fiddle to Agents Mulder and Scully on  The X-Files, the trio of computer-hacking conspiracy geeks popularly known as The Lone Gunmen are finally heading out on their own. Never ones to stray far from the center of corporate and government intrigue, the threesome play like a misguided Mission Impossible team, embarking on a series of comic adventures that simultaneously highlight their genius and ineptitude. Featured Crew Chris Carter Creator Frank Spotnitz Creator John Shiban Creator Vince Gilligan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zuleikha Robinson Yves Adele Harlow Dean Haglund Richard Langly Tom Braidwood Melvin Frohike Bruce Harwood John Fitzgerald Byers Full Cast & Crew Last Season Season 1 2001 | 13 Episodes Season 1 of The Lone Gunmen premiered on March  4, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   1982-09-26 Matt Houston 6.6    1954-10-27 Walt Disney's Wonderful World of Color 6.8    1968-09-20 The Name of the Game 8.3    1987-09-26 Jake and the Fatman 4.9    1963-09-29 My Favorite Martian 5.4    1999-04-07 Strangers with Candy 7.0    1998-10-23 Brimstone 7.6    1987-09-25 Beauty and the Beast 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m, 43m Homepage  - Genres Drama Comedy Keywords conspiracy government conspiracy Content Score 93 Almost there... Top Contributors 11 Elizabeth Jennings d 6 denis n 5 nilsbyte w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}