{"link": "https://www.themoviedb.org/tv/23545?language=en", "title": "Ask This Old House", "resume": "The crew at This Old House take on some pretty big projects, which means they can only work on one or two houses a year. But homeowners have a virtual truckload of questions on smaller projects, and the This Old House crew is ready to answer. Ask This Old House solves the steady stream of home improvement problems faced by viewers - and the crew even makes house calls!", "rate": 33, "genre": ["Documentary"], "cast": ["Richard Trethewey", "Norm Abram", "Roger Cook", "Kevin O'Connor", "Tom Silva"], "character": ["Himself", "Himself", "Himself", "Host", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23545   Expand Ask This Old House   (2002) User Score  Play Trailer Overview The crew at This Old House take on some pretty big projects, which means they can only work on one or two houses a year. But homeowners have a virtual truckload of questions on smaller projects, and the This Old House crew is ready to answer. Ask This Old House solves the steady stream of home improvement problems faced by viewers - and the crew even makes house calls! Featured Crew Russell Morash Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Trethewey Himself Norm Abram Himself Roger Cook Himself Kevin O'Connor Host Tom Silva Himself Full Cast & Crew Current Season Season 16 2017 | 7 Episodes Season 16 of Ask This Old House premiered on October  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1979-02-20 This Old House 4.8  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.thisoldhouse.com/toh/tv/ask-toh/ Genres Documentary Keywords home renovation Content Score 100 Yes! Looking good! Top Contributors 29 Elizabeth Jennings TB 20 TMDb Bot S 11 Snackdish 6 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}