{"link": "https://www.themoviedb.org/tv/14188?language=en", "title": "The Angry Video Game Nerd", "resume": "The Angry Video Game Nerd is an adult web television series of comedic retrogaming video reviews created by and starring James Rolfe. The show's format revolves around his commentary and review of older, but unsuccessful video games which are deemed to be of particularly low-quality, unfair difficulty or poor design.\nThe series began as a feature on YouTube and later became a program on ScrewAttack Entertainment before moving to GameTrailers exclusively. The show was renamed The Angry Video Game Nerd to prevent any trademark issues with Nintendo and due to the fact he started reviewing games from non-Nintendo consoles such as those made by Atari and Sega.\nRolfe's character, \"The Nerd\" is a short-tempered and foul-mouthed video game fanatic. He derives comic appeal from excessive and inventive use of anger, profanity, and habitual consumption of alcohol while reviewing video games.\nA feature-length film, Angry Video Game Nerd: The Movie, is expected to be released between 2013 and 2014.", "rate": 78, "genre": ["Comedy", "Documentary"], "cast": ["James D. Rolfe"], "character": ["Angry Video Game Nerd"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14188   Expand The Angry Video Game Nerd   (2004) User Score Overview The Angry Video Game Nerd is an adult web television series of comedic retrogaming video reviews created by and starring James Rolfe. The show's format revolves around his commentary and review of older, but unsuccessful video games which are deemed to be of particularly low-quality, unfair difficulty or poor design. The series began as a feature on YouTube and later became a program on ScrewAttack Entertainment before moving to GameTrailers exclusively. The show was renamed The Angry Video Game Nerd to prevent any trademark issues with Nintendo and due to the fact he started reviewing games from non-Nintendo consoles such as those made by Atari and Sega. Rolfe's character, \"The Nerd\" is a short-tempered and foul-mouthed video game fanatic. He derives comic appeal from excessive and inventive use of anger, profanity, and habitual consumption of alcohol while reviewing video games. A feature-length film, Angry Video Game Nerd: The Movie, is expected to be released between 2013 and 2014. Featured Crew James D. Rolfe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James D. Rolfe Angry Video Game Nerd Full Cast & Crew Last Season Season 10 2016 | 5 Episodes Season 10 of The Angry Video Game Nerd premiered on April  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   2009-04-11 Board James 7.2    1986-08-23 Macken 5.8    Soccer Saturday 6.5    1999-01-18 Parlamentet 3.0    2013-11-07 Folkets främsta företrädare 5.0    2016-04-25 After the Thrones 4.6    2002-10-31 Värsta språket 6.0    1987-09-05 På spåret 5.0  Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  15m Homepage   http://screwattack.com/avgn Genres Comedy Documentary Keywords video game nintendo nerd Content Score 64 We're so close, yet so far. Top Contributors 23 Buján 12 xwing 11 vulturestreet z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}