{"link": "https://www.themoviedb.org/tv/65693?language=en", "title": "Good Morning Call", "resume": "A high school girl finally gets her own apartment, but she has to share it with the most popular boy in school. No one can know they're living together.", "rate": 61, "genre": ["Comedy"], "cast": ["Haruka Fukuhara", "Shunya Shiraishi", "Dôri Sakurada", "Yosuke Sugino", "Moe Arai"], "character": ["Nao Yoshikawa", "Hisashi Uehara", "Daichi Shinozaki", "Shu Natsume", "Marina Konno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65693   Expand Good Morning Call   (2016) User Score Overview A high school girl finally gets her own apartment, but she has to share it with the most popular boy in school. No one can know they're living together. Featured Crew Mayuko Okamoto Creator Akimitsu  Sasaki Creator Yue Takasuka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Fukuhara Nao Yoshikawa Shunya Shiraishi Hisashi Uehara Dôri Sakurada Daichi Shinozaki Yosuke Sugino Shu Natsume Moe Arai Marina Konno Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Good Morning Call premiered on September 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2015-08-23 Noble, My Love 7.4    2015-11-10 My Little Lover 6.3    2015-09-02 Atelier 7.2  Facts Original Name  グッドモーニング・コール Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.goodmorning-call.com Genres Comedy Keywords high school japan teenager based on manga apartment Content Score 100 Yes! Looking good! Top Contributors 48 xyzl M 22 Maria180493 5 RubeensVinicius B 3 Bonsai  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}