{"link": "https://www.themoviedb.org/tv/62564?language=en", "title": "Sound! Euphonium", "resume": "After swearing off music due to an incident at the middle school regional brass band competition, euphonist Kumiko Oumae enters high school hoping for a fresh start. As fate would have it, she ends up being surrounded by people with an interest in the high school brass band. Kumiko finds the motivation she needs to make music once more with the help of her bandmates, some of whom are new like novice tubist Hazuki Katou; veteran contrabassist Sapphire Kawashima; and band vice president and fellow euphonist Asuka Tanaka. Others are old friends, like Kumiko's childhood friend and hornist-turned-trombonist Shuuichi Tsukamoto, and trumpeter and bandmate from middle school, Reina Kousaka.\nHowever, in the band itself, chaos reigns supreme. Despite their intention to qualify for the national band competition, as they currently are, just competing in the local festival will be a challenge—unless the new band advisor Noboru Taki does something about it.\nFrom the studio that animated Suzumiya Haruhi no Yuuutsu, Kyoto Animation's Hibike! Euphonium is a fresh and musical take on the slice-of-life staple that is the high school student's struggle to deal with their past, find romance, and realize their dreams and aspirations.\n[Written by MAL Rewrite]", "rate": 86, "genre": ["Animation", "Comedy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62564   Expand Sound! Euphonium   (2015) User Score  Play Trailer Overview After swearing off music due to an incident at the middle school regional brass band competition, euphonist Kumiko Oumae enters high school hoping for a fresh start. As fate would have it, she ends up being surrounded by people with an interest in the high school brass band. Kumiko finds the motivation she needs to make music once more with the help of her bandmates, some of whom are new like novice tubist Hazuki Katou; veteran contrabassist Sapphire Kawashima; and band vice president and fellow euphonist Asuka Tanaka. Others are old friends, like Kumiko's childhood friend and hornist-turned-trombonist Shuuichi Tsukamoto, and trumpeter and bandmate from middle school, Reina Kousaka. However, in the band itself, chaos reigns supreme. Despite their intention to qualify for the national band competition, as they currently are, just competing in the local festival will be a challenge—unless the new band advisor Noboru Taki does something about it. From the studio that animated Suzumiya Haruhi no Yuuutsu, Kyoto Animation's Hibike! Euphonium is a fresh and musical take on the slice-of-life staple that is the high school student's struggle to deal with their past, find romance, and realize their dreams and aspirations. [Written by MAL Rewrite] Featured Crew Tatsuya Ishihara Creator Naoko Yamada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 13 Episodes Season 2 of Sound! Euphonium premiered on October  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2012-04-22 Hyouka 8.3    2011-01-07 Puella Magi Madoka Magica 7.9    1998-11-18 The Powerpuff Girls 7.0  Facts Original Name  響け！ユーフォニアム Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://tv.anime-eupho.com/ Genres Animation Comedy Drama Keywords brass band slice of life based on light novel anime uji Content Score 71 Just a little bit more... Top Contributors 32 sp1ti C 17 Chintaran 13 a4840639 11 Axeshizzle  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}