{"link": "https://www.themoviedb.org/tv/73340?language=en", "title": "De Vuelta al Barrio", "resume": "It is the story of Pichón, a father of a family who has just been widowed, seeing the way to get their children forward, and Malena, who returns to his childhood home with his four children. During their youth they lived a romance and they arrived at the altar, but she decided to leave it moments before marrying and after twenty-five years, they meet again", "rate": 63, "genre": ["Comedy", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73340   Expand De Vuelta al Barrio   (2017) User Score Overview It is the story of Pichón, a father of a family who has just been widowed, seeing the way to get their children forward, and Malena, who returns to his childhood home with his four children. During their youth they lived a romance and they arrived at the altar, but she decided to leave it moments before marrying and after twenty-five years, they meet again Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 34 Episodes Season 2 of De Vuelta al Barrio premiered on April  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on De Vuelta al Barrio. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Comedy Family Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 39 Play Latino 18 Ellin W. Eva 9 play-latino 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}