{"link": "https://www.themoviedb.org/tv/74647?language=en", "title": "Shadows over Balkans", "resume": "A historical fiction drama and thriller set in the turbulent period of the late 1930s in the Balkans as a place where high politics, local interests, capital and crime all merge together.", "rate": 97, "genre": ["Crime", "Drama", "War", "Politics"], "cast": ["Dragan Bjelogrlić", "Andrija Kuzmanović", "Marija Bergam", "Miloš Timotijević", "Toni Mihajlovski"], "character": ["Andra Tanasijevic", "Stanko Pletikosic", "Maja Davidovic", "Tužilac Vojin Đukić", "Hadži Damjan Arsov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74647   Expand Shadows over Balkans   (2017) User Score  Play Trailer Overview A historical fiction drama and thriller set in the turbulent period of the late 1930s in the Balkans as a place where high politics, local interests, capital and crime all merge together. Featured Crew Dragan Bjelogrlić Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dragan Bjelogrlić Andra Tanasijevic Andrija Kuzmanović Stanko Pletikosic Marija Bergam Maja Davidovic Miloš Timotijević Tužilac Vojin Đukić Toni Mihajlovski Hadži Damjan Arsov Full Cast & Crew Current Season Season 1 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shadows over Balkans. You can help by rating TV shows you've seen. Facts Original Name  Senke nad Balkanom Status  Returning Series Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  Serbian Runtime  - Homepage  - Genres Crime Drama War & Politics Keywords crime historical balkan Content Score 100 Yes! Looking good! Top Contributors a 100 angelinas 9 Предраг TB 4 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}