{"link": "https://www.themoviedb.org/tv/46405?language=en", "title": "Legit", "resume": "Jim Jefferies, an edgy, foul-mouthed stand-up comedian from Australia, in his mid-30s and living in LA, is endeavoring to make his life and career more “legit,” only to find it a difficult, uncomfortable uphill struggle every step of the way. Jim is encouraged in his quest by Steve, his neurotic best friend and roommate, a cyber-law library salesman who struggles to stay on his feet in the wake of a divorce, and Steve’s brother Billy, who suffers from advanced staged Muscular Dystrophy and is confined to a wheelchair.", "rate": 77, "genre": ["Comedy"], "cast": ["Jim Jefferies", "Dan Bakkedahl", "DJ Qualls", "Mindy Sterling", "Sonya Eddy"], "character": ["Jim Jefferies", "Steve Nugent", "Billy Nugent", "Janice Nugent", "Ramona"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46405   Expand Legit   (2013) User Score  Play Trailer Overview Jim Jefferies, an edgy, foul-mouthed stand-up comedian from Australia, in his mid-30s and living in LA, is endeavoring to make his life and career more “legit,” only to find it a difficult, uncomfortable uphill struggle every step of the way. Jim is encouraged in his quest by Steve, his neurotic best friend and roommate, a cyber-law library salesman who struggles to stay on his feet in the wake of a divorce, and Steve’s brother Billy, who suffers from advanced staged Muscular Dystrophy and is confined to a wheelchair. Featured Crew Jim Jefferies Creator Peter O'Fallon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Jefferies Jim Jefferies Dan Bakkedahl Steve Nugent DJ Qualls Billy Nugent Mindy Sterling Janice Nugent Sonya Eddy Ramona Full Cast & Crew Last Season Season 2 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2006-01-01 In Justice 6.8    2013-08-25 What Remains 7.1    2011-05-02 Case Sensitive 5.4    2011-01-13 Kidnap and Ransom 7.6    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2010-09-28 Whites 6.7    2016-04-25 Flowers 6.7  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords politically incorrect stand-up comedian disabled Content Score 100 Yes! Looking good! Top Contributors 19 Elizabeth Jennings 17 Mike  b 9 brewtown 6 Patrik Selin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}