{"link": "https://www.themoviedb.org/tv/2349?language=en", "title": "The League of Gentlemen", "resume": "The League of Gentlemen is a British comedy television series that premiered on BBC Two in 1999. The show is set in Royston Vasey, a fictional town in Northern England based on Bacup, Lancashire. It follows the lives of dozens of bizarre townspeople, most of whom are played by three of the show's four writers—Mark Gatiss, Steve Pemberton, and Reece Shearsmith—who, along with Jeremy Dyson, formed the League of Gentlemen comedy troupe in 1995. The series originally aired for three series from 1999 until 2002 followed by a film in 2005. A three-part revival mini-series was broadcast in December 2017 to celebrate the group's 20th anniversary.", "rate": 75, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2349   Expand The League of Gentlemen   (1999) User Score  Play Trailer Overview The League of Gentlemen is a British comedy television series that premiered on BBC Two in 1999. The show is set in Royston Vasey, a fictional town in Northern England based on Bacup, Lancashire. It follows the lives of dozens of bizarre townspeople, most of whom are played by three of the show's four writers—Mark Gatiss, Steve Pemberton, and Reece Shearsmith—who, along with Jeremy Dyson, formed the League of Gentlemen comedy troupe in 1995. The series originally aired for three series from 1999 until 2002 followed by a film in 2005. A three-part revival mini-series was broadcast in December 2017 to celebrate the group's 20th anniversary. Featured Crew Reece Shearsmith Creator Mark Gatiss Creator Steve Pemberton Creator Jeremy Dyson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 4 2017 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2004-05-18 The Mighty Boosh 7.5    2009-06-18 Psychoville 6.9    1991-09-17 Bottom 8.1    1994-09-16 Knowing Me Knowing You with Alan Partridge 7.5    1998-11-09 Big Train 7.5    1997-01-29 Brass Eye 8.0    1987-09-13 The New Statesman 7.9    1997-11-03 I'm Alan Partridge 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006t8d1 Genres Comedy Keywords northern england dark comedy surreal sketch comedy british humour Content Score 71 Just a little bit more... Top Contributors 10 seawolf O 10 Ozbourne R 5 Rebecca 3 dijion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}