{"link": "https://www.themoviedb.org/tv/5690?language=en", "title": "Moonlight", "resume": "Mick St. John is a captivating, charming and immortal private investigator from Los Angeles, who defies the traditional blood-sucking norms of his vampire tendencies by using his wit and powerful supernatural abilities to help the living.", "rate": 72, "genre": ["Mystery", "Crime", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Alex O'Loughlin", "Sophia Myles", "Jason Dohring", "Shannyn Sossamon"], "character": ["Mick St. John", "Beth Turner", "Josef Kostan", "Coraline Duvall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5690   Expand Moonlight   (2007) User Score  Play Trailer Overview Mick St. John is a captivating, charming and immortal private investigator from Los Angeles, who defies the traditional blood-sucking norms of his vampire tendencies by using his wit and powerful supernatural abilities to help the living. Featured Crew Trevor Munson Creator Ron Koslow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  29 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex O'Loughlin Mick St. John Sophia Myles Beth Turner Jason Dohring Josef Kostan Shannyn Sossamon Coraline Duvall Full Cast & Crew Last Season Season 1 2007 | 16 Episodes Season 1 of Moonlight premiered on September 28, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  29 Posters  6 Recommendations   2007-03-11 Blood Ties 7.4    2010-06-20 The Gates 6.8    2005-09-19 Invasion 6.9    2003-10-30 Tru Calling 6.9    2007-01-21 The Dresden Files 6.7    2007-09-26 Bionic Woman 5.5    2000-10-03 Dark Angel 7.2    2009-09-23 Eastwick 6.1  Facts Status  Cancelled Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  40m Homepage  - Genres Mystery Crime Drama Sci-Fi & Fantasy Keywords california vampire private investigator interspecies romance Content Score 100 Yes! Looking good! Top Contributors 50 Banana w 10 webbub 8 AxeL Wave VN 8 Vysakh N Raju  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}