{"link": "https://www.themoviedb.org/tv/56336?language=en", "title": "The Tunnel", "resume": "The plot follows detectives Karl Roebuck and Elise Wasserman working together to find a serial killer who left the upper-half body of a French politician and the lower-half of a British prostitute in the Channel Tunnel, at the midpoint between France and the UK. They later learn that the killer—who comes to be nicknamed the \"Truth Terrorist\"—is on a moral crusade to highlight many social problems, terrorising both countries in the process", "rate": 74, "genre": ["Action", "Adventure", "Crime", "Drama", "Mystery"], "cast": ["Stephen Dillane", "Clémence Poésy", "Thibault de Montalembert", "Cedric Vieira"], "character": ["Karl Roebuck", "Élise Wassermann", "Olivier Pujol", "Phillipe Viot"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56336   Expand The Tunnel   (2013) User Score  Play Trailer Overview The plot follows detectives Karl Roebuck and Elise Wasserman working together to find a serial killer who left the upper-half body of a French politician and the lower-half of a British prostitute in the Channel Tunnel, at the midpoint between France and the UK. They later learn that the killer—who comes to be nicknamed the \"Truth Terrorist\"—is on a moral crusade to highlight many social problems, terrorising both countries in the process Featured Crew Ben Richards Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Dillane Karl Roebuck Clémence Poésy Élise Wassermann Thibault de Montalembert Olivier Pujol Cedric Vieira Phillipe Viot Full Cast & Crew Current Season Season 3: Vengeance 2017 | 6 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply 3rd season was the worst of the bunch Open 0 by MongoLloyd\n      \n     SB I can't believe it !!! Open 0 by Strange Bedfellows\n      \n     s S01 - Stephen Beaumont and the refugee Open 0 by sumithar\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    1996-03-16 Dalziel and Pascoe 7.8    2000-04-26 Rebus 4.9    2012-08-30 Good Cop 6.6    2011-01-13 Kidnap and Ransom 7.6    2004-07-19 The Grid 7.0    2016-06-08 Power Monkeys 7.0  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Action & Adventure Crime Drama Mystery Keywords dead tunnel Content Score 100 Yes! Looking good! Top Contributors M 28 Manu LF 28 Lionel Fusco(POI) CM 8 Cherche Moi 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}