{"link": "https://www.themoviedb.org/tv/10957?language=en", "title": "Australian Survivor", "resume": "Australian Survivor sees 24 tough and tenacious people marooned on a tropical island with little more than the clothes on their backs and the drive to be the sole survivor. Contestants are deprived of basic comforts and must build their own shelter, light their own fires, gather their own food and fend for themselves.", "rate": 51, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10957   Expand Australian Survivor   (2002) User Score Overview Australian Survivor sees 24 tough and tenacious people marooned on a tropical island with little more than the clothes on their backs and the drive to be the sole survivor. Contestants are deprived of basic comforts and must build their own shelter, light their own fires, gather their own food and fend for themselves. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2017 | 26 Episodes Season 4 of Australian Survivor premiered on July 30, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Aww Come on Open 0 by Neuronhead\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Australian Survivor. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://tenplay.com.au/channel-ten/australian-survivor Genres Reality Keywords island competition survivor Content Score 56 We're so close, yet so far. Top Contributors 12 Joe Carson t 10 tassieblueboy 8 Elizabeth Jennings mj 4 melina jhonson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}