{"link": "https://www.themoviedb.org/tv/35257?language=en", "title": "Vicky the Viking", "resume": "Vicky is the only son of Halvar, the formidable viking chief. Vicky renounces violence but nevertheless he is able to convince the seasoned viking warriors to take him along on their voyages. In dangerous situations, where their bravery and force are not quite enough to master the situation, the wild-eyed warriors learn to rely on Vicky's cleverness.", "rate": 70, "genre": ["Animation"], "cast": ["Eiko Masuyama", "Yoko Kurita", "Kousei Tomita"], "character": ["Narrator (voice)", "Wickie (voice)", "Halvar (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35257   Expand Vicky the Viking   (1974) User Score Overview Vicky is the only son of Halvar, the formidable viking chief. Vicky renounces violence but nevertheless he is able to convince the seasoned viking warriors to take him along on their voyages. In dangerous situations, where their bravery and force are not quite enough to master the situation, the wild-eyed warriors learn to rely on Vicky's cleverness. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eiko Masuyama Narrator (voice) Yoko Kurita Wickie (voice) Kousei Tomita Halvar (voice) Full Cast & Crew Last Season Original Air Date Original Air Date Seasonal Splits (TV) Season 1 1974 | 78 Episodes Season 1 of Vicky the Viking premiered on April  3, 1974. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Vicky the Viking. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   1980-01-08 The Wonderful Adventures of Nils 6.8    1971-03-07 Die Sendung mit der Maus 6.4    1975-05-01 The Adventures of Maya the Honey Bee 6.6    1970-02-15 Catweazle 6.0  Facts Original Name  小さなバイキング　ビッケ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Keywords based on novel or book adventure historical anime Content Score 56 We're so close, yet so far. Top Contributors 96 Marr 🇳🇱 21 Elizabeth Jennings d 10 denis m 7 mctm  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}