{"link": "https://www.themoviedb.org/tv/66248?language=en", "title": "Kong: King of the Apes", "resume": "Set in 2050, Kong becomes a wanted fugitive after wrecking havoc at Alcatraz Island’s Natural History and Marine Preserve. What most humans on the hunt for the formidable animal don’t realize, though, is that Kong was framed by an evil genius who plans to terrorize the world with an army of enormous robotic dinosaurs. As the only beast strong enough to save humanity from the mechanical dinos, Kong must rely on the help of three kids who know the truth about him.", "rate": 48, "genre": ["Animation"], "cast": ["Kathleen Barr", "Shannon Chan-Kent", "Alessandro Juliani", "Lee Tockar", "Sam Vincent"], "character": ["Botila", "Amy Quon", "Chatter / Lukas Remy", "Brag / Dr. Leo Remy", "Richard Remy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66248   Expand Kong: King of the Apes   (2016) User Score  Play Trailer Overview Set in 2050, Kong becomes a wanted fugitive after wrecking havoc at Alcatraz Island’s Natural History and Marine Preserve. What most humans on the hunt for the formidable animal don’t realize, though, is that Kong was framed by an evil genius who plans to terrorize the world with an army of enormous robotic dinosaurs. As the only beast strong enough to save humanity from the mechanical dinos, Kong must rely on the help of three kids who know the truth about him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathleen Barr Botila Shannon Chan-Kent Amy Quon Alessandro Juliani Chatter / Lukas Remy Lee Tockar Brag / Dr. Leo Remy Sam Vincent Richard Remy Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of Kong: King of the Apes premiered on May  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kong: King of the Apes. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage   https://www.netflix.com/title/80023612 Genres Animation Keywords future adventure king kong primate Content Score 93 Almost there... Top Contributors a 13 anlecia_jhon d 8 donp971 7 Elizabeth Jennings 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}