{"link": "https://www.themoviedb.org/tv/64800?language=en", "title": "The Pact", "resume": "Piotr Grodecki is an investigative journalist uncovering corruption and scandals at the highest levels of government.", "rate": 64, "genre": ["Mystery", "Crime", "Drama"], "cast": ["Marcin Dorociński", "Marta Nieradkiewicz", "Alicja Dąbrowska", "Witold Dębicki", "Jacek Poniedziałek"], "character": ["Piotr Grodecki", "Weronika", "Monika Szewczyk", "Andrzej", "Daniel Grodecki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64800   Expand The Pact   (2015) User Score  Play Trailer Overview Piotr Grodecki is an investigative journalist uncovering corruption and scandals at the highest levels of government. Featured Crew Marek Lechki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marcin Dorociński Piotr Grodecki Marta Nieradkiewicz Weronika Alicja Dąbrowska Monika Szewczyk Witold Dębicki Andrzej Jacek Poniedziałek Daniel Grodecki Full Cast & Crew Last Season Season 2 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2016-10-02 Belfer 7.1    2014-10-12 The Border 7.0    2014-04-15 Fargo 8.2    1997-08-13 South Park 7.8  Facts Original Name  Pakt Status  Returning Series Network Certification  - Type  Scripted Original Language  Polish Runtime  55m Homepage   http://www.hbo.pl/series/pakt Genres Mystery Crime Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 29 Elizabeth Jennings t 7 tucek 5 Razorback121 h 3 heisenbeerg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}