{"link": "https://www.themoviedb.org/tv/67936?language=en", "title": "Shots Fired", "resume": "A media storm sets off when an African-American cop kills a white teenager in a small North Carolina town.", "rate": 60, "genre": ["Drama"], "cast": ["Sanaa Lathan", "Stephan James", "Richard Dreyfuss", "Aisha Hinds", "Will Patton"], "character": ["Ashe Akino", "Preston Terry", "Arlen Cox", "Pastor Janae James", "Sheriff Platt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67936   Expand Shots Fired   (2017) User Score Overview A media storm sets off when an African-American cop kills a white teenager in a small North Carolina town. Featured Crew Reggie Rock Bythewood Creator Gina Prince-Bythewood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanaa Lathan Ashe Akino Stephan James Preston Terry Richard Dreyfuss Arlen Cox Aisha Hinds Pastor Janae James Will Patton Sheriff Platt Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Shots Fired premiered on March 22, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply b Complicated Open 1 by  bgirlmagic Where is everyone?! Open 11 by  MDBAddict Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   2017-04-16 The White Princess 8.0    2016-10-16 Graves 5.4    2017-10-13 Babylon Berlin 8.5    2017-10-11 Dynasty 6.8    2017-09-25 Absentia 7.3    2016-10-16 Berlin Station 7.4    2016-06-21 Greenleaf 6.8    2017-02-02 Training Day 6.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://fox.com/shots-fired Genres Drama Keywords small town police cover-up racism justice justice department Content Score 100 Yes! Looking good! Top Contributors p 39 paf69 37 Banana 30 Elizabeth Jennings b 4 bobbytu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}