{"link": "https://www.themoviedb.org/tv/71766?language=en", "title": "For The People", "resume": "Brand new lawyers work for both the defense and the prosecution as they handle the most high profile and high stakes cases in the country – all as their personal lives intersect.", "rate": 69, "genre": ["Drama"], "cast": ["Britt Robertson", "Jasmin Savoy Brown", "Ben Rappaport", "Susannah Flood", "Wesam Keesh"], "character": ["Sandra Bell", "Allison Adams", "Seth Oliver", "Kate Littlejohn", "Jay Simmons"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71766   Expand For The People   (2018) User Score  Play Trailer Overview Brand new lawyers work for both the defense and the prosecution as they handle the most high profile and high stakes cases in the country – all as their personal lives intersect. Featured Crew Paul William Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Britt Robertson Sandra Bell Jasmin Savoy Brown Allison Adams Ben Rappaport Seth Oliver Susannah Flood Kate Littlejohn Wesam Keesh Jay Simmons Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of For The People premiered on March 12, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply D Good Show Open 0 by DanGilbert\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2018-03-22 Station 19 6.9    2018-03-07 Life Sentence 5.2    2018-03-29 Siren 7.3    2018-03-11 Deception 7.0    2018-03-18 Instinct 5.9    2018-03-21 Krypton 6.5    2018-03-13 Rise 6.8    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/for-the-people Genres Drama Keywords lawyer courtroom drama legal drama Content Score 100 Yes! Looking good! Top Contributors 36 Warpath 23 Banana 9 Elizabeth Jennings 7 Gabriel W. Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}