{"link": "https://www.themoviedb.org/tv/1636?language=en", "title": "Top of the Pops", "resume": "Top of the Pops, also known as TOTP, is a British music chart television programme, made by the BBC and originally broadcast weekly between 1 January 1964 and 30 July 2006. It was traditionally shown every Thursday evening on BBC1, before being moved to Fridays in 1996, and then to Sundays on BBC Two in 2005. Each weekly programme consisted of performances from some of that week's best-selling popular music artists, with a rundown of that week's singles chart. Additionally, there was a special edition of the programme on Christmas Day, featuring some of the best-selling singles of the year.\nAlthough the weekly show was cancelled, the Christmas special has continued. It also survives as Top of the Pops 2, which began in 1994 and features vintage performances from the Top of the Pops archives.\nIn the 1990s, the show's format was sold to several foreign broadcasters in the form of a franchise package, and at one point various versions of the show were shown in nearly 100 countries. Editions of the programme from the 1970s are being repeated on most Thursdays on BBC Four.", "rate": 66, "genre": [], "cast": ["Peter Powell", "Alan Freeman", "Gary Davies", "Hanna Verboom", "Jackie Brambles"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1636   Expand Top of the Pops   (1964) User Score Overview Top of the Pops, also known as TOTP, is a British music chart television programme, made by the BBC and originally broadcast weekly between 1 January 1964 and 30 July 2006. It was traditionally shown every Thursday evening on BBC1, before being moved to Fridays in 1996, and then to Sundays on BBC Two in 2005. Each weekly programme consisted of performances from some of that week's best-selling popular music artists, with a rundown of that week's singles chart. Additionally, there was a special edition of the programme on Christmas Day, featuring some of the best-selling singles of the year. Although the weekly show was cancelled, the Christmas special has continued. It also survives as Top of the Pops 2, which began in 1994 and features vintage performances from the Top of the Pops archives. In the 1990s, the show's format was sold to several foreign broadcasters in the form of a franchise package, and at one point various versions of the show were shown in nearly 100 countries. Editions of the programme from the 1970s are being repeated on most Thursdays on BBC Four. Featured Crew Johnnie Stewart Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Powell Alan Freeman Gary Davies Hanna Verboom Jackie Brambles Full Cast & Crew Last Season Season 14 1977 | 18 Episodes Season 14 of Top of the Pops premiered on January  6, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2004-05-15 Strictly Come Dancing 4.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00704hg Genres No genres have been added. Keywords music tv program Content Score 86 Almost there... Top Contributors 42 Banana 3 lineker m 2 movienator 2 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}