{"link": "https://www.themoviedb.org/tv/30981?language=en", "title": "Monster", "resume": "Kenzou Tenma, a Japanese brain surgeon in Germany, finds his life in utter turmoil after getting involved with a psychopath that was once a former patient.", "rate": 78, "genre": ["Animation", "Drama"], "cast": ["Mami Koyama", "Mamiko Noto", "Junko Takeuchi", "Tomokazu Seki", "Eiji Hanawa"], "character": ["Eva Heinemann", "Nina Fortner", "Dieter", "Karl Neumann", "Herbert Knaup"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30981   Expand Monster   (2004) User Score Overview Kenzou Tenma, a Japanese brain surgeon in Germany, finds his life in utter turmoil after getting involved with a psychopath that was once a former patient. Featured Crew Masayuki Kojima Creator Naoki Urasawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mami Koyama Eva Heinemann Mamiko Noto Nina Fortner Junko Takeuchi Dieter Tomokazu Seki Karl Neumann Eiji Hanawa Herbert Knaup Full Cast & Crew Last Season Season 1 2004 | 74 Episodes Season 1 of Monster premiered on April  6, 2004. View All Seasons Social Reviews  1 Discussions  1 A review by NiKKtor  10.0 Written by  NiKKtor  on July 15, 2017 Best anime I ever watch,my recommendation. Read All Reviews Media Most Popular Videos  0 Backdrops  4 Posters  8 Recommendations   2004-02-03 Paranoia Agent 7.8    2012-10-12 Psycho-Pass 7.7    2011-04-06 Steins;Gate 8.2    2007-04-01 Gurren Lagann 7.9    2003-10-04 Fullmetal Alchemist 8.0    2015-01-10 Death Parade 7.3    2006-04-08 Black Lagoon 7.9    2012-01-10 Another 7.2  Facts Original Name  MONSTER Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords monster orphanage thriller hospital doctor orphan based on manga police detective seinen picture book Content Score 100 Yes! Looking good! Top Contributors 15 Renato W 12 Wark 12 Panayotis s 8 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}