{"link": "https://www.themoviedb.org/tv/66991?language=en", "title": "Tales of Zestiria the X", "resume": "Legends speak of the Shepherd, a savior who will bring peace to the seraphim and human worlds. Sorey has spent his life studying ancient books and exploring ruins to learn more about this legendary savior. When he and his seraphim companion Mikleo encounter a mysterious girl in the ruins, the stories of the Shepherd become Sorey's reality.", "rate": 77, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66991   Expand Tales of Zestiria the X   (2016) User Score  Play Trailer Overview Legends speak of the Shepherd, a savior who will bring peace to the seraphim and human worlds. Sorey has spent his life studying ancient books and exploring ruins to learn more about this legendary savior. When he and his seraphim companion Mikleo encounter a mysterious girl in the ruins, the stories of the Shepherd become Sorey's reality. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2017 | 13 Episodes Season 2 of Tales of Zestiria the X premiered on January  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2017-04-04 The Royal Tutor 7.7    2016-01-09 Luck & Logic 7.0    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2017-07-12 My First Girlfriend is a Gal 7.4    2015-07-09 SCHOOL-LIVE! 8.1    2006-10-04 Negima!? Magister Negi Magi 5.9    2016-07-02 ReLIFE 7.0    2017-04-01 The Silver Guardian 6.4  Facts Status  Ended Networks - Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://toz-thex-anime.tales-ch.jp/ Genres Animation Sci-Fi & Fantasy Keywords anime Content Score 64 We're so close, yet so far. Top Contributors z 15 zurman1 14 Steinholf 14 Marr 🇳🇱 11 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}