{"link": "https://www.themoviedb.org/tv/35430?language=en", "title": "Tinker Tailor Soldier Spy", "resume": "Tinker, tailor, soldier, sailor, rich man, poor man, beggar-man, thief. George Smiley, the aging master spy of the Cold War and once heir apparent to Control, is brought back out of retirement to flush out a top level mole within the Circus. Smiley must travel back through his life and murky workings of the Circus to unravel the net spun by his nemesis Karla 'The Sandman' of the KGB and reveal the identity of the mole before he disappears.", "rate": 76, "genre": ["Drama"], "cast": ["Alec Guinness", "Michael Jayston", "Terence Rigby", "George Sewell", "Ian Richardson"], "character": ["George Smiley", "Peter Guillam", "Roy Bland", "Mendel", "Bill Haydon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35430   Expand Tinker Tailor Soldier Spy   (1979) User Score Overview Tinker, tailor, soldier, sailor, rich man, poor man, beggar-man, thief. George Smiley, the aging master spy of the Cold War and once heir apparent to Control, is brought back out of retirement to flush out a top level mole within the Circus. Smiley must travel back through his life and murky workings of the Circus to unravel the net spun by his nemesis Karla 'The Sandman' of the KGB and reveal the identity of the mole before he disappears. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alec Guinness George Smiley Michael Jayston Peter Guillam Terence Rigby Roy Bland George Sewell Mendel Ian Richardson Bill Haydon Full Cast & Crew Last Season Season 1 1979 | 7 Episodes Season 1 of Tinker Tailor Soldier Spy premiered on September 10, 1979. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Tinker Tailor Soldier Spy. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   1982-09-20 Smiley's People 7.9    1987-11-04 A Perfect Spy 5.5    1985-11-04 Edge of Darkness 8.4    1983-02-06 The Winds of War 7.0    1978-03-07 Pennies from Heaven 8.2    1967-07-08 Callan 6.0    1983-09-05 Reilly, Ace of Spies 6.8    Die Kinder 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage   https://www.bbc.co.uk/programmes/b006ylbp Genres Drama Keywords great britain espionage spy cold war british mole Content Score 86 Almost there... Top Contributors TB 31 TMDb Bot 5 Matthew Sanders w 3 webmaster e 3 error666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}