{"link": "https://www.themoviedb.org/tv/46732?language=en", "title": "MTV Video Music Awards", "resume": "An MTV Video Music Award (commonly abbreviated as a VMA) is an award presented by the cable channel MTV to honor the best in the music video medium. Originally conceived as an alternative to the Grammy Awards (in the video category), the annual MTV Video Music Awards ceremony has often been called the \"Super Bowl for youth\", an acknowledgment of the VMA ceremony's ability to draw millions of youth from teens to 20-somethings each year. By 2001, the VMA had become a coveted award. The statue given to winners is an astronaut on the moon, one of the earliest representations of MTV. The statue was conceived by Manhattan Design—also designers of the original MTV logo—based on the 1981 \"Top of the Hour\" animation created by Fred Seibert, produced by Alan Goodman, and produced by Buzz Potamkin at Buzzco Associates.\nThe annual VMA ceremony occurs before the end of summer and held either in late August or mid-September, and broadcast live on MTV. The first VMA ceremony was held in 1984 at New York City's Radio City Music Hall. The ceremonies are normally held in either New York City or Los Angeles. However, the ceremonies have also been hosted in Miami and Las Vegas.", "rate": 83, "genre": ["Music", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46732   Expand MTV Video Music Awards   (1984) User Score Overview An MTV Video Music Award (commonly abbreviated as a VMA) is an award presented by the cable channel MTV to honor the best in the music video medium. Originally conceived as an alternative to the Grammy Awards (in the video category), the annual MTV Video Music Awards ceremony has often been called the \"Super Bowl for youth\", an acknowledgment of the VMA ceremony's ability to draw millions of youth from teens to 20-somethings each year. By 2001, the VMA had become a coveted award. The statue given to winners is an astronaut on the moon, one of the earliest representations of MTV. The statue was conceived by Manhattan Design—also designers of the original MTV logo—based on the 1981 \"Top of the Hour\" animation created by Fred Seibert, produced by Alan Goodman, and produced by Buzz Potamkin at Buzzco Associates. The annual VMA ceremony occurs before the end of summer and held either in late August or mid-September, and broadcast live on MTV. The first VMA ceremony was held in 1984 at New York City's Radio City Music Hall. The ceremonies are normally held in either New York City or Los Angeles. However, the ceremonies have also been hosted in Miami and Las Vegas. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 34 2017 | 1 Episode Season 34 of MTV Video Music Awards premiered on August 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on MTV Video Music Awards. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  120m Homepage   http://www.mtv.com/ontv/vma/ Genres Music Reality Keywords music music video performance band awards show Content Score 64 We're so close, yet so far. Top Contributors 91 SWFT 37 Elizabeth Jennings 14 Banana g 8 gugu87  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}