{"link": "https://www.themoviedb.org/tv/721?language=en", "title": "Extreme Makeover: Home Edition", "resume": "Extreme Makeover: Home Edition is an American reality television series providing home improvements for less fortunate families and community schools. The show is hosted by former model, carpenter and veteran television personality Ty Pennington.\nEach episode features a family that has faced some sort of recent or ongoing hardship such as a natural disaster or a family member with a life-threatening illness, in need of new hope. The show's producers coordinate with a local construction contractor, which then coordinates with various companies in the building trades for a makeover of the family's home. This includes interior, exterior and landscaping, performed in seven days while the family is on vacation and documented in the episode. If the house is beyond repair, they replace it entirely. The show's producers and crew film set and perform the makeover but do not pay for it. The materials and labor are donated. Many skilled and unskilled volunteers assist in the rapid construction of the house.\nEM:HE is considered a spinoff of Extreme Makeover, an earlier series providing personal makeovers to selected individuals, which the Home Edition has now outlasted. This show displays extreme changes to help recreate someone's space. However, the format differs considerably; in the original Extreme Makeover, for instance, participants were not necessarily chosen based on any recent hardship, whereas the family's backstory is an important component of Home Edition. EM:HE also has similarities to other home renovation series such as Trading Spaces, on which Pennington was previously a key personality.", "rate": 46, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 721   Expand Extreme Makeover: Home Edition   (2003) User Score Overview Extreme Makeover: Home Edition is an American reality television series providing home improvements for less fortunate families and community schools. The show is hosted by former model, carpenter and veteran television personality Ty Pennington. Each episode features a family that has faced some sort of recent or ongoing hardship such as a natural disaster or a family member with a life-threatening illness, in need of new hope. The show's producers coordinate with a local construction contractor, which then coordinates with various companies in the building trades for a makeover of the family's home. This includes interior, exterior and landscaping, performed in seven days while the family is on vacation and documented in the episode. If the house is beyond repair, they replace it entirely. The show's producers and crew film set and perform the makeover but do not pay for it. The materials and labor are donated. Many skilled and unskilled volunteers assist in the rapid construction of the house. EM:HE is considered a spinoff of Extreme Makeover, an earlier series providing personal makeovers to selected individuals, which the Home Edition has now outlasted. This show displays extreme changes to help recreate someone's space. However, the format differs considerably; in the original Extreme Makeover, for instance, participants were not necessarily chosen based on any recent hardship, whereas the family's backstory is an important component of Home Edition. EM:HE also has similarities to other home renovation series such as Trading Spaces, on which Pennington was previously a key personality. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2011 | 14 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   1995-09-16 Brotherly Love 6.3    2005-09-12 The Tyra Banks Show 3.2    2005-07-20 Criss Angel Mindfreak 4.2    2008-12-03 Man v. Food 6.7    2004-08-31 Dog the Bounty Hunter 3.4    1987-09-13 The New Statesman 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.abc.go.com/primetime/xtremehome/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors z 5 zurman1 j 3 jnylen 2 Louis-Philippe 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}