{"link": "https://www.themoviedb.org/tv/478?language=en", "title": "Captain Planet and the Planeteers", "resume": "Captain Planet and the Planeteers is an American animated environmentalist television program created by Ted Turner, Robert Larkin III, and Barbara Pyle, produced by Pyle, Nicholas Boxer, Andy Heyward and Robby London, and developed by Pyle, Boxer, Heyward, London, Thom Beers, Bob Forward, Phil Harnage and Cassandra Schafhausen. The series was produced by Turner Program Services and DIC Entertainment and it was broadcast on TBS from September 15, 1990 to December 5, 1992. A sequel series, The New Adventures of Captain Planet, was produced by Hanna-Barbera and Turner Program Services, and was broadcast from September 11, 1993 to May 11, 1996. Both series continue today in syndication. The program is a form of edutainment and advocates environmentalism.\nIn February 2009, Mother Nature Network began airing episodes and unreleased footage of Captain Planet and the Planeteers on its website. In September 2010, the Planeteer Movement was launched with the assistance of Pyle as a means for fans of the show to connect and continue to integrate the show's messages into their lives as real-life Planeteers.", "rate": 59, "genre": ["Animation", "Action", "Adventure"], "cast": ["Frank Welker", "Joey Dedio", "LeVar Burton", "Whoopi Goldberg", "Janice Kawaye"], "character": ["Kwame"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 478   Expand Captain Planet and the Planeteers   (1990) User Score  Play Trailer Overview Captain Planet and the Planeteers is an American animated environmentalist television program created by Ted Turner, Robert Larkin III, and Barbara Pyle, produced by Pyle, Nicholas Boxer, Andy Heyward and Robby London, and developed by Pyle, Boxer, Heyward, London, Thom Beers, Bob Forward, Phil Harnage and Cassandra Schafhausen. The series was produced by Turner Program Services and DIC Entertainment and it was broadcast on TBS from September 15, 1990 to December 5, 1992. A sequel series, The New Adventures of Captain Planet, was produced by Hanna-Barbera and Turner Program Services, and was broadcast from September 11, 1993 to May 11, 1996. Both series continue today in syndication. The program is a form of edutainment and advocates environmentalism. In February 2009, Mother Nature Network began airing episodes and unreleased footage of Captain Planet and the Planeteers on its website. In September 2010, the Planeteer Movement was launched with the assistance of Pyle as a means for fans of the show to connect and continue to integrate the show's messages into their lives as real-life Planeteers. Featured Crew Ted Turner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Welker Joey Dedio LeVar Burton Kwame Whoopi Goldberg Janice Kawaye Full Cast & Crew Last Season Season 6 1995 | 13 Episodes Season 6 of Captain Planet and the Planeteers premiered on September  9, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   1986-09-13 The Real Ghostbusters 6.9    1990-09-14 Tiny Toon Adventures 7.3    1984-11-05 Muppet Babies 7.2    1986-09-15 Rambo 5.7    1991-09-07 Taz-Mania 6.3    1991-08-11 Doug 7.0    1967-09-09 The Herculoids 7.7    1985-01-23 ThunderCats 7.3  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.turner.com/planet/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 9 TFZ02 4 minhus NS 3 Norte Serra s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}