{"link": "https://www.themoviedb.org/tv/37437?language=en", "title": "Heaven's Lost Property", "resume": "Girl-crazy Tomoki’s quiet life gets turned upside down when beautiful, winged Ikaros falls from the sky – and starts calling him master! She seems a little bit lost on Earth, and her origins are shrouded in mystery. One thing’s for sure, though – she just might have the power to make Tomoki’s every dream come true!\nThe heavenly hijinks continue in Heaven’s Lost Property: Forte! Tomoki may long for peace and quiet, but with Ikaros and Nymph still adjusting to life on Earth, things aren’t likely to calm down anytime soon. Plus, there’s a new Angeloid on the scene – and she’s been sent to eliminate Tomoki!\nAnd check out the hilarious, super-sexy Heaven’s Lost Property movie, The Angeloid of Clockwork! Hiyori’s a sweet, shy girl infatuated with Tomoki. To get closer to the dirty-minded object of her affection, she joins the New World Discovery Club and starts bonding with Ikaros, Nymph, and the gang – until a sudden, tragic accident changes everything. Why is she trying to kill Tomoki, even after confessing her feelings?", "rate": 53, "genre": ["Animation", "Comedy", "Drama", "Fantasy", "Romance"], "cast": ["Saori Hayami", "Ayahi Takagaki", "Kaori Fukuhara", "Iori Nomizu", "Soichiro Hoshi"], "character": ["Ikaros", "Mikako Satsukitane", "Astraea", "Nymph", "Tomoki Sakurai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37437   Expand Heaven's Lost Property   (2009) User Score  Play Trailer Overview Girl-crazy Tomoki’s quiet life gets turned upside down when beautiful, winged Ikaros falls from the sky – and starts calling him master! She seems a little bit lost on Earth, and her origins are shrouded in mystery. One thing’s for sure, though – she just might have the power to make Tomoki’s every dream come true! The heavenly hijinks continue in Heaven’s Lost Property: Forte! Tomoki may long for peace and quiet, but with Ikaros and Nymph still adjusting to life on Earth, things aren’t likely to calm down anytime soon. Plus, there’s a new Angeloid on the scene – and she’s been sent to eliminate Tomoki! And check out the hilarious, super-sexy Heaven’s Lost Property movie, The Angeloid of Clockwork! Hiyori’s a sweet, shy girl infatuated with Tomoki. To get closer to the dirty-minded object of her affection, she joins the New World Discovery Club and starts bonding with Ikaros, Nymph, and the gang – until a sudden, tragic accident changes everything. Why is she trying to kill Tomoki, even after confessing her feelings? Featured Crew Suu Minazuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  9 Videos Trailers  2 Teasers  0 Clips  3 Featurettes  0 Opening Credits  0 Top Billed Cast Saori Hayami Ikaros Ayahi Takagaki Mikako Satsukitane Kaori Fukuhara Astraea Iori Nomizu Nymph Soichiro Hoshi Tomoki Sakurai Full Cast & Crew Last Season Heaven's Lost Property Forte 2010 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  5 Backdrops  11 Posters  9 Recommendations   2012-04-05 Sankarea: Undying Love 7.0    2012-07-08 Kokoro Connect 7.0    Sekirei Pure Engagement 8.2    2011-04-14 Aria the Scarlet Ammo 6.4    2008-07-02 Sekirei 7.7    2015-07-07 Bikini Warriors 4.4    2006-04-04 Air Gear 5.3    2010-04-02 Yamada's First Time: B Gata H Kei 7.5  Facts Original Name  そらのおとしもの Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/heavens-lost-property/home Genres Animation Comedy Drama Fantasy Romance Keywords angel harem school based on manga parallel world ecchi anime fan service Content Score 100 Yes! Looking good! Top Contributors 23 WillofOwn 12 sp1ti s 9 sheva_vitali 7 Sadwick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}