{"link": "https://www.themoviedb.org/tv/7777?language=en", "title": "Better Off Ted", "resume": "Better Off Ted is an American satirical situation comedy series, created by Victor Fresco, who also served as the show's Executive Producer. The series ran on the ABC network from March 18, 2009 to January 26, 2010.\nBetter Off Ted focuses on the protagonist, Ted Crisp, a single father and the well-respected and beloved head of a research and development department at the fictional, soulless conglomerate of Veridian Dynamics. Ted narrates the series' events by regularly breaking the fourth wall and directly addressing the audience as the show's on-camera narrator. Supporting characters include Ted's supervisor Veronica Palmer, co-worker and love interest Linda Zwordling, his daughter Rose, and laboratory scientists Phillip Myman and Lem Hewitt.\nThe series received critical acclaim, with particular praise going towards its witty and satirical humor. Its second season holds a score of 84 out of 100 on Metacritic. However, despite such positive feedback, the show's debut only drew in 5.64 million viewers and continued to have extremely low ratings. Although many expressed skepticism towards whether or not it would return, the show was renewed for a second season. On May 13, 2010, ABC officially canceled the series due to low viewing figures. Two episodes were unaired in the United States, but are available to view on Netflix, Amazon Video on Demand, Xbox Live Marketplace, and iTunes.", "rate": 78, "genre": ["Comedy"], "cast": ["Jay Harrington", "Portia de Rossi", "Andrea Anders", "Jonathan Slavin", "Malcolm Barrett"], "character": ["Theodore 'Ted' Crisp", "Veronica Palmer", "Linda Zwordling", "Philip 'Phil' Myman", "Lem Hewitt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7777   Expand Better Off Ted   (2009) User Score  Play Trailer Overview Better Off Ted is an American satirical situation comedy series, created by Victor Fresco, who also served as the show's Executive Producer. The series ran on the ABC network from March 18, 2009 to January 26, 2010. Better Off Ted focuses on the protagonist, Ted Crisp, a single father and the well-respected and beloved head of a research and development department at the fictional, soulless conglomerate of Veridian Dynamics. Ted narrates the series' events by regularly breaking the fourth wall and directly addressing the audience as the show's on-camera narrator. Supporting characters include Ted's supervisor Veronica Palmer, co-worker and love interest Linda Zwordling, his daughter Rose, and laboratory scientists Phillip Myman and Lem Hewitt. The series received critical acclaim, with particular praise going towards its witty and satirical humor. Its second season holds a score of 84 out of 100 on Metacritic. However, despite such positive feedback, the show's debut only drew in 5.64 million viewers and continued to have extremely low ratings. Although many expressed skepticism towards whether or not it would return, the show was renewed for a second season. On May 13, 2010, ABC officially canceled the series due to low viewing figures. Two episodes were unaired in the United States, but are available to view on Netflix, Amazon Video on Demand, Xbox Live Marketplace, and iTunes. Featured Crew Victor Fresco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Harrington Theodore 'Ted' Crisp Portia de Rossi Veronica Palmer Andrea Anders Linda Zwordling Jonathan Slavin Philip 'Phil' Myman Malcolm Barrett Lem Hewitt Full Cast & Crew Last Season Season 2 2009 | 13 Episodes Season 2 of Better Off Ted premiered on December  8, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Better Off Ted. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  6 Recommendations   2007-10-02 Pushing Daisies 7.8    2004-03-12 Wonderfalls 7.8    2010-09-21 Running Wilde 6.8    2008-12-08 Childrens Hospital 7.0    2009-03-20 Party Down 7.4    2013-10-06 Was It Something I Said? 7.6    2013-01-16 Kroll Show 7.1    2007-09-25 Reaper 7.0  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m, 21m Homepage   http://abc.go.com/primetime/betteroffted/ Genres Comedy Keywords satire evil corporation single father workplace comedy Content Score 100 Yes! Looking good! Top Contributors 14 Banana 9 United600 F 8 Fayu z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}