{"link": "https://www.themoviedb.org/tv/42503?language=en", "title": "Deadman Wonderland", "resume": "Ganta is the only survivor after a mysterious man in red slaughters a classroom full of teenagers. He's framed for the carnage, sentenced to die, and locked away in the most twisted prison ever built: Deadman Wonderland. And then it gets worse.", "rate": 71, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Romi Park", "Kana Hanazawa"], "character": ["Ganta Igarashi (voice)", "Shiro (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42503   Expand Deadman Wonderland   (2011) User Score  Play Trailer Overview Ganta is the only survivor after a mysterious man in red slaughters a classroom full of teenagers. He's framed for the carnage, sentenced to die, and locked away in the most twisted prison ever built: Deadman Wonderland. And then it gets worse. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Romi Park Ganta Igarashi (voice) Kana Hanazawa Shiro (voice) Full Cast & Crew Last Season Original Air Date Original Air Date Netflix Order (Digital) Season 1 2011 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  7 Recommendations   2014-07-06 Akame ga Kill! 7.0    2011-10-09 The Future Diary 6.8    2008-04-07 Soul Eater 7.0    2012-01-10 Another 7.2    2016-07-08 Alderamin on the Sky 7.4    2009-04-02 Phantom: Requiem for the Phantom 6.4    2013-03-31 Date a Live 7.9    2015-01-10 Death Parade 7.3  Facts Original Name  デッドマン・ワンダーランド Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords prison dystopia conspiracy violence underground fighting super power censored anime human weapon Content Score 64 We're so close, yet so far. Top Contributors 108 Marr 🇳🇱 27 WillofOwn 18 Thxneo W 12 Watcher14  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}