{"link": "https://www.themoviedb.org/tv/49203?language=en", "title": "The Grand Mansion Gate", "resume": "This Chinese period drama series follows the fortunes of a prominent merchant family engaged in Traditional Chinese Medicine during the waning years of the Ching dynasty. The affairs of this family of doctors/pharmacists (which in those days were one and the same) are intimately linked with social upheavals of the time such as the encroachment of Christian missionaries and foreign imperialism as well as conflicts that inevitably emerge in a large upper class family. Comparable in scope and production value to such recent titles as \"Downton Abbey\", the lives and character of both masters and servants intertwine in plot lines that spans more than a generation.", "rate": 80, "genre": ["Drama"], "cast": ["He Saifei", "Jiang Wenli", "Liu Pei", "Han Tongsheng", "Jiang Shan"], "character": ["杨九红", "白玉婷", "白佳莉", "关静山", "李香秀"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49203   Expand The Grand Mansion Gate   (2001) User Score Overview This Chinese period drama series follows the fortunes of a prominent merchant family engaged in Traditional Chinese Medicine during the waning years of the Ching dynasty. The affairs of this family of doctors/pharmacists (which in those days were one and the same) are intimately linked with social upheavals of the time such as the encroachment of Christian missionaries and foreign imperialism as well as conflicts that inevitably emerge in a large upper class family. Comparable in scope and production value to such recent titles as \"Downton Abbey\", the lives and character of both masters and servants intertwine in plot lines that spans more than a generation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast He Saifei 杨九红 Jiang Wenli 白玉婷 Liu Pei 白佳莉 Han Tongsheng 关静山 Jiang Shan 李香秀 Full Cast & Crew Last Season Season 2 2003 | 32 Episodes Season 2 of The Grand Mansion Gate premiered on April 16, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Grand Mansion Gate. You can help by rating TV shows you've seen. Facts Original Name  大宅门 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage   https://movie.douban.com/subject/2181930/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors k 46 ktoswang 10 Elizabeth Jennings d 1 dwno_1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}