{"link": "https://www.themoviedb.org/tv/34965?language=en", "title": "Mrs Brown's Boys", "resume": "Mrs. Brown's Boys is a British-Irish award winning sitcom created by and starring writer and performer Brendan O'Carroll. The show is based on O'Carroll's stage plays about the character Agnes Browne, which were developed from books and straight-to-DVD films. The sitcom continues the stories of Agnes, now with the shortened surname \"Brown\", and her family who are played by real life close friends and family of O'Carroll's. After being slated by critics, the show has become a ratings success in both Ireland, where it is set, and the United Kingdom, where it is recorded. On 29 December 2012 the show began its third series. Mrs Brown's Boys is a co-production among BBC Scotland, BocPix and RTÉ.", "rate": 73, "genre": ["Comedy"], "cast": ["Danny O'Carroll"], "character": ["Buster Brady"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34965   Expand Mrs Brown's Boys   (2011) User Score  Play Trailer Overview Mrs. Brown's Boys is a British-Irish award winning sitcom created by and starring writer and performer Brendan O'Carroll. The show is based on O'Carroll's stage plays about the character Agnes Browne, which were developed from books and straight-to-DVD films. The sitcom continues the stories of Agnes, now with the shortened surname \"Brown\", and her family who are played by real life close friends and family of O'Carroll's. After being slated by critics, the show has become a ratings success in both Ireland, where it is set, and the United Kingdom, where it is recorded. On 29 December 2012 the show began its third series. Mrs Brown's Boys is a co-production among BBC Scotland, BocPix and RTÉ. Featured Crew Brendan O'Carroll Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Danny O'Carroll Buster Brady Full Cast & Crew Current Season Season 4 2017 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  5 Posters  4 Recommendations   1993-11-18 Goodnight Sweetheart 8.2    1982-11-02 Countdown 5.4    1976-02-20 Open All Hours 7.7    1962-01-04 Steptoe and Son 8.2    1994-11-10 The Vicar of Dibley 7.3    1976-09-06 George and Mildred 6.6    1973-02-15 Some Mothers Do 'Ave 'Em 7.8    2007-06-09 Britain's Got Talent 4.2  Facts Status  Returning Series Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00x98tn Genres Comedy Keywords mother big family live comedy irish live audience family sitcom matriarch Content Score 71 Just a little bit more... Top Contributors 20 Elizabeth Jennings 14 MrSwift y 10 ymz3w2xfsdtzmcsu O 9 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}