{"link": "https://www.themoviedb.org/tv/11285?language=en", "title": "The Mysterious Cities of Gold", "resume": "The adventures of a young Spanish boy named Esteban who joins a voyage to the New World in search of the lost Cities of Gold and his father.", "rate": 89, "genre": ["Kids", "Animation", "Action", "Adventure"], "cast": ["Koichi Chiba"], "character": ["Mayuka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11285   Expand The Mysterious Cities of Gold   (1982) User Score Overview The adventures of a young Spanish boy named Esteban who joins a voyage to the New World in search of the lost Cities of Gold and his father. Featured Crew Jean Chalopin Creator Mitsuru Kaneko Creator Mitsuru Majima Creator Soji Yoshikawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  12 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Koichi Chiba Mayuka Full Cast & Crew Last Season Season 3 2016 | 26 Episodes Season 3 of The Mysterious Cities of Gold premiered on October 12, 2016. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for The Mysterious Cities of Gold. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  7 Recommendations   1983-10-13 Captain Tsubasa 7.0    2011-10-26 Frozen Planet 8.3    1987-09-18 DuckTales 7.6    1981-09-12 The Smurfs 6.2    1976-09-18 The Muppet Show 7.8    1988-11-24 Mystery Science Theater 3000 7.8  Facts Original Name  太陽の子エステバン Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Japanese Runtime  28m, 27m Homepage  - Genres Kids Animation Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 16 nycos 8 Banana d 7 denis t 6 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}