{"link": "https://www.themoviedb.org/tv/4379?language=en", "title": "Riptide", "resume": "Riptide is an American TV detective series that ran on NBC from December 3, 1983 to August 22, 1986, starring Perry King, Joe Penny, and Thom Bray. Riptide was created by Frank Lupo and Stephen J. Cannell, and produced by Stephen J. Cannell Productions in the wake of Magnum PI's success. The main theme was composed by Mike Post and Pete Carpenter. A mid-season replacement, it debuted as a two-hour TV movie in early 1984.", "rate": 70, "genre": ["Crime", "Drama", "Action", "Adventure"], "cast": ["Perry King", "Joe Penny", "Thom Bray", "Jack Ging", "June Chadwick"], "character": ["Cody Allen", "Nick Ryder", "Dr. Murray Bozinsky", "Lt. Theodore Quinlan", "Lt. Joanna Parisi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4379   Expand Riptide   (1984) User Score Overview Riptide is an American TV detective series that ran on NBC from December 3, 1983 to August 22, 1986, starring Perry King, Joe Penny, and Thom Bray. Riptide was created by Frank Lupo and Stephen J. Cannell, and produced by Stephen J. Cannell Productions in the wake of Magnum PI's success. The main theme was composed by Mike Post and Pete Carpenter. A mid-season replacement, it debuted as a two-hour TV movie in early 1984. Featured Crew Stephen J. Cannell Creator Frank Lupo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Perry King Cody Allen Joe Penny Nick Ryder Thom Bray Dr. Murray Bozinsky Jack Ging Lt. Theodore Quinlan June Chadwick Lt. Joanna Parisi Full Cast & Crew Last Season Season 3 1985 | 22 Episodes Season 3 of Riptide premiered on October  1, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   1977-09-22 Man from Atlantis 5.6    1983-03-08 The Fall Guy 6.4    1987-09-26 Jake and the Fatman 4.9    1983-09-18 Hardcastle and McCormick 6.1    1987-09-14 Saber Rider and the Star Sheriffs 7.5    1984-01-22 Airwolf 6.6    1979-09-22 Hart to Hart 6.5    1971-09-14 Cannon 5.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  48m Homepage  - Genres Crime Drama Action & Adventure Keywords private investigator los angeles ex soldier detective agency Content Score 93 Almost there... Top Contributors 20 Banana p 9 pertolero d 7 denis b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}