{"link": "https://www.themoviedb.org/tv/37472?language=en", "title": "The Octonauts", "resume": "The Octonauts is a British children's television series, produced by Silvergate Media for the BBC channel Cbeebies. The series is animated in Ireland by Brown Bag Films but uses British voice actors. The TV series is based on American-Canadian children's books written by Vicki Wong and Michael C. Murphy of Meomi Design Inc.\nThe Octonauts follows an underwater exploring crew made up of stylized anthropomorphic animals, a team of eight adventurers who live in an undersea base, the Octopod, from where they go on undersea adventures with the help of a fleet of aquatic vehicles.\nThe subject matter is reminiscent of Star Trek and Thunderbirds blended with Jacques Cousteau. Although it is science fiction as regards its technology, the exotic creatures and locations that the crew encounter are real marine animals in their natural habitats.", "rate": 63, "genre": ["Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37472   Expand The Octonauts   (2010) User Score Overview The Octonauts is a British children's television series, produced by Silvergate Media for the BBC channel Cbeebies. The series is animated in Ireland by Brown Bag Films but uses British voice actors. The TV series is based on American-Canadian children's books written by Vicki Wong and Michael C. Murphy of Meomi Design Inc. The Octonauts follows an underwater exploring crew made up of stylized anthropomorphic animals, a team of eight adventurers who live in an undersea base, the Octopod, from where they go on undersea adventures with the help of a fleet of aquatic vehicles. The subject matter is reminiscent of Star Trek and Thunderbirds blended with Jacques Cousteau. Although it is science fiction as regards its technology, the exotic creatures and locations that the crew encounter are real marine animals in their natural habitats. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2015 | 24 Episodes Season 4 of The Octonauts premiered on September 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations   2009-06-25 Stoked 6.3    2009-04-04 Special Agent Oso 4.3    2008-09-22 Chuggington 6.0    2013-02-18 Sarah & Duck 6.0    2007-09-03 Super Why! 5.7    2006-02-15 Bondi Rescue 7.8  Facts Status  Returning Series Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  15m Homepage   http://disneyjunior.com/the-octonauts Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors S 12 Sandleiy 11 Elizabeth Jennings R 7 Raabi2208 SW 6 Shane Whitehead  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}