{"link": "https://www.themoviedb.org/tv/30980?language=en", "title": "A Certain Magical Index", "resume": "Kamijo is a student in Academy City, where people use science to develop supernatural abilities. The guy’s got a lot of heart – luckily for a young nun named Index. She’s on the run from a sorcery society that covets the astonishing 103,000 volumes of magical knowledge stored in her memory. When Index stumbles into Kamijo’s life, she find a faithful friend and protector, and while Kamijo’s easily the weakest kid in Academy City, he’s got something else going for him: the Imagine Breaker, an unexplainable power stored in his right hand that negates the powers of others. With scientists and sorcerers attacking from all sides, the Imagine Breaker will definitely come in handy – but it’s Kamijo’s loyalty to Index that will be his greatest weapon in the fight to keep her safe.", "rate": 69, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Kishou Taniyama", "Nobuhiko Okamoto", "Atsushi Abe", "Satomi Arai", "Yuka Iguchi"], "character": ["Style Magnus", "Accelerator", "Tōma Kamijō", "Kuroko Shirai", "Index"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30980   Expand A Certain Magical Index   (2008) User Score  Play Trailer Overview Kamijo is a student in Academy City, where people use science to develop supernatural abilities. The guy’s got a lot of heart – luckily for a young nun named Index. She’s on the run from a sorcery society that covets the astonishing 103,000 volumes of magical knowledge stored in her memory. When Index stumbles into Kamijo’s life, she find a faithful friend and protector, and while Kamijo’s easily the weakest kid in Academy City, he’s got something else going for him: the Imagine Breaker, an unexplainable power stored in his right hand that negates the powers of others. With scientists and sorcerers attacking from all sides, the Imagine Breaker will definitely come in handy – but it’s Kamijo’s loyalty to Index that will be his greatest weapon in the fight to keep her safe. Featured Crew 镰池和马 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kishou Taniyama Style Magnus Nobuhiko Okamoto Accelerator Atsushi Abe Tōma Kamijō Satomi Arai Kuroko Shirai Yuka Iguchi Index Full Cast & Crew Last Season Season 2 2010 | 24 Episodes Season 2 of A Certain Magical Index premiered on October  8, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  3 Recommendations   2010-01-05 Ladies versus Butlers! 10.0    2011-04-14 Aria the Scarlet Ammo 6.4    2012-04-08 Dusk Maiden of Amnesia 7.6    2014-04-09 Chaika - The Coffin Princess 8.2    2005-04-17 Eureka Seven 7.7    2017-07-04 Tsuredure Children 8.0    2011-10-07 Haganai: I Don't Have Many Friends 7.7    2011-07-07 Mayo Chiki! 9.5  Facts Original Name  とある魔術の禁書目録 Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/a-certain-magical-index/home Genres Action & Adventure Animation Sci-Fi & Fantasy Drama Comedy Keywords magic supernatural school wizard anime Content Score 100 Yes! Looking good! Top Contributors 39 WillofOwn s 8 sheva_vitali d 6 dnakew 5 zerotaichou  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}