{"link": "https://www.themoviedb.org/tv/115?language=en", "title": "A Different World", "resume": "A Different World is an American television sitcom which aired for six seasons on NBC. It is a spin-off series from The Cosby Show and originally centered on Denise Huxtable and the life of students at Hillman College, a fictional mixed but historically black college in the state of Virginia. After Bonet's departure in the first season, the remainder of the series primarily focused more on Southern belle Whitley Gilbert and mathematics whiz Dwayne Wayne. The series frequently depicted members of the major historically black fraternities and sororities.\nWhile it was a spin-off from The Cosby Show, A Different World would typically address issues that were avoided by The Cosby Show writers. One episode that aired in 1990 was one of the first American network television episodes to address the HIV/AIDS epidemic.", "rate": 52, "genre": ["Comedy"], "cast": ["Cree Summer", "Jasmine Guy", "Dawnn Lewis", "Kadeem Hardison", "Charnele Brown"], "character": ["Winifred 'Freddie' Brooks", "Whitley Marion Gilbert", "Jaleesa Vinson-Taylor", "Dwayne Cleophus Wayne", "Kimberly Reese"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 115   Expand A Different World   (1987) User Score Overview A Different World is an American television sitcom which aired for six seasons on NBC. It is a spin-off series from The Cosby Show and originally centered on Denise Huxtable and the life of students at Hillman College, a fictional mixed but historically black college in the state of Virginia. After Bonet's departure in the first season, the remainder of the series primarily focused more on Southern belle Whitley Gilbert and mathematics whiz Dwayne Wayne. The series frequently depicted members of the major historically black fraternities and sororities. While it was a spin-off from The Cosby Show, A Different World would typically address issues that were avoided by The Cosby Show writers. One episode that aired in 1990 was one of the first American network television episodes to address the HIV/AIDS epidemic. Featured Crew Bill Cosby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cree Summer Winifred 'Freddie' Brooks Jasmine Guy Whitley Marion Gilbert Dawnn Lewis Jaleesa Vinson-Taylor Kadeem Hardison Dwayne Cleophus Wayne Charnele Brown Kimberly Reese Full Cast & Crew Last Season Season 6 1992 | 25 Episodes Season 6 of A Different World premiered on September 24, 1992. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Jaleesa: Happy Birthday Dawnn Lewis! Open 0 by wonder2wonder\n      \n     w Dwayne Wayne: Happy Birthday Kadeem Hardison! Open 0 by wonder2wonder\n      \n     A Different World. Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1985-03-15 Mr. Belvedere 6.8    1984-09-25 Three's a Crowd 6.7    1983-09-16 Webster 4.9    1986-09-17 Head of the Class 6.3    1987-09-20 My Two Dads 5.7    1984-09-18 Punky Brewster 6.8    1982-09-25 Silver Spoons 5.1    1984-03-19 Kate & Allie 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords college racism sitcom social issues black sitcom Content Score 93 Almost there... Top Contributors 11 Banana w 9 wonder2wonder 3 Zlogorek 3 dzero  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}