{"link": "https://www.themoviedb.org/tv/79347?language=en", "title": "Miss Sherlock", "resume": "Sherlock has a peculiar character flaw. She does not open her heart to strangers. She is Japanese, but was born in Britain. She now works as an investigation consultant for the police department. Wato Tachibana is an excellent surgeon and is guided by the principal of justice. Sherlock and Wato Tachibana get to know each other through a case and begin to rely on each other.", "rate": 0, "genre": ["Crime"], "cast": ["Yuko Takeuchi", "Shihori Kanjiya", "Tomoya Nakamura", "Ran Ito", "Kenichi Takito"], "character": ["Sherlock", "Wato Tachibana", "Sergeant Shibata", "Kimie Hatano", "Detective Reimon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79347   Expand Miss Sherlock   (2018) User Score  Play Trailer Overview Sherlock has a peculiar character flaw. She does not open her heart to strangers. She is Japanese, but was born in Britain. She now works as an investigation consultant for the police department. Wato Tachibana is an excellent surgeon and is guided by the principal of justice. Sherlock and Wato Tachibana get to know each other through a case and begin to rely on each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuko Takeuchi Sherlock Shihori Kanjiya Wato Tachibana Tomoya Nakamura Sergeant Shibata Ran Ito Kimie Hatano Kenichi Takito Detective Reimon Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Miss Sherlock premiered on April 27, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Miss Sherlock. You can help by rating TV shows you've seen. Facts Original Name  ミス・シャーロック Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   https://www.happyon.jp/static/miss-sherlock/ Genres Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors c 17 ctchim 13 kiirea 6 Elizabeth Jennings M 6 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}