{"link": "https://www.themoviedb.org/tv/6343?language=en", "title": "Painkiller Jane", "resume": "Painkiller Jane is an American-Canadian science fiction and action television series based on the comic book character of the same name. Airing on the Sci Fi Channel in the US starting April 13, 2007 and Global in Canada, it starred Kristanna Loken as the titular character. On August 15, 2007, it was canceled after one season of 22 episodes.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Kristanna Loken", "Alaina Huffman", "Rob Stewart", "Noah Danby", "Stephen Lobo"], "character": ["Jane Vasco", "Maureen Bowers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6343   Expand Painkiller Jane   (2005) User Score Overview Painkiller Jane is an American-Canadian science fiction and action television series based on the comic book character of the same name. Airing on the Sci Fi Channel in the US starting April 13, 2007 and Global in Canada, it starred Kristanna Loken as the titular character. On August 15, 2007, it was canceled after one season of 22 episodes. Featured Crew Gil Grant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristanna Loken Jane Vasco Alaina Huffman Maureen Bowers Rob Stewart Noah Danby Stephen Lobo Full Cast & Crew Last Season Season 1 2005 | 22 Episodes Season 1 of Painkiller Jane premiered on December 10, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations   1994-10-03 Space Precinct 6.0    2006-06-28 Blade - The Series 5.4    2004-10-24 ReGenesis 7.0    2007-09-26 Bionic Woman 5.5    1985-03-07 Miss Marple: A Pocketful of Rye 6.8    2015-04-02 Olympus 4.7    2011-02-16 Criminal Minds: Suspect Behavior 6.2    2003-09-10 Jake 2.0 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage   http://www.scifi.com/painkillerjane/ Genres Sci-Fi & Fantasy Action & Adventure Keywords immortality based on comic secret government organization superhuman Content Score 93 Almost there... Top Contributors 15 Banana d 6 denis z 5 zurman1 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}