{"link": "https://www.themoviedb.org/tv/18829?language=en", "title": "The World's Strictest Parents", "resume": "The World's Strictest Parents is a television series developed by TwentyTwenty Television, originally broadcast in Britain by the BBC. America's CMT and Australia's Channel Seven have both created localised versions of the programme, with the CMT episodes frequently rebroadcasting on MTV. There is also a German version called \"Die strengsten Eltern der Welt\".\nThe concept is that two so-called \"unruly\" teenagers are sent to live abroad with a strict host family for a week in an attempt to change their behaviour. During the week they receive an impact letter from their real parents with a list of issues they should try to fix.", "rate": 0, "genre": [], "cast": ["Axle Whitehead"], "character": ["Himself (host)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18829   Expand The World's Strictest Parents   (2008) User Score Overview The World's Strictest Parents is a television series developed by TwentyTwenty Television, originally broadcast in Britain by the BBC. America's CMT and Australia's Channel Seven have both created localised versions of the programme, with the CMT episodes frequently rebroadcasting on MTV. There is also a German version called \"Die strengsten Eltern der Welt\". The concept is that two so-called \"unruly\" teenagers are sent to live abroad with a strict host family for a week in an attempt to change their behaviour. During the week they receive an impact letter from their real parents with a list of issues they should try to fix. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Axle Whitehead Himself (host) Full Cast & Crew Last Season Season 4 2011 | 7 Episodes Season 4 of The World's Strictest Parents premiered on November  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The World's Strictest Parents. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors H 1 Heleandra 1 Rug  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}