{"link": "https://www.themoviedb.org/tv/1441?language=en", "title": "Threshold", "resume": "Threshold was a science fiction drama television series that first aired on CBS in September 2005. Produced by Brannon Braga, David S. Goyer and David Heyman, the series focuses on a secret government project investigating the first contact with an extraterrestrial species.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Drama", "Action", "Adventure"], "cast": ["Carla Gugino", "Brian Van Holt", "Brent Spiner", "Rob Benedict", "Peter Dinklage"], "character": ["Dr. Molly Anne Caffrey", "Sean Cavennaugh", "Dr. Nigel Fenway", "Lucas Pegg", "Arthur Ramsey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1441   Expand Threshold   (2005) User Score Overview Threshold was a science fiction drama television series that first aired on CBS in September 2005. Produced by Brannon Braga, David S. Goyer and David Heyman, the series focuses on a secret government project investigating the first contact with an extraterrestrial species. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carla Gugino Dr. Molly Anne Caffrey Brian Van Holt Sean Cavennaugh Brent Spiner Dr. Nigel Fenway Rob Benedict Lucas Pegg Peter Dinklage Arthur Ramsey Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Threshold premiered on September 16, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   1983-09-05 Reilly, Ace of Spies 6.8    2007-09-26 Bionic Woman 5.5    2005-09-19 Invasion 6.9    1998-09-09 First Wave 6.6    1996-10-25 Millennium 7.3    2012-11-09 Battlestar Galactica: Blood & Chrome 6.8    2014-05-30 Crossbones 6.0    2000-06-09 The Invisible Man 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Sci-Fi & Fantasy Drama Action & Adventure Keywords alien alien invasion top secret Content Score 86 Almost there... Top Contributors 8 Travis Bell L 7 Lysator 5 Banana w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}