{"link": "https://www.themoviedb.org/tv/52644?language=en", "title": "K-pop Star", "resume": "Survival Audition K-pop Star is a South Korean reality TV competition series where the three largest entertainment/talent agencies in South Korea hold worldwide auditions to find the next potential K-Pop stars. Preliminary auditions are held around the world in Asia, North America, South America, Europe, and Australia. The final winner will debut with the company of his or her choice, along with a cash prize of three hundred million won, two brand new vehicles, opportunities to become commercial models and casting in dramas, and many more.\nThe three judges for the series have been Yang Hyun-suk, founder of YG Entertainment and former member of the popular South Korean act Seo Taiji & Boys, Park Jin-young, singer/song-writer and founder of JYP Entertainment, and Korean pop icon BoA, from SM Entertainment. SM, YG, and JYP are the three largest management companies in Korea.\nK-pop Star is a part of SBS's Good Sunday lineup, along with Running Man. The show's first season aired on December 4, 2011, every Sunday evening at 6:30 pm, until April 29, 2012. The second season aired from November 18, 2012 to April 14, 2013 at 4:55 pm. Singer, Yoon Do-hyun, and entertainer, Boom, host the live competition. Yoon Do-hyun has also been narrating through the entire process. The program was renewed for a third season with the same judges and possibly a new time slot, scheduled to be aired in October 2013.", "rate": 90, "genre": ["Reality"], "cast": ["Yang Hyun Suk", "Park Jin-young", "Yoo Hee-Yeol"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52644   Expand K-pop Star   (2011) User Score Overview Survival Audition K-pop Star is a South Korean reality TV competition series where the three largest entertainment/talent agencies in South Korea hold worldwide auditions to find the next potential K-Pop stars. Preliminary auditions are held around the world in Asia, North America, South America, Europe, and Australia. The final winner will debut with the company of his or her choice, along with a cash prize of three hundred million won, two brand new vehicles, opportunities to become commercial models and casting in dramas, and many more. The three judges for the series have been Yang Hyun-suk, founder of YG Entertainment and former member of the popular South Korean act Seo Taiji & Boys, Park Jin-young, singer/song-writer and founder of JYP Entertainment, and Korean pop icon BoA, from SM Entertainment. SM, YG, and JYP are the three largest management companies in Korea. K-pop Star is a part of SBS's Good Sunday lineup, along with Running Man. The show's first season aired on December 4, 2011, every Sunday evening at 6:30 pm, until April 29, 2012. The second season aired from November 18, 2012 to April 14, 2013 at 4:55 pm. Singer, Yoon Do-hyun, and entertainer, Boom, host the live competition. Yoon Do-hyun has also been narrating through the entire process. The program was renewed for a third season with the same judges and possibly a new time slot, scheduled to be aired in October 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yang Hyun Suk Park Jin-young Yoo Hee-Yeol Full Cast & Crew Last Season Season 6 2016 | 40 Episodes Season 6 of K-pop Star premiered on November 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on K-pop Star. You can help by rating TV shows you've seen. Facts Original Name  K팝스타 Status  Returning Series Network Certification  - Type  Reality Original Language  Korean Runtime  - Homepage  - Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors p 22 p.dio d 10 daphie 4 helloskies 4 Kyuhwan Kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}