{"link": "https://www.themoviedb.org/tv/63152?language=en", "title": "Critical Role", "resume": "Voice actor Matthew Mercer leads a group of fellow voice actors on epic Dungeons & Dragons campaigns. These familiar voices bring the audience into the full experience of D&D, allowing imaginations to soar as the characters embark on adventures.", "rate": 93, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Matthew Mercer", "Laura Bailey", "Taliesin Jaffe", "Ashley Johnson", "Marisha Ray"], "character": ["Dungeon Master", "Vex'ahilia / Jester", "Percival Fredrickstein von Müsel Klossowski de Rolo III / Mollymauk Tealeaf", "Pike Trickfoot / Yasha", "Keyleth / Beauregard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63152   Expand Critical Role   (2015) User Score Overview Voice actor Matthew Mercer leads a group of fellow voice actors on epic Dungeons & Dragons campaigns. These familiar voices bring the audience into the full experience of D&D, allowing imaginations to soar as the characters embark on adventures. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Mercer Dungeon Master Laura Bailey Vex'ahilia / Jester Taliesin Jaffe Percival Fredrickstein von Müsel Klossowski de Rolo III / Mollymauk Tealeaf Ashley Johnson Pike Trickfoot / Yasha Marisha Ray Keyleth / Beauregard Full Cast & Crew Current Season Campaign 2 2018 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Critical Role. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  240m Homepage   http://geekandsundry.com/shows/critical-role/ Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 31 Dexcuracy 10 Dreamtaker 7 Elizabeth Jennings 4 anchilidas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}