{"link": "https://www.themoviedb.org/tv/64414?language=en", "title": "Wakfu", "resume": "Follow Yogu and his friends Amalia, Evangelyne, Tristepin, Ruel and Az as they try to rescue the world of Wakfu from destruction.", "rate": 84, "genre": ["Drama", "Animation", "Action", "Adventure"], "cast": ["Thomas Guitard", "Geneviève Doang", "Fanny Bloc", "Adeline Chetail", "Patrick Béthune"], "character": ["Tristepin de Percedal (voice)", "Evangelyne (voice)", "Yugo (voice)", "Amalia Sheran Sharm (voice)", "Ruel Stroud (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64414   Expand Wakfu   (2008) User Score  Play Trailer Overview Follow Yogu and his friends Amalia, Evangelyne, Tristepin, Ruel and Az as they try to rescue the world of Wakfu from destruction. Featured Crew Ankama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Guitard Tristepin de Percedal (voice) Geneviève Doang Evangelyne (voice) Fanny Bloc Yugo (voice) Adeline Chetail Amalia Sheran Sharm (voice) Patrick Béthune Ruel Stroud (voice) Full Cast & Crew Last Season Season 3 2017 | 13 Episodes Season 3 of Wakfu premiered on September  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Wakfu. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  French Runtime  23m, 22m Homepage   http://www.wakfu.com/fr/serie Genres Drama Animation Action & Adventure Keywords fantasy humor Content Score 100 Yes! Looking good! Top Contributors D 26 DarkZeroCD w 19 wremy z 15 zurman1 C 9 Caxapa2012  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}