{"link": "https://www.themoviedb.org/tv/3854?language=en", "title": "The Spectacular Spider-Man", "resume": "The Spectacular Spider-Man is an American animated television series based on the superhero character published by Marvel Comics and developed for television by Greg Weisman and Victor Cook. In terms of tone and style, the series is based primarily on the original stories by Stan Lee and Steve Ditko, with a similar balance of action, drama, and comedy as well as a high school setting. However, it also tends to utilize material from all eras of the comic's run and other sources such as the film series and the Ultimate Spider-Man comics.\nThe Spectacular Spider-Man premiered on March 8, 2008 during the Kids' WB programming block of The CW, and received critical acclaim. The series aired its second season on Marvel's sister network, Disney XD in the United States and ended its run on November 18, 2009, also receiving positive critical attention. Although a third season was planned, the series was cancelled before production could begin.", "rate": 78, "genre": ["Action", "Adventure", "Animation"], "cast": ["Vanessa Marshall", "Josh Keaton", "Joshua LeBar", "Lacey Chabert", "Alanna Ubach"], "character": ["Mary Jane Watson", "Peter Parker / Spider Man", "Flash Thompson", "Gwen Stacy", "Liz Allan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3854   Expand The Spectacular Spider-Man   (2008) User Score Overview The Spectacular Spider-Man is an American animated television series based on the superhero character published by Marvel Comics and developed for television by Greg Weisman and Victor Cook. In terms of tone and style, the series is based primarily on the original stories by Stan Lee and Steve Ditko, with a similar balance of action, drama, and comedy as well as a high school setting. However, it also tends to utilize material from all eras of the comic's run and other sources such as the film series and the Ultimate Spider-Man comics. The Spectacular Spider-Man premiered on March 8, 2008 during the Kids' WB programming block of The CW, and received critical acclaim. The series aired its second season on Marvel's sister network, Disney XD in the United States and ended its run on November 18, 2009, also receiving positive critical attention. Although a third season was planned, the series was cancelled before production could begin. Featured Crew Stan Lee Creator Steve Ditko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vanessa Marshall Mary Jane Watson Josh Keaton Peter Parker / Spider Man Joshua LeBar Flash Thompson Lacey Chabert Gwen Stacy Alanna Ubach Liz Allan Full Cast & Crew Last Season Season 2 2009 | 13 Episodes Season 2 of The Spectacular Spider-Man premiered on June 22, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  6 Recommendations   2012-04-01 Marvel's Ultimate Spider-Man 6.6    2010-09-22 The Avengers: Earth's Mightiest Heroes 7.5    2009-01-23 Wolverine and the X-Men 7.0    2001-11-17 Justice League 8.2    2010-11-26 Young Justice 8.2    1994-11-19 Spider-Man 7.8    2013-08-11 Marvel’s Hulk and the Agents of S.M.A.S.H 5.5    1996-09-06 Superman: The Animated Series 7.3  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Action & Adventure Animation Keywords superhero based on comic sandman rhino green goblin the lizard electro gwen stacy Content Score 93 Almost there... Top Contributors 35 Razze 25 BarkingBaphomet 10 CrewMdk 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}