{"link": "https://www.themoviedb.org/tv/3725?language=en", "title": "Life on Mars", "resume": "Life on Mars is a science fiction crime drama television series which originally aired on ABC from October 9, 2008 to April 1, 2009. It is an adaptation of the BAFTA-winning original UK series of the same name produced by the BBC. The series was co-produced by Kudos Film & Television, 20th Century Fox Television and ABC Studios.\nThe series tells the story of New York City police detective Sam Tyler, who, after being struck by a car in 2008, regains consciousness in 1973. Fringing between multiple genres, including thriller, science fiction and police procedural, the series remained ambiguous regarding its central plot, with the character himself unsure about his situation. The series also starred Harvey Keitel, Jonathan Murphy, Michael Imperioli, and Gretchen Mol.\nLife on Mars garnered critical praise for its premise, acting, and depiction of the 1970s but suffered from a declining viewership after its premiere and a two-month hiatus. ABC announced on March 2, 2009 that it would not be ordering a second season. A DVD set of the complete series was released on September 29, 2009.", "rate": 63, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Jason O'Mara", "Harvey Keitel", "Gretchen Mol", "Michael Imperioli", "Jonathan Murphy"], "character": ["Det. Sam Tyler", "Lt. Gene Hunt", "Policewoman Annie Norris", "Det. Ray Carling", "Det. Chris Skelton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3725   Expand Life on Mars   (2008) User Score Overview Life on Mars is a science fiction crime drama television series which originally aired on ABC from October 9, 2008 to April 1, 2009. It is an adaptation of the BAFTA-winning original UK series of the same name produced by the BBC. The series was co-produced by Kudos Film & Television, 20th Century Fox Television and ABC Studios. The series tells the story of New York City police detective Sam Tyler, who, after being struck by a car in 2008, regains consciousness in 1973. Fringing between multiple genres, including thriller, science fiction and police procedural, the series remained ambiguous regarding its central plot, with the character himself unsure about his situation. The series also starred Harvey Keitel, Jonathan Murphy, Michael Imperioli, and Gretchen Mol. Life on Mars garnered critical praise for its premise, acting, and depiction of the 1970s but suffered from a declining viewership after its premiere and a two-month hiatus. ABC announced on March 2, 2009 that it would not be ordering a second season. A DVD set of the complete series was released on September 29, 2009. Featured Crew Matthew Graham Creator Ashley Pharoah Creator Tony Jordan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason O'Mara Det. Sam Tyler Harvey Keitel Lt. Gene Hunt Gretchen Mol Policewoman Annie Norris Michael Imperioli Det. Ray Carling Jonathan Murphy Det. Chris Skelton Full Cast & Crew Last Season Season 1 2008 | 17 Episodes Season 1 of Life on Mars premiered on October  9, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2006-01-09 Life on Mars 8.0    2007-09-26 Bionic Woman 5.5    1998-09-09 First Wave 6.6    1985-09-18 The Equalizer 6.3    2013-10-03 Welcome to the Family 5.7    1970-03-30 Up Pompeii! 9.3    1976-10-03 Quincy, M.E. 7.0    2007-06-16 Jekyll 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://abc.go.com/primetime/lifeonmars/index?pn=index Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords 1970s time travel remake police detective nypd police precinct Content Score 93 Almost there... Top Contributors I 10 Ingwar 6 Banana 6 Elizabeth Jennings W 4 Wiruss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}