{"link": "https://www.themoviedb.org/tv/4784?language=en", "title": "Spider-Woman", "resume": "Spider-Woman is an animated television series, based on the Marvel Comics character Spider-Woman. The series was produced by DePatie-Freleng Enterprises and Marvel Comics Animation, and aired on September 22, 1979 to January 3, 1980, one season of sixteen episodes, on the ABC-TV network. It was DePatie-Freleng's final series before its reincorporation as Marvel Productions.", "rate": 61, "genre": ["Animation"], "cast": ["Joan Van Ark"], "character": ["Spider-Woman (Jessica Drew)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4784   Expand Spider-Woman   (1979) User Score Overview Spider-Woman is an animated television series, based on the Marvel Comics character Spider-Woman. The series was produced by DePatie-Freleng Enterprises and Marvel Comics Animation, and aired on September 22, 1979 to January 3, 1980, one season of sixteen episodes, on the ABC-TV network. It was DePatie-Freleng's final series before its reincorporation as Marvel Productions. Featured Crew Sal Buscema Creator Jim Mooney Creator Stan Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joan Van Ark Spider-Woman (Jessica Drew) Full Cast & Crew Last Season Season 1 1979 | 16 Episodes Season 1 of Spider-Woman premiered on September 22, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1982-09-18 The Incredible Hulk 8.2    1996-09-08 The Incredible Hulk 6.3    1985-09-30 M.A.S.K. 5.4    2001-10-06 Mutant X 5.8    1993-09-11 SWAT Kats: The Radical Squadron 8.0    1980-10-04 Heathcliff 5.0    1981-09-12 Spider-Man and His Amazing Friends 6.7    1967-09-09 Spider-Man 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors z 10 zurman1 9 Rafaelasauani w 5 wil001 M 3 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}