{"link": "https://www.themoviedb.org/tv/1042?language=en", "title": "Revolutionary Girl Utena", "resume": "Revolutionary Girl Utena is a manga by Chiho Saito and anime directed by Kunihiko Ikuhara. The manga serial began in the June 1996 issue of Ciao and the anime was first broadcast in 1997. The anime and manga were created simultaneously, but, despite some similarities, they progressed in different directions. A movie, \"Adolescence of Utena\" was released in theatres in 1999. A number of stage productions based on the franchise were also produced in the mid-1990s, including the \"Comedie Musicale Utena la fillette révolutionnaire\", staged by an all-female Takarazuka-style cast.\nThe main character is Utena Tenjou, a tomboyish teenage girl who was so impressed by a kind prince in her childhood that she decided to become a prince herself. She attends Ohtori Academy, where she meets a student named Anthy Himemiya, a girl who is in an abusive relationship with another student. Utena fights to protect Anthy and is pulled into a series of sword duels with the members of the Student Council. Anthy is referred to as the \"Rose Bride\" and is given to the winner of each duel. It is said that the winner of the of tournament will receive a mysterious \"power to revolutionize the world\", and the current champion is constantly challenged for the right to possess the Rose Bride.", "rate": 94, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Tomoko Kawakami", "Yuriko Fuchizaki", "Takeshi Kusao", "Takehito Koyasu", "Yuri Shiratori"], "character": ["Utena Tenjou", "Anthy Himemiya", "Kyouichi Saionji", "Touga Kiryuu", "Nanami Kiryuu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1042   Expand Revolutionary Girl Utena   (1997) User Score Overview Revolutionary Girl Utena is a manga by Chiho Saito and anime directed by Kunihiko Ikuhara. The manga serial began in the June 1996 issue of Ciao and the anime was first broadcast in 1997. The anime and manga were created simultaneously, but, despite some similarities, they progressed in different directions. A movie, \"Adolescence of Utena\" was released in theatres in 1999. A number of stage productions based on the franchise were also produced in the mid-1990s, including the \"Comedie Musicale Utena la fillette révolutionnaire\", staged by an all-female Takarazuka-style cast. The main character is Utena Tenjou, a tomboyish teenage girl who was so impressed by a kind prince in her childhood that she decided to become a prince herself. She attends Ohtori Academy, where she meets a student named Anthy Himemiya, a girl who is in an abusive relationship with another student. Utena fights to protect Anthy and is pulled into a series of sword duels with the members of the Student Council. Anthy is referred to as the \"Rose Bride\" and is given to the winner of each duel. It is said that the winner of the of tournament will receive a mysterious \"power to revolutionize the world\", and the current champion is constantly challenged for the right to possess the Rose Bride. Featured Crew Kunihiko Ikuhara Creator Chiho Saitō Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Tomoko Kawakami Utena Tenjou Yuriko Fuchizaki Anthy Himemiya Takeshi Kusao Kyouichi Saionji Takehito Koyasu Touga Kiryuu Yuri Shiratori Nanami Kiryuu Full Cast & Crew Last Season The Apocalypse Saga 1997 | 6 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Revolutionary Girl Utena. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   1992-06-20 On the Air 9.4    2011-07-03 Penguindrum 7.8    2015-01-05 Yurikuma Arashi 7.7    2017-11-23 She's Gotta Have It 7.2    1993-01-08 Hotel Room 7.1    1989-04-03 Alfred J. Kwak 7.7    2015-09-14 Merlí 8.5    2002-01-01 DumbLand 7.3  Facts Original Name  少女革命ウテナ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://king-cr.jp/special/utena Genres Animation Drama Sci-Fi & Fantasy Keywords sexual identity adolescence sibling relationship role of women symbolism metaphysics role reversal role playing tragic girl heroine cross dressing orphan subversive tale incest gender roles girl on girl teenage sexuality female hero white castle roses dual role teenage rebellion cross dresser sword duel brother sister incest genre bending phallic symbol gender bender shoujo gender identity fairy tale subversion shoujo-ai Content Score 100 Yes! Looking good! Top Contributors 113 Micael Lopes 13 lineker z 10 zurman1 7 MrTimscampi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}