{"link": "https://www.themoviedb.org/tv/2979?language=en", "title": "Cyberchase", "resume": "Cyberchase is an American/Canadian television series for children ages 7-13. The series takes place in Cyberspace, a virtual world, and chronicles the adventures of three children, Jackie, Inez, and Matt, as they use math and problem solving skills to save Cyberspace and its leader, Motherboard, from The Hacker, the villain. Cyberchase has received generally positive reviews and won numerous awards. Thirteen/WNET New York and Nelvana produced the first five seasons, while Thirteen, in association with Title Entertainment, Inc. and WNET.ORG, produced seasons six through eight. The show airs on Public Broadcasting Service and PBS Kids GO! in the United States. All episodes have been released free on the Cyberchase Website. Since July 2010, Cyberchase has been put on hiatus, but was announced that starting in November, Cyberchase will be revived and start airing new episodes with its 9th season. Seasons 1-5 were recently put on Netflix, along with other PBS Kids Go shows. In April 2013, it was announced via Cyberchase's official Facebook page that Cyberchase would return for a ninth season, which is set to premiere November 4, 2013.", "rate": 0, "genre": ["Animation", "Comedy", "Kids", "Mystery"], "cast": ["Gilbert Gottfried", "Christopher Lloyd", "Novie Edwards", "Jacqueline Pillon", "Annick Obonsawin"], "character": ["Digit", "Hacker", "Jackie", "Matt", "Inez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2979   Expand Cyberchase   (2002) User Score Overview Cyberchase is an American/Canadian television series for children ages 7-13. The series takes place in Cyberspace, a virtual world, and chronicles the adventures of three children, Jackie, Inez, and Matt, as they use math and problem solving skills to save Cyberspace and its leader, Motherboard, from The Hacker, the villain. Cyberchase has received generally positive reviews and won numerous awards. Thirteen/WNET New York and Nelvana produced the first five seasons, while Thirteen, in association with Title Entertainment, Inc. and WNET.ORG, produced seasons six through eight. The show airs on Public Broadcasting Service and PBS Kids GO! in the United States. All episodes have been released free on the Cyberchase Website. Since July 2010, Cyberchase has been put on hiatus, but was announced that starting in November, Cyberchase will be revived and start airing new episodes with its 9th season. Seasons 1-5 were recently put on Netflix, along with other PBS Kids Go shows. In April 2013, it was announced via Cyberchase's official Facebook page that Cyberchase would return for a ninth season, which is set to premiere November 4, 2013. Featured Crew WNET Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gilbert Gottfried Digit Christopher Lloyd Hacker Novie Edwards Jackie Jacqueline Pillon Matt Annick Obonsawin Inez Full Cast & Crew Last Season Season 10 2015 | 5 Episodes Season 10 of Cyberchase premiered on November  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cyberchase. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://pbskids.org/cyberchase/ Genres Animation Comedy Kids Mystery Keywords educational kids Content Score 93 Almost there... Top Contributors D 15 Doramius 12 Banana z 4 zurman1 3 IonutG  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}