{"link": "https://www.themoviedb.org/tv/103?language=en", "title": "The Time Tunnel", "resume": "The Time Tunnel is a 1966–1967 U.S. color science fiction TV series, written around a theme of time travel adventure. The show was creator-producer Irwin Allen's third science fiction television series, released by 20th Century Fox and broadcast on ABC. The show ran for one season of 30 episodes. Reruns are viewable on cable and by internet streaming. A pilot for a new series was produced in 2002, although it was not picked up.", "rate": 74, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Lee Meriwether", "Robert Colbert", "Whit Bissell", "James Darren", "John Zaremba"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 103   Expand The Time Tunnel   (1966) User Score  Play Trailer Overview The Time Tunnel is a 1966–1967 U.S. color science fiction TV series, written around a theme of time travel adventure. The show was creator-producer Irwin Allen's third science fiction television series, released by 20th Century Fox and broadcast on ABC. The show ran for one season of 30 episodes. Reruns are viewable on cable and by internet streaming. A pilot for a new series was produced in 2002, although it was not picked up. Featured Crew Irwin Allen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Meriwether Robert Colbert Whit Bissell James Darren John Zaremba Full Cast & Crew Last Season Season 1 1966 | 30 Episodes Season 1 of The Time Tunnel premiered on September  9, 1966. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Error in \"Chase Through Time\" photos Open 0 by brimfin\n      \n     best Open 2 by Gema6\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   1962-10-02 Combat! 7.1    1997-07-20 The Hunger 5.7    1964-09-24 Daniel Boone 5.9    1968-09-22 Land of the Giants 6.3    1967-09-10 Gentle Ben 5.0    1964-09-14 Voyage to the Bottom of the Sea 7.4    1965-09-14 F Troop 6.4    1961-01-05 Mister Ed 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords lost in time funding  jeopardy Content Score 100 Yes! Looking good! Top Contributors 7 Mitsarinho PE 6 Patrick E. Abe z 5 zurman1 5 luftikus009  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}