{"link": "https://www.themoviedb.org/tv/65676?language=en", "title": "My Teen Romantic Comedy SNAFU", "resume": "Hachiman Hikigaya is an antisocial high school student with no friends or girlfriend and as a result has a distorted view on life. When he sees his classmates talking excitedly about their adolescent lives, he mutters, \"They're a bunch of liars.\" When he is asked about his future dreams, he responds, \"Not working.\" A teacher gets Hachiman to join the volunteer \"service club,\" which happens to have the school's prettiest girl - Yukino Yukinoshita.", "rate": 74, "genre": ["Animation", "Comedy"], "cast": ["Takuya Eguchi", "Nao Touyama", "Saori Hayami"], "character": ["Hachiman Hikigaya", "Yui Yuigahama", "Yukino Yukinoshita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65676   Expand My Teen Romantic Comedy SNAFU   (2013) User Score Overview Hachiman Hikigaya is an antisocial high school student with no friends or girlfriend and as a result has a distorted view on life. When he sees his classmates talking excitedly about their adolescent lives, he mutters, \"They're a bunch of liars.\" When he is asked about his future dreams, he responds, \"Not working.\" A teacher gets Hachiman to join the volunteer \"service club,\" which happens to have the school's prettiest girl - Yukino Yukinoshita. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Eguchi Hachiman Hikigaya Nao Touyama Yui Yuigahama Saori Hayami Yukino Yukinoshita Full Cast & Crew Last Season Season 2 2015 | 13 Episodes Season 2 of My Teen Romantic Comedy SNAFU premiered on April  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  4 Recommendations   2015-07-05 Charlotte 6.8    2007-10-18 Ghost Hound 7.2    2012-10-07 Code:Breaker 6.8    2015-01-07 The Testament of Sister New Devil 6.8    2015-04-04 Is It Wrong to Try to Pick Up Girls in a Dungeon? 6.9    2012-04-05 Sankarea: Undying Love 7.0    2013-09-09 Tokyo Ravens 5.8    2012-04-22 Hyouka 8.3  Facts Original Name  やはり俺の青春ラブコメはまちがっている。 Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/oregairu/ Genres Animation Comedy Keywords high school friendship romance club based on light novel anime Content Score 56 We're so close, yet so far. Top Contributors 28 CrewMdk d 16 dankzel 12 Elizabeth Jennings 9 Ailurus Fulgens  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}