{"link": "https://www.themoviedb.org/tv/1915?language=en", "title": "The Larry Sanders Show", "resume": "Comic Garry Shandling draws upon his own talk show experiences to create the character of Larry Sanders, a paranoid, insecure host of a late night talk show. Larry, along with his obsequious TV sidekick Hank Kingsley and his fiercely protective producer Artie, allows Garry Shandling and his talented writers to look behind the scenes and to show us a convincing slice of behind the camera life.", "rate": 77, "genre": ["Comedy"], "cast": ["Garry Shandling", "Jeffrey Tambor", "Wallace Langham", "Rip Torn", "Penny Johnson"], "character": ["Larry Sanders", "Hank Kingsley", "Phil", "Arthur", "Beverly Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1915   Expand The Larry Sanders Show   (1992) User Score Overview Comic Garry Shandling draws upon his own talk show experiences to create the character of Larry Sanders, a paranoid, insecure host of a late night talk show. Larry, along with his obsequious TV sidekick Hank Kingsley and his fiercely protective producer Artie, allows Garry Shandling and his talented writers to look behind the scenes and to show us a convincing slice of behind the camera life. Featured Crew Garry Shandling Creator Dennis Klein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Garry Shandling Larry Sanders Jeffrey Tambor Hank Kingsley Wallace Langham Phil Rip Torn Arthur Penny Johnson Beverly Barnes Full Cast & Crew Last Season Season 6 1998 | 12 Episodes Season 6 of The Larry Sanders Show premiered on March 15, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   2002-01-23 That '80s Show 3.7    1996-09-19 Suddenly Susan 4.9    1982-03-23 Joanie Loves Chachi 2.4    1998-11-09 Big Train 7.5    1974-02-08 Good Times 7.3    2007-06-10 John from Cincinnati 7.3    1976-08-31 Alice 5.9    1994-03-29 Ellen 6.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hbo.com/the-larry-sanders-show Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 18 Elizabeth Jennings 3 rtentser 2 tbonus 2 Stan Smith  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}