{"link": "https://www.themoviedb.org/tv/1786?language=en", "title": "Perfect Strangers", "resume": "Perfect Strangers is an American sitcom that ran for eight seasons from March 25, 1986, to August 6, 1993, on the ABC television network. Created by Dale McRaven, the series chronicles the rocky coexistence of midwestern American Larry Appleton and his distant cousin from eastern Mediterranean Europe, Balki Bartokomous.\nOriginally airing on Tuesdays for the short six-episode first season in the spring of 1986, it moved to Wednesdays in prime time in the fall of 1986. It remained on Wednesdays until March 1988, when it was moved to Fridays. The show found its niche there as the anchor for ABC's original TGIF Friday-night lineup, though it aired on Saturdays for a short time in 1992.", "rate": 67, "genre": ["Comedy"], "cast": ["Bronson Pinchot", "Mark Linn-Baker", "Anton Lesser", "Alisan Porter", "Belita Moreno"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1786   Expand Perfect Strangers   (1986) User Score  Play Trailer Overview Perfect Strangers is an American sitcom that ran for eight seasons from March 25, 1986, to August 6, 1993, on the ABC television network. Created by Dale McRaven, the series chronicles the rocky coexistence of midwestern American Larry Appleton and his distant cousin from eastern Mediterranean Europe, Balki Bartokomous. Originally airing on Tuesdays for the short six-episode first season in the spring of 1986, it moved to Wednesdays in prime time in the fall of 1986. It remained on Wednesdays until March 1988, when it was moved to Fridays. The show found its niche there as the anchor for ABC's original TGIF Friday-night lineup, though it aired on Saturdays for a short time in 1992. Featured Crew Dale McRaven Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bronson Pinchot Mark Linn-Baker Anton Lesser Alisan Porter Belita Moreno Full Cast & Crew Last Season Season 8 1993 | 6 Episodes Season 8 of Perfect Strangers premiered on July  9, 1993. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of the best Open 0 by Bloodshot77\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   1989-09-19 Doogie Howser, M.D. 5.7    1984-10-03 Charles in Charge 5.1    1984-09-20 Who's the Boss? 6.4    1983-09-16 Webster 4.9    1982-09-22 Family Ties 7.0    1985-09-24 Growing Pains 6.1    1984-09-18 Punky Brewster 6.8    1989-02-28 Coach 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 10 lineker B 8 Boboo 8 niqo19 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}