{"link": "https://www.themoviedb.org/tv/35338?language=en", "title": "La Que Se Avecina", "resume": "La que se avecina is a Spanish television comedy created by Alberto Caballero, Laura Caballero and Daniel Deorador. The TV-series focusing around the inhabitants of Mirador de Montepinar, a fictional building located on the outskirts of a big city. Both its storylines and cast are heavily based on Aquí no hay quien viva, which ended when Telecinco bought Miramón Mendi, the series production company.\nThe episodes debuted on the Telecinco network, and were later rerun by the same network as well as cable/satellite channels FactoríaDeFicción and Paramount Comedy. The series debuted in 22 April 2007 and became popular thanks to its funny characters, witty script, use of catchphrases and capacity to integrate and poke fun at contemporary issues; the program presents a caustic satire of many of the 'types' found in Spanish society.\nThe name of the show involves wordplay, as \"vecina\" is the Spanish word for neighbour.", "rate": 62, "genre": ["Comedy"], "cast": ["Jordi Sánchez", "Nacho Guerreros", "Fernando Tejero", "José Luis Gil", "Pablo Chiapella"], "character": ["Antonio Recio", "Coque Calatrava", "Fermín Trujillo", "Enrique Pastor", "Amador Rivas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35338   Expand La Que Se Avecina   (2007) User Score Overview La que se avecina is a Spanish television comedy created by Alberto Caballero, Laura Caballero and Daniel Deorador. The TV-series focusing around the inhabitants of Mirador de Montepinar, a fictional building located on the outskirts of a big city. Both its storylines and cast are heavily based on Aquí no hay quien viva, which ended when Telecinco bought Miramón Mendi, the series production company. The episodes debuted on the Telecinco network, and were later rerun by the same network as well as cable/satellite channels FactoríaDeFicción and Paramount Comedy. The series debuted in 22 April 2007 and became popular thanks to its funny characters, witty script, use of catchphrases and capacity to integrate and poke fun at contemporary issues; the program presents a caustic satire of many of the 'types' found in Spanish society. The name of the show involves wordplay, as \"vecina\" is the Spanish word for neighbour. Featured Crew Alberto Caballero Creator Laura Caballero Creator Daniel Deorador Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jordi Sánchez Antonio Recio Nacho Guerreros Coque Calatrava Fernando Tejero Fermín Trujillo José Luis Gil Enrique Pastor Pablo Chiapella Amador Rivas Full Cast & Crew Current Season Original Air Date Original Air Date All episodes (Absolute) Season 10 2017 | 13 Episodes Season 10 of La Que Se Avecina premiered on October  4, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for La Que Se Avecina. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2005-01-16 Aída 4.0    2008-02-04 Física o Química 3.0    2003-04-22 Los Serrano 5.1    2013-04-10 MasterChef 7.3    2005-10-09 Los hombres de Paco 5.5    2003-09-07 Aquí no hay quien viva 7.1    2015-09-14 Merlí 8.5    2001-09-13 Cuéntame cómo pasó 6.6  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  90m, 70m, 80m Homepage   http://www.telecinco.es/laqueseavecina Genres Comedy Keywords neighbor Content Score 100 Yes! Looking good! Top Contributors 196 United600 71 prm96 JR 61 Johnny Rotring 10 stego77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}