{"link": "https://www.themoviedb.org/tv/67483?language=en", "title": "Blow Breeze", "resume": "The story depicts the romance between a bright woman, Mi-Poong, who defected from North Korea and a man, Jang-Go, in Seoul who is a stickler for the rules. Conflicts also arise over a 100 billion won inheritance.", "rate": 66, "genre": ["Family", "Drama"], "cast": ["Son Ho-jun", "Lim Ji-yeon", "Oh Ji-eun", "Im Soo-hyang", "Han Joo-wan"], "character": ["Lee Jang-go", "Kim Mi-poong", "Park Shin-ae", "Park Shin-ae", "Jo Hee-dong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67483   Expand Blow Breeze   (2016) User Score Overview The story depicts the romance between a bright woman, Mi-Poong, who defected from North Korea and a man, Jang-Go, in Seoul who is a stickler for the rules. Conflicts also arise over a 100 billion won inheritance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Son Ho-jun Lee Jang-go Lim Ji-yeon Kim Mi-poong Oh Ji-eun Park Shin-ae Im Soo-hyang Park Shin-ae Han Joo-wan Jo Hee-dong Full Cast & Crew Last Season Season 1 2016 | 53 Episodes Season 1 of Blow Breeze premiered on August 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-09-21 On the Way to the Airport 8.7    2016-07-30 Second To Last Love 8.3    2016-09-26 Woman with a Suitcase 7.1    2016-11-16 Oh My Geum Bi 8.7    2016-08-27 The Gentlemen of Wolgyesu Tailor Shop 5.8    2016-09-21 Shopping King Louie 6.7    2016-09-05 Drinking Solo 8.1  Facts Original Name  불어라 미풍아 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/mipoong/ Genres Family Drama Keywords korea Content Score 86 Almost there... Top Contributors M 45 Maria180493 d 16 daphie b 4 boudhum 3 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}