{"link": "https://www.themoviedb.org/tv/3840?language=en", "title": "The Commish", "resume": "Tony Scali is a former Brooklyn cop now the Police Commissioner of a small upstate city. But for Scali, this is no desk job. He's a tough yet compassionate boss, a loving husband and father, and a hands-on law enforcer with an unorthodox style of bending the rules. From parenthood to politics, from sex crimes to murder cases, one man takes it day-to-day with offbeat humor and street- smart skill.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Michael Chiklis", "Theresa Saldana", "Kaj-Erik Eriksen", "Geoffrey Nauffts", "Melinda McGraw"], "character": ["Tony Scali", "Rachel Scali", "David Scali", "Stan Kelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3840   Expand The Commish   (1991) User Score Overview Tony Scali is a former Brooklyn cop now the Police Commissioner of a small upstate city. But for Scali, this is no desk job. He's a tough yet compassionate boss, a loving husband and father, and a hands-on law enforcer with an unorthodox style of bending the rules. From parenthood to politics, from sex crimes to murder cases, one man takes it day-to-day with offbeat humor and street- smart skill. Featured Crew Stephen J. Cannell Creator Stephen Kronish Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Chiklis Tony Scali Theresa Saldana Rachel Scali Kaj-Erik Eriksen David Scali Geoffrey Nauffts Stan Kelly Melinda McGraw Full Cast & Crew Last Season Season 5 1995 | 4 Episodes Season 5 of The Commish premiered on November 30, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Commish. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Comedy Keywords police police officer police commissioner Content Score 93 Almost there... Top Contributors 13 Banana 12 United600 a 3 asusar R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}