{"link": "https://www.themoviedb.org/tv/70618?language=en", "title": "The River", "resume": "A young girl playing by \"Djupelv\" finds the remains of a body. The family doesn't want to get involved and calls in an anonymous tip, but the same day the girl runs away from home.", "rate": 73, "genre": ["Drama", "Mystery"], "cast": ["Espen Reboli Bjerke", "Ingeborg Raustøl", "Thomas Hayes", "Dennis Storhøi", "Stig Henrik Hoff"], "character": ["Thomas Lønnhøiden", "Mia Holt", "August Wildhagen", "Dahl", "Bjørn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70618   Expand The River   (2017) User Score  Play Trailer Overview A young girl playing by \"Djupelv\" finds the remains of a body. The family doesn't want to get involved and calls in an anonymous tip, but the same day the girl runs away from home. Featured Crew Arne Berggren Creator Kristine Berg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Espen Reboli Bjerke Thomas Lønnhøiden Ingeborg Raustøl Mia Holt Thomas Hayes August Wildhagen Dennis Storhøi Dahl Stig Henrik Hoff Bjørn Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of The River premiered on March 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2010-10-31 The Walking Dead 7.3  Facts Original Name  Elven Status  Ended Network Certification  - Type  Scripted Original Language  Norwegian Runtime  43m Homepage   http://www.tv3.no/elven Genres Drama Mystery Keywords missing girl Content Score 100 Yes! Looking good! Top Contributors 53 Bendik 4 Steve S 3 ShareRapid TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}