{"link": "https://www.themoviedb.org/tv/71654?language=en", "title": "Beat Shazam", "resume": "Game show in which teams of two race against the clock and each other as they attempt to identify the biggest hit songs of all time. In the end, the team with the highest score will outlast the competition and go against Shazam, the world’s most popular song identification app, for the chance to win a cash prize.", "rate": 45, "genre": [], "cast": ["Jamie Foxx"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71654   Expand Beat Shazam   (2017) User Score Overview Game show in which teams of two race against the clock and each other as they attempt to identify the biggest hit songs of all time. In the end, the team with the highest score will outlast the competition and go against Shazam, the world’s most popular song identification app, for the chance to win a cash prize. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Foxx Himself - Host Full Cast & Crew Current Season Season 2 2018 | 4 Episodes Season 2 of Beat Shazam premiered on May 29, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Beat Shazam. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Beat Shazam. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  - Homepage   http://www.fox.com/beat-shazam Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 20 Elizabeth Jennings b 7 basher D 6 Derek.Jo.Lee88 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}