{"link": "https://www.themoviedb.org/tv/62234?language=en", "title": "Deadbeat", "resume": "Kevin Pacalioglu may have no money and no clue, but he can see dead people, so that’s pretty cool. Faced with a constant stream of stubborn spirits, Pac goes to whatever lengths require the least amount of effort to help New York City’s most frivolous ghosts finish their unfinished business, occasionally with the help of his best friend and drug dealer, Roofie.", "rate": 63, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Tyler Labine", "Kal Penn", "Cat Deeley", "Brandon T. Jackson", "Lucy DeVito"], "character": ["Kevin Pacalioglu", "Clyde", "Camomile White", "Roofie", "Sue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62234   Expand Deadbeat   (2014) User Score  Play Trailer Overview Kevin Pacalioglu may have no money and no clue, but he can see dead people, so that’s pretty cool. Faced with a constant stream of stubborn spirits, Pac goes to whatever lengths require the least amount of effort to help New York City’s most frivolous ghosts finish their unfinished business, occasionally with the help of his best friend and drug dealer, Roofie. Featured Crew Brett Konner Creator Cody Heller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tyler Labine Kevin Pacalioglu Kal Penn Clyde Cat Deeley Camomile White Brandon T. Jackson Roofie Lucy DeVito Sue Full Cast & Crew Last Season Season 3 2016 | 13 Episodes Season 3 of Deadbeat premiered on April 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2014-09-30 Manhattan Love Story 6.2    2013-08-05 Quick Draw 6.3    2012-09-12 Guys with Kids 5.5    2016-05-26 Neil Gaiman's Likely Stories 5.8    2011-09-29 How to Be a Gentleman 5.3    2012-09-11 The New Normal 5.2    2013-09-17 Dads 4.8    2016-01-17 Angie Tribeca 6.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.hulu.com/deadbeat Genres Comedy Sci-Fi & Fantasy Keywords psychic power ghost Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings a 7 adambakir92 6 Banana M 5 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}