{"link": "https://www.themoviedb.org/tv/64614?language=en", "title": "En mode Salvail", "resume": "What to expect: interviews, musical performances, a fierce band, surprising stories and most of all, guests who are more than happy to play along and follow Éric Salvail on his beautifully crazy tangents!", "rate": 0, "genre": ["Comedy", "Talk"], "cast": ["Éric Salvail"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64614   Expand En mode Salvail   (2013) User Score Overview What to expect: interviews, musical performances, a fierce band, surprising stories and most of all, guests who are more than happy to play along and follow Éric Salvail on his beautifully crazy tangents! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Éric Salvail Himself - Host Full Cast & Crew Last Season Season 5 2017 | 18 Episodes Season 5 of En mode Salvail premiered on September 18, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Cancelled Open 0 by Guipat\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on En mode Salvail. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Talk Show Original Language  French Runtime  48m Homepage   http://noovo.ca/emissions/en-mode-salvail/ Genres Comedy Talk Keywords talk show celebrity Content Score 56 We're so close, yet so far. Top Contributors 82 Banana 3 Guipat 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}