{"link": "https://www.themoviedb.org/tv/67832?language=en", "title": "Stan Against Evil", "resume": "An aging police sheriff who has recently lost his position due to an angry outburst begrudgingly joins an alliance with new sheriff, Evie Barret to battle angry demons haunting their small New Hampshire town.", "rate": 67, "genre": ["Comedy"], "cast": ["John C. McGinley", "Janet Varney", "Nate Mooney", "Deborah Baker Jr."], "character": ["Stanley Miller", "Evie Barret", "Deputy Leon Drinkwater", "Denise Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67832   Expand Stan Against Evil   (2016) User Score  Play Trailer Overview An aging police sheriff who has recently lost his position due to an angry outburst begrudgingly joins an alliance with new sheriff, Evie Barret to battle angry demons haunting their small New Hampshire town. Featured Crew Dana Gould Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John C. McGinley Stanley Miller Janet Varney Evie Barret Nate Mooney Deputy Leon Drinkwater Deborah Baker Jr. Denise Miller Full Cast & Crew Current Season Season 2 2017 | 8 Episodes Season 2 of Stan Against Evil premiered on November  1, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Stan Against Evil Open 2 by  lonegunman Cast Interviews From New York Comic Con Open 0 by garethmb\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2016-10-10 Freakish 5.8    2014-10-05 Mulaney 2.4    2017-10-01 Wisdom of the Crowd 7.1    2014-08-23 Intruders 6.5    2015-03-03 Billy & Billie 7.9    2014-07-17 Married 6.3    2016-12-07 Shut Eye 6.3    2013-09-17 Dads 4.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.ifc.com/shows/stan-against-evil Genres Comedy Keywords horror Content Score 100 Yes! Looking good! Top Contributors 42 Elizabeth Jennings c 5 cfowler 4 Zlogorek D 3 Denys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}