{"link": "https://www.themoviedb.org/tv/1596?language=en", "title": "Bergerac", "resume": "Bergerac is a British television show set on Jersey. Produced by the BBC in association with the Seven Network, and first screened on BBC1, it stars John Nettles as the title character Detective Sergeant Jim Bergerac, a detective in Le Bureau des Étrangers, part of the States of Jersey Police.", "rate": 75, "genre": ["Drama"], "cast": ["Terence Alexander", "Sean Arnold", "John Nettles", "Annette Badland", "Celia Imrie"], "character": ["Det. Sgt. Jim Bergerac"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1596   Expand Bergerac   (1981) User Score Overview Bergerac is a British television show set on Jersey. Produced by the BBC in association with the Seven Network, and first screened on BBC1, it stars John Nettles as the title character Detective Sergeant Jim Bergerac, a detective in Le Bureau des Étrangers, part of the States of Jersey Police. Featured Crew Robert Banks Stewart Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Terence Alexander Sean Arnold John Nettles Det. Sgt. Jim Bergerac Annette Badland Celia Imrie Full Cast & Crew Last Season Season 9 1991 | 11 Episodes Season 9 of Bergerac premiered on January  5, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2001-01-09 Judge John Deed 6.0    1982-09-26 Matt Houston 6.6    2001-09-24 Murphy's Law 6.8    1987-03-09 French & Saunders 7.4    1996-05-26 Cold Lazarus 7.3    1983-09-06 Taggart 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 19 Shady12 18 Joe Carson 5 kcdh S 5 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}