{"link": "https://www.themoviedb.org/tv/1835?language=en", "title": "Kenan & Kel", "resume": "Kenan & Kel is an American teen comedy sitcom produced by Kevin Kopelow and Heath Seifert that originally aired on Nickelodeon from July 1996 to July 2000. The show starred friends and then-All That cast members Kenan Thompson and Kel Mitchell. Sixty-five episodes and a made-for-TV movie were produced over four seasons. The first two seasons were filmed at Nickelodeon Studios in Orlando, Florida, and the remaining two were filmed at the Nick On Sunset theater in Hollywood. Thompson and Mitchell were ranked No. 40 and No. 39., respectively, on Vh1's 100 Greatest Kid Stars.", "rate": 75, "genre": ["Comedy"], "cast": ["Vanessa Baden", "Ken Foree", "Teal Marchande", "Dan Frischman", "Kel Mitchell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1835   Expand Kenan & Kel   (1996) User Score Overview Kenan & Kel is an American teen comedy sitcom produced by Kevin Kopelow and Heath Seifert that originally aired on Nickelodeon from July 1996 to July 2000. The show starred friends and then-All That cast members Kenan Thompson and Kel Mitchell. Sixty-five episodes and a made-for-TV movie were produced over four seasons. The first two seasons were filmed at Nickelodeon Studios in Orlando, Florida, and the remaining two were filmed at the Nick On Sunset theater in Hollywood. Thompson and Mitchell were ranked No. 40 and No. 39., respectively, on Vh1's 100 Greatest Kid Stars. Featured Crew Kim Bass Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vanessa Baden Ken Foree Teal Marchande Dan Frischman Kel Mitchell Full Cast & Crew Last Season Season 4 1999 | 13 Episodes Season 4 of Kenan & Kel premiered on August  7, 1999. View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply S Futurama Open 0 by Strannger18\n      \n     S Babe Ruth Open 0 by Strannger18\n      \n     S Girl watchers Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1999-10-16 The Amanda Show 5.2    1991-03-01 Clarissa Explains It All 6.2    2000-09-23 Static Shock 7.1    2009-11-06 Fanboy and Chum Chum 2.0    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    1999-11-12 Mike, Lu & Og 3.3    2005-02-21 Masterchef Goes Large 4.8    1997-09-13 101 Dalmatians: The Series 7.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  24m, 30m, 25m Homepage   http://www.awwhereitgoes.piczo.com/ Genres Comedy Keywords teen comedy black sitcom Content Score 93 Almost there... Top Contributors H 7 HM101 6 Banana z 5 zurman1 1 MichioKaku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}