{"link": "https://www.themoviedb.org/tv/66545?language=en", "title": "Pure Genius", "resume": "A young Silicon Valley tech-titan enlists a veteran surgeon with a controversial past in starting a hospital with a cutting-edge, new school approach to medicine.", "rate": 67, "genre": ["Drama"], "cast": ["Dermot Mulroney", "Augustus Prew", "Odette Annable", "Reshma Shetty", "Aaron Jennings"], "character": ["Dr. Walter Wallace", "James Bell", "Dr. Zoe Brockett", "Dr. Talaikha Channarayapatra", "Dr. Malik Verlaine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66545   Expand Pure Genius   (2016) User Score  Play Trailer Overview A young Silicon Valley tech-titan enlists a veteran surgeon with a controversial past in starting a hospital with a cutting-edge, new school approach to medicine. Featured Crew Sarah Watson Creator Jason Katims Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dermot Mulroney Dr. Walter Wallace Augustus Prew James Bell Odette Annable Dr. Zoe Brockett Reshma Shetty Dr. Talaikha Channarayapatra Aaron Jennings Dr. Malik Verlaine Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Pure Genius premiered on October 27, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Not renewed? Open 0 by Susan\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2016-09-22 Notorious 5.8    2016-10-03 Conviction 6.3    2016-10-27 The Great Indoors 5.3    2007-09-26 Private Practice 5.9    2017-03-16 Snatch 7.0    2016-02-18 Join or Die with Craig Ferguson 8.3    2011-03-29 Body of Proof 6.7    2016-01-17 Mercy Street 5.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/pure-genius/ Genres Drama Keywords technology medicine hospital billionaire doctor medical drama gss syndrome Content Score 100 Yes! Looking good! Top Contributors 25 Banana 22 Elizabeth Jennings A 15 AVA 7 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}