{"link": "https://www.themoviedb.org/tv/12822?language=en", "title": "The Octopus", "resume": "La Piovra is an acclaimed Italian Television drama miniseries about the Mafia.\nThe story was by Sandro Petraglia. The production was designed by Luigi Perelli. The soundtrack was by Riz Ortolani and later by Ennio Morricone, who went on to compose music for several sequels.\nAll 10 series have been released in Australia on DVD by Aztec International Entertainment, with English subtitles, having been originally aired on the Special Broadcasting Service television channel. It was also broadcast on MHz Networks in the United States. The first three series were shown in the UK on Channel 4.\nThe TV drama was wildly successful in the USSR, where it appeared on state TV in 1986 and in Bulgaria, where is also appeared in the end of the 1980s bg:Октопод, offering to the viewers of both countries thrills and dark drama from beyond the Iron Curtain. La Piovra was also shown in 1987–1988 in communist Albania, where it became a huge hit and remains to date a cult film, whose characters and expressions have permeated culture, language and society.", "rate": 80, "genre": ["Drama", "Crime"], "cast": ["Vittorio Mezzogiorno", "Remo Girone", "Raoul Bova", "Florinda Bolkan", "François Périer"], "character": ["Tano Cariddi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12822   Expand The Octopus   (1984) User Score  Play Trailer Overview La Piovra is an acclaimed Italian Television drama miniseries about the Mafia. The story was by Sandro Petraglia. The production was designed by Luigi Perelli. The soundtrack was by Riz Ortolani and later by Ennio Morricone, who went on to compose music for several sequels. All 10 series have been released in Australia on DVD by Aztec International Entertainment, with English subtitles, having been originally aired on the Special Broadcasting Service television channel. It was also broadcast on MHz Networks in the United States. The first three series were shown in the UK on Channel 4. The TV drama was wildly successful in the USSR, where it appeared on state TV in 1986 and in Bulgaria, where is also appeared in the end of the 1980s bg:Октопод, offering to the viewers of both countries thrills and dark drama from beyond the Iron Curtain. La Piovra was also shown in 1987–1988 in communist Albania, where it became a huge hit and remains to date a cult film, whose characters and expressions have permeated culture, language and society. Featured Crew Nicola Badalucco Creator Lucio Battistrada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  14 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Vittorio Mezzogiorno Remo Girone Tano Cariddi Raoul Bova Florinda Bolkan François Périer Full Cast & Crew Last Season Season 10 2001 | 2 Episodes Season 10 of The Octopus premiered on January 10, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  14 Recommendations   1989-11-05 Bangkok Hilton 6.7    1997-01-13 La Femme Nikita 7.2  Facts Original Name  La Piovra Status  Ended Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Italian Runtime  120m, 60m Homepage  - Genres Drama Crime Keywords organized crime mafia cosa nostra Content Score 100 Yes! Looking good! Top Contributors C 86 Cataloguer 10 Denis TB 10 TMDb Bot N 4 NetU  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}