{"link": "https://www.themoviedb.org/tv/40204?language=en", "title": "World Without End", "resume": "Two hundred years after the construction of the great cathedral, the medieval town of Kingsbridge is  taken under siege by Queen Isabella. Caris, a visionary young woman, inspires her people to stand up for their rights and revolt against to the most powerful forces of her time, the Church and the Crown.", "rate": 67, "genre": ["Drama"], "cast": ["Oliver Maltman", "David Bradley", "Ben Chaplin", "Charlotte Riley", "Cynthia Nixon"], "character": ["Bishop Richard", "Brother Joseph", "Sir Thomas Langley", "Caris", "Petranilla"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40204   Expand World Without End   (2012) User Score Overview Two hundred years after the construction of the great cathedral, the medieval town of Kingsbridge is  taken under siege by Queen Isabella. Caris, a visionary young woman, inspires her people to stand up for their rights and revolt against to the most powerful forces of her time, the Church and the Crown. Featured Crew Michael Caton-Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  16 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oliver Maltman Bishop Richard David Bradley Brother Joseph Ben Chaplin Sir Thomas Langley Charlotte Riley Caris Cynthia Nixon Petranilla Full Cast & Crew Last Season Season 1 2012 | 8 Episodes Season 1 of World Without End premiered on September  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  16 Recommendations   2010-07-23 The Pillars of the Earth 7.9    2008-09-22 Place of Execution 6.0    2013-10-10 Breathless 7.0    2011-01-11 Lights Out 8.1    2013-09-22 By Any Means 7.0    2016-04-15 The Five 7.4    2008-10-26 Little Dorrit 7.7    2012-09-25 The Paradise 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage  - Genres Drama Keywords based on novel or book england hundred years' war miniseries 14th century Content Score 100 Yes! Looking good! Top Contributors TB 160 TMDb Bot 13 Banana R 12 Rebecca R 10 Rhoy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}