{"link": "https://www.themoviedb.org/tv/62238?language=en", "title": "Blunt Talk", "resume": "A British newscaster moves to Los Angeles with his alcoholic manservant and the baggage of several failed marriages to host a sanctimonious talk show.", "rate": 63, "genre": ["Comedy"], "cast": ["Patrick Stewart", "Adrian Scarborough", "Timm Sharp", "Dolly Wells", "Jacki Weaver"], "character": ["Walter Blunt", "Harry Chandler", "Jim Stone", "Celia Havemeyer", "Rosalie Winter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62238   Expand Blunt Talk   (2015) User Score  Play Trailer Overview A British newscaster moves to Los Angeles with his alcoholic manservant and the baggage of several failed marriages to host a sanctimonious talk show. Featured Crew Jonathan Ames Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Stewart Walter Blunt Adrian Scarborough Harry Chandler Timm Sharp Jim Stone Dolly Wells Celia Havemeyer Jacki Weaver Rosalie Winter Full Cast & Crew Last Season Season 2 2016 | 10 Episodes Season 2 of Blunt Talk premiered on October  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2013-08-05 Quick Draw 6.3    2015-04-14 Other Space 7.4    2015-08-05 Difficult People 7.4    2015-04-08 Your Family or Mine 4.6    2016-03-01 Loosely Exactly Nicole 5.8    2018-06-04 Dietland 8.0    2012-09-25 Cuckoo 6.6    2013-10-23 Ambassadors 7.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   https://www.starz.com/series/blunttalk Genres Comedy Keywords talk show journalism behind the scenes tv studio Content Score 100 Yes! Looking good! Top Contributors 58 Elizabeth Jennings V 20 Vionel 5 Philippe LeMarchand 4 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}