{"link": "https://www.themoviedb.org/tv/21651?language=en", "title": "The Little Couple", "resume": "Bill Klein and Jen Arnold are just like your average couple – except they’re both under 4 feet tall! They’ve faced not only the struggles of two little people in an average-sized world, but are starting a family with their two adorable, adopted children.", "rate": 80, "genre": ["Reality"], "cast": ["Bill Klein", "Jennifer Arnold"], "character": ["Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21651   Expand The Little Couple   (2009) User Score Overview Bill Klein and Jen Arnold are just like your average couple – except they’re both under 4 feet tall! They’ve faced not only the struggles of two little people in an average-sized world, but are starting a family with their two adorable, adopted children. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Klein Himself Jennifer Arnold Herself Full Cast & Crew Last Season Season 12 2017 | 10 Episodes Season 12 of The Little Couple premiered on September 19, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Moving to FLORIDA Open 0 by Invidia\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Little Couple. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  23m, 30m Homepage   http://www.tlc.com/tv-shows/little-couple Genres Reality Keywords little people Content Score 56 We're so close, yet so far. Top Contributors 9 Elizabeth Jennings 6 Banana b 5 basher d 4 diwasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}