{"link": "https://www.themoviedb.org/tv/66606?language=en", "title": "Roots", "resume": "An adaptation of Alex Haley's \"Roots\", chronicling the history of an African slave, Kunta Kinte sold to America and his descendants.", "rate": 64, "genre": ["Drama"], "cast": ["Malachi Kirby", "Matthew Goode", "James Purefoy", "Forest Whitaker", "Emayatzy Corinealdi"], "character": ["Kunta Kinte", "Dr. William Waller", "John Waller", "Fiddler", "Belle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66606   Expand Roots   (2016) User Score Overview An adaptation of Alex Haley's \"Roots\", chronicling the history of an African slave, Kunta Kinte sold to America and his descendants. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Malachi Kirby Kunta Kinte Matthew Goode Dr. William Waller James Purefoy John Waller Forest Whitaker Fiddler Emayatzy Corinealdi Belle Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Roots premiered on May 30, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Levar Burton Open 0 by DanDare\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2001-11-01 Sweet Life 5.8    1977-01-23 Roots 7.7    2005-07-20 So You Think You Can Dance 6.5    2016-02-05 Animals. 5.8    2016-03-09 Underground 6.7    2016-08-12 The Get Down 7.6    2003-09-19 Peep Show 8.2    2016-09-06 Atlanta 7.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  120m Homepage   http://roots.history.com/ Genres Drama Keywords based on novel or book slavery plantation remake miniseries 18th century historical drama Content Score 93 Almost there... Top Contributors TB 40 TMDb Bot 16 Banana 14 Elizabeth Jennings 11 abimanyu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}