{"link": "https://www.themoviedb.org/tv/67728?language=en", "title": "Doctor Doctor", "resume": "The story of Hugh Knight, a rising heart surgeon who is gifted, charming and infallible. He is a hedonist who, due to his sheer talent, believes he can live outside the rules. His \"work hard, play harder\" philosophy is about to come back and bite him.", "rate": 64, "genre": ["Drama"], "cast": ["Rodger Corser", "Nicole da Silva", "Tina Bursill", "Ryan Johnson", "Steve Bisley"], "character": ["Hugh Knight", "Charlie", "Meryl Knight", "Matt Knight", "Jim Knight"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67728   Expand Doctor Doctor   (2016) User Score  Play Trailer Overview The story of Hugh Knight, a rising heart surgeon who is gifted, charming and infallible. He is a hedonist who, due to his sheer talent, believes he can live outside the rules. His \"work hard, play harder\" philosophy is about to come back and bite him. Featured Crew Ian Collie Creator Alan Harris Creator Claudia Karvan Creator Tony McNamara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rodger Corser Hugh Knight Nicole da Silva Charlie Tina Bursill Meryl Knight Ryan Johnson Matt Knight Steve Bisley Jim Knight Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Doctor Doctor premiered on August 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Doctor Doctor. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres Drama Keywords australia small town surgeon doctor hometown fall from grace general practitioner (gp) simpler life Content Score 100 Yes! Looking good! Top Contributors 20 Elizabeth Jennings 17 United600 c 13 courtneysmith86 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}