{"link": "https://www.themoviedb.org/tv/44037?language=en", "title": "The Hollow Crown", "resume": "The Hollow Crown is a series of British television films featuring William Shakespeare's History Plays.\nThe first Season is an adaptation of Shakespeare's second historical tetralogy, the Henriad: Richard II, Henry IV, Part I and Henry IV, Part II (treated as one film in two parts in the series) and Henry V.\nThe Second Season is subtitled \"The Wars of the Roses\" as a reference to its scope. It is based on Shakespeare's first tetralogy: Henry VI: Part I, Henry VI: Part II, Henry VI: Part III (treated as two films in the series) and Richard III.", "rate": 56, "genre": ["Drama", "History"], "cast": ["Benedict Cumberbatch", "Tom Sturridge", "Sophie Okonedo", "Hugh Bonneville"], "character": ["Richard III", "Henry VI", "Margaret of Anjou", "Humphrey, Duke of Gloucester"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44037   Expand The Hollow Crown   (2012) User Score Overview The Hollow Crown is a series of British television films featuring William Shakespeare's History Plays. The first Season is an adaptation of Shakespeare's second historical tetralogy, the Henriad: Richard II, Henry IV, Part I and Henry IV, Part II (treated as one film in two parts in the series) and Henry V. The Second Season is subtitled \"The Wars of the Roses\" as a reference to its scope. It is based on Shakespeare's first tetralogy: Henry VI: Part I, Henry VI: Part II, Henry VI: Part III (treated as two films in the series) and Richard III. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benedict Cumberbatch Richard III Tom Sturridge Henry VI Sophie Okonedo Margaret of Anjou Hugh Bonneville Humphrey, Duke of Gloucester Full Cast & Crew Last Season The Wars of the Roses 2016 | 6 Episodes Season 2 of The Hollow Crown premiered on May  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Hollow Crown. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  114m, 132m Homepage   http://www.bbc.co.uk/programmes/b07bqgjn Genres Drama History Keywords shakespeare period drama Content Score 86 Almost there... Top Contributors 23 Elizabeth Jennings 6 Matthew Sanders 6 Imzadi 5 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}