{"link": "https://www.themoviedb.org/tv/64054?language=en", "title": "Wicked Tuna: Outer Banks", "resume": "The long, cold winter has just hit New England, and while the bluefin tuna season has come to an end in Gloucester, Mass., it’s just getting started in the Outer Banks of North Carolina. After a disappointing season, several of Gloucester’s top fishermen head south to try to salvage their finances by fishing for the elusive bluefin tuna in unfamiliar Carolina waters before the experienced locals beat them to the catch. It’s a whole new battlefield and the Northern captains must conquer new styles of fishing, treacherous waters and the wrath of the Outer Banks’ top fishermen. They’re gambling on what could be a massive payday … or a huge financial loss.", "rate": 57, "genre": ["Reality"], "cast": ["Dave Marciano", "Britton Shackelford", "Tyler McLaughlin", "Greg Mayer", "TJ Ott"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64054   Expand Wicked Tuna: Outer Banks   (2014) User Score  Play Trailer Overview The long, cold winter has just hit New England, and while the bluefin tuna season has come to an end in Gloucester, Mass., it’s just getting started in the Outer Banks of North Carolina. After a disappointing season, several of Gloucester’s top fishermen head south to try to salvage their finances by fishing for the elusive bluefin tuna in unfamiliar Carolina waters before the experienced locals beat them to the catch. It’s a whole new battlefield and the Northern captains must conquer new styles of fishing, treacherous waters and the wrath of the Outer Banks’ top fishermen. They’re gambling on what could be a massive payday … or a huge financial loss. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  1 Opening Credits  0 Top Billed Cast Dave Marciano Himself Britton Shackelford Himself Tyler McLaughlin Himself Greg Mayer Himself TJ Ott Himself Full Cast & Crew Current Season Season 5 2018 | 1 Episode Season 5 of Wicked Tuna: Outer Banks premiered on July  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wicked Tuna: Outer Banks. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  45m Homepage   http://channel.nationalgeographic.com/wicked-tuna-outer-banks/ Genres Reality Keywords fishing tuna commercial fishing outer banks Content Score 93 Almost there... Top Contributors 28 Elizabeth Jennings 25 mattoaks z 10 zorg2000k b 3 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}