{"link": "https://www.themoviedb.org/tv/3425?language=en", "title": "Ultraman", "resume": "Ultraman is a Japanese Tokusatsu television series that first aired in 1966. Ultraman is a follow-up to the television series Ultra Q, though not technically a sequel or spin-off. The show was produced by the Tsuburaya Productions, and was broadcast on Tokyo Broadcasting System from July 17, 1966 to April 9, 1967, with a total of 39 episodes.\nAlthough Ultraman is the first series to feature an Ultra-Crusader, it is actually the second show in the Ultra Series. Ultra Q was the first. In fact, Ultraman opens with the Ultra Q logo exploding into the Ultraman logo. Ultraman ultimately became a major pop culture phenomenon in Japan. The show's success spawned dozens of sequels, spin-offs, imitators, parodies and remakes.\nTo distinguish him from subsequent Ultra-Crusaders, Ultraman is referred to as the Original Ultraman, The First Ultraman, or Ultraman Hayata; this last is a reference to his host's surname.", "rate": 95, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3425   Expand Ultraman   (1966) User Score  Play Trailer Overview Ultraman is a Japanese Tokusatsu television series that first aired in 1966. Ultraman is a follow-up to the television series Ultra Q, though not technically a sequel or spin-off. The show was produced by the Tsuburaya Productions, and was broadcast on Tokyo Broadcasting System from July 17, 1966 to April 9, 1967, with a total of 39 episodes. Although Ultraman is the first series to feature an Ultra-Crusader, it is actually the second show in the Ultra Series. Ultra Q was the first. In fact, Ultraman opens with the Ultra Q logo exploding into the Ultraman logo. Ultraman ultimately became a major pop culture phenomenon in Japan. The show's success spawned dozens of sequels, spin-offs, imitators, parodies and remakes. To distinguish him from subsequent Ultra-Crusaders, Ultraman is referred to as the Original Ultraman, The First Ultraman, or Ultraman Hayata; this last is a reference to his host's surname. Featured Crew Eiji Tsuburaya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 22 2016 | 6 Episodes Season 22 of Ultraman premiered on July  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ultraman. You can help by rating TV shows you've seen. Facts Original Name  ウルトラマン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 6 carlosglaujor 2 Jaime Neto D 2 Desy85 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}