{"link": "https://www.themoviedb.org/tv/62120?language=en", "title": "Dig", "resume": "When FBI Agent Peter Connelly, recently stationed in Jerusalem, begins investigating the murder of a young American, he realizes that he’s uncovered an ancient international conspiracy that threatens to change the course of human history. Certain that the dangerous prophecy is nearing fruition, Peter must race against the clock to unravel its mystery. From a remote farm in Norway, to an enigmatic compound in New Mexico, to the serpentine tunnels of Jerusalem, he searches for the truth, the revelation of which will shake the world's beliefs to its very core.", "rate": 67, "genre": ["Drama", "Mystery"], "cast": ["Jason Isaacs", "Anne Heche", "Angela Bettis", "Omar Metwally", "Lauren Ambrose"], "character": ["Peter Connelly", "Lynn Monahan", "Fay", "Yussef Khalid", "Debbie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62120   Expand Dig   (2015) User Score  Play Trailer Overview When FBI Agent Peter Connelly, recently stationed in Jerusalem, begins investigating the murder of a young American, he realizes that he’s uncovered an ancient international conspiracy that threatens to change the course of human history. Certain that the dangerous prophecy is nearing fruition, Peter must race against the clock to unravel its mystery. From a remote farm in Norway, to an enigmatic compound in New Mexico, to the serpentine tunnels of Jerusalem, he searches for the truth, the revelation of which will shake the world's beliefs to its very core. Featured Crew Gideon Raff Creator Tim Kring Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Isaacs Peter Connelly Anne Heche Lynn Monahan Angela Bettis Fay Omar Metwally Yussef Khalid Lauren Ambrose Debbie Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Dig premiered on March  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations   2014-11-13 Babylon 7.1    2016-04-11 Hunters 4.9    2011-01-09 The Cape 4.3    2015-01-13 Cockroaches 6.0    2014-08-28 Hysteria 5.3    2015-04-05 American Odyssey 6.7    2014-01-07 Intelligence 6.3    2007-09-24 Journeyman 7.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.usanetwork.com/dig Genres Drama Mystery Keywords jerusalem religion fbi agent Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings o 16 orhan_yümücly 10 Banana M 8 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}