{"link": "https://www.themoviedb.org/tv/1068?language=en", "title": "The New Scooby-Doo Movies", "resume": "The New Scooby-Doo Movies is the second incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo, Where Are You!. It premiered on September 9, 1972 and ran for two seasons on CBS as the only hour-long Scooby-Doo series. Twenty-four episodes were ultimately produced.\nAside from doubling the length of each episode, The New Scooby-Doo Movies differed from its predecessor in the addition of a rotating special guest star slot; each episode featured real-life celebrities or well known fictional characters joining the Mystery, Inc. gang in solving the mystery of the week. Some episodes, in particular the episodes guest-starring the characters from The Addams Family, Batman, and Jeannie, deviated from the established Scooby-Doo format of presenting criminals masquerading as supernatural beings by introducing real ghosts, witches, monsters, and other such characters into the plots. The New Scooby-Doo Movies was the last incarnation of Scooby-Doo to feature Nicole Jaffe as the regular voice of Velma Dinkley, due to her marriage and retirement from acting.", "rate": 64, "genre": ["Animation", "Mystery", "Comedy"], "cast": ["Don Messick", "Casey Kasem", "Frank Welker", "Nicole Jaffe", "Heather North"], "character": ["Scooby Doo (voice)", "Shaggy  (voice)", "Freddie (voice)", "Velma (voice)", "Daphne (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1068   Expand The New Scooby-Doo Movies   (1972) User Score Overview The New Scooby-Doo Movies is the second incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo, Where Are You!. It premiered on September 9, 1972 and ran for two seasons on CBS as the only hour-long Scooby-Doo series. Twenty-four episodes were ultimately produced. Aside from doubling the length of each episode, The New Scooby-Doo Movies differed from its predecessor in the addition of a rotating special guest star slot; each episode featured real-life celebrities or well known fictional characters joining the Mystery, Inc. gang in solving the mystery of the week. Some episodes, in particular the episodes guest-starring the characters from The Addams Family, Batman, and Jeannie, deviated from the established Scooby-Doo format of presenting criminals masquerading as supernatural beings by introducing real ghosts, witches, monsters, and other such characters into the plots. The New Scooby-Doo Movies was the last incarnation of Scooby-Doo to feature Nicole Jaffe as the regular voice of Velma Dinkley, due to her marriage and retirement from acting. Featured Crew Joe Ruby Creator Ken Spears Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Messick Scooby Doo (voice) Casey Kasem Shaggy  (voice) Frank Welker Freddie (voice) Nicole Jaffe Velma (voice) Heather North Daphne (voice) Full Cast & Crew Last Season Season 2 1973 | 8 Episodes Season 2 of The New Scooby-Doo Movies premiered on September  8, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1985-09-07 The 13 Ghosts of Scooby-Doo 6.2    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    1984-09-08 The New Scooby-Doo Mysteries 6.2    1969-09-13 Scooby-Doo, Where Are You! 7.5    2002-09-14 What's New, Scooby-Doo? 7.0    2003-04-12 All Grown Up! 4.7    1958-10-02 The Huckleberry Hound Show 7.0    1987-04-06 Biography 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 40m, 48m, 43m Homepage  - Genres Animation Mystery Comedy Keywords crime solving Content Score 93 Almost there... Top Contributors N 24 Notamymerrick 7 Banana g 5 gregbl AK 4 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}