{"link": "https://www.themoviedb.org/tv/43512?language=en", "title": "Les Misérables", "resume": "Les Misérables is a 2000 French television miniseries based on the novel of the same name by Victor Hugo. The miniseries was broadcast in four parts. A three hour English version was also released.", "rate": 70, "genre": ["Drama"], "cast": ["Gérard Depardieu", "John Malkovich", "Christian Clavier", "Asia Argento", "Charlotte Gainsbourg"], "character": ["Jean Valjean", "Javert", "Thénardier", "Éponine Thénardier", "Fantine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43512   Expand Les Misérables   (2000) User Score Overview Les Misérables is a 2000 French television miniseries based on the novel of the same name by Victor Hugo. The miniseries was broadcast in four parts. A three hour English version was also released. Featured Crew Josée Dayan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Gérard Depardieu Jean Valjean John Malkovich Javert Christian Clavier Thénardier Asia Argento Éponine Thénardier Charlotte Gainsbourg Fantine Full Cast & Crew Last Season Season 1 2000 | 4 Episodes Season 1 of Les Misérables premiered on September  4, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   2002-10-07 Napoleon 7.1    2002-10-27 Caméra Café 6.8    1998-09-07 The Count of Monte Cristo 7.2    2010-07-23 The Pillars of the Earth 7.9    1996-09-19 The Pretender 7.3    2012-09-04 World Without End 6.8    2004-04-12 GANTZ 6.7    1989-04-15 Around the World in 80 Days 6.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  90m, 100m Homepage  - Genres Drama Keywords based on novel or book miniseries woman director Content Score 100 Yes! Looking good! Top Contributors TB 111 TMDb Bot n 9 nbvcxw9876 R 6 Rebecca k 5 kaficko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}