{"link": "https://www.themoviedb.org/tv/69129?language=en", "title": "The Halcyon", "resume": "The story of a bustling and glamorous five star hotel at the centre of London society and a world at war.", "rate": 59, "genre": ["Drama"], "cast": ["Steven Mackintosh", "Olivia Williams", "Hermione Corfield", "Jamie Blackley", "Edward Bluemel"], "character": ["Richard Garland", "Lady Priscilla Hamilton", "Emma Garland", "Freddie Hamilton", "Toby Hamilton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69129   Expand The Halcyon   (2017) User Score  Play Trailer Overview The story of a bustling and glamorous five star hotel at the centre of London society and a world at war. Featured Crew Charlotte Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  12 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Mackintosh Richard Garland Olivia Williams Lady Priscilla Hamilton Hermione Corfield Emma Garland Jamie Blackley Freddie Hamilton Edward Bluemel Toby Hamilton Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of The Halcyon premiered on January  2, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply A solid first season Open 1 by working_girl\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  3 Recommendations   2016-08-12 The Get Down 7.6    2017-01-06 Emerald City 6.2    2016-08-28 Victoria 6.5    2016-10-05 Frequency 7.3  Facts Status  Cancelled Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  46m Homepage   https://www.leftbankpictures.co.uk/#!/tv/the-halcyon Genres Drama Keywords hotel london england world war ii period drama costume drama 1940s high class Content Score 100 Yes! Looking good! Top Contributors 51 Elizabeth Jennings p 23 plumpro 6 Banana m 4 michael47  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}