{"link": "https://www.themoviedb.org/tv/66325?language=en", "title": "Superquark", "resume": "Television program of cultural diffusion, born in September 1995, designed and conducted by Piero Angela, development of transmission appreciated Quark.", "rate": 5, "genre": ["Documentary"], "cast": ["Piero Angela"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66325   Expand Superquark   (1995) User Score Overview Television program of cultural diffusion, born in September 1995, designed and conducted by Piero Angela, development of transmission appreciated Quark. Featured Crew Piero Angela Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Piero Angela Full Cast & Crew Last Season Season 16 2016 | 9 Episodes Season 16 of Superquark premiered on July 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Superquark. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  Italian Runtime  120m Homepage   http://www.superquark.rai.it/ Genres Documentary Keywords biology technology history documentary nature science astronomy Content Score 64 We're so close, yet so far. Top Contributors C 85 Cataloguer i 6 idro 2 Elizabeth Jennings k 2 khailen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}