{"link": "https://www.themoviedb.org/tv/1073?language=en", "title": "I'm Alan Partridge", "resume": "I'm Alan Partridge is a BBC situation comedy starring Steve Coogan, of which two series of six episodes each were produced — the first in 1997 and the second in 2002. The series followed the titular Alan Partridge, a failed television presenter whose previous exploits had featured in the chat-show parody Knowing Me, Knowing You with Alan Partridge, and who is now presenting a programme on local radio in Norwich.\nBoth series were written by Peter Baynham, Coogan and Armando Iannucci; supporting Coogan were Felicity Montagu as his faithful, mouse-like personal assistant, Lynn Benfield; Simon Greenall as Geordie Travel Tavern handyman/BP garage attendant Michael; and Phil Cornwell as disc jockey Dave Clifton.\nIt has been well received by both critics and fans, and was nominated for three BAFTAs, two British Comedy Award, and a Royal Television Society award.", "rate": 71, "genre": ["Comedy"], "cast": ["Steve Coogan", "Sally Phillips", "Amelia Bullmore", "Felicity Montagu", "Simon Greenall"], "character": ["Alan Partridge", "Sophie", "Sonja", "Lynn Benfield", "Michael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1073   Expand I'm Alan Partridge   (1997) User Score Overview I'm Alan Partridge is a BBC situation comedy starring Steve Coogan, of which two series of six episodes each were produced — the first in 1997 and the second in 2002. The series followed the titular Alan Partridge, a failed television presenter whose previous exploits had featured in the chat-show parody Knowing Me, Knowing You with Alan Partridge, and who is now presenting a programme on local radio in Norwich. Both series were written by Peter Baynham, Coogan and Armando Iannucci; supporting Coogan were Felicity Montagu as his faithful, mouse-like personal assistant, Lynn Benfield; Simon Greenall as Geordie Travel Tavern handyman/BP garage attendant Michael; and Phil Cornwell as disc jockey Dave Clifton. It has been well received by both critics and fans, and was nominated for three BAFTAs, two British Comedy Award, and a Royal Television Society award. Featured Crew Armando Iannucci Creator Peter Baynham Creator Steve Coogan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Coogan Alan Partridge Sally Phillips Sophie Amelia Bullmore Sonja Felicity Montagu Lynn Benfield Simon Greenall Michael Full Cast & Crew Last Season Season 2 2002 | 6 Episodes Season 2 of I'm Alan Partridge premiered on November 11, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Never Say Alan Again: No OHMSS? Open 0 by The Midi-chlorian Count\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   1994-09-16 Knowing Me Knowing You with Alan Partridge 7.5    1994-01-19 The Day Today 8.3    1995-04-21 Father Ted 7.9    2004-05-18 The Mighty Boosh 7.5    1997-01-29 Brass Eye 8.0    1981-09-08 Only Fools and Horses 8.2    2010-02-19 The Ricky Gervais Show 7.9    1999-01-11 The League of Gentlemen 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00hxqcx Genres Comedy Keywords radio satire sitcom british humour Content Score 93 Almost there... Top Contributors 16 Banana z 4 zurman1 O 4 Ozbourne R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}