{"link": "https://www.themoviedb.org/tv/4761?language=en", "title": "The Knock", "resume": "The Knock is a British television drama series, created by Anita Bronson and broadcast on ITV from 1994 to 2000, which portrayed the activities of customs officers from Her Majesty's Customs and Excise.\nThe series derived its name from the distinctive \"Knock knock knock\" command used over the radio to synchronise a raid.\nThe core cast members in the first series were:\n⁕David Morrissey\n⁕Marston Bloom\n⁕Alex Kingston\n⁕Malcolm Storry\n⁕Enzo Squillino, Jr.\n⁕Jack Ellis\n⁕Lenny McLean\n⁕Steve Toussaint\n⁕Caroline Lee-Johnson", "rate": 100, "genre": ["Drama"], "cast": ["Andrew Dunn", "Caroline Lee-Johnson", "Malcolm Storry", "Anthony Valentine"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4761   Expand The Knock   (1994) User Score Overview The Knock is a British television drama series, created by Anita Bronson and broadcast on ITV from 1994 to 2000, which portrayed the activities of customs officers from Her Majesty's Customs and Excise. The series derived its name from the distinctive \"Knock knock knock\" command used over the radio to synchronise a raid. The core cast members in the first series were: ⁕David Morrissey ⁕Marston Bloom ⁕Alex Kingston ⁕Malcolm Storry ⁕Enzo Squillino, Jr. ⁕Jack Ellis ⁕Lenny McLean ⁕Steve Toussaint ⁕Caroline Lee-Johnson Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Dunn Caroline Lee-Johnson Malcolm Storry Anthony Valentine Full Cast & Crew Last Season Season 5 2000 | 5 Episodes Season 5 of The Knock premiered on October 21, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Knock. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 2 rudely_murray 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}