{"link": "https://www.themoviedb.org/tv/56295?language=en", "title": "Halo 4 Forward Unto Dawn", "resume": "Halo 4: Forward Unto Dawn is a science fiction web series set in the universe of the Halo franchise. Forward Unto Dawn consists of five 15-minute episodes released weekly starting on October 5, 2012, and was later released as a single film on DVD and Blu-ray. The series was produced as a marketing effort for the video game Halo 4 intended to widen the audience of the Halo series and as a stepping stone to a potential Halo film. It was written by Aaron Helbing and Todd Helbing, and directed by Stewart Hendler. Forward Unto Dawn was shot in Vancouver over 25 days in May 2012 on a budget just under USD $10 million. It has just under 500 shots with computer generated imagery, approximately a quarter of what a feature film would have, but the visual effects received praise from reviewers.\nA coming-of-age story, Forward Unto Dawn follows a cadet, Thomas Lasky, at a twenty-sixth century military training academy as it is attacked by the Covenant, an alliance of alien zealots. Lasky is unsure of his future within the military but feels pressured to follow in the footsteps of his mother and brother. Lasky and his surviving squad mates are rescued by the Master Chief and, after the death of his romantic interest, Chyler Silva, Lasky is inspired by the Chief to take initiative and aids him in saving the remaining cadets.", "rate": 64, "genre": ["Drama", "Action", "Adventure"], "cast": ["Tom Green", "Anna Popplewell", "Iain Belcher", "Jenna Berman", "Enisha Brewster"], "character": ["Thomas Lasky", "Chyler Silva", "Vickers", "Kelly-087", "April Orenski"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56295   Expand Halo 4 Forward Unto Dawn   (2012) User Score  Play Trailer Overview Halo 4: Forward Unto Dawn is a science fiction web series set in the universe of the Halo franchise. Forward Unto Dawn consists of five 15-minute episodes released weekly starting on October 5, 2012, and was later released as a single film on DVD and Blu-ray. The series was produced as a marketing effort for the video game Halo 4 intended to widen the audience of the Halo series and as a stepping stone to a potential Halo film. It was written by Aaron Helbing and Todd Helbing, and directed by Stewart Hendler. Forward Unto Dawn was shot in Vancouver over 25 days in May 2012 on a budget just under USD $10 million. It has just under 500 shots with computer generated imagery, approximately a quarter of what a feature film would have, but the visual effects received praise from reviewers. A coming-of-age story, Forward Unto Dawn follows a cadet, Thomas Lasky, at a twenty-sixth century military training academy as it is attacked by the Covenant, an alliance of alien zealots. Lasky is unsure of his future within the military but feels pressured to follow in the footsteps of his mother and brother. Lasky and his surviving squad mates are rescued by the Master Chief and, after the death of his romantic interest, Chyler Silva, Lasky is inspired by the Chief to take initiative and aids him in saving the remaining cadets. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  23 Posters  14 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Green Thomas Lasky Anna Popplewell Chyler Silva Iain Belcher Vickers Jenna Berman Kelly-087 Enisha Brewster April Orenski Full Cast & Crew Last Season Season 1 2012 | 5 Episodes Season 1 of Halo 4 Forward Unto Dawn premiered on October  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  23 Posters  14 Recommendations   2015-10-27 Halo: The Fall of Reach 5.9    2009-07-26 The Storm 4.0    1988-10-02 Piece of Cake 6.8    2013-12-11 Lucan 6.3    2008-05-26 The Andromeda Strain 6.3    2014-11-11 Halo: Nightfall 5.9    2007-09-26 Bionic Woman 5.5    2009-08-02 Defying Gravity 6.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  20m Homepage  - Genres Drama Action & Adventure Keywords video game duringcreditsstinger Content Score 93 Almost there... Top Contributors TB 110 TMDb Bot R 7 Rebecca C 4 Csuko t 4 taxigps  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}