{"link": "https://www.themoviedb.org/tv/50558?language=en", "title": "Crisis", "resume": "When Washington's most powerful players are pulled into an international conspiracy, an unlikely puppeteer will bring everyone from CEOs to The President of the United States to their knees by threatening the things they hold most dear.", "rate": 61, "genre": ["Mystery", "Action", "Adventure"], "cast": ["Dermot Mulroney", "Rachael Taylor", "Lance Gross", "James Lafferty", "Max Martini"], "character": ["Francis Gibson", "Agent Susie Dunn", "Agent Marcus Finley", "Mr. Nash", "Koz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50558   Expand Crisis   (2014) User Score Overview When Washington's most powerful players are pulled into an international conspiracy, an unlikely puppeteer will bring everyone from CEOs to The President of the United States to their knees by threatening the things they hold most dear.  Featured Crew Rand Ravich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dermot Mulroney Francis Gibson Rachael Taylor Agent Susie Dunn Lance Gross Agent Marcus Finley James Lafferty Mr. Nash Max Martini Koz Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Crisis premiered on March 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations   2015-01-27 Stalker 5.8    2013-02-19 Cult 4.2    2014-07-20 The Lottery 4.9    2016-10-16 Eyewitness 7.4    2013-10-25 Dracula 5.9    2012-08-12 Animal Practice 4.7    2010-07-13 Covert Affairs 6.4    2009-09-22 The Forgotten 6.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   https://www.nbc.com/crisis Genres Mystery Action & Adventure Keywords fbi conspiracy hostage situation secret service Content Score 93 Almost there... Top Contributors 34 seawolf 20 benf45 19 Elizabeth Jennings 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}