{"link": "https://www.themoviedb.org/tv/39103?language=en", "title": "Braxton Family Values", "resume": "Like their famous sister Toni Braxton, Traci, Towanda, Trina and Tamar were all blessed with the gift of song and shared that gift as a group called \"The Braxtons,\" managed by their mom Evelyn. Now, after battling debilitating illnesses that left her out of the spotlight, Toni Braxton is now fighting her way back to the top. She enlists the help of her sisters, but the drama they bring proves to be too much at times.", "rate": 58, "genre": ["Reality"], "cast": ["Toni Braxton", "Traci Braxton", "Tamar Braxton", "Towanda Braxton", "Trina Braxton"], "character": ["Herself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39103   Expand Braxton Family Values   (2011) User Score Overview Like their famous sister Toni Braxton, Traci, Towanda, Trina and Tamar were all blessed with the gift of song and shared that gift as a group called \"The Braxtons,\" managed by their mom Evelyn. Now, after battling debilitating illnesses that left her out of the spotlight, Toni Braxton is now fighting her way back to the top. She enlists the help of her sisters, but the drama they bring proves to be too much at times. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toni Braxton Herself Traci Braxton Herself Tamar Braxton Herself Towanda Braxton Herself Trina Braxton Herself Full Cast & Crew Current Season Season 6 2018 | 8 Episodes Season 6 of Braxton Family Values premiered on March 22, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply b Tamar Open 3 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Braxton Family Values. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  43m Homepage   http://www.wetv.com/shows/braxton-family-values/ Genres Reality Keywords sibling relationship singer black family Content Score 86 Almost there... Top Contributors 38 Banana 10 Elizabeth Jennings TB 6 TMDb Bot 3 Sall  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}