{"link": "https://www.themoviedb.org/tv/530?language=en", "title": "The Mobile Cop Jiban", "resume": "The Mobile Cop Jiban is a Japanese tokusatsu television series which serves as the 8th entry in the Metal Hero franchise, and the first series to have toy commercials that were filmed on Videotape. Produced by Toei and aired by TV Asahi in Japan from January 29, 1989 to January 28, 1990, it ran for 52 episodes and a feature movie aired on July 17, 1989. According to Toei's International Sales & Promotion Department, the series' English title can be referred to as Jiban. Created by Keita Amemiya, the premise for the series combines elements from the American film Robocop and the 1970s tokusatsu Robot Detective.\nThe opening catchphrase of the series is: \"This is the drama of a girl's and a young man's hearts which love people and protect justice.\"", "rate": 100, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Shouhei Kusaka", "Michiko Enokida", "Kunio Konishi", "Konomi Mashita", "Shozo Iizuka"], "character": ["Naoto Tamura/Jiban", "Chief Youko Katagiri", "Seishiro \"Seishi\" Muramatsu", "Ayumi Igarashi (Tamura)/Midori Hayakawa", "Dr Jean Marrie (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 530   Expand The Mobile Cop Jiban   (1989) User Score Overview The Mobile Cop Jiban is a Japanese tokusatsu television series which serves as the 8th entry in the Metal Hero franchise, and the first series to have toy commercials that were filmed on Videotape. Produced by Toei and aired by TV Asahi in Japan from January 29, 1989 to January 28, 1990, it ran for 52 episodes and a feature movie aired on July 17, 1989. According to Toei's International Sales & Promotion Department, the series' English title can be referred to as Jiban. Created by Keita Amemiya, the premise for the series combines elements from the American film Robocop and the 1970s tokusatsu Robot Detective. The opening catchphrase of the series is: \"This is the drama of a girl's and a young man's hearts which love people and protect justice.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shouhei Kusaka Naoto Tamura/Jiban Michiko Enokida Chief Youko Katagiri Kunio Konishi Seishiro \"Seishi\" Muramatsu Konomi Mashita Ayumi Igarashi (Tamura)/Midori Hayakawa Shozo Iizuka Dr Jean Marrie (voice) Full Cast & Crew Last Season Kidou keiji jiban season 1 1989 | 52 Episodes Season 1 of The Mobile Cop Jiban premiered on January 29, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Mobile Cop Jiban. You can help by rating TV shows you've seen. Facts Original Name  機動刑事ジバン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords tokusatsu Content Score 86 Almost there... Top Contributors a 25 agabrielads NS 15 Norte Serra 12 BrerFox P 11 PC  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}