{"link": "https://www.themoviedb.org/tv/3469?language=en", "title": "Minder", "resume": "Minder is a British comedy-drama series about the London criminal underworld. Initially produced by Verity Lambert, it was made by Euston Films, a subsidiary of Thames Television and shown on ITV. The show ran for ten series between 29 October 1979 and 10 March 1994, and starred Dennis Waterman as Terry McCann, an honest and likable bodyguard and George Cole as Arthur Daley, a socially ambitious, but highly unscrupulous importer-exporter, wholesaler, used-car salesman, and anything else from which there was money to be made whether inside the law or not. The show was largely responsible for putting the word minder, meaning personal bodyguard, into the UK and Australian popular lexicon. The characters often drank at the local members-only Winchester Club, where owner and barman Dave acted, often unwillingly, as a message machine for Arthur, and turned a blind eye to his shady deals. The series was notable for using a range of leading British actors, as well as many up-and-coming performers before they hit the big time; at its peak was one of ITV's biggest ratings winners.\nIn 2008, it was announced that Minder would go into production for broadcast in 2009 for a new version, although none of the original cast would appear in the new episodes. The new show focused on Arthur's nephew, Archie, played by Shane Richie. The series began broadcast on 4 February 2009. In 2010, it was announced that no further episodes would be made following lukewarm reception to the first series.", "rate": 86, "genre": ["Action", "Adventure", "Comedy", "Drama"], "cast": ["George Cole", "Dennis Waterman", "Glynn Edwards", "Patrick Malahide", "Gary Webster"], "character": ["Arthur Daley", "Terry McCann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3469   Expand Minder   (1979) User Score Overview Minder is a British comedy-drama series about the London criminal underworld. Initially produced by Verity Lambert, it was made by Euston Films, a subsidiary of Thames Television and shown on ITV. The show ran for ten series between 29 October 1979 and 10 March 1994, and starred Dennis Waterman as Terry McCann, an honest and likable bodyguard and George Cole as Arthur Daley, a socially ambitious, but highly unscrupulous importer-exporter, wholesaler, used-car salesman, and anything else from which there was money to be made whether inside the law or not. The show was largely responsible for putting the word minder, meaning personal bodyguard, into the UK and Australian popular lexicon. The characters often drank at the local members-only Winchester Club, where owner and barman Dave acted, often unwillingly, as a message machine for Arthur, and turned a blind eye to his shady deals. The series was notable for using a range of leading British actors, as well as many up-and-coming performers before they hit the big time; at its peak was one of ITV's biggest ratings winners. In 2008, it was announced that Minder would go into production for broadcast in 2009 for a new version, although none of the original cast would appear in the new episodes. The new show focused on Arthur's nephew, Archie, played by Shane Richie. The series began broadcast on 4 February 2009. In 2010, it was announced that no further episodes would be made following lukewarm reception to the first series. Featured Crew Leon Griffiths Creator Verity Lambert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Cole Arthur Daley Dennis Waterman Terry McCann Glynn Edwards Patrick Malahide Gary Webster Full Cast & Crew Last Season Season 10 1994 | 11 Episodes Season 10 of Minder premiered on January  6, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1975-01-02 The Sweeney 6.4    1978-02-08 Grange Hill 6.9    1966-01-03 Camberwick Green 8.3    1973-09-25 Police Story 6.4    1967-01-03 Trumpton 8.8    1973-08-15 Man About the House 8.0    1984-10-16 The Bill 6.6    1962-01-04 Steptoe and Son 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Comedy Drama Keywords gangster bodyguard boxer gritty dealer british humour Content Score 93 Almost there... Top Contributors O 19 Outofbounds7 O 14 Ozbourne m 5 movienator TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}