{"link": "https://www.themoviedb.org/tv/60766?language=en", "title": "Sirens", "resume": "A comedy that follows three Chicago EMTs who despite their narcissistic and self-destructive personalities are uniquely qualified to save lives.", "rate": 70, "genre": ["Comedy"], "cast": ["Michael Mosley", "Kevin Daniels", "Kevin Bigley", "Jessica McNamee", "Bill Nunn"], "character": ["Johnny Farrell", "Hank St. Clare", "Brian Czyk", "Theresa Kelly", "Cash"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60766   Expand Sirens   (2014) User Score  Play Trailer Overview A comedy that follows three Chicago EMTs who despite their narcissistic and self-destructive personalities are uniquely qualified to save lives. Featured Crew Bob Fisher Creator Denis Leary Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  16 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Mosley Johnny Farrell Kevin Daniels Hank St. Clare Kevin Bigley Brian Czyk Jessica McNamee Theresa Kelly Bill Nunn Cash Full Cast & Crew Last Season Season 2 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  16 Posters  2 Recommendations   2015-04-08 Your Family or Mine 4.6    2015-01-22 Banana 7.8    2013-11-14 Ground Floor 6.1    2015-01-22 Backstrom 6.4    2015-03-17 Ordinary Lies 7.0    2015-03-17 One Big Happy 6.0    2011-07-13 Dance Moms 3.7    2015-06-18 Complications 6.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.usanetwork.com/sirens Genres Comedy Keywords chicago ambulance paramedic workplace comedy Content Score 100 Yes! Looking good! Top Contributors 45 Elizabeth Jennings 21 United600 j 9 jmdalmeida z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}