{"link": "https://www.themoviedb.org/tv/154?language=en", "title": "Good Times", "resume": "Good Times is an American sitcom that originally aired from February 8, 1974, until August 1, 1979, on the CBS television network. It was created by Eric Monte and Mike Evans, and developed by Norman Lear, the series' primary executive producer. Good Times is a spin-off of Maude, which is itself a spin-off of All in the Family along with The Jeffersons.\nThe series is set in Chicago. The first two seasons were taped at CBS Television City in Hollywood. In the fall of 1975, the show moved to Metromedia Square, where Norman Lear's own production company was housed.", "rate": 78, "genre": ["Comedy"], "cast": ["Jimmie Walker", "Esther Rolle", "Bern Nadette Stanis", "Ja'net DuBois", "Ralph Carter"], "character": ["James \"JJ\" Evans", "Florida Evans", "Thelma Evans", "Wilona Woods", "Michael Evans"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 154   Expand Good Times   (1974) User Score  Play Trailer Overview Good Times is an American sitcom that originally aired from February 8, 1974, until August 1, 1979, on the CBS television network. It was created by Eric Monte and Mike Evans, and developed by Norman Lear, the series' primary executive producer. Good Times is a spin-off of Maude, which is itself a spin-off of All in the Family along with The Jeffersons. The series is set in Chicago. The first two seasons were taped at CBS Television City in Hollywood. In the fall of 1975, the show moved to Metromedia Square, where Norman Lear's own production company was housed. Featured Crew Eric Monte Creator Mike Evans Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jimmie Walker James \"JJ\" Evans Esther Rolle Florida Evans Bern Nadette Stanis Thelma Evans Ja'net DuBois Wilona Woods Ralph Carter Michael Evans Full Cast & Crew Last Season Season 6 1978 | 24 Episodes Season 6 of Good Times premiered on September 16, 1978. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Kim Fields Open 2 by  RCH2288 S Jimmie Walkers death in the third season still bothers me Open 0 by Strannger18\n      \n     w J.J.: Happy Birthday Jimmy Walker! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  2 Recommendations   1981-10-29 Gimme a Break! 5.7    1975-12-16 One Day at a Time 6.6    1975-01-18 The Jeffersons 6.7    1985-03-15 Mr. Belvedere 6.8    1982-10-02 Newhart 7.4    1964-09-24 Daniel Boone 5.9    1997-09-25 Veronica's Closet 3.8    1982-03-23 Joanie Loves Chachi 2.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords chicago black family sitcom black sitcom Content Score 100 Yes! Looking good! Top Contributors 14 Steve 9 Banana 6 Norrin_Radd_Of_Zenn_La TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}