{"link": "https://www.themoviedb.org/tv/33404?language=en", "title": "Co-Ed Confidential", "resume": "Co-Ed Confidential is a softcore pornographic cable program that is Cinemax's erotic remake of National Lampoon's Animal House, it is shown on Cinemax After Dark. The series made its premiere in 2007 and has currently had four seasons and 52 episodes and 6 compilations.", "rate": 78, "genre": ["Drama", "Comedy"], "cast": ["Kaylani Lei", "Bradley Joseph", "Michelle Maylene", "Kevin Patrick"], "character": ["Minx", "Larry", "Karen", "James"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33404   Expand Co-Ed Confidential   (2007) User Score  Play Trailer Overview Co-Ed Confidential is a softcore pornographic cable program that is Cinemax's erotic remake of National Lampoon's Animal House, it is shown on Cinemax After Dark. The series made its premiere in 2007 and has currently had four seasons and 52 episodes and 6 compilations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaylani Lei Minx Bradley Joseph Larry Michelle Maylene Karen Kevin Patrick James Full Cast & Crew Last Season Season 4 2010 | 13 Episodes Season 4 of Co-Ed Confidential premiered on June  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Co-Ed Confidential. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.cinemax.com/coed/ Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors F 16 Francky_D 8 Chris Delluci 5 Banana b 4 bails5583  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}