{"link": "https://www.themoviedb.org/tv/21643?language=en", "title": "Fist of Fury", "resume": "Fist of Fury is a 1995 Hong Kong television series adapted from the 1972 film of the same title. Produced by ATV and STAR TV, the series starred Donnie Yen as Chen Zhen, a role previously played by Bruce Lee in Fist of Fury and Jet Li in Fist of Legend. The series is also related to the 2010 film Legend of the Fist: The Return of Chen Zhen, in which Yen reprises his role. This series was edited into a 225 minute movie titled Sworn Revenge for the US market in 2002.", "rate": 80, "genre": ["Action", "Adventure"], "cast": ["Joey Meng", "Donnie Yen", "Eddy Ko", "Yeung Chak-Lam", "Xiong Xin-Xin"], "character": ["Yumi", "Chen Zhen", "Fok Yuen Gaap", "Yukio Takeda", "Hung Fei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21643   Expand Fist of Fury   (1995) User Score Overview Fist of Fury is a 1995 Hong Kong television series adapted from the 1972 film of the same title. Produced by ATV and STAR TV, the series starred Donnie Yen as Chen Zhen, a role previously played by Bruce Lee in Fist of Fury and Jet Li in Fist of Legend. The series is also related to the 2010 film Legend of the Fist: The Return of Chen Zhen, in which Yen reprises his role. This series was edited into a 225 minute movie titled Sworn Revenge for the US market in 2002. Featured Crew Lung Shiu-Kee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joey Meng Yumi Donnie Yen Chen Zhen Eddy Ko Fok Yuen Gaap Yeung Chak-Lam Yukio Takeda Xiong Xin-Xin Hung Fei Full Cast & Crew Last Season Season 1 1995 | 30 Episodes Season 1 of Fist of Fury premiered on August 14, 1995. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fist of Fury. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fist of Fury. You can help by rating TV shows you've seen. Facts Status  Ended Network ATV Home Certification  - Type  Scripted Original Language  Cantonese Runtime  - Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 12 hoanghuu 6 Jack Duiz R 5 Rebecca 4 xukemin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}