{"link": "https://www.themoviedb.org/tv/3696?language=en", "title": "Gavin & Stacey", "resume": "Gavin is an ordinary boy from Billericay, Essex. Stacey is an ordinary girl from Barry Island, South Wales. They’ve spoken on the phone every day at work for months but they’ve never actually met… until now.", "rate": 78, "genre": ["Drama", "Comedy"], "cast": ["Joanna Page", "Mathew Horne", "Alison Steadman", "Ruth Jones", "James Corden"], "character": ["Stacey Shipman", "Gavin Shipman", "Pam Shipman", "Vanessa Jenkins", "Smithy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3696   Expand Gavin & Stacey   (2007) User Score  Play Trailer Overview Gavin is an ordinary boy from Billericay, Essex. Stacey is an ordinary girl from Barry Island, South Wales. They’ve spoken on the phone every day at work for months but they’ve never actually met… until now. Featured Crew James Corden Creator Ruth Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joanna Page Stacey Shipman Mathew Horne Gavin Shipman Alison Steadman Pam Shipman Ruth Jones Vanessa Jenkins James Corden Smithy Full Cast & Crew Last Season Season 3 2009 | 6 Episodes Season 3 of Gavin & Stacey premiered on November 26, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Vanessa: Happy Birthday Ruth Jones! Open 0 by wonder2wonder\n      \n     w Gavin: Happy Birthday Mathew Horne! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2007-08-27 Outnumbered 7.2    2009-11-09 Miranda 7.3    1998-11-12 Dinnerladies 6.4    1998-11-09 Big Train 7.5    2005-06-05 Mock the Week 7.0    1982-11-02 Countdown 5.4    2013-08-16 Big School 6.3    1996-11-12 Never Mind the Buzzcocks 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.babycow.co.uk/?portfolio=gavin-stacey Genres Drama Comedy Keywords dating relationship long distance relationship sitcom british humour straight relationship Content Score 100 Yes! Looking good! Top Contributors 15 Banana w 11 wolff92 5 kcdh 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}