{"link": "https://www.themoviedb.org/tv/557?language=en", "title": "Camp Lazlo", "resume": "Camp Lazlo! is an American animated television series created by Joe Murray. The series was released on July 8, 2005, in the United States and was released on November 1, 2005, in the United Kingdom. The show features a Boy Scout-like summer camp with a cast of anthropomorphic animal characters, a \"retro\" type of humor and silliness akin to Murray's previous series, Rocko's Modern Life, which aired on Nickelodeon a decade earlier, and cultural references.\nThe series ended its two-and-a-half-year run on Cartoon Network on March 27, 2008, with the series finale \"Lumpus' Last Stand\" after 5 seasons and 61 episodes. This series returned to Cartoon Network in October 2012 in re-runs on the revived block, Cartoon Planet.\nThe show's theme song is sung to the tune of Bingo.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Jill Talley", "Jodi Benson", "Steve Little", "Jennifer Hale", "Dee Bradley Baker"], "character": ["Nina (voice) / Gretchen (voice) / Ms. Mucus (voice)", "Patsy Smiles (voice) / Ms. Jane Doe (voice)", "Chip (voice) / Skip (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 557   Expand Camp Lazlo   (2005) User Score  Play Trailer Overview Camp Lazlo! is an American animated television series created by Joe Murray. The series was released on July 8, 2005, in the United States and was released on November 1, 2005, in the United Kingdom. The show features a Boy Scout-like summer camp with a cast of anthropomorphic animal characters, a \"retro\" type of humor and silliness akin to Murray's previous series, Rocko's Modern Life, which aired on Nickelodeon a decade earlier, and cultural references. The series ended its two-and-a-half-year run on Cartoon Network on March 27, 2008, with the series finale \"Lumpus' Last Stand\" after 5 seasons and 61 episodes. This series returned to Cartoon Network in October 2012 in re-runs on the revived block, Cartoon Planet. The show's theme song is sung to the tune of Bingo. Featured Crew Joe Murray Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jill Talley Nina (voice) / Gretchen (voice) / Ms. Mucus (voice) Jodi Benson Patsy Smiles (voice) / Ms. Jane Doe (voice) Steve Little Chip (voice) / Skip (voice) Jennifer Hale Dee Bradley Baker Full Cast & Crew Last Season Season 5 2007 | 9 Episodes Season 5 of Camp Lazlo premiered on September  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2008-06-05 The Marvelous Misadventures of Flapjack 5.9    2005-12-26 My Gym Partner's a Monkey 5.0    2007-11-16 Chowder 6.5    2004-09-18 Super Robot Monkey Team Hyperforce Go! 5.2    2001-06-08 Time Squad 6.4    2007-07-08 Total Drama Island 6.2    2000-11-17 Sheep in the Big City 6.8    2002-12-06 Codename: Kids Next Door 6.5  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cartoonnetwork.com/tv_shows/camplazlo/index.html Genres Animation Comedy Keywords summer camp camp counselor cartoon monkey Content Score 100 Yes! Looking good! Top Contributors L 16 Leah P 8 Prototyp206 5 CrewMdk w 4 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}