{"link": "https://www.themoviedb.org/tv/61258?language=en", "title": "I Don't Trust Men Anymore", "resume": "Yo no creo en los hombres (I don't trust men anymore) is a Mexican telenovela produced by Giselle González for Televisa. It is based on Yo no creo en los hombres (1991), produced in México.", "rate": 10, "genre": ["Drama"], "cast": ["Adriana Louvier", "Gabriel Soto", "Flavio Medina", "Alejandro Camacho", "Rosa María Bianchi"], "character": ["María Dolores", "Maximiliano Bustamante", "Arturo Santibáñez", "Claudio Bustamante", "Úrsula vda. de Santibáñez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61258   Expand I Don't Trust Men Anymore   (2014) User Score Overview Yo no creo en los hombres (I don't trust men anymore) is a Mexican telenovela produced by Giselle González for Televisa. It is based on Yo no creo en los hombres (1991), produced in México. Featured Crew Caridad Bravo Adams Creator Aida Guajardo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adriana Louvier María Dolores Gabriel Soto Maximiliano Bustamante Flavio Medina Arturo Santibáñez Alejandro Camacho Claudio Bustamante Rosa María Bianchi Úrsula vda. de Santibáñez Full Cast & Crew Last Season Season 1 2014 | 130 Episodes Season 1 of I Don't Trust Men Anymore premiered on September  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Don't Trust Men Anymore. You can help by rating TV shows you've seen. Facts Original Name  Yo no creo en los hombres Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://www.televisa.com/telenovelas/yo-no-creo-en-los-hombres/ Genres Drama Keywords telenovela Content Score 93 Almost there... Top Contributors s 34 shiff7 z 5 zurman1 4 Elizabeth Jennings 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}