{"link": "https://www.themoviedb.org/tv/3483?language=en", "title": "Bill Nye The Science Guy", "resume": "Bill Nye the Science Guy is an educational television program that originally aired from September 10, 1993 to June 20, 1998, hosted by William \"Bill\" Nye and produced by Buena Vista Television. The show aired on PBS Kids and was also syndicated to local stations. Each of the 100 episodes aims to teach a specific topic in science to a preteen audience. The show is frequently used in schools as an education medium, and it still airs on some PBS stations for this reason.\nCreated by comedian Ross Shafer and based on sketches on KING-TV's sketch program Almost Live!, Bill Nye the Science Guy was produced by Disney Educational Productions and KCTS-TV of Seattle.\nBill Nye the Science Guy won nineteen Emmy Awards during its run.", "rate": 73, "genre": ["Comedy", "Documentary", "Kids"], "cast": ["Bill Nye", "Rachel Glenn", "Jennifer Lin", "Amy Broder", "Ethan Ferkiss"], "character": ["Host", "Nancy", "Amy", "Smell Gibson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3483   Expand Bill Nye The Science Guy   (1993) User Score  Play Trailer Overview Bill Nye the Science Guy is an educational television program that originally aired from September 10, 1993 to June 20, 1998, hosted by William \"Bill\" Nye and produced by Buena Vista Television. The show aired on PBS Kids and was also syndicated to local stations. Each of the 100 episodes aims to teach a specific topic in science to a preteen audience. The show is frequently used in schools as an education medium, and it still airs on some PBS stations for this reason. Created by comedian Ross Shafer and based on sketches on KING-TV's sketch program Almost Live!, Bill Nye the Science Guy was produced by Disney Educational Productions and KCTS-TV of Seattle. Bill Nye the Science Guy won nineteen Emmy Awards during its run. Featured Crew Bill Nye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Nye Host Rachel Glenn Nancy Jennifer Lin Amy Broder Amy Ethan Ferkiss Smell Gibson Full Cast & Crew Last Season Season 5 1997 | 20 Episodes Season 5 of Bill Nye The Science Guy premiered on September 19, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1997-09-12 Ninja Turtles: The Next Mutation 3.9    1995-12-09 Ace Ventura Pet Detective: The Series 5.0    2000-09-04 Clifford the Big Red Dog 5.6    2015-06-12 Conspiracy 5.7    2016-03-21 72 Dangerous Places to Live 6.0    Where in the World Is Carmen Sandiego? 8.0    2009-02-25 Burnistoun 7.8    1988-10-01 RoboCop: The Animated Series 4.7  Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  26m Homepage  - Genres Comedy Documentary Kids Keywords educational science kids Content Score 100 Yes! Looking good! Top Contributors F 22 FrankTMDB c 7 cousnnicky z 5 zurman1 g 4 guffman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}