{"link": "https://www.themoviedb.org/tv/9202?language=en", "title": "Hilltop Hospital", "resume": "Hilltop Hospital is a claymation children's television programme made in 1999. It consists of 52 ten-minute shorts. The series is directed by Pascal Le Nôtre and produced in English, French, German and Dutch. The series is adapted from a series of books by Nicholas Allan of the same name. ZDF started broadcasting the shorts in 2003.\nIt was released by Buena Vista Home Video in 2000 and Maverick Entertainment in 2006 in the UK.", "rate": 0, "genre": ["Drama", "Animation", "Family"], "cast": ["Michel Raimbault", "Emma Deschandol", "Evelyne Grandjean", "Bernard Bouillon"], "character": ["Docteur Matthews (voix française)", "Infirmière Cathy (voix française)", "Docteur Suzanne et Infirmière Dany (french voice)", "Docteur Atticus (voix française)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9202   Expand Hilltop Hospital   (1999) User Score Overview Hilltop Hospital is a claymation children's television programme made in 1999. It consists of 52 ten-minute shorts. The series is directed by Pascal Le Nôtre and produced in English, French, German and Dutch. The series is adapted from a series of books by Nicholas Allan of the same name. ZDF started broadcasting the shorts in 2003. It was released by Buena Vista Home Video in 2000 and Maverick Entertainment in 2006 in the UK. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michel Raimbault Docteur Matthews (voix française) Emma Deschandol Infirmière Cathy (voix française) Evelyne Grandjean Docteur Suzanne et Infirmière Dany (french voice) Bernard Bouillon Docteur Atticus (voix française) Full Cast & Crew Last Season Season 2 1999 | 26 Episodes Season 2 of Hilltop Hospital premiered on September 27, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hilltop Hospital. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.folimage.fr/fr/production/hopital-hilltop-80.htm Genres Drama Animation Family Keywords children Content Score 93 Almost there... Top Contributors F 19 FrenchyDuke 18 arlo22 D 16 Decaliax TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}