{"link": "https://www.themoviedb.org/tv/2437?language=en", "title": "Pocoyo", "resume": "Pocoyo is a Spanish pre-school animated television series created by Guillermo García Carsí, Luis Gallego and David Cantolla, and is a co-production between Spanish producer Zinkia Entertainment, Cosgrove-Hall Films and Granada International. Two series have been produced, each consisting of 52 seven-minute episodes. English actor and comedian Stephen Fry narrates the English-language version and José María del Río narrates the Castilian Spanish version.\nSet in a 3D space, with a plain white background and usually no backdrops, it is about Pocoyo, a 3-year-old boy, interacting with his friends Pato, Elly and Loula. Viewers are encouraged to recognise situations that Pocoyo is in, and things that are going on with or around him. The narrator usually speaks explicitly to the viewers and to the characters as well. Each character has its own distinctive dance and also a specific sound, and most episodes end with the characters dancing. Many episodes also involve parties.\nIn the United Kingdom, it was originally broadcast on CITV, a children's strand on the ITV network. In September 2007, Channel 5 acquired terrestrial rights in the United Kingdom to the first and second series, making it part of the Milkshake! strand. The show, however, will continue to air on the CITV Channel. Other broadcasters in the English speaking countries include RTÉ in the Republic of Ireland, Nick Jr. in the U.S. nationwide and local station KCET-TV as well as KLCS-TV channel 58-2 in Los Angeles and on Univision in LATAM Spanish, Treehouse TV in Canada, ABC in Australia and TVNZ in New Zealand.", "rate": 63, "genre": ["Animation", "Family"], "cast": ["Stephen Fry", "Alex Marty", "Montana Smedley", "Courtney Webb"], "character": ["Pocoyo", "Pocoyo", "Jim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2437   Expand Pocoyo   (2005) User Score Overview Pocoyo is a Spanish pre-school animated television series created by Guillermo García Carsí, Luis Gallego and David Cantolla, and is a co-production between Spanish producer Zinkia Entertainment, Cosgrove-Hall Films and Granada International. Two series have been produced, each consisting of 52 seven-minute episodes. English actor and comedian Stephen Fry narrates the English-language version and José María del Río narrates the Castilian Spanish version. Set in a 3D space, with a plain white background and usually no backdrops, it is about Pocoyo, a 3-year-old boy, interacting with his friends Pato, Elly and Loula. Viewers are encouraged to recognise situations that Pocoyo is in, and things that are going on with or around him. The narrator usually speaks explicitly to the viewers and to the characters as well. Each character has its own distinctive dance and also a specific sound, and most episodes end with the characters dancing. Many episodes also involve parties. In the United Kingdom, it was originally broadcast on CITV, a children's strand on the ITV network. In September 2007, Channel 5 acquired terrestrial rights in the United Kingdom to the first and second series, making it part of the Milkshake! strand. The show, however, will continue to air on the CITV Channel. Other broadcasters in the English speaking countries include RTÉ in the Republic of Ireland, Nick Jr. in the U.S. nationwide and local station KCET-TV as well as KLCS-TV channel 58-2 in Los Angeles and on Univision in LATAM Spanish, Treehouse TV in Canada, ABC in Australia and TVNZ in New Zealand. Featured Crew Guillermo García Carsí Creator David Cantolla Creator Luis Gallego Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Fry Alex Marty Pocoyo Montana Smedley Pocoyo Courtney Webb Jim Full Cast & Crew Last Season Season 1 2005 | 52 Episodes Season 1 of Pocoyo premiered on January  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations   1969-11-10 Sesame Street 7.4    1997-04-01 Pokémon 6.1    1999-05-01 SpongeBob SquarePants 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  7m Homepage   http://www.pocoyo.com/ Genres Animation Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors f 96 fjmorena z 10 zurman1 D 6 Decaliax 5 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}