{"link": "https://www.themoviedb.org/tv/416?language=en", "title": "Harvey Birdman, Attorney at Law", "resume": "Harvey Birdman, Attorney at Law features ex-superhero Harvey T. Birdman of Birdman and the Galaxy Trio as an attorney working for a law firm alongside other cartoon stars from 1960s and 1970s Hanna-Barbera cartoon series. Similarly, Harvey's clients are also primarily composed of characters taken from Hanna-Barbera cartoon series of the same era. Many of Birdman's nemeses featured in his former cartoon series also became attorneys, often representing the opposing side of a given case.", "rate": 77, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy"], "cast": ["Gary Cole", "Thomas Allen", "Stephen Colbert", "John Michael Higgins", "Chris Edgerly"], "character": ["Phil Ken Sebben"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 416   Expand Harvey Birdman, Attorney at Law   (2000) User Score Overview Harvey Birdman, Attorney at Law features ex-superhero Harvey T. Birdman of Birdman and the Galaxy Trio as an attorney working for a law firm alongside other cartoon stars from 1960s and 1970s Hanna-Barbera cartoon series. Similarly, Harvey's clients are also primarily composed of characters taken from Hanna-Barbera cartoon series of the same era. Many of Birdman's nemeses featured in his former cartoon series also became attorneys, often representing the opposing side of a given case. Featured Crew Erik Richter Creator Michael Ouweleen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Cole Thomas Allen Stephen Colbert Phil Ken Sebben John Michael Higgins Chris Edgerly Full Cast & Crew Last Season Season 4 2006 | 7 Episodes Season 4 of Harvey Birdman, Attorney at Law premiered on October  2, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   1994-04-15 Space Ghost Coast to Coast 8.3    2005-12-13 Moral Orel 7.5    2000-12-21 The Brak Show 7.0    1999-09-24 Mission Hill 7.3    2000-12-21 Sealab 2021 7.8    2000-12-30 Aqua Teen Hunger Force 7.2    1995-09-09 Earthworm Jim 6.6    1991-02-25 The Pirates of Dark Water 6.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.adultswim.com/shows/harvey-birdman-attorney-at-law/index.html Genres Sci-Fi & Fantasy Animation Comedy Keywords superhero law firm Content Score 93 Almost there... Top Contributors 14 Banana 6 TheOneManBoxOffice z 4 zurman1 3 Alexandre Oliveira  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}