{"link": "https://www.themoviedb.org/tv/32388?language=en", "title": "Ben and Holly's Little Kingdom", "resume": "Ben and Holly's Little Kingdom is a British animated pre-school children's television series set in an enchanted magical kingdom with fairies, elves and insects.\nIt is broadcast across Nickelodeon's 43 international channels throughout Africa, Asia-Pacific, Europe, the Middle East and Latin America.\nThe show is created by Neville Astley and Mark Baker, and produced by Phil Davies at Astley Baker Davies - the company responsible for Peppa Pig. Many of the actors who lend their vocal skills to characters in Peppa Pig also work on Little Kingdom. These include John Sparkes, Sarah Ann Kennedy, David Rintoul and David Graham. The music is by Julian Nott who is noted for his \"Wallace and Gromit\" scores.", "rate": 60, "genre": ["Kids", "Animation"], "cast": ["Jonny Butler", "Sara Crowe", "Judy Flynn", "David Graham", "Sarah Ann Kennedy"], "character": ["Jake Elf", "Queen Thistle", "Mrs. Elf", "Wise Old Elf", "Nanny Plum"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32388   Expand Ben and Holly's Little Kingdom   (2009) User Score Overview Ben and Holly's Little Kingdom is a British animated pre-school children's television series set in an enchanted magical kingdom with fairies, elves and insects. It is broadcast across Nickelodeon's 43 international channels throughout Africa, Asia-Pacific, Europe, the Middle East and Latin America. The show is created by Neville Astley and Mark Baker, and produced by Phil Davies at Astley Baker Davies - the company responsible for Peppa Pig. Many of the actors who lend their vocal skills to characters in Peppa Pig also work on Little Kingdom. These include John Sparkes, Sarah Ann Kennedy, David Rintoul and David Graham. The music is by Julian Nott who is noted for his \"Wallace and Gromit\" scores. Featured Crew Neville Astley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonny Butler Jake Elf Sara Crowe Queen Thistle Judy Flynn Mrs. Elf David Graham Wise Old Elf Sarah Ann Kennedy Nanny Plum Full Cast & Crew Last Season Season 2 2012 | 52 Episodes Season 2 of Ben and Holly's Little Kingdom premiered on July  2, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ben and Holly's Little Kingdom. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  - Homepage   http://www.littlekingdom.co.uk Genres Kids Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors n 8 nicbrown 6 Damien Haynes s 5 scythe198 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}