{"link": "https://www.themoviedb.org/tv/74163?language=en", "title": "Recovery of an MMO Junkie", "resume": "Moriko Morioka is a 30-year-old single NEET woman. After dropping out from reality, she has taken off in search for a fulfilling life and ended up in a net game or \"netoge.\" In the netoge world, she began her new life as a refreshing and handsome character named Hayashi. While starting out as a beginner, a pretty character named Lily reached out to help her. Meanwhile, in the real world, awaits a shocking encounter with a good-looking elite company employee, a mysterious blue-eyed blonde.", "rate": 83, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74163   Expand Recovery of an MMO Junkie   (2017) User Score Overview Moriko Morioka is a 30-year-old single NEET woman. After dropping out from reality, she has taken off in search for a fulfilling life and ended up in a net game or \"netoge.\" In the netoge world, she began her new life as a refreshing and handsome character named Hayashi. While starting out as a beginner, a pretty character named Lily reached out to help her. Meanwhile, in the real world, awaits a shocking encounter with a good-looking elite company employee, a mysterious blue-eyed blonde. Featured Crew Kazuyoshi Yaginuma Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2017 | 11 Episodes Season 1 of Recovery of an MMO Junkie premiered on October  6, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Recovery of an MMO Junkie. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2017-07-04 Tsuredure Children 8.0    2017-01-06 Fuuka 7.3    2017-01-05 Masamune-kun's Revenge 7.0  Facts Original Name  ネト充のススメ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://netoju.com/close Genres Action & Adventure Animation Comedy Keywords romance game anime mmorpg Content Score 64 We're so close, yet so far. Top Contributors 21 sp1ti 10 deanzel D 8 Destr0y p 7 penguintamer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}