{"link": "https://www.themoviedb.org/tv/32406?language=en", "title": "The Big C", "resume": "A suburban mother faces her cancer diagnosis while trying to find humor and happiness as well.", "rate": 71, "genre": ["Comedy"], "cast": ["Laura Linney", "John Benjamin Hickey", "Oliver Platt", "Gabourey Sidibe", "Gabriel Basso"], "character": ["Cathy Jamison", "Sean Tolkey", "Paul Jamison", "Andrea Jackson", "Adam Jamison"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32406   Expand The Big C   (2010) User Score  Play Trailer Overview A suburban mother faces her cancer diagnosis while trying to find humor and happiness as well. Featured Crew Darlene Hunt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Linney Cathy Jamison John Benjamin Hickey Sean Tolkey Oliver Platt Paul Jamison Gabourey Sidibe Andrea Jackson Gabriel Basso Adam Jamison Full Cast & Crew Last Season Season 4 2013 | 4 Episodes Season 4 of The Big C premiered on April 29, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  13 Posters  7 Recommendations   1992-07-08 Melrose Place 4.9    2001-04-04 That's My Bush! 6.9    Alice in Wonderland 5.5    2011-09-14 Up All Night 6.2    2009-01-18 United States of Tara 7.3    2011-09-22 Whitney 3.8    1981-09-10 The Day of the Triffids 6.7    1994-09-12 Party of Five 6.3  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  27m Homepage   http://www.sho.com/site/thebigc/home.do Genres Comedy Keywords teacher cancer Content Score 100 Yes! Looking good! Top Contributors 55 Banana b 7 bugfix 6 NEOhidra 4 anzani-hun  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}