{"link": "https://www.themoviedb.org/tv/45388?language=en", "title": "Missing", "resume": "Missing is a Canadian-American crime drama television series based on the 1-800-WHERE-R-YOU book series by Meg Cabot. The series aired on the A network and W Network in Canada, and on Lifetime in the United States from August 2003 to February 2006.", "rate": 50, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Caterina Scorsone", "Vivica A. Fox", "Dean McDermott", "Mark Consuelos", "Gloria Reuben"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45388   Expand Missing   (2003) User Score Overview Missing is a Canadian-American crime drama television series based on the 1-800-WHERE-R-YOU book series by Meg Cabot. The series aired on the A network and W Network in Canada, and on Lifetime in the United States from August 2003 to February 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Caterina Scorsone Vivica A. Fox Dean McDermott Mark Consuelos Gloria Reuben Full Cast & Crew Last Season Season 3 2005 | 19 Episodes Season 3 of Missing premiered on June 12, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Missing. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Action & Adventure Drama Mystery Keywords washington d.c. fbi psychic power vision missing person criminal consultant Content Score 86 Almost there... Top Contributors 36 Banana t 19 tmdb45070722 N 7 NoemiTalavera z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}