{"link": "https://www.themoviedb.org/tv/62883?language=en", "title": "GetBackers", "resume": "They're the Get Backers, and they live by a simple motto: If it was taken, we'll get it back. Their success rate is 100%. They may have no luck with money, but they always come through on a job, no matter how small. Ban and Ginji are no ordinary retrieval service though. With Ginji's ability to generate lightning and Ban's Jagan Eye and 200kg force grip, they'll take on any job, from retrieving stuffed toys to fine art to lost memories. If the GetBackers say they'll get it back, they will!", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Showtaro Morikubo", "Nobutoshi Canna", "Natsuko Kuwatani", "Soichiro Hoshi", "Takanori Hoshino"], "character": ["Ginji Amano (voice)", "Ban Mido (voice)", "Himiko Kudo (voice)", "Kazuki Fuchoin (voice)", "Shido Fuyuki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62883   Expand GetBackers   (2002) User Score  Play Trailer Overview They're the Get Backers, and they live by a simple motto: If it was taken, we'll get it back. Their success rate is 100%. They may have no luck with money, but they always come through on a job, no matter how small. Ban and Ginji are no ordinary retrieval service though. With Ginji's ability to generate lightning and Ban's Jagan Eye and 200kg force grip, they'll take on any job, from retrieving stuffed toys to fine art to lost memories. If the GetBackers say they'll get it back, they will! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Showtaro Morikubo Ginji Amano (voice) Nobutoshi Canna Ban Mido (voice) Natsuko Kuwatani Himiko Kudo (voice) Soichiro Hoshi Kazuki Fuchoin (voice) Takanori Hoshino Shido Fuyuki (voice) Full Cast & Crew Last Season Season 2 2003 | 24 Episodes Season 2 of GetBackers premiered on April 12, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2009-04-05 Dragon Ball Z Kai 5.3  Facts Original Name  ゲットバッカーズ -奪還屋- Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords anime Content Score 93 Almost there... Top Contributors t 40 tmdb983464 39 ibinbin CM 18 Cherche Moi 15 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}