{"link": "https://www.themoviedb.org/tv/76604?language=en", "title": "Kiss Me First", "resume": "Leila is a lonely 17 year old girl addicted to a fictional online gaming site called Agora. While playing on the platform, Leila meets Tess, a cool and confident party girl who harbors a dark secret. In the real world, the two girls become friends, but after Tess disappears Leila decides to assume her friend's identity and in doing so is quickly drawn into unraveling the mystery behind her disappearance.", "rate": 65, "genre": ["Drama", "Mystery"], "cast": ["Tallulah Rose Haddon", "Simona Brown", "Matthew Beard", "Freddie Stewart", "Matthew Aubrey"], "character": ["Leila", "Tess", "Adrian", "Force", "Jonty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76604   Expand Kiss Me First   (2018) User Score  Play Trailer Overview Leila is a lonely 17 year old girl addicted to a fictional online gaming site called Agora. While playing on the platform, Leila meets Tess, a cool and confident party girl who harbors a dark secret. In the real world, the two girls become friends, but after Tess disappears Leila decides to assume her friend's identity and in doing so is quickly drawn into unraveling the mystery behind her disappearance. Featured Crew Bryan Elsley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tallulah Rose Haddon Leila Simona Brown Tess Matthew Beard Adrian Freddie Stewart Force Matthew Aubrey Jonty Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Kiss Me First premiered on April  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Kiss Me First. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  English Runtime  47m Homepage   https://www.netflix.com/title/80097225 Genres Drama Mystery Keywords based on novel or book video game virtual reality dystopia Content Score 100 Yes! Looking good! Top Contributors m 34 misfit_noel c 11 castacasta 7 Alessandro Y 6 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}