{"link": "https://www.themoviedb.org/tv/31934?language=en", "title": "Solsidan", "resume": "Solsidan is a Swedish television comedy series that premiered on 29 January 2010 on TV4. The series is named after a small part of Saltsjöbaden called Solsidan. It revolves around Alex and Anna who are expecting their first child and have just moved to Alex's childhood home in Saltsjöbaden, Stockholm County. Alex tries to get Anna to enjoy herself, and at the same time spend time with his childhood friend Fredde. Ten episodes were scheduled to air in the first season. A second ten-episode season premiered 16 January 2011.", "rate": 63, "genre": ["Comedy", "Drama"], "cast": ["Felix Herngren", "Mia Skäringer", "Henrik Dorsin", "Johan Rheborg", "Josephine Bornebusch"], "character": ["Alex Löfström", "Anna Svensson", "Ove Sundberg", "Fredde Schiller", "Mickan Schiller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31934   Expand Solsidan   (2010) User Score Overview Solsidan is a Swedish television comedy series that premiered on 29 January 2010 on TV4. The series is named after a small part of Saltsjöbaden called Solsidan. It revolves around Alex and Anna who are expecting their first child and have just moved to Alex's childhood home in Saltsjöbaden, Stockholm County. Alex tries to get Anna to enjoy herself, and at the same time spend time with his childhood friend Fredde. Ten episodes were scheduled to air in the first season. A second ten-episode season premiered 16 January 2011. Featured Crew Felix Herngren Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felix Herngren Alex Löfström Mia Skäringer Anna Svensson Henrik Dorsin Ove Sundberg Johan Rheborg Fredde Schiller Josephine Bornebusch Mickan Schiller Full Cast & Crew Last Season Season 5 2015 | 10 Episodes Season 5 of Solsidan premiered on October 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2012-01-22 Real Humans 7.7    1990-01-01 Mr. Bean 7.8    1989-01-08 Agatha Christie's Poirot 7.9    2015-12-18 Making a Murderer 7.8    2009-09-17 Community 7.9    2005-09-19 How I Met Your Mother 7.4    2013-02-01 House of Cards 8.2    2005-08-29 Prison Break 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  23m Homepage   http://www.tv4.se/solsidan Genres Comedy Drama Keywords sitcom Content Score 93 Almost there... Top Contributors j 21 jnylen VA 12 Viktor Andersson 11 d00ziie M 6 Mr_Democracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}