{"link": "https://www.themoviedb.org/tv/54864?language=en", "title": "Love Child", "resume": "Love Child follows the lives of staff at the fictional Kings Cross Hospital and the wild streets of Darlinghurst in the 1960s.\nJoan Miller is a smart and sophisticated midwife who returns home from London to take a job at the Kings Cross Hospital. Dr Patrick McNaughton is a charismatic head of obstetrics at Kings Cross Hospital. Frances Bolton is the tough matron who also controls the running of Stanton House, a home for unwed pregnant young women.", "rate": 49, "genre": ["Drama"], "cast": ["Jessica Marais", "Jonathan LaPaglia", "Mandy McElhinney", "Ella Scott Lynch", "Sophie Hensser"], "character": ["Joan Miller", "Dr. Patrick McNaughton", "Matron Frances Bolton", "Shirley Ryan", "Vivian Maguire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54864   Expand Love Child   (2014) User Score  Play Trailer Overview Love Child follows the lives of staff at the fictional Kings Cross Hospital and the wild streets of Darlinghurst in the 1960s. Joan Miller is a smart and sophisticated midwife who returns home from London to take a job at the Kings Cross Hospital. Dr Patrick McNaughton is a charismatic head of obstetrics at Kings Cross Hospital. Frances Bolton is the tough matron who also controls the running of Stanton House, a home for unwed pregnant young women. Featured Crew Sarah Lambert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Marais Joan Miller Jonathan LaPaglia Dr. Patrick McNaughton Mandy McElhinney Matron Frances Bolton Ella Scott Lynch Shirley Ryan Sophie Hensser Vivian Maguire Full Cast & Crew Last Season Season 4 2017 | 10 Episodes Season 4 of Love Child premiered on May  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love Child. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  48m Homepage   http://www.9jumpin.com.au/show/lovechild/ Genres Drama Keywords australia hospital 1960s maternity Content Score 100 Yes! Looking good! Top Contributors e 12 erinnny 10 Banana 4 Elizabeth Jennings 3 senckyz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}