{"link": "https://www.themoviedb.org/tv/67146?language=en", "title": "You Can't Ask That", "resume": "Breaking down stereotypes and offering genuine insight into the lives of people who live with labels. The series gives an unmediated platform to some of the most misunderstood or marginalised people in our country: short statured, wheelchair users, transgender, Muslims, ex-prisoners, fat, Indigenous, sex workers, terminally ill, and people in polyamorous relationships.", "rate": 0, "genre": ["Talk"], "cast": ["Kirk Docker"], "character": ["Himself - Interviewer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67146   Expand You Can't Ask That   (2016) User Score Overview Breaking down stereotypes and offering genuine insight into the lives of people who live with labels. The series gives an unmediated platform to some of the most misunderstood or marginalised people in our country: short statured, wheelchair users, transgender, Muslims, ex-prisoners, fat, Indigenous, sex workers, terminally ill, and people in polyamorous relationships. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirk Docker Himself - Interviewer Full Cast & Crew Next Season Season 3 2018 | 8 Episodes Season 3 of You Can't Ask That is set to premiere on July 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on You Can't Ask That. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  30m, 16m Homepage   http://www.abc.net.au/tv/programs/you-cant-ask-that/ Genres Talk Keywords stereotype question answers Content Score 56 We're so close, yet so far. Top Contributors p 29 plumpro 23 United600 6 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}