{"link": "https://www.themoviedb.org/tv/54728?language=en", "title": "Beyblade", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 69, "genre": ["Action", "Adventure", "Animation"], "cast": ["Ai Orikasa", "Chiaki Morita", "Namikawa Daisuke", "Chikao Ohtsuka", "Julie Zwillich"], "character": ["Max Tate", "Yuri Ivanov", "Hiro Granger", "Ryuunosuke Kinomiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54728   Expand Beyblade   (2001) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Takao Aoki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ai Orikasa Max Tate Chiaki Morita Yuri Ivanov Namikawa Daisuke Hiro Granger Chikao Ohtsuka Ryuunosuke Kinomiya Julie Zwillich Full Cast & Crew Last Season Season 7 2012 | 38 Episodes Season 7 of Beyblade premiered on April  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   Digimon Frontier 6.3    2006-09-08 Black Blood Brothers 7.4    Digimon Adventure 02 5.6    2017-07-09 A Centaur's Life 8.7    2004-07-10 DearS 5.0    2013-07-04 Danganronpa: The Animation 7.0    2002-03-01 Digimon Tamers 5.9    2010-07-10 Cat Planet Cuties 6.0  Facts Original Name  爆転シュート　ベイブレード Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords tournament Content Score 86 Almost there... Top Contributors 18 AnimeExBurst 9 boy0815 5 Marr 🇳🇱 d 4 dragao-do-porto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}