{"link": "https://www.themoviedb.org/tv/619?language=en", "title": "Half & Half", "resume": "Half & Half is an American sitcom that aired on UPN from September 23, 2002, to May 15, 2006. The show focuses on the lives of two paternal half-sisters in their twenties who were estranged throughout their childhood, and are finally developing a close relationship. The series is set in San Francisco.\nIt was the second-most-watched show on UPN's Monday night line-up and fourth overall on the network. The show was on The CW's first draft line-up in March 2006, but due to several circumstances—including The CW's contractual obligation to pick up Reba, the uncancelling of All of Us, and the pick-up of the Girlfriends spin-off The Game—Half & Half was left off the final Fall 2006 schedule and ended production. The series has aired in reruns on Global TV in Canada, Trouble in the UK and in local syndication in the United States. It also airs in the United States on TV One.", "rate": 100, "genre": [], "cast": ["Rachel True", "Essence Atkins", "Telma Hopkins", "Valarie Pettiford", "Chico Benymon"], "character": ["Mona Rose Thorne", "Dee Dee Thorne", "Phyllis Thorne", "Big Dee Dee Thorne", "Andre Spencer Williams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 619   Expand Half & Half   (2002) User Score Overview Half & Half is an American sitcom that aired on UPN from September 23, 2002, to May 15, 2006. The show focuses on the lives of two paternal half-sisters in their twenties who were estranged throughout their childhood, and are finally developing a close relationship. The series is set in San Francisco. It was the second-most-watched show on UPN's Monday night line-up and fourth overall on the network. The show was on The CW's first draft line-up in March 2006, but due to several circumstances—including The CW's contractual obligation to pick up Reba, the uncancelling of All of Us, and the pick-up of the Girlfriends spin-off The Game—Half & Half was left off the final Fall 2006 schedule and ended production. The series has aired in reruns on Global TV in Canada, Trouble in the UK and in local syndication in the United States. It also airs in the United States on TV One. Featured Crew Jeffrey Klarik Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel True Mona Rose Thorne Essence Atkins Dee Dee Thorne Telma Hopkins Phyllis Thorne Valarie Pettiford Big Dee Dee Thorne Chico Benymon Andre Spencer Williams Full Cast & Crew Last Season Season 4 2005 | 22 Episodes Season 4 of Half & Half premiered on September 19, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Half & Half. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.halfandhalf.tv/ Genres No genres have been added. Keywords sibling relationship san francisco Content Score 71 Just a little bit more... Top Contributors t 12 tmdb98495582 8 t0by 3 Banana C 1 CherryJones  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}