{"link": "https://www.themoviedb.org/tv/41451?language=en", "title": "SOKO Kitzbühel", "resume": "SOKO Kitzbühel is an Austrian television series produced by ORF and ZDF. It is a spin-off of the German crime series SOKO 5113. It is set in the renowned Tyrolean tourist centre of Kitzbühel. The production company \"beo-Film\" has produced the show since 2001. The German abbreviation SOKO stands for Sonderkommission, \"special commission\", a task force with specific duties.", "rate": 0, "genre": [], "cast": ["Heinz Marecek", "Andrea L'Arronge", "Ferry Öllinger", "Kristina Sprenger", "Christine Klein"], "character": ["Hannes Kofler", "Gräfin Schönberg", "Kroisleitner", "Karin Kofler", "Frau Dr. Haller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41451   Expand SOKO Kitzbühel   (2001) User Score Overview SOKO Kitzbühel is an Austrian television series produced by ORF and ZDF. It is a spin-off of the German crime series SOKO 5113. It is set in the renowned Tyrolean tourist centre of Kitzbühel. The production company \"beo-Film\" has produced the show since 2001. The German abbreviation SOKO stands for Sonderkommission, \"special commission\", a task force with specific duties. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heinz Marecek Hannes Kofler Andrea L'Arronge Gräfin Schönberg Ferry Öllinger Kroisleitner Kristina Sprenger Karin Kofler Christine Klein Frau Dr. Haller Full Cast & Crew Current Season Season 17 2017 | 10 Episodes Season 17 of SOKO Kitzbühel premiered on December 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on SOKO Kitzbühel. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  German Runtime  45m Homepage   https://www.zdf.de/serien/soko-kitzbuehel Genres No genres have been added. Keywords police Content Score 79 Pump it up! We're close now. Top Contributors S 96 Samara L 3 Lehmden 3 martin150 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}