{"link": "https://www.themoviedb.org/tv/4498?language=en", "title": "Top Gear", "resume": "Top Gear is an automotive show starting in the 1970s, on BBC in the United Kingdom. It was long-lived, and followed by a revamped format starting in 2002, as well as a number of spin-offs, including an entirely US-based version.", "rate": 71, "genre": ["Documentary"], "cast": ["Jeremy Clarkson", "Perry McCarthy", "Richard Hammond", "Jason Dawe", "Ben Collins"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4498   Expand Top Gear   (1978) User Score Overview Top Gear is an automotive show starting in the 1970s, on BBC in the United Kingdom. It was long-lived, and followed by a revamped format starting in 2002, as well as a number of spin-offs, including an entirely US-based version. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Clarkson Perry McCarthy Richard Hammond Presenter Jason Dawe Ben Collins Full Cast & Crew Last Season Series 13 2009 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1998-08-19 Upright Citizens Brigade 8.0    2002-04-08 5th Gear 5.3    MegaStructures 7.4    American Gladiators 5.9    2011-01-13 Human Planet 8.2    1986-09-22 Dennis the Menace 5.6    1997-04-03 Police Academy: The Series 5.6  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  30m, 60m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors R 15 Rebecca 10 davamuga Y 2 YRV 1 willem_liu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}