{"link": "https://www.themoviedb.org/tv/553?language=en", "title": "Dungeons & Dragons", "resume": "Dungeons & Dragons is an American fantasy animated television series based on TSR's Dungeons & Dragons role-playing game. A co-production of Marvel Productions and TSR, the show originally ran from 1983 through 1985 for three seasons on CBS for a total of twenty-seven episodes. The animation for this series was done in Japan by Toei Animation.\nThe show focused on a group of six friends who are transported into the titular realm and followed their adventures as they tried to find a way home with the help of their guide 'Dungeon Master'. A final un-produced episode would have served as a conclusion as well as a re-imagining had the series been picked up for a fourth season. However, the show was cancelled before the episode was made. The script can be found from various sources online and was performed as an audio drama as a special feature for a DVD edition of the series.", "rate": 76, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy", "Action", "Adventure"], "cast": ["Adam Rich", "Bob Holt", "Don Most", "Frank Welker", "Frank Welker"], "character": ["Presto the Magician", "Shadow Demon", "Eric the Cavalier", "Uni the Unicorn", "Tiamat"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 553   Expand Dungeons & Dragons   (1983) User Score Overview Dungeons & Dragons is an American fantasy animated television series based on TSR's Dungeons & Dragons role-playing game. A co-production of Marvel Productions and TSR, the show originally ran from 1983 through 1985 for three seasons on CBS for a total of twenty-seven episodes. The animation for this series was done in Japan by Toei Animation. The show focused on a group of six friends who are transported into the titular realm and followed their adventures as they tried to find a way home with the help of their guide 'Dungeon Master'. A final un-produced episode would have served as a conclusion as well as a re-imagining had the series been picked up for a fourth season. However, the show was cancelled before the episode was made. The script can be found from various sources online and was performed as an audio drama as a special feature for a DVD edition of the series. Featured Crew Kevin Paul Coates Creator Dennis Marks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Rich Presto the Magician Bob Holt Shadow Demon Don Most Eric the Cavalier Frank Welker Uni the Unicorn Frank Welker Tiamat Full Cast & Crew Last Season Season 3 1985 | 7 Episodes Season 3 of Dungeons & Dragons premiered on September 14, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   1979-09-22 The World's Greatest Super Friends 7.5    1985-09-09 She-Ra: Princess of Power 6.2    1983-09-05 He-Man and the Masters of the Universe 7.1    1983-09-12 G.I. Joe 8.0    1980-10-04 Thundarr the Barbarian 6.3    1989-09-09 Captain N: The Game Master 5.6    1981-09-12 Spider-Man 6.8    1978-03-10 The Incredible Hulk 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 BlackDelivery 7 efeka G 5 GladioVenom z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}