{"link": "https://www.themoviedb.org/tv/60831?language=en", "title": "Knights of Sidonia", "resume": "An alien race called Gauna has destroyed Earth. leaving humanity struggling to survive aboard the spaceship Sidonia. Even though it’s been a century since the last encounter with the Gauna, military service is mandatory. For Nagate Tanikaze, whose grandfather secretly hid him in the forgotten bowels of Sidonia, it’s a strange new world as he’s forced to come to the surface. Yet his recruitment comes just in time, for the Gauna have suddenly reappeared.", "rate": 76, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Ryota Ohsaka", "Sayaka Ohara", "Takahiro Sakurai", "Aki Toyosaki", "Tomohiro Tsuboi"], "character": ["Nagate Tanikaze (voice)", "Captain Kobayashi (voice)", "Norio Kunato (voice)", "Izana Shinatose (voice)", "Ichirou Seii (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60831   Expand Knights of Sidonia   (2014) User Score Overview An alien race called Gauna has destroyed Earth. leaving humanity struggling to survive aboard the spaceship Sidonia. Even though it’s been a century since the last encounter with the Gauna, military service is mandatory. For Nagate Tanikaze, whose grandfather secretly hid him in the forgotten bowels of Sidonia, it’s a strange new world as he’s forced to come to the surface. Yet his recruitment comes just in time, for the Gauna have suddenly reappeared. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryota Ohsaka Nagate Tanikaze (voice) Sayaka Ohara Captain Kobayashi (voice) Takahiro Sakurai Norio Kunato (voice) Aki Toyosaki Izana Shinatose (voice) Tomohiro Tsuboi Ichirou Seii (voice) Full Cast & Crew Last Season Knights of Sidonia: Battle for Planet Nine 2015 | 12 Episodes Season 2 of Knights of Sidonia premiered on April 11, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply First season Open 0 by Marr 🇳🇱\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2014-05-16 Magi: Adventure of Sinbad 6.7    2014-04-05 The Irregular at Magic High School 6.8    2013-04-07 Gargantia on the Verdurous Planet 6.8    2015-07-05 Rokka: Braves of the Six Flowers 5.9    2009-04-02 Phantom: Requiem for the Phantom 6.4    2015-01-07 The Testament of Sister New Devil 6.8    2011-04-17 Blue Exorcist 7.7    2006-04-08 Black Lagoon 7.9  Facts Original Name  シドニアの騎士 Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.knightsofsidonia.com Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords post-apocalyptic space battle space travel alien space mecha cgi piloted robot based on manga military space and aliens anime monthly afternoon Content Score 93 Almost there... Top Contributors 111 Marr 🇳🇱 46 TheDerpMan 30 benf45 20 Ronnie Borgquist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}