{"link": "https://www.themoviedb.org/tv/177?language=en", "title": "I Am Weasel", "resume": "I Am Weasel is an American animated television series produced by Hanna-Barbera with Cartoon Network Studios, created by David Feiss, and broadcast on Cartoon Network.\nThe series chronicles the adventures of I.M. Weasel, an internationally famous, rather eloquent, highly intelligent and much talented weasel who is adored by everyone, and I.R. Baboon, an ugly and idiotic baboon who is envious about Weasel's success and constantly tries to be better than him. The show premise begins from a humorous take on the classic nursery rhyme \"Pop Goes the Weasel\"; in fact, the series theme song, composed by Bill Fulton, written by Richard Pursel, and sung by April March, is based on the well-known musical version of the rhyme.\nI Am Weasel was originally a part of the Cow and Chicken show, often airing as the third of three segments in an episode, after two Cow and Chicken segments. Eventually, I Am Weasel was spun off into its own series, aired in 1999 with reruns airing until April 2006, with both new episodes and the episodes that had aired on Cow and Chicken included in this series, totaling 79 episodes.\nToday, the series is labeled a classic of Cartoon Network's late 1990s collection of Cartoon Cartoons. Since April 13, 2012, it is being aired on Cartoon Network, on the block Cartoon Planet. This show also airs on Boomerang, but only airs seasons 1-4 with the Cow and Chicken segments.", "rate": 74, "genre": ["Animation", "Comedy"], "cast": ["Charlie Adler", "Michael Dorn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 177   Expand I Am Weasel   (1997) User Score Overview I Am Weasel is an American animated television series produced by Hanna-Barbera with Cartoon Network Studios, created by David Feiss, and broadcast on Cartoon Network. The series chronicles the adventures of I.M. Weasel, an internationally famous, rather eloquent, highly intelligent and much talented weasel who is adored by everyone, and I.R. Baboon, an ugly and idiotic baboon who is envious about Weasel's success and constantly tries to be better than him. The show premise begins from a humorous take on the classic nursery rhyme \"Pop Goes the Weasel\"; in fact, the series theme song, composed by Bill Fulton, written by Richard Pursel, and sung by April March, is based on the well-known musical version of the rhyme. I Am Weasel was originally a part of the Cow and Chicken show, often airing as the third of three segments in an episode, after two Cow and Chicken segments. Eventually, I Am Weasel was spun off into its own series, aired in 1999 with reruns airing until April 2006, with both new episodes and the episodes that had aired on Cow and Chicken included in this series, totaling 79 episodes. Today, the series is labeled a classic of Cartoon Network's late 1990s collection of Cartoon Cartoons. Since April 13, 2012, it is being aired on Cartoon Network, on the block Cartoon Planet. This show also airs on Boomerang, but only airs seasons 1-4 with the Cow and Chicken segments. Featured Crew David Feiss Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Adler Michael Dorn Full Cast & Crew Last Season Season 5 1999 | 27 Episodes Season 5 of I Am Weasel premiered on July 22, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2000-11-17 Sheep in the Big City 6.8    1997-09-16 Cow and Chicken 6.4    1999-11-12 Mike, Lu & Og 3.3    1997-09-01 Extreme Ghostbusters 6.0    2001-06-08 Time Squad 6.4    2005-06-19 12 oz. Mouse 6.4    2005-12-26 My Gym Partner's a Monkey 5.0    2006-10-16 Frisky Dingo 8.1  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage   http://web.archive.org/web/20010801153720/www.cartoonnetwork.com/imweasel/ Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors w 4 waterhorse 3 sortX a 3 adltata D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}