{"link": "https://www.themoviedb.org/tv/61920?language=en", "title": "Catastrophe", "resume": "Rob Delaney and Sharon Horgan write and star in a comedy that follows an American man and an Irish woman who make a bloody mess as they struggle to fall in love in London.", "rate": 75, "genre": ["Comedy"], "cast": ["Sharon Horgan", "Rob Delaney"], "character": ["Sharon Morris", "Rob Norris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61920   Expand Catastrophe   (2015) User Score  Play Trailer Overview Rob Delaney and Sharon Horgan write and star in a comedy that follows an American man and an Irish woman who make a bloody mess as they struggle to fall in love in London. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sharon Horgan Sharon Morris Rob Delaney Rob Norris Full Cast & Crew Last Season Season 3 2017 | 6 Episodes Season 3 of Catastrophe premiered on February 28, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Catastrophe. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2015-03-25 Big Time in Hollywood, Fl 5.7    2011-10-17 Threesome 6.3    2010-06-28 Huge 5.5    2013-08-05 Quick Draw 6.3    2014-09-26 Transparent 6.7    2014-12-02 Girlfriends' Guide to Divorce 5.1    2015-08-05 Difficult People 7.4    2014-07-17 You're the Worst 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.channel4.com/programmes/catastrophe Genres Comedy Keywords london england dating pregnancy sitcom Content Score 64 We're so close, yet so far. Top Contributors 30 Elizabeth Jennings 16 Banana b 6 bugfix z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}