{"link": "https://www.themoviedb.org/tv/3229?language=en", "title": "Number 96", "resume": "Number 96 was a popular Australian soap opera set in a Sydney apartment block. Don Cash and Bill Harmon of the Cash Harmon Television production company, produced the series for Network Ten, which requested a Coronation Street-type serial, and specifically one that explored adult subjects. The premise, original story outlines, and the original characters were devised by David Sale who also wrote the scripts for the first episodes and continued as script editor for much of the show's run. The series proved to be a huge success, running from 1972 until 1977. Number 96 was so popular it spawned a feature film version, filmed in December 1973. Number 96 was known for its sex scenes and nudity, somewhat risque at the time, and for its comedy characters. The series was the first Australian soap opera to feature an openly gay character.", "rate": 60, "genre": [], "cast": ["Tom Oliver", "Ray Meagher", "Anne Charleston", "Abigail", "Rowena Wallace"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3229   Expand Number 96   (1972) User Score Overview Number 96 was a popular Australian soap opera set in a Sydney apartment block. Don Cash and Bill Harmon of the Cash Harmon Television production company, produced the series for Network Ten, which requested a Coronation Street-type serial, and specifically one that explored adult subjects. The premise, original story outlines, and the original characters were devised by David Sale who also wrote the scripts for the first episodes and continued as script editor for much of the show's run. The series proved to be a huge success, running from 1972 until 1977. Number 96 was so popular it spawned a feature film version, filmed in December 1973. Number 96 was known for its sex scenes and nudity, somewhat risque at the time, and for its comedy characters. The series was the first Australian soap opera to feature an openly gay character. Featured Crew David Sale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Oliver Ray Meagher Anne Charleston Abigail Rowena Wallace Full Cast & Crew Last Season Season 6 1977 | 5 Episodes Season 6 of Number 96 premiered on January 18, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Number 96. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors a 1 acieed O 1 Oakie102  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}