{"link": "https://www.themoviedb.org/tv/111?language=en", "title": "7 vidas", "resume": "7 Vidas is a Spanish sitcom which aired on Telecinco from 1999 to 2006. Its title translates as \"7 lives\" and the symbol of the sitcom is a cat, in reference to the belief that cats have 7 lives. The series is to date 2006 the longest running show of all-time in the history of Spanish television.\nIt was originally inspired by the American blockbuster Friends.\nAt its start it wasn't a great audience success, but over time, the show continued and gained more and more popularity series after series, making it the most popular Spanish TV series of all time.\nIt was in 7 Vidas that the now internationally famous actress Paz Vega and other Spanish actors first became household names in Spain.\nThe sitcom tells the story of a group of friends in Madrid. David was in a coma for more than 18 years and suddenly awakes and starts discovering the new world in which he lives. His neighbour, Sole is an old woman with a penchant for slapping anyone who behaves in a way she dislikes round the back of the neck. Sole soon becomes one of the show's most popular characters. Other characters were Sole's sexually frustrated son, Paco, Carlota David's single sister and Laura, their cousin from Seville, initially Paco's principal love interest and then David's.", "rate": 59, "genre": ["Comedy"], "cast": ["Paz Vega", "Blanca Portillo", "Carmen Machi", "Guillermo Toledo", "Elsa Pataky"], "character": ["Laura Arteagabeitia", "Carlota", "Aída", "Ricardo \"Ríchard\" Sáez", "Cristina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 111   Expand 7 vidas   (1999) User Score Overview 7 Vidas is a Spanish sitcom which aired on Telecinco from 1999 to 2006. Its title translates as \"7 lives\" and the symbol of the sitcom is a cat, in reference to the belief that cats have 7 lives. The series is to date 2006 the longest running show of all-time in the history of Spanish television. It was originally inspired by the American blockbuster Friends. At its start it wasn't a great audience success, but over time, the show continued and gained more and more popularity series after series, making it the most popular Spanish TV series of all time. It was in 7 Vidas that the now internationally famous actress Paz Vega and other Spanish actors first became household names in Spain. The sitcom tells the story of a group of friends in Madrid. David was in a coma for more than 18 years and suddenly awakes and starts discovering the new world in which he lives. His neighbour, Sole is an old woman with a penchant for slapping anyone who behaves in a way she dislikes round the back of the neck. Sole soon becomes one of the show's most popular characters. Other characters were Sole's sexually frustrated son, Paco, Carlota David's single sister and Laura, their cousin from Seville, initially Paco's principal love interest and then David's. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paz Vega Laura Arteagabeitia Blanca Portillo Carlota Carmen Machi Aída Guillermo Toledo Ricardo \"Ríchard\" Sáez Elsa Pataky Cristina Full Cast & Crew Last Season Season 7 2001 | 9 Episodes Season 7 of 7 vidas premiered on January 17, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2005-01-16 Aída 4.0    2001-09-13 Cuéntame cómo pasó 6.6    1985-10-26 David the Gnome 7.3    2008-02-04 Física o Química 3.0    2003-04-22 Los Serrano 5.1    2003-09-07 Aquí no hay quien viva 7.1    1992-04-13 Crayon Shin-chan 7.4    2011-01-17 The Boat 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 27 teddymeksavanh 23 DaRKeN58 J 7 Javier z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}