{"link": "https://www.themoviedb.org/tv/15826?language=en", "title": "1000 Ways to Die", "resume": "1000 Ways to Die is an anthology television series that premiered on Spike on May 14, 2008, and ended on July 15, 2012. The program recreates unusual supposed deaths and debunked urban legends and includes interviews with experts who describe the science behind each death. Up until the end of season one, the final story of each episode showed actual footage of dangerous situations that almost ended in death, along with interviews with people involved in the situations. A portion of these deaths have been nominated for or have received a Darwin Award. Ron Perlman served as the narrator on every episode since the third episode; beginning with the episode 'Tweets from the Dead' Joe Irwin was featured as the replacement narrator.\nThe show was cancelled after the airing of \"Death, The Final Frontier\". This was done after the producers and stars of the show ran a strike against Spike.", "rate": 69, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15826   Expand 1000 Ways to Die   (2009) User Score  Play Trailer Overview 1000 Ways to Die is an anthology television series that premiered on Spike on May 14, 2008, and ended on July 15, 2012. The program recreates unusual supposed deaths and debunked urban legends and includes interviews with experts who describe the science behind each death. Up until the end of season one, the final story of each episode showed actual footage of dangerous situations that almost ended in death, along with interviews with people involved in the situations. A portion of these deaths have been nominated for or have received a Darwin Award. Ron Perlman served as the narrator on every episode since the third episode; beginning with the episode 'Tweets from the Dead' Joe Irwin was featured as the replacement narrator. The show was cancelled after the airing of \"Death, The Final Frontier\". This was done after the producers and stars of the show ran a strike against Spike. Featured Crew Thom Beers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2012 | 16 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on 1000 Ways to Die. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.spike.com/show/27237 Genres Documentary Keywords anthology urban legend death Content Score 71 Just a little bit more... Top Contributors 45 Goffred0 10 Banana 6 Elizabeth Jennings Y 4 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}