{"link": "https://www.themoviedb.org/tv/74104?language=en", "title": "Superstition", "resume": "The Mosley family keeps the secrets and dark history of a town located on the outskirts of New Orleans that is also a landing patch for the world's darkest manifestations of fear, guided into the world by a mysterious malefactor named The Dredge.", "rate": 61, "genre": ["Sci-Fi", "Fantasy", "Drama", "Mystery"], "cast": ["Robinne Lee", "Brad James", "W. Earl Brown", "Demetria McKinney", "Dallas Page"], "character": ["Bea Hastings", "Calvin Hastings", "The Dredge", "May Westbrook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74104   Expand Superstition   (2017) User Score  Play Trailer Overview The Mosley family keeps the secrets and dark history of a town located on the outskirts of New Orleans that is also a landing patch for the world's darkest manifestations of fear, guided into the world by a mysterious malefactor named The Dredge. Featured Crew Mario Van Peebles Creator Joel Anderson Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robinne Lee Bea Hastings Brad James Calvin Hastings W. Earl Brown The Dredge Demetria McKinney May Westbrook Dallas Page Full Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of Superstition premiered on October 20, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Sam and Dean Open 4 by  violet75 Okay show. Only one  thing Open 1 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2017-01-01 Beyond 5.6    2016-10-16 Berlin Station 7.4    2014-04-20 Salem 7.3    2017-09-29 Marvel's Inhumans 5.6    2012-10-10 Nashville 6.1    2016-10-03 Timeless 7.0    2017-10-02 The Gifted 7.0    2015-11-15 Into the Badlands 7.4  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.syfy.com/superstition Genres Sci-Fi & Fantasy Drama Mystery Keywords supernatural Content Score 100 Yes! Looking good! Top Contributors 40 Elizabeth Jennings Y 16 YJ m 8 misfit_noel 4 bstarko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}