{"link": "https://www.themoviedb.org/tv/61324?language=en", "title": "Su Baek-hyang, The King's Daughter", "resume": "This is the story of Su Baek-hyang, born as the elder daughter of King Mu-ryeong but unable to retain her title of princess due to her ambitious younger sister, Sol-hui. Humble and hard-working, she was taught never to want or to desire beyond what she has, but the fate given to her is one that will affect not only her life and her family's lives, but the entire nation as she struggles to find her place in life and fight for love.", "rate": 0, "genre": ["Drama"], "cast": ["Seo Hyun-Jin", "Seo Woo", "Lee Jae-ryong", "Jo Hyun-jae", "Jun Tae-Soo"], "character": ["Soo Baek Hyang / Seol Nan", "Seol Hee", "King Moo Ryung", "Myung Nong", "Jin Moo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61324   Expand Su Baek-hyang, The King's Daughter   (2013) User Score Overview This is the story of Su Baek-hyang, born as the elder daughter of King Mu-ryeong but unable to retain her title of princess due to her ambitious younger sister, Sol-hui. Humble and hard-working, she was taught never to want or to desire beyond what she has, but the fate given to her is one that will affect not only her life and her family's lives, but the entire nation as she struggles to find her place in life and fight for love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Hyun-Jin Soo Baek Hyang / Seol Nan Seo Woo Seol Hee Lee Jae-ryong King Moo Ryung Jo Hyun-jae Myung Nong Jun Tae-Soo Jin Moo Full Cast & Crew Last Season Season 1 2013 | 108 Episodes Season 1 of Su Baek-hyang, The King's Daughter premiered on September 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Su Baek-hyang, The King's Daughter. You can help by rating TV shows you've seen. Facts Original Name  제왕의 딸, 수백향 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Korean Runtime  30m Homepage   http://www.imbc.com/broad/tv/drama/perfume/ Genres Drama Keywords korea historical fiction Content Score 86 Almost there... Top Contributors M 45 Maria180493 CM 9 Cherche Moi 6 Elizabeth Jennings t 2 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}