{"link": "https://www.themoviedb.org/tv/4302?language=en", "title": "Between the Lions", "resume": "Between the Lions is a PBS Kids puppet television series designed to promote reading. The show is a co-production between WGBH in Boston and Sirius Thinking, Ltd., in New York City, in association with Mississippi Public Broadcasting, in Mississippi. The show has won seven Daytime Emmy awards between 2001 and 2007. The target audience is children 4 to 7 years old. It has the same puppet style as Sesame Street and several season 2 episodes, notably in Dance in Smarty Pants, had a few characters from Sesame Street guest appearing. Between The Lions started its 10th and final season on September 20, 2010. The Show Ended in November, 22 2010 Along with Reading Rainbow", "rate": 60, "genre": ["Kids", "Comedy"], "cast": ["Fred Newman", "Jennifer Barnhart", "Kathryn Mullen", "Pam Arciero", "Tyler Bunch"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4302   Expand Between the Lions   (2000) User Score Overview Between the Lions is a PBS Kids puppet television series designed to promote reading. The show is a co-production between WGBH in Boston and Sirius Thinking, Ltd., in New York City, in association with Mississippi Public Broadcasting, in Mississippi. The show has won seven Daytime Emmy awards between 2001 and 2007. The target audience is children 4 to 7 years old. It has the same puppet style as Sesame Street and several season 2 episodes, notably in Dance in Smarty Pants, had a few characters from Sesame Street guest appearing. Between The Lions started its 10th and final season on September 20, 2010. The Show Ended in November, 22 2010 Along with Reading Rainbow Featured Crew Christopher Cerf Creator Kathryn Mullen Creator Michael K. Frith Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Newman Jennifer Barnhart Kathryn Mullen Pam Arciero Tyler Bunch Full Cast & Crew Last Season Season 10 2010 | 10 Episodes Season 10 of Between the Lions premiered on September 20, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Between the Lions. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.pbskids.org/lions/ Genres Kids Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors n 3 nicbrown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}