{"link": "https://www.themoviedb.org/tv/61119?language=en", "title": "The 7D", "resume": "The 7D is an American animated television series produced by Disney Television Animation loosely based on the 1937 film Snow White and the Seven Dwarfs by Walt Disney Productions where The 7D must defend the land of Jollywood from the magical villains Grim and Hildy Gloom who attempt to dethrone Queen Delightful and rule Jollywood.", "rate": 5, "genre": ["Animation"], "cast": ["Bill Farmer", "Dee Bradley Baker", "Billy West", "Maurice LaMarche", "Kevin Michael Richardson"], "character": ["Doc (voice)", "Dopey (voice)", "Bashful (voice)", "Grumpy (voice)", "Happy (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61119   Expand The 7D   (2014) User Score Overview The 7D is an American animated television series produced by Disney Television Animation loosely based on the 1937 film Snow White and the Seven Dwarfs by Walt Disney Productions where The 7D must defend the land of Jollywood from the magical villains Grim and Hildy Gloom who attempt to dethrone Queen Delightful and rule Jollywood. Featured Crew Noah Z. Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Bill Farmer Doc (voice) Dee Bradley Baker Dopey (voice) Billy West Bashful (voice) Maurice LaMarche Grumpy (voice) Kevin Michael Richardson Happy (voice) Full Cast & Crew Last Season Season 2 2016 | 22 Episodes Season 2 of The 7D premiered on January 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The 7D. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 28 Travis Bell 24 Elizabeth Jennings TB 11 TMDb Bot 6 Alexandre Oliveira  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}