{"link": "https://www.themoviedb.org/tv/43899?language=en", "title": "The Bible", "resume": "The story of God's creation of the Earth and the landmark events leading up to the Crucifixion of Jesus Christ.", "rate": 63, "genre": ["Drama", "Action"], "cast": ["Keith David", "Diogo Morgado", "Roma Downey", "Sebastian Knapp", "Adrian Schiller"], "character": ["Narrator", "Jesus Christ", "Mother Mary", "John", "Caiaphas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43899   Expand The Bible   (2013) User Score Overview The story of God's creation of the Earth and the landmark events leading up to the Crucifixion of Jesus Christ. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  8 Images Backdrops  18 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith David Narrator Diogo Morgado Jesus Christ Roma Downey Mother Mary Sebastian Knapp John Adrian Schiller Caiaphas Full Cast & Crew Last Season Season 1 2013 | 5 Episodes Season 1 of The Bible premiered on March  2, 2013. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply SH Not very good... Open 0 by Sharron Hayward\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  18 Posters  13 Recommendations   2013-11-07 Folkets främsta företrädare 5.0    2002-10-31 Värsta språket 6.0    1999-01-18 Parlamentet 3.0    2016-04-25 After the Thrones 4.6    1987-09-05 På spåret 5.0    2004-08-30 John Safran vs God 7.3    2011-01-06 The Reckoning 3.7    2015-04-05 A.D. The Bible Continues 5.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.history.com/shows/the-bible Genres Drama Action Keywords bible christian religion miniseries Content Score 93 Almost there... Top Contributors 71 Elizabeth Jennings TB 25 TMDb Bot 21 REDHARD CH 15 Carlos Henrique Guidorizzi Passarelli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}