{"link": "https://www.themoviedb.org/tv/68837?language=en", "title": "Justice League Action", "resume": "Batman, Superman and Wonder Woman will lead the DC Super Heroes against their most infamous foes.", "rate": 70, "genre": ["Action", "Adventure", "Animation", "Family", "Sci-Fi", "Fantasy"], "cast": ["Kevin Conroy", "Rachel Kimsey", "Jason Lewis", "Mark Hamill", "Joanne Spracklen"], "character": ["Batman (voice)", "Diana Prince (voice)", "Clark Kent (voice)", "Alec Holland (voice)", "Supergirl (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68837   Expand Justice League Action   (2016) User Score  Play Trailer Overview Batman, Superman and Wonder Woman will lead the DC Super Heroes against their most infamous foes. Featured Crew Gardner Fox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Conroy Batman (voice) Rachel Kimsey Diana Prince (voice) Jason Lewis Clark Kent (voice) Mark Hamill Alec Holland (voice) Joanne Spracklen Supergirl (voice) Full Cast & Crew Last Season Season 1 2016 | 52 Episodes Season 1 of Justice League Action premiered on December 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2008-11-14 Batman: The Brave and the Bold 7.1    2013-01-17 King of the Nerds 2.9    2012-07-15 Black Dynamite 7.2    2012-04-01 Marvel's Ultimate Spider-Man 6.6    2011-07-29 ThunderCats 6.4    2013-09-02 Uncle Grandpa 4.3    2013-04-23 Teen Titans Go! 4.4    2014-08-18 Clarence 7.4  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.cartoonnetwork.com/video/justice-league-action/index.html Genres Action & Adventure Animation Family Sci-Fi & Fantasy Keywords dc comics superhero cartoon based on comic Content Score 100 Yes! Looking good! Top Contributors n 43 nicb19 35 Banana c 14 captaincrankton R 13 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}