{"link": "https://www.themoviedb.org/tv/56998?language=en", "title": "Highschool of the Dead", "resume": "When the world is struck by a deadly pandemic that turns humans into zombies, Takashi Komuro and several of his classmates at Fujimi High School try to survive the apocalypse.", "rate": 70, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Junko Takeuchi", "Nobuyuki Hiyama", "Marina Inoue", "Jouji Nakata", "Yoshiko Sakakibara"], "character": ["Rika Minami", "Kohta Hirano", "Rei Miyamoto", "Sōichirō Takagi", "Yuriko Takagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56998   Expand Highschool of the Dead   (2010) User Score Overview When the world is struck by a deadly pandemic that turns humans into zombies, Takashi Komuro and several of his classmates at Fujimi High School try to survive the apocalypse. Featured Crew Tetsuro Araki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  26 Posters  15 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Takeuchi Rika Minami Nobuyuki Hiyama Kohta Hirano Marina Inoue Rei Miyamoto Jouji Nakata Sōichirō Takagi Yoshiko Sakakibara Yuriko Takagi Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Highschool of the Dead premiered on July  5, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Highschool of the Dead. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  26 Posters  15 Recommendations   2012-01-10 Another 7.2    2011-04-16 Deadman Wonderland 7.1    2012-01-06 High School DxD 6.3    2011-01-11 Is This a Zombie? 7.7    2010-04-03 Angel Beats! 7.4    2006-01-07 Fate/stay night 7.2    2008-04-07 Soul Eater 7.0    2011-07-01 Blood-C 7.9  Facts Original Name  学園黙示録 Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.nbcuni.co.jp/rondorobe/anime/hotd/ Genres Action & Adventure Animation Drama Keywords high school nudity supernatural gore survival thriller zombie survival horror psychological zombie apocalypse virus ecchi anime fan service Content Score 100 Yes! Looking good! Top Contributors 30 WillofOwn p 11 psy4trik 10 Nuno Filipe de Vilhena Santos 9 Razze  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}