{"link": "https://www.themoviedb.org/tv/67709?language=en", "title": "One Mississippi", "resume": "This semi-autobiographical dark comedy starring Tig Notaro follows her as she returns to her hometown after the sudden death of her mother. Still reeling from her own declining health problems, Tig struggles to find her footing with the loss of the one person in her life who understood her. All while dealing with her clingy girlfriend and her dysfunctional family.", "rate": 81, "genre": ["Drama", "Comedy"], "cast": ["Tig Notaro", "Rya Kihlstedt", "John Rothman", "Casey Wilson"], "character": ["Tig", "Caroline", "Bill", "Brooke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67709   Expand One Mississippi   (2016) User Score  Play Trailer Overview This semi-autobiographical dark comedy starring Tig Notaro follows her as she returns to her hometown after the sudden death of her mother. Still reeling from her own declining health problems, Tig struggles to find her footing with the loss of the one person in her life who understood her. All while dealing with her clingy girlfriend and her dysfunctional family. Featured Crew Tig Notaro Creator Diablo Cody Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tig Notaro Tig Rya Kihlstedt Caroline John Rothman Bill Casey Wilson Brooke Full Cast & Crew Last Season Season 2 2017 | 6 Episodes Season 2 of One Mississippi premiered on September  7, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply So that’s it? Open 0 by dawna3\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2016-06-17 The Last Tycoon 7.6    2017-02-20 Bellevue 6.0    2015-07-26 I Am Cait 5.5    2016-10-09 Divorce 6.1    2017-01-25 Mary Kills People 7.5    2016-08-19 Jean-Claude Van Johnson 7.0    2015-09-30 Code Black 7.0    2016-07-21 Fleabag 7.2  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   https://www.amazon.com/One-Mississippi/dp/B017APUQCO Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors ☂ 26 ☂ D 4 David1886 e 3 error666 S 3 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}