{"link": "https://www.themoviedb.org/tv/62814?language=en", "title": "The Family", "resume": "This thriller follows the return of a politician’s young son who was presumed dead after disappearing over a decade earlier. As the mysterious young man is welcomed back into his family, suspicions emerge — is he really who he says he is?", "rate": 63, "genre": ["Drama", "Mystery"], "cast": ["Joan Allen", "Alison Pill", "Rupert Graves", "Margot Bingham", "Liam James"], "character": ["Claire Warren", "Willa Warren", "John Warren", "Nina Meyer", "Adam Warren"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62814   Expand The Family   (2016) User Score  Play Trailer Overview This thriller follows the return of a politician’s young son who was presumed dead after disappearing over a decade earlier. As the mysterious young man is welcomed back into his family, suspicions emerge — is he really who he says he is? Featured Crew Jenna Bans Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joan Allen Claire Warren Alison Pill Willa Warren Rupert Graves John Warren Margot Bingham Nina Meyer Liam James Adam Warren Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of The Family premiered on March  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2016-03-15 Crowded 6.4    2016-04-12 Game of Silence 4.3    2016-09-22 Notorious 5.8    2015-10-27 Wicked City 5.4    2015-09-29 The Grinder 6.6    2016-04-11 Hunters 4.9    2015-09-29 Grandfathered 7.1    2016-06-28 Dead of Summer 5.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/the-family Genres Drama Mystery Keywords secret politics missing child Content Score 100 Yes! Looking good! Top Contributors 37 Elizabeth Jennings 22 Banana 7 scorpio686 n 4 neyav  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}