{"link": "https://www.themoviedb.org/tv/511?language=en", "title": "Beat-Club", "resume": "Beat-Club was a German music program that ran from September 1965 to December 1972. It was broadcast from Bremen, Germany on Erstes Deutsches Fernsehen, the national public TV channel of the ARD, and produced by one of its members, Radio Bremen, later co-produced by WDR following the 38th episode. It is notable for being the first German show to be based around popular music, and featured artists such as The Equals, Grateful Dead, Zager and Evans, Cream, Frank Zappa, The Rolling Stones, Gene Pitney, Ten Years After, Rory Gallagher, Led Zeppelin, Jimi Hendrix, Ike & Tina Turner, The Who, Black Sabbath, Harry Nilsson, David Bowie, The Bee Gees, The Beach Boys, Chicago, The Doors, Kraftwerk and Robin Gibb in its seven-year run. In 1972, it was replaced by Musikladen.\nPerformances from the show can now be seen on VH1 Classic, and reruns air in several European countries. Several DVD collections have also been released.\nIn early 2008, the first free Video on demand web portal for Beat-Club and Musikladen was launched at Mybeatclub.com, featuring the most popular songs and artists of both shows. In 2010, mybeatclub.com was replaced by www.youtube.de/beatclub.", "rate": 85, "genre": [], "cast": ["Dave Lee Travis", "Dave Dee"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 511   Expand Beat-Club   (1965) User Score Overview Beat-Club was a German music program that ran from September 1965 to December 1972. It was broadcast from Bremen, Germany on Erstes Deutsches Fernsehen, the national public TV channel of the ARD, and produced by one of its members, Radio Bremen, later co-produced by WDR following the 38th episode. It is notable for being the first German show to be based around popular music, and featured artists such as The Equals, Grateful Dead, Zager and Evans, Cream, Frank Zappa, The Rolling Stones, Gene Pitney, Ten Years After, Rory Gallagher, Led Zeppelin, Jimi Hendrix, Ike & Tina Turner, The Who, Black Sabbath, Harry Nilsson, David Bowie, The Bee Gees, The Beach Boys, Chicago, The Doors, Kraftwerk and Robin Gibb in its seven-year run. In 1972, it was replaced by Musikladen. Performances from the show can now be seen on VH1 Classic, and reruns air in several European countries. Several DVD collections have also been released. In early 2008, the first free Video on demand web portal for Beat-Club and Musikladen was launched at Mybeatclub.com, featuring the most popular songs and artists of both shows. In 2010, mybeatclub.com was replaced by www.youtube.de/beatclub. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Lee Travis Dave Dee Full Cast & Crew Last Season Season 8 1972 | 4 Episodes Season 8 of Beat-Club premiered on September 30, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beat-Club. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.radiobremen.de/tv/beatclub/ Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors TB 2 TMDb Bot 1 OzDrDj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}