{"link": "https://www.themoviedb.org/tv/36249?language=en", "title": "Shin Mazinger Shougeki! Z Hen", "resume": "Shin Mazinger Shogeki! Z Hen, alternatively romanized Shin Mazinger Shougeki! Z Hen and romanized/translated in the Soul of Chogokin toys line as Shin Mazinger Impact Z!, is a new Mazinger anime series, directed by Yasuhiro Imagawa which premiered in Japan on April 4, 2009. According to the production staff, it has no relation to the 1970s show and should not be described as a Mazinger Z remake. The series is a \"retelling\" of the basic story of Mazinger Z, featuring most of the same characters, mechanical beasts, and some general plots of the original series, plus some additional material. It keeps the original plot line of Mazinger Z, but makes references to other Go Nagai works, such as Z Mazinger, Violence Jack, Mao Dante and others. Elements from other related Mazinger works appear in the series, such as the story of Kedora and the appearance of Energer Z, the original concept before Mazinger Z.\nAlong with the TV series, a new manga, Shin Mazinger Zero started on April 18, 2009 in the magazine Champion Red. The pair responsible for the shōnen manga Akumetsu, Yoshiaki Tabata and Yuki Yogo, write and illustrate the Shin Mazinger Zero manga. In 2010 a game based on the series was released for the PC.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36249   Expand Shin Mazinger Shougeki! Z Hen   (2015) User Score Overview Shin Mazinger Shogeki! Z Hen, alternatively romanized Shin Mazinger Shougeki! Z Hen and romanized/translated in the Soul of Chogokin toys line as Shin Mazinger Impact Z!, is a new Mazinger anime series, directed by Yasuhiro Imagawa which premiered in Japan on April 4, 2009. According to the production staff, it has no relation to the 1970s show and should not be described as a Mazinger Z remake. The series is a \"retelling\" of the basic story of Mazinger Z, featuring most of the same characters, mechanical beasts, and some general plots of the original series, plus some additional material. It keeps the original plot line of Mazinger Z, but makes references to other Go Nagai works, such as Z Mazinger, Violence Jack, Mao Dante and others. Elements from other related Mazinger works appear in the series, such as the story of Kedora and the appearance of Energer Z, the original concept before Mazinger Z. Along with the TV series, a new manga, Shin Mazinger Zero started on April 18, 2009 in the magazine Champion Red. The pair responsible for the shōnen manga Akumetsu, Yoshiaki Tabata and Yuki Yogo, write and illustrate the Shin Mazinger Zero manga. In 2010 a game based on the series was released for the PC. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2015 | 4 Episodes Season 6 of Shin Mazinger Shougeki! Z Hen premiered on August  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Shin Mazinger Shougeki! Z Hen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors p 11 pacopepe19 6 HDZeroCool 4 theramyz z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}