{"link": "https://www.themoviedb.org/tv/43068?language=en", "title": "Kendra on Top", "resume": "Kendra on Top is an American reality television series on WE tv that debuted June 5, 2012. The series follows the day-to-day life of former Playboy model and The Girls Next Door reality television personality Kendra Wilkinson as she balances being a mother and her business ventures. Season 2 chronicles Kendra as she prepares and participates as a celebrity contestant on Splash and stars on Celebrity Wife Swap. Hank is working on his transition from working in the NFL into the business world. Kendra's car accident that occurred in April 2013 is also included.", "rate": 26, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43068   Expand Kendra on Top   (2012) User Score Overview Kendra on Top is an American reality television series on WE tv that debuted June 5, 2012. The series follows the day-to-day life of former Playboy model and The Girls Next Door reality television personality Kendra Wilkinson as she balances being a mother and her business ventures. Season 2 chronicles Kendra as she prepares and participates as a celebrity contestant on Splash and stars on Celebrity Wife Swap. Hank is working on his transition from working in the NFL into the business world. Kendra's car accident that occurred in April 2013 is also included. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2017 | 16 Episodes Season 6 of Kendra on Top premiered on June 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kendra on Top. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  22m Homepage   http://www.wetv.com/shows/kendra-on-top Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 11 Elizabeth Jennings b 7 basher TB 5 TMDb Bot s 3 stevenjhon847  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}