{"link": "https://www.themoviedb.org/tv/43188?language=en", "title": "666 Park Avenue", "resume": "What would you do to have everything you desire? Step inside 666 Park Avenue,  New York's most seductive address. We all have some burning needs,  desires and ambitions. For the residents of The Drake, the premier  apartment building on Manhattan's Upper East Side, these will all be met  – for a price – courtesy of the building's mysterious owner, Gavin  Doran. But be careful what you wish for, because the  price you have to pay is your soul.", "rate": 63, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Rachael Taylor", "Dave Annable", "Terry O'Quinn", "Vanessa Williams", "Robert Buckley"], "character": ["Jane Van Veen", "Henry Martin", "Gavin Doran", "Olivia Doran", "Brian Leonard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43188   Expand 666 Park Avenue   (2012) User Score Overview What would you do to have everything you desire? Step inside 666 Park Avenue,  New York's most seductive address. We all have some burning needs,  desires and ambitions. For the residents of The Drake, the premier  apartment building on Manhattan's Upper East Side, these will all be met  – for a price – courtesy of the building's mysterious owner, Gavin  Doran. But be careful what you wish for, because the  price you have to pay is your soul. Featured Crew David Wilcox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachael Taylor Jane Van Veen Dave Annable Henry Martin Terry O'Quinn Gavin Doran Vanessa Williams Olivia Doran Robert Buckley Brian Leonard Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of 666 Park Avenue premiered on September 30, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2012-10-11 Copper 6.0    2013-10-09 The Tomorrow People 6.6    2012-08-12 Animal Practice 4.7    2014-08-23 Intruders 6.5    2013-10-25 Dracula 5.9    2015-06-01 The Whispers 5.7    2014-05-30 Crossbones 6.0    2010-06-07 Persons Unknown 6.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Mystery Sci-Fi & Fantasy Keywords supernatural neighbor apartment building Content Score 100 Yes! Looking good! Top Contributors 10 lol32lol n 9 niaco 6 Elizabeth Jennings 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}