{"link": "https://www.themoviedb.org/tv/4562?language=en", "title": "Seven Days", "resume": "\"Ever wish you could live your last week all over again? Well, my name's Frank B. Parker, and I do it all the time. I work for a secret government project experimenting in time travel. When things really get screwed up, I'm the guinea pig they send back to take care of it. The catch is, I can only go back 7 days.\"", "rate": 75, "genre": ["Drama", "Science", "Fiction"], "cast": ["Jonathan LaPaglia", "Justina Vail Evans", "Don Franklin", "Alan Scarfe", "Nick Searcy"], "character": ["Frank Parker", "Dr Olga Vukavitch", "Craig Donovan", "Dr Bradley Talmadge", "Nathan Ramsey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4562   Expand Seven Days   (1998) User Score Overview \"Ever wish you could live your last week all over again? Well, my name's Frank B. Parker, and I do it all the time. I work for a secret government project experimenting in time travel. When things really get screwed up, I'm the guinea pig they send back to take care of it. The catch is, I can only go back 7 days.\" Featured Crew Christopher Crowe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan LaPaglia Frank Parker Justina Vail Evans Dr Olga Vukavitch Don Franklin Craig Donovan Alan Scarfe Dr Bradley Talmadge Nick Searcy Nathan Ramsey Full Cast & Crew Last Season Season 3 2000 | 22 Episodes Season 3 of Seven Days premiered on October 11, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply h Seven Days Open 4 by  holdme Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   1998-09-09 First Wave 6.6    1994-01-19 seaQuest DSV 6.7    2004-10-17 Hex 6.2    1999-10-01 BeastMaster 5.9    2002-03-05 The Osbournes 6.4    2000-06-09 The Invisible Man 7.2    1994-09-22 Due South 7.5    1997-10-06 Earth: Final Conflict 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Drama Science Fiction Keywords time travel secret government organization Content Score 93 Almost there... Top Contributors 14 Banana 8 Elizabeth Jennings B 6 Bytedragon i 3 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}