{"link": "https://www.themoviedb.org/tv/610?language=en", "title": "Mr. Show with Bob and David", "resume": "Mr. Show with Bob and David is an American sketch comedy series starring and hosted by Saturday Night Live writer/actor Bob Odenkirk and stand up comedian/actor David Cross. It aired on HBO from November 3, 1995 to December 28, 1998.\nCross and Odenkirk introduced most episodes as heightened versions of themselves, before transitioning to a mixture of live sketches and pre-taped segments. The show featured a number of alternative comedians as both cast members and writers, including Sarah Silverman, Paul F. Tompkins, Jack Black, Tom Kenny, Mary Lynn Rajskub, Brian Posehn, Jerry Minor, Scott Aukerman, and Dino Stamatopoulos.\nIt was nominated for four Primetime Emmy Awards, as well as a Golden Satellite Award.", "rate": 81, "genre": ["Comedy"], "cast": ["Jill Talley", "Brian Posehn", "Tom Kenny", "Mary Lynn Rajskub", "Jay Johnston"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 610   Expand Mr. Show with Bob and David   (1995) User Score Overview Mr. Show with Bob and David is an American sketch comedy series starring and hosted by Saturday Night Live writer/actor Bob Odenkirk and stand up comedian/actor David Cross. It aired on HBO from November 3, 1995 to December 28, 1998. Cross and Odenkirk introduced most episodes as heightened versions of themselves, before transitioning to a mixture of live sketches and pre-taped segments. The show featured a number of alternative comedians as both cast members and writers, including Sarah Silverman, Paul F. Tompkins, Jack Black, Tom Kenny, Mary Lynn Rajskub, Brian Posehn, Jerry Minor, Scott Aukerman, and Dino Stamatopoulos. It was nominated for four Primetime Emmy Awards, as well as a Golden Satellite Award. Featured Crew Bob Odenkirk Creator David Cross Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jill Talley Brian Posehn Tom Kenny Mary Lynn Rajskub Jay Johnston Full Cast & Crew Last Season Mr. show season 4 1998 | 10 Episodes Season 4 of Mr. Show with Bob and David premiered on October 26, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   1998-08-19 Upright Citizens Brigade 8.0    2013-01-16 Kroll Show 7.1    2005-06-29 Stella 7.0    1992-09-27 The Ben Stiller Show 6.0    2007-02-11 Tim and Eric Awesome Show, Great Job! 7.4    2004-11-14 Tom Goes to the Mayor 7.2    2005-03-11 Wonder Showzen 7.4    1986-09-13 Pee-wee's Playhouse 7.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mrshow.com/ Genres Comedy Keywords paris drugs sketch comedy weird dorky Content Score 93 Almost there... Top Contributors QC 12 Qua Couron 7 Bryan Bortz 6 Elizabeth Jennings D 3 David1886  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}