{"link": "https://www.themoviedb.org/tv/63764?language=en", "title": "Señora Acero", "resume": "Señora Acero 3: La Coyote- Bastard daughter of Vicente Acero, Vicenta Rigores Acero (La Coyote) must come face to face with her destiny to become the New Señora Acero, as she is the inheritor of the Acero family dynasty.", "rate": 71, "genre": [], "cast": ["Oscar Priego", "Michel Duval", "Blanca Soto", "Diego Soldano", "Valentina Acosta"], "character": ["Erick \"El Gallo\" Quintanilla", "Salvador Acero", "Sara Aguilar", "Pedro Juárez", "Miriam Godoy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63764   Expand Señora Acero   (2014) User Score Overview Señora Acero 3: La Coyote- Bastard daughter of Vicente Acero, Vicenta Rigores Acero (La Coyote) must come face to face with her destiny to become the New Señora Acero, as she is the inheritor of the Acero family dynasty. Featured Crew Walter Doehner, Jaime Segura, Miguel Varoni Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oscar Priego Erick \"El Gallo\" Quintanilla Michel Duval Salvador Acero Blanca Soto Sara Aguilar Diego Soldano Pedro Juárez Valentina Acosta Miriam Godoy Full Cast & Crew Current Season Season 4 2018 | 77 Episodes Season 4 of Señora Acero premiered on February  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Señora Acero. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  41m, 43m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 60 Haosek R 12 Rebafan23 b 11 blackscorpion t 6 tomyly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}