{"link": "https://www.themoviedb.org/tv/12577?language=en", "title": "Devil May Cry", "resume": "Devil May Cry is an anime series based on the video game series by Capcom. It debuted on the WOWOW TV network in Japan on June 14, 2007 and ran 12 episodes.\nThe show was produced by the anime studio Madhouse and was directed by Shin Itagaki. Bingo Morihashi, one of the writers for the second, third and fourth games, was also on the writing staff.\nA teaser-trailer, released on the show's official site, featured pre-production artwork of Dante, the primary protagonist and playable character of the video games, and confirmed him as the show's protagonist.\nA second trailer released at the 2007 Tokyo International Anime Fair showed actual animation from the show and included a character and cast list, featuring both new characters and other characters from the games.\nThe first episode aired in Japan on June 14, 2007.\nOn June 30, 2007, at Anime Expo 07, it was announced that ADV Films had licensed the show. However, in 2008, it became one of more than 30 titles that were transferred to Funimation Entertainment.\nThe series made its North American television debut when it started airing on the FUNimation Channel September 6th, 2010.", "rate": 66, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Toshiyuki Morikawa", "Misato Fukuen", "Akio Otsuka", "Fumiko Orikasa", "Atsuko Tanaka"], "character": ["Dante", "Patty Lowell", "Morisson", "Lady", "Trish"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12577   Expand Devil May Cry   (2007) User Score Overview Devil May Cry is an anime series based on the video game series by Capcom. It debuted on the WOWOW TV network in Japan on June 14, 2007 and ran 12 episodes. The show was produced by the anime studio Madhouse and was directed by Shin Itagaki. Bingo Morihashi, one of the writers for the second, third and fourth games, was also on the writing staff. A teaser-trailer, released on the show's official site, featured pre-production artwork of Dante, the primary protagonist and playable character of the video games, and confirmed him as the show's protagonist. A second trailer released at the 2007 Tokyo International Anime Fair showed actual animation from the show and included a character and cast list, featuring both new characters and other characters from the games. The first episode aired in Japan on June 14, 2007. On June 30, 2007, at Anime Expo 07, it was announced that ADV Films had licensed the show. However, in 2008, it became one of more than 30 titles that were transferred to Funimation Entertainment. The series made its North American television debut when it started airing on the FUNimation Channel September 6th, 2010. Featured Crew 春名庆 Creator 丸山正雄 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiyuki Morikawa Dante Misato Fukuen Patty Lowell Akio Otsuka Morisson Fumiko Orikasa Lady Atsuko Tanaka Trish Full Cast & Crew Last Season Devil may cry season 1 2007 | 12 Episodes Season 1 of Devil May Cry premiered on June 14, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2011-04-14 Aria the Scarlet Ammo 6.4    2012-04-05 Sankarea: Undying Love 7.0    2014-01-11 No-Rin 6.0    2010-01-05 Ladies versus Butlers! 10.0    2013-03-31 Date a Live 7.9    2012-04-10 Jormungand 7.4    2015-10-04 Attack on Titan: Junior High 7.0    2008-10-04 A Certain Magical Index 7.4  Facts Original Name  デビル メイ クライ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords sword hell demon Content Score 93 Almost there... Top Contributors r 23 rocman i 10 idlikewlm 7 Renato 6 kazuza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}