{"link": "https://www.themoviedb.org/tv/3295?language=en", "title": "Soap", "resume": "Soap is an American sitcom that originally ran on ABC from 1977 into 1981. The show was created as a night-time parody of daytime soap operas, presented as a weekly half-hour prime time comedy. Similar to a soap opera, the show's story was presented in a serial format and included melodramatic plot elements such as alien abduction, demonic possession, murder, and kidnapping.\nIn 2007 it was listed as one of Time magazine's \"100 Best TV Shows of All-TIME,\" and in 2010, the Tates and the Campbells ranked at number 17 in TV Guide's list of \"TV's Top Families\".\nThe show was created, written, and executive produced by Susan Harris, and also executive produced by Paul Junger Witt and Tony Thomas. Each returning season was preceded by a 90-minute retrospective of the previous season. Two of these retrospectives were made available on VHS in 1994.\nThe show aired 85 episodes over the course of four seasons. The final four episodes of the series aired as one-hour episodes during the original run on ABC. These hour-long episodes were later split in two, yielding 93 half-hour episodes for syndication.\nAll episodes are currently available on region 1 DVD in four separate box sets. In the past, the series has rerun on local syndicated channels as well as on cable on Comedy Central and TV Land. It ran on over-the-air television on Antenna TV, until December 30th, 2012.", "rate": 76, "genre": ["Comedy"], "cast": ["Katherine Helmond", "Richard Mulligan", "Cathryn Damon", "Rod Roddy", "Ted Wass"], "character": ["Jessica Tate", "Burt Campbell", "Mary Campbell", "Danny Dallas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3295   Expand Soap   (1977) User Score Overview Soap is an American sitcom that originally ran on ABC from 1977 into 1981. The show was created as a night-time parody of daytime soap operas, presented as a weekly half-hour prime time comedy. Similar to a soap opera, the show's story was presented in a serial format and included melodramatic plot elements such as alien abduction, demonic possession, murder, and kidnapping. In 2007 it was listed as one of Time magazine's \"100 Best TV Shows of All-TIME,\" and in 2010, the Tates and the Campbells ranked at number 17 in TV Guide's list of \"TV's Top Families\". The show was created, written, and executive produced by Susan Harris, and also executive produced by Paul Junger Witt and Tony Thomas. Each returning season was preceded by a 90-minute retrospective of the previous season. Two of these retrospectives were made available on VHS in 1994. The show aired 85 episodes over the course of four seasons. The final four episodes of the series aired as one-hour episodes during the original run on ABC. These hour-long episodes were later split in two, yielding 93 half-hour episodes for syndication. All episodes are currently available on region 1 DVD in four separate box sets. In the past, the series has rerun on local syndicated channels as well as on cable on Comedy Central and TV Land. It ran on over-the-air television on Antenna TV, until December 30th, 2012. Featured Crew Susan Harris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine Helmond Jessica Tate Richard Mulligan Burt Campbell Cathryn Damon Mary Campbell Rod Roddy Ted Wass Danny Dallas Full Cast & Crew Last Season Season 4 1980 | 24 Episodes Season 4 of Soap premiered on November 12, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Jessica Tate: Happy Birthday Katherine Helmond! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1978-09-18 WKRP in Cincinnati 8.1    1979-09-30 To the Manor Born 7.1    1982-03-23 Joanie Loves Chachi 2.4    1978-09-12 Taxi 7.2    1986-09-15 L.A. Law 7.2    1977-09-04 Operation Petticoat 7.1    1994-03-29 Ellen 6.2    1994-09-18 Chicago Hope 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords ventriloquist love affair Content Score 93 Almost there... Top Contributors M 19 Magicus m 4 movienator 4 kamwatka i 3 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}