{"link": "https://www.themoviedb.org/tv/70590?language=en", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon? On the Side: Sword Oratoria", "resume": "This is an adaptation of Sword Oratory, light novel side story of Dungeon neither Deai the Motomeru no wa Machigatte Iru Daru Ka. It covers the story of one of the strongest first-class adventurers, \"Princess Swordsman\" Ais Wallenstein, and his desire to reach the top along with his friends of the Loki Family.", "rate": 85, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Ayako Kawasumi", "Mutsumi Tamura", "Saori Oonishi", "Nobuhiko Okamoto"], "character": ["Riveria Ljos Alf", "Finn Deimne", "Aiz Wallenstein", "Bete Loga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70590   Expand Is It Wrong to Try to Pick Up Girls in a Dungeon? On the Side: Sword Oratoria   (2017) User Score Overview This is an adaptation of Sword Oratory, light novel side story of Dungeon neither Deai the Motomeru no wa Machigatte Iru Daru Ka. It covers the story of one of the strongest first-class adventurers, \"Princess Swordsman\" Ais Wallenstein, and his desire to reach the top along with his friends of the Loki Family. Featured Crew Youhei Suzuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayako Kawasumi Riveria Ljos Alf Mutsumi Tamura Finn Deimne Saori Oonishi Aiz Wallenstein Nobuhiko Okamoto Bete Loga Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Is It Wrong to Try to Pick Up Girls in a Dungeon? On the Side: Sword Oratoria premiered on April 21, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Is It Wrong to Try to Pick Up Girls in a Dungeon? On the Side: Sword Oratoria. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Is It Wrong to Try to Pick Up Girls in a Dungeon? On the Side: Sword Oratoria. You can help by rating TV shows you've seen. Facts Original Name  ダンジョンに出会いを求めるのは間違っているだろうか外伝 ソード・オラトリア Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://danmachi.com/sword_oratoria/ Genres Animation Action & Adventure Comedy Keywords based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 28 TenmaWorks 20 sp1ti 10 TripleZGamer 6 dragon24  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}