{"link": "https://www.themoviedb.org/tv/67468?language=en", "title": "People Just Do Nothing", "resume": "This mockumentary goes behind the microphone of Kurupt FM - the second most popular pirate radio station in West London, receiving up to eight texts per show and playing the finest in UK garage and drum 'n' bass. Co-founded by the MC Sniper and DJ Beats in 2002, the station has now built up a following of over a hundred people and has attracted the attention of the BBC who are making a documentary about the lives of those behind Kurupt FM", "rate": 78, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67468   Expand People Just Do Nothing   (2014) User Score  Play Trailer Overview This mockumentary goes behind the microphone of Kurupt FM - the second most popular pirate radio station in West London, receiving up to eight texts per show and playing the finest in UK garage and drum 'n' bass. Co-founded by the MC Sniper and DJ Beats in 2002, the station has now built up a following of over a hundred people and has attracted the attention of the BBC who are making a documentary about the lives of those behind Kurupt FM Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2017 | 2 Episodes Season 4 of People Just Do Nothing premiered on August 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2002-10-14 Escape to the Country 6.3    2014-10-16 Homes By the Sea 7.0    2015-05-29 Paranormal Survivor 4.8    2012-09-17 Unsealed: Alien Files 5.4    1994-07-04 Room 101 5.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b062r9t5 Genres Comedy Keywords pirate radio mockumentary radio dj british humour Content Score 64 We're so close, yet so far. Top Contributors 20 Elizabeth Jennings A 10 Albert_fc p 2 pilipcornor09 O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}