{"link": "https://www.themoviedb.org/tv/51402?language=en", "title": "Mixology", "resume": "One bar. One night. Ten single people. Welcome to Mix, a high-end bar in Manhattan's trendy meatpacking district.  These are the exploits of singles, five guys and five girls, in search of love - all over the course of one night.", "rate": 70, "genre": ["Comedy"], "cast": ["Blake Lee", "Craig Frank", "Andrew Santino", "Ginger Gonzaga", "Kate Simses"], "character": ["Tom", "Cal", "Bruce", "Maya", "Liv"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51402   Expand Mixology   (2014) User Score Overview One bar. One night. Ten single people. Welcome to Mix, a high-end bar in Manhattan's trendy meatpacking district.  These are the exploits of singles, five guys and five girls, in search of love - all over the course of one night. Featured Crew Jon Lucas Creator Scott Moore Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Blake Lee Tom Craig Frank Cal Andrew Santino Bruce Ginger Gonzaga Maya Kate Simses Liv Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Mixology premiered on February 26, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2015-09-22 Scream Queens 6.3    2017-02-03 Santa Clarita Diet 7.3    2002-09-26 Without a Trace 6.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords bar dating sitcom Content Score 93 Almost there... Top Contributors 29 Banana 9 Elizabeth Jennings 5 NEOhidra z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}