{"link": "https://www.themoviedb.org/tv/77184?language=en", "title": "Halo: The Fall of Reach", "resume": "Kidnapped as children and conscripted into a brutal military training and augmentation program, the Spartans were designed to be the ultimate weapon against chaos and insurgency—but when a dangerous alien alliance known as the Covenant declares war on humanity, the Spartans might be our only hope.", "rate": 59, "genre": [], "cast": ["Steve Downes", "Jen Taylor", "Michelle Lukes", "Travis Willingham", "Brittany Uomoleale"], "character": ["Master Chief (voice)", "Cortana / Catherine Elizabeth Halsey (voice)", "Kelly (voice)", "Fred (adult)(voice)", "Linda (adult)(voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77184   Expand Halo: The Fall of Reach   (2015) User Score  Play Trailer Overview Kidnapped as children and conscripted into a brutal military training and augmentation program, the Spartans were designed to be the ultimate weapon against chaos and insurgency—but when a dangerous alien alliance known as the Covenant declares war on humanity, the Spartans might be our only hope. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Downes Master Chief (voice) Jen Taylor Cortana / Catherine Elizabeth Halsey (voice) Michelle Lukes Kelly (voice) Travis Willingham Fred (adult)(voice) Brittany Uomoleale Linda (adult)(voice) Full Cast & Crew Last Season Miniseries 2015 | 3 Episodes Season 1 of Halo: The Fall of Reach premiered on October 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2010-02-16 Halo Legends 8.2    2012-10-05 Halo 4 Forward Unto Dawn 6.3  Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  23m Homepage  - Genres No genres have been added. Keywords based on novel or book video game space war animation halo xbox fighting force Content Score 86 Almost there... Top Contributors TB 78 TMDb Bot 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}