{"link": "https://www.themoviedb.org/tv/2199?language=en", "title": "Tales of the Unexpected", "resume": "Tales of the Unexpected is a British television series which aired between 1979 and 1988. Each episode told a story, often with sinister and wryly comedic undertones, with an unexpected twist ending. Early episodes were based on short stories by Roald Dahl collected in the books Tales of the Unexpected, Kiss Kiss and Someone Like You.\nThe series was made by Anglia Television for ITV with interior scenes recorded at their Norwich studios whilst location filming mainly occurred across East Anglia. The theme music for the series was written by composer Ron Grainer.\nAlthough similar in theme and title, the show is not related to the American anthology television series, Quinn Martin's Tales of the Unexpected, which ran for one season in 1977.", "rate": 72, "genre": ["Drama"], "cast": ["John Houseman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2199   Expand Tales of the Unexpected   (1979) User Score Overview Tales of the Unexpected is a British television series which aired between 1979 and 1988. Each episode told a story, often with sinister and wryly comedic undertones, with an unexpected twist ending. Early episodes were based on short stories by Roald Dahl collected in the books Tales of the Unexpected, Kiss Kiss and Someone Like You. The series was made by Anglia Television for ITV with interior scenes recorded at their Norwich studios whilst location filming mainly occurred across East Anglia. The theme music for the series was written by composer Ron Grainer. Although similar in theme and title, the show is not related to the American anthology television series, Quinn Martin's Tales of the Unexpected, which ran for one season in 1977. Featured Crew Roald Dahl Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast John Houseman Full Cast & Crew Last Season Season 9 1987 | 10 Episodes Season 9 of Tales of the Unexpected premiered on December 18, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2011-07-04 Pointless Celebrities 7.5    1979-09-30 To the Manor Born 7.1    1973-09-25 Police Story 6.4    1963-09-29 The Judy Garland Show 5.0    Match of the Day 2 5.3    1952-12-05 The Abbott and Costello Show 5.6    1981-02-26 Hi-de-Hi! 7.3    1987-09-26 ChuckleVision 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Drama Keywords anthology Content Score 71 Just a little bit more... Top Contributors 3 Banana TB 3 TMDb Bot t 3 tmdb15589237 3 capkronos00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}