{"link": "https://www.themoviedb.org/tv/64673?language=en", "title": "Recovery Road", "resume": "Maddie is a teenage girl dealing with addiction who has a reputation as a party girl who doesn’t think she has a problem, until she’s confronted one day by her school guidance counselor and is forced to choose between expulsion and rehab. Maddie makes the difficult decision to live with other recovering addicts at a sober living facility while facing the daily pressures of her teenage life. Based on the popular young adult novel by Blake Nelson.", "rate": 54, "genre": ["Drama"], "cast": ["Jessica Sula", "Sebastian de Souza", "Sharon Leal", "Alexis Carra", "Kyla Pratt"], "character": ["Maddie Graham", "Wes Stewart", "Charlotte Graham", "Cynthia McDermott", "Trish Collins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64673   Expand Recovery Road   (2016) User Score  Play Trailer Overview Maddie is a teenage girl dealing with addiction who has a reputation as a party girl who doesn’t think she has a problem, until she’s confronted one day by her school guidance counselor and is forced to choose between expulsion and rehab. Maddie makes the difficult decision to live with other recovering addicts at a sober living facility while facing the daily pressures of her teenage life. Based on the popular young adult novel by Blake Nelson. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Sula Maddie Graham Sebastian de Souza Wes Stewart Sharon Leal Charlotte Graham Alexis Carra Cynthia McDermott Kyla Pratt Trish Collins Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Recovery Road premiered on January 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  1 Recommendations   2005-01-09 Zoey 101 5.3    2014-06-27 Girl Meets World 5.7    2011-06-06 Switched at Birth 6.1    2016-09-22 Notorious 5.8    2016-10-27 Pure Genius 6.7    2012-06-20 Baby Daddy 5.9    2013-06-03 The Fosters 6.2    1996-09-27 Sabrina, the Teenage Witch 6.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://abcfamily.go.com/shows/recovery-road Genres Drama Keywords alcohol addiction drugs teen drama recovery based on young adult novel Content Score 93 Almost there... Top Contributors 41 Elizabeth Jennings 30 Banana z 3 zurman1 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}