{"link": "https://www.themoviedb.org/tv/70595?language=en", "title": "Man to Man", "resume": "From Kim Won Seok, the writer of Descendants of the Sun, a drama about a special bodyguard with a background in special investigations and the Hallyu star he is supposed to protect.", "rate": 72, "genre": ["Action", "Adventure"], "cast": ["Park Hae-jin", "Park Sung-woong", "Kim Min-jung", "Chae Jung-an", "Yeon Jung-hoon"], "character": ["Kim Seol-Woo", "Yeo Woon-Gwang", "Cha Do-Ha", "Song Mi-Eun", "Mo Seung-Jae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70595   Expand Man to Man   (2017) User Score Overview From Kim Won Seok, the writer of Descendants of the Sun, a drama about a special bodyguard with a background in special investigations and the Hallyu star he is supposed to protect. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Hae-jin Kim Seol-Woo Park Sung-woong Yeo Woon-Gwang Kim Min-jung Cha Do-Ha Chae Jung-an Song Mi-Eun Yeon Jung-hoon Mo Seung-Jae Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Man to Man premiered on April 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2016-11-21 White Nights 8.0    2017-09-04 Argon 6.8    2017-10-14 Black 6.8    2011-08-08 Birdie Buddy 7.7    2008-03-16 Fated to Love You 7.3    2015-07-22 Diamond Lover 6.9    2016-03-23 Click your Heart 7.0    2016-03-06 Refresh Man 7.0  Facts Original Name  맨투맨 Status  Ended Networks Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.jtbc.joins.com/manxman Genres Action & Adventure Keywords romance thriller korea Content Score 86 Almost there... Top Contributors M 58 Maria180493 14 날두형땡구 5 lelouchvib 4 galactica_j  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}