{"link": "https://www.themoviedb.org/tv/7525?language=en", "title": "Eleventh Hour", "resume": "Dr. Jacob Hood is a brilliant biophysicist and special science advisor to the government who investigates scientific crises and oddities. His crusade is to protect the substance of science against those who would abuse and misuse scientific discoveries for their own gain.", "rate": 65, "genre": ["Drama", "Mystery"], "cast": ["Rufus Sewell", "Marley Shelton"], "character": ["Dr. Jacob Hood", "Rachel Young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7525   Expand Eleventh Hour   (2008) User Score Overview Dr. Jacob Hood is a brilliant biophysicist and special science advisor to the government who investigates scientific crises and oddities. His crusade is to protect the substance of science against those who would abuse and misuse scientific discoveries for their own gain. Featured Crew Stephen Gallagher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rufus Sewell Dr. Jacob Hood Marley Shelton Rachel Young Full Cast & Crew Last Season Season 1 2008 | 18 Episodes Season 1 of Eleventh Hour premiered on October  9, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  1 Recommendations   2008-10-13 My Own Worst Enemy 7.0    2009-09-22 The Forgotten 6.2    1996-09-21 Profiler 6.5    2002-09-20 What I Like About You 5.3    2013-02-14 Zero Hour 4.9    2002-11-14 Wire in the Blood 7.5    2007-09-26 Bionic Woman 5.5    1998-09-09 First Wave 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m Homepage   http://www.cbs.com/primetime/eleventh_hour/ Genres Drama Mystery Keywords fbi remake scientist criminal consultant Content Score 64 We're so close, yet so far. Top Contributors 32 Banana S 6 Shady12 z 5 zurman1 5 Joealtair  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}