{"link": "https://www.themoviedb.org/tv/67012?language=en", "title": "NEW GAME!", "resume": "After graduating high school, Suzukaze Aoba joins Eagle Jump, the game company that developed Fairies Story, the game she obsessed over as a kid. On her first day as a working member of society, Aoba heads to work swaying in a packed, morning rush hour train. She manages to get to the office building all right but hesitates, wondering if it was really okay for her to take that last step and go inside. That's when a senior member of staff, Toyama Rin, shows up at work and safely leads Aoba inside the offices of Eagle Jump.", "rate": 76, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67012   Expand NEW GAME!   (2016) User Score Overview After graduating high school, Suzukaze Aoba joins Eagle Jump, the game company that developed Fairies Story, the game she obsessed over as a kid. On her first day as a working member of society, Aoba heads to work swaying in a packed, morning rush hour train. She manages to get to the office building all right but hesitates, wondering if it was really okay for her to take that last step and go inside. That's when a senior member of staff, Toyama Rin, shows up at work and safely leads Aoba inside the offices of Eagle Jump. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season NEW GAME!! 2017 | 12 Episodes Season 2 of NEW GAME! premiered on July  4, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Can't wait for the second season Open 0 by Marr 🇳🇱\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2011-01-11 Is This a Zombie? 7.7    2015-07-09 SCHOOL-LIVE! 8.1    2016-01-08 Dagashi Kashi 6.3    2016-01-14 KonoSuba – God’s blessing on this wonderful world!! 8.4    2013-03-31 Date a Live 7.9    2015-04-04 Is It Wrong to Try to Pick Up Girls in a Dungeon? 6.9    2008-10-02 Toradora! 7.5    2006-04-03 The Melancholy of Haruhi Suzumiya 7.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://newgame-anime.com Genres Animation Comedy Keywords workplace slice of life computer game childhood friends aftercreditsstinger game design anime based on 4-koma working life Content Score 56 We're so close, yet so far. Top Contributors 95 Marr 🇳🇱 16 thefinaldegree 10 karaa 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}