{"link": "https://www.themoviedb.org/tv/67371?language=en", "title": "Graves", "resume": "Former two-term President Richard Graves embarks on a Don Quixote-like quest to right the wrongs of his administration and reclaim his legacy 25 years after leaving the White House. His enlightenment takes place just as his wife Margaret Graves decides it’s finally time for her to pursue her own political ambitions.", "rate": 55, "genre": ["Drama", "Comedy"], "cast": ["Nick Nolte", "Sela Ward", "Skylar Astin", "Heléne Yorke", "Chris Lowell"], "character": ["President Richard Graves", "Margaret Graves", "Isaiah Miller", "Olivia Rockefeller", "Jeremy Graves"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67371   Expand Graves   (2016) User Score  Play Trailer Overview Former two-term President Richard Graves embarks on a Don Quixote-like quest to right the wrongs of his administration and reclaim his legacy 25 years after leaving the White House. His enlightenment takes place just as his wife Margaret Graves decides it’s finally time for her to pursue her own political ambitions. Featured Crew Joshua Michael Stern Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Nolte President Richard Graves Sela Ward Margaret Graves Skylar Astin Isaiah Miller Heléne Yorke Olivia Rockefeller Chris Lowell Jeremy Graves Full Cast & Crew Current Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  3 Recommendations   2016-03-30 Lopez 4.3    2015-12-08 Tripped 7.3    2015-03-25 Big Time in Hollywood, Fl 5.7    2012-09-25 Vegas 7.4    2010-09-22 The Defenders 7.0    2015-09-29 The Grinder 6.6    2008-06-16 The Middleman 7.5    2017-05-17 Downward Dog 6.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.presidentgraves.com/ Genres Drama Comedy Keywords usa president politics dramedy Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings 16 United600 4 Utgrade s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}