{"link": "https://www.themoviedb.org/tv/2041?language=en", "title": "McLeod's Daughters", "resume": "McLeod's Daughters is an Australian television series that began airing on the Nine Network on 8 August 2001. This Logie award winning drama series follows the lives of half sisters Claire and Tess McLeod as they embark on a mission: to run Drovers Run, a farm that has been in the McLeod family for generations. After being passed down from father to son, Drover's has now reunited Claire and Tess after 20 years. They now have to run a farm while balancing their lives, loves and losses.", "rate": 74, "genre": ["Drama"], "cast": ["Aaron Jeffery", "Rachael Carpani", "Simmone Jade Mackinnon", "Bridie Carter", "Myles Pollard"], "character": ["Alex Ryan", "Jodi Fountain McLeod", "Stevie Hall", "Tess Silverman McLeod Ryan", "Nick Ryan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2041   Expand McLeod's Daughters   (2001) User Score Overview McLeod's Daughters is an Australian television series that began airing on the Nine Network on 8 August 2001. This Logie award winning drama series follows the lives of half sisters Claire and Tess McLeod as they embark on a mission: to run Drovers Run, a farm that has been in the McLeod family for generations. After being passed down from father to son, Drover's has now reunited Claire and Tess after 20 years. They now have to run a farm while balancing their lives, loves and losses. Featured Crew Posie Graeme-Evans Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aaron Jeffery Alex Ryan Rachael Carpani Jodi Fountain McLeod Simmone Jade Mackinnon Stevie Hall Bridie Carter Tess Silverman McLeod Ryan Myles Pollard Nick Ryan Full Cast & Crew Last Season Season 8 2008 | 22 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on McLeod's Daughters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.mcleodsdaughters.ninemsn.com.au Genres Drama Keywords farm australia sibling relationship ranch Content Score 93 Almost there... Top Contributors md 10 movie dino C 10 CaptainBarnius 8 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}