{"link": "https://www.themoviedb.org/tv/16321?language=en", "title": "Casi Ángeles", "resume": "'Casi Ángeles' is an Argentinian series targeted at teenagers. The show had four seasons and leaded its time-slot for three of those seasons, spawning over 100 licensed products, an official magazines, a tour and four seasons of a musical at Teatro Gran Rex. It started airing on 21 March 2007 and ended its run on 29 November 2010 on Telefe.\nCasi Ángeles was created by Cris Morena, and produced by Cris Morena Group and RGB Entertainment. It had four seasons and was aired initially at 6 P.M. and, from the end of its second season on, at 7 P.M.\nThe show mixed science fiction and themes related to teen issues.\nCasi Ángeles starred Emilia Attias, Nicolás Vázquez, Mariano Torre, Lali Espósito, Peter Lanzani, Eugenia Suárez, Nicolas Riera y Gastón Dalmau. In 2008 Vázquez left the series due to personal reasons, and the third season included a new character, portrayed by Mariano Torre.\nThe show also spawned a popular musical group Teen Angels, consisting of Espósito, Suárez, Lanzani, Riera and Dalmau. In 2011 Suárez left the band and was replaced by Rocío Igarzábal. The band continued touring until 2012, two years after the end of the show. Cris Morena wrote all their lyrics but wasn't involved in their management as a band, which was under Gustavo Yankelevich's RGB Entertainment. In this fiction surguieron actors like Lali Espósito, Eugenia Suárez, Peter Lanzani, Nicolas Riera, Candela Vetrano, Rocio Igarzabal, Maria Del Cerro, Pablo Martinez, Victorio D´alessandro, Gastón Dalmau, Belen Chavanne, Paula Reca, Agustín Sierra, Stefano De Gregorio, Daniela Aita, inter alia", "rate": 70, "genre": [], "cast": ["Gimena Accardi", "Juan Pedro Lanzani", "Gastón Dalmau", "Emilia Attías", "María Eugenia Suárez"], "character": ["Malvina Bernadeth Bedoya Agüero", "Santiago Bedoya Agüero Blaquier", "Ramiro Ordóñez", "Cielo Mágico", "Jazmín Romero"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16321   Expand Casi Ángeles   (2007) User Score Overview 'Casi Ángeles' is an Argentinian series targeted at teenagers. The show had four seasons and leaded its time-slot for three of those seasons, spawning over 100 licensed products, an official magazines, a tour and four seasons of a musical at Teatro Gran Rex. It started airing on 21 March 2007 and ended its run on 29 November 2010 on Telefe. Casi Ángeles was created by Cris Morena, and produced by Cris Morena Group and RGB Entertainment. It had four seasons and was aired initially at 6 P.M. and, from the end of its second season on, at 7 P.M. The show mixed science fiction and themes related to teen issues. Casi Ángeles starred Emilia Attias, Nicolás Vázquez, Mariano Torre, Lali Espósito, Peter Lanzani, Eugenia Suárez, Nicolas Riera y Gastón Dalmau. In 2008 Vázquez left the series due to personal reasons, and the third season included a new character, portrayed by Mariano Torre. The show also spawned a popular musical group Teen Angels, consisting of Espósito, Suárez, Lanzani, Riera and Dalmau. In 2011 Suárez left the band and was replaced by Rocío Igarzábal. The band continued touring until 2012, two years after the end of the show. Cris Morena wrote all their lyrics but wasn't involved in their management as a band, which was under Gustavo Yankelevich's RGB Entertainment. In this fiction surguieron actors like Lali Espósito, Eugenia Suárez, Peter Lanzani, Nicolas Riera, Candela Vetrano, Rocio Igarzabal, Maria Del Cerro, Pablo Martinez, Victorio D´alessandro, Gastón Dalmau, Belen Chavanne, Paula Reca, Agustín Sierra, Stefano De Gregorio, Daniela Aita, inter alia Featured Crew Cris Morena Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gimena Accardi Malvina Bernadeth Bedoya Agüero Juan Pedro Lanzani Santiago Bedoya Agüero Blaquier Gastón Dalmau Ramiro Ordóñez Emilia Attías Cielo Mágico María Eugenia Suárez Jazmín Romero Full Cast & Crew Last Season Season 2 2008 | 159 Episodes Season 2 of Casi Ángeles premiered on April  3, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Casi Ángeles. You can help by rating TV shows you've seen. Facts Status  Ended Network Telefe Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.casiangeles.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors z 5 zurman1 a 1 antoniofranks N 1 NoemiTalavera  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}