{"link": "https://www.themoviedb.org/tv/63017?language=en", "title": "Cold Justice: Sex Crimes", "resume": "To combat the number of sex crimes and bring justice to the survivors of sexual assault, former Harris County, Texas, prosecutors Casey Garrett and Alicia O'Neill are travelling to small towns around the country to help local law enforcement close cases that have sat dormant for years.", "rate": 55, "genre": ["Reality", "Crime"], "cast": ["Alicia O'Neill", "Casey Garrett"], "character": ["Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63017   Expand Cold Justice: Sex Crimes   (2015) User Score Overview To combat the number of sex crimes and bring justice to the survivors of sexual assault, former Harris County, Texas, prosecutors Casey Garrett and Alicia O'Neill are travelling to small towns around the country to help local law enforcement close cases that have sat dormant for years. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alicia O'Neill Herself Casey Garrett Herself Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Cold Justice: Sex Crimes premiered on July 31, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2016-10-12 Nurses Who Kill 7.3    2009-10-14 Alaska State Troopers 7.7    2016-05-11 Killer Women with Piers Morgan 7.5    2012-09-17 Unsealed: Alien Files 5.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  42m Homepage  - Genres Reality Crime Keywords sex crime sexual assault Content Score 56 We're so close, yet so far. Top Contributors 30 Marr 🇳🇱 14 Elizabeth Jennings 13 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}