{"link": "https://www.themoviedb.org/tv/4251?language=en", "title": "Life with Louie", "resume": "Life with Louie is an American animated series. The show is based on the childhood of stand-up comedian Louie Anderson, growing up with his family in Wisconsin.\nThe first two episodes aired in primetime on Fox.\nThe series has since aired on the European version of Jetix and was popular enough to merit a few DVD releases in the region.", "rate": 59, "genre": ["Animation", "Comedy"], "cast": ["Mary Wickes", "Debi Derryberry", "Miko Hughes", "Justin Shenkarow", "Edie McClurg"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4251   Expand Life with Louie   (1995) User Score Overview Life with Louie is an American animated series. The show is based on the childhood of stand-up comedian Louie Anderson, growing up with his family in Wisconsin. The first two episodes aired in primetime on Fox. The series has since aired on the European version of Jetix and was popular enough to merit a few DVD releases in the region.  Featured Crew Louie Anderson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Wickes Debi Derryberry Miko Hughes Justin Shenkarow Edie McClurg Full Cast & Crew Last Season Season 3 1997 | 13 Episodes Season 3 of Life with Louie premiered on September  6, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   The Kids from Room 402 8.4    2001-09-26 What's with Andy? 7.3    2009-11-16 Воронины 5.3    1968-09-14 The Adventures of Batman 7.4    1994-09-24 Iron Man 6.8    1975-10-05 UFO Robo Grendizer 6.5    1994-11-19 Spider-Man 7.8    1994-09-05 Aladdin 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors W 12 Winxpfreedom D 12 Daniel z 5 zurman1 3 mercuriy_v  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}