{"link": "https://www.themoviedb.org/tv/70344?language=en", "title": "Bellevue", "resume": "When a transgender teen goes missing, Annie Ryder—a cop at odds with her hometown—dives in to unravel the disappearance that suggests foul play, despite finding herself in a difficult position as she must cast suspicion on people she has known all her life.", "rate": 58, "genre": ["Drama", "Mystery"], "cast": ["Anna Paquin", "Shawn Doyle", "Allen Leech", "Billy MacLellan", "Sharon Taylor"], "character": ["Annie Ryder", "Peter Welland", "Eddie Roe", "Brady Holt", "Virginia Panamick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70344   Expand Bellevue   (2017) User Score  Play Trailer Overview When a transgender teen goes missing, Annie Ryder—a cop at odds with her hometown—dives in to unravel the disappearance that suggests foul play, despite finding herself in a difficult position as she must cast suspicion on people she has known all her life. Featured Crew Jane Maggs Creator Adrienne Mitchell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Anna Paquin Annie Ryder Shawn Doyle Peter Welland Allen Leech Eddie Roe Billy MacLellan Brady Holt Sharon Taylor Virginia Panamick Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Bellevue premiered on February 19, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply So 3 episodes in.. Open 1 by  fridaynight So this is where she went hunh? Open 2 by  walking_bread Go to Discussions Media Most Popular Videos  3 Backdrops  6 Posters  6 Recommendations   2016-09-09 One Mississippi 8.1    2017-03-05 The Arrangement 5.3    2016-10-09 Divorce 6.1    2017-01-25 Mary Kills People 7.5    2016-11-06 Frontier 5.9    2016-08-19 Jean-Claude Van Johnson 7.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbc.ca/bellevue/ Genres Drama Mystery Keywords small town canada detective cop ontario canada missing person mysterious Content Score 100 Yes! Looking good! Top Contributors 31 Alexandria 17 United600 15 Elizabeth Jennings 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}