{"link": "https://www.themoviedb.org/tv/68410?language=en", "title": "White Nights", "resume": "Seo Yi-Kyung ambitiously wants to build her own empire. She is calm and also passionate. She doesn't believe greed is a sin. Park Gun-Woo possesses good looks and comes from a wealthy family that runs a large company. Seo Yi-Kyung is his first love and he is still in love with her. Lee Se-Jin comes from a poor background. She desperately wants to escape from her situation.", "rate": 80, "genre": ["Drama"], "cast": ["Lee Yo-won", "Jin Goo", "Uee", "Jung Hae-in", "Jeon Kuk-hwan"], "character": ["Seo Yi-kyung", "Park Gun-woo", "Lee Se-jin", "Tak", "Son Ee-sung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68410   Expand White Nights   (2016) User Score Overview Seo Yi-Kyung ambitiously wants to build her own empire. She is calm and also passionate. She doesn't believe greed is a sin. Park Gun-Woo possesses good looks and comes from a wealthy family that runs a large company. Seo Yi-Kyung is his first love and he is still in love with her. Lee Se-Jin comes from a poor background. She desperately wants to escape from her situation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yo-won Seo Yi-kyung Jin Goo Park Gun-woo Uee Lee Se-jin Jung Hae-in Tak Jeon Kuk-hwan Son Ee-sung Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of White Nights premiered on November 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2017-09-04 Argon 6.8    2008-03-16 Fated to Love You 7.3    2015-07-22 Diamond Lover 6.9    2011-08-08 Birdie Buddy 7.7    2016-03-23 Click your Heart 7.0    2016-03-06 Refresh Man 7.0  Facts Original Name  불야성 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/bulya/ Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors M 56 Maria180493 5 lemonlyman z 5 zurman1 4 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}