{"link": "https://www.themoviedb.org/tv/1664?language=en", "title": "Spider-Man: The New Animated Series", "resume": "Spider-Man: The New Animated Series is an American animated series based on the Marvel comic book superhero character Spider-Man, which ran for one season, 13 episodes, starting on July 11, 2003. It is a loose continuation of 2002's Spider-Man film directed by Sam Raimi. The show was made using computer generated imagery rendered in cel shading and was broadcast on MTV, and YTV. Eight months later after the series finale, episodes aired in reruns on ABC Family as part of the Jetix television programming block. The series featured a far more mature version of the character than typically seen on television for any animated comic book adaptation. Throughout the series, characters are clearly killed, rather than the usual ambiguous disappearance, and several characters are strongly implied to have had sex.", "rate": 67, "genre": ["Animation", "Action", "Adventure"], "cast": ["Ian Ziering", "Neil Patrick Harris", "Lisa Loeb", "Keith Carradine", "Su-chin Pak"], "character": ["Harry Osborn", "Peter Parker / Spider-Man", "Mary Jane Watson", "J. Jonah Jameson", "Alison Tomita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1664   Expand Spider-Man: The New Animated Series   (2003) User Score Overview Spider-Man: The New Animated Series is an American animated series based on the Marvel comic book superhero character Spider-Man, which ran for one season, 13 episodes, starting on July 11, 2003. It is a loose continuation of 2002's Spider-Man film directed by Sam Raimi. The show was made using computer generated imagery rendered in cel shading and was broadcast on MTV, and YTV. Eight months later after the series finale, episodes aired in reruns on ABC Family as part of the Jetix television programming block. The series featured a far more mature version of the character than typically seen on television for any animated comic book adaptation. Throughout the series, characters are clearly killed, rather than the usual ambiguous disappearance, and several characters are strongly implied to have had sex. Featured Crew Stan Lee Creator Steve Ditko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Ziering Harry Osborn Neil Patrick Harris Peter Parker / Spider-Man Lisa Loeb Mary Jane Watson Keith Carradine J. Jonah Jameson Su-chin Pak Alison Tomita Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Spider-Man: The New Animated Series premiered on July 11, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations   1981-09-12 Spider-Man and His Amazing Friends 6.7    1991-09-14 Captain N and the New Super Mario World 4.7    Silver Surfer: The Animated Series 7.7    1977-02-10 The New Adventures of Batman 6.0    1967-09-09 Spider-Man 7.9    2011-11-11 Green Lantern: The Animated Series 7.2    2012-04-01 Marvel's Ultimate Spider-Man 6.6    1996-09-06 Superman: The Animated Series 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mtv.com/onair/spider-man Genres Animation Action & Adventure Keywords superhero based on comic Content Score 93 Almost there... Top Contributors 19 BarkingBaphomet 11 Banana d 6 denis R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}