{"link": "https://www.themoviedb.org/tv/4549?language=en", "title": "Yes Minister", "resume": "Set principally in the private office of a British Cabinet minister in the Department of Administrative Affairs in Whitehall, Yes Minister follows the ministerial career of The Rt Hon Jim Hacker MP, played by Paul Eddington. His various struggles to formulate and enact legislation or effect departmental changes are opposed by the British Civil Service, in particular his Permanent Secretary, Sir Humphrey Appleby, played by Nigel Hawthorne. His Principal Private Secretary Bernard Woolley, played by Derek Fowlds, is usually caught between the two. The sequel, Yes, Prime Minister, continued with the same cast and followed the events of the premiership of Jim Hacker after his unexpected elevation to Number 10 upon the resignation of the previous PM.", "rate": 82, "genre": ["Comedy"], "cast": ["Paul Eddington", "Derek Fowlds", "Diana Hoddinott", "Nigel Hawthorne"], "character": ["Jim Hacker", "Bernard Woolley", "Annie Hacker", "Humphrey Appleby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4549   Expand Yes Minister   (1980) User Score Overview Set principally in the private office of a British Cabinet minister in the Department of Administrative Affairs in Whitehall, Yes Minister follows the ministerial career of The Rt Hon Jim Hacker MP, played by Paul Eddington. His various struggles to formulate and enact legislation or effect departmental changes are opposed by the British Civil Service, in particular his Permanent Secretary, Sir Humphrey Appleby, played by Nigel Hawthorne. His Principal Private Secretary Bernard Woolley, played by Derek Fowlds, is usually caught between the two. The sequel, Yes, Prime Minister, continued with the same cast and followed the events of the premiership of Jim Hacker after his unexpected elevation to Number 10 upon the resignation of the previous PM. Featured Crew Antony Jay Creator Jonathan Lynn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Eddington Jim Hacker Derek Fowlds Bernard Woolley Diana Hoddinott Annie Hacker Nigel Hawthorne Humphrey Appleby Full Cast & Crew Last Season Series 3 1982 | 7 Episodes Season 3 of Yes Minister premiered on November 11, 1982. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Yes Minister. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1986-01-09 Yes, Prime Minister 8.1    1975-04-04 The Good Life 7.0    1983-09-22 Just Good Friends 6.4    1987-03-09 French & Saunders 7.4    1984-02-26 Spitting Image 7.8    1984-01-29 Ever Decreasing Circles 6.5    1965-07-22 Till Death Us Do Part 7.2    1976-02-20 Open All Hours 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006xtc3 Genres Comedy Keywords england politics minister politician satire sitcom political humour british humour workplace comedy Content Score 93 Almost there... Top Contributors 12 Elizabeth Jennings O 9 Ozbourne j 8 jzvc t 8 taxigps  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}