{"link": "https://www.themoviedb.org/tv/3804?language=en", "title": "Webster", "resume": "Webster is an American situation comedy that aired on ABC from September 16, 1983 until May 8, 1987, and in first-run syndication from September 21, 1987 until March 10, 1989. The series was created by Stu Silver.\nThe show stars Emmanuel Lewis in the title role as a young boy who, after losing his parents, is adopted by his NFL-pro godfather, portrayed by Alex Karras, and his new socialite wife, played by Susan Clark. The focus was largely on how this impulsively married couple had to adjust to their new lives and sudden parenthood, but it was the congenial Webster himself who drove much of the plot. The series was produced by Georgian Bay Ltd., Emmanuel Lewis Entertainment Enterprises, Inc. and Paramount Television.\nLike NBC's earlier hit Diff'rent Strokes, Webster featured a young African-American boy adopted by a white family.", "rate": 49, "genre": ["Comedy"], "cast": ["Eugene Roche", "Susan Clark", "Alex Karras", "Cathryn Damon", "Emmanuel Lewis"], "character": ["Webster Long"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3804   Expand Webster   (1983) User Score Overview Webster is an American situation comedy that aired on ABC from September 16, 1983 until May 8, 1987, and in first-run syndication from September 21, 1987 until March 10, 1989. The series was created by Stu Silver. The show stars Emmanuel Lewis in the title role as a young boy who, after losing his parents, is adopted by his NFL-pro godfather, portrayed by Alex Karras, and his new socialite wife, played by Susan Clark. The focus was largely on how this impulsively married couple had to adjust to their new lives and sudden parenthood, but it was the congenial Webster himself who drove much of the plot. The series was produced by Georgian Bay Ltd., Emmanuel Lewis Entertainment Enterprises, Inc. and Paramount Television. Like NBC's earlier hit Diff'rent Strokes, Webster featured a young African-American boy adopted by a white family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eugene Roche Susan Clark Alex Karras Cathryn Damon Emmanuel Lewis Webster Long Full Cast & Crew Last Season Season 6 1988 | 25 Episodes Season 6 of Webster premiered on September  9, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M Webster must be disappointed Open 0 by Moonglum9\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1987-09-20 My Two Dads 5.7    1984-09-25 Three's a Crowd 6.7    1986-09-17 Head of the Class 6.3    1981-10-29 Gimme a Break! 5.7    1989-02-28 Coach 6.8    1985-03-15 Mr. Belvedere 6.8    1984-09-18 Punky Brewster 6.8    1984-10-03 Charles in Charge 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords upper class orphan sitcom child care Content Score 86 Almost there... Top Contributors 10 Banana 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}