{"link": "https://www.themoviedb.org/tv/78492?language=en", "title": "Hot Blood Dance Crew", "resume": "191 dancers from all walks of life, both within and beyond China, come together to battle it out to be crowned the best dancer in China.", "rate": 0, "genre": ["Drama"], "cast": ["Lu Han", "Victoria Song", "Jackson Wang", "William Chan Wai-Ting"], "character": ["Dance Mentor", "Dance Mentor", "Dance Mentor", "Dance Mentor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78492   Expand Hot Blood Dance Crew   (2018) User Score Overview 191 dancers from all walks of life, both within and beyond China, come together to battle it out to be crowned the best dancer in China. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lu Han Dance Mentor Victoria Song Dance Mentor Jackson Wang Dance Mentor William Chan Wai-Ting Dance Mentor Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Hot Blood Dance Crew premiered on March 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Hot Blood Dance Crew. You can help by rating TV shows you've seen. Facts Original Name  热血街舞团 Status  Returning Series Network Certification  - Type  Reality Original Language  Chinese Runtime  65m, 70m Homepage   http://www.iqiyi.com/v_19rrbebyt8.html Genres Drama Keywords dance dance contest idol Content Score 71 Just a little bit more... Top Contributors p 33 pokego1234 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}