{"link": "https://www.themoviedb.org/tv/5216?language=en", "title": "Rederiet", "resume": "Rederiet was a long-running Swedish soap opera that aired on Sveriges Television between 1992 and 2002. The cast featured many popular and renowned Swedish actors, and the show has often been referred to as Sweden's version of Dynasty.\nThe 45-minute episodes were broadcast weekly on Thursday nights on the public-service channel SVT1 and normally had between one and two million viewers. For ten years, Rederiet was the number-one rated show on Swedish television, along with the rival TV4 show Tre Kronor. The competition for viewers can be compared to that between Dynasty and Dallas.\nRederiet also gained popularity in Finland on YLE TV2, and the show was a hit in Norway too on TV2. The first season of the show was also sold to Egypt. The later seasons of the series were produced in collaboration with YLE, which led most notably to Finnish actor Åke Lindman appearing in the series. Rapper Ken Ring also appeared as an extra in the show in 1996.\nOn April Fools' Day 1993 SVT News announced that Mel Gibson was to play a lead role in the series. Gibson himself was interviewed and confirmed the information. It was later revealed that the whole event had been a joke.", "rate": 0, "genre": ["Drama"], "cast": ["Johannes Brost", "Gösta Prüzelius", "Gösta Krantz", "Mikael Persbrandt", "Josephine Bornebusch"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5216   Expand Rederiet   (1992) User Score Overview Rederiet was a long-running Swedish soap opera that aired on Sveriges Television between 1992 and 2002. The cast featured many popular and renowned Swedish actors, and the show has often been referred to as Sweden's version of Dynasty. The 45-minute episodes were broadcast weekly on Thursday nights on the public-service channel SVT1 and normally had between one and two million viewers. For ten years, Rederiet was the number-one rated show on Swedish television, along with the rival TV4 show Tre Kronor. The competition for viewers can be compared to that between Dynasty and Dallas. Rederiet also gained popularity in Finland on YLE TV2, and the show was a hit in Norway too on TV2. The first season of the show was also sold to Egypt. The later seasons of the series were produced in collaboration with YLE, which led most notably to Finnish actor Åke Lindman appearing in the series. Rapper Ken Ring also appeared as an extra in the show in 1996. On April Fools' Day 1993 SVT News announced that Mel Gibson was to play a lead role in the series. Gibson himself was interviewed and confirmed the information. It was later revealed that the whole event had been a joke. Featured Crew Louise Boije af Gennäs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johannes Brost Gösta Prüzelius Gösta Krantz Mikael Persbrandt Josephine Bornebusch Full Cast & Crew Last Season Season 20 2002 | 5 Episodes Season 20 of Rederiet premiered on April 18, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rederiet. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.svt.se/rederiet Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors h 7 hamreus C 4 CyberScream TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}