{"link": "https://www.themoviedb.org/tv/4483?language=en", "title": "The Young Ones", "resume": "The Young Ones is a British sitcom, broadcast in Great Britain from 1982 to 1984 in two six-part series. Shown on BBC2, it featured anarchic, offbeat humour which helped bring alternative comedy to television in the 1980s and made household names of its writers and performers. In 1985, it was shown on MTV, one of the first non-music television shows on the fledgling channel.", "rate": 79, "genre": ["Comedy"], "cast": ["Adrian Edmondson", "Alexei Sayle", "Nigel Planer", "Rik Mayall", "Christopher Ryan"], "character": ["Vyvyan Bastard", "Nigel Planer", "Rick", "Mike Thecoolperson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4483   Expand The Young Ones   (1982) User Score Overview The Young Ones is a British sitcom, broadcast in Great Britain from 1982 to 1984 in two six-part series. Shown on BBC2, it featured anarchic, offbeat humour which helped bring alternative comedy to television in the 1980s and made household names of its writers and performers. In 1985, it was shown on MTV, one of the first non-music television shows on the fledgling channel. Featured Crew Ben Elton Creator Alexei Sayle Creator Rik Mayall Creator Lise Mayer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrian Edmondson Vyvyan Bastard Alexei Sayle Nigel Planer Nigel Planer Rik Mayall Rick Christopher Ryan Mike Thecoolperson Full Cast & Crew Last Season Season 2 1984 | 6 Episodes Season 2 of The Young Ones premiered on May  8, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1991-09-17 Bottom 8.1    1987-01-07 Filthy Rich & Catflap 6.7    1993-12-27 Shooting Stars 6.7    1999-01-08 Gimme Gimme Gimme 7.0    1976-02-20 Open All Hours 7.7    1995-04-21 Father Ted 7.9    1987-09-13 The New Statesman 7.9    1992-02-18 Men Behaving Badly 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  35m Homepage  - Genres Comedy Keywords surreal satire student sitcom british humour flatmates anarchic comedy Content Score 93 Almost there... Top Contributors O 15 Ozbourne z 10 zurman1 9 efeka D 4 DracoAn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}