{"link": "https://www.themoviedb.org/tv/8459?language=en", "title": "Being Erica", "resume": "Being Erica is a Canadian comedy-drama television series that aired on CBC from January 5, 2009 to December 12, 2011.\nCreated by Jana Sinyor, the series was originally announced by the CBC as The Session, but was retitled Being Erica before debuting in 2009. It is produced by Temple Street Productions and distributed internationally by BBC Worldwide.\nThe show stars Erin Karpluk as Erica Strange, a woman who begins seeing a therapist to deal with regrets in her life, only to discover the therapist has the ability to send her back in time to actually relive these events and even change them.\nIn Canada, the second season premiered on September 22, 2009. Only 12 episodes were produced for the second season due to budget cuts at the CBC.\nOn May 11, 2010, the CBC announced that Being Erica was renewed for a third season of 13 episodes. Soapnet announced that it was picking up the full third season as well. Season 3 debuted on September 21, 2010, at 9 pm ET, on CBC Television. In the United States, Season 3 began aired on Soapnet starting January 26, 2011.\nThe show's fourth and final season aired in fall 2011. Although the show was never officially cancelled by the CBC, Sinyor told TV Guide during the fourth and final season run that the series had reached a natural conclusion and she had no plans to write or produce a fifth season.", "rate": 61, "genre": ["Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Michael Riley", "Laurence Leboeuf", "Reagan Pasternak", "Erin Karpluk", "Sarah Gadon"], "character": ["Erica Strange"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8459   Expand Being Erica   (2009) User Score  Play Trailer Overview Being Erica is a Canadian comedy-drama television series that aired on CBC from January 5, 2009 to December 12, 2011. Created by Jana Sinyor, the series was originally announced by the CBC as The Session, but was retitled Being Erica before debuting in 2009. It is produced by Temple Street Productions and distributed internationally by BBC Worldwide. The show stars Erin Karpluk as Erica Strange, a woman who begins seeing a therapist to deal with regrets in her life, only to discover the therapist has the ability to send her back in time to actually relive these events and even change them. In Canada, the second season premiered on September 22, 2009. Only 12 episodes were produced for the second season due to budget cuts at the CBC. On May 11, 2010, the CBC announced that Being Erica was renewed for a third season of 13 episodes. Soapnet announced that it was picking up the full third season as well. Season 3 debuted on September 21, 2010, at 9 pm ET, on CBC Television. In the United States, Season 3 began aired on Soapnet starting January 26, 2011. The show's fourth and final season aired in fall 2011. Although the show was never officially cancelled by the CBC, Sinyor told TV Guide during the fourth and final season run that the series had reached a natural conclusion and she had no plans to write or produce a fifth season. Featured Crew Jana Sinyor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Riley Laurence Leboeuf Reagan Pasternak Erin Karpluk Erica Strange Sarah Gadon Full Cast & Crew Last Season Season 4 2011 | 11 Episodes Season 4 of Being Erica premiered on September 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  18 Posters  15 Recommendations   2009-11-24 Paradox 6.2    2010-06-20 The Gates 6.8    2011-09-22 Whitney 3.8    2014-08-07 Garfunkel and Oates 7.5    2011-08-29 Death Valley 7.4    2012-04-11 Don't Trust the B---- in Apartment 23 6.7    2009-11-09 Miranda 7.3    2011-01-17 Harry's Law 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Sci-Fi & Fantasy Drama Comedy Keywords time travel therapy changing the past or future Content Score 100 Yes! Looking good! Top Contributors 40 Banana z 15 zurman1 m 3 magoozin w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}