{"link": "https://www.themoviedb.org/tv/64228?language=en", "title": "Be Cool, Scooby Doo!", "resume": "In this incarnation of the long running Scooby Doo franchise, the Scooby gang are traveling in summer and spending time together which could be their last summer but monsters and ghouls get in the way of completing their adventurers.", "rate": 51, "genre": ["Comedy", "Animation"], "cast": ["Matthew Lillard", "Grey DeLisle", "Kate Micucci", "Frank Welker"], "character": ["Shaggy Rogers (voice)", "Daphne Blake (voice)", "Velma Dinkley (voice)", "Fred Jones / Scooby-Doo (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64228   Expand Be Cool, Scooby Doo!   (2015) User Score  Play Trailer Overview In this incarnation of the long running Scooby Doo franchise, the Scooby gang are traveling in summer and spending time together which could be their last summer but monsters and ghouls get in the way of completing their adventurers. Featured Crew Joe Ruby Creator Ken Spears Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Lillard Shaggy Rogers (voice) Grey DeLisle Daphne Blake (voice) Kate Micucci Velma Dinkley (voice) Frank Welker Fred Jones / Scooby-Doo (voice) Full Cast & Crew Last Season Season 2 2017 | 26 Episodes Season 2 of Be Cool, Scooby Doo! premiered on February 13, 2017. View All Seasons Social Reviews  1 Discussions  0 T A review by Thomaxz  1.0 Written by  Thomaxz  on March 12, 2017 Watch every other incarnation of Scooby Doo!!!\nEven Scooby Doo and 13 Ghost, which was weird, is still 1000 times better than this. Like Velma beliving in \"Early piratetism\", are f--k--g kidding me, so stupid. Do not see this!! Instead  go watch any other Scooby Doo. Read All Reviews Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2015-09-21 Wabbit 4.6    2016-04-04 The Powerpuff Girls 3.5    2011-05-03 The Looney Tunes Show 7.0    2010-07-12 Scooby-Doo! Mystery Incorporated 7.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage  - Genres Comedy Animation Keywords crime solving Content Score 100 Yes! Looking good! Top Contributors 21 Banana 13 ReggieRocket T 4 Theother z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}