{"link": "https://www.themoviedb.org/tv/10860?language=en", "title": "Road to Avonlea", "resume": "Road to Avonlea is a television series which was first broadcast in Canada and the United States between 1990 and 1996. It was created by Kevin Sullivan and produced by Sullivan Films in association with CBC and the Disney Channel, with additional funding from Telefilm Canada.\nIt was adapted from the following books by L.M. Montgomery: The Story Girl, The Golden Road, Chronicles of Avonlea and Further Chronicles of Avonlea.\nSome episodes of the show were turned into the independent books by different authors. There have been around 30 titles released.\nIn the United States, its title was shortened to simply Avonlea, and a number of episodes were re-titled and re-ordered. When the series was released on VHS and DVD in the United States, the title changed from Road to Avonlea to Tales from Avonlea.\nThe series is set in the fictional small town of Avonlea, Prince Edward Island, in the early 20th century. There, 10-year-old Montreal heiress Sara Stanley is sent by her wealthy father to live with her two maiden aunts, Hetty and Olivia King, to be near her late mother's side of the family. The show's focus shifted over the years from Sara's interactions with her new-found relatives, to stories about the King family. Later seasons of the show focused more on residents of Avonlea who were connected to the King family. Sarah Polley left the show in 1994, returning for one guest appearance in the 6th season and one in 7th season.", "rate": 0, "genre": ["Drama", "Western", "Family"], "cast": ["Shirley Douglas", "Sarah Polley", "Jackie Burroughs", "Mag Ruffman", "Lally Cadeau"], "character": ["Sara Stanley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10860   Expand Road to Avonlea   (1990) User Score Overview Road to Avonlea is a television series which was first broadcast in Canada and the United States between 1990 and 1996. It was created by Kevin Sullivan and produced by Sullivan Films in association with CBC and the Disney Channel, with additional funding from Telefilm Canada. It was adapted from the following books by L.M. Montgomery: The Story Girl, The Golden Road, Chronicles of Avonlea and Further Chronicles of Avonlea. Some episodes of the show were turned into the independent books by different authors. There have been around 30 titles released. In the United States, its title was shortened to simply Avonlea, and a number of episodes were re-titled and re-ordered. When the series was released on VHS and DVD in the United States, the title changed from Road to Avonlea to Tales from Avonlea. The series is set in the fictional small town of Avonlea, Prince Edward Island, in the early 20th century. There, 10-year-old Montreal heiress Sara Stanley is sent by her wealthy father to live with her two maiden aunts, Hetty and Olivia King, to be near her late mother's side of the family. The show's focus shifted over the years from Sara's interactions with her new-found relatives, to stories about the King family. Later seasons of the show focused more on residents of Avonlea who were connected to the King family. Sarah Polley left the show in 1994, returning for one guest appearance in the 6th season and one in 7th season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shirley Douglas Sarah Polley Sara Stanley Jackie Burroughs Mag Ruffman Lally Cadeau Full Cast & Crew Last Season Season 7 1996 | 13 Episodes Season 7 of Road to Avonlea premiered on January 14, 1996. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Road to Avonlea. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Road to Avonlea. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.roadtoavonlea.com/ Genres Drama Western Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 8 aggastyan S 2 Sportacus 2 lineker AB 1 Arlo B.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}