{"link": "https://www.themoviedb.org/tv/69255?language=en", "title": "Ministério do Tempo", "resume": "A warrior from the XVI century, the first female university student from the XIX century and a nurse from the XXI century, join a secret agency to prevent people to change the Portuguese history by using time-traveling doors", "rate": 70, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Mariana Monteiro", "João Craveiro", "Sisley Dias", "António Capelo", "Carla Andrino"], "character": ["Amélia Carvalho", "Afonso Mendes de Noronha", "Tiago Silva", "Salvador Martins", "Maria dos Prazeres"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69255   Expand Ministério do Tempo   (2017) User Score  Play Trailer Overview A warrior from the XVI century, the first female university student from the XIX century and a nurse from the XXI century, join a secret agency to prevent people to change the Portuguese history by using time-traveling doors Featured Crew Pablo Olivares Creator Javier Olivares Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariana Monteiro Amélia Carvalho João Craveiro Afonso Mendes de Noronha Sisley Dias Tiago Silva António Capelo Salvador Martins Carla Andrino Maria dos Prazeres Full Cast & Crew Last Season Season 1 2017 | 21 Episodes Season 1 of Ministério do Tempo premiered on January  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ministério do Tempo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Portuguese Runtime  - Homepage   http://media.rtp.pt/ministeriodotempo/ Genres Action & Adventure Sci-Fi & Fantasy Keywords portugal time travel history portuguese Content Score 100 Yes! Looking good! Top Contributors A 32 AntonioGervasio87 c 12 clinis 10 Elizabeth Jennings 9 Leinad4Mind  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}