{"link": "https://www.themoviedb.org/tv/78649?language=en", "title": "Uncharted Walker", "resume": "A magician, a female doctor, a gangster, an archaeology professor, a policewoman, a drug dealer, a businessman... Such a random group of people find themselves trapped on a desolate island when they wake up from sleep one day. They are surrounded by primitive tribes, mutant viruses, and countless life and death situations on this mysterious island. What will they do to survive and escape?", "rate": 100, "genre": ["Animation", "Mystery"], "cast": ["Su Shangqing"], "character": ["宁远"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78649   Expand Uncharted Walker   (2018) User Score Overview A magician, a female doctor, a gangster, an archaeology professor, a policewoman, a drug dealer, a businessman... Such a random group of people find themselves trapped on a desolate island when they wake up from sleep one day. They are surrounded by primitive tribes, mutant viruses, and countless life and death situations on this mysterious island. What will they do to survive and escape? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Su Shangqing 宁远 Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Uncharted Walker premiered on February  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Uncharted Walker. You can help by rating TV shows you've seen. Facts Original Name  Mi Yu Xing Zhe Status  Returning Series Networks - Certification 16 Meaning Not recommended for children under 16. Not allowed air before 10:30 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  Chinese Runtime  23m Homepage  - Genres Animation Mystery Keywords survival game monstres Content Score 64 We're so close, yet so far. Top Contributors 13 seboseboss 11 無情天 7 Belka27 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}