{"link": "https://www.themoviedb.org/tv/8922?language=en", "title": "Neo Ranga", "resume": "Neo Ranga is an anime television series created by Studio Pierrot which consists of two seasons, totaling forty-eight episodes. The story is about the three orphaned sisters who have, through a mysterious twist of fate, inherited their very own god - the 18 meter tall Neo Ranga.\nNeo Ranga was originally aired in Japan as part of the omnibus show Anime Complex, and is currently aired on the Quinn channel in Australia.", "rate": 70, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Eri Sendai", "Megumi Ogata", "Yuko Miyamura", "Yūko Sumitomo", "Yukiko Mannaka"], "character": ["Yuuhi Shimabara", "Mei Ohmori", "Ushio Shimabara", "Minami Shimabara", "Nakata the reporter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8922   Expand Neo Ranga   (1998) User Score Overview Neo Ranga is an anime television series created by Studio Pierrot which consists of two seasons, totaling forty-eight episodes. The story is about the three orphaned sisters who have, through a mysterious twist of fate, inherited their very own god - the 18 meter tall Neo Ranga. Neo Ranga was originally aired in Japan as part of the omnibus show Anime Complex, and is currently aired on the Quinn channel in Australia. Featured Crew Noboru Aikawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eri Sendai Yuuhi Shimabara Megumi Ogata Mei Ohmori Yuko Miyamura Ushio Shimabara Yūko Sumitomo Minami Shimabara Yukiko Mannaka Nakata the reporter Full Cast & Crew Last Season Season 1 1998 | 48 Episodes Season 1 of Neo Ranga premiered on April  6, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Neo Ranga. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Neo Ranga. You can help by rating TV shows you've seen. Facts Original Name  南海奇皇ネオランガ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  15m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 14 alexboom31 7 BrerFox R 3 Rebecca K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}