{"link": "https://www.themoviedb.org/tv/3720?language=en", "title": "Young Dracula", "resume": "Young Dracula is a British teenage horror drama television series airing on CBBC, loosely based on Young Dracula AND Young Monsters, a children's book by Michael Lawrence. Directed by Joss Agnew, the first series was broadcast in 2006, and the second series, which started in late 2007, concluded in early 2008. A third series was commissioned three years later and began airing on 31 October 2011, and a fourth began airing on 29 October 2012.\nThe first two series follow the Dracula family, a family of vampires: Vladimir, his father Count Dracula, and older sister Ingrid. Having lived in Transylvania, they move to Stokely, a small town in Wales after various incidents involving angry peasant mobs. It was filmed in various locations around Wales, including Ysgol Gyfun Gymraeg Glantaf, Caerphilly Castle, Tretower Court and parts of Llantrisant. The third series, commissioned three years after the second, sees Vlad and the Count flee both vampires and slayers, while the Count is determined that Vlad should fulfil his destiny to become \"the Chosen One\". This series was filmed in Liverpool during 2011, in various locations including the disused Margaret Bevan School, Croxteth Hall and Stanley Docks. The fourth series follows on from season three's predicament and was helmed by a new director.", "rate": 62, "genre": ["Family", "Drama", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Keith-Lee Castle", "Gerran Howell", "Craig Roberts", "Ciaran Joyce", "Clare Thomas"], "character": ["Count Dracula", "Vlad Dracula", "Robin Branagh", "Boris", "Ingrid Dracula"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3720   Expand Young Dracula   (2006) User Score Overview Young Dracula is a British teenage horror drama television series airing on CBBC, loosely based on Young Dracula AND Young Monsters, a children's book by Michael Lawrence. Directed by Joss Agnew, the first series was broadcast in 2006, and the second series, which started in late 2007, concluded in early 2008. A third series was commissioned three years later and began airing on 31 October 2011, and a fourth began airing on 29 October 2012. The first two series follow the Dracula family, a family of vampires: Vladimir, his father Count Dracula, and older sister Ingrid. Having lived in Transylvania, they move to Stokely, a small town in Wales after various incidents involving angry peasant mobs. It was filmed in various locations around Wales, including Ysgol Gyfun Gymraeg Glantaf, Caerphilly Castle, Tretower Court and parts of Llantrisant. The third series, commissioned three years after the second, sees Vlad and the Count flee both vampires and slayers, while the Count is determined that Vlad should fulfil his destiny to become \"the Chosen One\". This series was filmed in Liverpool during 2011, in various locations including the disused Margaret Bevan School, Croxteth Hall and Stanley Docks. The fourth series follows on from season three's predicament and was helmed by a new director. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith-Lee Castle Count Dracula Gerran Howell Vlad Dracula Craig Roberts Robin Branagh Ciaran Joyce Boris Clare Thomas Ingrid Dracula Full Cast & Crew Last Season Season 4 2012 | 13 Episodes Season 4 of Young Dracula premiered on October 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Young Dracula. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  28m, 30m Homepage   http://www.bbc.co.uk/cbbc/yourlife/youngdracula/ Genres Family Drama Comedy Sci-Fi & Fantasy Keywords vampire dracula based on children's book Content Score 86 Almost there... Top Contributors 22 Banana s 4 speedycars 2 titantelo15 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}