{"link": "https://www.themoviedb.org/tv/50180?language=en", "title": "Heiter bis tödlich - Morden im Norden", "resume": "Morden im Norden is a German Police that has been broadcast by Das Erste. The show is set in Lübeck, Germany\nMorden im Norden is part of a series of commonly branded shows with similar themes called \"Heiter bis tödlich\".", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Sven Martinek", "Ingo Naujoks", "Proschat Madani", "Marie-Luise Schramm", "Veit Stübner"], "character": ["Kriminalhauptkommissar Finn Kiesewetter", "Kriminaldirektor Lars Englen", "Dr. Hilke Zobel", "Kriminaloberkommissarin Sandra Schwartenbeck", "Kriminalhauptkommissar Schroeter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50180   Expand Heiter bis tödlich - Morden im Norden   (2012) User Score Overview Morden im Norden is a German Police that has been broadcast by Das Erste. The show is set in Lübeck, Germany Morden im Norden is part of a series of commonly branded shows with similar themes called \"Heiter bis tödlich\". Featured Crew Marie Reiners Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sven Martinek Kriminalhauptkommissar Finn Kiesewetter Ingo Naujoks Kriminaldirektor Lars Englen Proschat Madani Dr. Hilke Zobel Marie-Luise Schramm Kriminaloberkommissarin Sandra Schwartenbeck Veit Stübner Kriminalhauptkommissar Schroeter Full Cast & Crew Last Season Season 4 2016 | 16 Episodes Season 4 of Heiter bis tödlich - Morden im Norden premiered on October 31, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Heiter bis tödlich - Morden im Norden. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Crime Drama Keywords police Content Score 93 Almost there... Top Contributors S 48 Samara L 32 Lemmy_6 7 Banana S 4 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}