{"link": "https://www.themoviedb.org/tv/31586?language=en", "title": "La Reina del Sur", "resume": "La Reina del Sur is a Spanish-language telenovela produced by the United States television network Telemundo, in conjunction with the Antena 3 network and RTI Producciones. Based on a novel of the same name by Spanish author Arturo Pérez-Reverte, the drama depicts the rise of Teresa Mendoza, a young woman from Mexico who becomes the most powerful drug trafficker in southern Spain. Patricio Wills, the president of Telemundo Television Studios, was the executive producer. Though La Reina del Sur was nominated for Novela of the Year, Favorite Lead Actress, and Best Bad Luck Video, it won no awards.\nWith a $10 million budget, La Reina del Sur was the most expensive telenovela ever produced by Telemundo. The program's premiere on February 28, 2011, was the network's highest rated premiere for a telenovela to date. The program frequently dominated its time slot, even over English language programming on other major U.S. networks.\nLa Reina del Sur completed its 63 episode run on Telemundo and its 13 episode run on Antena 3 simultaneously on May 30, 2011. The final episode was the highest rated broadcast in Telemundo's 19-year history, and beat all of the English language U.S. television networks to earn the number one slot in the 18-49 adult demographic. The program's success spurred Telemundo to launch its first campaign to gain the series an Emmy Award nomination. A one-night special featuring several cast members aired on May 31, 2011, and marked the Telemundo debut of noted Latina television personality Cristina Saralegui.", "rate": 83, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31586   Expand La Reina del Sur   (2011) User Score Overview La Reina del Sur is a Spanish-language telenovela produced by the United States television network Telemundo, in conjunction with the Antena 3 network and RTI Producciones. Based on a novel of the same name by Spanish author Arturo Pérez-Reverte, the drama depicts the rise of Teresa Mendoza, a young woman from Mexico who becomes the most powerful drug trafficker in southern Spain. Patricio Wills, the president of Telemundo Television Studios, was the executive producer. Though La Reina del Sur was nominated for Novela of the Year, Favorite Lead Actress, and Best Bad Luck Video, it won no awards. With a $10 million budget, La Reina del Sur was the most expensive telenovela ever produced by Telemundo. The program's premiere on February 28, 2011, was the network's highest rated premiere for a telenovela to date. The program frequently dominated its time slot, even over English language programming on other major U.S. networks. La Reina del Sur completed its 63 episode run on Telemundo and its 13 episode run on Antena 3 simultaneously on May 30, 2011. The final episode was the highest rated broadcast in Telemundo's 19-year history, and beat all of the English language U.S. television networks to earn the number one slot in the 18-49 adult demographic. The program's success spurred Telemundo to launch its first campaign to gain the series an Emmy Award nomination. A one-night special featuring several cast members aired on May 31, 2011, and marked the Telemundo debut of noted Latina television personality Cristina Saralegui. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2011 | 65 Episodes Season 1 of La Reina del Sur premiered on February 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La Reina del Sur. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.msnlatino.telemundo.com/novelas/La_Reina_Del_Sur/ Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 10 zurman1 s 9 shiff7 4 71d3r m 4 manwest  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}