{"link": "https://www.themoviedb.org/tv/75123?language=en", "title": "A Korean Odyssey", "resume": "A self-serving mythical creature's bid for invincibility backfires when he finds himself at the mercy of a woman who can see otherworldly beings.", "rate": 51, "genre": ["Comedy", "Mystery"], "cast": ["Lee Seung-gi", "Cha Seung-won", "Oh Yeon-Seo", "Lee Hong-gi", "Jang Gwang"], "character": ["Son O-Gong", "King Wooma", "Jin Sun-Mi", "P.K", "Yoon Dae-Sik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75123   Expand A Korean Odyssey   (2017) User Score Overview A self-serving mythical creature's bid for invincibility backfires when he finds himself at the mercy of a woman who can see otherworldly beings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Seung-gi Son O-Gong Cha Seung-won King Wooma Oh Yeon-Seo Jin Sun-Mi Lee Hong-gi P.K Jang Gwang Yoon Dae-Sik Full Cast & Crew Current Season Season 1 2017 | 20 Episodes Season 1 of A Korean Odyssey premiered on December 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations   2017-03-20 The Liar and His Lover 8.3    2017-10-11 Mad Dog 8.0    2017-11-11 Money Flower 8.0    2017-12-11 Just Between Lovers 7.2    2017-10-09 Witch's Court 9.3    2017-01-16 Introverted Boss 8.7    2017-03-25 Tunnel 6.6    2017-05-29 My Sassy Girl 8.3  Facts Original Name  화유기 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/akoreanodyssey/ Genres Comedy Mystery Keywords fantasy romance Content Score 86 Almost there... Top Contributors M 63 Maria180493 6 Mongoloo 6 Elizabeth Jennings b 5 bsj10k2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}