{"link": "https://www.themoviedb.org/tv/67185?language=en", "title": "Au secours de Béatrice", "resume": "Béatrice Clément is a 48-year-old emergency room doctor. She is pretty, charming and at the top of her professional game. The only problem is, Béatrice hasn’t been feeling well. Having undergone every test available without any conclusive results, she is at the end of her rope. Finally, she overcomes her skepticism and agrees to visit a psychologist. Dr. P is gentle, attentive and compassionate. Despite Béatrice’s initial resistance, he slowly but surely gains her trust.  Every week, Béatrice is confronted with patients who remind her of her own personal struggles. It is becoming clear that although she is fully in control of the ER, her private life is another matter entirely. In her drive for constant perfection and control, she is faced with comical and embarrassing situations, but also painful ones.", "rate": 0, "genre": ["Soap", "Drama"], "cast": ["Gabriel Arcand", "Sophie Lorain", "Pierre-Luc Brillant", "Gabriel Sabourin", "Robert Lalonde"], "character": ["Monsieur P", "Béatrice Clément", "Olivier-Luc Laveaux", "Benoît Richard", "Christophe Clément"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67185   Expand Au secours de Béatrice   (2014) User Score Overview Béatrice Clément is a 48-year-old emergency room doctor. She is pretty, charming and at the top of her professional game. The only problem is, Béatrice hasn’t been feeling well. Having undergone every test available without any conclusive results, she is at the end of her rope. Finally, she overcomes her skepticism and agrees to visit a psychologist. Dr. P is gentle, attentive and compassionate. Despite Béatrice’s initial resistance, he slowly but surely gains her trust.  Every week, Béatrice is confronted with patients who remind her of her own personal struggles. It is becoming clear that although she is fully in control of the ER, her private life is another matter entirely. In her drive for constant perfection and control, she is faced with comical and embarrassing situations, but also painful ones. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabriel Arcand Monsieur P Sophie Lorain Béatrice Clément Pierre-Luc Brillant Olivier-Luc Laveaux Gabriel Sabourin Benoît Richard Robert Lalonde Christophe Clément Full Cast & Crew Last Season Season 4 2017 | 27 Episodes Season 4 of Au secours de Béatrice premiered on January 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Au secours de Béatrice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  44m Homepage   http://tva.canoe.ca/emissions/au-secours-de-beatrice Genres Soap Drama Keywords quebec forty something doctor therapy emergency room female doctor téléroman Content Score 86 Almost there... Top Contributors 80 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}