{"link": "https://www.themoviedb.org/tv/4530?language=en", "title": "Daktari", "resume": "Daktari is an American children's drama series that aired on CBS between 1966 and 1969. The series, an Ivan Tors Films Production in association with MGM Television, stars Marshall Thompson as Dr. Marsh Tracy, a veterinarian at the fictional Wameru Study Centre for Animal Behaviour in East Africa.", "rate": 67, "genre": ["Family", "Drama"], "cast": ["Marshall Thompson", "Hari Rhodes", "Cheryl Miller", "Yale Summers", "Ross Hagen"], "character": ["Dr. Marsh Tracy", "Mike Makula", "Paula Tracy", "Jack Dane", "Bart Jason"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4530   Expand Daktari   (1966) User Score Overview Daktari is an American children's drama series that aired on CBS between 1966 and 1969. The series, an Ivan Tors Films Production in association with MGM Television, stars Marshall Thompson as Dr. Marsh Tracy, a veterinarian at the fictional Wameru Study Centre for Animal Behaviour in East Africa. Featured Crew Ivan Tors Creator Art Arthur Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Marshall Thompson Dr. Marsh Tracy Hari Rhodes Mike Makula Cheryl Miller Paula Tracy Yale Summers Jack Dane Ross Hagen Bart Jason Full Cast & Crew Last Season Season 4 1968 | 15 Episodes Season 4 of Daktari premiered on September 25, 1968. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   1967-01-10 The Invaders 7.3    1971-09-17 The Persuaders! 8.0    1972-09-16 The Streets of San Francisco 7.1    1954-09-12 Lassie 5.3    1959-09-12 Bonanza 5.9    1975-09-10 Starsky & Hutch 6.5    1973-10-24 Kojak 7.4    1978-04-02 Dallas 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Family Drama Keywords africa veterinarian wild animal jungle wild Content Score 100 Yes! Looking good! Top Contributors 15 Banana m 3 macgyver01 w 3 webmaster TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}