{"link": "https://www.themoviedb.org/tv/61818?language=en", "title": "Late Night with Seth Meyers", "resume": "Seth Meyers, who is \"Saturday Night Live’s\" longest serving anchor on the show’s wildly popular \"Weekend Update,\" takes over as host of NBC’s \"Late Night\" — home to A-list celebrity guests, memorable comedy and the best in musical talent. As the Emmy Award-winning head writer for \"SNL,\" Meyers has established a reputation for sharp wit and perfectly timed comedy, and has gained fame for his spot-on jokes and satire. Meyers takes his departure from \"SNL\" to his new post at \"Late Night,\" as Jimmy Fallon moves to \"The Tonight Show\".", "rate": 56, "genre": ["Talk"], "cast": ["Seth Meyers"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61818   Expand Late Night with Seth Meyers   (2014) User Score  Play Trailer Overview Seth Meyers, who is \"Saturday Night Live’s\" longest serving anchor on the show’s wildly popular \"Weekend Update,\" takes over as host of NBC’s \"Late Night\" — home to A-list celebrity guests, memorable comedy and the best in musical talent. As the Emmy Award-winning head writer for \"SNL,\" Meyers has established a reputation for sharp wit and perfectly timed comedy, and has gained fame for his spot-on jokes and satire. Meyers takes his departure from \"SNL\" to his new post at \"Late Night,\" as Jimmy Fallon moves to \"The Tonight Show\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seth Meyers Himself - Host Full Cast & Crew Last Season Season 4 — | 3 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2012-02-13 Honest Trailers 8.5    2012-03-11 Shahs of Sunset 5.3    2002-01-08 Last Call with Carson Daly 2.2    2012-08-08 Here Comes Honey Boo Boo 1.9    2009-06-01 The Tonight Show with Conan O'Brien 7.8    2015-03-23 The Late Late Show with James Corden 4.7    2009-03-02 Late Night with Jimmy Fallon 6.0    1993-09-13 Late Night with Conan O'Brien 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  45m Homepage   http://www.nbc.com/late-night-with-seth-meyers Genres Talk Keywords talk show Content Score 64 We're so close, yet so far. Top Contributors TB 49 TMDb Bot k 7 kukiku123 7 Banana 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}