{"link": "https://www.themoviedb.org/tv/43257?language=en", "title": "Kaboul Kitchen", "resume": "Kaboul Kitchen is a French comedy television series broadcast by Canal+. It was created by Marc Victor, Allan Mauduit and Jean-Patrick Benes. The series is based on the true story of Radio France Internationale journalist Marc Victor, who ran a restaurant for French expatriates in Kabul until 2008. The first series premiered on February 15, 2012 on Canal+ and ended on March 5, 2012. It set a ratings record for comedy series in the primetime slot on Canal+. A second series, which will have 12 episodes, has been commissioned.\nThe series depicts the life of French expatriate Jacky who runs the popular restaurant Kaboul Kitchen in Kabul, Afghanistan. His daughter Sophie, who he has not seen in 20 years, arrives to do humanitarian work, while he is interested only in making money.\nThe series won two Golden FIPA Awards at the 2012 Festival International de Programmes Audiovisuels: one for Best TV Series and one for Best TV Screenplay. It was screened at MIPTV and named fourth on The Hollywood Reporter's list of \"MIPTV A-List Projects\" for the most promising series screened at the event.", "rate": 80, "genre": ["Comedy"], "cast": ["Stéphane De Groodt", "Stéphanie Pasterkamp", "Benjamin Bellecour", "Alexis Michalik", "Marc Citti"], "character": ["Michel Caulaincourt", "Sophie", "Axel", "Damien", "Victor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43257   Expand Kaboul Kitchen   (2012) User Score Overview Kaboul Kitchen is a French comedy television series broadcast by Canal+. It was created by Marc Victor, Allan Mauduit and Jean-Patrick Benes. The series is based on the true story of Radio France Internationale journalist Marc Victor, who ran a restaurant for French expatriates in Kabul until 2008. The first series premiered on February 15, 2012 on Canal+ and ended on March 5, 2012. It set a ratings record for comedy series in the primetime slot on Canal+. A second series, which will have 12 episodes, has been commissioned. The series depicts the life of French expatriate Jacky who runs the popular restaurant Kaboul Kitchen in Kabul, Afghanistan. His daughter Sophie, who he has not seen in 20 years, arrives to do humanitarian work, while he is interested only in making money. The series won two Golden FIPA Awards at the 2012 Festival International de Programmes Audiovisuels: one for Best TV Series and one for Best TV Screenplay. It was screened at MIPTV and named fourth on The Hollywood Reporter's list of \"MIPTV A-List Projects\" for the most promising series screened at the event. Featured Crew Marc Victor Creator Allan Mauduit Creator Jean-Patrick Benes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stéphane De Groodt Michel Caulaincourt Stéphanie Pasterkamp Sophie Benjamin Bellecour Axel Alexis Michalik Damien Marc Citti Victor Full Cast & Crew Last Season Season 3 2017 | 12 Episodes Season 3 of Kaboul Kitchen premiered on February 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2005-01-03 Kaamelott 8.0    2015-02-08 Better Call Saul 8.1    2011-12-04 Black Mirror 8.2    2013-02-01 House of Cards 8.2    2014-03-19 The 100 6.4    2015-05-27 Mr. Robot 7.8    2016-10-02 Westworld 8.1    2008-01-19 Breaking Bad 8.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  30m Homepage   http://www.canalplus.fr/series/pid4184-kaboul-kitchen.html Genres Comedy Keywords middle east restaurant afghanistan Content Score 93 Almost there... Top Contributors M 40 Manu 12 Elizabeth Jennings 7 EveDemocracy 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}