{"link": "https://www.themoviedb.org/tv/71725?language=en", "title": "Kevin", "resume": "One day while returning home to stay with his widowed twin sister and her daughter, Kevin Finn, a self-centered man whose life brings him more trouble than he bargained for, is recruited by a celestial being named Yvette, who enlists Kevin with a new purpose in his life, which is to save the world.", "rate": 73, "genre": ["Sci-Fi", "Fantasy", "Comedy", "Drama"], "cast": ["Jason Ritter", "Kimberly Hebert Gregory", "Chloe East", "JoAnna Garcia", "J. August Richards"], "character": ["Kevin", "Yvette", "Reese", "Amy", "Deputy Nathan Purcell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71725   Expand Kevin (Probably) Saves the World   (2017) User Score  Play Trailer Overview One day while returning home to stay with his widowed twin sister and her daughter, Kevin Finn, a self-centered man whose life brings him more trouble than he bargained for, is recruited by a celestial being named Yvette, who enlists Kevin with a new purpose in his life, which is to save the world. Featured Crew Michele Fazekas Creator Tara Butters Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Jason Ritter Kevin Kimberly Hebert Gregory Yvette Chloe East Reese JoAnna Garcia Amy J. August Richards Deputy Nathan Purcell Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Kevin (Probably) Saves the World premiered on October  2, 2017. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply I just can't stand this show any longer Open 7 by  sunnysfunny Canceled (thankfully) Open 0 by Moon Doggie\n      \n     a Passing of John Open 2 by  MDBAddict Go to Discussions Media Most Popular Videos  3 Backdrops  6 Posters  3 Recommendations   2017-10-03 The Mayor 6.7    2017-03-07 Andi Mack 7.6    2017-10-01 Ten Days in the Valley 6.0    2017-10-15 White Famous 5.9    2017-09-25 The Brave 6.6    2017-10-11 Dynasty 6.8    2017-10-02 The Gifted 7.0    2018-01-03 9-1-1 6.7  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/kevin-probably-saves-the-world Genres Sci-Fi & Fantasy Comedy Drama Keywords god prophet good deed Content Score 100 Yes! Looking good! Top Contributors 37 Warpath 27 Gabriel W. Almeida 26 Banana 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}