{"link": "https://www.themoviedb.org/tv/1684?language=en", "title": "Night Stalker", "resume": "Carl Kolchak and his partner Perri investigate the mysterious death of Kolchak's wife and the paranormal phenomena plaguing their city.", "rate": 27, "genre": ["Drama"], "cast": ["Stuart Townsend", "Gabrielle Union", "Eric Jungmann", "Cotter Smith"], "character": ["Carl Kolchak", "Perri Reed", "Jain McManus", "Tony Vincenzo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1684   Expand Night Stalker   (2005) User Score  Play Trailer Overview Carl Kolchak and his partner Perri investigate the mysterious death of Kolchak's wife and the paranormal phenomena plaguing their city. Featured Crew Frank Spotnitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stuart Townsend Carl Kolchak Gabrielle Union Perri Reed Eric Jungmann Jain McManus Cotter Smith Tony Vincenzo Full Cast & Crew Last Season Season 1 2005 | 10 Episodes Season 1 of Night Stalker premiered on September 29, 2005. View All Seasons Social Reviews  1 Discussions  0 A review by viciouslollipop Written by  viciouslollipop  on March 28, 2017 Not a bad show... I just recently watched the box set and enjoyed it very much. If you approach it from the angle that this is a different show(but with the same name as the old show-which I enjoyed)you can enjoy it on it's own merits. There was some unexplained and \"huh?\" type stuff going on, but getting canceled after 6 episodes will do that. I liked the leads, and there were spots of humor in the show(as dark as it was)if you were paying attention. Network TV is inane simply for the fact that they don't give us viewers a chance to get into shows anymore...remember when a show came on ever...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Night Stalker. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://abc.go.com/shows/night-stalker Genres Drama Keywords murder investigation crime reporter wife murder Content Score 100 Yes! Looking good! Top Contributors 10 Banana 3 rantamplan w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}