{"link": "https://www.themoviedb.org/tv/61268?language=en", "title": "A to Z", "resume": "The story follows the lives of Andrew, an employee at an internet dating site who dreams of meeting the girl of his dreams, and Zelda, a no-nonsense lawyer who was raised by a hippie mother and carries a rebellious streak. By an accidental chance of fate, Zelda meets Andrew to resolve a mismatch dating dispute and these two single people suddenly find themselves falling for each other.", "rate": 57, "genre": ["Comedy"], "cast": ["Ben Feldman", "Cristin Milioti", "Henry Zebrowski", "Lenora Crichlow", "Christina Kirk"], "character": ["Andrew", "Zelda", "Stu", "Stephie", "Lydia \"Big Bird\""], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61268   Expand A to Z   (2014) User Score  Play Trailer Overview The story follows the lives of Andrew, an employee at an internet dating site who dreams of meeting the girl of his dreams, and Zelda, a no-nonsense lawyer who was raised by a hippie mother and carries a rebellious streak. By an accidental chance of fate, Zelda meets Andrew to resolve a mismatch dating dispute and these two single people suddenly find themselves falling for each other. Featured Crew Ben Queen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Feldman Andrew Cristin Milioti Zelda Henry Zebrowski Stu Lenora Crichlow Stephie Christina Kirk Lydia \"Big Bird\" Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 1 2014 | 13 Episodes Season 1 of A to Z premiered on October  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2015-03-31 Weird Loners 5.8    2013-08-05 Quick Draw 6.3    2014-03-31 Friends with Better Lives 5.4    2014-09-30 Manhattan Love Story 6.2    2014-10-02 Bad Judge 6.1    2015-06-18 The Astronaut Wives Club 5.3    2014-09-30 Selfie 6.4    2015-01-13 Cockroaches 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/a-to-z Genres Comedy Keywords dating Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings 11 Banana M 6 Maxime84 4 Victor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}