{"link": "https://www.themoviedb.org/tv/73071?language=en", "title": "21 Thunder", "resume": "The story of the Montreal Thunder U21 (under-21) team, following the team's star players on and off the field. A story of love, crime, race, sex and athletic glory, at its core the series is about how a group of players and coaches unite as family in the whirlwind of life, one step away from the pros.", "rate": 58, "genre": ["Drama"], "cast": ["RJ Fetherstonhaugh", "Emmanuel Kabongo", "Andres Joseph", "Stephanie Bennett", "Ryan Pierce"], "character": ["Nolan Gallard", "Junior Lolo", "Alex el Haddadi", "Christy Cook", "Davey Gunn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73071   Expand 21 Thunder   (2017) User Score  Play Trailer Overview The story of the Montreal Thunder U21 (under-21) team, following the team's star players on and off the field. A story of love, crime, race, sex and athletic glory, at its core the series is about how a group of players and coaches unite as family in the whirlwind of life, one step away from the pros. Featured Crew Adrian Wills Creator Kenneth Hirsch Creator Riley Adams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast RJ Fetherstonhaugh Nolan Gallard Emmanuel Kabongo Junior Lolo Andres Joseph Alex el Haddadi Stephanie Bennett Christy Cook Ryan Pierce Davey Gunn Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of 21 Thunder premiered on July 31, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 21 Thunder. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbc.ca/21thunder/ Genres Drama Keywords soccer Content Score 100 Yes! Looking good! Top Contributors 46 Elizabeth Jennings 4 天之行者 a 3 atom100 m 3 michl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}