{"link": "https://www.themoviedb.org/tv/2702?language=en", "title": "Cybill", "resume": "Cybill is an American television sitcom created by Chuck Lorre, which aired on CBS from January 2, 1995, to July 13, 1998. Starring, Cybill Shepherd, the show revolves around the life of Cybill Sheridan, a twice-divorced single mother of two and struggling actress in her 40s, who has never gotten her big show business break. Alicia Witt and Dedee Pfeiffer co-starred as Sheridan's daughters, with Alan Rosenberg and Tom Wopat playing their fathers each, while Christine Baranski appeared as Cybill's hard-drinking friend Maryann.\nThe sitcom was produced by Carsey-Werner Productions and YBYL Productions, with Shepherd, Lorre, Howard Gould, Jay Daniel, Marcy Carsey and Tom Werner serving as the show's original executive producers. Broadcast to critical praise, Cybill was nominated for twelve Emmy Awards throughout its run and awarded the 1996 Golden Globe Award for Best Television Series – Musical or Comedy. Shepherd won a third Golden Globe Award for her performance, while Baranski received an Emmy, a SAG and an American Comedy Award.", "rate": 68, "genre": ["Comedy"], "cast": ["Cybill Shepherd", "Christine Baranski", "Alicia Witt", "Alan Rosenberg", "Tim Maculan"], "character": ["Cybill Sheridan", "Maryann Thorpe", "Zoey Woodbine", "Ira Woodbine", "Waiter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2702   Expand Cybill   (1995) User Score Overview Cybill is an American television sitcom created by Chuck Lorre, which aired on CBS from January 2, 1995, to July 13, 1998. Starring, Cybill Shepherd, the show revolves around the life of Cybill Sheridan, a twice-divorced single mother of two and struggling actress in her 40s, who has never gotten her big show business break. Alicia Witt and Dedee Pfeiffer co-starred as Sheridan's daughters, with Alan Rosenberg and Tom Wopat playing their fathers each, while Christine Baranski appeared as Cybill's hard-drinking friend Maryann. The sitcom was produced by Carsey-Werner Productions and YBYL Productions, with Shepherd, Lorre, Howard Gould, Jay Daniel, Marcy Carsey and Tom Werner serving as the show's original executive producers. Broadcast to critical praise, Cybill was nominated for twelve Emmy Awards throughout its run and awarded the 1996 Golden Globe Award for Best Television Series – Musical or Comedy. Shepherd won a third Golden Globe Award for her performance, while Baranski received an Emmy, a SAG and an American Comedy Award. Featured Crew Chuck Lorre Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cybill Shepherd Cybill Sheridan Christine Baranski Maryann Thorpe Alicia Witt Zoey Woodbine Alan Rosenberg Ira Woodbine Tim Maculan Waiter Full Cast & Crew Last Season Season 4 1997 | 24 Episodes Season 4 of Cybill premiered on September 15, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1996-09-19 Suddenly Susan 4.9    1980-11-27 Bosom Buddies 6.6    1970-09-24 The Odd Couple 7.1    2013-04-22 Rectify 7.6    2012-04-22 Veep 7.2    2012-06-24 The Newsroom 7.8    2000-10-15 Curb Your Enthusiasm 8.1    2006-10-11 30 Rock 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords los angeles single mother aspiring actor sitcom Content Score 93 Almost there... Top Contributors 11 Banana b 6 bugfix m 4 mEDI s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}