{"link": "https://www.themoviedb.org/tv/58237?language=en", "title": "Silver Spoon", "resume": "Yuugo Hachiken enrolled in Ooezo Agricultural High School for the reason that he could live in a dorm there. In some ways he chose Ooezo in an effort to escape the highly competitive prep schools he had attended previously, but he was faced with an entirely new set of difficulties at Oezo, surrounded by animals and Mother Nature. After growing up in an average family, he began to encounter clubs and training the likes of which he had never seen before.", "rate": 75, "genre": ["Animation"], "cast": ["Ryohei Kimura", "Marie Miyake", "Ayahi Takagaki", "Tooru Sakurai", "Nobunaga Shimazaki"], "character": ["Yuugo Hachiken (voice)", "Aki Mikage (voice)", "Tamako Inada (voice)", "Ichirou Komaba (voice)", "Shinnosuke Aikawa (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58237   Expand Silver Spoon   (2013) User Score Overview Yuugo Hachiken enrolled in Ooezo Agricultural High School for the reason that he could live in a dorm there. In some ways he chose Ooezo in an effort to escape the highly competitive prep schools he had attended previously, but he was faced with an entirely new set of difficulties at Oezo, surrounded by animals and Mother Nature. After growing up in an average family, he began to encounter clubs and training the likes of which he had never seen before. Featured Crew Tomohiko Itou Creator Taku Kishimoto Creator Kotomi Deai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryohei Kimura Yuugo Hachiken (voice) Marie Miyake Aki Mikage (voice) Ayahi Takagaki Tamako Inada (voice) Tooru Sakurai Ichirou Komaba (voice) Nobunaga Shimazaki Shinnosuke Aikawa (voice) Full Cast & Crew Last Season Season 2 2014 | 11 Episodes Season 2 of Silver Spoon premiered on January 31, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Silver Spoon. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2015-11-10 My Little Lover 6.3    2016-03-21 72 Dangerous Places to Live 6.0    2015-09-02 Atelier 7.2    2013-10-07 Non Non Biyori 8.0  Facts Original Name  銀の匙 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.ginsaji-anime.com Genres Animation Keywords high school agriculture farm life coming of age slice of life rural setting based on manga anime Content Score 93 Almost there... Top Contributors 47 Marr 🇳🇱 6 seboseboss m 6 mitnoi t 6 tmdb26811763  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}