{"link": "https://www.themoviedb.org/tv/77739?language=en", "title": "Bagani", "resume": "Bagani is the story of five normal individuals, namely Lakas, Ganda, Lakam, Dumakulem and Mayari, all belonging to the land called Sansinukob. Each one of the five individuals belongs to one of the five different regions that make up Sansinukob. Lakas who hails from the desert region of formidable warriors, Ganda coming from the farming region of land natives, Lakam born from the lush and rich trade region, Dumakulem comes from the strong hunters of the forest region and Mayari hailing from the coastlines of the aquatic region.  Each of the five has a particular skill that makes them a cut above the rest within the tribes they belong to. But apart from their great skill, it is the goodness of their hearts and willingness to sacrifice themselves for their people that made them worthy of the great weapons of power that their god Apo have bestowed on them, weapons they will need to fight off the monsters that the evil god Sarimaw has unleashed upon Sansinukob in his bid to conquer the land and the people living in it.  In their journey, they will find out how love can both be poison and cure that heals the heart and ultimately conquer the evils that lie among and within themselves.", "rate": 0, "genre": [], "cast": ["Enrique Gil", "Liza Soberano", "Matteo Guidicelli", "Sofia Andres", "Makisig Morales"], "character": ["Lakas", "Ganda", "Lakam", "Mayari", "Dumakulem"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77739   Expand Bagani   (2018) User Score Overview Bagani is the story of five normal individuals, namely Lakas, Ganda, Lakam, Dumakulem and Mayari, all belonging to the land called Sansinukob. Each one of the five individuals belongs to one of the five different regions that make up Sansinukob. Lakas who hails from the desert region of formidable warriors, Ganda coming from the farming region of land natives, Lakam born from the lush and rich trade region, Dumakulem comes from the strong hunters of the forest region and Mayari hailing from the coastlines of the aquatic region.  Each of the five has a particular skill that makes them a cut above the rest within the tribes they belong to. But apart from their great skill, it is the goodness of their hearts and willingness to sacrifice themselves for their people that made them worthy of the great weapons of power that their god Apo have bestowed on them, weapons they will need to fight off the monsters that the evil god Sarimaw has unleashed upon Sansinukob in his bid to conquer the land and the people living in it.  In their journey, they will find out how love can both be poison and cure that heals the heart and ultimately conquer the evils that lie among and within themselves. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Enrique Gil Lakas Liza Soberano Ganda Matteo Guidicelli Lakam Sofia Andres Mayari Makisig Morales Dumakulem Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Bagani premiered on March  5, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bagani. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Tagalog Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 20 jibberken A 6 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}