{"link": "https://www.themoviedb.org/tv/61520?language=en", "title": "Sanjay and Craig", "resume": "Sanjay and Craig is an American animated television series produced by Nickelodeon. The show is about a 12-year-old boy named Sanjay Patel who owns a talking pet snake named Craig.", "rate": 58, "genre": ["Family", "Animation", "Comedy"], "cast": ["Maulik Pancholy", "Chris Hardwick", "Linda Cardellini", "Grey DeLisle"], "character": ["Sanjay Patel (voice)", "Craig (voice)", "Megan Sparkles (voice)", "Darlene Patel (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61520   Expand Sanjay and Craig   (2013) User Score Overview Sanjay and Craig is an American animated television series produced by Nickelodeon. The show is about a 12-year-old boy named Sanjay Patel who owns a talking pet snake named Craig. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maulik Pancholy Sanjay Patel (voice) Chris Hardwick Craig (voice) Linda Cardellini Megan Sparkles (voice) Grey DeLisle Darlene Patel (voice) Full Cast & Crew Last Season Season 2 2014 | 30 Episodes Season 2 of Sanjay and Craig premiered on July 19, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-06-08 Sam & Cat 5.7  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   www.nick.com/sanjay-and-craig/ Genres Family Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 71 Serenity25 21 Elizabeth Jennings z 7 zurman1 TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}