{"link": "https://www.themoviedb.org/tv/4575?language=en", "title": "Lizzie McGuire", "resume": "Lizzie McGuire is an American live-action teen sitcom, which features an animated version of the title character performing soliloquy. The animated sequences were interspersed with the show's live-action sequences. It premiered on the Disney Channel on January 12, 2001 following the premiere of Zenon: The Zequel and ended February 14, 2004. A total of 65 episodes were produced and aired. Its target demographic was preteens and adolescents.\nThe series won Favorite TV Show at the Nickelodeon Kids' Choice Awards in 2002 and 2003.", "rate": 58, "genre": ["Comedy"], "cast": ["Hilary Duff", "Lalaine", "Adam Lamberg", "Jake Thomas", "Hallie Todd"], "character": ["Lizzie McGuire", "Miranda Sanchez", "David \"Gordo\" Gordon", "Matthew McGuire", "Jo McGuire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4575   Expand Lizzie McGuire   (2001) User Score Overview Lizzie McGuire is an American live-action teen sitcom, which features an animated version of the title character performing soliloquy. The animated sequences were interspersed with the show's live-action sequences. It premiered on the Disney Channel on January 12, 2001 following the premiere of Zenon: The Zequel and ended February 14, 2004. A total of 65 episodes were produced and aired. Its target demographic was preteens and adolescents. The series won Favorite TV Show at the Nickelodeon Kids' Choice Awards in 2002 and 2003. Featured Crew Terri Minsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Hilary Duff Lizzie McGuire Lalaine Miranda Sanchez Adam Lamberg David \"Gordo\" Gordon Jake Thomas Matthew McGuire Hallie Todd Jo McGuire Full Cast & Crew Last Season Season 2 2002 | 34 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Lizzie: Happy Birthday Hilary Duff! Open 0 by wonder2wonder\n      \n     w Gordo: Happy Birthday Adam Lamberg! Open 0 by wonder2wonder\n      \n     S Lizzie's first kiss Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2003-01-17 That's So Raven 5.6    1999-10-16 The Amanda Show 5.2    1996-07-15 Kenan & Kel 7.4    2006-03-24 Hannah Montana 5.0    2004-06-18 Phil of the Future 7.0    2000-06-17 Even Stevens 7.6    1996-09-02 Arthur 6.7    2004-01-11 Drake & Josh 7.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords teenager Content Score 100 Yes! Looking good! Top Contributors 13 Jason Patrick 7 Banana 4 dgw c 3 chaynick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}