{"link": "https://www.themoviedb.org/tv/70508?language=en", "title": "Five Came Back", "resume": "The extraordinary story of how Hollywood changed World War II – and how World War II changed Hollywood, through the interwoven experiences of five legendary filmmakers who went to war to serve their country and bring the truth to the American people: John Ford, William Wyler, John Huston, Frank Capra, and George Stevens. Based on Mark Harris’ best-selling book, “Five Came Back: A Story of Hollywood and the Second World War.”", "rate": 78, "genre": ["Documentary"], "cast": ["Meryl Streep", "Steven Spielberg", "Lawrence Kasdan", "Francis Ford Coppola", "Paul Greengrass"], "character": ["Narrator (voice)", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70508   Expand Five Came Back   (2017) User Score  Play Trailer Overview The extraordinary story of how Hollywood changed World War II – and how World War II changed Hollywood, through the interwoven experiences of five legendary filmmakers who went to war to serve their country and bring the truth to the American people: John Ford, William Wyler, John Huston, Frank Capra, and George Stevens. Based on Mark Harris’ best-selling book, “Five Came Back: A Story of Hollywood and the Second World War.” Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Meryl Streep Narrator (voice) Steven Spielberg Himself Lawrence Kasdan Himself Francis Ford Coppola Himself Paul Greengrass Himself Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Five Came Back premiered on March 31, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2013-03-18 Top of the Lake 7.1    2017-03-31 13 Reasons Why 7.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   https://www.netflix.com/title/80049928 Genres Documentary Keywords movie business world war ii hollywood Content Score 93 Almost there... Top Contributors 41 Elizabeth Jennings 20 J. s 15 shiff7 6 camac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}