{"link": "https://www.themoviedb.org/tv/1060?language=en", "title": "Jeeves and Wooster", "resume": "Jeeves and Wooster is a British comedy-drama series adapted by Clive Exton from P.G. Wodehouse's \"Jeeves\" stories. The series was a collaboration between Brian Eastman of Picture Partnership Productions and Granada Television.\nIt aired on the ITV network from 1990 to 1993, with the last series nominated for a British Academy Television Award for Best Drama Series. It starred Hugh Laurie as Bertie Wooster, a young gentleman with a \"distinctive blend of airy nonchalance and refined gormlessness\", and Stephen Fry as Jeeves, his improbably well-informed and talented valet. Wooster is a bachelor, a minor aristocrat and member of the idle rich. He and his friends, who are mainly members of The Drones Club, are extricated from all manner of societal misadventures by the indispensable valet, Jeeves. The stories are set in the United Kingdom and the United States in the 1930s.\nWhen Fry and Laurie began the series they were already a popular double act due to regular appearances on Channel 4's Friday Night Live and their own show A Bit of Fry & Laurie.\nIn the television documentary, Fry and Laurie Reunited, upon reminiscing about their involvement in the series, it was revealed that they were initially reluctant to play the part of Jeeves and Wooster but decided to do so in the end because they felt no one else would do the parts justice.", "rate": 77, "genre": ["Comedy"], "cast": ["Hugh Laurie", "Stephen Fry"], "character": ["Bertie Wooster", "Jeeves"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1060   Expand Jeeves and Wooster   (1990) User Score  Play Trailer Overview Jeeves and Wooster is a British comedy-drama series adapted by Clive Exton from P.G. Wodehouse's \"Jeeves\" stories. The series was a collaboration between Brian Eastman of Picture Partnership Productions and Granada Television. It aired on the ITV network from 1990 to 1993, with the last series nominated for a British Academy Television Award for Best Drama Series. It starred Hugh Laurie as Bertie Wooster, a young gentleman with a \"distinctive blend of airy nonchalance and refined gormlessness\", and Stephen Fry as Jeeves, his improbably well-informed and talented valet. Wooster is a bachelor, a minor aristocrat and member of the idle rich. He and his friends, who are mainly members of The Drones Club, are extricated from all manner of societal misadventures by the indispensable valet, Jeeves. The stories are set in the United Kingdom and the United States in the 1930s. When Fry and Laurie began the series they were already a popular double act due to regular appearances on Channel 4's Friday Night Live and their own show A Bit of Fry & Laurie. In the television documentary, Fry and Laurie Reunited, upon reminiscing about their involvement in the series, it was revealed that they were initially reluctant to play the part of Jeeves and Wooster but decided to do so in the end because they felt no one else would do the parts justice. Featured Crew Clive Exton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Laurie Bertie Wooster Stephen Fry Jeeves Full Cast & Crew Last Season Season 4 1993 | 6 Episodes Season 4 of Jeeves and Wooster premiered on May 16, 1993. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Bertie: Happy Birthday Hugh Laurie! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  6 Recommendations   1989-01-13 A Bit of Fry and Laurie 8.0    1987-09-13 The New Statesman 7.9    1983-10-03 Terrahawks 6.0    1986-01-10 Lovejoy 8.0    1990-10-29 Keeping Up Appearances 7.4    2002-09-06 Still Game 8.6    1994-11-04 Harry Enfield and Chums 7.8    2004-09-03 Green Wing 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  55m, 60m, 50m Homepage  - Genres Comedy Keywords servant bachelor period drama valet upstairs downstairs british humour 1930s domestic worker Content Score 71 Just a little bit more... Top Contributors 10 Banana PG 9 Pavel Gladilov 4 Gustav O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}