{"link": "https://www.themoviedb.org/tv/64383?language=en", "title": "London Spy", "resume": "Danny is a gregarious, hedonistic romantic who gets drawn into the dangerous world of British espionage in this contemporary, emotional thriller. He falls for the anti-social but enigmatic Alex, both from opposite worlds, and they soon realise they’re perfect for each other. But when Alex suddenly disappears, Danny is utterly ill-equipped to take on his complex and codified world. Young, innocent and adrift he needs to decide whether he’s prepared to fight for the truth?", "rate": 71, "genre": ["Drama"], "cast": ["Ben Whishaw", "Harriet Walter", "Samantha Spiro", "Jim Broadbent", "Edward Holcroft"], "character": ["Danny", "Claire", "Detective Taylor", "Scottie", "Alex"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64383   Expand London Spy   (2015) User Score  Play Trailer Overview Danny is a gregarious, hedonistic romantic who gets drawn into the dangerous world of British espionage in this contemporary, emotional thriller. He falls for the anti-social but enigmatic Alex, both from opposite worlds, and they soon realise they’re perfect for each other. But when Alex suddenly disappears, Danny is utterly ill-equipped to take on his complex and codified world. Young, innocent and adrift he needs to decide whether he’s prepared to fight for the truth? Featured Crew Tom Rob Smith Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Whishaw Danny Harriet Walter Claire Samantha Spiro Detective Taylor Jim Broadbent Scottie Edward Holcroft Alex Full Cast & Crew Last Season Season 1 2015 | 5 Episodes Season 1 of London Spy premiered on November  8, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply SB (SPOILERS) S1 - A somewhat naive premise Open 0 by Glen Griffiths\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2013-02-28 Please Like Me 7.6    2016-05-26 Neil Gaiman's Likely Stories 5.8    2013-03-17 In the Flesh 7.4    2004-10-13 Border Security: Australia's Front Line 6.3    2008-10-09 Saturday Night Live Weekend Update Thursday 7.0    2015-11-24 Capital 7.5    2016-10-31 Dark Angel 6.3    2007-09-24 The Sarah Jane Adventures 7.4  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b06pmnwn Genres Drama Keywords london england spy gay man Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings TB 16 TMDb Bot 12 EveDemocracy 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}