{"link": "https://www.themoviedb.org/tv/64482?language=en", "title": "Game of Silence", "resume": "A successful Atlanta attorney's long-lost childhood friends unexpectedly reappear after 25 years. When a dark secret they thought they'd buried resurfaces, the brotherhood bands together to right the wrongs of their shared past - a journey that will push the limits of their loyalty and quench their thirst for revenge.", "rate": 43, "genre": ["Drama"], "cast": ["David Lyons", "Michael Raymond-James", "Larenz Tate", "Bre Blair", "Claire van der Boom"], "character": ["Jackson Brooks", "Gil Harris", "Shawn Polk", "Jessie West", "Marina Nagle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64482   Expand Game of Silence   (2016) User Score  Play Trailer Overview A successful Atlanta attorney's long-lost childhood friends unexpectedly reappear after 25 years. When a dark secret they thought they'd buried resurfaces, the brotherhood bands together to right the wrongs of their shared past - a journey that will push the limits of their loyalty and quench their thirst for revenge. Featured Crew David Hudgins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Lyons Jackson Brooks Michael Raymond-James Gil Harris Larenz Tate Shawn Polk Bre Blair Jessie West Claire van der Boom Marina Nagle Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Game of Silence premiered on April 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2016-03-15 Crowded 6.4    2015-10-27 Wicked City 5.4    2015-01-13 Cockroaches 6.0    2016-06-05 Feed the Beast 6.2    2011-06-15 Happily Divorced 5.7    2016-03-07 Damien 6.5    2016-01-13 Second Chance 6.5    2016-03-03 The Family 6.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/game-of-silence Genres Drama Keywords secret male friendship revenge murder organized crime conspiracy lawyer childhood friends abuse Content Score 100 Yes! Looking good! Top Contributors 27 Banana 19 United600 13 thecrgs 13 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}