{"link": "https://www.themoviedb.org/tv/7406?language=en", "title": "All Creatures Great and Small", "resume": "All Creatures Great and Small is a British television series, based on the books of the British veterinary surgeon Alf Wight, who wrote under the pseudonym James Herriot. Ninety episodes were aired over two three-year runs. The first run was based directly on Herriot's books; the second was filmed with original scripts.", "rate": 84, "genre": ["Comedy", "Drama"], "cast": ["Lynda Bellingham", "Peter Davison", "Carol Drinkwater", "Mary Hignett", "James Grout"], "character": ["Helen Herriot", "Tristan Farnon", "Helen", "Mrs. Hall", "Granville Bennett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7406   Expand All Creatures Great and Small   (1978) User Score Overview All Creatures Great and Small is a British television series, based on the books of the British veterinary surgeon Alf Wight, who wrote under the pseudonym James Herriot. Ninety episodes were aired over two three-year runs. The first run was based directly on Herriot's books; the second was filmed with original scripts. Featured Crew Bill Sellars Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lynda Bellingham Helen Herriot Peter Davison Tristan Farnon Carol Drinkwater Helen Mary Hignett Mrs. Hall James Grout Granville Bennett Full Cast & Crew Last Season Season 7 1990 | 13 Episodes Season 7 of All Creatures Great and Small premiered on September  1, 1990. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply RIP Robert Hardy Open 1 by  wonder2wonder w Helen Herriot: Happy Birthday Carol Drinkwater! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1993-02-21 Lipstick on Your Collar 7.3    1983-10-03 Scarecrow and Mrs. King 5.5    1985-03-15 Mr. Belvedere 6.8    1984-03-19 Kate & Allie 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Comedy Drama Keywords country life yorkshire based on memoir or autobiography cornwall england vetrinarian Content Score 93 Almost there... Top Contributors O 9 Ogopogo99 PE 7 Patrick E. Abe m 3 milanbb f 3 frankoff  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}