{"link": "https://www.themoviedb.org/tv/60760?language=en", "title": "Air Disasters", "resume": "Harrowing stories of tragedy and triumph are brought to life through official reports, transcripts and interviews with the pilots, air traffic controllers and lucky survivors of history's most terrifying crashes. Widely considered to be the safest form of travel, air transportation is still in its infancy and when midair calamity strikes, the results are often catastrophic. From the cockpit to the cabin, from the control room to the crash scene, we uncover just what went wrong.", "rate": 70, "genre": ["Action", "Adventure"], "cast": ["Stephen Bogaert"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60760   Expand Air Disasters   (2011) User Score Overview Harrowing stories of tragedy and triumph are brought to life through official reports, transcripts and interviews with the pilots, air traffic controllers and lucky survivors of history's most terrifying crashes. Widely considered to be the safest form of travel, air transportation is still in its infancy and when midair calamity strikes, the results are often catastrophic. From the cockpit to the cabin, from the control room to the crash scene, we uncover just what went wrong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Bogaert Narrator Full Cast & Crew Last Season Season 4 2014 | 13 Episodes Season 4 of Air Disasters premiered on April 27, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Excellent documentary/docudrama series Open 0 by Moon Doggie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Air Disasters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  45m Homepage   http://www.smithsonianchannel.com/sc/web/series/802/air-disasters Genres Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings TB 5 TMDb Bot CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}