{"link": "https://www.themoviedb.org/tv/638?language=en", "title": "Once and Again", "resume": "Once and Again is an American television series that aired on ABC from September 21, 1999 to April 15, 2002. It depicts the family of a single mother and her romance with a single father. It was created by Marshall Herskovitz and Edward Zwick, the same team that created thirtysomething and produced My So-Called Life.\nOne of the show's unique aspects was the \"interview\" sequences filmed in black and white and interspersed throughout each episode, where the characters would reveal their innermost thoughts and memories to the camera.", "rate": 67, "genre": ["Drama"], "cast": ["Sela Ward", "Billy Campbell", "Julia Whelan", "Meredith Deane", "Marin Hinkle"], "character": ["Lily Manning", "Judy Brooks"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 638   Expand Once and Again   (1999) User Score Overview Once and Again is an American television series that aired on ABC from September 21, 1999 to April 15, 2002. It depicts the family of a single mother and her romance with a single father. It was created by Marshall Herskovitz and Edward Zwick, the same team that created thirtysomething and produced My So-Called Life. One of the show's unique aspects was the \"interview\" sequences filmed in black and white and interspersed throughout each episode, where the characters would reveal their innermost thoughts and memories to the camera. Featured Crew Marshall Herskovitz Creator Edward Zwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sela Ward Lily Manning Billy Campbell Julia Whelan Meredith Deane Marin Hinkle Judy Brooks Full Cast & Crew Last Season Season 3 2001 | 19 Episodes Season 3 of Once and Again premiered on September 28, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  1 Recommendations   1989-04-23 Baywatch 5.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords family blended family Content Score 93 Almost there... Top Contributors 4 Banana R 3 Rebecca s 3 speedycars 2 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}