{"link": "https://www.themoviedb.org/tv/50971?language=en", "title": "Backstrom", "resume": "Detective Lieutenant Everett Backstrom is a man with no filter. After a five-year exile to the traffic division for offensive behavior, he has returned from disgrace to lead Portland's newly minted S.C.U. Tasked with navigating the city's most sensitive and serious cases, he must solve each crime as he tries, and fails, to change his own self-destructive behavior. Based on renowned Swedish criminologist and novelist Leif G.W. Persson’s hit series of books of the same name.", "rate": 64, "genre": ["Crime", "Drama"], "cast": ["Rainn Wilson", "Beatrice Rosen", "Dennis Haysbert", "Genevieve Angelson", "Kristoffer Polaha"], "character": ["Det. Lt. Backstrom", "Nadia Paquet", "Det. Sgt. Almond", "Det. Gravely", "Sgt. Niedermayer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50971   Expand Backstrom   (2015) User Score Overview Detective Lieutenant Everett Backstrom is a man with no filter. After a five-year exile to the traffic division for offensive behavior, he has returned from disgrace to lead Portland's newly minted S.C.U. Tasked with navigating the city's most sensitive and serious cases, he must solve each crime as he tries, and fails, to change his own self-destructive behavior. Based on renowned Swedish criminologist and novelist Leif G.W. Persson’s hit series of books of the same name. Featured Crew Hart Hanson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rainn Wilson Det. Lt. Backstrom Beatrice Rosen Nadia Paquet Dennis Haysbert Det. Sgt. Almond Genevieve Angelson Det. Gravely Kristoffer Polaha Sgt. Niedermayer Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Backstrom premiered on January 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations   2015-01-22 Banana 7.8    2015-04-08 Your Family or Mine 4.6    2015-01-22 Cucumber 7.9    2014-09-30 Happyland 3.3    1986-09-17 Filmation's Ghostbusters 5.7    2017-08-04 Wet Hot American Summer: 10 Years Later 6.8    2014-07-17 Satisfaction 5.0    2012-10-11 Copper 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.fox.com/backstrom/ Genres Crime Drama Keywords based on novel or book self-destruction portland police detective misanthropic Content Score 93 Almost there... Top Contributors 39 Elizabeth Jennings TB 13 TMDb Bot 12 Banana m 6 maxtherabbit  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}