{"link": "https://www.themoviedb.org/tv/62456?language=en", "title": "You, Me and the Apocalypse", "resume": "When the news is announced that a comet is on an unavoidable collision course with Earth, the most hilarious and unexpected chain of events imaginable is set in motion.", "rate": 72, "genre": ["Drama", "Comedy"], "cast": ["Mathew Baynton", "Jenna Fischer", "Rob Lowe", "Joel Fry", "Megan Mullally"], "character": ["Jamie Winton / Ariel Conroy", "Rhonda McNeil", "Father Jude Sutton", "Dave Bosley", "Leanne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62456   Expand You, Me and the Apocalypse   (2015) User Score  Play Trailer Overview When the news is announced that a comet is on an unavoidable collision course with Earth, the most hilarious and unexpected chain of events imaginable is set in motion. Featured Crew Iain Hollands Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mathew Baynton Jamie Winton / Ariel Conroy Jenna Fischer Rhonda McNeil Rob Lowe Father Jude Sutton Joel Fry Dave Bosley Megan Mullally Leanne Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of You, Me and the Apocalypse premiered on September 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2014-11-23 Remember Me 6.7    2012-08-30 Good Cop 6.6    2006-01-01 In Justice 6.8    2016-04-25 Flowers 6.7    2013-08-25 What Remains 7.1    2011-06-05 Case Histories 8.2    2007-08-05 The Company 7.0    2015-04-15 The Delivery Man 6.5  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.sky.com/tv/show/you-me-and-the-apocalypse Genres Drama Comedy Keywords vatican comet end of the world priest apocalypse missing wife Content Score 100 Yes! Looking good! Top Contributors 23 Elizabeth Jennings t 15 tmdb48730457 15 Ash 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}