{"link": "https://www.themoviedb.org/tv/71897?language=en", "title": "Lovers in Bloom", "resume": "Moo Goong Hwa is a former boxer. After the death of her husband, she has raised her daughter alone. She now works as a police officer. Meanwhile, Cha Tae Jin is an elite police officer who graduated from the police university. He is full of justice.", "rate": 49, "genre": ["Family", "Drama"], "cast": ["Im Soo-hyang", "Do Ji-han", "Lee Chang-Wook", "Lee Eun-Hyung", "Nam Bo-ra"], "character": ["Moo Goong-Hwa", "Cha Tae-Jin", "Jin Do-Hyun", "Moo Soo-Hyuk", "Jin Bo-Ra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71897   Expand Lovers in Bloom   (2017) User Score Overview Moo Goong Hwa is a former boxer. After the death of her husband, she has raised her daughter alone. She now works as a police officer. Meanwhile, Cha Tae Jin is an elite police officer who graduated from the police university. He is full of justice. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Im Soo-hyang Moo Goong-Hwa Do Ji-han Cha Tae-Jin Lee Chang-Wook Jin Do-Hyun Lee Eun-Hyung Moo Soo-Hyuk Nam Bo-ra Jin Bo-Ra Full Cast & Crew Last Season Season 1 2017 | 120 Episodes Season 1 of Lovers in Bloom premiered on May 29, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2017-08-14 The King's Woman 4.3  Facts Original Name  무궁화 꽃이 피었습니다 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/loversinbloom/ Genres Family Drama Keywords romance korea Content Score 93 Almost there... Top Contributors M 37 Maria180493 2 rus4me n 2 nubie TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}