{"link": "https://www.themoviedb.org/tv/18156?language=en", "title": "Emma", "resume": "Nothing delights Emma more than meddling in the love lives of others. But when she takes protege Harriet Smith under her wing, her plans can only end in disaster...", "rate": 77, "genre": ["Drama"], "cast": ["Romola Garai", "Michael Gambon", "Jonny Lee Miller", "Tamsin Greig", "Jodhi May"], "character": ["Emma Woodhouse", "Mr. Woodhouse", "George Knightley", "Miss Bates", "Mrs. Weston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18156   Expand Emma   (2009) User Score Overview Nothing delights Emma more than meddling in the love lives of others. But when she takes protege Harriet Smith under her wing, her plans can only end in disaster... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Romola Garai Emma Woodhouse Michael Gambon Mr. Woodhouse Jonny Lee Miller George Knightley Tamsin Greig Miss Bates Jodhi May Mrs. Weston Full Cast & Crew Last Season Season 1 2009 | 4 Episodes Season 1 of Emma premiered on October  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  9 Recommendations   2008-01-01 Sense and Sensibility 7.7    2004-11-14 North & South 8.2    2013-12-26 Death Comes to Pemberley 6.8    2008-09-03 Lost in Austen 7.2    1999-11-28 Wives and Daughters 7.3    2006-09-24 Jane Eyre 7.5    2008-09-14 Tess of the D'Urbervilles 7.4    1994-04-10 Middlemarch 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00n8s6x Genres Drama Keywords england miniseries costume drama 19th century Content Score 86 Almost there... Top Contributors TB 26 TMDb Bot 12 Banana 8 Elizabeth Jennings K 4 Kevin.Wood  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}