{"link": "https://www.themoviedb.org/tv/3048?language=en", "title": "In the Night Garden", "resume": "In the Night Garden is a magical place that exists between the waking and sleeping imagination of children close to the representation of a nursery rhyme.", "rate": 50, "genre": ["Kids"], "cast": ["Derek Jacobi", "Nick Kellington", "Andy Wareham", "Rebecca Hyland", "Isaac Blake"], "character": ["Tombliboo Unn", "Upsy Daisy", "Tombliboo Ooo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3048   Expand In the Night Garden   (2007) User Score Overview In the Night Garden is a magical place that exists between the waking and sleeping imagination of children close to the representation of a nursery rhyme. Featured Crew Andrew Davenport Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Jacobi Nick Kellington Andy Wareham Tombliboo Unn Rebecca Hyland Upsy Daisy Isaac Blake Tombliboo Ooo Full Cast & Crew Last Season Season 1 2007 | 100 Episodes Season 1 of In the Night Garden premiered on March 19, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In the Night Garden. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.inthenightgarden.co.uk/ Genres Kids Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 4 Rebecca d 3 duck 1 hayfield 1 Damien Haynes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}