{"link": "https://www.themoviedb.org/tv/1473?language=en", "title": "Earth 2", "resume": "Earth 2 is an American science fiction television series which aired on NBC from November 6, 1994 to June 4, 1995. The show was canceled after one season of 22 episodes. It follows the journey and settlement of a small expeditionary group called the Eden Project, with the intent to journey to an Earth-like planet called G889 in an attempt to find a cure to an illness called \"the syndrome\". The series was created by Michael Duggan, Carol Flint, Mark Levin, and Billy Ray, produced by Amblin Entertainment and Universal Television, and filmed primarily in northern New Mexico around the Santa Fe area. The series' music was composed by David Bergeaud, and the executive producers were Michael Duggan, Mark Levin, and Carol Flint.\nInitially, the show's audience was quite large, reaching eighth place; however, by April 23 of the next year, Nielsen ratings share had dropped from 23% to 9%. During its run, it had been nominated for a Primetime Emmy, Saturn, and other awards. In 2005, the entire series was released on DVD in a 4-disc set.", "rate": 72, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Rebecca Gayheart", "Debrah Farentino", "Sullivan Walker", "Clancy Brown", "Joey Zimmerman"], "character": ["Bess Martin", "Devon Adair", "Yale", "John Danziger", "Ulises Adair"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1473   Expand Earth 2   (1994) User Score  Play Trailer Overview Earth 2 is an American science fiction television series which aired on NBC from November 6, 1994 to June 4, 1995. The show was canceled after one season of 22 episodes. It follows the journey and settlement of a small expeditionary group called the Eden Project, with the intent to journey to an Earth-like planet called G889 in an attempt to find a cure to an illness called \"the syndrome\". The series was created by Michael Duggan, Carol Flint, Mark Levin, and Billy Ray, produced by Amblin Entertainment and Universal Television, and filmed primarily in northern New Mexico around the Santa Fe area. The series' music was composed by David Bergeaud, and the executive producers were Michael Duggan, Mark Levin, and Carol Flint. Initially, the show's audience was quite large, reaching eighth place; however, by April 23 of the next year, Nielsen ratings share had dropped from 23% to 9%. During its run, it had been nominated for a Primetime Emmy, Saturn, and other awards. In 2005, the entire series was released on DVD in a 4-disc set. Featured Crew Billy Ray Creator Carol Flint Creator Michael Duggan Creator Mark Levin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rebecca Gayheart Bess Martin Debrah Farentino Devon Adair Sullivan Walker Yale Clancy Brown John Danziger Joey Zimmerman Ulises Adair Full Cast & Crew Last Season Season 1 1994 | 22 Episodes Season 1 of Earth 2 premiered on November  6, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply why  it ended Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   Silver Surfer: The Animated Series 7.7    1977-02-10 The New Adventures of Batman 6.0    1955-10-03 Captain Kangaroo 6.4    1997-10-06 Earth: Final Conflict 6.8    1998-09-09 First Wave 6.6    1996-09-21 Dark Skies 7.6    1961-10-02 Ben Casey 6.5    1985-09-07 The Super Powers Team: Galactic Guardians 8.0  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords future post-apocalyptic space colony space alien planet Content Score 100 Yes! Looking good! Top Contributors 10 Abejo 9 Banana N 7 Nokcom 7 galani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}