{"link": "https://www.themoviedb.org/tv/31389?language=en", "title": "Republic of Doyle", "resume": "Republic of Doyle is a Canadian comedy-drama television series set in St. John's, Newfoundland which debuted 6 January 2010 on CBC Television.\nThe show stars Seán McGinley and Allan Hawco as Malachy and Jake Doyle, a father and son who partner as private investigators in St. John's, Newfoundland and Labrador. Their cases involve them in all sorts of dealings – not all of them on the right side of the law.", "rate": 73, "genre": ["Comedy", "Drama"], "cast": ["Sean McGinley", "Allan Hawco", "Krystin Pellerin", "Lynda Boyd", "Mark O'Brien"], "character": ["Malachy Doyle", "Jake Doyle", "Leslie Bennett", "Rose Miller", "Des Courtney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31389   Expand Republic of Doyle   (2010) User Score Overview Republic of Doyle is a Canadian comedy-drama television series set in St. John's, Newfoundland which debuted 6 January 2010 on CBC Television. The show stars Seán McGinley and Allan Hawco as Malachy and Jake Doyle, a father and son who partner as private investigators in St. John's, Newfoundland and Labrador. Their cases involve them in all sorts of dealings – not all of them on the right side of the law. Featured Crew Allan Hawco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sean McGinley Malachy Doyle Allan Hawco Jake Doyle Krystin Pellerin Leslie Bennett Lynda Boyd Rose Miller Mark O'Brien Des Courtney Full Cast & Crew Last Season Season 6 2014 | 10 Episodes Season 6 of Republic of Doyle premiered on October 15, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  1 Recommendations   2016-11-27 Pacific Heat 5.1    2010-07-11 The Glades 6.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.cbc.ca/republicofdoyle/ Genres Comedy Drama Keywords canada parent child relationship newfoundland private investigator private detective Content Score 93 Almost there... Top Contributors 12 Banana 9 Damien Haynes 8 CouchTater a 5 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}