{"link": "https://www.themoviedb.org/tv/1925?language=en", "title": "That Girl", "resume": "That Girl is an American sitcom that ran on ABC from 1966 to 1971. It stars Marlo Thomas as the title character Ann Marie, an aspiring actress, who moves from her hometown of Brewster, New York to try to make it big in New York City. Ann has to take a number of offbeat \"temp\" jobs to support herself in between her various auditions and bit parts. Ted Bessell played her boyfriend Donald Hollinger, a writer for Newsview Magazine; Lew Parker and Rosemary DeCamp played Lew Marie and Helen Marie, her concerned parents. Bernie Kopell, Ruth Buzzi and Reva Rose played Ann and Donald's friends. That Girl was developed by writers Bill Persky and Sam Denoff, who had served as head writers on The Dick Van Dyke Show earlier in the 1960s.", "rate": 67, "genre": ["Comedy"], "cast": ["Marlo Thomas", "Ted Bessell", "Lew Parker"], "character": ["Ann Marie", "Donald Hollinger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1925   Expand That Girl   (1966) User Score Overview That Girl is an American sitcom that ran on ABC from 1966 to 1971. It stars Marlo Thomas as the title character Ann Marie, an aspiring actress, who moves from her hometown of Brewster, New York to try to make it big in New York City. Ann has to take a number of offbeat \"temp\" jobs to support herself in between her various auditions and bit parts. Ted Bessell played her boyfriend Donald Hollinger, a writer for Newsview Magazine; Lew Parker and Rosemary DeCamp played Lew Marie and Helen Marie, her concerned parents. Bernie Kopell, Ruth Buzzi and Reva Rose played Ann and Donald's friends. That Girl was developed by writers Bill Persky and Sam Denoff, who had served as head writers on The Dick Van Dyke Show earlier in the 1960s. Featured Crew Bill Persky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marlo Thomas Ann Marie Ted Bessell Donald Hollinger Lew Parker Full Cast & Crew Last Season Season 5 1970 | 24 Episodes Season 5 of That Girl premiered on September 25, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1954-10-03 Father Knows Best 8.6    1963-09-18 The Patty Duke Show 5.6    1969-09-17 The Courtship of Eddie's Father 6.2    1960-09-29 My Three Sons 6.0    1958-09-24 The Donna Reed Show 6.7    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1953-09-29 The Danny Thomas Show 7.3    1968-09-28 The Ghost & Mrs. Muir 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 3 Daemon 3 lineker 2 Steve 1 genplant29  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}