{"link": "https://www.themoviedb.org/tv/4603?language=en", "title": "Faerie Tale Theatre", "resume": "Faerie Tale Theatre is a live-action children's television anthology series retelling popular fairy tales. Shelley Duvall serves as narrator, host and executive producer of the program, and occasionally stars in episodes. The series was followed by another, shorter series called Tall Tales & Legends which followed the same format as Faerie Tale Theatre and focused on classic American folk tales. Both series feature well known actors and directors, and were inspired by the children's television series Shirley Temple's Storybook.\nFaerie Tale Theatre originally aired on Showtime from 1982 to 1987. It later aired as edited re-runs on the Disney Channel as well as in syndication on various television stations, including PBS and BookTelevision.", "rate": 81, "genre": ["Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4603   Expand Faerie Tale Theatre   (1982) User Score Overview Faerie Tale Theatre is a live-action children's television anthology series retelling popular fairy tales. Shelley Duvall serves as narrator, host and executive producer of the program, and occasionally stars in episodes. The series was followed by another, shorter series called Tall Tales & Legends which followed the same format as Faerie Tale Theatre and focused on classic American folk tales. Both series feature well known actors and directors, and were inspired by the children's television series Shirley Temple's Storybook. Faerie Tale Theatre originally aired on Showtime from 1982 to 1987. It later aired as edited re-runs on the Disney Channel as well as in syndication on various television stations, including PBS and BookTelevision. Featured Crew Shelley Duvall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 1987 | 3 Episodes Season 6 of Faerie Tale Theatre premiered on March 23, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Episodes can be found on YouTube! Open 0 by theburbs\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1977-03-15 Eight Is Enough 5.9    1997-03-31 Teletubbies 2.8    1990-07-05 Blossom 5.8    1978-11-03 Diff'rent Strokes 5.7    1982-10-02 Newhart 7.4    1972-09-14 The Waltons 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 26 lineker 6 SasparillaGodzilla z 5 zurman1 p 2 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}