{"link": "https://www.themoviedb.org/tv/5383?language=en", "title": "Alien Nation", "resume": "Alien Nation is a science fiction television series, loosely based on the movie of the same name. Gary Graham starred as Detective Matthew Sikes, a Los Angeles police officer reluctantly working with \"Newcomer\" alien George Francisco, played by Eric Pierpoint. Sikes also has an on again-off again flirtation with a female Newcomer, Cathy Frankel, played by Terri Treas.\nTV Guide included the series in their 2013 list of 60 shows that were \"Cancelled Too Soon\".", "rate": 69, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Michele Scarabelli", "Ron Fassler", "Gary Graham", "Jeff Marcus", "Eric Pierpoint"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5383   Expand Alien Nation   (1989) User Score Overview Alien Nation is a science fiction television series, loosely based on the movie of the same name. Gary Graham starred as Detective Matthew Sikes, a Los Angeles police officer reluctantly working with \"Newcomer\" alien George Francisco, played by Eric Pierpoint. Sikes also has an on again-off again flirtation with a female Newcomer, Cathy Frankel, played by Terri Treas. TV Guide included the series in their 2013 list of 60 shows that were \"Cancelled Too Soon\". Featured Crew Kenneth Johnson Creator Rockne S. O'Bannon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  13 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michele Scarabelli Ron Fassler Gary Graham Jeff Marcus Eric Pierpoint Full Cast & Crew Last Season Season 1 1989 | 22 Episodes Season 1 of Alien Nation premiered on September 18, 1989. View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply w Cathy Frankel: Happy Birthday Terri Treas! Open 0 by wonder2wonder\n      \n     c El Rey Open 0 by colickybutclever\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1978-09-17 Battlestar Galactica 6.9    1990-04-19 Wings 6.7    1974-01-18 The Six Million Dollar Man 6.6    1980-12-11 Magnum, P.I. 7.1    1993-08-27 The Adventures of Brisco County, Jr. 7.6    1985-03-03 Moonlighting 7.2    1994-01-19 seaQuest DSV 6.7    1985-03-15 Mr. Belvedere 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords culture clash police detective alien race Content Score 93 Almost there... Top Contributors 14 Mitsarinho PE 9 Patrick E. Abe 7 lineker w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}