{"link": "https://www.themoviedb.org/tv/63500?language=en", "title": "Mrs. Cop", "resume": "After long and grueling hours immersed in brutal crime investigations, lead detective Choi Young Jin must face the particular horrors of singlehandedly raising her daughter Ha Eun. Any way you look at it, Young Jin's got her work cut out for her, but it's only a matter of time before her professional and personal worlds collide in new and disastrous ways.", "rate": 58, "genre": ["Crime"], "cast": ["Kim Min-jong", "Kim Sung-ryung", "Im Seul-ong", "Son Dam-bi", "Kim Bum"], "character": ["Park Jong-ho", "Ko Yoon-Jung", "Oh Seung-Il", "Shin Yeo-Ok", "Lee Ro-Joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63500   Expand Mrs. Cop   (2015) User Score Overview After long and grueling hours immersed in brutal crime investigations, lead detective Choi Young Jin must face the particular horrors of singlehandedly raising her daughter Ha Eun. Any way you look at it, Young Jin's got her work cut out for her, but it's only a matter of time before her professional and personal worlds collide in new and disastrous ways. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Min-jong Park Jong-ho Kim Sung-ryung Ko Yoon-Jung Im Seul-ong Oh Seung-Il Son Dam-bi Shin Yeo-Ok Kim Bum Lee Ro-Joon Full Cast & Crew Last Season Season 2 2016 | 20 Episodes Season 2 of Mrs. Cop premiered on March  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mrs. Cop. You can help by rating TV shows you've seen. Facts Original Name  미세스 캅 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/cop2015 Genres Crime Keywords korea Content Score 86 Almost there... Top Contributors M 45 Maria180493 S 6 SergeiAK s 4 sheva_vitali m 3 michl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}