{"link": "https://www.themoviedb.org/tv/67826?language=en", "title": "Hooten & The Lady", "resume": "Hugely charismatic, roguish American adventurer Hooten and his fantastically feisty partner in crime, Lady Alexandra travel the world, from the Vatican to The Himalayas, the Amazon to Egypt, in their quest to save the world's lost treasures.", "rate": 74, "genre": ["Action", "Adventure", "Drama"], "cast": ["Michael Landes", "Ophelia Lovibond", "Shaun Parkes", "Jessica Hynes", "Jonathan Bailey"], "character": ["Hooten", "Lady Alex Spencer-Parker", "Clive Stephenson", "Ella Bond", "Edward"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67826   Expand Hooten & The Lady   (2016) User Score  Play Trailer Overview Hugely charismatic, roguish American adventurer Hooten and his fantastically feisty partner in crime, Lady Alexandra travel the world, from the Vatican to The Himalayas, the Amazon to Egypt, in their quest to save the world's lost treasures. Featured Crew Tony Jordan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Landes Hooten Ophelia Lovibond Lady Alex Spencer-Parker Shaun Parkes Clive Stephenson Jessica Hynes Ella Bond Jonathan Bailey Edward Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Hooten & The Lady premiered on September 16, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I like this show... Open 3 by  billr1953 Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2016-10-13 Zapped 6.0    2016-05-09 Upstart Crow 7.4    2015-03-25 Big Time in Hollywood, Fl 5.7    2014-07-17 Satisfaction 5.0    2016-10-27 The Great Indoors 5.3    2014-05-29 Undateable 6.2    2014-04-09 Deadbeat 6.2    2015-09-24 The Player 5.8  Facts Status  Cancelled Networks Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.sky.com/watch/channel/sky-1/hooten-and-the-lady Genres Action & Adventure Drama Keywords treasure hunt lost treasure Content Score 100 Yes! Looking good! Top Contributors 39 Elizabeth Jennings 6 Banana 6 Travis Bell w 6 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}