{"link": "https://www.themoviedb.org/tv/13780?language=en", "title": "The Thorn Birds", "resume": "The story based on a novel by Colleen McCullough focuses on three generations of the Cleary family living on a sheep station in the Australian outback.", "rate": 70, "genre": ["Drama"], "cast": ["Richard Chamberlain", "Rachel Ward", "Rance Howard", "Jean Simmons", "Barry Corbin"], "character": ["Pete"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13780   Expand The Thorn Birds   (1983) User Score Overview The story based on a novel by Colleen McCullough focuses on three generations of the Cleary family living on a sheep station in the Australian outback. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Chamberlain Rachel Ward Rance Howard Jean Simmons Barry Corbin Pete Full Cast & Crew Last Season Miniseries 1983 | 4 Episodes Season 1 of The Thorn Birds premiered on March 27, 1983. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Classic HUGELY popular 1983 t.v. miniseries Open 1 by  genplant29 Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  10 Recommendations   1983-11-01 The Hitchhiker 6.4    1957-10-10 Zorro 8.4    1983-12-15 Automan 6.5    2001-10-05 Reba 5.7    1989-09-19 Doogie Howser, M.D. 5.7  Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords australia mine forbidden love priest love affair catholicism catholic priest vow of celibacy family saga Content Score 86 Almost there... Top Contributors 53 Buján TB 19 TMDb Bot 16 Steve 10 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}