{"link": "https://www.themoviedb.org/tv/19649?language=en", "title": "Jesus of Nazareth", "resume": "Jesus of Nazareth is a 1977 British-Italian television miniseries co-written and directed by Franco Zeffirelli which dramatizes the birth, life, ministry, crucifixion, and resurrection of Jesus largely according the Christian Bible's New Testament Gospels. It stars Robert Powell as Jesus. The miniseries features an all star cast of famous American and European actors, including seven Oscar winners.\nExtra-biblical traditions were used in the writing of the screenplay and some characters and situations were invented for the film for brevity or dramatic purposes. Notably, Jesus of Nazareth depicts Judas Iscariot as a well-intentioned man initially, but later as a dupe of Zerah who betrays Jesus largely as a result of Zerah's false platitudes and pretexts. However, in accordance with the Gospels, the film depicts Nicodemus and Joseph of Arimathea as sympathetic members of the Sanhedrin. Many of the miracles of Jesus, such as the changing of water into wine at the wedding at Cana, the transfiguration, and the calming of the storm are not depicted, although Jesus healing the blind man and the crippled woman on Sabbath, the feeding of the multitude, and the raising of Lazarus from the dead are.", "rate": 81, "genre": ["Drama"], "cast": ["Robert Powell", "Olivia Hussey", "Yorgo Voyagis", "Anne Bancroft", "Christopher Plummer"], "character": ["Jesus", "Virgin Mary", "Joseph", "Mary Magdalene", "Herod Antipas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19649   Expand Jesus of Nazareth   (1977) User Score Overview Jesus of Nazareth is a 1977 British-Italian television miniseries co-written and directed by Franco Zeffirelli which dramatizes the birth, life, ministry, crucifixion, and resurrection of Jesus largely according the Christian Bible's New Testament Gospels. It stars Robert Powell as Jesus. The miniseries features an all star cast of famous American and European actors, including seven Oscar winners. Extra-biblical traditions were used in the writing of the screenplay and some characters and situations were invented for the film for brevity or dramatic purposes. Notably, Jesus of Nazareth depicts Judas Iscariot as a well-intentioned man initially, but later as a dupe of Zerah who betrays Jesus largely as a result of Zerah's false platitudes and pretexts. However, in accordance with the Gospels, the film depicts Nicodemus and Joseph of Arimathea as sympathetic members of the Sanhedrin. Many of the miracles of Jesus, such as the changing of water into wine at the wedding at Cana, the transfiguration, and the calming of the storm are not depicted, although Jesus healing the blind man and the crippled woman on Sabbath, the feeding of the multitude, and the raising of Lazarus from the dead are. Featured Crew Franco Zeffirelli Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Powell Jesus Olivia Hussey Virgin Mary Yorgo Voyagis Joseph Anne Bancroft Mary Magdalene Christopher Plummer Herod Antipas Full Cast & Crew Last Season Season 1 1977 | 4 Episodes Season 1 of Jesus of Nazareth premiered on January  6, 1977. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Remember this massively popular star-studded miniseries? Open 0 by genplant29\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Jesus of Nazareth. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Miniseries Original Language  English Runtime  382m Homepage  - Genres Drama Keywords archangel gabriel jesus christ three kings crucifixion apostle last supper christian religion sermon on the mount son of god based on bible jesus Content Score 100 Yes! Looking good! Top Contributors 147 loyis77 21 Hector R. TB 16 TMDb Bot 9 genplant29  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}