{"link": "https://www.themoviedb.org/tv/67194?language=en", "title": "Boomerang", "resume": "Karine and Patrick are a loving but debt-ridden couple. Their only solution is to swallow their pride and accept to sleep in Karine’s parents’ basement –with all the conditions and sacrifices the new situation brings …", "rate": 0, "genre": ["Comedy"], "cast": ["Catherine-Anne Toupin", "Antoine Bertrand", "Marc Messier", "Marie-Thérèse Fortin", "Magalie Lépine-Blondeau"], "character": ["Karine Bernier", "Patrick Lussier", "Pierre Bernier", "Monique Bernier", "Stéphanie Bernier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67194   Expand Boomerang   (2015) User Score Overview Karine and Patrick are a loving but debt-ridden couple. Their only solution is to swallow their pride and accept to sleep in Karine’s parents’ basement –with all the conditions and sacrifices the new situation brings … Featured Crew Catherine-Anne Toupin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine-Anne Toupin Karine Bernier Antoine Bertrand Patrick Lussier Marc Messier Pierre Bernier Marie-Thérèse Fortin Monique Bernier Magalie Lépine-Blondeau Stéphanie Bernier Full Cast & Crew Last Season Season 3 2017 | 12 Episodes Season 3 of Boomerang premiered on September 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Boomerang. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  22m Homepage   http://tva.canoe.ca/emissions/boomerang Genres Comedy Keywords quebec thirty something family money problems living with parents Content Score 100 Yes! Looking good! Top Contributors 61 Banana 3 karaa M 2 Manu 1 chesstu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}