{"link": "https://www.themoviedb.org/tv/65824?language=en", "title": "See No Evil", "resume": "Every second of every day, millions of Americans are caught on CCTV. Most of them are honest citizens going about their everyday lives. But a few are guilty of unspeakable crimes. See no Evil is a ground breaking new series about how real crimes are solved with the help of surveillance cameras. Police reveal how CCTV footage has unlocked the answer to cases that otherwise might have remained unsolved- leaving dangerous killers at large. The series features real footage and dramatic reconstruction, combined with first-hand testimony from police, witnesses, and families.", "rate": 70, "genre": ["Crime", "Documentary", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65824   Expand See No Evil   (2014) User Score  Play Trailer Overview Every second of every day, millions of Americans are caught on CCTV. Most of them are honest citizens going about their everyday lives. But a few are guilty of unspeakable crimes. See no Evil is a ground breaking new series about how real crimes are solved with the help of surveillance cameras. Police reveal how CCTV footage has unlocked the answer to cases that otherwise might have remained unsolved- leaving dangerous killers at large. The series features real footage and dramatic reconstruction, combined with first-hand testimony from police, witnesses, and families. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 4 2018 | 16 Episodes Season 4 of See No Evil premiered on January 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on See No Evil. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.investigationdiscovery.com/tv-shows/see-no-evil/ Genres Crime Documentary Reality Keywords murder true crime cctv Content Score 64 We're so close, yet so far. Top Contributors 17 Elizabeth Jennings b 12 basher 10 Banana 7 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}