{"link": "https://www.themoviedb.org/tv/71865?language=en", "title": "Ku Kirim Cinta", "resume": "Zarul and Nisha known as the most romantic couples in their college. The power Zarul stringing passages of love is spectacular. After graduating diploma, Nisha offered to study in Australia, while Zarul pursue undergraduate studies in the country.", "rate": 0, "genre": ["Drama"], "cast": ["Julia Marin", "Wilma Muhammad", "Roy Azman", "Redza Rosli", "Ayda Jebat"], "character": ["Liyana", "Fatimah", "Hamid", "Farhan", "Nisha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71865   Expand Ku Kirim Cinta   (2017) User Score Overview Zarul and Nisha known as the most romantic couples in their college. The power Zarul stringing passages of love is spectacular. After graduating diploma, Nisha offered to study in Australia, while Zarul pursue undergraduate studies in the country. Featured Crew Raja Ahmad Alauddin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Marin Liyana Wilma Muhammad Fatimah Roy Azman Hamid Redza Rosli Farhan Ayda Jebat Nisha Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of Ku Kirim Cinta premiered on May 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ku Kirim Cinta. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 28 CyberTech 4 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}