{"link": "https://www.themoviedb.org/tv/42942?language=en", "title": "Angel Beats!", "resume": "Angel Beats takes place in the afterlife and focuses on Otonashi, a boy who lost his memories of his life after dying. He is enrolled into the afterlife school and meets a girl named Yuri who invites him to join the Afterlife Battlefront — an organization she leads which fights against God. The Battlefront fight against the student council president Angel, a girl with supernatural powers.", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kana Hanazawa", "Hiroshi Kamiya", "Harumi Sakurai", "Miyuki Sawashiro", "Eri Kitamura"], "character": ["Kanade Tachibana (Angel)", "Yuzuru Otonashi", "Yuri Nakamura", "Masami Iwasawa", "Yui"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42942   Expand Angel Beats!   (2010) User Score Overview Angel Beats takes place in the afterlife and focuses on Otonashi, a boy who lost his memories of his life after dying. He is enrolled into the afterlife school and meets a girl named Yuri who invites him to join the Afterlife Battlefront — an organization she leads which fights against God. The Battlefront fight against the student council president Angel, a girl with supernatural powers. Featured Crew Jun Maeda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  10 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Kanade Tachibana (Angel) Hiroshi Kamiya Yuzuru Otonashi Harumi Sakurai Yuri Nakamura Miyuki Sawashiro Masami Iwasawa Eri Kitamura Yui Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Angel Beats! premiered on April  3, 2010. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Angel Beats!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  5 Recommendations   2006-04-03 The Melancholy of Haruhi Suzumiya 7.6    2012-01-10 Another 7.2    2007-07-27 Baccano! 8.4    2011-10-02 Fate/Zero 7.9    2011-01-07 Puella Magi Madoka Magica 7.9    2008-10-01 Casshern Sins 6.6    2007-10-04 Clannad 7.5    2007-04-08 Lucky Star 5.0  Facts Original Name  エンジェルビーツ! Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.angelbeats.jp/ Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords afterlife angel school anime Content Score 93 Almost there... Top Contributors 30 Marr 🇳🇱 22 sp1ti k 20 kirath W 12 Watcher14  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}