{"link": "https://www.themoviedb.org/tv/69282?language=en", "title": "Interviews with Monster Girls", "resume": "The story takes place in an age where \"Ajin\" (demi-human), more casually known as \"Demi,\" have slowly started to become accepted into human society. Tetsuo Takahashi is a biology teacher who ends up teaching three such Demi, hoping to understand more about them while also managing to catch their attention.", "rate": 72, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Minami Shinoda", "Kaede Hondo", "Youko Hikasa", "Junichi Suwabe"], "character": ["Kyouko Machi", "Hikari Takanashi", "Sakie Satou", "Tetsuo Takahashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69282   Expand Interviews with Monster Girls   (2017) User Score Overview The story takes place in an age where \"Ajin\" (demi-human), more casually known as \"Demi,\" have slowly started to become accepted into human society. Tetsuo Takahashi is a biology teacher who ends up teaching three such Demi, hoping to understand more about them while also managing to catch their attention. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minami Shinoda Kyouko Machi Kaede Hondo Hikari Takanashi Youko Hikasa Sakie Satou Junichi Suwabe Tetsuo Takahashi Full Cast & Crew Last Season Season 1 2017 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2016-04-08 Shonen Maid 6.0    2015-10-04 Attack on Titan: Junior High 7.0    2017-01-12 Miss Kobayashi's Dragon Maid 7.7  Facts Original Name  亜人ちゃんは語りたい Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://demichan.com/ Genres Animation Comedy Sci-Fi & Fantasy Keywords discrimination Content Score 86 Almost there... Top Contributors 22 Jay 15 sp1ti Z 13 Zayrus 7 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}