{"link": "https://www.themoviedb.org/tv/75789?language=en", "title": "Save Me", "resume": "The story of a most unlikely hero and his search for a missing daughter he hasn't seen for thirteen years. And now the estranged father is accused of kidnapping the daughter he's barely ever seen.", "rate": 65, "genre": ["Drama"], "cast": ["Lennie James", "Suranne Jones", "Stephen Graham", "Jason Flemyng", "Ryan McKen"], "character": ["Nelly Rowe", "Claire McGory", "Melon", "Tam", "DC Leo Rainsford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75789   Expand Save Me   (2018) User Score  Play Trailer Overview The story of a most unlikely hero and his search for a missing daughter he hasn't seen for thirteen years. And now the estranged father is accused of kidnapping the daughter he's barely ever seen. Featured Crew Lennie James Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lennie James Nelly Rowe Suranne Jones Claire McGory Stephen Graham Melon Jason Flemyng Tam Ryan McKen DC Leo Rainsford Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Save Me premiered on February 28, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Save Me. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   https://www.sky.com/watch/title/programme/save-me Genres Drama Keywords missing child estranged father Content Score 100 Yes! Looking good! Top Contributors 23 Elizabeth Jennings w 14 whiteoleander 8 United600 6 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}