{"link": "https://www.themoviedb.org/tv/70191?language=en", "title": "The Liar and His Lover", "resume": "Kang Han-Kyeol is a great yet sullen composer who becomes inspired by the voices of others and keeps his identity secret from people. He meets Yoon So-Rim, a high school student who possesses beautiful singing, whilst under his secret identity, and she falls in love with him. Adaptation of the manga by Kotomi Aoki under the same name, which has been running since 2009.", "rate": 84, "genre": ["Comedy"], "cast": ["Lee Hyun-woo", "Joy", "Choi Min-soo", "Lee Jung-Jin", "Kim In-kwon"], "character": ["Kang Han-Kyeol", "Yoon So-Rim", "Kang In-Woo", "Choi Jin-Hyuk", "Homeroom Teacher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70191   Expand The Liar and His Lover   (2017) User Score  Play Trailer Overview Kang Han-Kyeol is a great yet sullen composer who becomes inspired by the voices of others and keeps his identity secret from people. He meets Yoon So-Rim, a high school student who possesses beautiful singing, whilst under his secret identity, and she falls in love with him. Adaptation of the manga by Kotomi Aoki under the same name, which has been running since 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  24 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Hyun-woo Kang Han-Kyeol Joy Yoon So-Rim Choi Min-soo Kang In-Woo Lee Jung-Jin Choi Jin-Hyuk Kim In-kwon Homeroom Teacher Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of The Liar and His Lover premiered on March 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  24 Posters  5 Recommendations   2017-11-11 Money Flower 8.0    2017-10-11 Mad Dog 8.0    2017-12-11 Just Between Lovers 7.2    2017-10-09 Witch's Court 9.3    2017-03-25 Tunnel 6.6    2017-03-15 Radiant Office 6.9    2017-09-27 While You Were Sleeping 9.0    2017-05-29 My Sassy Girl 8.3  Facts Original Name  그녀는 거짓말을 너무 사랑해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/loveliar/ Genres Comedy Keywords composer secret identity romance based on manga Content Score 93 Almost there... Top Contributors M 46 Maria180493 l 23 llluqiang 20 RainingBullets 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}