{"link": "https://www.themoviedb.org/tv/65153?language=en", "title": "Rebellion", "resume": "A group of young men and women in Dublin in 1916 are embroiled in a fight for independence during the Easter Rising.The story begins with the outbreak of World War I. As expectations of a short and glorious campaign are dashed, social stability is eroded and Irish nationalism comes to the fore. The tumultuous events that follow are seen through the eyes of a group of friends from Dublin, Belfast and London as they play vital and conflicting roles in the narrative of Ireland's independence.", "rate": 64, "genre": ["Drama"], "cast": ["Charlie Murphy", "Ruth Bradley", "Sarah Greene", "Brian Gleeson", "Barry Ward"], "character": ["Elizabeth Butler", "Frances O'Flaherty", "May Lacy", "Jimmy Mahon", "Arthur Mahon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65153   Expand Rebellion   (2016) User Score  Play Trailer Overview A group of young men and women in Dublin in 1916 are embroiled in a fight for independence during the Easter Rising.The story begins with the outbreak of World War I. As expectations of a short and glorious campaign are dashed, social stability is eroded and Irish nationalism comes to the fore. The tumultuous events that follow are seen through the eyes of a group of friends from Dublin, Belfast and London as they play vital and conflicting roles in the narrative of Ireland's independence. Featured Crew Colin Teevan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Murphy Elizabeth Butler Ruth Bradley Frances O'Flaherty Sarah Greene May Lacy Brian Gleeson Jimmy Mahon Barry Ward Arthur Mahon Full Cast & Crew Last Season Mini-series 2016 | 5 Episodes Season 1 of Rebellion premiered on January  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2016-08-12 The Get Down 7.6    2014-04-06 TURN: Washington's Spies 7.4    2015-08-16 Show Me a Hero 7.2    2014-06-01 Halt and Catch Fire 7.7    2015-01-29 Fortitude 6.9    2013-04-22 Rectify 7.6    2016-07-17 Vice Principals 6.8    2007-07-19 Mad Men 8.0  Facts Status  Returning Series Networks Certification  - Type  Miniseries Original Language  English Runtime  52m Homepage   http://www.rte.ie/drama/tv/featured/rebellion/ Genres Drama Keywords rebellion world war i dublin insurrection miniseries historical fiction ireland irish rebellion historical drama easter rising Content Score 100 Yes! Looking good! Top Contributors 96 Elizabeth Jennings TB 56 TMDb Bot 6 Banana 4 Markxist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}