{"link": "https://www.themoviedb.org/tv/65338?language=en", "title": "True North", "resume": "At 20, Donalda is the most beautiful girl in Sainte-Adèle. Young, intelligent, and dynamic, she has always been in love with Alexis, the log driver, a feisty adventurer whose life is a perpetual storm. But Seraphin is also in love with Donalda, and he will do anything to have her.", "rate": 10, "genre": ["Drama"], "cast": ["Vincent Leclerc", "Sarah-Jeanne Labrosse", "Maxime Le Flaguais", "Antoine Bertrand", "Rémi-Pierre Paquin"], "character": ["Séraphin Poudrier", "Donalda Laloge", "Alexis Labranche", "Antoine Labelle", "Bidou Laloge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65338   Expand True North   (2016) User Score Overview At 20, Donalda is the most beautiful girl in Sainte-Adèle. Young, intelligent, and dynamic, she has always been in love with Alexis, the log driver, a feisty adventurer whose life is a perpetual storm. But Seraphin is also in love with Donalda, and he will do anything to have her. Featured Crew Sylvain Archambault Creator Gilles Desjardins Creator Claude-Henri Grignon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vincent Leclerc Séraphin Poudrier Sarah-Jeanne Labrosse Donalda Laloge Maxime Le Flaguais Alexis Labranche Antoine Bertrand Antoine Labelle Rémi-Pierre Paquin Bidou Laloge Full Cast & Crew Current Season Season 3 2018 | 10 Episodes Season 3 of True North premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on True North. You can help by rating TV shows you've seen. Facts Original Name  Les Pays d'en haut Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  43m Homepage   http://lespaysdenhaut.radio-canada.ca Genres Drama Keywords quebec rural setting period drama 19th century Content Score 100 Yes! Looking good! Top Contributors 59 Banana 13 Guipat J 5 JowC9V TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}