{"link": "https://www.themoviedb.org/tv/61491?language=en", "title": "Video Game High School", "resume": "It's the near future: You're dead. Your kids are probably dead. Your grandkids (if they're alive) are playing video games. Why? Because professional gaming is the biggest sport on earth. Around the world, millions of players duke it out in fighters, RTS’s, First Person Shooters and more. To the victors go the spoils: glory, clan contracts and million dollar endorsements. The best young gamers are recruited by elite boarding schools to sharpen their skills. The best of the best go to VGHS: VIDEO GAME HIGH SCHOOL.", "rate": 69, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Josh Blaylock", "Brian Firenzi", "Johanna Braddy", "Ellary Porterfield", "Joey Scoma"], "character": ["Brian D", "The Law", "Jenny Matrix", "Ki Swan", "Jumpin' Jacks"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61491   Expand Video Game High School   (2012) User Score  Play Trailer Overview It's the near future: You're dead. Your kids are probably dead. Your grandkids (if they're alive) are playing video games. Why? Because professional gaming is the biggest sport on earth. Around the world, millions of players duke it out in fighters, RTS’s, First Person Shooters and more. To the victors go the spoils: glory, clan contracts and million dollar endorsements. The best young gamers are recruited by elite boarding schools to sharpen their skills. The best of the best go to VGHS: VIDEO GAME HIGH SCHOOL. Featured Crew Matthew Arnold Creator Freddie Wong Creator Brandon Laatsch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Blaylock Brian D Brian Firenzi The Law Johanna Braddy Jenny Matrix Ellary Porterfield Ki Swan Joey Scoma Jumpin' Jacks Full Cast & Crew Last Season Season 3 2014 | 6 Episodes Season 3 of Video Game High School premiered on October 13, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Jenny: Happy Birthday Johanna Braddy! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2017-03-17 Julie's Greenroom 7.8    2013-12-24 Turbo FAST 4.7    2016-04-01 Wild Catch / Chasing Monsters 8.7    2014-04-26 Worst Year of My Life, Again! 7.3    2011-03-01 Mr. Young 7.2    2002-06-23 Monster Garage 4.4    2002-04-02 Chobits 6.9    2009-11-28 Big Time Rush 4.9  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m, 40m, 20m Homepage   http://www.rocketjump.com/category/vghs Genres Action & Adventure Sci-Fi & Fantasy Keywords high school video game gaming Content Score 100 Yes! Looking good! Top Contributors n 68 nicb19 12 Elizabeth Jennings 11 lineker CM 9 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}