{"link": "https://www.themoviedb.org/tv/9253?language=en", "title": "Le Iene", "resume": "Le Iene is a television program broadcast on the Italian channel Italia 1 . Beginning in 1996, it is a comedy/satirical show, with sketches and reports into political affairs and consumer issues. It is based on an Argentine show Caiga Quien Caiga.\nThe first series was hosted by Simona Ventura, Dario Cassini and Peppe Quintale. Since then, many comedians and actors have hosted, such as: Fabio Volo, Teo Mammucari, Andrea Pellizzari, Alessia Marcuzzi, Luca Bizzarri and Paolo Kessisoglu, Ilary Blasi, Luciana Littizzetto. It features several writers like Davide Parenti, Lorenzo Maiello, Roberto Marcanti, Andrea Bempensante, Fabrizio Montagner among them. Recurring features of the show, besides the reportage, are the double interviews in which two famous people are asked the same questions, and are edited together on a split screen, side by side so that they answer one after the other. The Spanish version had to close due to poor ratings, but the program later returned and in 2008 it moved to a new network, laSexta.\n\"Le Iene\" was also the release name in Italy for the film Reservoir Dogs, and all the presenters on the show wear trademark black suits, white shirts and black ties.", "rate": 0, "genre": ["Documentary", "News", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9253   Expand Le Iene   (1997) User Score Overview Le Iene is a television program broadcast on the Italian channel Italia 1 . Beginning in 1996, it is a comedy/satirical show, with sketches and reports into political affairs and consumer issues. It is based on an Argentine show Caiga Quien Caiga. The first series was hosted by Simona Ventura, Dario Cassini and Peppe Quintale. Since then, many comedians and actors have hosted, such as: Fabio Volo, Teo Mammucari, Andrea Pellizzari, Alessia Marcuzzi, Luca Bizzarri and Paolo Kessisoglu, Ilary Blasi, Luciana Littizzetto. It features several writers like Davide Parenti, Lorenzo Maiello, Roberto Marcanti, Andrea Bempensante, Fabrizio Montagner among them. Recurring features of the show, besides the reportage, are the double interviews in which two famous people are asked the same questions, and are edited together on a split screen, side by side so that they answer one after the other. The Spanish version had to close due to poor ratings, but the program later returned and in 2008 it moved to a new network, laSexta. \"Le Iene\" was also the release name in Italy for the film Reservoir Dogs, and all the presenters on the show wear trademark black suits, white shirts and black ties. Featured Crew Davide Parenti Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 39 2017 | 12 Episodes Season 39 of Le Iene premiered on February 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Le Iene. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Italian Runtime  120m, 200m Homepage   http://www.iene.mediaset.it/ Genres Documentary News Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors C 238 Cataloguer D 2 Daniel TB 2 TMDb Bot K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}