{"link": "https://www.themoviedb.org/tv/62236?language=en", "title": "Star Trek Continues", "resume": "The USS Enterprise's historic five-year mission continues with all new episodes of the original series. \"Star Trek: Continues\", a new Trek series, beams down with exciting adventures of the Federation's most heroic crew led by Captain James T. Kirk. The lighting and color of the highly accurate sets accentuate the equally detailed props and costumes, matching the original series that ran from 1966-69! With acting and stories that also replicate the original series, the adventures are sure to dazzle even the most die hard Trek fans. Witness now the untold morality plays that explore the final frontier and more importantly... the human condition. Fans of the original series will especially enjoy the pilot episode as a familiar guest star from the original series reprises his role in a sequel entitled \"Pilgrim of Eternity\".", "rate": 71, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Vic Mignogna", "Christopher Doohan", "Grant Imahara", "Larry Nemecek", "Kim Stinger"], "character": ["Captain James T. Kirk", "Lt. Commander Montgomery Scott", "Lt. Hikaru Sulu", "Dr. Leonard H. McCoy", "Lt. Nyota Uhura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62236   Expand Star Trek Continues   (2013) User Score Overview The USS Enterprise's historic five-year mission continues with all new episodes of the original series. \"Star Trek: Continues\", a new Trek series, beams down with exciting adventures of the Federation's most heroic crew led by Captain James T. Kirk. The lighting and color of the highly accurate sets accentuate the equally detailed props and costumes, matching the original series that ran from 1966-69! With acting and stories that also replicate the original series, the adventures are sure to dazzle even the most die hard Trek fans. Witness now the untold morality plays that explore the final frontier and more importantly... the human condition. Fans of the original series will especially enjoy the pilot episode as a familiar guest star from the original series reprises his role in a sequel entitled \"Pilgrim of Eternity\". Featured Crew Vic Mignogna Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vic Mignogna Captain James T. Kirk Christopher Doohan Lt. Commander Montgomery Scott Grant Imahara Lt. Hikaru Sulu Larry Nemecek Dr. Leonard H. McCoy Kim Stinger Lt. Nyota Uhura Full Cast & Crew Last Season Season 1 2013 | 11 Episodes Season 1 of Star Trek Continues premiered on May 26, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1984-03-19 Kate & Allie 5.3    2000-01-17 Cleopatra 2525 5.7    1997-04-18 Lexx 7.0    1994-11-06 Earth 2 7.4    1980-01-27 Galactica 1980 5.5    1964-09-22 The Man from U.N.C.L.E. 7.2    1970-09-19 The Mary Tyler Moore Show 7.2    1977-01-14 Fantasy Island 6.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.startrekcontinues.com/ Genres Sci-Fi & Fantasy Keywords space opera star trek Content Score 93 Almost there... Top Contributors 25 Damien Haynes L 20 Lysator 16 Elizabeth Jennings w 6 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}