{"link": "https://www.themoviedb.org/tv/1617?language=en", "title": "Stephen King's Kingdom Hospital", "resume": "The terrifying story of a hospital built on the exact site of the Gates Falls Mills, where a mysterious fire incinerated scores of children laboring in the basement in 1869.", "rate": 80, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Allison Hossack", "Bruce Davison", "Janet Wright", "Andrew McCarthy", "Julian Richings"], "character": ["Dr. Christine Draper", "Dr. Stegman", "Dr. Hook", "Otto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1617   Expand Stephen King's Kingdom Hospital   (2004) User Score Overview The terrifying story of a hospital built on the exact site of the Gates Falls Mills, where a mysterious fire incinerated scores of children laboring in the basement in 1869. Featured Crew Lars von Trier Creator Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Allison Hossack Dr. Christine Draper Bruce Davison Dr. Stegman Janet Wright Andrew McCarthy Dr. Hook Julian Richings Otto Full Cast & Crew Last Season Season 1 2004 | 14 Episodes Season 1 of Stephen King's Kingdom Hospital premiered on March  2, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  3 Recommendations   2009-11-06 Ancients Behaving Badly 8.7    1991-11-07 Silk Stalkings 6.1    1977-09-15 CHiPs 6.1    2006-07-12 Nightmares & Dreamscapes: From the Stories of Stephen King 6.4    1982-01-07 Fame 6.5    2005-06-13 The Closer 7.0    2007-02-05 Rules of Engagement 6.9    2009-09-23 Cougar Town 5.8  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  40m, 60m Homepage  - Genres Drama Mystery Sci-Fi & Fantasy Keywords psychic power maine hospital ghost Content Score 93 Almost there... Top Contributors 33 Banana 7 lineker d 6 denis 4 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}