{"link": "https://www.themoviedb.org/tv/334?language=en", "title": "Sealab 2021", "resume": "The year is 2021. Deep below the ocean's surface, looms a vast, magnificently high-tech compound: Sealab. A multi-national scientific station with an annual budget in the trillions, manned by a motley collection of malcontents and screw-ups who were unfit for work in the private sector. They really don't get any research done, but instead spend their time bickering among themselves or just plain goofing off. The crew have manipulated their luckless leader, Captain Murphy, into submission, and are content to ride the government clock, raking in fat, hazardous-duty paychecks.", "rate": 79, "genre": ["Animation", "Comedy"], "cast": ["Kate Miller", "Erik Estrada", "Harry Goz", "mc chris", "Brett Butler"], "character": ["Dr. Quentin Q. Quinn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 334   Expand Sealab 2021   (2000) User Score Overview The year is 2021. Deep below the ocean's surface, looms a vast, magnificently high-tech compound: Sealab. A multi-national scientific station with an annual budget in the trillions, manned by a motley collection of malcontents and screw-ups who were unfit for work in the private sector. They really don't get any research done, but instead spend their time bickering among themselves or just plain goofing off. The crew have manipulated their luckless leader, Captain Murphy, into submission, and are content to ride the government clock, raking in fat, hazardous-duty paychecks. Featured Crew Adam Reed Creator Matt Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Miller Erik Estrada Harry Goz mc chris Brett Butler Dr. Quentin Q. Quinn Full Cast & Crew Last Season Season 5 2005 | 8 Episodes Season 5 of Sealab 2021 premiered on March  6, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2000-12-21 The Brak Show 7.0    2006-10-16 Frisky Dingo 8.1    1994-04-15 Space Ghost Coast to Coast 8.3    1999-09-24 Mission Hill 7.3    1999-04-26 Home Movies 6.6    1995-05-28 Dr. Katz, Professional Therapist 7.6    1994-01-26 The Critic 7.7    1994-03-05 Duckman 8.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  12m, 15m Homepage   http://www.adultswim.com/shows/sealab/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 10 Elizabeth Jennings D 6 DrBichlbauer 5 toomies m 3 morrison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}