{"link": "https://www.themoviedb.org/tv/75990?language=en", "title": "Oltári csajok", "resume": "Three sisters in their twenties, pursuing success and love in the big city. The story opens with an engagement party that runs astray, leaving the future wedding gift of a real-life fairytale palace up for grabs. Thus, a race begins between the sisters to be the first to find and marry their own Prince Charming.", "rate": 43, "genre": ["Drama"], "cast": ["Michl Júlia", "Jaskó Bálint", "Anna Sisa Horváth", "Márk Ember", "Petra Hartai"], "character": ["Erdész Piros", "Farkas Márk", "Erdész Angéla", "Herczeg Kornél", "Erdész Hajnal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75990   Expand Oltári csajok   (2017) User Score Overview Three sisters in their twenties, pursuing success and love in the big city. The story opens with an engagement party that runs astray, leaving the future wedding gift of a real-life fairytale palace up for grabs. Thus, a race begins between the sisters to be the first to find and marry their own Prince Charming. Featured Crew Lányi Balázs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michl Júlia Erdész Piros Jaskó Bálint Farkas Márk Anna Sisa Horváth Erdész Angéla Márk Ember Herczeg Kornél Petra Hartai Erdész Hajnal Full Cast & Crew Current Season Season 1 2017 | 101 Episodes Season 1 of Oltári csajok premiered on October 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oltári csajok. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 12 Meaning translation missing: en-US.certifications.tv_series.HU.4.meaning Type  Scripted Original Language  Hungarian Runtime  50m Homepage   http://rtl.hu/rtl2/oltari-csajok Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors r 22 roli342 21 Karesz 9 muffinhamster 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}