{"link": "https://www.themoviedb.org/tv/73139?language=en", "title": "My Mr. Mermaid", "resume": "A young swimmer tries to stage a comeback three years after a scandal.\nTang Yi Bai (Dylan Xiong) is a former champion swimmer who was wrongfully accused of doping that derailed his competitive career three years ago. He returns after a three-year hiatus to compete for the South Physical Education College alongside his best friend, Qi Rui Feng (Huang Sheng Chi), against their biggest rival, Heng Ou Yang (Pang Han Chen), of North Physical Education College.\nAt the competition, Yi Bai meets rookie sports reporter Yun Duo (Tan Song Yun), who is assigned to cover the competition but has a fear of water due to a near-drowning incident in her past. Yi Bai also happens to rent a room in Yun Duo’s family home, and the two become good friends.\nCan Yun Duo encourages Yi Bai to prove his innocence in his past scandal and regain his swimming glory?\n“My Mr. Mermaid” is a 2017 Chinese drama series. It is based on the novel Lang Hua Yi Duo Duo by Jiu Xiao Qi.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Dylan Xiong", "Tan Song Yun", "Xin Rui Qi", "Huang Sheng Chi"], "character": ["Tang Yi Bai", "Yun Duo", "Lin Sang", "Qi Rui Feng"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73139   Expand My Mr. Mermaid   (2017) User Score Overview A young swimmer tries to stage a comeback three years after a scandal. Tang Yi Bai (Dylan Xiong) is a former champion swimmer who was wrongfully accused of doping that derailed his competitive career three years ago. He returns after a three-year hiatus to compete for the South Physical Education College alongside his best friend, Qi Rui Feng (Huang Sheng Chi), against their biggest rival, Heng Ou Yang (Pang Han Chen), of North Physical Education College. At the competition, Yi Bai meets rookie sports reporter Yun Duo (Tan Song Yun), who is assigned to cover the competition but has a fear of water due to a near-drowning incident in her past. Yi Bai also happens to rent a room in Yun Duo’s family home, and the two become good friends. Can Yun Duo encourages Yi Bai to prove his innocence in his past scandal and regain his swimming glory? “My Mr. Mermaid” is a 2017 Chinese drama series. It is based on the novel Lang Hua Yi Duo Duo by Jiu Xiao Qi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dylan Xiong Tang Yi Bai Tan Song Yun Yun Duo Xin Rui Qi Lin Sang Huang Sheng Chi Qi Rui Feng Full Cast & Crew Last Season Season 1 2017 | 36 Episodes Season 1 of My Mr. Mermaid premiered on July 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Mr. Mermaid. You can help by rating TV shows you've seen. Facts Original Name  浪花一朵朵 Status  Returning Series Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Comedy Drama Keywords china sport romance Content Score 93 Almost there... Top Contributors M 20 Maria180493 12 sansalayne 6 Charles d 4 divyanka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}