{"link": "https://www.themoviedb.org/tv/70045?language=en", "title": "The Starry Night, The Starry Sea", "resume": "A young woman who moves away from the city to get it away from misery finds a life she didn’t expect. After the divorce of her parents, Shen Luo grew up being mistreated by her stepmother and stepbrother. To make a break from her difficult life, she moves out of the city to a small island cottage. One day, Luo finds an injured and unconscious Wu Ju Lan at her doorstep. As Luo nurses Ju Lan back to health, Ju Lan appears to Luo as a man without roots, a job or resources, but she can’t help falling in love with him. Ju Lan uses his mystical powers and intellect to try to make Luo’s life better. But when a nosy neighbor discovers Luo’s prized possession, a magical pearl, what sacrifices will Ju Lan have to make to save Luo’s life?", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["William Feng", "Haden Kuo", "Bosco Wong", "Sunny Wang", "Liu Enyou"], "character": ["Wu Ju Lan", "Lu Li", "Mo Heng", "Lu Xiao", "Qin Hao"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70045   Expand The Starry Night, The Starry Sea   (2017) User Score Overview A young woman who moves away from the city to get it away from misery finds a life she didn’t expect. After the divorce of her parents, Shen Luo grew up being mistreated by her stepmother and stepbrother. To make a break from her difficult life, she moves out of the city to a small island cottage. One day, Luo finds an injured and unconscious Wu Ju Lan at her doorstep. As Luo nurses Ju Lan back to health, Ju Lan appears to Luo as a man without roots, a job or resources, but she can’t help falling in love with him. Ju Lan uses his mystical powers and intellect to try to make Luo’s life better. But when a nosy neighbor discovers Luo’s prized possession, a magical pearl, what sacrifices will Ju Lan have to make to save Luo’s life? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Feng Wu Ju Lan Haden Kuo Lu Li Bosco Wong Mo Heng Sunny Wang Lu Xiao Liu Enyou Qin Hao Full Cast & Crew Last Season Season 2 2017 | 34 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Starry Night, The Starry Sea. You can help by rating TV shows you've seen. Facts Original Name  那片星空那片海 Status  Returning Series Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords fantasy china romance Content Score 86 Almost there... Top Contributors M 51 Maria180493 3 galactica_j TB 2 TMDb Bot 1 MLAT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}