{"link": "https://www.themoviedb.org/tv/67482?language=en", "title": "RuPaul's Drag Race All Stars", "resume": "The most celebrated competitors from RuPaul's Drag Race vie for a second chance to enter Drag Race herstory. This drag queen showdown is filled with plenty of heated competition, lip-syncing for the legacy, and, of course, the All-Stars Snatch Game.", "rate": 86, "genre": ["Reality"], "cast": ["RuPaul", "Michelle Visage", "Carson Kressley", "Ross Mathews"], "character": ["Himself - Host / Judge", "Herself - Judge", "Himself - Judge", "Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67482   Expand RuPaul's Drag Race All Stars   (2012) User Score  Play Trailer Overview The most celebrated competitors from RuPaul's Drag Race vie for a second chance to enter Drag Race herstory. This drag queen showdown is filled with plenty of heated competition, lip-syncing for the legacy, and, of course, the All-Stars Snatch Game. Featured Crew RuPaul Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast RuPaul Himself - Host / Judge Michelle Visage Herself - Judge Carson Kressley Himself - Judge Ross Mathews Himself - Judge Full Cast & Crew Current Season Season 3 2018 | 8 Episodes Season 3 of RuPaul's Drag Race All Stars premiered on January 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2009-02-02 RuPaul's Drag Race 7.6    2016-10-09 Insecure 6.2    2015-10-06 Chewing Gum 7.0    2009-01-18 United States of Tara 7.3    2017-04-28 Dear White People 5.9    2015-09-25 Shame 6.2    2013-02-28 Please Like Me 7.6    2016-02-08 Full Frontal with Samantha Bee 6.7  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.vh1.com/shows/rupauls-drag-race-all-stars Genres Reality Keywords drag queen lgbt impersonation reality competition crossdressing Content Score 100 Yes! Looking good! Top Contributors 17 Elizabeth Jennings a 8 agunk28 m 7 matyholi L 6 Law  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}