{"link": "https://www.themoviedb.org/tv/13278?language=en", "title": "Legend of Earthsea", "resume": "Legend of Earthsea is a two-night television miniseries adaptation of the \"Earthsea\" novels by Ursula K. Le Guin. It premiered on the Sci-Fi Channel in December 2004.", "rate": 58, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Kristin Kreuk", "Chris Gauthier", "Danny Glover", "Mark Acheson", "Shawn Ashmore"], "character": ["Tenar", "Vetch", "Ogion", "The Gebbeth", "Ged"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13278   Expand Legend of Earthsea   (2004) User Score  Play Trailer Overview Legend of Earthsea is a two-night television miniseries adaptation of the \"Earthsea\" novels by Ursula K. Le Guin. It premiered on the Sci-Fi Channel in December 2004. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristin Kreuk Tenar Chris Gauthier Vetch Danny Glover Ogion Mark Acheson The Gebbeth Shawn Ashmore Ged Full Cast & Crew Last Season Season 1 2004 | 2 Episodes Season 1 of Legend of Earthsea premiered on December 13, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  12 Recommendations   1999-10-01 BeastMaster 5.9    1997-04-29 Touching Evil 7.7    2004-10-24 ReGenesis 7.0    2009-12-28 The Day of the Triffids 5.6    1997-05-04 Invasion 0.0    2009-01-25 The Last Templar 5.0    2007-04-15 Superstorm 5.8    1967-01-10 The Invaders 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  180m Homepage   http://www.scifi.com/earthsea/ Genres Sci-Fi & Fantasy Keywords island magic amulet miniseries dragon doppelgänger fantasy world wizard Content Score 93 Almost there... Top Contributors TB 63 TMDb Bot 14 Banana 5 galani R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}