{"link": "https://www.themoviedb.org/tv/4531?language=en", "title": "Night Visions", "resume": "Night Visions is an hour-long, American television horror anthology series, with each episode comprising two half-hour stories dealing with themes of the supernatural or simply the dark side of human nature. Henry Rollins was the uncredited host of the show.\nThe series aired on Fox from July 12 to September 6, 2001, after which it was picked up by the Sci Fi Channel, which reran the series beginning June 14, 2002. Sci Fi later aired the three remaining original episodes that produced for, but unaired, on Fox. One of these, \"Cargo / Switch\", ran as part of the Night Visions series, while the two other episodes' segments were edited into the Sci Fi Channel film Shadow Realm, minus the Rollins introductions and the Night Visions name.\nThe show's directors included some best known for feature films, including Tobe Hooper and Joe Dante, and others, such as Brian Dennehy, JoBeth Williams, and Bill Pullman, known primarily as actors.", "rate": 66, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4531   Expand Night Visions   (2001) User Score Overview Night Visions is an hour-long, American television horror anthology series, with each episode comprising two half-hour stories dealing with themes of the supernatural or simply the dark side of human nature. Henry Rollins was the uncredited host of the show. The series aired on Fox from July 12 to September 6, 2001, after which it was picked up by the Sci Fi Channel, which reran the series beginning June 14, 2002. Sci Fi later aired the three remaining original episodes that produced for, but unaired, on Fox. One of these, \"Cargo / Switch\", ran as part of the Night Visions series, while the two other episodes' segments were edited into the Sci Fi Channel film Shadow Realm, minus the Rollins introductions and the Night Visions name. The show's directors included some best known for feature films, including Tobe Hooper and Joe Dante, and others, such as Brian Dennehy, JoBeth Williams, and Bill Pullman, known primarily as actors. Featured Crew Billy Brown Creator Dan Angel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2001 | 26 Episodes Season 1 of Night Visions premiered on July 12, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Night Visions. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1987-09-16 Wiseguy 7.2    1985-09-29 Amazing Stories 7.3    1994-11-06 Earth 2 7.4    2015-09-30 You, Me and the Apocalypse 7.2    2008-06-05 Fear Itself 6.9    2011-12-11 Bag of Bones 5.8    1993-05-09 The Tommyknockers 5.1    2009-01-25 Being Human 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords horror anthology Content Score 64 We're so close, yet so far. Top Contributors 7 Banana z 5 zurman1 D 4 DracoAn p 3 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}