{"link": "https://www.themoviedb.org/tv/109?language=en", "title": "Blue Water High", "resume": "Blue Water High is an Australian television drama series, broadcast by the Australian Broadcasting Corporation on ABC1 and on Austar/Foxtel Nickelodeon channel in Australia and on various channels in many other countries. Each season follows the lives of a young group of students at Solar Blue, a high-performance surf academy where several lucky 16-year-olds are selected for a 12-month-long surfing program on Sydney's northern beaches.\nThere are three series in Blue Water High. The first two series were screened in 2005 and 2006 and the producers did not intend to create a third series. However, due to popular demand by fans, they relented and made one more series with only Kate Bell returning in a main role. Series three ended with the closure of Solar Blue, indicating that the show would most likely not continue.", "rate": 35, "genre": ["Drama", "Comedy"], "cast": ["Gabrielle Scollay", "Ryan Corr", "Cariba Heine", "Sophie Luck", "Craig Horner"], "character": ["Amy Reed", "Eric Tanner", "Bridget Sanchez", "Fiona \"Fly\" Watson", "Garry Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 109   Expand Blue Water High   (2005) User Score Overview Blue Water High is an Australian television drama series, broadcast by the Australian Broadcasting Corporation on ABC1 and on Austar/Foxtel Nickelodeon channel in Australia and on various channels in many other countries. Each season follows the lives of a young group of students at Solar Blue, a high-performance surf academy where several lucky 16-year-olds are selected for a 12-month-long surfing program on Sydney's northern beaches. There are three series in Blue Water High. The first two series were screened in 2005 and 2006 and the producers did not intend to create a third series. However, due to popular demand by fans, they relented and made one more series with only Kate Bell returning in a main role. Series three ended with the closure of Solar Blue, indicating that the show would most likely not continue. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabrielle Scollay Amy Reed Ryan Corr Eric Tanner Cariba Heine Bridget Sanchez Sophie Luck Fiona \"Fly\" Watson Craig Horner Garry Miller Full Cast & Crew Last Season Season 2 2006 | 26 Episodes Season 2 of Blue Water High premiered on June 28, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blue Water High. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.abc.net.au/rollercoaster/bluewaterhigh/ Genres Drama Comedy Keywords australia surfing beach sport training teenager Content Score 86 Almost there... Top Contributors c 26 courtneysmith86 m 25 miguemadridista 7 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}