{"link": "https://www.themoviedb.org/tv/1371?language=en", "title": "Hi-5", "resume": "Hi-5, an Australian children's television program, was first shown on the Nine Network in 1999. Hi-5 is known as a children's pop music group as well as being a television show, much like peer children's entertainers The Wiggles. They also teach arts and crafts. Hi-5 is now shown in approximately 80 countries.\nEach year, the series has 45 episodes with nine weekly themes. In 2004, the show was marked by reduced episodes than normal, with 30 episodes in six weekly themes due to the band concentrating more on touring.\nIn 2009 was marked the beginning of the \"second generation\" of Hi-5, with all of the original members having departed in 2007/2008. The series was renewed for another five years with the new cast by the Nine Network, which would have the contract expire in 2013.\nIn March 2013, Hi-5's first movie, Some Kind of Wonderful, was released in selected Hoyts Junior cinemas around Australia and New Zealand. The movie showed the history of Hi-5's cast changes and a behind-the-scenes look at the search to find three new members, Dayen Zheng, Ainsley Melham and Mary Lascaris who would replace Fely Irvine, Tim Maddren and Casey Burgess in 2012/2013.\nThe new Hi-5 series called Hi-5 House will be filmed in Singapore, according to executive producer Julie Grenne. Currently, they commitment of concerts in some Asian countries with Hi-5 Wonderful Tour.", "rate": 0, "genre": [], "cast": ["Casey Burgess", "Charli Robinson", "Kathleen de Leon Jones", "Sun Park"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1371   Expand Hi-5 User Score Overview Hi-5, an Australian children's television program, was first shown on the Nine Network in 1999. Hi-5 is known as a children's pop music group as well as being a television show, much like peer children's entertainers The Wiggles. They also teach arts and crafts. Hi-5 is now shown in approximately 80 countries. Each year, the series has 45 episodes with nine weekly themes. In 2004, the show was marked by reduced episodes than normal, with 30 episodes in six weekly themes due to the band concentrating more on touring. In 2009 was marked the beginning of the \"second generation\" of Hi-5, with all of the original members having departed in 2007/2008. The series was renewed for another five years with the new cast by the Nine Network, which would have the contract expire in 2013. In March 2013, Hi-5's first movie, Some Kind of Wonderful, was released in selected Hoyts Junior cinemas around Australia and New Zealand. The movie showed the history of Hi-5's cast changes and a behind-the-scenes look at the search to find three new members, Dayen Zheng, Ainsley Melham and Mary Lascaris who would replace Fely Irvine, Tim Maddren and Casey Burgess in 2012/2013. The new Hi-5 series called Hi-5 House will be filmed in Singapore, according to executive producer Julie Grenne. Currently, they commitment of concerts in some Asian countries with Hi-5 Wonderful Tour. Featured Crew Posie Graeme-Evans Creator Helena Harris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Burgess Charli Robinson Kathleen de Leon Jones Sun Park Full Cast & Crew Last Season Season 12 — | 45 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m, 22m Homepage   http://www.hi-5.com.au Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 3 United600 1 kuzronk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}