{"link": "https://www.themoviedb.org/tv/31010?language=en", "title": "Moby Dick", "resume": "The sole survivor of a lost whaling ship relates the tale of his captain's self-destructive obsession to hunt the white whale, Moby Dick.", "rate": 56, "genre": ["Adventure", "Drama"], "cast": ["Robin Cuming", "Ted Levine", "Gregory Peck", "Patrick Stewart", "Henry Thomas"], "character": ["Peter Coffin", "Starbuck", "Father Mapple", "Captain Ahab", "Ishmael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31010   Expand Moby Dick   (1998) User Score  Play Trailer Overview The sole survivor of a lost whaling ship relates the tale of his captain's self-destructive obsession to hunt the white whale, Moby Dick. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robin Cuming Peter Coffin Ted Levine Starbuck Gregory Peck Father Mapple Patrick Stewart Captain Ahab Henry Thomas Ishmael Full Cast & Crew Last Season Season 1 1998 | 2 Episodes Season 1 of Moby Dick premiered on March 15, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  10 Recommendations   1999-08-30 Roughnecks: Starship Troopers Chronicles 6.0    1977-09-16 Logan's Run 7.9    2010-08-03 The Deep 5.8    1984-05-06 V: The Final Battle 7.3    2009-02-14 Impact 5.1    1999-09-14 Journey to the Center of the Earth 4.7    1997-10-06 Earth: Final Conflict 6.8    2002-11-14 Wire in the Blood 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Adventure Drama Keywords sea ship captain whale Content Score 93 Almost there... Top Contributors TB 37 TMDb Bot 19 Elizabeth Jennings s 5 speedycars R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}