{"link": "https://www.themoviedb.org/tv/32519?language=en", "title": "Ezel", "resume": "Ömer, a young man returning from military service, is set up by his friends and fiancé and ends up in prison for ten years. He fakes his own death and manages to escape. He re-creates himself as ‘Ezel’, a high-end gambler who is outwardly a successful man, but inwardly driven by one thing - his determination to understand why the people he loved betrayed him, and take his revenge.", "rate": 83, "genre": ["Crime", "Drama", "Action", "Adventure"], "cast": ["Kenan İmirzalıoğlu", "Cansu Dere", "Yiğit Özşener", "Baris Falay", "Sarp Akkaya"], "character": ["Ezel Bayraktar", "Eyşan Tezcan Atay", "Cengiz Atay", "Ali Kırgız", "Tevfik Zaim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32519   Expand Ezel   (2009) User Score  Play Trailer Overview Ömer, a young man returning from military service, is set up by his friends and fiancé and ends up in prison for ten years. He fakes his own death and manages to escape. He re-creates himself as ‘Ezel’, a high-end gambler who is outwardly a successful man, but inwardly driven by one thing - his determination to understand why the people he loved betrayed him, and take his revenge. Featured Crew Uluç Bayraktar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenan İmirzalıoğlu Ezel Bayraktar Cansu Dere Eyşan Tezcan Atay Yiğit Özşener Cengiz Atay Baris Falay Ali Kırgız Sarp Akkaya Tevfik Zaim Full Cast & Crew Last Season Season 2 2010 | 38 Episodes Season 2 of Ezel premiered on September 13, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Ezel. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2010-01-05 Love and Punishment 5.5    2012-10-08 Karadayı 7.4    2008-09-04 Forbidden Love 5.5    2010-08-02 Teresa 7.7  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Turkish Runtime  120m, 90m Homepage   http://www.ezel.tv/ Genres Crime Drama Action & Adventure Keywords love Content Score 100 Yes! Looking good! Top Contributors 52 Marr 🇳🇱 23 Maikkoum P 5 Pisac z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}