{"link": "https://www.themoviedb.org/tv/60941?language=en", "title": "Taxi Brooklyn", "resume": "Caitlin \"Cat\" Sullivan is an NYPD detective working in Brooklyn. After her driving privileges are suspended, she relies on Leo Romba, a highly skilled Brooklyn cab driver from France. Leo becomes Cat's driver and a consultant on her cases. While solving crimes with Leo, Cat is also running her own unauthorized investigation into the death of her father, an NYPD detective thought to have been executed by the Capella crime family. In doing so, she clashes with her boss, Captain Baker, and her ex-husband Gregg, who has picked up the case for the FBI.", "rate": 46, "genre": ["Action", "Adventure", "Comedy", "Crime"], "cast": ["Chyler Leigh", "Jacky Ido", "James Colby", "Bill Heck", "Ally Walker"], "character": ["Detective Cat Sullivan", "Leo Romba", "Captain John Baker", "Special Agent Gregg James", "Frankie Sullivan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60941   Expand Taxi Brooklyn   (2014) User Score  Play Trailer Overview Caitlin \"Cat\" Sullivan is an NYPD detective working in Brooklyn. After her driving privileges are suspended, she relies on Leo Romba, a highly skilled Brooklyn cab driver from France. Leo becomes Cat's driver and a consultant on her cases. While solving crimes with Leo, Cat is also running her own unauthorized investigation into the death of her father, an NYPD detective thought to have been executed by the Capella crime family. In doing so, she clashes with her boss, Captain Baker, and her ex-husband Gregg, who has picked up the case for the FBI. Featured Crew Franck Ollivier Creator Stephen Tolkin Creator Gary Scott Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chyler Leigh Detective Cat Sullivan Jacky Ido Leo Romba James Colby Captain John Baker Bill Heck Special Agent Gregg James Ally Walker Frankie Sullivan Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Taxi Brooklyn premiered on April 14, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Taxi Brooklyn. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2014-06-29 Reckless 5.5    2010-01-18 Life Unexpected 7.4    2016-11-27 Pacific Heat 5.1    2013-05-03 Maron 6.9    2016-06-02 Hibana: Spark 7.8    2015-09-02 Atelier 7.2    2012-08-08 Go On 6.2    2013-09-26 The Crazy Ones 5.8  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/taxi-brooklyn Genres Action & Adventure Comedy Crime Keywords taxi driver brooklyn new york city nypd female detective murder investigation Content Score 100 Yes! Looking good! Top Contributors c 44 cijah 31 Elizabeth Jennings M 25 MCDb 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}