{"link": "https://www.themoviedb.org/tv/32697?language=en", "title": "Harry's Law", "resume": "Harriet, Matthew and Malcolm couldn't be any more different, but when they cross paths, they realize they're all looking for a fresh start. The most unlikely of people are starting a law practice in the most unlikely of places -- a rundown shoe store.", "rate": 73, "genre": ["Comedy", "Drama"], "cast": ["Kathy Bates", "Nate Corddry", "Christopher McDonald", "Mark Valley", "Karen Olivo"], "character": ["Harriet Harry", "Adam Branch", "Tommy Jefferson", "Oliver Richard", "Cassie Reynolds"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32697   Expand Harry's Law   (2011) User Score Overview Harriet, Matthew and Malcolm couldn't be any more different, but when they cross paths, they realize they're all looking for a fresh start. The most unlikely of people are starting a law practice in the most unlikely of places -- a rundown shoe store. Featured Crew David E. Kelley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathy Bates Harriet Harry Nate Corddry Adam Branch Christopher McDonald Tommy Jefferson Mark Valley Oliver Richard Karen Olivo Cassie Reynolds Full Cast & Crew Last Season Season 2 2011 | 22 Episodes Season 2 of Harry's Law premiered on September 21, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2013-10-03 The Millers 4.9    2014-01-23 Rake 5.4    2010-08-15 Vexed 7.2    1969-09-26 The Brady Bunch 6.5    2016-09-11 Son of Zorn 5.6    1996-09-28 Psi Factor: Chronicles of the Paranormal 6.3    2008-02-07 Lipstick Jungle 4.7    2013-09-26 The Michael J. Fox Show 5.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m Homepage   http://www.nbc.com/harrys-law/ Genres Comedy Drama Keywords lawyer law firm Content Score 93 Almost there... Top Contributors 35 Banana c 3 castacasta T 3 Ticktock s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}