{"link": "https://www.themoviedb.org/tv/64542?language=en", "title": "Chernobyl: Exclusion Zone", "resume": "5 youths give chase after a man who has stolen 8 million rubles from them. The man reveals on his video blog his intention to travel to Chernobyl. With every kilometer the journey of the heroes becomes more dangerous and confusing.", "rate": 87, "genre": ["Action", "Adventure", "Drama"], "cast": ["Анвар Халилулаев", "Kristina Kazinskaya", "Sergey Romanovich", "Valeriya Dmitrieva", "Evgeniy Stychkin"], "character": ["Гоша", "Аня", "Алексей", "Настя", "Костенко"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64542   Expand Chernobyl: Exclusion Zone   (2014) User Score Overview 5 youths give chase after a man who has stolen 8 million rubles from them. The man reveals on his video blog his intention to travel to Chernobyl. With every kilometer the journey of the heroes becomes more dangerous and confusing. Featured Crew Илья Куликов Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Анвар Халилулаев Гоша Kristina Kazinskaya Аня Sergey Romanovich Алексей Valeriya Dmitrieva Настя Evgeniy Stychkin Костенко Full Cast & Crew Current Season Season 2 2017 | 8 Episodes Season 2 of Chernobyl: Exclusion Zone premiered on November 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Chernobyl: Exclusion Zone. You can help by rating TV shows you've seen. Facts Original Name  Чернобыль: Зона отчуждения Status  Returning Series Networks Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Russian Runtime  48m Homepage   http://chernobyl2.tv3.ru Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors g 21 gridluck 17 highroller 17 Sabermax i 7 ivanhoe.bg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}