{"link": "https://www.themoviedb.org/tv/61702?language=en", "title": "American Odyssey", "resume": "In this \"Traffic\"-like action drama, an international conspiracy explodes when three strangers' lives unexpectedly collide - a female soldier, a corporate lawyer and a political activist.", "rate": 72, "genre": ["Drama"], "cast": ["Anna Friel", "Peter Facinelli", "Jake Robinson", "Jim True-Frost", "Sadie Sink"], "character": ["Odelle Ballard", "Peter Decker", "Harrison Walters", "Ron Ballard", "Suzanne Ballard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61702   Expand American Odyssey   (2015) User Score  Play Trailer Overview In this \"Traffic\"-like action drama, an international conspiracy explodes when three strangers' lives unexpectedly collide - a female soldier, a corporate lawyer and a political activist. Featured Crew Peter Horton Creator Adam Armus Creator Nora Kay Foster Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Friel Odelle Ballard Peter Facinelli Peter Decker Jake Robinson Harrison Walters Jim True-Frost Ron Ballard Sadie Sink Suzanne Ballard Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of American Odyssey premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2015-05-25 Texas Rising 6.4    2015-03-05 Dig 6.4    2015-05-21 Between 5.4    2014-08-13 Legends 6.6    2015-03-20 Bloodline 7.5    2012-06-03 Longmire 7.6    2010-03-16 Justified 7.9    2014-07-09 Extant 6.1  Facts Status  Cancelled Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.nbc.com/odyssey Genres Drama Keywords conspiracy Content Score 100 Yes! Looking good! Top Contributors 44 Elizabeth Jennings 25 United600 TB 11 TMDb Bot 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}