{"link": "https://www.themoviedb.org/tv/62411?language=en", "title": "Let's Eat", "resume": "What do a group of foodies and a murder have in common? Lee Soo Kyung is a 33-year-old divorcee who is a composed, confident woman who is happy to be living alone after marrying way too early in life. But the only thing that can make her lose her cool composure is great food. Living next door is another foodie, Goo Dae Young, a single man who loves surrounding himself with gourmet food but hates being asked if he is dining alone at great restaurants. When a strange murder occurs in their neighborhood, how will their lives be intertwined?", "rate": 78, "genre": ["Comedy", "Crime", "Drama"], "cast": ["Yoon Doo-Joon", "Baek Jin-hee", "An Woo-yeon", "Lee Joo-woo", "Kim Dong-young"], "character": ["Goo Dae Young", "Lee Ji Woo", "Sun Woo Sun", "Lee Suh Yun", "Bae Byung Sam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62411   Expand Let's Eat   (2013) User Score Overview What do a group of foodies and a murder have in common? Lee Soo Kyung is a 33-year-old divorcee who is a composed, confident woman who is happy to be living alone after marrying way too early in life. But the only thing that can make her lose her cool composure is great food. Living next door is another foodie, Goo Dae Young, a single man who loves surrounding himself with gourmet food but hates being asked if he is dining alone at great restaurants. When a strange murder occurs in their neighborhood, how will their lives be intertwined? Featured Crew Lim Soo Mi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Doo-Joon Goo Dae Young Baek Jin-hee Lee Ji Woo An Woo-yeon Sun Woo Sun Lee Joo-woo Lee Suh Yun Kim Dong-young Bae Byung Sam Full Cast & Crew Next Season Season 3 2018 | 2 Episodes Season 3 of Let's Eat is set to premiere on July 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations   2014-03-17 Secret Love Affair 7.8    2012-08-18 Panda and Hedgehog 6.0  Facts Original Name  식샤를 합시다 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/eat2 Genres Comedy Crime Drama Keywords insurance salesman korea food divorced woman blogger freelance writer public works single man Content Score 93 Almost there... Top Contributors M 69 Maria180493 31 daliasued 8 Elizabeth Jennings 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}