{"link": "https://www.themoviedb.org/tv/2584?language=en", "title": "Dirty Jobs", "resume": "Dirty Jobs is a program on the Discovery Channel, produced by Pilgrim Films & Television, in which host Mike Rowe is shown performing difficult, strange, disgusting, or messy occupational duties alongside the typical employees. The show premiered with two pilot episodes in November 2003. It returned as a series on July 26, 2005, running for 8 seasons until September 12, 2012. The show's setting was refocused in Australia for the eighth season, advertised as Dirty Jobs Down Under.\nThere is also a European edition of the show, hosted by Danish former goalkeeper Peter Schmeichel.\nOn November 21, 2012, Mike Rowe announced that Discovery Channel had cancelled Dirty Jobs.", "rate": 75, "genre": ["Documentary"], "cast": ["Mike Rowe"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2584   Expand Dirty Jobs   (2003) User Score Overview Dirty Jobs is a program on the Discovery Channel, produced by Pilgrim Films & Television, in which host Mike Rowe is shown performing difficult, strange, disgusting, or messy occupational duties alongside the typical employees. The show premiered with two pilot episodes in November 2003. It returned as a series on July 26, 2005, running for 8 seasons until September 12, 2012. The show's setting was refocused in Australia for the eighth season, advertised as Dirty Jobs Down Under. There is also a European edition of the show, hosted by Danish former goalkeeper Peter Schmeichel. On November 21, 2012, Mike Rowe announced that Discovery Channel had cancelled Dirty Jobs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Rowe Himself - Host Full Cast & Crew Last Season Season 9 2012 | 6 Episodes Season 9 of Dirty Jobs premiered on August 22, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations   2011-01-19 Restaurant: Impossible 5.7    2001-01-06 How It's Made 7.4    2008-12-03 Man v. Food 6.7    1995-09-09 Earthworm Jim 6.6    2003-11-13 Brainiac: Science Abuse 7.1    2003-03-31 American Chopper 5.9    1999-04-07 Strangers with Candy 7.0    2013-04-12 8 Out of 10 Cats Does Countdown 7.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://discovery.com/dirtyjobs/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 D 2 Daniel 1 Elizabeth Jennings 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}