{"link": "https://www.themoviedb.org/tv/77484?language=en", "title": "Greyzone", "resume": "When a brilliant drone engineer, Victoria, is taken hostage in her own home, a series of dangerous events are set into motion in this high octane thriller.", "rate": 0, "genre": ["Drama"], "cast": ["Virgil Katring-Rasmussen", "Birgitte Hjort Sørensen", "Ardalan Esmaili", "Joachim Fjelstrup", "Tova Magnusson"], "character": ["Oskar Rahbek Lindsbye", "Victoria Rahbek", "Iyad Adi Kassar", "Jesper Lassen", "Eva Forsberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77484   Expand Greyzone   (2018) User Score  Play Trailer Overview When a brilliant drone engineer, Victoria, is taken hostage in her own home, a series of dangerous events are set into motion in this high octane thriller. Featured Crew Morten Dragsted Creator Oskar Söderlund Creator Rasmus Thorsen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Virgil Katring-Rasmussen Oskar Rahbek Lindsbye Birgitte Hjort Sørensen Victoria Rahbek Ardalan Esmaili Iyad Adi Kassar Joachim Fjelstrup Jesper Lassen Tova Magnusson Eva Forsberg Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Greyzone premiered on February 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Greyzone. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Danish Runtime  - Homepage   http://tv.tv2.dk/greyzone Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors C 29 CyberScream 20 Elizabeth Jennings B 4 BloodyDk 3 EveDemocracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}