{"link": "https://www.themoviedb.org/tv/3782?language=en", "title": "Naked City", "resume": "Naked City is a police drama series which aired from 1958 to 1963 on the ABC television network. It was inspired by the 1948 motion picture of the same name, and mimics its dramatic “semi-documentary” format.\nIn 1997, the episode “Sweet Prince of Delancey Street” was ranked #93 on TV Guide’s “100 Greatest Episodes of All Time”.", "rate": 75, "genre": ["Drama"], "cast": ["Horace McMahon", "Paul Burke", "Harry Bellaver", "Lawrence Dobkin", "Nancy Malone"], "character": ["Lt. Michael 'Mike' Parker", "Adam Flint", "Det. Frank Arcaro", "Narrator", "Libby Kingston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3782   Expand Naked City   (1958) User Score Overview Naked City is a police drama series which aired from 1958 to 1963 on the ABC television network. It was inspired by the 1948 motion picture of the same name, and mimics its dramatic “semi-documentary” format. In 1997, the episode “Sweet Prince of Delancey Street” was ranked #93 on TV Guide’s “100 Greatest Episodes of All Time”. Featured Crew Stirling Silliphant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Horace McMahon Lt. Michael 'Mike' Parker Paul Burke Adam Flint Harry Bellaver Det. Frank Arcaro Lawrence Dobkin Narrator Nancy Malone Libby Kingston Full Cast & Crew Last Season Season 4 1962 | 34 Episodes Season 4 of Naked City premiered on September 19, 1962. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Naked City. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords police nypd Content Score 100 Yes! Looking good! Top Contributors 15 lineker 7 rpeters M 4 MAthePA 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}