{"link": "https://www.themoviedb.org/tv/73870?language=en", "title": "Génial!", "resume": "Two teams composed of a known personality and a contestant chosen from the public battle to guess the outcomes of astonishing scientific experiments.", "rate": 8, "genre": ["Family"], "cast": ["Stéphane Bellavance", "Martin Carli"], "character": ["Himself - Host", "Himself - Co-Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73870   Expand Génial!   (2010) User Score Overview Two teams composed of a known personality and a contestant chosen from the public battle to guess the outcomes of astonishing scientific experiments. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stéphane Bellavance Himself - Host Martin Carli Himself - Co-Host Full Cast & Crew Last Season Season 8 2017 | 92 Episodes Season 8 of Génial! premiered on September 10, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Génial!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Génial!. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Talk Show Original Language  French Runtime  23m Homepage   http://genial.telequebec.tv Genres Family Keywords experiment game show science Content Score 56 We're so close, yet so far. Top Contributors j 39 joethebeef 37 Banana 2 kingkong25  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}