{"link": "https://www.themoviedb.org/tv/35348?language=en", "title": "Necessary Roughness", "resume": "Necessary Roughness is a USA Network television series starring Callie Thorne and Scott Cohen. The one-hour drama series was picked up for 12 episodes on January 19, 2011. The series debuted on June 29, 2011, with a 90-minute premiere episode. The second season premiered on June 6, 2012. On January 7, 2013, USA Network announced the series was renewed for a 10-episode third season, which began on June 12, 2013.", "rate": 68, "genre": ["Drama", "Comedy"], "cast": ["Mehcad Brooks", "Callie Thorne", "Scott Cohen", "Karissa Staples", "John Stamos"], "character": ["Terrence King", "Dr. Danielle 'Dani' Santino", "Nico Careles", "Paloma Madsen", "Connor McClane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35348   Expand Necessary Roughness   (2011) User Score  Play Trailer Overview Necessary Roughness is a USA Network television series starring Callie Thorne and Scott Cohen. The one-hour drama series was picked up for 12 episodes on January 19, 2011. The series debuted on June 29, 2011, with a 90-minute premiere episode. The second season premiered on June 6, 2012. On January 7, 2013, USA Network announced the series was renewed for a 10-episode third season, which began on June 12, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mehcad Brooks Terrence King Callie Thorne Dr. Danielle 'Dani' Santino Scott Cohen Nico Careles Karissa Staples Paloma Madsen John Stamos Connor McClane Full Cast & Crew Last Season Season 3 2013 | 10 Episodes Season 3 of Necessary Roughness premiered on June 12, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  15 Posters  6 Recommendations   2013-01-08 Cracked 6.2    2010-07-11 The Glades 6.3    2010-06-24 Rookie Blue 7.0    2012-07-09 Perception 6.7    2013-09-26 The Michael J. Fox Show 5.6    2011-01-20 Fairly Legal 5.8    2011-03-29 Body of Proof 6.7    2015-01-22 Backstrom 6.4  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.usanetwork.com/series/necessaryroughness/ Genres Drama Comedy Keywords sport american football single mother nfl psychotherapist Content Score 93 Almost there... Top Contributors 42 Banana GB 7 Guillaume Beyssac S 6 Shady12 w 5 willo123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}