{"link": "https://www.themoviedb.org/tv/71367?language=en", "title": "Will", "resume": "The wild story of young William Shakespeare's arrival onto the punk-rock theater scene in 16th century London -- the seductive, violent world where his raw talent faced rioting audiences, religious fanatics and raucous side-shows. It's a contemporary version of Shakespeare's life, played to a modern soundtrack that exposes all his recklessness, lustful temptations and brilliance.", "rate": 60, "genre": ["Drama"], "cast": ["Laurie Davidson", "Olivia DeJonge", "Ewen Bremner", "Colm Meaney", "Mattias Inwood"], "character": ["William Shakespeare", "Alice Burbage", "Richard Burbage"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71367   Expand Will   (2017) User Score  Play Trailer Overview The wild story of young William Shakespeare's arrival onto the punk-rock theater scene in 16th century London -- the seductive, violent world where his raw talent faced rioting audiences, religious fanatics and raucous side-shows. It's a contemporary version of Shakespeare's life, played to a modern soundtrack that exposes all his recklessness, lustful temptations and brilliance. Featured Crew Craig Pearce Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laurie Davidson William Shakespeare Olivia DeJonge Alice Burbage Ewen Bremner Colm Meaney Mattias Inwood Richard Burbage Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Will premiered on July 10, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Am I Missing Something? Open 4 by  Satai Delenn n It was  good, but it was a little predictable. Open 3 by  Satai Delenn Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Will. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tntdrama.com/shows/will.html Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings b 8 bugfix F 5 Frank_Se P 3 PlexRowe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}