{"link": "https://www.themoviedb.org/tv/21732?language=en", "title": "Mobile Suit Gundam 00", "resume": "Mobile Suit Gundam 00 is an anime television series, the 11th incarnation of Sunrise studio's long-running Gundam franchise comprising two seasons. The series is set on a futuristic Earth and is centered on the exploits of the fictional paramilitary organization Celestial Being and its efforts to rid the world of war and conflict with a series of unique and extremely advanced mechas mobile suits known as \"Gundams\".\nIt is directed by Seiji Mizushima and written by Yōsuke Kuroda, and features character designs by Yun Kōga. The 25-episode season was officially announced by Sunrise during a 15-second trailer on June 2, 2007. The series aired on the Mainichi Broadcasting System and Tokyo Broadcasting System from October 5, 2007 to March 29, 2008. The second season began on October 5, 2008 and concluded on March 29, 2009. A movie sequel was released on DVD and Blu-ray on December 25, 2010 in Japan. Mobile Suit Gundam 00 is the first Gundam series to be animated in widescreen and in high-definition.", "rate": 72, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Hiroshi Kamiya", "Shin'ichirou Miki", "Mamoru Miyano", "Miyu Irino", "Hiroyuki Yoshino"], "character": ["Tieria Erde", "Lockon Stratos", "Setsuna F. Seiei", "Saji Crossroad", "Allelujah Haptism"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21732   Expand Mobile Suit Gundam 00   (2007) User Score Overview Mobile Suit Gundam 00 is an anime television series, the 11th incarnation of Sunrise studio's long-running Gundam franchise comprising two seasons. The series is set on a futuristic Earth and is centered on the exploits of the fictional paramilitary organization Celestial Being and its efforts to rid the world of war and conflict with a series of unique and extremely advanced mechas mobile suits known as \"Gundams\". It is directed by Seiji Mizushima and written by Yōsuke Kuroda, and features character designs by Yun Kōga. The 25-episode season was officially announced by Sunrise during a 15-second trailer on June 2, 2007. The series aired on the Mainichi Broadcasting System and Tokyo Broadcasting System from October 5, 2007 to March 29, 2008. The second season began on October 5, 2008 and concluded on March 29, 2009. A movie sequel was released on DVD and Blu-ray on December 25, 2010 in Japan. Mobile Suit Gundam 00 is the first Gundam series to be animated in widescreen and in high-definition. Featured Crew Yoshiyuki Tomino Creator Hajime Yatate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Kamiya Tieria Erde Shin'ichirou Miki Lockon Stratos Mamoru Miyano Setsuna F. Seiei Miyu Irino Saji Crossroad Hiroyuki Yoshino Allelujah Haptism Full Cast & Crew Last Season Season 2 2008 | 25 Episodes Season 2 of Mobile Suit Gundam 00 premiered on October  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  9 Recommendations   2015-10-04 Mobile Suit Gundam: Iron-Blooded Orphans 6.3  Facts Original Name  機動戦士ガンダム00 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.gundam00.net/ Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords anime Content Score 93 Almost there... Top Contributors k 37 kenhyg 22 Steinholf 12 sp1ti 8 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}