{"link": "https://www.themoviedb.org/tv/11096?language=en", "title": "The High Chaparral", "resume": "The High Chaparral is an American Western-themed television series starring Leif Erickson and Cameron Mitchell which aired on NBC from 1967 to 1971. The series, made by Xanadu Productions in association with NBC Productions, was created by David Dortort, who had previously created the hit Bonanza for the network. The theme song was also written and conducted by Bonanza scorer David Rose, who also scored the two-hour pilot.", "rate": 80, "genre": ["Western"], "cast": ["Henry Darrow", "Cameron Mitchell", "Leif Erickson", "Mark Slade", "Linda Cristal"], "character": ["Manolito Montoya", "Buck Cannon", "Big John Cannon", "Billy Blue Cannon", "Victoria Cannon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11096   Expand The High Chaparral   (1967) User Score Overview The High Chaparral is an American Western-themed television series starring Leif Erickson and Cameron Mitchell which aired on NBC from 1967 to 1971. The series, made by Xanadu Productions in association with NBC Productions, was created by David Dortort, who had previously created the hit Bonanza for the network. The theme song was also written and conducted by Bonanza scorer David Rose, who also scored the two-hour pilot. Featured Crew David Dortort Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Henry Darrow Manolito Montoya Cameron Mitchell Buck Cannon Leif Erickson Big John Cannon Mark Slade Billy Blue Cannon Linda Cristal Victoria Cannon Full Cast & Crew Last Season Season 4 1970 | 18 Episodes Season 4 of The High Chaparral premiered on September 18, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1954-10-15 The Adventures of Rin Tin Tin 6.5    1974-09-11 Petrocelli 7.8    1983-09-21 Hotel 7.8    1971-09-17 The Persuaders! 8.0    1968-09-23 Here's Lucy 5.8    1976-10-22 The New Avengers 7.6    1954-09-12 Lassie 5.3    1959-09-12 Bonanza 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 52m Homepage  - Genres Western Keywords ranch wild west 19th century Content Score 93 Almost there... Top Contributors 31 Steve 9 Banana i 3 ismax935 S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}