{"link": "https://www.themoviedb.org/tv/70337?language=en", "title": "Before We Die", "resume": "The police woman Hanna Svensson has a strained relationship to her son after having arrested him for drug dealing. Her married police man lover disappears, possibly kidnapped by MC gangs, although ties to Bosnia also appear.", "rate": 55, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Marie Richardson", "Adam Pålsson", "Magnus Krepper", "Alexej Manvelov", "Sofia Ledarp"], "character": ["Hanna Svensson", "Christian Svensson", "Björn", "Davor", "Tina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70337   Expand Before We Die   (2017) User Score  Play Trailer Overview The police woman Hanna Svensson has a strained relationship to her son after having arrested him for drug dealing. Her married police man lover disappears, possibly kidnapped by MC gangs, although ties to Bosnia also appear. Featured Crew Wilhelm Behrman Creator Niklas Rockström Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marie Richardson Hanna Svensson Adam Pålsson Christian Svensson Magnus Krepper Björn Alexej Manvelov Davor Sofia Ledarp Tina Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Before We Die premiered on February 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Before We Die. You can help by rating TV shows you've seen. Facts Original Name  Innan vi dör Status  Returning Series Networks Certification  - Type  Scripted Original Language  Swedish Runtime  - Homepage   http://www.svt.se/innan-vi-dor/ Genres Crime Drama Mystery Keywords police undercover mafia motorcycle gang Content Score 100 Yes! Looking good! Top Contributors 20 danielkje 10 PauliJC 8 Eline TV 6 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}