{"link": "https://www.themoviedb.org/tv/6081?language=en", "title": "Wagon Train", "resume": "Wagon Train is an American Western series that ran on NBC from 1957–62 and then on ABC from 1962–65, although the network also aired daytime repeats, as Major Adams, Trailmaster and Trailmaster, from January 1963 to September 1965. The show debuted at #15 in the Nielsen ratings, rose to #2 in the next three seasons, and peaked at #1 in the 1961–62 television season. After moving to ABC in the autumn of 1962, the ratings began to decline, and Wagon Train did not again make the Top 20 listing.\nThe series initially starred veteran movie supporting actor Ward Bond as the wagon master, later replaced upon his death by John McIntire, and Robert Horton as the scout, subsequently replaced by lookalike Robert Fuller a year after Horton had decided to leave the series.\nThe series was inspired by the 1950 film Wagon Master directed by John Ford and starring Ben Johnson, Harry Carey Jr. and Ward Bond, and harkens back to the early widescreen wagon train epic The Big Trail starring John Wayne and featuring Bond in his first major screen appearance playing a supporting role. Horton's buckskin outfit as the scout in the first season of the television series resembles Wayne's, who also played the wagon train's scout in the earlier film.", "rate": 70, "genre": ["Western"], "cast": ["John McIntire", "Terry Wilson", "Frank McGrath", "Robert Fuller"], "character": ["Christopher Hale", "Bill Hawks", "Charlie Wooster", "Cooper Smith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6081   Expand Wagon Train   (1957) User Score Overview Wagon Train is an American Western series that ran on NBC from 1957–62 and then on ABC from 1962–65, although the network also aired daytime repeats, as Major Adams, Trailmaster and Trailmaster, from January 1963 to September 1965. The show debuted at #15 in the Nielsen ratings, rose to #2 in the next three seasons, and peaked at #1 in the 1961–62 television season. After moving to ABC in the autumn of 1962, the ratings began to decline, and Wagon Train did not again make the Top 20 listing. The series initially starred veteran movie supporting actor Ward Bond as the wagon master, later replaced upon his death by John McIntire, and Robert Horton as the scout, subsequently replaced by lookalike Robert Fuller a year after Horton had decided to leave the series. The series was inspired by the 1950 film Wagon Master directed by John Ford and starring Ben Johnson, Harry Carey Jr. and Ward Bond, and harkens back to the early widescreen wagon train epic The Big Trail starring John Wayne and featuring Bond in his first major screen appearance playing a supporting role. Horton's buckskin outfit as the scout in the first season of the television series resembles Wayne's, who also played the wagon train's scout in the earlier film. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John McIntire Christopher Hale Terry Wilson Bill Hawks Frank McGrath Charlie Wooster Robert Fuller Cooper Smith Full Cast & Crew Last Season Season 8 1964 | 1 Episode Season 8 of Wagon Train premiered on September 20, 1964. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1965-01-24 Branded 8.3    1964-09-24 Daniel Boone 5.9    1963-09-24 Petticoat Junction 5.7    1963-09-29 My Favorite Martian 5.4    1966-09-12 Family Affair 5.4    1964-09-18 Twelve O'Clock High 8.2    1961-01-05 Mister Ed 7.4    1968-09-24 The Mod Squad 6.3  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords wagon train post civil war 19th century Content Score 86 Almost there... Top Contributors 54 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}