{"link": "https://www.themoviedb.org/tv/37759?language=en", "title": "Dallas", "resume": "J.R., Bobby and Sue Ellen Ewing are all back at Southfork, with plenty of secrets, schemes and betrayals in mind. This time, they're joined by the next generation of Ewings, who take ambition and deception to a new level.", "rate": 60, "genre": ["Drama"], "cast": ["Josh Henderson", "Jesse Metcalfe", "Jordana Brewster", "Julie Gonzalo", "Brenda Strong"], "character": ["John Ross Ewing", "Christopher Ewing", "Elena Ramos", "Pamela Rebecca Barnes", "Ann Ewing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37759   Expand Dallas   (2012) User Score  Play Trailer Overview J.R., Bobby and Sue Ellen Ewing are all back at Southfork, with plenty of secrets, schemes and betrayals in mind. This time, they're joined by the next generation of Ewings, who take ambition and deception to a new level. Featured Crew David Jacobs Creator Cynthia Cidre Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  14 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Henderson John Ross Ewing Jesse Metcalfe Christopher Ewing Jordana Brewster Elena Ramos Julie Gonzalo Pamela Rebecca Barnes Brenda Strong Ann Ewing Full Cast & Crew Last Season Season 3 2014 | 15 Episodes Season 3 of Dallas premiered on February 24, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply L Badly done! Open 2 by  Lloyd Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  10 Recommendations   2011-08-15 The Lying Game 6.1    1978-04-02 Dallas 6.1    1983-09-06 Taggart 7.7    1992-07-08 Melrose Place 4.9    1994-09-12 Party of Five 6.3    1987-03-09 French & Saunders 7.4    1998-09-04 Who Wants to Be a Millionaire? 6.1    1984-02-26 Spitting Image 7.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.tnt.tv/series/dallas/ Genres Drama Keywords southern usa texas ranch oil industry Content Score 100 Yes! Looking good! Top Contributors i 13 ismax935 11 CouchTater 10 Banana C 6 Chamelon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}