{"link": "https://www.themoviedb.org/tv/6005?language=en", "title": "Scooby-Doo and Scrappy-Doo", "resume": "The original thirty-minute version of Scooby-Doo and Scrappy-Doo constitutes the fourth incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo. It premiered on September 22, 1979 and ran for one season on ABC as a half-hour program. A total of sixteen episodes were produced. It was the last Hanna-Barbera cartoon series to use the studio's laugh track. Cartoon Network's classic channel Boomerang reruns the series.", "rate": 68, "genre": ["Animation", "Mystery", "Comedy"], "cast": ["Casey Kasem", "Don Messick"], "character": ["Shaggy", "Scooby Doo / Scrappy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6005   Expand Scooby-Doo and Scrappy-Doo   (1979) User Score Overview The original thirty-minute version of Scooby-Doo and Scrappy-Doo constitutes the fourth incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo. It premiered on September 22, 1979 and ran for one season on ABC as a half-hour program. A total of sixteen episodes were produced. It was the last Hanna-Barbera cartoon series to use the studio's laugh track. Cartoon Network's classic channel Boomerang reruns the series. Featured Crew Mark Evanier Creator Ken Spears Creator Joe Ruby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Kasem Shaggy Don Messick Scooby Doo / Scrappy Full Cast & Crew Last Season Season 6 1984 | 26 Episodes Season 6 of Scooby-Doo and Scrappy-Doo premiered on September  9, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Scooby-Doo and Scrappy-Doo. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1976-09-11 The Scooby-Doo Show 7.8    2002-09-14 What's New, Scooby-Doo? 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Mystery Comedy Keywords crime solving Content Score 64 We're so close, yet so far. Top Contributors N 108 Notamymerrick 13 Banana m 4 miroslav.kakas@gmail.com 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}