{"link": "https://www.themoviedb.org/tv/68848?language=en", "title": "Cesur Ve Güzel", "resume": "Tahsin is head of the Korludag family, his wealth and great influence in society makes him feared and respected by everyone. There isn’t a place or person in town that he does not control. Tahsin has two children; his son Korhan is a big disappointment to his father, but Sühan, his smart and beautiful daughter, he loves dearly. Korhan’s wife is without success trying to get pregnant. As she fears that Sühan will deliver an heir to the family fortune before herself, she tries to kill her sister-in-law. However, her evil plans are spoiled when a handsome stranger enters the story, saving Sühan's life, becoming her lover and taking his place as the son Tahsin always dreamt of. But what no one knows is that revenge runs in this stranger’s veins and it is no coincidence that he showed up when he did. Will his love for Sühan stop him going ahead with his plan to get vengeance on Tahsin or is it all part of his master plan…?", "rate": 100, "genre": ["Drama"], "cast": ["Kıvanç Tatlıtuğ", "Tuba Büyüküstün", "Nihan Büyükagaç", "Ali Pinar", "Okday Korunan"], "character": ["Cesur Alemdaroglu", "Suhan Korludag", "Adalet", "Hasan Karahasanoglu", "Salih"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68848   Expand Cesur Ve Güzel   (2016) User Score  Play Trailer Overview Tahsin is head of the Korludag family, his wealth and great influence in society makes him feared and respected by everyone. There isn’t a place or person in town that he does not control. Tahsin has two children; his son Korhan is a big disappointment to his father, but Sühan, his smart and beautiful daughter, he loves dearly. Korhan’s wife is without success trying to get pregnant. As she fears that Sühan will deliver an heir to the family fortune before herself, she tries to kill her sister-in-law. However, her evil plans are spoiled when a handsome stranger enters the story, saving Sühan's life, becoming her lover and taking his place as the son Tahsin always dreamt of. But what no one knows is that revenge runs in this stranger’s veins and it is no coincidence that he showed up when he did. Will his love for Sühan stop him going ahead with his plan to get vengeance on Tahsin or is it all part of his master plan…? Featured Crew Ali Bilgin Creator Kerem Catay Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kıvanç Tatlıtuğ Cesur Alemdaroglu Tuba Büyüküstün Suhan Korludag Nihan Büyükagaç Adalet Ali Pinar Hasan Karahasanoglu Okday Korunan Salih Full Cast & Crew Last Season Season 1 2016 | 32 Episodes Season 1 of Cesur Ve Güzel premiered on November 10, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cesur Ve Güzel. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors A 27 Alenp 25 moviefars s 14 salimsnake93 12 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}