{"link": "https://www.themoviedb.org/tv/65145?language=en", "title": "Aubaines & cie", "resume": "A fun and friendly one-hour magazine program that offers viewers shopping tips and tricks. Whether the topic is health products, fashion or décor matters, travel or pet care, Josée Turmel and Benoît Gagnon seek out expert advice and helps viewers make the best decisions possible!", "rate": 23, "genre": [], "cast": ["Josée Turmel"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65145   Expand Aubaines & cie   (2011) User Score Overview A fun and friendly one-hour magazine program that offers viewers shopping tips and tricks. Whether the topic is health products, fashion or décor matters, travel or pet care, Josée Turmel and Benoît Gagnon seek out expert advice and helps viewers make the best decisions possible! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josée Turmel Host Full Cast & Crew Last Season Season 6 2016 | 100 Episodes Season 6 of Aubaines & cie premiered on September 24, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Aubaines & cie. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  46m Homepage   http://noovo.ca/emissions/aubaines-cie/ Genres No genres have been added. Keywords shopping shopping show consumer magazine Content Score 50 Still needs a little work. Top Contributors 82 Banana 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}