{"link": "https://www.themoviedb.org/tv/4541?language=en", "title": "Total Recall 2070", "resume": "Total Recall 2070 is a science fiction television series first broadcast in 1999 on the Canadian television channel CHCH-TV and later the same year on the American Showtime channel. It was later syndicated in the United States with some editing to remove scenes of nudity, violence and strong language. The series was inspired by the 1990 film Total Recall, based on Philip K. Dick's short story \"We Can Remember It for You Wholesale\", and by Dick's novel Do Androids Dream of Electric Sheep?, with a visual style heavily influenced by the film Blade Runner, itself very loosely based on the same novel. However, other than the Rekall company and the concept of virtual vacations, the series shares no major plot points or characters with any of these works. Philip K. Dick is not credited in any way on the series main or end titles.\nThe series was filmed in Toronto. It was a Canadian/German co-production. Only one season, consisting of 22 episodes, was produced.", "rate": 62, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Michael Easton", "Karl Pruner", "Cynthia Preston", "Judith Krant", "Matthew Bennett"], "character": ["David Hume", "Ian Farve", "Olivia Hume", "Olan Chang", "James Calley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4541   Expand Total Recall 2070   (1999) User Score Overview Total Recall 2070 is a science fiction television series first broadcast in 1999 on the Canadian television channel CHCH-TV and later the same year on the American Showtime channel. It was later syndicated in the United States with some editing to remove scenes of nudity, violence and strong language. The series was inspired by the 1990 film Total Recall, based on Philip K. Dick's short story \"We Can Remember It for You Wholesale\", and by Dick's novel Do Androids Dream of Electric Sheep?, with a visual style heavily influenced by the film Blade Runner, itself very loosely based on the same novel. However, other than the Rekall company and the concept of virtual vacations, the series shares no major plot points or characters with any of these works. Philip K. Dick is not credited in any way on the series main or end titles. The series was filmed in Toronto. It was a Canadian/German co-production. Only one season, consisting of 22 episodes, was produced. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Easton David Hume Karl Pruner Ian Farve Cynthia Preston Olivia Hume Judith Krant Olan Chang Matthew Bennett James Calley Full Cast & Crew Last Season Season 1 1999 | 22 Episodes Season 1 of Total Recall 2070 premiered on January  5, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1998-10-23 Brimstone 7.6    1996-09-09 FX: The Series 7.0    1993-01-20 Time Trax 6.6    2005-06-08 The Inside 5.9    1997-04-03 Police Academy: The Series 5.6    1978-01-02 Blake's 7 7.0    1999-09-25 Relic Hunter 6.4    1994-03-05 Weird Science 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords future android technology police detective Content Score 86 Almost there... Top Contributors d 7 denis 6 Banana z 5 zurman1 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}