{"link": "https://www.themoviedb.org/tv/20993?language=en", "title": "Galactik Football", "resume": "Galactik Football is a french animated television series, co-produced by Alphanim, France 2, Jetix Europe, and Welkin-Animation. Its third 26-episode season aired in Europe in June 2010.\nIn the universe of Galactik Football, the inhabited worlds of the Zaelion Galaxy compete in Galactik Football, a sport analogous to football, but played seven to a side. The game is complicated by the addition of Flux, which enhances a player's attributes such as speed, strength, and agility, or grants special powers such as teleportation. The story follows the fate of an inexperienced Galactik Football team, the Snow Kids, as they aim to compete in the Galactik Football Cup.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20993   Expand Galactik Football   (2006) User Score Overview Galactik Football is a french animated television series, co-produced by Alphanim, France 2, Jetix Europe, and Welkin-Animation. Its third 26-episode season aired in Europe in June 2010. In the universe of Galactik Football, the inhabited worlds of the Zaelion Galaxy compete in Galactik Football, a sport analogous to football, but played seven to a side. The game is complicated by the addition of Flux, which enhances a player's attributes such as speed, strength, and agility, or grants special powers such as teleportation. The story follows the fate of an inexperienced Galactik Football team, the Snow Kids, as they aim to compete in the Galactik Football Cup. Featured Crew Antoine Charreyron Creator Frederic Dybowski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2010 | 26 Episodes Season 3 of Galactik Football premiered on July  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2005-08-27 A.T.O.M. 7.0    2004-12-18 W.I.T.C.H. 6.6    2001-09-26 What's with Andy? 7.3    2003-08-23 Sonic X 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  26m Homepage   http://www.galactikfootball.com/ Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 9 Malutki_27 6 virtualnation 3 Maikkoum s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}