{"link": "https://www.themoviedb.org/tv/65837?language=en", "title": "Schwarzes Marken", "resume": "Germany was divided into East and West after WWII, where citizens of either treated the other side as enemies. In the midst of Cold War, however, the Earth was invaded by an alien life form landed on Kashgar, Xinjiang Uyghur Autonomous Region, known as \"Beta.\" Now, ten years after the first contact, East Germany, formally German Democratic Republic, has become the front line.", "rate": 45, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kana Marutsuka", "Kenichi Suzumura", "Yoshino Nanjou", "Chika Anzai", "Kaori Fukuhara"], "character": ["Marai Heisenberg", "Theodor Eberbach", "Lise Hohenstein", "Anett Hosenfeld", "Inghild Bronikowski"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65837   Expand Schwarzes Marken   (2016) User Score Overview Germany was divided into East and West after WWII, where citizens of either treated the other side as enemies. In the midst of Cold War, however, the Earth was invaded by an alien life form landed on Kashgar, Xinjiang Uyghur Autonomous Region, known as \"Beta.\" Now, ten years after the first contact, East Germany, formally German Democratic Republic, has become the front line. Featured Crew Yoshida Hirohiko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Marutsuka Marai Heisenberg Kenichi Suzumura Theodor Eberbach Yoshino Nanjou Lise Hohenstein Chika Anzai Anett Hosenfeld Kaori Fukuhara Inghild Bronikowski Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Schwarzes Marken premiered on January 10, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Schwarzes Marken. You can help by rating TV shows you've seen. Facts Original Name  シュヴァルツェスマーケン Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords mecha Content Score 93 Almost there... Top Contributors M 29 Maddrax 25 Zlogorek 11 karaa 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}