{"link": "https://www.themoviedb.org/tv/75341?language=en", "title": "The Many Faces of Ito", "resume": "A jaded rom-com screenwriter in her 30s mines four love-sick women for their stories under the guise of providing them with romantic advice.", "rate": 70, "genre": ["Comedy"], "cast": ["Fumino Kimura", "Nozomi Sasaki", "Mirai Shida", "Elaiza Ikeda", "Kaho"], "character": ["Rio Yazaki", "Tomomi Shimabara", "Shuko Nose", "Satoko Aida", "Miki Jinbo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75341   Expand The Many Faces of Ito   (2017) User Score Overview A jaded rom-com screenwriter in her 30s mines four love-sick women for their stories under the guise of providing them with romantic advice. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fumino Kimura Rio Yazaki Nozomi Sasaki Tomomi Shimabara Mirai Shida Shuko Nose Elaiza Ikeda Satoko Aida Kaho Miki Jinbo Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of The Many Faces of Ito premiered on August 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2017-12-15 Erased 8.2  Facts Original Name  伊藤くん A to E Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.mbs.jp/ito-kun/ Genres Comedy Keywords japan romance Content Score 86 Almost there... Top Contributors M 28 Maria180493 9 CrewMdk MP 1 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}