{"link": "https://www.themoviedb.org/tv/9148?language=en", "title": "Great Mazinger", "resume": "After Koji Kabuto and Sayaka Yumi leave to the USA, it's up to the rash orphan Tetsuya Tsurugi to pilot the next Mazinger robot: the Great Mazinger. Under the direction of Dr. Kenzo Kabuto and helped by his adoptive sister Jun Honou, Tetsuya battles the Miccene Empire.", "rate": 75, "genre": ["Animation", "Action", "Adventure"], "cast": ["Keiichi Noda", "Hidekatsu Shibata", "Kazuko Sawada", "Kenichi Ogata", "Osamu Katou"], "character": ["Tetsuya Tsurugi", "Kenzou Kabuto", "Shiro Kabuto", "Ankoku Daishogun", "Archduke Gorgon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9148   Expand Great Mazinger   (1974) User Score Overview After Koji Kabuto and Sayaka Yumi leave to the USA, it's up to the rash orphan Tetsuya Tsurugi to pilot the next Mazinger robot: the Great Mazinger. Under the direction of Dr. Kenzo Kabuto and helped by his adoptive sister Jun Honou, Tetsuya battles the Miccene Empire. Featured Crew Gou Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keiichi Noda Tetsuya Tsurugi Hidekatsu Shibata Kenzou Kabuto Kazuko Sawada Shiro Kabuto Kenichi Ogata Ankoku Daishogun Osamu Katou Archduke Gorgon Full Cast & Crew Last Season Season 1 1974 | 56 Episodes Season 1 of Great Mazinger premiered on September  8, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Great Mazinger. You can help by rating TV shows you've seen. Facts Original Name  グレートマジンガー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 15 Elizabeth Jennings b 11 baux d 8 denis N 2 NightwingSK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}