{"link": "https://www.themoviedb.org/tv/62450?language=en", "title": "Plastic Memories", "resume": "After failing his college entrance exams, 18 year-old Tsukasa Mizugaki is offered a position at the renowned SAI Corporation, known for its production and management of Giftia, androids that possess human emotions. Tsukasa’s position is in the terminal service department where the main job is to recover Giftias that are close to their expiration, a graveyard department in every sense. To make matters worse, Tsukasa is ordered to work with Isla, a female Giftia who is never given any responsibility other than serving tea to co-workers.", "rate": 76, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Yasuaki Takumi", "Sora Amamiya", "Chinatsu Akasaki", "Sayuri Yahagi", "Megumi Toyoguchi"], "character": ["Mizugaki Tsukasa (voice)", "Isla (voice)", "Michiru Kinushima (voice)", "Zack (voice)", "Kazuki Kuwanomi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62450   Expand Plastic Memories   (2015) User Score  Play Trailer Overview After failing his college entrance exams, 18 year-old Tsukasa Mizugaki is offered a position at the renowned SAI Corporation, known for its production and management of Giftia, androids that possess human emotions. Tsukasa’s position is in the terminal service department where the main job is to recover Giftias that are close to their expiration, a graveyard department in every sense. To make matters worse, Tsukasa is ordered to work with Isla, a female Giftia who is never given any responsibility other than serving tea to co-workers. Featured Crew Naotaka Hayashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yasuaki Takumi Mizugaki Tsukasa (voice) Sora Amamiya Isla (voice) Chinatsu Akasaki Michiru Kinushima (voice) Sayuri Yahagi Zack (voice) Megumi Toyoguchi Kazuki Kuwanomi (voice) Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Plastic Memories premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  5 Recommendations   2013-09-09 Tokyo Ravens 5.8    2014-10-05 The Fruit of Grisaia 5.8    2012-10-05 Blast of Tempest 7.7    2016-04-05 Hundred 5.2    2017-01-13 Scum's Wish 7.7    2012-04-05 Sankarea: Undying Love 7.0    2012-10-12 Robotics;Notes 4.7    2013-10-02 Beyond the Boundary 7.0  Facts Original Name  プラスティック･メモリーズ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.plastic-memories.jp Genres Animation Drama Sci-Fi & Fantasy Keywords future android romance anime sci-fi romance human android relationship Content Score 100 Yes! Looking good! Top Contributors 66 Marr 🇳🇱 22 NekoMeowww s 15 sheva_vitali 10 Nippi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}