{"link": "https://www.themoviedb.org/tv/58057?language=en", "title": "Jack Irish", "resume": "Jack Irish is a man getting his life back together again. A former criminal lawyer whose world imploded, he now spends his days as a part-time investigator, debt collector, apprentice cabinet maker, punter and sometime lover – the complete man really. An expert in finding those who don’t want to be found – dead or alive, Jack helps out his mates while avoiding the past. That is until the past finds him.", "rate": 71, "genre": ["Drama"], "cast": ["Guy Pearce", "Marta Dusseldorp", "Aaron Pedersen", "Roy Billing", "Shane Jacobson"], "character": ["Jack Irish", "Linda Hillier", "Cam Delray", "Harry Strang", "Barry Tregear"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58057   Expand Jack Irish   (2012) User Score  Play Trailer Overview Jack Irish is a man getting his life back together again. A former criminal lawyer whose world imploded, he now spends his days as a part-time investigator, debt collector, apprentice cabinet maker, punter and sometime lover – the complete man really. An expert in finding those who don’t want to be found – dead or alive, Jack helps out his mates while avoiding the past. That is until the past finds him. Featured Crew Andrew Anastasios Creator Matt Cameron Creator Andrew Knight Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Pearce Jack Irish Marta Dusseldorp Linda Hillier Aaron Pedersen Cam Delray Roy Billing Harry Strang Shane Jacobson Barry Tregear Full Cast & Crew Last Season Series 3 2016 | 6 Episodes Season 3 of Jack Irish premiered on February 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2012-05-22 Hit & Miss 7.3    2011-07-19 The Hour 7.3    2014-01-09 The Spoils of Babylon 6.1    2011-10-21 Boss 7.7  Facts Status  Returning Series Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.abc.net.au/tv/programs/jack-irish/ Genres Drama Keywords private detective Content Score 100 Yes! Looking good! Top Contributors 29 United600 20 Elizabeth Jennings 3 stego77 3 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}