{"link": "https://www.themoviedb.org/tv/42779?language=en", "title": "Seventeen Moments of Spring", "resume": "A Soviet spy is tasked with disrupting the negotiations between Karl Wolff and Allen Dulles taking place in Switzerland, aimed at forging a separate peace between Germany and the Western Allies.", "rate": 77, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["Vyacheslav Tikhonov", "Leonid Bronevoy", "Evgeniy Evstigneev", "Rostislav Plyatt", "Oleg Tabakov"], "character": ["Max Otto von Stierlitz (Col. Maxim Isayev)", "Heinrich Mueller", "Professor Werner Pleischner", "Pastor Schlag", "Walter Schellenberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42779   Expand Seventeen Moments of Spring   (1973) User Score Overview A Soviet spy is tasked with disrupting the negotiations between Karl Wolff and Allen Dulles taking place in Switzerland, aimed at forging a separate peace between Germany and the Western Allies. Featured Crew Yulian Semyonov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  9 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Vyacheslav Tikhonov Max Otto von Stierlitz (Col. Maxim Isayev) Leonid Bronevoy Heinrich Mueller Evgeniy Evstigneev Professor Werner Pleischner Rostislav Plyatt Pastor Schlag Oleg Tabakov Walter Schellenberg Full Cast & Crew Last Season Season 1 1973 | 12 Episodes Season 1 of Seventeen Moments of Spring premiered on August 11, 1973. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Seventeen Moments of Spring. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  9 Recommendations   1969-01-01 Nu, pogodi! 6.8    1984-07-30 TASS Is Authorized to Declare... 7.3    2005-12-19 The Master and Margarita 6.0    1976-06-04 Twelve Chairs 7.5    1979-12-25 D'Artagnan and Three Musketeers 7.8    2004-05-07 Kikoriki 5.8    1983-08-10 Mirage 7.0    2008-04-07 Apostle 5.1  Facts Original Name  Семнадцать мгновений весны Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Miniseries Original Language  Russian Runtime  70m Homepage   http://mgnoveniya.ru Genres Action & Adventure Drama War & Politics Keywords spy world war ii miniseries woman director Content Score 100 Yes! Looking good! Top Contributors 59 West@ 19 Banana TB 13 TMDb Bot n 12 navarro2018  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}