{"link": "https://www.themoviedb.org/tv/6263?language=en", "title": "Kyojuu Tokusou Juspion", "resume": "Kyojuu Tokusou Juspion is a Japanese tokusatsu television series and part of the Metal Hero series. Produced by Toei Company, it was originally broadcast from 15 March 1985 to 24 March 1986, running for 46 episodes. The name \"Juspion\" is a portmanteau of \"Justice\" and \"Champion\". Juspion is the only Metal Hero series to focus on giant robot combat. Kyoujuu Tokusou Juspion was aired in Brazil through the now-defunct TV Manchete, becoming very popular in that country under the remodeled name \"Jaspion\". It was also aired in Indonesia and in France, where only a few episodes of the show were dubbed and transmitted. This was the first Metal Hero series to air on Mondays instead of Fridays.\nFor distribution purposes, Toei refers to this television series as Juspion.", "rate": 89, "genre": ["Action", "Adventure", "Comedy", "Drama", "Family", "Sci-Fi", "Fantasy"], "cast": ["Hikaru Kurosaki", "Kiyomi Tsukada", "Noboru Nakaya", "Jun'ichi Haruta", "Hiroshi Watari"], "character": ["Jaspion", "Anri", "Edin", "Mad Galan", "Boomerman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6263   Expand Kyojuu Tokusou Juspion   (1985) User Score Overview Kyojuu Tokusou Juspion is a Japanese tokusatsu television series and part of the Metal Hero series. Produced by Toei Company, it was originally broadcast from 15 March 1985 to 24 March 1986, running for 46 episodes. The name \"Juspion\" is a portmanteau of \"Justice\" and \"Champion\". Juspion is the only Metal Hero series to focus on giant robot combat. Kyoujuu Tokusou Juspion was aired in Brazil through the now-defunct TV Manchete, becoming very popular in that country under the remodeled name \"Jaspion\". It was also aired in Indonesia and in France, where only a few episodes of the show were dubbed and transmitted. This was the first Metal Hero series to air on Mondays instead of Fridays. For distribution purposes, Toei refers to this television series as Juspion. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hikaru Kurosaki Jaspion Kiyomi Tsukada Anri Noboru Nakaya Edin Jun'ichi Haruta Mad Galan Hiroshi Watari Boomerman Full Cast & Crew Last Season Season 1 1985 | 46 Episodes Season 1 of Kyojuu Tokusou Juspion premiered on March 15, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   1986-09-13 Wildfire 7.0    1985-02-02 Dengeki Sentai Changeman 9.3  Facts Original Name  巨獣特捜ジャスピオン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Comedy Drama Family Sci-Fi & Fantasy Keywords child hero tokusatsu Content Score 86 Almost there... Top Contributors NS 21 Norte Serra a 14 agabrielads 14 Elizabeth Jennings 10 pauloelifaz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}