{"link": "https://www.themoviedb.org/tv/70537?language=en", "title": "Prime Suspect 1973", "resume": "Prime Suspect 1973 tells the story of 22-year-old Jane Tennison's first days in the police force, in which she endured flagrant sexism before being thrown in at the deep end with a murder enquiry.", "rate": 81, "genre": ["Crime", "Drama"], "cast": ["Stefanie Martini", "Sam Reid", "Blake Harrison", "Alun Armstrong", "Jessica Gunning"], "character": ["Jane Tennison", "DI Len Bradfield", "DS Spencer Gibbs", "Clifford Bentley", "WPC Kath Morgan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70537   Expand Prime Suspect 1973   (2017) User Score  Play Trailer Overview Prime Suspect 1973 tells the story of 22-year-old Jane Tennison's first days in the police force, in which she endured flagrant sexism before being thrown in at the deep end with a murder enquiry. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stefanie Martini Jane Tennison Sam Reid DI Len Bradfield Blake Harrison DS Spencer Gibbs Alun Armstrong Clifford Bentley Jessica Gunning WPC Kath Morgan Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Prime Suspect 1973 premiered on March  2, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Prime Suspect 1973, aka Prime Suspect: Tennison. Good series! Open 12 by  genplant29 Stefanie Martini is super hot! Open 0 by domremy\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2014-10-06 Grantchester 7.3    2011-09-16 DCI Banks 7.9  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords young prostitute murder bank robbery Content Score 93 Almost there... Top Contributors 20 szab 13 Elizabeth Jennings 8 genplant29 a 4 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}