{"link": "https://www.themoviedb.org/tv/3788?language=en", "title": "Related", "resume": "Related is an American comedy-drama series that aired on The WB network during the 2005-2006 television season. It revolved around the lives of four close-knit sisters - of Italian descent, raised in Brooklyn - living in New York City.\nThe show was created by former Sex and the City writer Liz Tuccillo, and executive produced by Friends co-creator Marta Kauffman. Despite heavy promotion, initial ratings did not warrant the show being picked up for a second season when The WB network was folded into The CW.\nThe untitled Related theme song is sung by The Veronicas, whose music was regularly featured in episodes.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Lizzy Caplan", "Jennifer Esposito", "Callum Blue", "Kiele Sanchez", "Laura Breckenridge"], "character": ["Marjee Sorelli", "Ginnie Sorelli Spencer", "Bob Spencer", "Anne Sorelli", "Rose Sorelli"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3788   Expand Related   (2005) User Score Overview Related is an American comedy-drama series that aired on The WB network during the 2005-2006 television season. It revolved around the lives of four close-knit sisters - of Italian descent, raised in Brooklyn - living in New York City. The show was created by former Sex and the City writer Liz Tuccillo, and executive produced by Friends co-creator Marta Kauffman. Despite heavy promotion, initial ratings did not warrant the show being picked up for a second season when The WB network was folded into The CW. The untitled Related theme song is sung by The Veronicas, whose music was regularly featured in episodes. Featured Crew Liz Tuccillo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lizzy Caplan Marjee Sorelli Jennifer Esposito Ginnie Sorelli Spencer Callum Blue Bob Spencer Kiele Sanchez Anne Sorelli Laura Breckenridge Rose Sorelli Full Cast & Crew Last Season Season 1 2005 | 19 Episodes Season 1 of Related premiered on October  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Related. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Comedy Keywords new york sibling relationship italian american Content Score 93 Almost there... Top Contributors R 13 Rebafan23 12 Banana s 3 speedycars 1 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}