{"link": "https://www.themoviedb.org/tv/52891?language=en", "title": "YuruYuri: Happy Go Lily", "resume": "Four fun-loving schoolgirls decide to occupy the room of the defunct tea ceremony club for their own \"Gorakubu\" (amusement club). While the Student Council does its best to eliminate this club, their endless energy, happiness and comedy will keep audiences smiling all season long!", "rate": 55, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52891   Expand YuruYuri: Happy Go Lily   (2011) User Score Overview Four fun-loving schoolgirls decide to occupy the room of the defunct tea ceremony club for their own \"Gorakubu\" (amusement club). While the Student Council does its best to eliminate this club, their endless energy, happiness and comedy will keep audiences smiling all season long! Featured Crew Namori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2015 | 12 Episodes Season 3 of YuruYuri: Happy Go Lily premiered on October  5, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for YuruYuri: Happy Go Lily. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on YuruYuri: Happy Go Lily. You can help by rating TV shows you've seen. Facts Original Name  ゆるゆり Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  Japanese Runtime  25m Homepage   http://www.yuruyuri.com/ Genres Comedy Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 21 ManiacB 8 CrewMdk a 5 alfdurand14 B 5 Bonsai  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}