{"link": "https://www.themoviedb.org/tv/66671?language=en", "title": "Agatha Raisin", "resume": "Over the course of the fun and vibrant series, Agatha will attempt to solve a number of mysteries in the Cotswolds, from the death of a local witch to the demise of a flirtatious young vet. The will-they-won’t-they relationship between Agatha and on-off love interest James will continue, meanwhile, as the pair pose as a married couple in order to solve a crime.", "rate": 63, "genre": ["Comedy", "Mystery"], "cast": ["Mathew Horne", "Timothy Renouf", "Tim Stern", "Jamie Glover", "Ashley Jensen"], "character": ["Roy Silver", "Danny Shine", "Gene Harvey", "James Lacey", "Agatha Raisin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66671   Expand Agatha Raisin   (2016) User Score  Play Trailer Overview Over the course of the fun and vibrant series, Agatha will attempt to solve a number of mysteries in the Cotswolds, from the death of a local witch to the demise of a flirtatious young vet. The will-they-won’t-they relationship between Agatha and on-off love interest James will continue, meanwhile, as the pair pose as a married couple in order to solve a crime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mathew Horne Roy Silver Timothy Renouf Danny Shine Tim Stern Gene Harvey Jamie Glover James Lacey Ashley Jensen Agatha Raisin Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Agatha Raisin premiered on June  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2016-03-01 Loosely Exactly Nicole 5.8    2015-10-16 Truth Be Told 5.5    2016-10-19 HIM 6.2    2016-01-13 Teachers 7.1    2017-05-17 Downward Dog 6.7    2015-08-05 Difficult People 7.4    2016-09-05 Mary + Jane 6.1    2015-06-08 Odd Mom Out 6.7  Facts Status  Returning Series Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.sky.com/watch/channel/sky-1/agatha-raisin Genres Comedy Mystery Keywords amateur detective mystery british humour cotswolds Content Score 93 Almost there... Top Contributors E 15 Europe12 14 Elizabeth Jennings 11 Steve 9 Aty  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}