{"link": "https://www.themoviedb.org/tv/13266?language=en", "title": "Inspector George Gently", "resume": "Crime drama set in the 1960s about an old-school detective trying to come to terms with a time when the lines between the police and criminals have become blurred.", "rate": 83, "genre": ["Drama"], "cast": ["Martin Shaw", "Lee Ingleby", "Simon Hubbard"], "character": ["George Gently", "John Bacchus", "PC Taylor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13266   Expand Inspector George Gently   (2007) User Score  Play Trailer Overview Crime drama set in the 1960s about an old-school detective trying to come to terms with a time when the lines between the police and criminals have become blurred. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Shaw George Gently Lee Ingleby John Bacchus Simon Hubbard PC Taylor Full Cast & Crew Last Season Series 8 2017 | 2 Episodes Season 8 of Inspector George Gently premiered on May 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2011-05-01 Vera 6.8    2014-03-17 The Widower 6.8    2000-04-26 Rebus 4.9    2011-09-16 DCI Banks 7.9    2013-02-01 The Doctor Blake Mysteries 7.6    2013-03-10 Shetland 7.5    1992-12-06 A Touch of Frost 7.9    2012-06-26 Line of Duty 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/programmes/b00clbwj Genres Drama Keywords detective period drama 1960s Content Score 64 We're so close, yet so far. Top Contributors 33 Elizabeth Jennings c 9 conectas S 5 Shady12 3 SkullCollector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}