{"link": "https://www.themoviedb.org/tv/65392?language=en", "title": "Lucky Luke", "resume": "Lucky Luke, with his horse Double Six, travels the Old West to right wrongs and bring evildoers (usually his traditional enemies the Dalton Brothers) to justice. \"The man who shoots faster than his shadow.\"", "rate": 61, "genre": ["Animation", "Comedy", "Family", "Western"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65392   Expand Lucky Luke   (1984) User Score Overview Lucky Luke, with his horse Double Six, travels the Old West to right wrongs and bring evildoers (usually his traditional enemies the Dalton Brothers) to justice. \"The man who shoots faster than his shadow.\" Featured Crew Morris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Original Air Date Original Air Date Lucky Luke (DVD) Season 2 1986 | 28 Episodes Season 2 of Lucky Luke premiered on February  1, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  5 Recommendations   1979-03-24 Once Upon a Time... Man 8.2  Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  French Runtime  - Homepage  - Genres Animation Comedy Family Western Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors M 25 Mysti57 j 18 jvandborg c 9 copmad 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}