{"link": "https://www.themoviedb.org/tv/61913?language=en", "title": "I'm a Celebrity: Get Me Out of Here!", "resume": "The new series I’m A Celebrity… Get Me Out Of Here! promises to be one of the biggest and most exciting live reality television events of 2015, as Australian celebrities are dropped into the African jungle with little more than their wits, strength and willpower to survive the competition. \nOur celebrities will leave their beautiful homes, families and luxuries behind. How will they cope with African wildlife, a constant series of challenges and tests, basic rations and their fellow campmates? Who will survive the infamous Bush Tucker Trials? Who will win the hearts of viewers and be crowned King or Queen of the Jungle? \nAustralian families will cheer, cringe and laugh along, as they vote to decide what challenges the celebrities will face, who takes part in the Bush Tucker Trials and who will be forced to shout I’m A Celebrity… Get Me Out Of Here!", "rate": 45, "genre": ["Reality"], "cast": ["Julia Morris", "Chris Brown"], "character": ["Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61913   Expand I'm a Celebrity: Get Me Out of Here!   (2015) User Score  Play Trailer Overview The new series I’m A Celebrity… Get Me Out Of Here! promises to be one of the biggest and most exciting live reality television events of 2015, as Australian celebrities are dropped into the African jungle with little more than their wits, strength and willpower to survive the competition.  Our celebrities will leave their beautiful homes, families and luxuries behind. How will they cope with African wildlife, a constant series of challenges and tests, basic rations and their fellow campmates? Who will survive the infamous Bush Tucker Trials? Who will win the hearts of viewers and be crowned King or Queen of the Jungle?  Australian families will cheer, cringe and laugh along, as they vote to decide what challenges the celebrities will face, who takes part in the Bush Tucker Trials and who will be forced to shout I’m A Celebrity… Get Me Out Of Here! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Morris Herself Chris Brown Himself Full Cast & Crew Current Season Seasons 4 2018 | 1 Episode Season 4 of I'm a Celebrity: Get Me Out of Here! premiered on January 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I'm a Celebrity: Get Me Out of Here!. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Reality Original Language  English Runtime  90m, 60m Homepage   http://tenplay.com.au/channel-ten/im-a-celebrity-get-me-out-of-here Genres Reality Keywords africa celebrity survival jungle Content Score 64 We're so close, yet so far. Top Contributors c 45 courtneysmith86 17 Elizabeth Jennings 8 Banana TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}