{"link": "https://www.themoviedb.org/tv/39571?language=en", "title": "The Dean Martin Celebrity Roasts", "resume": "The Dean Martin Celebrity Roasts is a NBC television special show hosted by entertainer Dean Martin from 1974 to 1984. For a series of 54 specials and shows, Martin would periodically \"roast\" a celebrity. These roasts were patterned after the roasts held at the New York Friars' Club in New York City. The format would have the celebrity guest seated at a banquet table, and one by one the guest of honor was affectionately chided or insulted about his career by his fellow celebrity friends.\nIn 1973, The Dean Martin Show was declining in popularity. The final season of his variety show would be retooled into one of celebrity roasts, requiring less of Martin's involvement. For the 1973–1974 season, a new feature called “Man of the Week Celebrity Roast\" was added to try to pick up the ratings. The roasts seemed to be popular among television audiences and are often marketed in post-issues as part of the official Dean Martin Celebrity Roasts and not The Dean Martin Show. After The Dean Martin Show was cancelled in 1974, NBC drew up a contract with Martin to do several specials and do more roast specials. Starting with Bob Hope in 1974, the roast was taped in California and turned out to be a hit, leading to many other roasts to follow.", "rate": 30, "genre": ["Comedy"], "cast": ["Cliff Robertson", "Jack Benny", "James Stewart", "Nipsey Russell"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39571   Expand The Dean Martin Celebrity Roasts   (1974) User Score Overview The Dean Martin Celebrity Roasts is a NBC television special show hosted by entertainer Dean Martin from 1974 to 1984. For a series of 54 specials and shows, Martin would periodically \"roast\" a celebrity. These roasts were patterned after the roasts held at the New York Friars' Club in New York City. The format would have the celebrity guest seated at a banquet table, and one by one the guest of honor was affectionately chided or insulted about his career by his fellow celebrity friends. In 1973, The Dean Martin Show was declining in popularity. The final season of his variety show would be retooled into one of celebrity roasts, requiring less of Martin's involvement. For the 1973–1974 season, a new feature called “Man of the Week Celebrity Roast\" was added to try to pick up the ratings. The roasts seemed to be popular among television audiences and are often marketed in post-issues as part of the official Dean Martin Celebrity Roasts and not The Dean Martin Show. After The Dean Martin Show was cancelled in 1974, NBC drew up a contract with Martin to do several specials and do more roast specials. Starting with Bob Hope in 1974, the roast was taped in California and turned out to be a hit, leading to many other roasts to follow. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cliff Robertson Jack Benny James Stewart Himself Nipsey Russell Full Cast & Crew Last Season Season 1 — | 25 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Dean Martin Celebrity Roasts. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords celebrity roast Content Score 86 Almost there... Top Contributors 15 Banana 14 Elizabeth Jennings e 2 elibiva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}