{"link": "https://www.themoviedb.org/tv/5339?language=en", "title": "The Inside", "resume": "The Inside is an American crime drama television series created by Tim Minear and Howard Gordon and produced by Imagine Television. The Inside follows the work of the FBI's Los Angeles Violent Crimes Unit, a division dedicated to investigating particularly dangerous crimes. The Inside initially aired on the Fox Network from June 8 to July 13, 2005. Although thirteen episodes were produced, Fox aired only seven episodes before canceling the series. All thirteen episodes were subsequently aired on Britain's ITV4 in 2006.", "rate": 74, "genre": ["Drama"], "cast": ["Katie Finneran", "Adam Baldwin", "Peter Coyote", "Jay Harrington", "Rachel Nichols"], "character": ["Special Agent Rebecca Locke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5339   Expand The Inside   (2005) User Score Overview The Inside is an American crime drama television series created by Tim Minear and Howard Gordon and produced by Imagine Television. The Inside follows the work of the FBI's Los Angeles Violent Crimes Unit, a division dedicated to investigating particularly dangerous crimes. The Inside initially aired on the Fox Network from June 8 to July 13, 2005. Although thirteen episodes were produced, Fox aired only seven episodes before canceling the series. All thirteen episodes were subsequently aired on Britain's ITV4 in 2006. Featured Crew Tim Minear Creator Howard Gordon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katie Finneran Adam Baldwin Peter Coyote Jay Harrington Rachel Nichols Special Agent Rebecca Locke Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of The Inside premiered on June  8, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2007-03-11 Blood Ties 7.4    2001-10-06 Mutant X 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords fbi los angeles criminology Content Score 93 Almost there... Top Contributors 16 lineker c 3 coho 3 MacFly 🇫🇷 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}