{"link": "https://www.themoviedb.org/tv/69284?language=en", "title": "Fuuka", "resume": "Yuu Haruna, a loner and an avid Twitter user, has just transferred to a new school in Tokyo. He ends up befriending a unique high school girl named Fuuka Akitsuki, despite some initial conflict, and the two wind up forming a band together with their classmates. Their relationship becomes strained however when Koyuki Hinashi, Yuu's childhood friend who has become a popular idol, contacts Yuu on Twitter and attempts to rekindle long lost feelings.", "rate": 73, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Lynn", "Saori Hayami", "Yuusuke Kobayashi", "Souma Saitou", "Kazuyuki Okitsu"], "character": ["Akitsuki Fuuka", "Hinashi Koyuki", "Haruna Yuu", "Mikasa Makoto", "Nachi Kazuya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69284   Expand Fuuka   (2017) User Score  Play Trailer Overview Yuu Haruna, a loner and an avid Twitter user, has just transferred to a new school in Tokyo. He ends up befriending a unique high school girl named Fuuka Akitsuki, despite some initial conflict, and the two wind up forming a band together with their classmates. Their relationship becomes strained however when Koyuki Hinashi, Yuu's childhood friend who has become a popular idol, contacts Yuu on Twitter and attempts to rekindle long lost feelings. Featured Crew Kōji Seo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lynn Akitsuki Fuuka Saori Hayami Hinashi Koyuki Yuusuke Kobayashi Haruna Yuu Souma Saitou Mikasa Makoto Kazuyuki Okitsu Nachi Kazuya Full Cast & Crew Last Season Season 1 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2017-01-06 Seiren 6.3    2017-07-04 Tsuredure Children 8.0    2017-07-12 My First Girlfriend is a Gal 7.4    2017-07-03 Restaurant to Another World 8.8    2016-07-02 First Love Monster 5.7    2017-01-04 Akiba's Trip The Animation 8.8    2017-04-05 Sakura Quest 8.5    2017-07-13 Gamers! 7.8  Facts Original Name  風夏 Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.fuuka.tv/ Genres Animation Comedy Drama Keywords music romance school anime Content Score 100 Yes! Looking good! Top Contributors 39 cmetz2 B 27 Bonsai C 17 Chintaran z 15 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}