{"link": "https://www.themoviedb.org/tv/76819?language=en", "title": "Requiem", "resume": "In 1994, a toddler disappeared from a small Welsh village, never to be seen again. 23 years later, in London, the mother of rising cello star Matilda Gray commits suicide, without apparent reason. Among her possessions, Matilda discovers tantalising evidence, linking her mother to the Welsh girl's disappearance all those years ago.", "rate": 63, "genre": ["Drama"], "cast": ["Lydia Wilson", "Joel Fry", "James Frecheville", "Claire Rushbrook", "Joanna Scanlan"], "character": ["Matilda Gray", "Hal Fine", "Nick Dean", "Rose Morgan", "Janice Gray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76819   Expand Requiem   (2018) User Score  Play Trailer Overview In 1994, a toddler disappeared from a small Welsh village, never to be seen again. 23 years later, in London, the mother of rising cello star Matilda Gray commits suicide, without apparent reason. Among her possessions, Matilda discovers tantalising evidence, linking her mother to the Welsh girl's disappearance all those years ago. Featured Crew Kris Mrksa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lydia Wilson Matilda Gray Joel Fry Hal Fine James Frecheville Nick Dean Claire Rushbrook Rose Morgan Joanna Scanlan Janice Gray Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Requiem premiered on February  2, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Enjoyed! Open 7 by  Oldnewbie Well done... Open 0 by Oldnewbie\n      \n     What's next? Open 0 by MongoLloyd\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2017-11-02 Borderliner 6.7    2018-03-26 The Chalet 7.3    2018-05-10 Safe 7.1    2017-10-13 Lore 6.1    2017-11-07 Damnation 7.2    2017-10-29 Tabula Rasa 7.8    2018-05-04 The Rain 6.1    2018-02-23 Seven Seconds 8.2  Facts Status  Returning Series Networks Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/p05td61g Genres Drama Keywords thriller psychological thriller psychological Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 13 mojodo b 10 basher Y 7 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}