{"link": "https://www.themoviedb.org/tv/68094?language=en", "title": "Belfer", "resume": "The death of a young girl shakes the local community. At the same time Dobrowicach appears Paul Zawadzki. Who is? Why a teacher from a reputable school in Warsaw and takes a job in the country? Paul begins his own investigation. In the face of crime there is no room for half-truths. However, although we all here know and they know everything about each other, Paul, no one will say. Belfer is left alone.", "rate": 71, "genre": ["Crime"], "cast": ["Maciej Stuhr", "Katarzyna Dąbrowska", "Michalina Łabacz", "Szymon Piotr Warszawski", "Eliza Rycembel"], "character": ["Paweł Zawadzki", "Marta Mirska", "Magda Reiss", "Radosław Kędzierski, oficer CBŚ", "Luiza Długosz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68094   Expand Belfer   (2016) User Score Overview The death of a young girl shakes the local community. At the same time Dobrowicach appears Paul Zawadzki. Who is? Why a teacher from a reputable school in Warsaw and takes a job in the country? Paul begins his own investigation. In the face of crime there is no room for half-truths. However, although we all here know and they know everything about each other, Paul, no one will say. Belfer is left alone. Featured Crew Jakub Żulczyk Creator Monika Powalisz Creator Krzysztof Łukaszewicz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maciej Stuhr Paweł Zawadzki Katarzyna Dąbrowska Marta Mirska Michalina Łabacz Magda Reiss Szymon Piotr Warszawski Radosław Kędzierski, oficer CBŚ Eliza Rycembel Luiza Długosz Full Cast & Crew Current Season Season 2 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2015-11-08 The Pact 6.1    2014-10-12 The Border 7.0    2001-09-09 Band of Brothers 8.2    2014-04-15 Fargo 8.2    2014-01-12 True Detective 8.1    2008-01-19 Breaking Bad 8.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Polish Runtime  55m Homepage   https://belfer.canalplus.pl/ Genres Crime Keywords investigation school Content Score 100 Yes! Looking good! Top Contributors 43 auu 32 Maciekw j 28 jelonki20 24 Capa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}