{"link": "https://www.themoviedb.org/tv/13818?language=en", "title": "Branded", "resume": "Branded is an American Western series which aired on NBC from 1965 through 1966, sponsored by Procter & Gamble in its Sunday night 8:30 p.m. Eastern Time period, and starred Chuck Connors as Jason McCord, a United States Army Cavalry captain who had been drummed out of the service following an unjust accusation of cowardice.", "rate": 79, "genre": ["Western"], "cast": ["Chuck Connors"], "character": ["Captain Jason McCord"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13818   Expand Branded   (1965) User Score Overview Branded is an American Western series which aired on NBC from 1965 through 1966, sponsored by Procter & Gamble in its Sunday night 8:30 p.m. Eastern Time period, and starred Chuck Connors as Jason McCord, a United States Army Cavalry captain who had been drummed out of the service following an unjust accusation of cowardice. Featured Crew Larry Cohen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chuck Connors Captain Jason McCord Full Cast & Crew Last Season Season 2 1965 | 32 Episodes Season 2 of Branded premiered on September 12, 1965. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1957-09-18 Wagon Train 6.3    1968-09-24 The Mod Squad 6.3    1963-09-29 My Favorite Martian 5.4    1963-09-24 Petticoat Junction 5.7    1964-09-18 Twelve O'Clock High 8.2    1957-09-14 Have Gun – Will Travel 8.3    1966-09-12 Family Affair 5.4    1965-09-14 Please Don't Eat the Daisies 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Keywords cowardice wild west ex soldier Content Score 64 We're so close, yet so far. Top Contributors 10 Banana PE 4 Patrick E. Abe _ 2 _mce_ 1 aireooo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}