{"link": "https://www.themoviedb.org/tv/34166?language=en", "title": "Kino's Journey", "resume": "In Kino's Journey, the protagonist, Kino, accompanied by a talking motorcycle named Hermes, travels through a mystical world of many different countries and forests, each unique in its customs and people. She only spends three days and two nights in every town, without exception, on the principle that three days is enough time to learn almost everything important about a place, while leaving time to explore new lands.", "rate": 74, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Ai Maeda", "Ryuji Aigase", "Takashi Irie", "Hōchū Ōtsuka", "Aoi Yuki"], "character": ["Kino", "Hermes", "Shizu", "Riku", "Sakura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34166   Expand Kino's Journey   (2003) User Score Overview In Kino's Journey, the protagonist, Kino, accompanied by a talking motorcycle named Hermes, travels through a mystical world of many different countries and forests, each unique in its customs and people. She only spends three days and two nights in every town, without exception, on the principle that three days is enough time to learn almost everything important about a place, while leaving time to explore new lands. Featured Crew Keiichi Sigsawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ai Maeda Kino Ryuji Aigase Hermes Takashi Irie Shizu Hōchū Ōtsuka Riku Aoi Yuki Sakura Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Kino's Journey premiered on April  8, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations   2012-04-10 Jormungand 7.4    2012-01-10 Daily Lives of High School Boys 7.3  Facts Original Name  キノの旅 Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.kinonotabi.com Genres Animation Drama Sci-Fi & Fantasy Keywords adventure slice of life psychological based on light novel anime parables traveling Content Score 93 Almost there... Top Contributors 36 Marr 🇳🇱 13 Elizabeth Jennings 13 Ailurus Fulgens 12 WillofOwn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}