{"link": "https://www.themoviedb.org/tv/598?language=en", "title": "Two Pints of Lager and a Packet of Crisps", "resume": "Two Pints of Lager and a Packet of Crisps is a British comedy television series sitcom that ran from 26 February 2001 to 24 May 2011 and starring Sheridan Smith, Will Mellor, Ralf Little, Natalie Casey, Kathryn Drysdale and Luke Gell. Created and written by Susan Nickson, it is set in the town of Runcorn in Cheshire, England, and originally revolves around the lives of five twenty-somethings. In September 2007 Little confirmed in an interview on This Morning that he had left the series. The seventh series aired following a two year hiatus in 2008 with Little's character being killed off in the first episode. Smith and Drysdale did not return for the ninth and final series with their departures being mentioned briefly in the first episode, Freddie Hogan and Georgia Henshaw were brought in as their replacements making Mellor and Casey the only original characters left in the series. Writer & Creator, Susan Nickson also left before the ninth series.\nThe core cast have been augmented by various recurring characters throughout the series, including Beverly Callard, Lee Oakes, Hayley Bishop, Alison Mac, Thomas Nelstrop and Jonathon Dutton. The show was first broadcast in 2001 on BBC Two. The title was inspired by the 1980 hit single \"Two Pints of Lager and a Packet of Crisps Please\" by Splodgenessabounds.", "rate": 69, "genre": ["Comedy"], "cast": ["Kathryn Drysdale", "Will Mellor", "Sheridan Smith", "Ralf Little", "Natalie Casey"], "character": ["Louise", "Gaz", "Janet", "Jonny", "Donna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 598   Expand Two Pints of Lager and a Packet of Crisps   (2001) User Score Overview Two Pints of Lager and a Packet of Crisps is a British comedy television series sitcom that ran from 26 February 2001 to 24 May 2011 and starring Sheridan Smith, Will Mellor, Ralf Little, Natalie Casey, Kathryn Drysdale and Luke Gell. Created and written by Susan Nickson, it is set in the town of Runcorn in Cheshire, England, and originally revolves around the lives of five twenty-somethings. In September 2007 Little confirmed in an interview on This Morning that he had left the series. The seventh series aired following a two year hiatus in 2008 with Little's character being killed off in the first episode. Smith and Drysdale did not return for the ninth and final series with their departures being mentioned briefly in the first episode, Freddie Hogan and Georgia Henshaw were brought in as their replacements making Mellor and Casey the only original characters left in the series. Writer & Creator, Susan Nickson also left before the ninth series. The core cast have been augmented by various recurring characters throughout the series, including Beverly Callard, Lee Oakes, Hayley Bishop, Alison Mac, Thomas Nelstrop and Jonathon Dutton. The show was first broadcast in 2001 on BBC Two. The title was inspired by the 1980 hit single \"Two Pints of Lager and a Packet of Crisps Please\" by Splodgenessabounds. Featured Crew Susan Nickson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathryn Drysdale Louise Will Mellor Gaz Sheridan Smith Janet Ralf Little Jonny Natalie Casey Donna Full Cast & Crew Last Season Season 9 2011 | 6 Episodes Season 9 of Two Pints of Lager and a Packet of Crisps premiered on April 26, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Janet: Happy Birthday Sheridan Smith! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1996-03-18 This Life 4.8    1998-11-12 Dinnerladies 6.4    2002-09-06 Bo' Selecta! 7.0    2002-11-14 Harry Hill's TV Burp 7.2    2005-06-05 Mock the Week 7.0    2004-03-12 The Worst Week of My Life 8.6    2004-09-03 Green Wing 8.0    2004-01-13 Shameless 7.5  Facts Status  Ended Networks Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/twopints/ Genres Comedy Keywords northern england bar sexual humor vulgarity dating group of friends sitcom innuendo british humour Content Score 93 Almost there... Top Contributors E 40 Elky 10 Banana a 10 alexmate S 3 SergoKan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}