{"link": "https://www.themoviedb.org/tv/5150?language=en", "title": "Around the World with Willy Fog", "resume": "Around the World with Willy Fog is a cartoon adaptation of Around the World in Eighty Days by Jules Verne. The cartoon was produced by Spanish studio BRB Internacional with animation by Japanese studio Nippon Animation. In the same vein as BRB's Dogtanian and the Three Muskehounds, the characters are anthropomorphisms of various animals as the species depicted are of much greater variety than in that series. The core trio are all felines being pursued by three canine foes. Willy Fog is depicted as a lion, while Rigodon is actually a cat and not a lynx because of his tail and ears and Romy a panther.\nAn English dub of the series was directed by Tom Wyner, which featured artists such as Cam Clarke, Gregory Snegoff, Steve Kramer and Mike Reynolds. While the series never achieved popularity in the United States, the English version found fame when it was broadcast on Children's BBC in the United Kingdom. The series was initially screened in 1984 in the UK and then on RTE in Ireland, while other dubs gained the series fanbases in several other countries. The series was also dubbed into Japanese and aired on Japan's TV Asahi in 1987, where it was titled Anime Around the World in 80 Days.", "rate": 81, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5150   Expand Around the World with Willy Fog   (1983) User Score Overview Around the World with Willy Fog is a cartoon adaptation of Around the World in Eighty Days by Jules Verne. The cartoon was produced by Spanish studio BRB Internacional with animation by Japanese studio Nippon Animation. In the same vein as BRB's Dogtanian and the Three Muskehounds, the characters are anthropomorphisms of various animals as the species depicted are of much greater variety than in that series. The core trio are all felines being pursued by three canine foes. Willy Fog is depicted as a lion, while Rigodon is actually a cat and not a lynx because of his tail and ears and Romy a panther. An English dub of the series was directed by Tom Wyner, which featured artists such as Cam Clarke, Gregory Snegoff, Steve Kramer and Mike Reynolds. While the series never achieved popularity in the United States, the English version found fame when it was broadcast on Children's BBC in the United Kingdom. The series was initially screened in 1984 in the UK and then on RTE in Ireland, while other dubs gained the series fanbases in several other countries. The series was also dubbed into Japanese and aired on Japan's TV Asahi in 1987, where it was titled Anime Around the World in 80 Days. Featured Crew Luis Ballester Bustos Creator Fumio Kurokawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1993 | 13 Episodes Season 3 of Around the World with Willy Fog premiered on January  2, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  9 Recommendations   1985-10-26 David the Gnome 7.3    1982-10-08 Once upon a time… Space 5.9    1981-10-09 Dogtanian and the Three Muskehounds 6.5    1998-01-17 Once Upon a Time... The Explorers 7.8    1994-11-10 Kommissar Rex 4.9    1984-09-05 Heathcliff & the Catillac Cats 5.4    1987-06-17 Once Upon a Time... Life 8.0    1984-10-15 Lucky Luke 6.1  Facts Original Name  アニメ８０日間世界一周 Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  26m Homepage   1983 Genres Animation Kids Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 25 BrerFox M 10 Melsar c 7 copmad b 7 baux  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}