{"link": "https://www.themoviedb.org/tv/46337?language=en", "title": "Cross Game", "resume": "Kō Kitamura, whose family owns a sporting goods store, has known the Tsukishima  girls since he was born. The Tsukishima family runs a batting center and  cafe, and they have four daughters. There's Ichiyo, the responsible  eldest; Wakaba, Kō's cheerful best friend; Aoba, who doesn't get along  with Kō; and Momiji, the energetic youngest daughter.  During the summer of their fifth grade, Wakaba leaves for camp after  making a promise with Kō to go to the summer festival when she gets  back. But she dies in an accident while at camp, and Kō goes to the  summer festival by himself in mourning.  When Kō enters high school, he aspires to lead his baseball team to the  Koshien National High Schol Championship as their ace pitcher and make  Wakaba's last dream come true.", "rate": 87, "genre": ["Animation", "Comedy", "Drama", "Romance"], "cast": ["Miyu Irino", "Haruka Tomatsu", "Akemi Kanda", "Megumi Toyoguchi", "Noriko Shitaya"], "character": ["Kō Kitamura (voice)", "Aoba Tsukishima (voice)", "Wakaba Tsukishima (voice)", "Ichiyō Tsukishima (voice)", "Momiji Tsukishima (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46337   Expand Cross Game   (2009) User Score Overview Kō Kitamura, whose family owns a sporting goods store, has known the Tsukishima  girls since he was born. The Tsukishima family runs a batting center and  cafe, and they have four daughters. There's Ichiyo, the responsible  eldest; Wakaba, Kō's cheerful best friend; Aoba, who doesn't get along  with Kō; and Momiji, the energetic youngest daughter.  During the summer of their fifth grade, Wakaba leaves for camp after  making a promise with Kō to go to the summer festival when she gets  back. But she dies in an accident while at camp, and Kō goes to the  summer festival by himself in mourning.  When Kō enters high school, he aspires to lead his baseball team to the  Koshien National High Schol Championship as their ace pitcher and make  Wakaba's last dream come true. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyu Irino Kō Kitamura (voice) Haruka Tomatsu Aoba Tsukishima (voice) Akemi Kanda Wakaba Tsukishima (voice) Megumi Toyoguchi Ichiyō Tsukishima (voice) Noriko Shitaya Momiji Tsukishima (voice) Full Cast & Crew Last Season Season 1 2009 | 50 Episodes Season 1 of Cross Game premiered on April  5, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  17 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cross Game. You can help by rating TV shows you've seen. Facts Original Name  クロスゲーム Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/anime/crossgame/ Genres Animation Comedy Drama Romance Keywords sport baseball school based on manga shounen anime tsundere Content Score 86 Almost there... Top Contributors 51 United600 20 sp1ti 10 deanzel 4 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}