{"link": "https://www.themoviedb.org/tv/40632?language=en", "title": "Fresh Meat", "resume": "A group of six students about to embark on the most exciting period of their lives so far: university!", "rate": 74, "genre": ["Drama", "Comedy"], "cast": ["Kimberley Nixon", "Zawe Ashton", "Tony Gardner", "Charlotte Ritchie", "Greg McHugh"], "character": ["Josie", "Vod", "Tony Shales", "Oregon", "Howard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40632   Expand Fresh Meat   (2011) User Score  Play Trailer Overview A group of six students about to embark on the most exciting period of their lives so far: university! Featured Crew Jesse Armstrong Creator Sam Bain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kimberley Nixon Josie Zawe Ashton Vod Tony Gardner Tony Shales Charlotte Ritchie Oregon Greg McHugh Howard Full Cast & Crew Last Season Season 4 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply It's like Inbetweeners - Uni version for Simon Open 2 by  lmao7 Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  8 Recommendations   2008-05-01 The Inbetweeners 7.7    2009-11-06 Campus 7.1    2009-02-25 Burnistoun 7.8    2012-02-20 The Bleak Old Shop of Stuff 6.7    2015-08-25 Fried 6.0    2013-10-18 The Birthday Boys 7.1    2013-01-17 Way to Go 5.7    2011-02-08 Traffic Light 7.2  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  40m, 41m Homepage   http://www.channel4.com/programmes/fresh-meat Genres Drama Comedy Keywords england roommate college british comedy sitcom young adult manchester Content Score 100 Yes! Looking good! Top Contributors 31 Banana 20 Sc00ge 18 DBD p 9 payne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}