{"link": "https://www.themoviedb.org/tv/17338?language=en", "title": "GameCenter CX", "resume": "GameCenter CX, also known as Retro Game Master in other regions, is a Japanese television series where Shinya Arino, a member of comedy duo Yoiko, plays Japan's most popular video games and records his progress as he works through a time limit, usually lasting up to one day. He is supported by his Assistant Directors and Staff, both via moral support and actual gameplay. He also gets the chance to interview game designers and to play arcade games occasionally.\nThere are currently 9 DVD sets released in Japan. The 9th DVD set was released in Japan on December 21, 2012. The show has been on-air since November 4, 2003 with a new episode every 2 weeks when a season is running. In 2008 Fuji TV was looking for international distributors for subtitled DVDs. A movie is currently planned for the 10th year anniversary of the show. A third game which will be released on the Nintendo 3DS platform has been announced.", "rate": 95, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17338   Expand GameCenter CX   (2003) User Score Overview GameCenter CX, also known as Retro Game Master in other regions, is a Japanese television series where Shinya Arino, a member of comedy duo Yoiko, plays Japan's most popular video games and records his progress as he works through a time limit, usually lasting up to one day. He is supported by his Assistant Directors and Staff, both via moral support and actual gameplay. He also gets the chance to interview game designers and to play arcade games occasionally. There are currently 9 DVD sets released in Japan. The 9th DVD set was released in Japan on December 21, 2012. The show has been on-air since November 4, 2003 with a new episode every 2 weeks when a season is running. In 2008 Fuji TV was looking for international distributors for subtitled DVDs. A movie is currently planned for the 10th year anniversary of the show. A third game which will be released on the Nintendo 3DS platform has been announced. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Retro game master season 17 2013 | 15 Episodes Season 17 of GameCenter CX premiered on April 11, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for GameCenter CX. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on GameCenter CX. You can help by rating TV shows you've seen. Facts Original Name  ゲームセンターCX Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 Elizabeth Jennings TB 4 TMDb Bot 4 Kupo 3 brasileiro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}