{"link": "https://www.themoviedb.org/tv/33057?language=en", "title": "Ice Pilots NWT", "resume": "Ice Pilots NWT is a reality television series broadcast on History Canada that portrays Buffalo Airways, an airline based in Yellowknife, Northwest Territories, Canada. Buffalo mainly flies WWII-era propeller planes year-round in the Canadian North. It premiered on November 18, 2009. The show was renewed for a second season with filming completed on August 2, 2010. The season premiere was aired on History Television January 12, 2011. Season 3 was greenlit on August 18, 2010 and began airing on October 12, 2011. In the UK, series 2 was shown on Quest commencing May 2011. The episodes in season 4 have been shown on the Discovery Channel in the UK. Season 1 of Ice Pilots began airing on the National Geographic Channel in the US on April 22, 2011. Both Season 1 and 2 have aired in Australia on National Geographic Channel and National Geographic Channel HD and currently air on the digital channel 7 Mate.\nOn February 2, 2012 The Weather Channel announced that it was adding Ice Pilots to its primetime lineup. On March 5, 2012 the show started airing on The Weather Channel, starting with seasons 1 and 2.\nThe National Geographic Channel no longer airs the show regularly, though it does occasionally broadcast episodes.", "rate": 70, "genre": ["Documentary"], "cast": ["Joe McBryan", "Mikey McBryan", "Michael Daingerfield"], "character": ["Himself, Buffalo Joe", "Himself", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33057   Expand Ice Pilots NWT   (2009) User Score  Play Trailer Overview Ice Pilots NWT is a reality television series broadcast on History Canada that portrays Buffalo Airways, an airline based in Yellowknife, Northwest Territories, Canada. Buffalo mainly flies WWII-era propeller planes year-round in the Canadian North. It premiered on November 18, 2009. The show was renewed for a second season with filming completed on August 2, 2010. The season premiere was aired on History Television January 12, 2011. Season 3 was greenlit on August 18, 2010 and began airing on October 12, 2011. In the UK, series 2 was shown on Quest commencing May 2011. The episodes in season 4 have been shown on the Discovery Channel in the UK. Season 1 of Ice Pilots began airing on the National Geographic Channel in the US on April 22, 2011. Both Season 1 and 2 have aired in Australia on National Geographic Channel and National Geographic Channel HD and currently air on the digital channel 7 Mate. On February 2, 2012 The Weather Channel announced that it was adding Ice Pilots to its primetime lineup. On March 5, 2012 the show started airing on The Weather Channel, starting with seasons 1 and 2. The National Geographic Channel no longer airs the show regularly, though it does occasionally broadcast episodes. Featured Crew David Gullason Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe McBryan Himself, Buffalo Joe Mikey McBryan Himself Michael Daingerfield Narrator Full Cast & Crew Last Season Season 6 2014 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ice Pilots NWT. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.icepilots.com/index.php Genres Documentary Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 19 colonelgrant p 7 pucxy TB 5 TMDb Bot a 3 arcaida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}