{"link": "https://www.themoviedb.org/tv/80461?language=en", "title": "Music Girls", "resume": "There are eleven girls that consist the C-class Ongaku Shoujo idol unit under Pine Records. Despite generating red sales marks and not being very popular, Producer Ikebashi and the members are trying their very best to up their levels. Nevertheless, Ikebashi suggests recruiting a new member for Ongaku Shoujo; someone who can act as a catalyst for the success of the group. Thus, an audition was opened, leading to the soon-to-be legendary group's meeting to a girl named Hanako.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80461   Expand Music Girls   (2018) User Score Overview There are eleven girls that consist the C-class Ongaku Shoujo idol unit under Pine Records. Despite generating red sales marks and not being very popular, Producer Ikebashi and the members are trying their very best to up their levels. Nevertheless, Ikebashi suggests recruiting a new member for Ongaku Shoujo; someone who can act as a catalyst for the success of the group. Thus, an audition was opened, leading to the soon-to-be legendary group's meeting to a girl named Hanako. Featured Crew Yukio Nishimoto Creator Deko Akao Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Music Girls is set to premiere on July  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Facts Original Name  音楽少女 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://ongaku-shoujo.jp/ Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 14 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}