{"link": "https://www.themoviedb.org/tv/80462?language=en", "title": "Chio's School Road", "resume": "This is a story of a nerdy bookworm girl on her way to school, and yes, that's the entire premise, as she's not getting to school any time soon. Taking her \"usual\" route to school, it becomes an increasingly unusual adventure, and all the more ridiculous as it carries on. It takes an unpleasant sentiment many can empathize with, the feeling of tardiness, and brings humor to it—making it a hilarious situation to look back upon.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80462   Expand Chio's School Road   (2018) User Score Overview This is a story of a nerdy bookworm girl on her way to school, and yes, that's the entire premise, as she's not getting to school any time soon. Taking her \"usual\" route to school, it becomes an increasingly unusual adventure, and all the more ridiculous as it carries on. It takes an unpleasant sentiment many can empathize with, the feeling of tardiness, and brings humor to it—making it a hilarious situation to look back upon. Featured Crew Takayuki Inagaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Chio's School Road is set to premiere on July  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Original Name  ちおちゃんの通学路 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://chiochan.jp/ Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 13 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}