{"link": "https://www.themoviedb.org/tv/43135?language=en", "title": "A Gentleman's Dignity", "resume": "A Gentleman's Dignity is a 2012 South Korean romantic comedy television series starring Jang Dong-gun, Kim Ha-neul, Kim Min-jong, Kim Soo-ro, and Lee Jong-hyuk. It aired on SBS from May 26 to August 12, 2012 on Saturdays and Sundays at 21:55 for 20 episodes.\nThe series marked Jang Dong-gun's return to television after twelve years. It was directed by Shin Woo-chul and written by Kim Eun-sook, the same team behind hit dramas Secret Garden, On Air, Lovers in Prague, and Lovers in Paris.", "rate": 84, "genre": ["Comedy", "Drama"], "cast": ["Kim Ha-neul", "Kim Min-jong", "Jang Dong-gun", "Kim Su-ro", "Yoon Jin-yi"], "character": ["Seo Yi-soo", "Choi Yoon", "Kim Do Jin", "Im Tae San", "Im Meahri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43135   Expand A Gentleman's Dignity   (2012) User Score Overview A Gentleman's Dignity is a 2012 South Korean romantic comedy television series starring Jang Dong-gun, Kim Ha-neul, Kim Min-jong, Kim Soo-ro, and Lee Jong-hyuk. It aired on SBS from May 26 to August 12, 2012 on Saturdays and Sundays at 21:55 for 20 episodes. The series marked Jang Dong-gun's return to television after twelve years. It was directed by Shin Woo-chul and written by Kim Eun-sook, the same team behind hit dramas Secret Garden, On Air, Lovers in Prague, and Lovers in Paris. Featured Crew Kim Eun-sook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Ha-neul Seo Yi-soo Kim Min-jong Choi Yoon Jang Dong-gun Kim Do Jin Kim Su-ro Im Tae San Yoon Jin-yi Im Meahri Full Cast & Crew Last Season Season 1 2012 | 20 Episodes Season 1 of A Gentleman's Dignity premiered on May 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  9 Recommendations   2010-03-31 Personal Taste 7.4    2011-05-09 Lie To Me 7.6    2013-12-09 The Prime Minister and I 7.1    2013-08-05 Good Doctor 8.6    2012-08-13 Faith 7.6    2012-03-21 Rooftop Prince 8.1    2015-01-07 Kill Me, Heal Me 8.7    2011-05-25 City Hunter 7.5  Facts Original Name  신사의 품격 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  English Runtime  60m Homepage   http://tv.sbs.co.kr/sinsa/ Genres Comedy Drama Keywords korea Content Score 100 Yes! Looking good! Top Contributors M 24 Maria180493 N 14 Nightowl.Kr CM 6 Cherche Moi t 5 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}