{"link": "https://www.themoviedb.org/tv/3734?language=en", "title": "Ballykissangel", "resume": "Ballykissangel is a BBC television drama set in Ireland, produced in-house by BBC Northern Ireland. The original story revolved around a young English Roman Catholic priest as he became part of a rural community. It ran for six series, which were first broadcast on BBC One in the United Kingdom from 1996 to 2001.", "rate": 62, "genre": ["Comedy", "Drama"], "cast": ["Tony Doyle", "Lorcan Cranitch", "Victoria Smurfit", "Niall Toibin", "Peter Caffrey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3734   Expand Ballykissangel   (1996) User Score Overview Ballykissangel is a BBC television drama set in Ireland, produced in-house by BBC Northern Ireland. The original story revolved around a young English Roman Catholic priest as he became part of a rural community. It ran for six series, which were first broadcast on BBC One in the United Kingdom from 1996 to 2001. Featured Crew Kieran Prendiville Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Doyle Lorcan Cranitch Victoria Smurfit Niall Toibin Peter Caffrey Full Cast & Crew Last Season Season 6 2001 | 8 Episodes Season 6 of Ballykissangel premiered on March  1, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1999-09-22 The 1900 House 8.3    1999-09-19 Judging Amy 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.world-productions.com/wp/content/shows/ballyk/ballyk.htm Genres Comedy Drama Keywords small town priest religion ireland Content Score 93 Almost there... Top Contributors 6 Banana 4 kcdh PE 3 Patrick E. Abe R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}