{"link": "https://www.themoviedb.org/tv/43199?language=en", "title": "Danger 5", "resume": "Set in a bizarre, 1960's inspired version of World War II, the action comedy series follows the finest group of spies the Allies have to offer on a mission to kill Adolf Hitler.", "rate": 82, "genre": ["Comedy", "Action", "Adventure"], "cast": ["David Ashby", "Elizabeth Hay", "Sean James Murphy", "Pacharo Mzembe", "Natasa Ristic"], "character": ["Jackson", "Holly", "Tucker", "Pierre", "Ilsa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43199   Expand Danger 5   (2012) User Score  Play Trailer Overview Set in a bizarre, 1960's inspired version of World War II, the action comedy series follows the finest group of spies the Allies have to offer on a mission to kill Adolf Hitler. Featured Crew Dario Russo Creator David Ashby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Ashby Jackson Elizabeth Hay Holly Sean James Murphy Tucker Pacharo Mzembe Pierre Natasa Ristic Ilsa Full Cast & Crew Last Season Series 2 2015 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2012-03-05 Dirk Gently 8.1    2018-05-12 Patrick Melrose 8.8    2014-09-21 Mr. Pickles 7.0    2016-01-30 Horace and Pete 7.1    2011-04-06 Workaholics 6.9    2013-04-30 Inside Amy Schumer 5.4    2015-10-31 Ash vs Evil Dead 7.8    2004-05-25 The Angry Video Game Nerd 7.8  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.sbs.com.au/comedy/danger-5 Genres Comedy Action & Adventure Keywords spy world war ii 80's style hitler Content Score 100 Yes! Looking good! Top Contributors 19 AvocadoSexy 18 Elizabeth Jennings 13 United600 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}