{"link": "https://www.themoviedb.org/tv/4014?language=en", "title": "The Flying Doctors", "resume": "The Flying Doctors is an Australian drama series produced by Crawford Productions that revolved around the everyday lifesaving efforts of the real Royal Flying Doctor Service of Australia.\nIt was initially a 1985 mini-series based in the fictional outback town of Cooper's Crossing starring Andrew McFarlane as the newly arrived Dr. Tom Callaghan. The success of the mini series led to its return the following year as an on-going series with McFarlane being joined by a new doctor, Chris Randall, played by Liz Burch. McFarlane left during the first season and actor Robert Grubb came in as new doctor Geoff Standish.\nThe series' episodes were mostly self-contained but also featured ongoing storylines, such as Dr. Standish's romance with Sister Kate Wellings. Other major characters included pilot Sam Patterson, mechanic Emma Plimpton, local policeman Sgt. Jack Carruthers and Vic and Nancy Buckley, who ran the local pub/hotel, The Majestic. Andrew McFarlane also later returned to the series, resuming his role as Dr. Callaghan. The popular series ran for nine seasons and was successfully screened internationally.", "rate": 57, "genre": ["Drama"], "cast": ["Liz Burch", "Andrew McFarlane", "Robert Grubb", "Lenore Smith", "Rebecca Gibney"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4014   Expand The Flying Doctors   (1986) User Score Overview The Flying Doctors is an Australian drama series produced by Crawford Productions that revolved around the everyday lifesaving efforts of the real Royal Flying Doctor Service of Australia. It was initially a 1985 mini-series based in the fictional outback town of Cooper's Crossing starring Andrew McFarlane as the newly arrived Dr. Tom Callaghan. The success of the mini series led to its return the following year as an on-going series with McFarlane being joined by a new doctor, Chris Randall, played by Liz Burch. McFarlane left during the first season and actor Robert Grubb came in as new doctor Geoff Standish. The series' episodes were mostly self-contained but also featured ongoing storylines, such as Dr. Standish's romance with Sister Kate Wellings. Other major characters included pilot Sam Patterson, mechanic Emma Plimpton, local policeman Sgt. Jack Carruthers and Vic and Nancy Buckley, who ran the local pub/hotel, The Majestic. Andrew McFarlane also later returned to the series, resuming his role as Dr. Callaghan. The popular series ran for nine seasons and was successfully screened internationally. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liz Burch Andrew McFarlane Robert Grubb Lenore Smith Rebecca Gibney Full Cast & Crew Last Season Season 9 1991 | 29 Episodes Season 9 of The Flying Doctors premiered on August  8, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Flying Doctors. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords rescue australia airplane doctor Content Score 86 Almost there... Top Contributors 6 Banana S 3 Samara BA 3 Barbara Ann O'Leary 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}