{"link": "https://www.themoviedb.org/tv/45844?language=en", "title": "Star Blazers 2199", "resume": "The year is 2199. The human race has been crushed in their war with the Gamilos, driven into underground cities by the invader's assault. Scientists estimate they have only a year left. The young officers Susumu Kodai and Daisuke Shima receive a mysterious capsule from a ship that made an emergency landing on Mars and return with it to Earth. It contains humanity's last hope: the planet Iscandar on the other side of the Magellan Galaxy has the technology to defeat the Gamilos and restore the planet. The space battleship Yamato is entrusted with this task, but they have only one year before humanity ends.", "rate": 60, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45844   Expand Star Blazers 2199   (2013) User Score Overview The year is 2199. The human race has been crushed in their war with the Gamilos, driven into underground cities by the invader's assault. Scientists estimate they have only a year left. The young officers Susumu Kodai and Daisuke Shima receive a mysterious capsule from a ship that made an emergency landing on Mars and return with it to Earth. It contains humanity's last hope: the planet Iscandar on the other side of the Magellan Galaxy has the technology to defeat the Gamilos and restore the planet. The space battleship Yamato is entrusted with this task, but they have only one year before humanity ends. Featured Crew Yutaka Izubuchi Creator Akihiro Enomoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Star Blazers 2199 2013 | 26 Episodes Season 1 of Star Blazers 2199 premiered on April  6, 2013. View All Seasons Social Reviews  1 Discussions  1 BG A review by Blue Ghost Written by  Blue Ghost  on January  8, 2018 A fairly interesting and more adult update of the classic space operate anime fare out of Japan.  Unlike the original TV show which was ostensibly aimed at pre-teen boys and younger, this show has a kind of post teen target audience in mind with lots of introspection, some romantic and sexual tension, and overall a more reflective film making style that brings a kind of depth and artistry that the first series from decades earlier did not have. As an adult American male I think I can safely say that I have enjoyed watching this series without feeling too nostalgic about for the series that I...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Star Blazers 2199. You can help by rating TV shows you've seen. Facts Original Name  宇宙戦艦ヤマト２１９９ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://yamato2199.net/ Genres Action & Adventure Animation Drama Keywords space space opera anime Content Score 64 We're so close, yet so far. Top Contributors 19 Razze 11 sp1ti M 8 Migi Z 8 Zeagle  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}