{"link": "https://www.themoviedb.org/tv/46573?language=en", "title": "God of War", "resume": "Kim Jun is the son of an escaped palace slave, who gets raised by monks. Years later, after being torn from his home during wartime, Kim Jun must renounce hispacifist ways to partake in a deadly game that could be his ticket to freedom from his masters, Choe Chung-heon's clan. During the Mongol invasions of Korea, Kim Jun rises in the ranks to become the top military official, and eventually rules the Goryeo empire for 60 years in place of its king.", "rate": 0, "genre": ["Drama"], "cast": ["Kim Joo-hyuk", "Ha-eun Kim", "Lee Seung-hyo", "Ahn Jae-mo", "Cheon Ho-jin"], "character": ["Kim In-jun/Kim Jun", "Choon-shim", "King Gojong", "Im Yeon", "Lee Gyu-bo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46573   Expand God of War   (2012) User Score Overview Kim Jun is the son of an escaped palace slave, who gets raised by monks. Years later, after being torn from his home during wartime, Kim Jun must renounce hispacifist ways to partake in a deadly game that could be his ticket to freedom from his masters, Choe Chung-heon's clan. During the Mongol invasions of Korea, Kim Jun rises in the ranks to become the top military official, and eventually rules the Goryeo empire for 60 years in place of its king. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Joo-hyuk Kim In-jun/Kim Jun Ha-eun Kim Choon-shim Lee Seung-hyo King Gojong Ahn Jae-mo Im Yeon Cheon Ho-jin Lee Gyu-bo Full Cast & Crew Last Season Season 1 2012 | 56 Episodes Season 1 of God of War premiered on February 11, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for God of War. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on God of War. You can help by rating TV shows you've seen. Facts Original Name  무신 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/moosin/ Genres Drama Keywords korea historical Content Score 71 Just a little bit more... Top Contributors t 50 tmdb38202327 3 Banana 2 MrTimscampi t 2 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}