{"link": "https://www.themoviedb.org/tv/63313?language=en", "title": "Alaska: The Last Frontier", "resume": "Centers on the Kilcher family and their community outside Homer, Alaska. Begun by patriarch Yule Kilcher who immigrated from Europe during WWII, and currently led by his sons, Otto and Atz Kilcher (singer Jewel's father) the family have lived on their land for four generations. The show also features the homesteaders who live nearby and interact with the Kilchers.", "rate": 79, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63313   Expand Alaska: The Last Frontier   (2011) User Score  Play Trailer Overview Centers on the Kilcher family and their community outside Homer, Alaska. Begun by patriarch Yule Kilcher who immigrated from Europe during WWII, and currently led by his sons, Otto and Atz Kilcher (singer Jewel's father) the family have lived on their land for four generations. The show also features the homesteaders who live nearby and interact with the Kilchers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2017 | 16 Episodes Season 7 of Alaska: The Last Frontier premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Alaska: The Last Frontier. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  43m Homepage   http://www.discovery.com/tv-shows/alaska-the-last-frontier/ Genres Reality Keywords alaska survivalist pioneer off the grid Content Score 64 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings LC 7 Legit Corporation 4 rootraid z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}