{"link": "https://www.themoviedb.org/tv/65813?language=en", "title": "Rosemary's Baby", "resume": "Young Rosemary Woodhouse and her husband Guy move in with a rich couple, who soon take an unusual interest in the Woodhouses' attempts to have a second baby after Rosemary miscarried the first one. Guy soon has unusual success and Rosemary becomes pregnant, but it becomes clear that the two are connected and that the pregnancy may not be all that Rosemary hoped for...", "rate": 59, "genre": ["Drama", "Mystery"], "cast": ["Zoe Saldana", "Patrick J. Adams", "Carole Bouquet", "Christina Cole", "Jason Isaacs"], "character": ["Rosemary Woodhouse", "Guy Woodhouse", "Margaux Castevet", "Julie", "Roman Castevet"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65813   Expand Rosemary's Baby   (2014) User Score Overview Young Rosemary Woodhouse and her husband Guy move in with a rich couple, who soon take an unusual interest in the Woodhouses' attempts to have a second baby after Rosemary miscarried the first one. Guy soon has unusual success and Rosemary becomes pregnant, but it becomes clear that the two are connected and that the pregnancy may not be all that Rosemary hoped for... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zoe Saldana Rosemary Woodhouse Patrick J. Adams Guy Woodhouse Carole Bouquet Margaux Castevet Christina Cole Julie Jason Isaacs Roman Castevet Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of Rosemary's Baby premiered on May 11, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply S Guy as Satan Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   2016-09-18 The Case of: JonBenét Ramsey 5.3    2011-12-11 Bag of Bones 5.8    2002-09-16 Dr. Phil 2.7    2008-12-03 Man v. Food 6.7    1995-09-22 American Gothic 7.7    1977-11-12 Mario Puzo's The Godfather: The complete Novel for Television 8.4    1989-10-24 The Kids in the Hall 7.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  84m Homepage   http://www.nbc.com/rosemarys-baby Genres Drama Mystery Keywords based on novel or book supernatural suspense miniseries woman director young couple Content Score 86 Almost there... Top Contributors 91 Marr 🇳🇱 TB 26 TMDb Bot 22 Elizabeth Jennings x 4 xxstranger  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}