{"link": "https://www.themoviedb.org/tv/39718?language=en", "title": "The Hour", "resume": "A behind-the-scenes drama and espionage thriller in Cold War-era England that centers on a journalist, a producer, and an anchorman for an investigative news programme.", "rate": 73, "genre": ["Drama"], "cast": ["Ben Whishaw", "Romola Garai", "Dominic West", "Anna Chancellor", "Julian Rhind-Tutt"], "character": ["Freddie Lyon", "Bel Rowley", "Hector Madden", "Lix Storm", "Angus McCain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39718   Expand The Hour   (2011) User Score  Play Trailer Overview A behind-the-scenes drama and espionage thriller in Cold War-era England that centers on a journalist, a producer, and an anchorman for an investigative news programme. Featured Crew Abi Morgan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Whishaw Freddie Lyon Romola Garai Bel Rowley Dominic West Hector Madden Anna Chancellor Lix Storm Julian Rhind-Tutt Angus McCain Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of The Hour premiered on November 28, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply A third series would have been nice. Open 0 by Remington Steele\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   1982-09-20 Smiley's People 7.9    1993-02-21 Lipstick on Your Collar 7.3    2012-08-30 Good Cop 6.6    2013-10-29 The Escape Artist 7.0    1985-11-04 Edge of Darkness 8.4    2016-06-09 New Blood 6.5    2012-09-06 The Bletchley Circle 7.8    2016-12-26 The Witness for the Prosecution 7.3  Facts Status  Ended Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p00wkgxw Genres Drama Keywords reporter period drama tv news 1950s Content Score 100 Yes! Looking good! Top Contributors 37 Elizabeth Jennings 27 Banana T 6 Tigrecito 6 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}