{"link": "https://www.themoviedb.org/tv/72296?language=en", "title": "My First Girlfriend is a Gal", "resume": "A new school term begins, as does the season of new encounters. As he surveys his class full of couples, Hashiba Jun'ichi's mind is filled with distress as he asks himself, \"Why am I still a virgin?!\" Having heard from his friends that the easiest way to fulfill his long-standing desire to graduate from the fellowship of virgins is to kowtow to a gal, Jun'ichi does exactly that and asks his classmate Yukana out. And unbelievably, she actually agrees to date him. What will become of Jun'ichi from now on?", "rate": 74, "genre": ["Animation", "Comedy"], "cast": ["Yuki Nagaku", "Shintarou Asanuma", "Eri Kitamura", "Ayana Taketatsu", "Yui Ogura"], "character": ["Yukana Yame", "Junichi Hashiba", "Ranko Honjou", "Yui Kashii", "Nene Fujinoki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72296   Expand My First Girlfriend is a Gal   (2017) User Score Overview A new school term begins, as does the season of new encounters. As he surveys his class full of couples, Hashiba Jun'ichi's mind is filled with distress as he asks himself, \"Why am I still a virgin?!\" Having heard from his friends that the easiest way to fulfill his long-standing desire to graduate from the fellowship of virgins is to kowtow to a gal, Jun'ichi does exactly that and asks his classmate Yukana out. And unbelievably, she actually agrees to date him. What will become of Jun'ichi from now on? Featured Crew Hiroyuki Furukawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuki Nagaku Yukana Yame Shintarou Asanuma Junichi Hashiba Eri Kitamura Ranko Honjou Ayana Taketatsu Yui Kashii Yui Ogura Nene Fujinoki Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of My First Girlfriend is a Gal premiered on July 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2017-04-05 Sakura Quest 8.5    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2017-04-01 The Silver Guardian 6.4    2017-04-04 The Royal Tutor 7.7    2015-01-04 Absolute Duo 7.6    2017-04-12 Kenka Banchou Otome: Girl Beats Boys 6.6    2017-07-04 Tsuredure Children 8.0    2007-10-02 Bamboo Blade 9.5  Facts Original Name  はじめてのギャル Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://hajimete-no-gal.jp/ Genres Animation Comedy Keywords romance slice of life ecchi Content Score 100 Yes! Looking good! Top Contributors 53 TenmaWorks 24 sp1ti C 14 Chintaran 11 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}