{"link": "https://www.themoviedb.org/tv/17915?language=en", "title": "One Thousand and One Nights", "resume": "Sehrazat, a young widow who is financially unable to treat her terminally ill young son, is forced to address to her charming boss, asking for help. The proposal by her boss changes her life forever.", "rate": 64, "genre": ["Drama"], "cast": ["Halit Ergenç", "Bergüzar Korel", "Tardu Flordun", "Ceyda Düvenci", "Tomris İncer"], "character": ["Onur Aksal", "Sehrazat Evliyaoglu", "Kerem Inceoglu", "Bennu Ataman", "Nadide Evliyaoglu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17915   Expand One Thousand and One Nights   (2006) User Score Overview Sehrazat, a young widow who is financially unable to treat her terminally ill young son, is forced to address to her charming boss, asking for help. The proposal by her boss changes her life forever. Featured Crew Kudret Sabancı Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Halit Ergenç Onur Aksal Bergüzar Korel Sehrazat Evliyaoglu Tardu Flordun Kerem Inceoglu Ceyda Düvenci Bennu Ataman Tomris İncer Nadide Evliyaoglu Full Cast & Crew Last Season Season 3 2008 | 24 Episodes Season 3 of One Thousand and One Nights premiered on September 16, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for One Thousand and One Nights. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on One Thousand and One Nights. You can help by rating TV shows you've seen. Facts Original Name  Binbir Gece Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  90m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 84 purplelammashta 10 Zlogorek s 8 sledujto D 7 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}