{"link": "https://www.themoviedb.org/tv/32940?language=en", "title": "Accused", "resume": "Accused is a British television anthology series created by Jimmy McGovern. The drama series first aired on 15 November 2010 on BBC One and has run for two series. Each episode follows a different character as they await their verdict in court, and tells the story behind how they find themselves accused. The series has featured actors and actresses such as Christopher Eccleston, Benjamin Smith, Juliet Stevenson, Andy Serkis, Marc Warren, Naomie Harris, Sean Bean and Anne-Marie Duff as the accused in each episode.\nThe series follows previous drama series by McGovern, including anthology series The Street and Moving On. After the cancellation of The Street in 2009 by Granada Television, McGovern formed RSJ Films to produce independent drama programmes and consequently devised the Accused anthology series. Accused is written by McGovern, Danny Brocklehurst and Alice Nutter and is filmed in Manchester. In 2011 it won an International Emmy for best drama series.", "rate": 80, "genre": ["Drama"], "cast": ["Christopher Eccleston", "Andy Serkis", "Naomie Harris", "Olivia Colman", "Sean Bean"], "character": ["Willy Houlihan", "Alison Wade", "Sue Brown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32940   Expand Accused   (2010) User Score Overview Accused is a British television anthology series created by Jimmy McGovern. The drama series first aired on 15 November 2010 on BBC One and has run for two series. Each episode follows a different character as they await their verdict in court, and tells the story behind how they find themselves accused. The series has featured actors and actresses such as Christopher Eccleston, Benjamin Smith, Juliet Stevenson, Andy Serkis, Marc Warren, Naomie Harris, Sean Bean and Anne-Marie Duff as the accused in each episode. The series follows previous drama series by McGovern, including anthology series The Street and Moving On. After the cancellation of The Street in 2009 by Granada Television, McGovern formed RSJ Films to produce independent drama programmes and consequently devised the Accused anthology series. Accused is written by McGovern, Danny Brocklehurst and Alice Nutter and is filmed in Manchester. In 2011 it won an International Emmy for best drama series. Featured Crew Jimmy McGovern Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Eccleston Willy Houlihan Andy Serkis Naomie Harris Alison Wade Olivia Colman Sue Brown Sean Bean Full Cast & Crew Last Season Series 2 2012 | 4 Episodes Season 2 of Accused premiered on August 14, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2006-01-01 In Justice 6.8    2013-09-05 The Guilty 7.0    2011-01-13 Kidnap and Ransom 7.6    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2011-09-13 The Body Farm 6.2    2010-09-28 Whites 6.7    2012-08-30 Good Cop 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p00wb96q Genres Drama Keywords anthology courtroom Content Score 93 Almost there... Top Contributors 12 Elizabeth Jennings 7 Banana S 6 Shady12 4 dijion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}