{"link": "https://www.themoviedb.org/tv/1180?language=en", "title": "Ashes to Ashes", "resume": "Crime drama series featuring Life On Mars' DCI Gene Hunt. After being shot in 2008, DI Alex Drake lands in 1981, where she finds herself in familiar company.", "rate": 79, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama"], "cast": ["Keeley Hawes", "Philip Glenister", "Dean Andrews", "Marshall Lancaster", "Montserrat Lombard"], "character": ["Alex Drake", "Gene Hunt", "Ray Carling", "Chris Skelton", "Shaz Granger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1180   Expand Ashes to Ashes   (2008) User Score  Play Trailer Overview Crime drama series featuring Life On Mars' DCI Gene Hunt. After being shot in 2008, DI Alex Drake lands in 1981, where she finds herself in familiar company. Featured Crew Ashley Pharoah Creator Matthew Graham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  35 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keeley Hawes Alex Drake Philip Glenister Gene Hunt Dean Andrews Ray Carling Marshall Lancaster Chris Skelton Montserrat Lombard Shaz Granger Full Cast & Crew Last Season Season 3 2010 | 8 Episodes Season 3 of Ashes to Ashes premiered on April  2, 2010. View All Seasons Social Reviews  1 Discussions  0 A review by VanVliet  10.0 Written by  VanVliet  on November  9, 2017 \"Fire up the Quattro\" and \"Pronto Tonto\"! Gene Hunt has to return to finish what was started in Life On Mars. It's takes two series which starts in the hunt for Sam Tyler and finishes with the classic battle of good versus evil and redemption. Lofty stuff but done very well with some great performances helped by superb scripts. Read All Reviews Media Most Popular Videos  1 Backdrops  35 Posters  11 Recommendations   2006-01-09 Life on Mars 8.0    2006-01-19 Eleventh Hour 6.0    2009-03-15 The No. 1 Ladies' Detective Agency 6.4    2015-01-13 Cockroaches 6.0    2010-06-22 Mongrels 7.3    1979-02-10 B. J. and the Bear 6.0    1998-11-15 Cold Feet 8.1    1985-11-04 Edge of Darkness 8.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 55m Homepage   http://www.bbc.co.uk/ashestoashes/ Genres Sci-Fi & Fantasy Action & Adventure Drama Keywords london england time travel sequel female protagonist police detective female detective police precinct life on mars 1980s Content Score 100 Yes! Looking good! Top Contributors k 15 khedron I 9 Ingwar 7 Elizabeth Jennings CM 7 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}