{"link": "https://www.themoviedb.org/tv/812?language=en", "title": "Harry Hill's TV Burp", "resume": "Harry Hill's TV Burp is a British television comedy programme that ran for 11 years from 2001 to 2012. It was produced by Avalon Television for ITV and hosted by comedian Harry Hill. The show presents a look at the week's television, including extracts from TV shows with added sketches, observational voice-overs, and guest appearances.\nThe show is based on clips of the previous week of programming on television, frequently reinterpreting actions or lines of dialogue in a humorous way, or pointing out how views of props or sets amusingly resemble other objects, and often lightheartedly or sarcastically commenting on the actual intended content of the programme. To produce the show, Hill and his programme associate writing team, including Brenda Gilhooly, Paul Hawksbee, Dan Maier, Joe Burnside and David Quantick, watch significant amounts of television, much on preview tapes. Clips from a variety of shows across most channels are included in the show, with soaps, dramas and popular-factual series being the most commonly represented genres. The clips are shown outside of the context of their original programme and only limited information about the scene is given, as the focus of the show's treatment is on the often unintentional humour which can be derived from the scene. The show was filmed at Teddington Studios, Greater London, in Studio 1 for series 1 to 8. From series 9 to 11, the studio has been the BBC Television Centre in London.", "rate": 62, "genre": ["Comedy"], "cast": ["Steve Benham"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 812   Expand Harry Hill's TV Burp   (2002) User Score Overview Harry Hill's TV Burp is a British television comedy programme that ran for 11 years from 2001 to 2012. It was produced by Avalon Television for ITV and hosted by comedian Harry Hill. The show presents a look at the week's television, including extracts from TV shows with added sketches, observational voice-overs, and guest appearances. The show is based on clips of the previous week of programming on television, frequently reinterpreting actions or lines of dialogue in a humorous way, or pointing out how views of props or sets amusingly resemble other objects, and often lightheartedly or sarcastically commenting on the actual intended content of the programme. To produce the show, Hill and his programme associate writing team, including Brenda Gilhooly, Paul Hawksbee, Dan Maier, Joe Burnside and David Quantick, watch significant amounts of television, much on preview tapes. Clips from a variety of shows across most channels are included in the show, with soaps, dramas and popular-factual series being the most commonly represented genres. The clips are shown outside of the context of their original programme and only limited information about the scene is given, as the focus of the show's treatment is on the often unintentional humour which can be derived from the scene. The show was filmed at Teddington Studios, Greater London, in Studio 1 for series 1 to 8. From series 9 to 11, the studio has been the BBC Television Centre in London. Featured Crew Harry Hill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Benham Full Cast & Crew Last Season Season 14 2012 | 10 Episodes Season 14 of Harry Hill's TV Burp premiered on February  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   A Question of Sport 6.5    1990-09-27 Rab C. Nesbitt 7.1    1989-11-08 Byker Grove 6.3    2009-01-03 Total Wipeout 5.3    1995-08-12 Soccer AM 5.0    1993-09-21 The Smell of Reeves and Mortimer 7.7    2000-01-12 That Peter Kay Thing 6.4    1990-11-08 Harry Enfield's Television Programme 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.tv-burp.com Genres Comedy Keywords surreal british humour offbeat anarchic comedy Content Score 64 We're so close, yet so far. Top Contributors O 6 Ozbourne TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}