{"link": "https://www.themoviedb.org/tv/68654?language=en", "title": "MECH-X4", "resume": "Ryan Walker mysteriously awakens MECH-X4, a giant robot built to defend Bay City against impending doom. When monsters begin to descend, Ryan recruits his two best friends and his brother to help pilot the robot that is their only hope of saving their town from mass destruction.", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Comedy", "Family"], "cast": ["Kamran Lucas", "Alyssa Jirrels", "Nathaniel J. Potvin", "Raymond Alexander Cham Jr.", "Pearce Joza"], "character": ["Harris Harris Jr.", "Veracity", "Ryan Walker", "Mark Walker", "Spyder/ Spyder Johnson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68654   Expand MECH-X4   (2016) User Score  Play Trailer Overview Ryan Walker mysteriously awakens MECH-X4, a giant robot built to defend Bay City against impending doom. When monsters begin to descend, Ryan recruits his two best friends and his brother to help pilot the robot that is their only hope of saving their town from mass destruction. Featured Crew Steve Marmel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kamran Lucas Harris Harris Jr. Alyssa Jirrels Veracity Nathaniel J. Potvin Ryan Walker Raymond Alexander Cham Jr. Mark Walker Pearce Joza Spyder/ Spyder Johnson Full Cast & Crew Last Season Season 2 2017 | 15 Episodes Season 2 of MECH-X4 premiered on September  9, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply p Mech-X4 - Season 2 Episode Titles and Airdates Open 9 by  Taylorfirst1 w Ryan: Happy Birthday Nathaniel Potvin! Open 0 by wonder2wonder\n      \n     w Spyder: Happy Birthday Pearce Joza! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2011-01-17 Supah Ninjas 5.3    2015-09-12 Game Shakers 6.4    2013-10-07 Mighty Med 6.2    2015-07-31 BUNK'D 5.3    2013-10-14 The Thundermans 8.2  Facts Status  Returning Series Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  21m Homepage  - Genres Sci-Fi & Fantasy Comedy Family Keywords monster robot Content Score 100 Yes! Looking good! Top Contributors 17 Elizabeth Jennings 14 DarkMan J 13 Jkrilin LL 10 Lana Lini  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}