{"link": "https://www.themoviedb.org/tv/70452?language=en", "title": "Bride of the Water God", "resume": "Villagers are suffering through a prolonged drought. The god of water, Ha-Baek, can allow rain but only if a a young woman is offered to him as a bride. From amongst the villagers, So-A decides to become Ha-Baek's bride. When she finally meets him, he is completely different from what she expected. Adaptation of the romance manhwa by Yoon Mi-Kyung under the same name, which ran from 2006 til 2014.", "rate": 55, "genre": ["Drama"], "cast": ["Nam Joo-hyuk", "Shin Se-kyung", "Lim Ju-hwan", "Krystal Jung", "Gong Myung"], "character": ["Ha Baek", "Yoon So-A", "Hoo Ye", "Moo Ra", "Bi Ryum"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70452   Expand Bride of the Water God   (2017) User Score  Play Trailer Overview Villagers are suffering through a prolonged drought. The god of water, Ha-Baek, can allow rain but only if a a young woman is offered to him as a bride. From amongst the villagers, So-A decides to become Ha-Baek's bride. When she finally meets him, he is completely different from what she expected. Adaptation of the romance manhwa by Yoon Mi-Kyung under the same name, which ran from 2006 til 2014. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nam Joo-hyuk Ha Baek Shin Se-kyung Yoon So-A Lim Ju-hwan Hoo Ye Krystal Jung Moo Ra Gong Myung Bi Ryum Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Bride of the Water God premiered on July  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2017-03-15 Radiant Office 6.9    2017-11-11 Money Flower 8.0    2017-08-09 Manhole 7.3    2017-10-11 Mad Dog 8.0    2017-04-17 My Secret Romance 7.6    2017-07-19 Reunited Worlds 8.3    2017-01-16 Introverted Boss 8.7    2017-07-19 Man Who Dies to Live 8.3  Facts Original Name  하백의 신부 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.tving.com/tvn/tvnhabaek/ Genres Drama Keywords based on comic korea based on manhwa Content Score 93 Almost there... Top Contributors M 27 Maria180493 25 RainingBullets 7 Kijung Kim 5 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}