{"link": "https://www.themoviedb.org/tv/6322?language=en", "title": "Wire in the Blood", "resume": "Clinical psychologist Dr Tony Hill's uncanny ability to see into the minds of murderers means he finds it difficult to distance himself from disturbing cases.", "rate": 76, "genre": ["Crime", "Mystery"], "cast": ["Robson Green", "Mark Letheren", "Mark Penfold", "Simone Lahbib"], "character": ["Dr Tony Hill", "DS Kevin Geoffries", "Dr Ashley Vernon", "DI Alex Fielding"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6322   Expand Wire in the Blood   (2002) User Score Overview Clinical psychologist Dr Tony Hill's uncanny ability to see into the minds of murderers means he finds it difficult to distance himself from disturbing cases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robson Green Dr Tony Hill Mark Letheren DS Kevin Geoffries Mark Penfold Dr Ashley Vernon Simone Lahbib DI Alex Fielding Full Cast & Crew Last Season Season 6 2008 | 8 Episodes Season 6 of Wire in the Blood premiered on September 12, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2010-06-16 Pioneer One 6.3    2004-08-30 John Safran vs God 7.3    2013-11-07 Folkets främsta företrädare 5.0    2003-02-02 Kingpin 6.9    1987-09-05 På spåret 5.0    2011-01-06 The Reckoning 3.7    1999-01-18 Parlamentet 3.0    2016-04-25 After the Thrones 4.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 90m Homepage   http://www.itv.com/Drama/copsandcrime/WireintheBlood/default.html Genres Crime Mystery Keywords northern england police yorkshire psychologist serial killer people reader criminal consultant criminal profiler Content Score 86 Almost there... Top Contributors D 25 Dee 10 Banana S 10 Shady12 6 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}