{"link": "https://www.themoviedb.org/tv/67497?language=en", "title": "Jean-Claude Van Johnson", "resume": "Jean-Claude Van Damme is a global martial arts & film sensation, also operating under the simple alias of \"Johnson\" as the world's best undercover private contractor. Retired for years, a chance encounter with a lost love brings him back to the game. This time, he'll be deadlier than ever. Probably.", "rate": 70, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Jean-Claude Van Damme", "Kat Foster", "Bar Paly", "Phylicia Rashād", "Moisés Arias"], "character": ["Johnson", "Vanessa", "Krisztina", "Jane", "Luis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67497   Expand Jean-Claude Van Johnson   (2016) User Score  Play Trailer Overview Jean-Claude Van Damme is a global martial arts & film sensation, also operating under the simple alias of \"Johnson\" as the world's best undercover private contractor. Retired for years, a chance encounter with a lost love brings him back to the game. This time, he'll be deadlier than ever. Probably. Featured Crew Peter Atencio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jean-Claude Van Damme Johnson Kat Foster Vanessa Bar Paly Krisztina Phylicia Rashād Jane Moisés Arias Luis Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Jean-Claude Van Johnson premiered on August 19, 2016. View All Seasons Social Reviews  1 Discussions  1 O A review by Ornlu_Wolfjarl  10.0 Written by  Ornlu_Wolfjarl  on December 29, 2017 Funny, satyrical and action-packed I've just finished watching this and I must say I'm blown away. I did not expect it to be this amazing. I was anticipating something mediocre, but instead I was served a great action/comedy and I couldn't help but watch all 6 parts in one sitting. The series is both a homage and a satyrism of 80s action films , the film industry and modern audiences. It manages to pull off a great combination of the three, managing to keep it at just the right level, while deliberately sprinkling the viewer with well-done action scenes. It brims with over-the-top ide...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2013-10-02 Cleaners 7.4    2017-03-16 Snatch 7.0    2013-08-11 Low Winter Sun 6.4    2016-09-09 One Mississippi 8.1    2008-01-07 Mord mit Aussicht 7.3    2016-04-10 The Girlfriend Experience 5.5    2017-02-20 Bellevue 6.0    2016-08-18 I Love Dick 5.2  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://amazon.com/dp/B01J77TD22 Genres Action & Adventure Comedy Keywords martial arts washed up star Content Score 100 Yes! Looking good! Top Contributors 42 felectronika 14 Elizabeth Jennings 12 joeynotjoe l 4 losernator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}