{"link": "https://www.themoviedb.org/tv/39336?language=en", "title": "The River", "resume": "The River follows the story of wildlife expert and TV personality Emmet Cole. Emmet set course around the world with his wife, Tess, and son, Lincoln, while filming what would become one of the most popular shows in television. After he goes missing deep in the Amazon, his family, friends and crew set out on a mysterious and deadly journey to find him.", "rate": 66, "genre": ["Action", "Adventure", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Bruce Greenwood", "Joe Anderson", "Leslie Hope", "Eloise Mumford", "Paul Blackthorne"], "character": ["Emmet Cole", "Lincoln Cole", "Tess Cole", "Lena Landry", "Clark Quietly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39336   Expand The River   (2012) User Score  Play Trailer Overview The River follows the story of wildlife expert and TV personality Emmet Cole. Emmet set course around the world with his wife, Tess, and son, Lincoln, while filming what would become one of the most popular shows in television. After he goes missing deep in the Amazon, his family, friends and crew set out on a mysterious and deadly journey to find him. Featured Crew Michael R. Perry Creator Oren Peli Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce Greenwood Emmet Cole Joe Anderson Lincoln Cole Leslie Hope Tess Cole Eloise Mumford Lena Landry Paul Blackthorne Clark Quietly Full Cast & Crew Last Season Season 1 2012 | 8 Episodes Season 1 of The River premiered on February  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  6 Recommendations   2012-09-30 666 Park Avenue 6.1    2011-01-09 The Cape 4.3    2012-08-12 Animal Practice 4.7    2012-03-01 Awake 7.3    2011-09-21 The Fades 7.0    2008-10-09 Life on Mars 6.4    2010-09-29 Todd and the Book of Pure Evil 7.6    2007-02-01 The Sarah Silverman Program 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.abc.go.com/shows/the-river Genres Action & Adventure Drama Mystery Sci-Fi & Fantasy Keywords amazon jungle south america lost missing person wild Content Score 100 Yes! Looking good! Top Contributors 28 United600 23 Banana CM 22 Cherche Moi f 15 furkan-guven0115  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}