{"link": "https://www.themoviedb.org/tv/9769?language=en", "title": "Vega$", "resume": "Vega$ is an American detective television drama series that aired on ABC between 1978 and 1981. It was produced by Aaron Spelling. The series was filmed in its entirety in Las Vegas, Nevada. It is believed to be the first television series produced entirely in Las Vegas.\nThe show stars Robert Urich as private detective Dan Tanna, who drove around the streets of Las Vegas in a red 1957 Ford Thunderbird solving crimes and making Las Vegas a better place for residents and tourists alike.", "rate": 75, "genre": ["Drama"], "cast": ["Robert Urich", "Phyllis Davis", "Greg Morris", "Bart Braverman"], "character": ["Dan Tanna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9769   Expand Vega$   (1978) User Score Overview Vega$ is an American detective television drama series that aired on ABC between 1978 and 1981. It was produced by Aaron Spelling. The series was filmed in its entirety in Las Vegas, Nevada. It is believed to be the first television series produced entirely in Las Vegas. The show stars Robert Urich as private detective Dan Tanna, who drove around the streets of Las Vegas in a red 1957 Ford Thunderbird solving crimes and making Las Vegas a better place for residents and tourists alike. Featured Crew Michael Mann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Urich Dan Tanna Phyllis Davis Greg Morris Bart Braverman Full Cast & Crew Last Season Vega$ season 3 1980 | 22 Episodes Season 3 of Vega$ premiered on November  5, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Vega$. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  55m, 60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors c 2 chroz66 2 Daemon 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}