{"link": "https://www.themoviedb.org/tv/10382?language=en", "title": "The Joy of Painting", "resume": "The Joy of Painting was an American television show hosted by painter Bob Ross that taught its viewers techniques for landscape oil painting. Although Ross could complete a painting in half an hour, the intent of the show was not to teach viewers \"speed painting\". Rather, he intended for viewers to learn certain techniques within the time that the show was allotted. The show began on January 11, 1983, and lasted until May 17, 1994, a year before Ross' death.", "rate": 86, "genre": ["Family", "Reality"], "cast": ["Bob Ross"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10382   Expand The Joy of Painting   (1983) User Score Overview The Joy of Painting was an American television show hosted by painter Bob Ross that taught its viewers techniques for landscape oil painting. Although Ross could complete a painting in half an hour, the intent of the show was not to teach viewers \"speed painting\". Rather, he intended for viewers to learn certain techniques within the time that the show was allotted. The show began on January 11, 1983, and lasted until May 17, 1994, a year before Ross' death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Ross Himself Full Cast & Crew Last Season Original Air Date Original Air Date Bob Ross: The Joy of Painting (DVD) Bob Ross: Beauty Is Everywhere (Digital) Season 31 1994 | 13 Episodes Season 31 of The Joy of Painting premiered on February 22, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1987-11-30 Father Dowling Mysteries 7.8    2001-10-06 The Mitchell and Webb Situation 8.0    1974-01-15 Happy Days 7.3    1984-09-20 Who's the Boss? 6.4    1990-07-05 Blossom 5.8    1991-09-30 The Jerry Springer Show 3.1    2005-06-05 Mock the Week 7.0    1989-09-18 Alien Nation 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bobross.com/ Genres Family Reality Keywords painting art Content Score 56 We're so close, yet so far. Top Contributors 11 tobim91 6 Banana 5 Lava303 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}