{"link": "https://www.themoviedb.org/tv/62329?language=en", "title": "Nymphs", "resume": "They live among us, forever young and deadly seductive. And unlike vamps, it's not blood they crave from their male, as 17-year-old Didi Tiensuu discovers when she beds her boyfriend for the first time and promptly kills him. The sultry nymphs Kati and Nadia take Didi under their wings in her new life as a divine being and sexual predator.", "rate": 53, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Sara Soulié", "Rebecca Viitala", "Manuela Bosco", "Malla Malmivaara", "Ilkka Villi"], "character": ["Didi Tiensuu / Desirée Tasson", "Kati \"Echaterina\" Ordana", "Nadia \"Ninette\" Rapaccini", "Frida Fredriksdottir", "Erik Mann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62329   Expand Nymphs   (2013) User Score  Play Trailer Overview They live among us, forever young and deadly seductive. And unlike vamps, it's not blood they crave from their male, as 17-year-old Didi Tiensuu discovers when she beds her boyfriend for the first time and promptly kills him. The sultry nymphs Kati and Nadia take Didi under their wings in her new life as a divine being and sexual predator. Featured Crew Miikko Oikkonen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sara Soulié Didi Tiensuu / Desirée Tasson Rebecca Viitala Kati \"Echaterina\" Ordana Manuela Bosco Nadia \"Ninette\" Rapaccini Malla Malmivaara Frida Fredriksdottir Ilkka Villi Erik Mann Full Cast & Crew Last Season Season 1 2013 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Nymphs. You can help by rating TV shows you've seen. Facts Original Name  Nymfit Status  Returning Series Network Certification 12 Meaning Not recommended for children under 12. Not allowed air before 10:00 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  Finnish Runtime  44m Homepage   http://www.mtv.fi/nymfit Genres Drama Sci-Fi & Fantasy Keywords immortality seduction deadly creature nymph Content Score 100 Yes! Looking good! Top Contributors 51 Marr 🇳🇱 27 Elizabeth Jennings R 20 RoNain 2 thrymartin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}