{"link": "https://www.themoviedb.org/tv/5207?language=en", "title": "Most Haunted Live!", "resume": "Most Haunted Live is a spin-off of the paranormal reality television series Most Haunted and was also produced by Antix Productions. The show consists of paranormal investigations broadcast live over a period of one or more nights, usually with interactive sections that involve the viewer.", "rate": 60, "genre": ["Reality", "Mystery"], "cast": ["Yvette Fielding", "Karl Beattie", "Ciarán O'Keeffe", "Stuart Torevell", "David Wells"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5207   Expand Most Haunted Live!   (2002) User Score  Play Trailer Overview Most Haunted Live is a spin-off of the paranormal reality television series Most Haunted and was also produced by Antix Productions. The show consists of paranormal investigations broadcast live over a period of one or more nights, usually with interactive sections that involve the viewer. Featured Crew Yvette Fielding Creator Karl Beattie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yvette Fielding Karl Beattie Ciarán O'Keeffe Stuart Torevell David Wells Full Cast & Crew Last Season Most haunted live season 9 2010 | 11 Episodes Season 9 of Most Haunted Live! premiered on January  9, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2008-01-09 Ghost Hunters International 6.8    2002-05-25 Most Haunted 6.3    2008-10-17 Ghost Adventures 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.livingtv.co.uk/shows/mosthauntedlive09/ Genres Reality Mystery Keywords paranormal show Content Score 100 Yes! Looking good! Top Contributors 4 Banana 1 amian123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}