{"link": "https://www.themoviedb.org/tv/13230?language=en", "title": "Pokémon Chronicles", "resume": "Pokémon Chronicles, partly known in Japan as Pocket Monsters Side Stories, is a spin-off series of the Pokémon anime, revolving around characters other than Ash Ketchum.\nIt first aired in Britain on Toonami, where the initial run has now finished. The only places where episodes are currently airing for the first time are the Caribbean, and Latin America on Cartoon Network Monday to Friday at 9:00pm EST/ 10:00 MXT. The show airs in India on Cartoon Network Thursday and Friday at 7:30pm IST. However, in Latin America, it seems the show has been cancelled because Poo Poo Power was put when Pokémon Chronicles usually is. The series made its U.S. premiere on Cartoon Network on June 3, 2006 at 7 PM US ET/PT after it ended in most other countries. In addition, episodes are available online through Cartoon Network's \"Toonami Jetstream\" online video site, and moved to the Miguzi block for November at 5:30 PM US EST on November 6, 2006.\nFour DVDs have been released in the United Kingdom, with a U.S. release still non-existent. All of the episodes have been released as extras on the first six season box sets of Pokémon in Australia. A box set containing all 22 episodes has also been released in Australia.", "rate": 73, "genre": ["Animation", "Kids"], "cast": ["Rachael Lillis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13230   Expand Pokémon Chronicles   (2006) User Score Overview Pokémon Chronicles, partly known in Japan as Pocket Monsters Side Stories, is a spin-off series of the Pokémon anime, revolving around characters other than Ash Ketchum. It first aired in Britain on Toonami, where the initial run has now finished. The only places where episodes are currently airing for the first time are the Caribbean, and Latin America on Cartoon Network Monday to Friday at 9:00pm EST/ 10:00 MXT. The show airs in India on Cartoon Network Thursday and Friday at 7:30pm IST. However, in Latin America, it seems the show has been cancelled because Poo Poo Power was put when Pokémon Chronicles usually is. The series made its U.S. premiere on Cartoon Network on June 3, 2006 at 7 PM US ET/PT after it ended in most other countries. In addition, episodes are available online through Cartoon Network's \"Toonami Jetstream\" online video site, and moved to the Miguzi block for November at 5:30 PM US EST on November 6, 2006. Four DVDs have been released in the United Kingdom, with a U.S. release still non-existent. All of the episodes have been released as extras on the first six season box sets of Pokémon in Australia. A box set containing all 22 episodes has also been released in Australia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachael Lillis Full Cast & Crew Last Season Season 1 2006 | 22 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Pokémon Chronicles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Kids Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 BudsieBuds m 5 matyholi w 4 winhacker a 3 adltata  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}