{"link": "https://www.themoviedb.org/tv/70639?language=en", "title": "WorldEnd: What do you do at the end of the world? Are you busy? Will you save us?", "resume": "Five hundred years have passed since the humans went extinct at the hands of the fearsome and mysterious 'Beasts'. The surviving races now make their homes up on floating islands in the sky, out of reach of all but the most mobile of Beasts.\nOnly a small group of young girls, the Leprechauns, can wield the ancient weapons needed to fend off invasions from these creatures. Into the girls’ unstable and fleeting lives, where a call to certain death could come at any moment, enters an unlikely character: a young man who lost everything in his final battle five hundred years ago, the last living human awakened from a long, icy slumber.\nUnable to fight any longer, Willem becomes the father that the girls never had, caring for and nurturing them even as he struggles to come to terms with his new life, in which he feels the pain of helplessly waiting for his loved ones to return home from battle that his 'Daughter' once felt for him so long ago. Together, Willem and the girls gradually come to understand what family means and what is truly worth protecting.", "rate": 88, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Ryohei Arai", "Azusa Tadokoro", "Kazusa Aranami", "Inori Minase"], "character": ["Cumesh Vilem", "Nota Seniolis Kutori", "Itsuri Historia Larntolk", "Kay Desperatio Nofuto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70639   Expand WorldEnd: What do you do at the end of the world? Are you busy? Will you save us?   (2017) User Score Overview Five hundred years have passed since the humans went extinct at the hands of the fearsome and mysterious 'Beasts'. The surviving races now make their homes up on floating islands in the sky, out of reach of all but the most mobile of Beasts. Only a small group of young girls, the Leprechauns, can wield the ancient weapons needed to fend off invasions from these creatures. Into the girls’ unstable and fleeting lives, where a call to certain death could come at any moment, enters an unlikely character: a young man who lost everything in his final battle five hundred years ago, the last living human awakened from a long, icy slumber. Unable to fight any longer, Willem becomes the father that the girls never had, caring for and nurturing them even as he struggles to come to terms with his new life, in which he feels the pain of helplessly waiting for his loved ones to return home from battle that his 'Daughter' once felt for him so long ago. Together, Willem and the girls gradually come to understand what family means and what is truly worth protecting. Featured Crew Akira Kareno Creator Junichi Wada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryohei Arai Cumesh Vilem Azusa Tadokoro Nota Seniolis Kutori Kazusa Aranami Itsuri Historia Larntolk Inori Minase Kay Desperatio Nofuto Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of WorldEnd: What do you do at the end of the world? Are you busy? Will you save us? premiered on April 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2011-01-08 Freezing 7.4    2017-07-12 My First Girlfriend is a Gal 7.4    2017-01-08 Chain Chronicle: The Light of Haecceitas 6.5    2009-07-04 Canaan 7.6    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2010-01-07 Dance in the Vampire Bund 7.0    2017-04-01 The Silver Guardian 6.4    2011-10-08 Ben-To 7.2  Facts Original Name  終末なにしてますか? 忙しいですか? 救ってもらっていいですか? Status  Ended Networks - Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://sukasuka-anime.com/ Genres Animation Action & Adventure Sci-Fi & Fantasy Keywords based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 27 sp1ti 25 Despair-Paradise 21 CrewMdk T 8 TheVizavi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}