{"link": "https://www.themoviedb.org/tv/1830?language=en", "title": "Tiny Toon Adventures", "resume": "Tiny Toon Adventures, is an American animated comedy television series produced by Amblin Entertainment and Warner Bros. Animation and was broadcast from September 14, 1990 through May 28, 1995. It follows the adventures of a group of young cartoon characters who attend the Acme Looniversity to become the next generation of characters from the Looney Tunes series.\nConceived in the late 1980s by producer Tom Ruegger, the cartoon was the first animated series produced by the collaboration of Steven Spielberg and Warner Bros. Animation during the animation renaissance of the late 1980s and early 1990s.\nThe pilot episode, \"The Looney Beginning,\" aired as a prime-time special on CBS on September 14, 1990; while the series itself was featured in first-run syndication for the first two seasons. The last season was aired on Fox Kids. The series ended production in 1992 in favor of Animaniacs, however, two specials were produced in 1994. On July 1, 2013, Tiny Toon Adventures began airing on the Hub Network.", "rate": 73, "genre": ["Animation", "Comedy"], "cast": ["Charlie Adler", "Tress MacNeille", "Danny Cooksey", "Cree Summer", "Frank Welker"], "character": ["Elmyra Duff", "Byron Basset"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1830   Expand Tiny Toon Adventures   (1990) User Score Overview Tiny Toon Adventures, is an American animated comedy television series produced by Amblin Entertainment and Warner Bros. Animation and was broadcast from September 14, 1990 through May 28, 1995. It follows the adventures of a group of young cartoon characters who attend the Acme Looniversity to become the next generation of characters from the Looney Tunes series. Conceived in the late 1980s by producer Tom Ruegger, the cartoon was the first animated series produced by the collaboration of Steven Spielberg and Warner Bros. Animation during the animation renaissance of the late 1980s and early 1990s. The pilot episode, \"The Looney Beginning,\" aired as a prime-time special on CBS on September 14, 1990; while the series itself was featured in first-run syndication for the first two seasons. The last season was aired on Fox Kids. The series ended production in 1992 in favor of Animaniacs, however, two specials were produced in 1994. On July 1, 2013, Tiny Toon Adventures began airing on the Hub Network. Featured Crew Tom Ruegger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Adler Tress MacNeille Danny Cooksey Cree Summer Elmyra Duff Frank Welker Byron Basset Full Cast & Crew Last Season Season 3 1992 | 25 Episodes Season 3 of Tiny Toon Adventures premiered on September 14, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1995-09-09 Pinky and the Brain 7.7    1993-09-13 Animaniacs 7.6    1987-09-18 DuckTales 7.6    1962-09-23 The Jetsons 6.6    1995-08-12 The Mask: The Animated Series 6.5    1992-09-05 Goof Troop 6.5    1990-09-10 Captain Planet and the Planeteers 5.9    1987-09-10 Teenage Mutant Ninja Turtles 7.3  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors NS 7 Norte Serra A 5 AnthonyAtkins232 4 TheOneManBoxOffice T 4 TVPlayerLatino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}