{"link": "https://www.themoviedb.org/tv/22104?language=en", "title": "Touch", "resume": "Twins Kazuya and Tatsuya, and their neighbor Minami have played together since they were children and built an unbreakable bond. But with puberty, the twins realized something: Minami is a girl, and three is a crowd.\nAs the trio tries to preserve their relationship, Kazuya's pledge to make Minami's dream come true by taking her to Koshien with his baseball pitching skills makes the slackerish Tatsuya wonder about himself, and his own goals. But Minami has another dream she wants fulfilled, and as the twins continue to push themselves, with Minami in the middle, a life-changing tragedy leads one twin down a path he once never would've considered...", "rate": 100, "genre": ["Animation", "Comedy"], "cast": ["Yuji Mitsuya", "Noriko Hidaka", "Kobuhei Hayashiya", "Banjou Ginga", "Kazuhiko Inoue"], "character": ["Tatsuya Uesugi (voice)", "Minami Asakura (voice)", "Koutarou Matsudaira (voice)", "Shouhei Harada (voice)", "Akio Nitta (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22104   Expand Touch   (1985) User Score Overview Twins Kazuya and Tatsuya, and their neighbor Minami have played together since they were children and built an unbreakable bond. But with puberty, the twins realized something: Minami is a girl, and three is a crowd. As the trio tries to preserve their relationship, Kazuya's pledge to make Minami's dream come true by taking her to Koshien with his baseball pitching skills makes the slackerish Tatsuya wonder about himself, and his own goals. But Minami has another dream she wants fulfilled, and as the twins continue to push themselves, with Minami in the middle, a life-changing tragedy leads one twin down a path he once never would've considered... Featured Crew Mitsuru Adachi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuji Mitsuya Tatsuya Uesugi (voice) Noriko Hidaka Minami Asakura (voice) Kobuhei Hayashiya Koutarou Matsudaira (voice) Banjou Ginga Shouhei Harada (voice) Kazuhiko Inoue Akio Nitta (voice) Full Cast & Crew Last Season Season 4 1986 | 22 Episodes Season 4 of Touch premiered on October 26, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Touch. You can help by rating TV shows you've seen. Facts Original Name  タッチ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords love triangle baseball romance based on manga Content Score 93 Almost there... Top Contributors 50 United600 J 18 JohnyB0y a 5 adiazo 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}