{"link": "https://www.themoviedb.org/tv/971?language=en", "title": "WKRP in Cincinnati", "resume": "When a Cincinnati radio station switches from sedate music to top-40 rock 'n' roll, its staff of oddball characters is forced to switch gears quickly. New programming director Andy Travis brings in a new DJ named Venus Flytrap to work with the station's burned-out veteran, Dr. Johnny Fever. Neurotic newsman Les Nessman, eager beaver Bailey Quarters, sleazy salesman Herb Tarlek, blonde bombshell Jennifer Marlowe, who serves as the station's ultra-capable receptionist, and station manager Arthur Carlson, whose domineering mother owns WKRP, round out the eccentric bunch.", "rate": 81, "genre": ["Comedy"], "cast": ["Gary Sandy", "Howard Hesseman", "Tim Reid", "Loni Anderson", "Frank Bonner"], "character": ["Andy Travis", "Dr. Johnny Fever", "Venus Flytrap", "Jennifer Marlowe", "Herb Tarlek"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 971   Expand WKRP in Cincinnati   (1978) User Score Overview When a Cincinnati radio station switches from sedate music to top-40 rock 'n' roll, its staff of oddball characters is forced to switch gears quickly. New programming director Andy Travis brings in a new DJ named Venus Flytrap to work with the station's burned-out veteran, Dr. Johnny Fever. Neurotic newsman Les Nessman, eager beaver Bailey Quarters, sleazy salesman Herb Tarlek, blonde bombshell Jennifer Marlowe, who serves as the station's ultra-capable receptionist, and station manager Arthur Carlson, whose domineering mother owns WKRP, round out the eccentric bunch. Featured Crew Hugh Wilson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Gary Sandy Andy Travis Howard Hesseman Dr. Johnny Fever Tim Reid Venus Flytrap Loni Anderson Jennifer Marlowe Frank Bonner Herb Tarlek Full Cast & Crew Last Season Season 4 1981 | 22 Episodes Season 4 of WKRP in Cincinnati premiered on October  7, 1981. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply PE WKRP in Cincinnati theme (complete) Open 0 by Patrick E. Abe\n      \n     t Top Ten Episodes Open 2 by  Patrick E. Abe w Bailey: Happy Birthday Jan Smithers! Open 1 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   1975-09-09 Welcome Back, Kotter 7.2    1982-10-02 Newhart 7.4    1970-09-19 The Mary Tyler Moore Show 7.2    1977-01-14 Fantasy Island 6.5    1976-01-27 Laverne & Shirley 6.7    1970-09-24 The Odd Couple 7.1    1980-11-11 Too Close for Comfort 7.1    1978-09-12 Taxi 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Comedy Keywords radio sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors n 15 nixskits 11 Elizabeth Jennings 10 Banana 1 dgw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}