{"link": "https://www.themoviedb.org/tv/71920?language=en", "title": "A Life Time Love", "resume": "Chi Yun is a skilled martial artist who grew up in the wilderness. He falls in love with Mu Qingmo at first sight, and openly pursues her once they meet again a couple of years later. She eventually reciprocates his affections, even though her brother had already promised her hand in marriage to the powerful noble Lingyun Shenglun. Shenglun is aware their marriage is only for alliance purposes, and promises to keep their relationship platonic. However, he eventually becomes attracted to the heroine, and is determined to keep her by his side forever.", "rate": 48, "genre": ["Drama"], "cast": ["Huang Xiaoming", "Victoria Song", "Peter Sheng", "Janice Wu", "Zhai Tianlin"], "character": ["Chi Yun", "Mu Qing Mo", "Sheng Lun", "Yi Li", "Yu Chen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71920   Expand A Life Time Love   (2017) User Score  Play Trailer Overview Chi Yun is a skilled martial artist who grew up in the wilderness. He falls in love with Mu Qingmo at first sight, and openly pursues her once they meet again a couple of years later. She eventually reciprocates his affections, even though her brother had already promised her hand in marriage to the powerful noble Lingyun Shenglun. Shenglun is aware their marriage is only for alliance purposes, and promises to keep their relationship platonic. However, he eventually becomes attracted to the heroine, and is determined to keep her by his side forever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Huang Xiaoming Chi Yun Victoria Song Mu Qing Mo Peter Sheng Sheng Lun Janice Wu Yi Li Zhai Tianlin Yu Chen Full Cast & Crew Last Season Season 1 2017 | 54 Episodes Season 1 of A Life Time Love premiered on June 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on A Life Time Love. You can help by rating TV shows you've seen. Facts Original Name  上古情歌 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  35m Homepage   http://www.weibo.com/u/6082149746 Genres Drama Keywords fantasy china romance Content Score 93 Almost there... Top Contributors M 46 Maria180493 d 1 divyanka TB 1 TMDb Bot 1 BryGur  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}