{"link": "https://www.themoviedb.org/tv/6332?language=en", "title": "The Incredible Hulk", "resume": "The Incredible Hulk is an American animated television series starring the Marvel Comics character the Hulk. It ran two seasons, for 21 episodes, on the television network UPN from 1996 to 1997. Lou Ferrigno, who portrayed Universal's version of the Hulk on the 1970s live-action TV series, provided the Hulk's voice for the true version from Marvel.\nThe show often featured cameo appearances by characters from other Marvel cartoons of the period. In the second season, the show's format, after UPN decided that Season 1 was too dark, was changed, and to give \"female viewers a chance\", the network ordered that She-Hulk be made a regular co-star. As a result, the series was officially renamed The Incredible Hulk and She-Hulk. The second season also featured the Grey Hulk.", "rate": 63, "genre": ["Animation", "Action", "Adventure", "Drama"], "cast": ["Matt Frewer", "Mark Hamill", "Lou Ferrigno", "John Vernon", "Cree Summer"], "character": ["Gargoyle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6332   Expand The Incredible Hulk   (1996) User Score Overview The Incredible Hulk is an American animated television series starring the Marvel Comics character the Hulk. It ran two seasons, for 21 episodes, on the television network UPN from 1996 to 1997. Lou Ferrigno, who portrayed Universal's version of the Hulk on the 1970s live-action TV series, provided the Hulk's voice for the true version from Marvel. The show often featured cameo appearances by characters from other Marvel cartoons of the period. In the second season, the show's format, after UPN decided that Season 1 was too dark, was changed, and to give \"female viewers a chance\", the network ordered that She-Hulk be made a regular co-star. As a result, the series was officially renamed The Incredible Hulk and She-Hulk. The second season also featured the Grey Hulk. Featured Crew Stan Lee Creator Jack Kirby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Frewer Mark Hamill Gargoyle Lou Ferrigno John Vernon Cree Summer Full Cast & Crew Last Season Season 2 1997 | 8 Episodes Season 2 of The Incredible Hulk premiered on September 21, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M 96 cartoon was the first Hulk adaptation to have everyone know Banner is the Hulk Open 0 by MickyMac\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1979-09-22 Spider-Woman 6.7    1994-09-24 Fantastic Four 6.7    1982-09-18 The Incredible Hulk 8.2    1999-10-30 The Avengers: United They Stand 6.0    1985-09-30 M.A.S.K. 5.4    1994-09-24 Iron Man 6.8    Silver Surfer: The Animated Series 7.7    1981-09-12 Spider-Man and His Amazing Friends 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Action & Adventure Drama Keywords superhero based on comic hulk Content Score 93 Almost there... Top Contributors 13 Banana CN 9 Carmelo Nicolosi 8 Panayotis R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}