{"link": "https://www.themoviedb.org/tv/44?language=en", "title": "Adventures of Sonic the Hedgehog", "resume": "Adventures of Sonic the Hedgehog is an American animated series based on the Sega video game franchise Sonic the Hedgehog. It was first broadcast in September 1993. It follows the adventures of the titular character Sonic the Hedgehog, and his sidekick Tails, as they attempt to stop Dr. Robotnik and his array of robots from taking over the planet Mobius. Another series featuring Sonic, simply titled Sonic the Hedgehog, was aired concurrently. Unlike the other series, Adventures had a light-hearted tone and quirky storylines that portrayed Sonic as being skilled and clever, whereas Robotnik and his robot allies Scratch and Grounder were clumsy.", "rate": 52, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure", "Comedy"], "cast": ["Jaleel White", "Christopher Evan Welch", "Long John Baldry", "Phil Hayes", "Garry Chalk"], "character": ["Sonic the Hedgehog (voice)", "Miles \"Tails\" Prower (voice)", "Dr. Ivo Robotnik (voice)", "Scratch / Sergeant Doberman (voice)", "Grounder / Captain Rescue (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44   Expand Adventures of Sonic the Hedgehog   (1993) User Score Overview Adventures of Sonic the Hedgehog is an American animated series based on the Sega video game franchise Sonic the Hedgehog. It was first broadcast in September 1993. It follows the adventures of the titular character Sonic the Hedgehog, and his sidekick Tails, as they attempt to stop Dr. Robotnik and his array of robots from taking over the planet Mobius. Another series featuring Sonic, simply titled Sonic the Hedgehog, was aired concurrently. Unlike the other series, Adventures had a light-hearted tone and quirky storylines that portrayed Sonic as being skilled and clever, whereas Robotnik and his robot allies Scratch and Grounder were clumsy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jaleel White Sonic the Hedgehog (voice) Christopher Evan Welch Miles \"Tails\" Prower (voice) Long John Baldry Dr. Ivo Robotnik (voice) Phil Hayes Scratch / Sergeant Doberman (voice) Garry Chalk Grounder / Captain Rescue (voice) Full Cast & Crew Last Season Season 4 1993 | 3 Episodes Season 4 of Adventures of Sonic the Hedgehog premiered on December  1, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2014-03-07 Cesar 911 6.8    2013-12-24 Turbo FAST 4.7    2015-06-12 Conspiracy 5.7    1985-09-14 The Wuzzles 5.7    2016-03-21 72 Dangerous Places to Live 6.0    2015-09-28 Danger Mouse 7.4    1999-10-04 Sonic Underground 2.0    1991-09-14 Back To The Future: The Animated Series 4.0  Facts Status  Ended Networks Broadcast Syndication Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 10 zurman1 9 Banana 8 TheOneManBoxOffice 8 Rocketeer Raccoon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}