{"link": "https://www.themoviedb.org/tv/13914?language=en", "title": "Fat Albert and the Cosby Kids", "resume": "Fat Albert and the Cosby Kids is an animated series created, produced, and hosted by comedian Bill Cosby, who also lent his voice to a number of characters, including Fat Albert himself. Filmation was the production company for the series. The show premiered in 1972 and ran until 1985. The show, based on Cosby's remembrances of his childhood gang, centered on Albert, and his friends.\nThe show always had an educational lesson emphasized by Cosby's live-action segments, and in early episodes the gang would usually gather in their North Philadelphia junkyard to play a rock song on their cobbled-together instruments at the end of the show.", "rate": 80, "genre": ["Animation"], "cast": ["Bill Cosby", "Bill Cosby", "Erika Scheimer", "Lou Scheimer", "Eric Suter"], "character": ["Bill Cosby", "Fat Albert Jackson", "Dumb Donald", "Rudy Davis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13914   Expand Fat Albert and the Cosby Kids   (1972) User Score Overview Fat Albert and the Cosby Kids is an animated series created, produced, and hosted by comedian Bill Cosby, who also lent his voice to a number of characters, including Fat Albert himself. Filmation was the production company for the series. The show premiered in 1972 and ran until 1985. The show, based on Cosby's remembrances of his childhood gang, centered on Albert, and his friends. The show always had an educational lesson emphasized by Cosby's live-action segments, and in early episodes the gang would usually gather in their North Philadelphia junkyard to play a rock song on their cobbled-together instruments at the end of the show. Featured Crew Bill Cosby Creator Ken Mundie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Cosby Bill Cosby Bill Cosby Fat Albert Jackson Erika Scheimer Lou Scheimer Dumb Donald Eric Suter Rudy Davis Full Cast & Crew Last Season Season 8 1984 | 50 Episodes Season 8 of Fat Albert and the Cosby Kids premiered on September  1, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1964-09-18 Jonny Quest 7.9    1976-08-05 What's Happening!! 8.0    American Gladiators 5.9    1995-09-21 Caroline in the City 6.7    2003-05-21 Birds of Prey 6.0    1979-09-22 Hart to Hart 6.5    1968-09-14 Wacky Races 7.1    1990-09-10 Captain Planet and the Planeteers 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors D 5 Doramius A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}