{"link": "https://www.themoviedb.org/tv/46875?language=en", "title": "Yukon Gold", "resume": "Yukon Gold is a Canadian reality television series produced by Paperny Entertainment that airs on History Television. The series follows four mining crews as they search for gold over the four month Yukon mining season. Miners Ken Foy, Al McGregor, Bernie Kreft and Karl Knutson each head one of the crews.\nThe series has been acquired in the United States by National Geographic Channel and will air in 2013.", "rate": 70, "genre": [], "cast": ["Al Mc Gregor", "Ken Foy", "Guillaume Brodeur", "Karl Knutson", "Cam Johnson"], "character": ["Big Al", "Ken", "Guillaume", "Karl", "Cam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46875   Expand Yukon Gold   (2013) User Score  Play Trailer Overview Yukon Gold is a Canadian reality television series produced by Paperny Entertainment that airs on History Television. The series follows four mining crews as they search for gold over the four month Yukon mining season. Miners Ken Foy, Al McGregor, Bernie Kreft and Karl Knutson each head one of the crews. The series has been acquired in the United States by National Geographic Channel and will air in 2013. Featured Crew David Paperny Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Al Mc Gregor Big Al Ken Foy Ken Guillaume Brodeur Guillaume Karl Knutson Karl Cam Johnson Cam Full Cast & Crew Last Season Season 5 2017 | 8 Episodes Season 5 of Yukon Gold premiered on March 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Yukon Gold. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://yukongold.history.ca/ Genres No genres have been added. Keywords gold alaska gold mine gold prospector yukon Content Score 93 Almost there... Top Contributors I 16 INOX n 5 nnccll 5 szab 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}