{"link": "https://www.themoviedb.org/tv/75804?language=en", "title": "Our Cartoon President", "resume": "A hilarious look into the Trump presidency, animation style. Starring two-dimensional avatars of Donald Trump and his merry band of insiders and family members, this cutting-edge comedy presents the truish adventures of Trump, his confidants and bon vivants through the eyes of an imaginary documentary crew.", "rate": 68, "genre": ["Animation", "Comedy"], "cast": ["Jeff Bergman", "Emily Lynne", "John Viener", "Cody Lindquist", "Gabriel Gundacker"], "character": ["Donald Trump (voice)", "Ivanka Trump / Eric Trump / Karen Pence / Rachel Maddow / Nancy Pelosi (voice)", "Mike Pence (voice)", "Melania Trump (voice)", "Stephen Miller (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75804   Expand Our Cartoon President   (2018) User Score  Play Trailer Overview A hilarious look into the Trump presidency, animation style. Starring two-dimensional avatars of Donald Trump and his merry band of insiders and family members, this cutting-edge comedy presents the truish adventures of Trump, his confidants and bon vivants through the eyes of an imaginary documentary crew. Featured Crew Stephen Colbert Creator Chris Licht Creator Matt Lappin Creator Tim Luecke Creator R.J. Fried Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Bergman Donald Trump (voice) Emily Lynne Ivanka Trump / Eric Trump / Karen Pence / Rachel Maddow / Nancy Pelosi (voice) John Viener Mike Pence (voice) Cody Lindquist Melania Trump (voice) Gabriel Gundacker Stephen Miller (voice) Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Our Cartoon President premiered on February 11, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply I could not make it through the first episode Open 0 by Dali Parton\n      \n     N Kickass trailer! Open 0 by Neeraj\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Our Cartoon President. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  26m Homepage   http://www.sho.com/our-cartoon-president Genres Animation Comedy Keywords parody usa politics Content Score 100 Yes! Looking good! Top Contributors 74 Elizabeth Jennings TB 2 TMDb Bot w 1 whitelist 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}