{"link": "https://www.themoviedb.org/tv/67443?language=en", "title": "Crisis in Six Scenes", "resume": "A comedy that takes place in the 1960's during turbulent times in the United States when a middle class suburban family is visited by a guest who turns their household completely upside down.", "rate": 64, "genre": ["Comedy"], "cast": ["Woody Allen", "Miley Cyrus", "Elaine May", "Rachel Brosnahan", "John Magaro"], "character": ["Sidney J. Munsinger", "Lennie Dale", "Kay Munsinger", "Ellie", "Alan Brockman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67443   Expand Crisis in Six Scenes   (2016) User Score  Play Trailer Overview A comedy that takes place in the 1960's during turbulent times in the United States when a middle class suburban family is visited by a guest who turns their household completely upside down. Featured Crew Woody Allen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Woody Allen Sidney J. Munsinger Miley Cyrus Lennie Dale Elaine May Kay Munsinger Rachel Brosnahan Ellie John Magaro Alan Brockman Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Crisis in Six Scenes premiered on September 30, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Crisis in Six Scenes. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Crisis in Six Scenes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  25m Homepage   https://www.amazon.com/gp/product/B01J4SS7NA Genres Comedy Keywords miniseries Content Score 100 Yes! Looking good! Top Contributors 39 Elizabeth Jennings TB 9 TMDb Bot 8 lineker R 4 RudyTG  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}