{"link": "https://www.themoviedb.org/tv/60985?language=en", "title": "Steve Austin's Broken Skull Challenge", "resume": "Hall of Fame professional wrestler Steve Austin invites eight elite athletes to his ranch each week to compete in head-to-head battles until only one is left standing. That man or woman then takes on Steve's personal obstacle course, the Skullbuster, for a chance to win $10,000.", "rate": 41, "genre": ["Reality"], "cast": ["Steve Austin"], "character": ["Himself (host)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60985   Expand Steve Austin's Broken Skull Challenge   (2014) User Score  Play Trailer Overview Hall of Fame professional wrestler Steve Austin invites eight elite athletes to his ranch each week to compete in head-to-head battles until only one is left standing. That man or woman then takes on Steve's personal obstacle course, the Skullbuster, for a chance to win $10,000. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Austin Himself (host) Full Cast & Crew Last Season Season 5 2017 | 8 Episodes Season 5 of Steve Austin's Broken Skull Challenge premiered on September 26, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Steve Austin's Broken Skull Challenge. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.cmt.com/show/steve-austins-broken-skull-challenge/series.jhtml Genres Reality Keywords endurance strength Content Score 64 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings TB 13 TMDb Bot d 7 diwasta 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}