{"link": "https://www.themoviedb.org/tv/168?language=en", "title": "Are You Being Served?", "resume": "Classic comedy set in fading department store Grace Brothers.", "rate": 70, "genre": ["Comedy"], "cast": ["Frank Thornton", "Mollie Sugden", "John Inman", "Wendy Richard", "Arthur Brough"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 168   Expand Are You Being Served?   (1972) User Score Overview Classic comedy set in fading department store Grace Brothers. Featured Crew David Croft Creator Jeremy Lloyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Thornton Mollie Sugden John Inman Wendy Richard Arthur Brough Full Cast & Crew Last Season ? season 10 1985 | 7 Episodes Season 10 of Are You Being Served? premiered on February 18, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1990-10-29 Keeping Up Appearances 7.4    1994-11-10 The Vicar of Dibley 7.3    1999-01-08 Gimme Gimme Gimme 7.0    1978-11-10 Butterflies 6.9    1975-04-04 The Good Life 7.0    1993-12-27 Shooting Stars 6.7    1979-09-30 To the Manor Born 7.1    1995-11-13 The Thin Blue Line 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://bbc.co.uk/programmes/b00722yk Genres Comedy Keywords department store camp sitcom british humour workplace comedy clerks Content Score 93 Almost there... Top Contributors 9 Banana PE 5 Patrick E. Abe 4 rodenborch O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}