{"link": "https://www.themoviedb.org/tv/34805?language=en", "title": "Sekirei", "resume": "Sekirei is a Japanese manga series by Sakurako Gokurakuin. The manga began serialization in the seinen magazine Young Gangan published by Square Enix in December 2004. An anime adaptation produced by Seven Arcs and directed by Keizō Kusakawa aired in Japan between July and September 2008, and a second season aired between July and September 2010. Both seasons are licensed in North America by Funimation Entertainment. The central character of the series is Minato Sahashi, a ronin who failed college examinations twice. His life changes, however, when he meets a girl named Musubi.", "rate": 84, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Kana Hanazawa", "Katsuyuki Konishi", "Kana Ueda", "Kana Asumi", "Saori Hayami"], "character": ["Kusano", "Kaoru Seo", "Yomi", "Yukari Sahashi", "Musubi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34805   Expand Sekirei   (2008) User Score Overview Sekirei is a Japanese manga series by Sakurako Gokurakuin. The manga began serialization in the seinen magazine Young Gangan published by Square Enix in December 2004. An anime adaptation produced by Seven Arcs and directed by Keizō Kusakawa aired in Japan between July and September 2008, and a second season aired between July and September 2010. Both seasons are licensed in North America by Funimation Entertainment. The central character of the series is Minato Sahashi, a ronin who failed college examinations twice. His life changes, however, when he meets a girl named Musubi. Featured Crew Sakurako Gokurakuin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Kusano Katsuyuki Konishi Kaoru Seo Kana Ueda Yomi Kana Asumi Yukari Sahashi Saori Hayami Musubi Full Cast & Crew Last Season Season 2 2010 | 14 Episodes Season 2 of Sekirei premiered on July  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  6 Recommendations   Sekirei Pure Engagement 8.2    2011-04-14 Aria the Scarlet Ammo 6.4    2010-07-10 Cat Planet Cuties 6.0    2006-10-04 Negima!? Magister Negi Magi 5.9    2006-04-04 Air Gear 5.3    2012-04-05 Sankarea: Undying Love 7.0    2009-10-05 Heaven's Lost Property 5.3    2005-01-06 Negima! Magister Negi Magi 6.7  Facts Original Name  セキレイ Status  Ended Networks Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.sekirei-tv.com/ Genres Animation Comedy Action & Adventure Keywords anime Content Score 93 Almost there... Top Contributors 22 marksjunior 18 ak015 10 BrerFox TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}