{"link": "https://www.themoviedb.org/tv/2632?language=en", "title": "Once Upon a Time... Life", "resume": "Il était une fois... la vie is a French animated television series which tells the story of the human body for children. The program was originally produced in France in 1987 by Procidis and directed by Albert Barillé. The series consists of 26 episodes and originally was aired on the French channel Canal+, and then on the state owned channel FR3. It is the third part of the Once Upon a Time... series.\nOnce Upon a Time... Life reintroduced the edutainment formula that had been left out on Once Upon a Time... Space. The series combined entertaining storylines with factual information, presented metaphorically.\nThe series Once Upon a Time... Life used the same characters from the other Once Upon a Time... seasons: the good characters represent the cells that make up the body's systems and defense mechanisms, such as red blood cells, white blood cells and platelets, while the bad characters represent the viruses and bacteria that threaten to attack the human body. Every episode of the series featured a different organ or system within the human body.\nIn the French-language version of the series, the opening theme song \"la Vie\" was performed by Sandra Kim, the winner of the 1986 Eurovision contest.", "rate": 82, "genre": ["Animation", "Documentary", "Family", "Kids"], "cast": ["Roger Carel", "Gilles Laurent", "Marie-Laure Beneston", "Alain Dorval", "Henry Djanik"], "character": ["Maestro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2632   Expand Once Upon a Time... Life   (1987) User Score Overview Il était une fois... la vie is a French animated television series which tells the story of the human body for children. The program was originally produced in France in 1987 by Procidis and directed by Albert Barillé. The series consists of 26 episodes and originally was aired on the French channel Canal+, and then on the state owned channel FR3. It is the third part of the Once Upon a Time... series. Once Upon a Time... Life reintroduced the edutainment formula that had been left out on Once Upon a Time... Space. The series combined entertaining storylines with factual information, presented metaphorically. The series Once Upon a Time... Life used the same characters from the other Once Upon a Time... seasons: the good characters represent the cells that make up the body's systems and defense mechanisms, such as red blood cells, white blood cells and platelets, while the bad characters represent the viruses and bacteria that threaten to attack the human body. Every episode of the series featured a different organ or system within the human body. In the French-language version of the series, the opening theme song \"la Vie\" was performed by Sandra Kim, the winner of the 1986 Eurovision contest. Featured Crew Albert Barillé Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  25 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger Carel Maestro Gilles Laurent Marie-Laure Beneston Alain Dorval Henry Djanik Full Cast & Crew Last Season Season 1 1987 | 26 Episodes Season 1 of Once Upon a Time... Life premiered on June 17, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  25 Recommendations   1979-03-24 Once Upon a Time... Man 8.2    1982-10-08 Once upon a time… Space 5.9    1979-09-16 Sport Billy 8.3    1998-01-17 Once Upon a Time... The Explorers 7.8    1986-05-28 Pingu 6.5    1984-10-15 Lucky Luke 6.1    1998-08-31 Noddy 5.9    1985-10-26 David the Gnome 7.3  Facts Original Name  Il était une fois... la vie Status  Ended Network Certification NR Meaning No rating information. Type  Scripted Original Language  French Runtime  26m Homepage   http://www.hellomaestro.fr/ Genres Animation Documentary Family Kids Keywords human body documentary kids Content Score 100 Yes! Looking good! Top Contributors D 16 DorianP 16 minusha97 14 Gustav d 10 dune2000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}