{"link": "https://www.themoviedb.org/tv/4328?language=en", "title": "A Country Practice", "resume": "A Country Practice was an Australian television drama series. At its inception, one of the longest-running of its kind, produced by James Davern of JNP Productions, who had wrote the pilot episode and entered a script contest for the network in 1979, coming third and winning a merit award. It ran on the Seven Network for 1,058 episodes from 18 November 1981 to 22 November 1993. It was produced in ATN-7's production facility at Epping, Sydney. After its lengthy run on the seven network it was picked up by network ten with a mainly new cast from April to November 1994 for 30 episodes, although the ten series was not as successful as its predecessor . The Channel Seven series was also filmed on location in Pitt Town, while, the Channel Ten series was filmed on location in Emerald, Victoria.", "rate": 17, "genre": ["Soap", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4328   Expand A Country Practice   (1981) User Score Overview A Country Practice was an Australian television drama series. At its inception, one of the longest-running of its kind, produced by James Davern of JNP Productions, who had wrote the pilot episode and entered a script contest for the network in 1979, coming third and winning a merit award. It ran on the Seven Network for 1,058 episodes from 18 November 1981 to 22 November 1993. It was produced in ATN-7's production facility at Epping, Sydney. After its lengthy run on the seven network it was picked up by network ten with a mainly new cast from April to November 1994 for 30 episodes, although the ten series was not as successful as its predecessor . The Channel Seven series was also filmed on location in Pitt Town, while, the Channel Ten series was filmed on location in Emerald, Victoria. Featured Crew James Davern Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 13 1994 | 30 Episodes Season 13 of A Country Practice premiered on April 13, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Country Practice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  48m, 60m Homepage  - Genres Soap Drama Keywords australia soap opera medical drama Content Score 50 Still needs a little work. Top Contributors 175 Marr 🇳🇱 9 Banana C 7 Conspirance 2 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}