{"link": "https://www.themoviedb.org/tv/30892?language=en", "title": "Rubicon", "resume": "Rubicon is an American television series that centers on an intelligence analyst at a national think tank in New York City called the American Policy Institute, who discovers that he may be working with members of a secret society that manipulates world events on a grand scale.", "rate": 79, "genre": ["Crime", "Drama", "Mystery"], "cast": ["James Badge Dale", "Jessica Collins", "Lauren Hodges", "Dallas Roberts", "Christopher Evan Welch"], "character": ["Will Travers", "Maggie Young", "Tanya MacGaffin", "Miles Fiedler", "Grant Test"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30892   Expand Rubicon   (2010) User Score Overview Rubicon is an American television series that centers on an intelligence analyst at a national think tank in New York City called the American Policy Institute, who discovers that he may be working with members of a secret society that manipulates world events on a grand scale. Featured Crew Jason Horwitch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Badge Dale Will Travers Jessica Collins Maggie Young Lauren Hodges Tanya MacGaffin Dallas Roberts Miles Fiedler Christopher Evan Welch Grant Test Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Rubicon premiered on June 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2011-02-07 Outcasts 6.2    2009-07-15 Dark Blue 6.6    2004-10-24 ReGenesis 7.0    2010-06-20 The Gates 6.8    2009-02-02 Whitechapel 7.5    2011-03-06 Breakout Kings 6.1    2011-05-05 The Shadow Line 8.1    2002-09-20 What I Like About You 5.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.amctv.com/originals/Rubicon/ Genres Crime Drama Mystery Keywords spy conspiracy Content Score 93 Almost there... Top Contributors 12 United600 8 Mitsarinho 8 Banana z 7 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}