{"link": "https://www.themoviedb.org/tv/65631?language=en", "title": "Five Enough", "resume": "Sang-Tae is left with his two children after his wife passes away. Since that time, he lives with his two kids and parents-in-law. He works as a marketing team leader for a fashion brand.\nMi-Jung works as an assistant manager at the same fashion company. 3 years ago, her husband had an affair with her friend and left her. She couldn't tell her kids the truth about their father and lied that their father went to work in America. To this day, the children still believe that their father is in America.\nSang-Tae and Mi-Jung never thought about falling in love again, but they fall in love with each other.", "rate": 40, "genre": ["Family", "Comedy"], "cast": ["Ahn Jae-Wook", "So Yoo-jin", "Shim Hyung-tak", "Shim Yi-Young", "Im Soo-hyang"], "character": ["Lee Sang-Tae", "An Mi-Jung", "Lee Ho-Tae", "Mo Soon-Young", "Jang Jin-Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65631   Expand Five Enough   (2016) User Score Overview Sang-Tae is left with his two children after his wife passes away. Since that time, he lives with his two kids and parents-in-law. He works as a marketing team leader for a fashion brand. Mi-Jung works as an assistant manager at the same fashion company. 3 years ago, her husband had an affair with her friend and left her. She couldn't tell her kids the truth about their father and lied that their father went to work in America. To this day, the children still believe that their father is in America. Sang-Tae and Mi-Jung never thought about falling in love again, but they fall in love with each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ahn Jae-Wook Lee Sang-Tae So Yoo-jin An Mi-Jung Shim Hyung-tak Lee Ho-Tae  Shim Yi-Young Mo Soon-Young Im Soo-hyang Jang Jin-Joo Full Cast & Crew Last Season Season 1 2016 | 54 Episodes Season 1 of Five Enough premiered on February 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Five Enough. You can help by rating TV shows you've seen. Facts Original Name  아이가 다섯 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/fivechild/index.html Genres Family Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 38 Maria180493 z 5 zurman1 s 3 sheva_vitali t 3 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}