{"link": "https://www.themoviedb.org/tv/68891?language=en", "title": "Missing Nine", "resume": "Story about an unexpected plane crash that causes a widespread panic in South Korea due to the disappearance of nine people, including some influential figures in the entertainment industry.\nSeo Joon O used to be a popular singer, but he isn't popular anymore. Now, he works as a reporter for a TV entertainment show. He and his stylist Ra Bong-Hee land on a deserted island.", "rate": 69, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Jung Kyung-ho", "Baek Jin-hee", "Choi Tae-joon", "Oh Jung-se", "Lee Sun-Bin"], "character": ["Seo Joon-Oh", "Ra Bong-Hee", "Choi Tae-Ho", "Jung Ki-Joon", "Ha Ji-Ah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68891   Expand Missing Nine   (2017) User Score Overview Story about an unexpected plane crash that causes a widespread panic in South Korea due to the disappearance of nine people, including some influential figures in the entertainment industry. Seo Joon O used to be a popular singer, but he isn't popular anymore. Now, he works as a reporter for a TV entertainment show. He and his stylist Ra Bong-Hee land on a deserted island. Featured Crew Han Jung-Hoon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Kyung-ho Seo Joon-Oh Baek Jin-hee Ra Bong-Hee Choi Tae-joon Choi Tae-Ho Oh Jung-se Jung Ki-Joon Lee Sun-Bin Ha Ji-Ah Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Missing Nine premiered on January 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2016-11-16 Weightlifting Fairy Kim Bok-Joo 8.9  Facts Original Name  미씽나인 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/missing9/ Genres Comedy Drama Mystery Keywords romance thriller memory loss conspiracy serial killer airplane crash music band deserted island nonlinear timeline Content Score 93 Almost there... Top Contributors M 65 Maria180493 29 Hillja z 15 zurman1 15 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}