{"link": "https://www.themoviedb.org/tv/5307?language=en", "title": "The Ed Sullivan Show", "resume": "The Ed Sullivan Show is an American TV variety show that originally ran on CBS from Sunday June 20, 1948 to Sunday June 6, 1971, and was hosted by New York entertainment columnist Ed Sullivan. It was replaced in September 1971 by the CBS Sunday Night Movie, which ran only one season and was eventually replaced by other shows.\nIn 2002, The Ed Sullivan Show was ranked #15 on TV Guide's 50 Greatest TV Shows of All Time.", "rate": 76, "genre": ["Comedy"], "cast": ["Art Hannes", "Bern Bennett", "Ed Sullivan", "Ralph Paul"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5307   Expand The Ed Sullivan Show   (1948) User Score Overview The Ed Sullivan Show is an American TV variety show that originally ran on CBS from Sunday June 20, 1948 to Sunday June 6, 1971, and was hosted by New York entertainment columnist Ed Sullivan. It was replaced in September 1971 by the CBS Sunday Night Movie, which ran only one season and was eventually replaced by other shows. In 2002, The Ed Sullivan Show was ranked #15 on TV Guide's 50 Greatest TV Shows of All Time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Art Hannes Bern Bennett Ed Sullivan Ralph Paul Full Cast & Crew Last Season Season 24 1970 | 25 Episodes Season 24 of The Ed Sullivan Show premiered on September 20, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1952-10-03 The Adventures of Ozzie and Harriet 5.6    1958-09-24 The Donna Reed Show 6.7    1969-09-17 The Courtship of Eddie's Father 6.2    1958-10-10 77 Sunset Strip 7.9    1965-01-24 Branded 8.3    1963-09-18 The Patty Duke Show 5.6    1961-10-02 Ben Casey 6.5    1962-10-11 McHale's Navy 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords variety show Content Score 86 Almost there... Top Contributors BD 28 Bob Daredevil M 7 MAthePA 4 t0by 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}