{"link": "https://www.themoviedb.org/tv/31441?language=en", "title": "The Famous Five", "resume": "The Famous Five is a British television series based on the children's books of the same name by Enid Blyton. It was broadcast on ITV over two series in 1978 and 1979. It was produced by Southern Television in 26 half-hour episodes.", "rate": 80, "genre": ["Action", "Adventure"], "cast": ["Gary Russell", "Jennifer Thanisch", "Marcus Harris", "Michele Gallagher", "Toddy"], "character": ["Dick", "Anne", "Julian", "George", "Timmy the Dog"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31441   Expand The Famous Five   (1978) User Score Overview The Famous Five is a British television series based on the children's books of the same name by Enid Blyton. It was broadcast on ITV over two series in 1978 and 1979. It was produced by Southern Television in 26 half-hour episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Russell Dick Jennifer Thanisch Anne Marcus Harris Julian Michele Gallagher George Toddy Timmy the Dog Full Cast & Crew Last Season Season 2 1979 | 13 Episodes Season 2 of The Famous Five premiered on June 27, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on The Famous Five. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors l 18 lcm121 14 Elizabeth Jennings 10 seawolf d 6 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}