{"link": "https://www.themoviedb.org/tv/57775?language=en", "title": "Chibi Maruko-chan", "resume": "Momoko Sakura is an elementary school student who likes popular  idol Momoe Yamaguchi and mangas. She is often called \"Chibi Maruko-chan\"  due to her young age and small size. She lives together with her  parents, her grandparents and her elder sister in a little town. In  school, she has many friends with whom she studies and plays together  everyday, including her close pal, Tama-chan; the student committee  members, Maruo-kun and Migiwa-san; and the B-class trio: 'little master'  Hanawa-kun, Hamaji-Bu Taro and Sekiguchi-kun.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Kei Tomiyama", "Junko Iwao", "Yuko Sasaki", "Masami Kikuchi", "Takeshi Aono"], "character": ["Tomozou Sakura", "Hasegawa kun", "Kotake Sakura", "Kazuhiko Hanawa", "Tomozou Sakura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57775   Expand Chibi Maruko-chan   (1990) User Score Overview Momoko Sakura is an elementary school student who likes popular  idol Momoe Yamaguchi and mangas. She is often called \"Chibi Maruko-chan\"  due to her young age and small size. She lives together with her  parents, her grandparents and her elder sister in a little town. In  school, she has many friends with whom she studies and plays together  everyday, including her close pal, Tama-chan; the student committee  members, Maruo-kun and Migiwa-san; and the B-class trio: 'little master'  Hanawa-kun, Hamaji-Bu Taro and Sekiguchi-kun. Featured Crew Momoko Sakura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kei Tomiyama Tomozou Sakura Junko Iwao Hasegawa kun Yuko Sasaki Kotake Sakura Masami Kikuchi Kazuhiko Hanawa Takeshi Aono Tomozou Sakura Full Cast & Crew Last Season Season 1 1990 | 66 Episodes Season 1 of Chibi Maruko-chan premiered on January  7, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chibi Maruko-chan. You can help by rating TV shows you've seen. Facts Original Name  ちびまる子ちゃん Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 6 tmdb983464 3 TheDerpMan A 2 Arius11  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}