{"link": "https://www.themoviedb.org/tv/31268?language=en", "title": "El capo", "resume": "The Capo is a television series made by Fox Telecolombia and written by Gustavo Bolivar for RCN Television, based on its namesake book. This is the most expensive series ever produced in Colombia. The set has an underground bunker, and expensive props like a virgin made of gold. It is estimated that the series cost about 18 billion Colombian pesos.\nThe series follows the story of the fictional drug lord Pedro Pablo León Jaramillo, a man who by necessity, chance and ambition has become the richest and most wanted drug trafficker in Colombia. Despite his immense wealth, Pedro Pablo has maintained a low profile over the course of his life and has kept his role as a drug cartel leader a secret from his friends and family. This strategy has allowed him to fly under the radar of the authorities for years, but has also inadvertently created a complex web of betrayals, loves and hates that grows beyond his control. As the truth is revealed, Pedro Pablo's world begins falling apart around him. The story became a personal obsession for Bolivar, written in first person, and was based on what he would do if he were \"El capo.\" Bolivar's research for the series included a lengthy investigation, including direct contact with other drug traffickers in prison.", "rate": 100, "genre": [], "cast": ["Marlon Moreno", "Katherine Vélez", "Marcela Mar", "Diego Trujillo", "Maria Adelaida Puerta"], "character": ["Pedro Pablo León Jaramillo", "Isabel Cristina", "Marcela Lievano", "Guillermo Holguin", "Pilar Monroy 'La Perrys'"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31268   Expand El capo   (2009) User Score Overview The Capo is a television series made by Fox Telecolombia and written by Gustavo Bolivar for RCN Television, based on its namesake book. This is the most expensive series ever produced in Colombia. The set has an underground bunker, and expensive props like a virgin made of gold. It is estimated that the series cost about 18 billion Colombian pesos. The series follows the story of the fictional drug lord Pedro Pablo León Jaramillo, a man who by necessity, chance and ambition has become the richest and most wanted drug trafficker in Colombia. Despite his immense wealth, Pedro Pablo has maintained a low profile over the course of his life and has kept his role as a drug cartel leader a secret from his friends and family. This strategy has allowed him to fly under the radar of the authorities for years, but has also inadvertently created a complex web of betrayals, loves and hates that grows beyond his control. As the truth is revealed, Pedro Pablo's world begins falling apart around him. The story became a personal obsession for Bolivar, written in first person, and was based on what he would do if he were \"El capo.\" Bolivar's research for the series included a lengthy investigation, including direct contact with other drug traffickers in prison. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marlon Moreno Pedro Pablo León Jaramillo Katherine Vélez Isabel Cristina Marcela Mar Marcela Lievano Diego Trujillo Guillermo Holguin Maria Adelaida Puerta Pilar Monroy 'La Perrys' Full Cast & Crew Last Season Season 1 — | 49 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on El capo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.canalrcn.com/programas/index.php/el-capo/ Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 Amanda m 3 michaelflaker 1 Banana 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}