{"link": "https://www.themoviedb.org/tv/35046?language=en", "title": "Un village français", "resume": "The stories of the people of Villeneuve, a fictional subprefecture, in the Jura, in German–occupied France during the Second World War.", "rate": 93, "genre": ["Drama"], "cast": ["Robin Renucci", "Audrey Fleurot", "Nicolas Gob", "Thierry Godard", "Nade Dieu"], "character": ["Daniel Larcher", "Hortense Larcher", "Jean Marchetti", "Raymond Schwartz", "Marie Germain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35046   Expand Un village français   (2009) User Score Overview The stories of the people of Villeneuve, a fictional subprefecture, in the Jura, in German–occupied France during the Second World War. Featured Crew Frédéric Krivine Creator Philippe Triboit Creator Emmanuel Daucé Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robin Renucci Daniel Larcher Audrey Fleurot Hortense Larcher Nicolas Gob Jean Marchetti Thierry Godard Raymond Schwartz Nade Dieu Marie Germain Full Cast & Crew Last Season Season 7 2016 | 12 Episodes Season 7 of Un village français premiered on October 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Un village français. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  50m Homepage   https://www.france.tv/france-3/un-village-francais/ Genres Drama Keywords france world war ii occupation 1940s Content Score 93 Almost there... Top Contributors M 69 Manu s 10 skydnot e 10 error42 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}