{"link": "https://www.themoviedb.org/tv/30539?language=en", "title": "Zane's Sex Chronicles", "resume": "Zane's Sex Chronicles is an American television series based on the urban erotica novels written by Zane. The series follows the friendships and relationship of five female friends who enjoy the steamy stories of erotic writer Zane. The series premiered on Cinemax on October 11, 2008.\nThe urban adult series was renewed for a second season, which premiered on March 5, 2010.", "rate": 16, "genre": ["Drama"], "cast": ["Christina DeRosa", "Maya Gilbert", "Johanna Quintero", "Laila Odom", "Patrice Fisher"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30539   Expand Zane's Sex Chronicles   (2008) User Score Overview Zane's Sex Chronicles is an American television series based on the urban erotica novels written by Zane. The series follows the friendships and relationship of five female friends who enjoy the steamy stories of erotic writer Zane. The series premiered on Cinemax on October 11, 2008. The urban adult series was renewed for a second season, which premiered on March 5, 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina DeRosa Maya Gilbert Johanna Quintero Laila Odom Patrice Fisher Full Cast & Crew Last Season Season 2 2010 | 13 Episodes Season 2 of Zane's Sex Chronicles premiered on February 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Zane's Sex Chronicles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cinemax.com/zane/ Genres Drama Keywords sex career woman female friendship Content Score 86 Almost there... Top Contributors 15 Banana 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}