{"link": "https://www.themoviedb.org/tv/70883?language=en", "title": "Love Tyrant", "resume": "A Kiss Note is a powerful notebook that makes anyone who has their name written together will instantly fall in love if they kiss each other regardless of any circumstances. This magical and very familiar item belongs to an angel named Guri whose job as cupid is to create couples. However, she accidentally writes down Aino Seiji, a regular high school student, and unless he kisses someone, Guri will die. She convinces Seiji to go kiss his crush, Hiyama Akane, the school's popular girl who turns out has even stronger feelings for him, bordering on obsessive and psychotic. Eventually Akane and Seiji come together but not before Guri decides that she likes Seiji as well. What seems awesome to most guys becomes hell for Seiji who just wants a normal relationship with girls.", "rate": 71, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Yuki  Nagano", "Manami Numakura", "Yoshino Aoyama", "Kenshou Ono"], "character": ["Kichougasaki, Yuzu", "Hiyama, Akane", "Guri", "Aino, Seiji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70883   Expand Love Tyrant   (2017) User Score Overview A Kiss Note is a powerful notebook that makes anyone who has their name written together will instantly fall in love if they kiss each other regardless of any circumstances. This magical and very familiar item belongs to an angel named Guri whose job as cupid is to create couples. However, she accidentally writes down Aino Seiji, a regular high school student, and unless he kisses someone, Guri will die. She convinces Seiji to go kiss his crush, Hiyama Akane, the school's popular girl who turns out has even stronger feelings for him, bordering on obsessive and psychotic. Eventually Akane and Seiji come together but not before Guri decides that she likes Seiji as well. What seems awesome to most guys becomes hell for Seiji who just wants a normal relationship with girls. Featured Crew Atsushi Nigorikawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuki  Nagano Kichougasaki, Yuzu Manami Numakura Hiyama, Akane Yoshino Aoyama Guri Kenshou Ono Aino, Seiji Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Love Tyrant premiered on April  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2017-04-05 Armed Girl's Machiavellism 8.6    2017-04-01 The Silver Guardian 6.4    2017-04-07 Tsukigakirei 7.9    2017-04-04 The Royal Tutor 7.7    2016-07-08 Alderamin on the Sky 7.4    2017-07-12 My First Girlfriend is a Gal 7.4    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2011-01-11 Is This a Zombie? 7.7  Facts Original Name  恋愛暴君 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://renaiboukun.com/ Genres Animation Comedy Drama Keywords based on manga anime Content Score 93 Almost there... Top Contributors 17 sp1ti 14 johntres C 11 Chintaran 10 TripleZGamer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}