{"link": "https://www.themoviedb.org/tv/50832?language=en", "title": "Back in the Game", "resume": "Terry Gannon Jr. was an All Star softball player until life threw her a couple curve balls: a baby, a lost college scholarship and a loser for a husband. After striking out on her own, Terry and her son Danny move in with her estranged father, Terry Sr. aka \"The Cannon,\" an opinionated, beer-guzzling, ex-athlete who never quite made the cut as a single father or professional baseball player. When Terry reluctantly offers to coach Danny and a group of other athletically-challenged hopefuls, her past comes rushing back.", "rate": 71, "genre": ["Comedy", "Family"], "cast": ["James Caan", "Maggie Lawson", "Benjamin Koldyke", "Griffin Gluck", "Lenora Crichlow"], "character": ["Terry 'The Cannon' Gannon, Sr.", "Terry Gannon Jr.", "Dick Slingbaugh", "Danny Gannon", "Gigi Fernandez-Lovette"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50832   Expand Back in the Game   (2013) User Score Overview Terry Gannon Jr. was an All Star softball player until life threw her a couple curve balls: a baby, a lost college scholarship and a loser for a husband. After striking out on her own, Terry and her son Danny move in with her estranged father, Terry Sr. aka \"The Cannon,\" an opinionated, beer-guzzling, ex-athlete who never quite made the cut as a single father or professional baseball player. When Terry reluctantly offers to coach Danny and a group of other athletically-challenged hopefuls, her past comes rushing back. Featured Crew Mark Cullen Creator Robb Cullen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Caan Terry 'The Cannon' Gannon, Sr. Maggie Lawson Terry Gannon Jr. Benjamin Koldyke Dick Slingbaugh Griffin Gluck Danny Gannon Lenora Crichlow Gigi Fernandez-Lovette Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Back in the Game premiered on September 25, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w David: Happy Birthday Cooper Roth! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2013-09-17 Dads 4.8    2014-09-17 Red Band Society 6.4    2013-09-26 The Michael J. Fox Show 5.6    2013-09-26 The Crazy Ones 5.8    2014-09-17 The Mysteries of Laura 6.3    2011-04-06 Breaking In 5.4    2015-01-22 Backstrom 6.4    2015-09-24 The Player 5.8  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Family Keywords sport baseball single mother sitcom living with parents Content Score 93 Almost there... Top Contributors 19 Banana 15 United600 J 7 JohnBordello 6 seawolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}