{"link": "https://www.themoviedb.org/tv/58810?language=en", "title": "Crossbones", "resume": "It's 1715 on the Bahamian island of New Providence, the first functioning democracy in the Americas, where the diabolical pirate Edward Teach, a.k.a. Blackbeard, reigns over a rogue nation of thieves, outlaws and miscreant sailors. Part shantytown, part marauder's paradise, this is a place like no other on earth - and a mounting threat to international commerce. To gain control of this fearsome society, Tom Lowe, a highly skilled undercover assassin, is sent to the buccaneers' haven to take down the brilliant and charismatic Blackbeard. But the closer Lowe gets, the more he finds that his quest is not so simple. Lowe can't help but admire the political ideals of Blackbeard, whose thirst for knowledge knows no bounds - and no law. But Lowe is not the only danger to Blackbeard's rule. He is a man with many villainous rivals and one great weakness - a passionately driven woman whom he cannot deny.", "rate": 61, "genre": ["Drama"], "cast": ["John Malkovich", "Richard Coyle", "Yasmine Al Massri", "David Hoflin", "Claire Foy"], "character": ["Blackbeard", "Tom Lowe", "Selima El Sharad", "Charlie Rider", "Kate Balfour"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58810   Expand Crossbones   (2014) User Score  Play Trailer Overview It's 1715 on the Bahamian island of New Providence, the first functioning democracy in the Americas, where the diabolical pirate Edward Teach, a.k.a. Blackbeard, reigns over a rogue nation of thieves, outlaws and miscreant sailors. Part shantytown, part marauder's paradise, this is a place like no other on earth - and a mounting threat to international commerce. To gain control of this fearsome society, Tom Lowe, a highly skilled undercover assassin, is sent to the buccaneers' haven to take down the brilliant and charismatic Blackbeard. But the closer Lowe gets, the more he finds that his quest is not so simple. Lowe can't help but admire the political ideals of Blackbeard, whose thirst for knowledge knows no bounds - and no law. But Lowe is not the only danger to Blackbeard's rule. He is a man with many villainous rivals and one great weakness - a passionately driven woman whom he cannot deny. Featured Crew Neil Cross Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Malkovich Blackbeard Richard Coyle Tom Lowe Yasmine Al Massri Selima El Sharad David Hoflin Charlie Rider Claire Foy Kate Balfour Full Cast & Crew Last Season Season 1 2014 | 9 Episodes Season 1 of Crossbones premiered on May 30, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2012-10-11 Copper 6.0    2005-09-16 Threshold 6.9    2014-08-23 Intruders 6.5    2014-01-07 Intelligence 6.3    2013-07-10 The Bridge 6.3    2014-03-10 Believe 6.3    2013-09-23 Hostages 6.1    2014-08-04 Partners 5.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/crossbones Genres Drama Keywords outlaw pirate period drama swashbuckler 18th century historical drama Content Score 100 Yes! Looking good! Top Contributors 56 Elizabeth Jennings 7 Banana TB 6 TMDb Bot w 6 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}