{"link": "https://www.themoviedb.org/tv/76142?language=en", "title": "Magical Girl Ore", "resume": "\"Love makes a girl stronger.\" Saki Uno is working hard as part of the new idol unit, Magical Twin. The one she admires most is Mohiro Mikage, who’s the older brother of her idol unit partner Sakuyo, and he’s also a member of the top idol unit STAR☆PRINCE. She would be willing to do anything for him, and one day, those feelings brought on a miracle. Saki ended up turning into a magical girl when she strongly wished to protect someone... But what she turned into wasn’t exactly what she was expecting...", "rate": 70, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76142   Expand Magical Girl Ore   (2018) User Score  Play Trailer Overview \"Love makes a girl stronger.\" Saki Uno is working hard as part of the new idol unit, Magical Twin. The one she admires most is Mohiro Mikage, who’s the older brother of her idol unit partner Sakuyo, and he’s also a member of the top idol unit STAR☆PRINCE. She would be willing to do anything for him, and one day, those feelings brought on a miracle. Saki ended up turning into a magical girl when she strongly wished to protect someone... But what she turned into wasn’t exactly what she was expecting... Featured Crew Itsurou Kawasaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Magical Girl Ore premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Magical Girl Ore. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Magical Girl Ore. You can help by rating TV shows you've seen. Facts Original Name  魔法少女 俺 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://magicalgirl-ore.com/ Genres Comedy Animation Keywords parody based on manga magical girl anime Content Score 71 Just a little bit more... Top Contributors 23 sp1ti 12 eduardonek 12 jmf2k b 8 beachsounddog  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}