{"link": "https://www.themoviedb.org/tv/33478?language=en", "title": "Hardcore Pawn", "resume": "Hardcore Pawn is an American reality television series produced by RDF USA and Richard Dominick Productions for truTV about the day-to day operations of American Jewelry and Loan, a family-owned and operated pawn shop in Detroit, Michigan's 8 Mile Road corridor.\nThe series premiered on August 16, 2010, delivering two million viewers, setting a record as truTV's most-watched series premiere ever.", "rate": 45, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33478   Expand Hardcore Pawn   (2010) User Score Overview Hardcore Pawn is an American reality television series produced by RDF USA and Richard Dominick Productions for truTV about the day-to day operations of American Jewelry and Loan, a family-owned and operated pawn shop in Detroit, Michigan's 8 Mile Road corridor. The series premiered on August 16, 2010, delivering two million viewers, setting a record as truTV's most-watched series premiere ever. Featured Crew Richard Dominick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2014 | 13 Episodes Season 9 of Hardcore Pawn premiered on December 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   The Tom Green Show 6.4    2010-12-01 Storage Wars 5.3    2009-07-19 Pawn Stars 6.5    2004-08-31 Dog the Bounty Hunter 3.4    2004-10-19 The Biggest Loser 4.6    1991-09-30 The Jerry Springer Show 3.1    2005-01-17 Supernanny 4.3    2007-04-23 Diners, Drive-Ins and Dives 6.0  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  21m Homepage   http://www.trutv.com/shows/hardcore-pawn/ Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 11 TMDb Bot 8 elbates j 6 jnylen 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}