{"link": "https://www.themoviedb.org/tv/12662?language=en", "title": "Adventures of Superman", "resume": "Adventures of Superman is an American television series based on comic book characters and concepts created in 1938 by Jerry Siegel and Joe Shuster. The show is the first television series to feature Superman and began filming in 1951 in California. Sponsored by cereal manufacturer Kellogg's, the syndicated show's first, and last, air dates are disputed but generally accepted as September 19, 1952 and April 28, 1958. The show's first two seasons were filmed in black-and-white; seasons three through six were filmed in color but originally telecast monochromatically in first-run syndication. Television viewers would not see Superman in color until the series was syndicated to local stations in 1965.\nGeorge Reeves plays Clark Kent/Superman with Jack Larson as Jimmy Olsen, John Hamilton as Perry White, and Robert Shayne as Inspector Henderson. Phyllis Coates plays Lois Lane in the first season with Noel Neill stepping into the role in the second season. Stories follow Superman as he battles crooks, gangsters, and other villains in the fictional city of Metropolis while masquerading \"off-duty\" as Daily Planet reporter Clark Kent. Lois Lane and Jimmy Olsen, Clark's colleagues at the office, often find themselves in dangerous situations which can only be resolved with Superman's timely intervention.", "rate": 70, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["George Reeves", "John Hamilton", "Jack Larson", "Robert Shayne", "Noel Neill"], "character": ["Superman", "Perry White", "Jimmy Olsen", "Inspector Henderson", "Lois Lane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12662   Expand Adventures of Superman   (1952) User Score Overview Adventures of Superman is an American television series based on comic book characters and concepts created in 1938 by Jerry Siegel and Joe Shuster. The show is the first television series to feature Superman and began filming in 1951 in California. Sponsored by cereal manufacturer Kellogg's, the syndicated show's first, and last, air dates are disputed but generally accepted as September 19, 1952 and April 28, 1958. The show's first two seasons were filmed in black-and-white; seasons three through six were filmed in color but originally telecast monochromatically in first-run syndication. Television viewers would not see Superman in color until the series was syndicated to local stations in 1965. George Reeves plays Clark Kent/Superman with Jack Larson as Jimmy Olsen, John Hamilton as Perry White, and Robert Shayne as Inspector Henderson. Phyllis Coates plays Lois Lane in the first season with Noel Neill stepping into the role in the second season. Stories follow Superman as he battles crooks, gangsters, and other villains in the fictional city of Metropolis while masquerading \"off-duty\" as Daily Planet reporter Clark Kent. Lois Lane and Jimmy Olsen, Clark's colleagues at the office, often find themselves in dangerous situations which can only be resolved with Superman's timely intervention. Featured Crew Joe Shuster Creator Jerry Siegel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  25 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Reeves Superman John Hamilton Perry White Jack Larson Jimmy Olsen Robert Shayne Inspector Henderson Noel Neill Lois Lane Full Cast & Crew Last Season Season 6 1958 | 13 Episodes Season 6 of Adventures of Superman premiered on February  3, 1958. View All Seasons Social Reviews  0 Discussions  25 Subject Status Replies Last Reply AoS on H&I network Open 1 by  Moon Doggie Self-referential newsstand scene in \"A Ghost for Scotland Yard\" episode Open 0 by PT 100\n      \n     Does Superman need to sleep? Open 2 by  Zürich Gnome Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1967-01-01 Dragnet 6.3    1968-01-22 Rowan & Martin's Laugh-In 7.1    1972-01-22 Emergency! 7.4    1964-09-25 Gomer Pyle, U.S.M.C. 6.8    1963-09-29 My Favorite Martian 5.4    1960-10-03 The Andy Griffith Show 7.4    1957-09-14 Have Gun – Will Travel 8.3    2003-07-11 Spider-Man: The New Animated Series 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Drama Comedy Keywords super power Content Score 93 Almost there... Top Contributors 5 Steve 2 lineker 2 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}