{"link": "https://www.themoviedb.org/tv/63033?language=en", "title": "Dickensian", "resume": "Dickensian intertwines the realm of fictional characters in Charles Dickens’ novels—including Scrooge, Fagin and Miss Havisham—in half-hour episodes, as their lives intertwine in 19th century London. The Old Curiosity Shop sits next door to The Three Cripples Pub, while Fagin’s Den is hidden down a murky alley off a bustling Victorian street.", "rate": 67, "genre": ["Drama"], "cast": ["Alexandra Moen", "Ned Dennehy", "Stephen Rea", "Pauline Collins", "Peter Firth"], "character": ["Frances Barbary", "Ebenezer Scrooge", "Inspector Bucket", "Mrs Gamp", "Jacob Marley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63033   Expand Dickensian   (2015) User Score  Play Trailer Overview Dickensian intertwines the realm of fictional characters in Charles Dickens’ novels—including Scrooge, Fagin and Miss Havisham—in half-hour episodes, as their lives intertwine in 19th century London. The Old Curiosity Shop sits next door to The Three Cripples Pub, while Fagin’s Den is hidden down a murky alley off a bustling Victorian street. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexandra Moen Frances Barbary Ned Dennehy Ebenezer Scrooge Stephen Rea Inspector Bucket Pauline Collins Mrs Gamp Peter Firth Jacob Marley Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Dickensian premiered on December 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  13 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dickensian. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b06vbmfq Genres Drama Keywords victorian england period drama charles dickens Content Score 93 Almost there... Top Contributors 53 Elizabeth Jennings 5 MatthewDon2002 D 4 Demonacho 4 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}