{"link": "https://www.themoviedb.org/tv/64793?language=en", "title": "Mischievous Kiss: Love in Tokyo", "resume": "At a high school entrance ceremony, high school student Kotoko Aihara, who isn't that smart, notices pretty boy Naoki Irie. She falls in love with him immediately. Kotoko initially doesn't express her feelings to him, but finally has a chance to tell him how she feels. Unfortunately, Naoki turns Kotoko down, saying \"I don't like dumb women.\" One day, Kotoko Aihara's house is severely damaged by an earthquake. Until the house is rebuilt, Kotoko Aihara and her father decide to live with her father's friend. When Kotoko Aihara moves to her new temporary house, she is surprised to learn that Naoki Irie lives there as well.", "rate": 70, "genre": ["Comedy", "Romance"], "cast": ["Yuki Furukawa", "Honoka Yahagi", "Yuki Yamada", "Kasumi Yamaya", "Kanna Mori"], "character": ["Irie Naoki", "Aihara Kotoko", "Ikezawa Kinnosuke", "Ishikawa Satomi", "Matsumoto Yuuko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64793   Expand Mischievous Kiss: Love in Tokyo   (2013) User Score Overview At a high school entrance ceremony, high school student Kotoko Aihara, who isn't that smart, notices pretty boy Naoki Irie. She falls in love with him immediately. Kotoko initially doesn't express her feelings to him, but finally has a chance to tell him how she feels. Unfortunately, Naoki turns Kotoko down, saying \"I don't like dumb women.\" One day, Kotoko Aihara's house is severely damaged by an earthquake. Until the house is rebuilt, Kotoko Aihara and her father decide to live with her father's friend. When Kotoko Aihara moves to her new temporary house, she is surprised to learn that Naoki Irie lives there as well. Featured Crew Koto Nagata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuki Furukawa Irie Naoki Honoka Yahagi Aihara Kotoko Yuki Yamada Ikezawa Kinnosuke Kasumi Yamaya Ishikawa Satomi Kanna Mori Matsumoto Yuuko Full Cast & Crew Last Season Season 2 2014 | 16 Episodes Season 2 of Mischievous Kiss: Love in Tokyo premiered on November 24, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mischievous Kiss: Love in Tokyo. You can help by rating TV shows you've seen. Facts Original Name  イタズラなKiss〜Love in TOKYO Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  50m Homepage   http://www.cinemart.co.jp/itakiss-tokyo2/ Genres Comedy Romance Keywords japan Content Score 93 Almost there... Top Contributors M 36 Maria180493 t 12 taxigps z 10 zurman1 5 Fabrício  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}