{"link": "https://www.themoviedb.org/tv/12272?language=en", "title": "Thriller", "resume": "Thriller is an American anthology television series that aired during the 1960–61 and 1961–62 seasons on NBC. The show featured host Boris Karloff introducing a mix of macabre horror tales and suspense thrillers. Reruns currently air on the MeTV television network.", "rate": 54, "genre": [], "cast": ["Boris Karloff"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12272   Expand Thriller   (1960) User Score Overview Thriller is an American anthology television series that aired during the 1960–61 and 1961–62 seasons on NBC. The show featured host Boris Karloff introducing a mix of macabre horror tales and suspense thrillers. Reruns currently air on the MeTV television network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Boris Karloff Host Full Cast & Crew Last Season Season 2 1961 | 30 Episodes Season 2 of Thriller premiered on September 18, 1961. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply lives up to name Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Thriller. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 49m Homepage  - Genres No genres have been added. Keywords horror anthology Content Score 50 Still needs a little work. Top Contributors 9 Banana BD 4 Bob Daredevil CM 3 Cherche Moi 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}