{"link": "https://www.themoviedb.org/tv/4304?language=en", "title": "X-Play", "resume": "X-Play is a TV program about video games, known for its reviews and comedy skits. The program aired on G4 in the United States, G4 Canada in Canada, FUEL TV in Australia, Ego in Israel, GXT in Italy, MTV Россия in Russia and Solar Sports in the Philippines. On October 26, 2012, it was reported that the show would cease production after 2012; the one-hour series finale aired January 23, 2013.\nThe show in its final incarnation was hosted by Morgan Webb and Blair Herter, with Kristin Adams and Jessica Chobot serving as special correspondents/co-hosts. Adam Sessler was the original host of the program; he previously co-hosted with Lauren Fielder and Kate Botello.\nX-Play began on the ZDTV network in 1998 as GameSpot TV, where Sessler co-hosted with Fielder for the show's first year, then co-hosted with Botello up through 2002.", "rate": 70, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4304   Expand X-Play   (1998) User Score  Play Trailer Overview X-Play is a TV program about video games, known for its reviews and comedy skits. The program aired on G4 in the United States, G4 Canada in Canada, FUEL TV in Australia, Ego in Israel, GXT in Italy, MTV Россия in Russia and Solar Sports in the Philippines. On October 26, 2012, it was reported that the show would cease production after 2012; the one-hour series finale aired January 23, 2013. The show in its final incarnation was hosted by Morgan Webb and Blair Herter, with Kristin Adams and Jessica Chobot serving as special correspondents/co-hosts. Adam Sessler was the original host of the program; he previously co-hosted with Lauren Fielder and Kate Botello. X-Play began on the ZDTV network in 1998 as GameSpot TV, where Sessler co-hosted with Fielder for the show's first year, then co-hosted with Botello up through 2002. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2012 — | 7 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on X-Play. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://g4tv.com/games/xplay/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 9 Animenut05 B 3 BCEMovieDB TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}