{"link": "https://www.themoviedb.org/tv/65312?language=en", "title": "False Flag", "resume": "The series, loosely based on the true story of the assassination in Dubai of a senior Hamas official Mahmoud al-Mabhouh - the co-founder of military wing of the Islamist Palestinian group Hamas on 19 January 2010, revolves around five ordinary Israeli citizens who discover one morning via the media that they are the principal suspects of a high-profile kidnapping and are implicated as culprits in the kidnapping.", "rate": 77, "genre": ["Drama"], "cast": ["Ishai Golan", "Magi Azarzar", "Angel Bonanni", "Orna Salinger", "Morris Cohen"], "character": ["Ben 'Benny' Rephael", "Natalie Elfassia", "Sean Tilson", "Emma Lipman", "Eli Mazor - israelischer Geheimdienstmitarbeiter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65312   Expand False Flag   (2015) User Score  Play Trailer Overview The series, loosely based on the true story of the assassination in Dubai of a senior Hamas official Mahmoud al-Mabhouh - the co-founder of military wing of the Islamist Palestinian group Hamas on 19 January 2010, revolves around five ordinary Israeli citizens who discover one morning via the media that they are the principal suspects of a high-profile kidnapping and are implicated as culprits in the kidnapping. Featured Crew Amit Cohen Creator Maria Feldman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ishai Golan Ben 'Benny' Rephael Magi Azarzar Natalie Elfassia Angel Bonanni Sean Tilson Orna Salinger Emma Lipman Morris Cohen Eli Mazor - israelischer Geheimdienstmitarbeiter Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of False Flag premiered on October 29, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on False Flag. You can help by rating TV shows you've seen. Facts Original Name  Kfulim Status  In Production Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Hebrew Runtime  40m Homepage   http://www.mako.co.il/tv-false-flag Genres Drama Keywords assassination based on a true story Content Score 100 Yes! Looking good! Top Contributors z 26 zyck o 18 orhan_yümücly 8 Antalysfr 6 yuvalg72  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}