{"link": "https://www.themoviedb.org/tv/73946?language=en", "title": "Last Hero Inuyashiki", "resume": "Inuyashiki Ichirou is down on his luck. While only 58 years old, his geriatric looks often have him written off as a pathetic old man by the world around him and he’s constantly ignored and disrespected by his family despite all that he’s done to support them. On top of everything else, his doctor has revealed that he has cancer and it appears that he has little time left in this world. But just when it seems things couldn’t get any worse, a blinding light in the night sky strikes the earth where Ichirou stands. He later wakes up to find himself unscathed, but he soon starts to notice that there’s something… different about himself. However, it turns out that these strange, new changes are just what Ichirou needs to take a new lease on life and now it seems like there’s nothing to stop him from being a hero worthy of the respect that he never had before… unless, that is, there was someone else out there with these same changes…", "rate": 74, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Nijirou Murakami", "Fumiyo Kohinata", "Kanata Hongo", "Sumire Uesaka", "Sumire Morohoshi"], "character": ["Hiro Shishigami", "Ichirou Inuyashiki", "Naoyuki Andou", "Mari Inuyashiki", "Shion Watanabe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73946   Expand Last Hero Inuyashiki   (2017) User Score Overview Inuyashiki Ichirou is down on his luck. While only 58 years old, his geriatric looks often have him written off as a pathetic old man by the world around him and he’s constantly ignored and disrespected by his family despite all that he’s done to support them. On top of everything else, his doctor has revealed that he has cancer and it appears that he has little time left in this world. But just when it seems things couldn’t get any worse, a blinding light in the night sky strikes the earth where Ichirou stands. He later wakes up to find himself unscathed, but he soon starts to notice that there’s something… different about himself. However, it turns out that these strange, new changes are just what Ichirou needs to take a new lease on life and now it seems like there’s nothing to stop him from being a hero worthy of the respect that he never had before… unless, that is, there was someone else out there with these same changes… Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nijirou Murakami Hiro Shishigami Fumiyo Kohinata Ichirou Inuyashiki Kanata Hongo Naoyuki Andou Sumire Uesaka Mari Inuyashiki Sumire Morohoshi Shion Watanabe Full Cast & Crew Current Season Season 1 2017 | 11 Episodes Season 1 of Last Hero Inuyashiki premiered on October 12, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Last Hero Inuyashiki. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2017-07-05 Netsuzou TRap 5.7    2017-10-05 Just Because! 8.3    2017-07-04 Tsuredure Children 8.0    2017-10-02 Juni Taisen: Zodiac War 7.8    2017-07-07 MADE IN ABYSS 8.2    2016-01-08 ERASED 7.8    2014-07-03 Tokyo Ghoul 7.2  Facts Original Name  いぬやしき Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.inuyashiki-project.com/ Genres Animation Drama Sci-Fi & Fantasy Keywords psychology based on manga anime Content Score 93 Almost there... Top Contributors 19 sp1ti C 13 Chintaran 13 Alex 10 wdesirey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}