{"link": "https://www.themoviedb.org/tv/8862?language=en", "title": "Unwrapped", "resume": "Unwrapped is an American television program on Food Network that reveals the origins of sponsored foods. It first aired in June 2001 and is hosted by Marc Summers. The show leads viewers on tours of factories and other food-related locations. Popular subjects include candy, breakfast cereal, snacks, and TV dinners. The show's spin-off, Trivia Unwrapped, is a game show also hosted by Marc Summers.", "rate": 60, "genre": ["Documentary", "News"], "cast": ["Marc Summers"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8862   Expand Unwrapped   (2001) User Score Overview Unwrapped is an American television program on Food Network that reveals the origins of sponsored foods. It first aired in June 2001 and is hosted by Marc Summers. The show leads viewers on tours of factories and other food-related locations. Popular subjects include candy, breakfast cereal, snacks, and TV dinners. The show's spin-off, Trivia Unwrapped, is a game show also hosted by Marc Summers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Summers Full Cast & Crew Last Season Season 22 2010 | 12 Episodes Season 22 of Unwrapped premiered on June 11, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Unwrapped. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.foodnetwork.com/unwrapped/index.html Genres Documentary News Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}