{"link": "https://www.themoviedb.org/tv/38420?language=en", "title": "Is This a Zombie?", "resume": "Some guys have no luck; he’s got no pulse. That’s life for poor unfortunate, undead Ayumu. First, he was murdered by a serial killer. Total bummer. Then he was resurrected as a zombie by a cute little Necromancer. That seemed pretty cool until she moved into his house, refused to speak, and forced his rotting carcass to do all the cooking. After that, a magical girl in a pretty pink dress used her matching chainsaw to chop his corpse in half. Luckily, the Necromancer’s powers of resurrection trumped those of the chainsaw chick, so instead of dying (again), Ayumu became the world’s first magical girl zombie. There’s also a voluptuous vampire ninja who thinks zombie boy’s a pervert – and a hideous crayfish demon who wants to devour him. Confused? All you gotta know is this: zombies, frilly dresses, demons, and moe chainsaws. Pink. It’s the new dead.", "rate": 75, "genre": ["Animation", "Comedy", "Fantasy"], "cast": ["Junji Majima", "Midori Tsukimiya", "Iori Nomizu", "Youko Hikasa", "Hisako Kanemoto"], "character": ["Ayumu Aikawa (voice)", "Eucliwood \"Eu\" Hellscythe (voice)", "Haruna (voice)", "Seraphim \"Sera\" (voice)", "Mael Strom / Yuki \"Tomonori\" Yoshida (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38420   Expand Is This a Zombie?   (2011) User Score Overview Some guys have no luck; he’s got no pulse. That’s life for poor unfortunate, undead Ayumu. First, he was murdered by a serial killer. Total bummer. Then he was resurrected as a zombie by a cute little Necromancer. That seemed pretty cool until she moved into his house, refused to speak, and forced his rotting carcass to do all the cooking. After that, a magical girl in a pretty pink dress used her matching chainsaw to chop his corpse in half. Luckily, the Necromancer’s powers of resurrection trumped those of the chainsaw chick, so instead of dying (again), Ayumu became the world’s first magical girl zombie. There’s also a voluptuous vampire ninja who thinks zombie boy’s a pervert – and a hideous crayfish demon who wants to devour him. Confused? All you gotta know is this: zombies, frilly dresses, demons, and moe chainsaws. Pink. It’s the new dead. Featured Crew Takeshi Yasuda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  16 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junji Majima Ayumu Aikawa (voice) Midori Tsukimiya Eucliwood \"Eu\" Hellscythe (voice) Iori Nomizu Haruna (voice) Youko Hikasa Seraphim \"Sera\" (voice) Hisako Kanemoto Mael Strom / Yuki \"Tomonori\" Yoshida (voice) Full Cast & Crew Last Season Season 2: Of the Dead 2012 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Is This a Zombie?. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  16 Posters  7 Recommendations   2006-10-04 Negima!? Magister Negi Magi 5.9    2013-10-03 Outbreak Company 8.8    2005-01-06 Negima! Magister Negi Magi 6.7    2012-10-12 Robotics;Notes 4.7    2010-04-03 Demon King Daimao 7.2    2008-07-02 Sekirei 7.7    2013-04-04 The Devil Is a Part-Timer! 7.1    2012-04-05 Sankarea: Undying Love 7.0  Facts Original Name  これはゾンビですか？ Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/is-this-a-zombie Genres Animation Comedy Fantasy Keywords magic vampire supernatural harem zombie necromancer ecchi anime fan service Content Score 93 Almost there... Top Contributors 236 Marr 🇳🇱 36 WillofOwn 13 kappa-papa 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}