{"link": "https://www.themoviedb.org/tv/16089?language=en", "title": "The Tommyknockers", "resume": "A buried UFO slowly turns local inhabitants into gizmo-building alien mutants.", "rate": 54, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Jimmy Smits", "Marg Helgenberger", "John Ashton", "Allyce Beasley", "Robert Carradine"], "character": ["Jim 'Gard' Gardner", "Roberta 'Bobbi' Anderson", "Trooper Butch Duggan", "Deputy Becka Paulson", "Bryant Brown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16089   Expand The Tommyknockers   (1993) User Score  Play Trailer Overview A buried UFO slowly turns local inhabitants into gizmo-building alien mutants. Featured Crew Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  4 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Smits Jim 'Gard' Gardner Marg Helgenberger Roberta 'Bobbi' Anderson John Ashton Trooper Butch Duggan Allyce Beasley Deputy Becka Paulson Robert Carradine Bryant Brown Full Cast & Crew Last Season Season 1 1993 | 2 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply S How the aliens operated Open 2 by  Strannger18 Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  14 Recommendations   1995-05-14 The Langoliers 5.9    1997-04-27 The Shining 6.0    1994-05-08 The Stand 6.8    1999-02-14 Storm of the Century 6.8    2002-01-27 Rose Red 6.6    1979-11-17 Salem's Lot 6.4    2002-03-10 Firestarter: Rekindled 5.2    2004-06-20 Salem's Lot 5.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  181m Homepage  - Genres Sci-Fi & Fantasy Keywords based on novel or book alien ufo miniseries Content Score 100 Yes! Looking good! Top Contributors TB 59 TMDb Bot 9 Roy R 7 Rebecca w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}