{"link": "https://www.themoviedb.org/tv/61949?language=en", "title": "Mike Tyson Mysteries", "resume": "Mike Tyson is taking the fight from the boxing ring to the streets … by solving mysteries! Aided by the Mike Tyson Mystery Team — the Ghost of the Marquess of Queensberry, Mike’s adopted Korean daughter and a pigeon who was once a man — Mike Tyson will answer any plea sent to him.", "rate": 79, "genre": ["Mystery", "Animation", "Comedy"], "cast": ["Mike Tyson", "Norm Macdonald", "Rachel Ramras", "Jim Rash"], "character": ["Mike Tyson", "Pigeon", "Yung Hee Tyson", "Marquess of Queensberry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61949   Expand Mike Tyson Mysteries   (2014) User Score  Play Trailer Overview Mike Tyson is taking the fight from the boxing ring to the streets … by solving mysteries! Aided by the Mike Tyson Mystery Team — the Ghost of the Marquess of Queensberry, Mike’s adopted Korean daughter and a pigeon who was once a man — Mike Tyson will answer any plea sent to him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Tyson Mike Tyson Norm Macdonald Pigeon Rachel Ramras Yung Hee Tyson Jim Rash Marquess of Queensberry Full Cast & Crew Last Season Season 3 2017 | 17 Episodes Season 3 of Mike Tyson Mysteries premiered on May 14, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Mike Tyson Mysteries. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2017-04-21 Bill Nye Saves the World 2.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.adultswim.com/videos/mike-tyson-mysteries Genres Mystery Animation Comedy Keywords amateur detective adult animation Content Score 93 Almost there... Top Contributors 28 Elizabeth Jennings s 16 svaraej r 5 robert123 4 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}