{"link": "https://www.themoviedb.org/tv/999?language=en", "title": "Best Week Ever", "resume": "Best Week Ever is a weekly television program on the United States cable/satellite network VH1. It started airing in 2004 and was put on hiatus in the summer of 2009. In January 2010, it was announced that the show was cancelled. On August 3, 2012, VH1 announced the return of Best Week Ever. New weekly episodes began January 18, 2013.\nOn the show, comedians analyze the previous week's developments in pop culture, including recent happenings in entertainment and celebrity gossip.\nThe show's tagline is, \"It's everything you love, everything you missed, and all the stuff you need to see again.\"", "rate": 0, "genre": ["Comedy"], "cast": ["Christian Finnegan", "Chuck Nice", "John Aboud", "Judah Friedlander", "Michael Colton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 999   Expand Best Week Ever   (2004) User Score Overview Best Week Ever is a weekly television program on the United States cable/satellite network VH1. It started airing in 2004 and was put on hiatus in the summer of 2009. In January 2010, it was announced that the show was cancelled. On August 3, 2012, VH1 announced the return of Best Week Ever. New weekly episodes began January 18, 2013. On the show, comedians analyze the previous week's developments in pop culture, including recent happenings in entertainment and celebrity gossip. The show's tagline is, \"It's everything you love, everything you missed, and all the stuff you need to see again.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Finnegan Chuck Nice John Aboud Judah Friedlander Michael Colton Full Cast & Crew Last Season Season 7 2013 | 7 Episodes Season 7 of Best Week Ever premiered on January 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Best Week Ever. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bestweekever.tv/ Genres Comedy Keywords pop culture celebrity gossip Content Score 71 Just a little bit more... Top Contributors 11 Banana R 4 Rebecca T 1 Tim 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}