{"link": "https://www.themoviedb.org/tv/4355?language=en", "title": "6teen", "resume": "6teen is a Canadian animated sitcom, which premiered in Canada in 2004 on Teletoon. In the USA, 6teen first premiered on Nickelodeon on December 18, 2005 and was removed from the schedule on May 13, 2006. 6teen was previously aired on The N in reruns on December 26, 2005 until July 28, 2006, but then returned to The N as a 24-hour channel on December 31, 2007 until June 21, 2008. In the US 6teen was shown on Cartoon Network after its premiere on October 23, 2008. On Cartoon Network, 6teen had frequent airings weekly since its premiere on October 23, 2008, but got removed from the schedule in mid-November 2009. Then it returned with frequent airings in mid-February 2010, and once again got removed after its series finale on June 21, 2010. In January 2011, 6teen returned for one month only to Cartoon Network, but got removed, with other cancelled series, due to a schedule revamp. It is occasionally shown on Popgirl.\nThe series finale, \"Bye Bye Nikki? Part 2\", included an acoustic remake of the theme song by Brian Melo. 6teen ended with a total of 93 episodes. DVD and iTunes releases have been made in both Canada and the USA. Though ended, creators Pertsch and McGillis both extended a willingness for a possible two-hour reunion telemovie or a feature film. As of now, it is currently not on Cartoon Network's schedule, but episodes are available from Cartoon Network on Demand in select areas. On January 3, 2011, 6teen returned with reruns to Teletoon, where it airs weekend mornings at 3:00 a.m. EST, and it recently returned to its former weekday schedule at 7:00 p.m. EST. The show is also available on Netflix streaming in the US and in the UK.", "rate": 80, "genre": ["Comedy", "Animation"], "cast": ["Stacey DePass", "Megan Fahlenbock", "Brooke D'Orsay", "Terry McGurrin", "Christian Potenza"], "character": ["Nikki Wong", "Jen Masterson", "Caitlin Cooke", "Jonesy Garcia (Voice)", "Jude Lizowski"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4355   Expand 6teen   (2004) User Score Overview 6teen is a Canadian animated sitcom, which premiered in Canada in 2004 on Teletoon. In the USA, 6teen first premiered on Nickelodeon on December 18, 2005 and was removed from the schedule on May 13, 2006. 6teen was previously aired on The N in reruns on December 26, 2005 until July 28, 2006, but then returned to The N as a 24-hour channel on December 31, 2007 until June 21, 2008. In the US 6teen was shown on Cartoon Network after its premiere on October 23, 2008. On Cartoon Network, 6teen had frequent airings weekly since its premiere on October 23, 2008, but got removed from the schedule in mid-November 2009. Then it returned with frequent airings in mid-February 2010, and once again got removed after its series finale on June 21, 2010. In January 2011, 6teen returned for one month only to Cartoon Network, but got removed, with other cancelled series, due to a schedule revamp. It is occasionally shown on Popgirl. The series finale, \"Bye Bye Nikki? Part 2\", included an acoustic remake of the theme song by Brian Melo. 6teen ended with a total of 93 episodes. DVD and iTunes releases have been made in both Canada and the USA. Though ended, creators Pertsch and McGillis both extended a willingness for a possible two-hour reunion telemovie or a feature film. As of now, it is currently not on Cartoon Network's schedule, but episodes are available from Cartoon Network on Demand in select areas. On January 3, 2011, 6teen returned with reruns to Teletoon, where it airs weekend mornings at 3:00 a.m. EST, and it recently returned to its former weekday schedule at 7:00 p.m. EST. The show is also available on Netflix streaming in the US and in the UK. Featured Crew Jennifer Pertsch Creator Tom McGillis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stacey DePass Nikki Wong Megan Fahlenbock Jen Masterson Brooke D'Orsay Caitlin Cooke Terry McGurrin Jonesy Garcia (Voice) Christian Potenza Jude Lizowski Full Cast & Crew Last Season Season 4 2009 | 13 Episodes Season 4 of 6teen premiered on September 10, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 6teen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Animation Keywords slice of life teenager mall Content Score 93 Almost there... Top Contributors 10 Ailurus Fulgens 5 lineker b 4 bouddhadplatre s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}