{"link": "https://www.themoviedb.org/tv/73576?language=en", "title": "Man Who Sets The Table", "resume": "Lee Roo-Ri tries to get a job at big company, but she gives up. She doesn't have a good relationship with her strict father. Lee Roo-Ri decides to travel to a foreign country to get away. There, she meets Jung Tae-Yang who goes by the YOLO motto. He wanders around the world and places priority on his happiness, but he also carries an emotional wound.\nAfter she meets Jung Tae-Yang, Lee Roo-Ri has a turning point of her life.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Choi Soo-young", "On Ju-wan", "Seo Hyo-rim", "Park Jin-woo", "Kim Kap-soo"], "character": ["Lee Roo-ri", "Jung Tae-yang", "Ha Yun-joo", "Lee So Won", "Lee Shin-mo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73576   Expand Man Who Sets The Table   (2017) User Score Overview Lee Roo-Ri tries to get a job at big company, but she gives up. She doesn't have a good relationship with her strict father. Lee Roo-Ri decides to travel to a foreign country to get away. There, she meets Jung Tae-Yang who goes by the YOLO motto. He wanders around the world and places priority on his happiness, but he also carries an emotional wound. After she meets Jung Tae-Yang, Lee Roo-Ri has a turning point of her life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Soo-young Lee Roo-ri On Ju-wan Jung Tae-yang Seo Hyo-rim Ha Yun-joo Park Jin-woo Lee So Won Kim Kap-soo Lee Shin-mo Full Cast & Crew Last Season Season 1 2017 | 50 Episodes Season 1 of Man Who Sets The Table premiered on September  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Man Who Sets The Table. You can help by rating TV shows you've seen. Facts Original Name  밥상을 차리는 남자 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/babsang/index.html Genres Comedy Drama Keywords romance Content Score 86 Almost there... Top Contributors 27 huggi M 17 Maria180493 5 Elizabeth Jennings 3 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}