{"link": "https://www.themoviedb.org/tv/17640?language=en", "title": "Piers Morgan's Life Stories", "resume": "Piers Morgan's Life Stories, also known as Life Stories, is a British television chat show on ITV, presented by journalist Piers Morgan. Filmed in front of a studio audience, each programme is devoted to one celebrity guest. Episodes are currently recorded at The London Studios, although episodes were previously recorded at Teddington Studios and BBC Television Centre between one and two weeks before they are aired on television. Since 2011, Morgan pretapes all of the episodes before the start of a series. This is due to his U.S. filming commitments for CNN.", "rate": 50, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17640   Expand Piers Morgan's Life Stories   (2009) User Score  Play Trailer Overview Piers Morgan's Life Stories, also known as Life Stories, is a British television chat show on ITV, presented by journalist Piers Morgan. Filmed in front of a studio audience, each programme is devoted to one celebrity guest. Episodes are currently recorded at The London Studios, although episodes were previously recorded at Teddington Studios and BBC Television Centre between one and two weeks before they are aired on television. Since 2011, Morgan pretapes all of the episodes before the start of a series. This is due to his U.S. filming commitments for CNN. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 13 2015 | 1 Episode Season 13 of Piers Morgan's Life Stories premiered on September  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Piers Morgan's Life Stories. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.officialpiersmorgan.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 3 TMDb Bot - 2 -Alexander- J 2 JUJUNI 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}