{"link": "https://www.themoviedb.org/tv/47813?language=en", "title": "Cuckoo", "resume": "Cuckoo is every parent's worst nightmare - a slacker full of outlandish, New Age ideas. Ken is the over-protective father of a girl who's impulsively married an American hippie on her gap year.", "rate": 66, "genre": ["Comedy"], "cast": ["Greg Davies", "Helen Baxendale", "Esther Smith", "Tyger Drew-Honey", "Taylor Lautner"], "character": ["Ken Thompson", "Lorna Thompson", "Rachel Thompson", "Dylan Thompson", "Dale Jr."], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47813   Expand Cuckoo   (2012) User Score Overview Cuckoo is every parent's worst nightmare - a slacker full of outlandish, New Age ideas. Ken is the over-protective father of a girl who's impulsively married an American hippie on her gap year. Featured Crew Kieron Quirke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Davies Ken Thompson Helen Baxendale Lorna Thompson Esther Smith Rachel Thompson Tyger Drew-Honey Dylan Thompson Taylor Lautner Dale Jr. Full Cast & Crew Last Season Season 3 2016 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2015-09-28 Danger Mouse 7.4    2011-02-08 Traffic Light 7.2    2009-02-25 Burnistoun 7.8    2016-08-02 Borderline 7.1    2016-01-03 Bordertown 5.1    1997-09-12 Ninja Turtles: The Next Mutation 3.9    2013-05-03 Maron 6.9    2015-09-02 Atelier 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b04d72n6 Genres Comedy Keywords sitcom british humour Content Score 93 Almost there... Top Contributors 17 Elizabeth Jennings 15 Banana a 6 adambakir92 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}