{"link": "https://www.themoviedb.org/tv/18186?language=en", "title": "Eastwick", "resume": "Eastwick is a 2009 television series based on John Updike's novel The Witches of Eastwick. The series was developed by Maggie Friedman, and starred Paul Gross as the infamous Darryl Van Horne, alongside Jaime Ray Newman, Lindsay Price, and Rebecca Romijn as the eponymous witches.", "rate": 61, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Jaime Ray Newman", "Lindsay Price", "Rebecca Romijn", "Sara Rue", "Ashley Benson"], "character": ["Kat Gardener", "Joanna Frankel", "Roxie Torcoletti", "Penny Higgins", "Mia Torcoletti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18186   Expand Eastwick   (2009) User Score Overview Eastwick is a 2009 television series based on John Updike's novel The Witches of Eastwick. The series was developed by Maggie Friedman, and starred Paul Gross as the infamous Darryl Van Horne, alongside Jaime Ray Newman, Lindsay Price, and Rebecca Romijn as the eponymous witches. Featured Crew Maggie Friedman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jaime Ray Newman Kat Gardener Lindsay Price Joanna Frankel Rebecca Romijn Roxie Torcoletti Sara Rue Penny Higgins Ashley Benson Mia Torcoletti Full Cast & Crew Last Season Season 1 2009 | 13 Episodes Season 1 of Eastwick premiered on September 23, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  17 Posters  2 Recommendations   2007-09-28 Moonlight 7.1    1994-11-06 Earth 2 7.4    2007-06-16 Jekyll 8.1    2015-09-30 You, Me and the Apocalypse 7.2    2009-08-02 Defying Gravity 6.6    2013-10-10 Once Upon a Time in Wonderland 6.1    2006-09-28 Ugly Betty 5.5    2004-12-13 Legend of Earthsea 5.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/shows/eastwick Genres Sci-Fi & Fantasy Drama Keywords witch new england Content Score 93 Almost there... Top Contributors z 5 zurman1 5 colonelgrant 4 Banana 3 ModrejTom  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}