{"link": "https://www.themoviedb.org/tv/1902?language=en", "title": "Pardon the Interruption", "resume": "Pardon the Interruption is a sports television show that airs weekdays on various ESPN TV channels, TSN, ESPN America, XM, and Sirius satellite radio services, and as a downloadable podcast. It is hosted by Tony Kornheiser and Michael Wilbon, who discuss, and frequently argue over, the top stories of the day in \"sports... and other stuff\". They had previously done this off-air in The Washington Post newsroom. Either Tony Reali or the uncredited \"producer over the loudspeaker\" serves as moderator for parts of the show, which is filmed in Washington, D.C.; Around The Horn also originates from the same studio.\nSimilar in format to Siskel and Ebert, PTI is known for its humorous and often loud tone, as well as the \"rundown\" graphic which lists the topics yet to be discussed on the right-hand side of the screen. The show's popularity has led to the creation of similar shows on ESPN, and similar segments on other series, and the rundown graphic has since been implemented on the morning editions of SportsCenter among many imitators. The show won a Sports Emmy Award for best Daily Outstanding Studio Show for 2009.", "rate": 70, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1902   Expand Pardon the Interruption   (2001) User Score Overview Pardon the Interruption is a sports television show that airs weekdays on various ESPN TV channels, TSN, ESPN America, XM, and Sirius satellite radio services, and as a downloadable podcast. It is hosted by Tony Kornheiser and Michael Wilbon, who discuss, and frequently argue over, the top stories of the day in \"sports... and other stuff\". They had previously done this off-air in The Washington Post newsroom. Either Tony Reali or the uncredited \"producer over the loudspeaker\" serves as moderator for parts of the show, which is filmed in Washington, D.C.; Around The Horn also originates from the same studio. Similar in format to Siskel and Ebert, PTI is known for its humorous and often loud tone, as well as the \"rundown\" graphic which lists the topics yet to be discussed on the right-hand side of the screen. The show's popularity has led to the creation of similar shows on ESPN, and similar segments on other series, and the rundown graphic has since been implemented on the morning editions of SportsCenter among many imitators. The show won a Sports Emmy Award for best Daily Outstanding Studio Show for 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2015 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2005-07-25 Anthony Bourdain: No Reservations 7.9    2004-10-13 Survivorman 7.8    1985-09-24 Growing Pains 6.1    2006-10-27 Man vs. Wild 6.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.espn.go.com/eoe/pti.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors r 2 regina21 1 Animenut05 1 Amelandbor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}