{"link": "https://www.themoviedb.org/tv/14968?language=en", "title": "Empire Falls", "resume": "The humorous, poignant story of a declining New England town and its inhabitants, whose lives are deeply rooted in and influenced by the Knox River and its vacant mills, their class differences, and ghosts of the past.", "rate": 65, "genre": ["Drama"], "cast": ["Ed Harris", "Philip Seymour Hoffman", "Aidan Quinn", "Helen Hunt", "Paul Newman"], "character": ["Miles Roby", "Charlie Mayne", "Janine Roby", "Max Roby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14968   Expand Empire Falls   (2005) User Score  Play Trailer Overview The humorous, poignant story of a declining New England town and its inhabitants, whose lives are deeply rooted in and influenced by the Knox River and its vacant mills, their class differences, and ghosts of the past. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ed Harris Miles Roby Philip Seymour Hoffman Charlie Mayne Aidan Quinn Helen Hunt Janine Roby Paul Newman Max Roby Full Cast & Crew Last Season Season 1 2005 | 2 Episodes Season 1 of Empire Falls premiered on May 28, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   1982-12-05 Marco Polo 5.8    1988-10-11 Jack the Ripper 7.1    2002-01-02 Shackleton 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  86m, 111m Homepage   http://www.hbo.com/movies/empire-falls Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors TB 68 TMDb Bot 11 Elizabeth Jennings 4 galani s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}