{"link": "https://www.themoviedb.org/tv/76205?language=en", "title": "Trolls: The Beat Goes On!", "resume": "Queen Poppy tries to keep Troll Village's peace with the Bergens by inviting them to parties, playing their sports and preventing crime.", "rate": 57, "genre": ["Animation", "Comedy"], "cast": ["Amanda Leighton", "Skylar Astin", "Ron Funches"], "character": ["Poppy (voice)", "Branch (voice)", "Cooper (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76205   Expand Trolls: The Beat Goes On!   (2018) User Score  Play Trailer Overview Queen Poppy tries to keep Troll Village's peace with the Bergens by inviting them to parties, playing their sports and preventing crime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Leighton Poppy (voice) Skylar Astin Branch (voice) Ron Funches Cooper (voice) Full Cast & Crew Current Season Season 2 2018 | 7 Episodes Season 2 of Trolls: The Beat Goes On! premiered on March  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Trolls: The Beat Goes On!. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  23m Homepage   https://www.netflix.com/title/80117560 Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 41 Elizabeth Jennings HM 4 Horst Merten R 3 Ramiro 2 peliculastop  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}