{"link": "https://www.themoviedb.org/tv/70177?language=en", "title": "Abstract: The Art of Design", "resume": "Step inside the minds of the most innovative designers in a variety of disciplines and learn how design impacts every aspect of life.", "rate": 83, "genre": ["Documentary"], "cast": ["Jay Leno", "Michael Jordan", "George Lois", "Christoph Niemann", "Tinker Hatfield"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70177   Expand Abstract: The Art of Design   (2017) User Score  Play Trailer Overview Step inside the minds of the most innovative designers in a variety of disciplines and learn how design impacts every aspect of life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Leno Michael Jordan George Lois Christoph Niemann Tinker Hatfield Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Abstract: The Art of Design premiered on February 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2017-01-24 Terrace House: Aloha State 7.7    2015-05-24 Tales by Light 7.8    2015-04-26 Chef's Table 7.5    2017-07-21 Ozark 8.0    2016-12-16 The OA 7.3    2018-02-02 Altered Carbon 7.9    2017-01-07 Taboo 8.0    2011-12-04 Black Mirror 8.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  45m Homepage   https://www.netflix.com/title/80057883 Genres Documentary Keywords illustrator architect design Content Score 93 Almost there... Top Contributors d 17 dylanp06 15 Elizabeth Jennings 13 Simon 7 Kyuhwan Kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}