{"link": "https://www.themoviedb.org/tv/8318?language=en", "title": "Zone Stad", "resume": "Zone Stad is a popular Flemish-Belgian TV series about a police-department located in Antwerp. The show started in 2003 and is still being produced. In the series, police officers solve various crimes, which are shown as realistically as possible. It is produced by the VMMa and broadcast on Belgian commercial channel vtm and TROS in The Netherlands. Currently, season 8 is being aired.", "rate": 60, "genre": ["Drama"], "cast": ["Guy Van Sande", "Kim Hertogs", "Katrien Vandendries", "Werner De Smedt", "Peter Van Asbroeck"], "character": ["Tom Segers", "Esther Mathijs", "Dani Wauters", "Lucas Neefs", "Mike Van Peel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8318   Expand Zone Stad   (2003) User Score Overview Zone Stad is a popular Flemish-Belgian TV series about a police-department located in Antwerp. The show started in 2003 and is still being produced. In the series, police officers solve various crimes, which are shown as realistically as possible. It is produced by the VMMa and broadcast on Belgian commercial channel vtm and TROS in The Netherlands. Currently, season 8 is being aired. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Van Sande Tom Segers Kim Hertogs Esther Mathijs Katrien Vandendries Dani Wauters Werner De Smedt Lucas Neefs Peter Van Asbroeck Mike Van Peel Full Cast & Crew Last Season Season 8 2013 | 13 Episodes Season 8 of Zone Stad premiered on March  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Zone Stad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  50m, 60m Homepage   http://www.vtm.be/zonestad Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors K 105 KevinV t 18 tmdb61358576 s 3 speedycars 1 Gizmo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}