{"link": "https://www.themoviedb.org/tv/231?language=en", "title": "The Soup", "resume": "With this satirical series, the E! Entertainment Network returns to a format they helped create with the popular '90s show Talk Soup. Only this time instead of just poking fun at talk shows, they're setting their sights on all things in entertainment, reality TV, pop culture, and politics.", "rate": 54, "genre": ["Talk", "Comedy"], "cast": ["Joel McHale"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 231   Expand The Soup   (2004) User Score Overview With this satirical series, the E! Entertainment Network returns to a format they helped create with the popular '90s show Talk Soup. Only this time instead of just poking fun at talk shows, they're setting their sights on all things in entertainment, reality TV, pop culture, and politics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joel McHale Himself - Host Full Cast & Crew Last Season Season 12 2015 | 38 Episodes Season 12 of The Soup premiered on January  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   2009-03-02 Late Night with Jimmy Fallon 6.0    2006-08-07 Gene Simmons Family Jewels 4.4    2005-01-03 The Late Late Show with Craig Ferguson 7.5    2005-10-30 Lucy, the Daughter of the Devil 7.0    2000-12-21 The Brak Show 7.0    2014-08-07 Garfunkel and Oates 7.5    2000-12-21 Sealab 2021 7.8    1999-01-25 Dilbert 6.9  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.eonline.com/shows/the_soup Genres Talk Comedy Keywords pop culture comedian chihuahua Content Score 56 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings TB 9 TMDb Bot 2 area 301 R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}