{"link": "https://www.themoviedb.org/tv/1246?language=en", "title": "Bionic Woman", "resume": "Bionic Woman is an American science fiction television drama that aired in 2007, which was created by David Eick, under NBC Universal Television Group, GEP Productions, and David Eick Productions. The series was a re-imagining of the original television series, The Bionic Woman, created by Kenneth Johnson, which in turn was based upon the novel Cyborg by Martin Caidin and its TV adaptation The Six Million Dollar Man, retaining its forebears' premise while taking on a more contemporary setting. David Eick also serves as executive producer alongside Laeta Kalogridis and Jason Smilovic. Production of the series was halted due to a strike by the Writers Guild of America causing only eight episodes to be aired. Following its failure to be included in the Fall 2008 schedule it was announced that the series was canceled as the result of low ratings.\nThe series revolved around bartender Jaime Sommers, who is saved from death after receiving experimental medical implants. While adjusting to her new bionic powers and raising a rebellious younger sister, Jaime agrees to work for the Berkut Group, a quasi-governmental private organization that performed her surgery.", "rate": 55, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Katee Sackhoff", "Molly Price", "Miguel Ferrer", "Michelle Ryan", "Lucy Hale"], "character": ["Sarah Corvus", "Ruth Treadwell", "Jonas Bledsoe", "Jaime Sommers", "Becca Sommers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1246   Expand Bionic Woman   (2007) User Score Overview Bionic Woman is an American science fiction television drama that aired in 2007, which was created by David Eick, under NBC Universal Television Group, GEP Productions, and David Eick Productions. The series was a re-imagining of the original television series, The Bionic Woman, created by Kenneth Johnson, which in turn was based upon the novel Cyborg by Martin Caidin and its TV adaptation The Six Million Dollar Man, retaining its forebears' premise while taking on a more contemporary setting. David Eick also serves as executive producer alongside Laeta Kalogridis and Jason Smilovic. Production of the series was halted due to a strike by the Writers Guild of America causing only eight episodes to be aired. Following its failure to be included in the Fall 2008 schedule it was announced that the series was canceled as the result of low ratings. The series revolved around bartender Jaime Sommers, who is saved from death after receiving experimental medical implants. While adjusting to her new bionic powers and raising a rebellious younger sister, Jaime agrees to work for the Berkut Group, a quasi-governmental private organization that performed her surgery. Featured Crew David Eick Creator Kenneth Johnson Creator Martin Caidin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  20 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katee Sackhoff Sarah Corvus Molly Price Ruth Treadwell Miguel Ferrer Jonas Bledsoe Michelle Ryan Jaime Sommers Lucy Hale Becca Sommers Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Bionic Woman premiered on September 26, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  20 Posters  3 Recommendations   2005-12-10 Painkiller Jane 6.0    2005-09-16 Threshold 6.9    2005-09-19 Invasion 6.9    2006-06-28 Blade - The Series 5.4    2008-10-09 Life on Mars 6.4    2005-12-04 Sleeper Cell 7.4    1988-10-10 War of the Worlds 6.0    2012-08-30 Good Cop 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/Bionic_Woman/ Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords strong woman san francisco superhuman robot injury bionic Content Score 93 Almost there... Top Contributors 17 Banana J 16 Jenn NS 6 Norte Serra w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}