{"link": "https://www.themoviedb.org/tv/65466?language=en", "title": "Marseille", "resume": "The longtime mayor of Marseille is preparing to hand over the reins to his protégé when a sudden and ruthless battle erupts for control of the city.", "rate": 64, "genre": ["Drama"], "cast": ["Gérard Depardieu", "Benoît Magimel", "Géraldine Pailhas", "Stéphane Caillard", "Carolina Jurczak"], "character": ["Robert Taro", "Lucas Barres", "Rachel Taro", "Julia Taro", "Barbara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65466   Expand Marseille   (2016) User Score  Play Trailer Overview The longtime mayor of Marseille is preparing to hand over the reins to his protégé when a sudden and ruthless battle erupts for control of the city. Featured Crew Florent-Emilio Siri Creator Dan Franck Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gérard Depardieu Robert Taro Benoît Magimel Lucas Barres Géraldine Pailhas Rachel Taro Stéphane Caillard Julia Taro Carolina Jurczak Barbara Full Cast & Crew Current Season Season 2 2018 | 8 Episodes Season 2 of Marseille premiered on February 23, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Marseille. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2017-01-10 The Frozen Dead 6.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  French Runtime  55m Homepage   http://www.netflix.com/title/80037278 Genres Drama Keywords france politics marseille mayor mayor elections rivalry Content Score 100 Yes! Looking good! Top Contributors 36 Maretoh 11 Elizabeth Jennings 10 Banana z 8 zerox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}