{"link": "https://www.themoviedb.org/tv/38233?language=en", "title": "Grachi", "resume": "Grachi is a Nickelodeon Latin America fantasy television series written by Mariela Romero, Catharina Ledeboer and Mariana Palos that focuses on the life and love experiences of Graciela \"Grachi\" Alonso, a teenage witch. It premiered in Latin America on May 2, 2011. The series stars Isabella Castillo as Grachi, Andrés Mercado as Daniel and Kimberly Dos Ramos as Matilda; also featuring Mauricio Henao, Sol Rodríguez and Lance Dos Ramos in supporting roles.\nIn June 2011 it was confirmed that the series was renewed for a second season, which began airing on February 27, 2012. The second season features a rogue teen witch named Mía, portrayed by María Gabriela de Faría, and a new rival for Daniel, Leo, portrayed by Willy Martin. In June 2012 the series was renewed for a third and last season of 50 episodes, which aired from March 4, 2012 to May 10, 2013: the third season features two new wizards, Axel and Manú, while Lance Dos Ramos leave.\nThe series has been dubbed to English and is currently being aired through Nickelodeon Philippines since January 2012. Season 2 will air on May 6, 2013.Season 3 will aired 2014", "rate": 100, "genre": ["Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Isabella Castillo", "Andrés Mercado", "María Gabriela de Faría"], "character": ["Graciela 'Grachi' Alonso", "Daniel Esquivel", "Mia Novoa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38233   Expand Grachi   (2011) User Score Overview Grachi is a Nickelodeon Latin America fantasy television series written by Mariela Romero, Catharina Ledeboer and Mariana Palos that focuses on the life and love experiences of Graciela \"Grachi\" Alonso, a teenage witch. It premiered in Latin America on May 2, 2011. The series stars Isabella Castillo as Grachi, Andrés Mercado as Daniel and Kimberly Dos Ramos as Matilda; also featuring Mauricio Henao, Sol Rodríguez and Lance Dos Ramos in supporting roles. In June 2011 it was confirmed that the series was renewed for a second season, which began airing on February 27, 2012. The second season features a rogue teen witch named Mía, portrayed by María Gabriela de Faría, and a new rival for Daniel, Leo, portrayed by Willy Martin. In June 2012 the series was renewed for a third and last season of 50 episodes, which aired from March 4, 2012 to May 10, 2013: the third season features two new wizards, Axel and Manú, while Lance Dos Ramos leave. The series has been dubbed to English and is currently being aired through Nickelodeon Philippines since January 2012. Season 2 will air on May 6, 2013.Season 3 will aired 2014 Featured Crew Mariela Romero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Isabella Castillo Graciela 'Grachi' Alonso Andrés Mercado Daniel Esquivel María Gabriela de Faría Mia Novoa Full Cast & Crew Last Season Season 3 2013 | 50 Episodes Season 3 of Grachi premiered on March  4, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Grachi. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Grachi. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Drama Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 82 Amanda z 5 zurman1 4 Elizabeth Jennings p 2 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}