{"link": "https://www.themoviedb.org/tv/4858?language=en", "title": "Sea Patrol", "resume": "Sea Patrol is an Australian television drama that ran from 2007 to 2011, set on board HMAS Hammersley, a fictional patrol boat of the Royal Australian Navy. The series focuses on the ship and the lives of its crew members.\nDespite similarities in setting and content, this series is not a follow-on to the 1979 series, Patrol Boat. At the start of the second season, Sea Patrol saw an upgrade from the Fremantle class to a newer Armidale class boat.\nThe first season debuted on 5 July 2007 on the Nine Network, who invested $15 million into the programme. The second season of Sea Patrol, titled Sea Patrol II: The Coup, aired in 2008, while the third season, Sea Patrol: Red Gold, aired in 2009. The fourth season aired in 2010 in a new 16-episode format, with no main theme or continuous storyline running throughout, unlike the first three seasons.\nThe fifth season of Sea Patrol, \"Damage Control\", began airing in 2011 and consisted of 13 episodes. The Nine Network has confirmed that this was to be the final season, due to reliance on government rebates that expire after 65 episodes. Completion of series five brings the total episode count to 68 episodes.", "rate": 74, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ian Stenlake", "Lisa McCune", "John Batchelor", "Matthew Holmes", "Conrad Coleby"], "character": ["Mike 'CO' Flynn", "Kate 'XO' McGregor", "Andy 'Charge' Thorpe", "Chris 'Swain' Blake", "Petty Officer Dylan 'Dutchy' Mulholland"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4858   Expand Sea Patrol   (2007) User Score Overview Sea Patrol is an Australian television drama that ran from 2007 to 2011, set on board HMAS Hammersley, a fictional patrol boat of the Royal Australian Navy. The series focuses on the ship and the lives of its crew members. Despite similarities in setting and content, this series is not a follow-on to the 1979 series, Patrol Boat. At the start of the second season, Sea Patrol saw an upgrade from the Fremantle class to a newer Armidale class boat. The first season debuted on 5 July 2007 on the Nine Network, who invested $15 million into the programme. The second season of Sea Patrol, titled Sea Patrol II: The Coup, aired in 2008, while the third season, Sea Patrol: Red Gold, aired in 2009. The fourth season aired in 2010 in a new 16-episode format, with no main theme or continuous storyline running throughout, unlike the first three seasons. The fifth season of Sea Patrol, \"Damage Control\", began airing in 2011 and consisted of 13 episodes. The Nine Network has confirmed that this was to be the final season, due to reliance on government rebates that expire after 65 episodes. Completion of series five brings the total episode count to 68 episodes. Featured Crew Hal McElroy Creator Di McElroy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Stenlake Mike 'CO' Flynn Lisa McCune Kate 'XO' McGregor John Batchelor Andy 'Charge' Thorpe Matthew Holmes Chris 'Swain' Blake Conrad Coleby Petty Officer Dylan 'Dutchy' Mulholland Full Cast & Crew Last Season Season 5 2011 | 13 Episodes Season 5 of Sea Patrol premiered on April 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Sea Patrol. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m Homepage   http://seapatrol.ninemsn.com.au/ Genres Action & Adventure Drama Keywords sea australia navy ocean war ship fisherman forbidden love friends marine criminal death military maritime Content Score 93 Almost there... Top Contributors 82 seawolf 56 minusha97 31 Banana 16 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}