{"link": "https://www.themoviedb.org/tv/61221?language=en", "title": "Masters of Illusion", "resume": "Amazing magic performed by cutting-edge illusionists and escape artists in front of a live audience with performers in each episode display skills ranging from perplexing interactive mind magic to hilarious comedy routines.", "rate": 50, "genre": ["Reality"], "cast": ["Dean Cain"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61221   Expand Masters of Illusion   (2014) User Score  Play Trailer Overview Amazing magic performed by cutting-edge illusionists and escape artists in front of a live audience with performers in each episode display skills ranging from perplexing interactive mind magic to hilarious comedy routines. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dean Cain Himself - Host Full Cast & Crew Current Season Season 5 2018 | 3 Episodes Season 5 of Masters of Illusion premiered on June 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Masters of Illusion. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cwtv.com/shows/masters-of-illusion Genres Reality Keywords magic magic show Content Score 64 We're so close, yet so far. Top Contributors 32 Elizabeth Jennings TB 13 TMDb Bot 3 Banana RS 2 Ras Scrath Marley  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}