{"link": "https://www.themoviedb.org/tv/51046?language=en", "title": "Gang Related", "resume": "Every villain has a noble cause, and every hero has a dark side.\nDetective Ryan Lopez is a rising star in Los Angeles' elite Gang Task Force. What the world doesn't know is that long before Ryan became a cop, he pledged allegiance to a different band of brothers – a powerful Latino gang called Los Angelicos. \nWhen Ryan's best friend and police partner is senselessly killed by a notorious gang member, Ryan teams up with longtime Task Force member Cassius Green who has been at the forefront of the city's war on organized crime. In this war between law enforcement and gangs, the series explores how only people who really know the streets can win the battle on the streets.", "rate": 78, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Ramón Rodríguez", "Terry O'Quinn", "Sung Kang", "Inbar Lavi", "Reynaldo Gallegos"], "character": ["Ryan Lopez", "Sam Chapel", "Tae Kim", "Veronica 'Vee' Dotsen", "Carlos Acosta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51046   Expand Gang Related   (2014) User Score Overview Every villain has a noble cause, and every hero has a dark side. Detective Ryan Lopez is a rising star in Los Angeles' elite Gang Task Force. What the world doesn't know is that long before Ryan became a cop, he pledged allegiance to a different band of brothers – a powerful Latino gang called Los Angelicos.  When Ryan's best friend and police partner is senselessly killed by a notorious gang member, Ryan teams up with longtime Task Force member Cassius Green who has been at the forefront of the city's war on organized crime. In this war between law enforcement and gangs, the series explores how only people who really know the streets can win the battle on the streets. Featured Crew Chris Morgan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ramón Rodríguez Ryan Lopez Terry O'Quinn Sam Chapel Sung Kang Tae Kim Inbar Lavi Veronica 'Vee' Dotsen Reynaldo Gallegos Carlos Acosta Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Gang Related premiered on May 22, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2015-05-25 Texas Rising 6.4    2013-04-03 Rogue 7.1    2012-10-11 Copper 6.0    2012-03-30 Magic City 6.7    2014-10-08 Kingdom 6.2    2014-08-23 Intruders 6.5    2016-06-28 Dead of Summer 5.3    2014-07-27 Manhattan 7.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Crime Drama Keywords california undercover outlaw gang los angeles police detective task force police precinct Content Score 93 Almost there... Top Contributors 45 Elizabeth Jennings 20 Banana b 10 bmorr72 s 7 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}