{"link": "https://www.themoviedb.org/tv/54930?language=en", "title": "Dusk Maiden of Amnesia", "resume": "Dusk Maiden of Amnesia revolves around a first-year high school student, Teiichi Niiya who had just enrolled at Seikyou Private Academy. One day while wandering the hallowed halls, he gets lost in one of the school's old buildings and encounters Yuuko Kanoe, who reveals herself as a ghost with no memories. While investigating her death by looking through the school's seven mysteries, they discover the truth about these ghost stories and help those who are troubled…", "rate": 72, "genre": ["Animation", "Mystery"], "cast": ["Clint Bickham", "Emily Neves", "Brittney Karbowski", "Jessica Boone"], "character": ["Teiichi Niiya (English Dub)", "Yuuko Kanoe (English Dub)", "Momoe Okonogi (English Dub)", "Kirie Kanoe (English Dub)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54930   Expand Dusk Maiden of Amnesia   (2012) User Score Overview Dusk Maiden of Amnesia revolves around a first-year high school student, Teiichi Niiya who had just enrolled at Seikyou Private Academy. One day while wandering the hallowed halls, he gets lost in one of the school's old buildings and encounters Yuuko Kanoe, who reveals herself as a ghost with no memories. While investigating her death by looking through the school's seven mysteries, they discover the truth about these ghost stories and help those who are troubled… Featured Crew Maybe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clint Bickham Teiichi Niiya (English Dub) Emily Neves Yuuko Kanoe (English Dub) Brittney Karbowski Momoe Okonogi (English Dub) Jessica Boone Kirie Kanoe (English Dub) Full Cast & Crew Last Season Season 1 2012 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2008-10-04 A Certain Magical Index 7.4    2012-04-05 Sankarea: Undying Love 7.0    2011-04-14 Aria the Scarlet Ammo 6.4    2009-10-05 Heaven's Lost Property 5.3    2006-10-04 Negima!? Magister Negi Magi 5.9    2005-04-17 Eureka Seven 7.7    2017-07-03 Restaurant to Another World 8.8    2007-04-13 Stigma of the Wind 8.1  Facts Original Name  黄昏乙女xアムネジア Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.sentaifilmworks.com/shows/dusk-maiden-of-amnesia Genres Animation Mystery Keywords horror teenage romance anime school club Content Score 100 Yes! Looking good! Top Contributors 36 WillofOwn CM 15 Cherche Moi 14 sp1ti 10 Flexx7000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}