{"link": "https://www.themoviedb.org/tv/62641?language=en", "title": "Witnesses", "resume": "A young female detective is put in charge of a case and must delve into her partner's mysterious past in order to solve it.", "rate": 69, "genre": ["Mystery", "Crime"], "cast": ["Marie Dompnier", "Jan Hammenecker", "Judith Henry", "Audrey Fleurot", "Steve Driesen"], "character": ["Sandra Winckler", "Justin", "Maxine", "Catherine Keemer", "Oliver Keemer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62641   Expand Witnesses   (2014) User Score  Play Trailer Overview A young female detective is put in charge of a case and must delve into her partner's mysterious past in order to solve it. Featured Crew Marc Herpoux Creator Hervé Hadmar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marie Dompnier Sandra Winckler Jan Hammenecker Justin Judith Henry Maxine Audrey Fleurot Catherine Keemer Steve Driesen Oliver Keemer Full Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Witnesses premiered on March 15, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t Any info / review on season 2? Open 1 by  Suzy8track Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  4 Recommendations   2014-08-13 Utopia 8.2    2016-06-08 Power Monkeys 7.0    2011-07-27 The Code 6.7    2016-10-12 Rosehaven 6.5    2016-08-02 Borderline 7.1    2016-01-07 Deep 7.0    2012-05-11 Barbie: Life in the Dreamhouse 7.4    2015-04-15 The Delivery Man 6.5  Facts Original Name  Les témoins Status  Returning Series Networks Certification 16 Meaning Not recommended for children under 16. Not allowed air before 10:30 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  French Runtime  52m Homepage   http://lestemoins-laserie.com/ Genres Mystery Crime Keywords france police crime grave robbing Content Score 100 Yes! Looking good! Top Contributors 109 Marr 🇳🇱 23 Steve 19 Elizabeth Jennings 11 efeka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}