{"link": "https://www.themoviedb.org/tv/1637?language=en", "title": "Jenna's American Sex Star", "resume": "Jenna's American Sex Star is an adult pay-per-view reality television series hosted by Jenna Jameson on Playboy TV.\nIn each episode, four contestants compete in a series of sexual performances for the judges and viewers then vote for their favorite performer on Playboy.com. Winners win an exclusive contract with Jameson's movie studio ClubJenna.\nSeason 1 judges included Christy Canyon, Ron Jeremy, and Jim Powers. Season 2 judges included Jim Powers, Jenna Lewis, and Jay Grdina. The judges will eliminate two contestants and then viewers will vote for who should move on to the finals. Playboy TV's Andrea Lowell appears on season 2 as the Envelope presenter when girls are to be eliminated, or winners announced.\nSeason 1 winner, Brea Bennett announced in an August 2007 interview that she had left Club Jenna. Season 2 winner, Roxy Jezel, stopped working with Club Jenna after one year, and stated that she planned to retire in August 2009.", "rate": 54, "genre": [], "cast": ["Jenna Jameson", "Christy Canyon", "Rita Faltoyano", "Tiffany Taylor", "Kinzie Kenner"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1637   Expand Jenna's American Sex Star   (2005) User Score Overview Jenna's American Sex Star is an adult pay-per-view reality television series hosted by Jenna Jameson on Playboy TV. In each episode, four contestants compete in a series of sexual performances for the judges and viewers then vote for their favorite performer on Playboy.com. Winners win an exclusive contract with Jameson's movie studio ClubJenna. Season 1 judges included Christy Canyon, Ron Jeremy, and Jim Powers. Season 2 judges included Jim Powers, Jenna Lewis, and Jay Grdina. The judges will eliminate two contestants and then viewers will vote for who should move on to the finals. Playboy TV's Andrea Lowell appears on season 2 as the Envelope presenter when girls are to be eliminated, or winners announced. Season 1 winner, Brea Bennett announced in an August 2007 interview that she had left Club Jenna. Season 2 winner, Roxy Jezel, stopped working with Club Jenna after one year, and stated that she planned to retire in August 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jenna Jameson Christy Canyon Rita Faltoyano Tiffany Taylor Kinzie Kenner Full Cast & Crew Last Season Season 1 2005 | 5 Episodes Season 1 of Jenna's American Sex Star premiered on November  4, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jenna's American Sex Star. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.playboy.com/playboytv/original_series/americansexstar/ Genres No genres have been added. Keywords erotic movie Content Score 79 Pump it up! We're close now. Top Contributors C 7 Cataloguer P 6 PeteG 3 lineker v 1 veboli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}