{"link": "https://www.themoviedb.org/tv/61461?language=en", "title": "Yona of the Dawn", "resume": "The legend of the Four Dragons and the origin of the land has been passed down for generations in the land of Kouka. Currently, Hiryuu Palace has no one else next in line for the throne other than the fifteen year old princess, Yona, who had been raised with care.\nFinally, the night of her sixteenth birthday arrives. She expects it to be a wonderful day spent with her peace-loving father, Il, her servant and friend Hak, and her cousin Soo-won, who she had feelings for... However... That night, Yona goes to visit her father to tell him how she really feels, because he opposes to her getting married to Soo-won. However, when she gets to her room, she encounters a shocking truth. The destinies of Yona and the Four Dragons entwine in this period drama fantasy romance!", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61461   Expand Yona of the Dawn   (2014) User Score Overview The legend of the Four Dragons and the origin of the land has been passed down for generations in the land of Kouka. Currently, Hiryuu Palace has no one else next in line for the throne other than the fifteen year old princess, Yona, who had been raised with care. Finally, the night of her sixteenth birthday arrives. She expects it to be a wonderful day spent with her peace-loving father, Il, her servant and friend Hak, and her cousin Soo-won, who she had feelings for... However... That night, Yona goes to visit her father to tell him how she really feels, because he opposes to her getting married to Soo-won. However, when she gets to her room, she encounters a shocking truth. The destinies of Yona and the Four Dragons entwine in this period drama fantasy romance! Featured Crew Mizuho Kusanagi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 24 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2015-07-06 Snow White with the Red Hair 7.5    2014-10-05 Cross Ange: Rondo of Angels and Dragons 8.5    2009-04-02 Phantom: Requiem for the Phantom 6.4    2010-01-05 Ladies versus Butlers! 10.0    2016-07-09 91 Days 7.3    2017-01-06 Saga of Tanya the Evil 7.6    2015-01-04 Absolute Duo 7.6    2015-07-05 Charlotte 6.8  Facts Original Name  暁のヨナ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://marv.jp/special/yona/ Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords politics reincarnation revenge betrayal royalty dragon historical shoujo Content Score 64 We're so close, yet so far. Top Contributors 110 miryoku Y 30 Youngin CM 25 Cherche Moi 22 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}