{"link": "https://www.themoviedb.org/tv/40505?language=en", "title": "The Exes", "resume": "A sitcom about three divorced men sharing an apartment across the hall from their female divorce attorney, who is also their landlord.", "rate": 66, "genre": ["Comedy"], "cast": ["Donald Faison", "Wayne Knight", "David Alan Basche", "Kelly Stables", "Kristen Johnston"], "character": ["Phil Chase", "Haskell Lutz", "Stuart Gardner", "Eden", "Holly Franklin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40505   Expand The Exes   (2011) User Score  Play Trailer Overview A sitcom about three divorced men sharing an apartment across the hall from their female divorce attorney, who is also their landlord. Featured Crew Mark Reisman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  4 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Donald Faison Phil Chase Wayne Knight Haskell Lutz David Alan Basche Stuart Gardner Kelly Stables Eden Kristen Johnston Holly Franklin Full Cast & Crew Last Season Season 4 2014 | 22 Episodes Season 4 of The Exes premiered on November  5, 2014. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w Holly: Happy Birthday Kristen Johnston! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  5 Recommendations   2016-03-01 Loosely Exactly Nicole 5.8    2014-10-10 Cristela 6.1    2012-05-24 Men at Work 6.6    2013-11-14 Ground Floor 6.1    2010-06-16 Hot in Cleveland 6.8    2014-03-31 Friends with Better Lives 5.4    2013-05-20 The Goodwin Games 5.4    2014-09-30 Manhattan Love Story 6.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.tvland.com/shows/the-exes Genres Comedy Keywords roommate landlord divorcee apartment landlord tenant relationship sitcom Content Score 100 Yes! Looking good! Top Contributors 42 Elizabeth Jennings 9 Banana 7 bobbunn s 6 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}