{"link": "https://www.themoviedb.org/tv/12258?language=en", "title": "Cold Case Files", "resume": "Explore compelling cases that have gone cold for years, chronicling the journeys of the detectives who reopened them. The detectives relive the events of the crimes, reveal new twists and startling revelations, relying on breakthroughs in forensic technology and the influence of social media to help crack these cases.", "rate": 68, "genre": ["Mystery", "Documentary", "Crime"], "cast": ["Eric Sean Atwood", "Dave Kosloski", "Louis Bonfante"], "character": ["Lt. Jim Knox", "Det. Rick Graham", "Jeff Michaelson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12258   Expand Cold Case Files   (1999) User Score  Play Trailer Overview Explore compelling cases that have gone cold for years, chronicling the journeys of the detectives who reopened them. The detectives relive the events of the crimes, reveal new twists and startling revelations, relying on breakthroughs in forensic technology and the influence of social media to help crack these cases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Sean Atwood Lt. Jim Knox Dave Kosloski Det. Rick Graham Louis Bonfante Jeff Michaelson Full Cast & Crew Last Season Season 6 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2008-08-07 Wicked Attraction 5.5    2005-02-08 Deadly Women 6.7    2011-01-06 Nightmare Next Door 4.0    2010-08-25 Who The (Bleep) Did I Marry? 5.0    2013-04-11 The Killer Speaks 7.5    2010-09-26 Sister Wives 4.8  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.aetv.com/shows/cold-case-files-2017 Genres Mystery Documentary Crime Keywords unsolved mystery cold case unsolved crime police procedural Content Score 64 We're so close, yet so far. Top Contributors 36 MrRadical 7 Maretoh 4 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}