{"link": "https://www.themoviedb.org/tv/1834?language=en", "title": "Friday Night with Jonathan Ross", "resume": "Friday Night with Jonathan Ross was a British comedy chat show presented by Jonathan Ross. It was first broadcast on BBC One on 2 November 2001. The programme featured Ross's take on current topics of conversation, guest interviews and live music from both a guest music group and the house band. The show began its final series in January 2010, and ended on 16 July 2010.\nThe most frequent guests were Ricky Gervais and Jack Dee, Eddie Izzard, Jeremy Clarkson and Jimmy Carr. Johnny Vegas, David Attenborough, Stephen Fry and Simon Pegg all appeared in five episodes and Robbie Williams in four episodes.\nSince 2009 until its ending, the programme was broadcast in high-definition on BBC HD. Studio TC4 in the BBC Television Centre in London, where the show was made, was upgraded to HD, making it the third television studio in Television Centre to be upgraded to HD.\nThe show was pulled by the BBC on 29 October 2008 when Ross and Russell Brand were both suspended from their TV and radio shows, in the events after the Russell Brand Show prank telephone calls row. The show returned on 23 January 2009, attracting 5.1 million viewers. The final 275th episode was broadcast on 16 July 2010.", "rate": 59, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1834   Expand Friday Night with Jonathan Ross   (2001) User Score Overview Friday Night with Jonathan Ross was a British comedy chat show presented by Jonathan Ross. It was first broadcast on BBC One on 2 November 2001. The programme featured Ross's take on current topics of conversation, guest interviews and live music from both a guest music group and the house band. The show began its final series in January 2010, and ended on 16 July 2010. The most frequent guests were Ricky Gervais and Jack Dee, Eddie Izzard, Jeremy Clarkson and Jimmy Carr. Johnny Vegas, David Attenborough, Stephen Fry and Simon Pegg all appeared in five episodes and Robbie Williams in four episodes. Since 2009 until its ending, the programme was broadcast in high-definition on BBC HD. Studio TC4 in the BBC Television Centre in London, where the show was made, was upgraded to HD, making it the third television studio in Television Centre to be upgraded to HD. The show was pulled by the BBC on 29 October 2008 when Ross and Russell Brand were both suspended from their TV and radio shows, in the events after the Russell Brand Show prank telephone calls row. The show returned on 23 January 2009, attracting 5.1 million viewers. The final 275th episode was broadcast on 16 July 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 18 2010 | 25 Episodes Season 18 of Friday Night with Jonathan Ross premiered on January 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1986-10-06 The Trap Door 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 65m Homepage   http://www.bbc.co.uk/programmes/b006m99d Genres Comedy Keywords talk show celebrity british humour Content Score 56 We're so close, yet so far. Top Contributors O 5 Ozbourne D 2 Daniel 2 t0by 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}