{"link": "https://www.themoviedb.org/tv/597?language=en", "title": "Cold Squad", "resume": "Cold Squad is a Canadian police procedural television series first broadcast in 1998 that followed the investigations of a part of the Vancouver Police Department Homicide Division tasked with solving cold cases, the titular Cold Squad, as led by Sergeant Ali McCormick.\nThe cast of Cold Squad was diverse and changing, McCormick being the only character to appear in all 7 seasons. Some notable series regulars include Detective Tony Logozzo in seasons 1-2, Sgt. Frank Coscarella in seasons 3-4, Sgt. Len Harper in seasons 5-7, Insp. Vince Schneider season 1, Insp. Simon Ross season 2, Insp. Andrew Pawlachuk seasons 3-7, Det. Mickey Kollander seasons 3-6, Det. Nicco Sevallis seasons 3-6, Christine Wren seasons 4-7, as well as Det. Samantha Walters and Const. Ray Chase in season 7.\nBetween the second and third seasons, almost the entire on-screen cast other than Julie Stewart were replaced. This along with the new sets, a significant revamp of the credits and theme music, and even having McCormick's hair change from auburn to dirty-blonde all contributed to a considerable reworking of the series.", "rate": 50, "genre": ["Drama"], "cast": ["Garry Chalk", "Joy Tanner", "Julie Stewart", "Matthew Bennett", "Tahmoh Penikett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 597   Expand Cold Squad   (1998) User Score Overview Cold Squad is a Canadian police procedural television series first broadcast in 1998 that followed the investigations of a part of the Vancouver Police Department Homicide Division tasked with solving cold cases, the titular Cold Squad, as led by Sergeant Ali McCormick. The cast of Cold Squad was diverse and changing, McCormick being the only character to appear in all 7 seasons. Some notable series regulars include Detective Tony Logozzo in seasons 1-2, Sgt. Frank Coscarella in seasons 3-4, Sgt. Len Harper in seasons 5-7, Insp. Vince Schneider season 1, Insp. Simon Ross season 2, Insp. Andrew Pawlachuk seasons 3-7, Det. Mickey Kollander seasons 3-6, Det. Nicco Sevallis seasons 3-6, Christine Wren seasons 4-7, as well as Det. Samantha Walters and Const. Ray Chase in season 7. Between the second and third seasons, almost the entire on-screen cast other than Julie Stewart were replaced. This along with the new sets, a significant revamp of the credits and theme music, and even having McCormick's hair change from auburn to dirty-blonde all contributed to a considerable reworking of the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Garry Chalk Joy Tanner Julie Stewart Matthew Bennett Tahmoh Penikett Full Cast & Crew Last Season Season 7 2004 | 13 Episodes Season 7 of Cold Squad premiered on September  4, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Just found this on Hulu. Open 1 by  drewsylla Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cold Squad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.ctv.ca/servlet/ArticleNews/show/CTVShows/20040824/ColdSquad-default/20060901/ Genres Drama Keywords canada police detective vancouver murder investigation cold case Content Score 86 Almost there... Top Contributors 8 Banana 4 colonelgrant s 2 speedycars 1 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}