{"link": "https://www.themoviedb.org/tv/4715?language=en", "title": "Meadowlands", "resume": "Cape Wrath is a British drama television series produced by Ecosse Films which focuses on a family trying to escape its past while confronting an even more uncertain future. The series opens with Danny and Evelyn Brogan along with their two teenage children Zoe and Mark entering a witness protection programme, moving to a bucolic neighbourhood, Meadowlands, to begin a new life. Picturesque and crime-free, Meadowlands appears to be a suburban paradise where the Brogan family can start a new life. However they soon realise that it is not so easy to escape the past and their safe haven becomes a world of paranoia and psychological intrigue with surprises around every corner.\nThe series is produced by Ecosse Films for Channel 4 in the UK and Showtime in the US, and premièred in the United States on 17 June 2007 at 22:00 EST, on Showtime. The United Kingdom première was on 10 July 2007 at 22:00 BST on Channel 4.\nMeadowlands itself is actually two locations: the titles, overhead \"establishing shots\" and the main characters homes were filmed at The Lakes, a new housing development next to Leybourne Lakes Country Park near New Hythe in Kent, south east England. Samantha Campbell's \"headquarters\" as well as the doctor's surgery were filmed in a warehouse close to Maidstone Studios., The post production was carried out in London at St Anne's post production house.", "rate": 49, "genre": ["Drama"], "cast": ["David Morrissey", "Tom Hardy", "Lucy Cohu", "Ralph Brown", "Don Gilet"], "character": ["Jack Donnelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4715   Expand Meadowlands   (2007) User Score  Play Trailer Overview Cape Wrath is a British drama television series produced by Ecosse Films which focuses on a family trying to escape its past while confronting an even more uncertain future. The series opens with Danny and Evelyn Brogan along with their two teenage children Zoe and Mark entering a witness protection programme, moving to a bucolic neighbourhood, Meadowlands, to begin a new life. Picturesque and crime-free, Meadowlands appears to be a suburban paradise where the Brogan family can start a new life. However they soon realise that it is not so easy to escape the past and their safe haven becomes a world of paranoia and psychological intrigue with surprises around every corner. The series is produced by Ecosse Films for Channel 4 in the UK and Showtime in the US, and premièred in the United States on 17 June 2007 at 22:00 EST, on Showtime. The United Kingdom première was on 10 July 2007 at 22:00 BST on Channel 4. Meadowlands itself is actually two locations: the titles, overhead \"establishing shots\" and the main characters homes were filmed at The Lakes, a new housing development next to Leybourne Lakes Country Park near New Hythe in Kent, south east England. Samantha Campbell's \"headquarters\" as well as the doctor's surgery were filmed in a warehouse close to Maidstone Studios., The post production was carried out in London at St Anne's post production house. Featured Crew Robert Murphy Creator Matthew Arlidge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Morrissey Tom Hardy Jack Donnelly Lucy Cohu Ralph Brown Don Gilet Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Meadowlands premiered on June 17, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Meadowlands. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/capewrath Genres Drama Keywords secret witness protection murder Content Score 100 Yes! Looking good! Top Contributors 14 Banana w 3 webmaster s 3 speedycars c 2 clipper314  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}