{"link": "https://www.themoviedb.org/tv/60655?language=en", "title": "Derek", "resume": "Derek is a loyal nursing home caretaker who sees only the good in his quirky co-workers as they struggle against prejudice and shrinking budgets to care for their elderly residents.", "rate": 71, "genre": ["Comedy", "Drama"], "cast": ["Ricky Gervais", "Kerry Godliman", "David Earl", "Karl Pilkington"], "character": ["Derek", "Hannah", "Kev", "Dougie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60655   Expand Derek   (2012) User Score  Play Trailer Overview Derek is a loyal nursing home caretaker who sees only the good in his quirky co-workers as they struggle against prejudice and shrinking budgets to care for their elderly residents. Featured Crew Ricky Gervais Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricky Gervais Derek Kerry Godliman Hannah David Earl Kev Karl Pilkington Dougie Full Cast & Crew Last Season Season 2 2014 | 6 Episodes Season 2 of Derek premiered on April 23, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Derek. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2011-11-10 Life's Too Short 7.1    2005-07-21 Extras 7.8    2010-09-23 An Idiot Abroad 7.8    2004-09-03 Green Wing 8.0    2001-07-09 The Office 8.1    2013-10-20 The Moaning of Life 8.2    2008-01-04 Between Two Ferns with Zach Galifianakis 8.1    2008-05-01 The Inbetweeners 7.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  24m Homepage   http://www.channel4.com/programmes/derek Genres Comedy Drama Keywords mockumentary nursing home elderly british humour workplace comedy Content Score 100 Yes! Looking good! Top Contributors m 17 moviedbmailinator z 8 zurman1 7 Banana 6 nineswiss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}