{"link": "https://www.themoviedb.org/tv/2641?language=en", "title": "Rolie Polie Olie", "resume": "Rolie Polie Olie was a children's television series produced by Nelvana, distributed by Disney, and created by William Joyce, Maggie Swanson, and Anne Wood. The show centers on a little roly pollie who is composed of several spheres and other three-dimensional geometric shapes. The show was one of the earliest series that was fully animated in CGI, and the first CGI animated preschool series.Rolie Polie Olie now airs in reruns on Disney Junior.\nRolie Polie Olie won a Gemini Award in Canada for \"Best Animated Program\" in 1999. The show also won a Daytime Emmy Award for \"Outstanding Special Class Animated Program\" in 2000 and 2005. William Joyce won a 1999 Daytime Emmy for Best Production Design for this series. The show has a vintage atmosphere reminiscent of the 1950s and early 1960s, with futuristic elements.", "rate": 55, "genre": ["Animation"], "cast": ["Michael Cera", "Michael Angelis"], "character": ["Young Gizmo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2641   Expand Rolie Polie Olie   (1998) User Score Overview Rolie Polie Olie was a children's television series produced by Nelvana, distributed by Disney, and created by William Joyce, Maggie Swanson, and Anne Wood. The show centers on a little roly pollie who is composed of several spheres and other three-dimensional geometric shapes. The show was one of the earliest series that was fully animated in CGI, and the first CGI animated preschool series.Rolie Polie Olie now airs in reruns on Disney Junior. Rolie Polie Olie won a Gemini Award in Canada for \"Best Animated Program\" in 1999. The show also won a Daytime Emmy Award for \"Outstanding Special Class Animated Program\" in 2000 and 2005. William Joyce won a 1999 Daytime Emmy for Best Production Design for this series. The show has a vintage atmosphere reminiscent of the 1950s and early 1960s, with futuristic elements. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Cera Young Gizmo Michael Angelis Full Cast & Crew Last Season Season 1 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rolie Polie Olie. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors M 4 Marud 3 Alexandre Oliveira s 3 speedycars m 2 mcenut  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}