{"link": "https://www.themoviedb.org/tv/63322?language=en", "title": "Symphogear", "resume": "During a concert by idol group ZweiWing, an alien force known as the Noise attack the stage. Group members Tsubasa Kazanari and Kanade Amou suppress the attack using their Symphogear armor, but despite their best efforts, innocent bystander Hibiki Tachibana is fatally injured. Distraught and much to Tsubasa's dismay, Kanade sacrifices herself in the process to save Hibiki.\nTwo years later, Hibiki lives on. Tsubasa now fights alone. With the threat of the Noise increasing, Hibiki finds herself encountering the Noise once again but this time she is granted a chance to become attuned with the same Symphogear that Kanade wielded.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Aoi Yuki"], "character": ["Hibiki Tachibana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63322   Expand Symphogear   (2015) User Score Overview During a concert by idol group ZweiWing, an alien force known as the Noise attack the stage. Group members Tsubasa Kazanari and Kanade Amou suppress the attack using their Symphogear armor, but despite their best efforts, innocent bystander Hibiki Tachibana is fatally injured. Distraught and much to Tsubasa's dismay, Kanade sacrifices herself in the process to save Hibiki. Two years later, Hibiki lives on. Tsubasa now fights alone. With the threat of the Noise increasing, Hibiki finds herself encountering the Noise once again but this time she is granted a chance to become attuned with the same Symphogear that Kanade wielded. Featured Crew Akifumi Kaneko Creator Noriyasu Agematsu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aoi Yuki Hibiki Tachibana Full Cast & Crew Last Season Symphogear AXZ 2017 | 13 Episodes Season 4 of Symphogear premiered on July  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Symphogear. You can help by rating TV shows you've seen. Facts Original Name  戦姫絶唱シンフォギア Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.symphogear.com/ Genres Animation Sci-Fi & Fantasy Keywords music anime Content Score 64 We're so close, yet so far. Top Contributors 31 miryoku 16 Optic m 16 maruino d 12 draca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}