{"link": "https://www.themoviedb.org/tv/993?language=en", "title": "The Joe Schmo Show", "resume": "The Joe Schmo Show is a reality television hoax show created by Paul Wernick and Rhett Reese. The series is broadcast in the U.S. on the cable network Spike. The show's premise is that a target person or persons are led to believe that they are contestants on a reality television show; in reality, all of the other participants in the purported show – including the host – are actors, and their actions and the outcome of the purported show are all scripted in an attempt to elicit comedic reactions from the targets. The show's first season, The Joe Schmo Show, aired in 2003, and its second season, Joe Schmo 2, aired in 2004. The first season's hoax was conducted as a typical reality competition show while the second hoax was a Bachelor-like dating series.\nOn December 10, 2012, Spike announced it was bringing The Joe Schmo Show back for a third season, which premiered on January 8, 2013.\nThe only constant presence in all three Joe Schmo seasons has been voice actor Ralph Garman, who has served as the \"emcee\" for all three editions.", "rate": 80, "genre": ["Comedy"], "cast": ["Natasha Leggero", "Tim Herzog", "Brian Keith Etheridge", "Jon Huertas", "Jana Speaker"], "character": ["Rita 'The Drunk'"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 993   Expand The Joe Schmo Show   (2003) User Score Overview The Joe Schmo Show is a reality television hoax show created by Paul Wernick and Rhett Reese. The series is broadcast in the U.S. on the cable network Spike. The show's premise is that a target person or persons are led to believe that they are contestants on a reality television show; in reality, all of the other participants in the purported show – including the host – are actors, and their actions and the outcome of the purported show are all scripted in an attempt to elicit comedic reactions from the targets. The show's first season, The Joe Schmo Show, aired in 2003, and its second season, Joe Schmo 2, aired in 2004. The first season's hoax was conducted as a typical reality competition show while the second hoax was a Bachelor-like dating series. On December 10, 2012, Spike announced it was bringing The Joe Schmo Show back for a third season, which premiered on January 8, 2013. The only constant presence in all three Joe Schmo seasons has been voice actor Ralph Garman, who has served as the \"emcee\" for all three editions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natasha Leggero Rita 'The Drunk' Tim Herzog Brian Keith Etheridge Jon Huertas Jana Speaker Full Cast & Crew Last Season Season 3 2013 | 10 Episodes Season 3 of The Joe Schmo Show premiered on January  8, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Ideas for season 4.... Open 2 by  Phasmophobia Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2011-01-09 The Cape 4.3    2006-09-20 Jericho 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords hoax Content Score 86 Almost there... Top Contributors 10 Banana R 2 Rebecca 1 phuongvu95  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}