{"link": "https://www.themoviedb.org/tv/37636?language=en", "title": "Secret Garden", "resume": "A wealthy man and a poor stunt girl fall in love. But things get complicated when their souls become inexplicably swapped and dark secrets surface.", "rate": 82, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Hyun Bin", "Ha Ji-won", "Kim Sa-rang", "Yoon Sang-hyun", "Yoo In-na"], "character": ["Kim Joo-won", "Gil Ra-im", "Yoon Seul", "Choi Woo-young / Oska", "Im Ah-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37636   Expand Secret Garden   (2010) User Score Overview A wealthy man and a poor stunt girl fall in love. But things get complicated when their souls become inexplicably swapped and dark secrets surface. Featured Crew Kim Eun-sook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hyun Bin Kim Joo-won Ha Ji-won Gil Ra-im Kim Sa-rang Yoon Seul Yoon Sang-hyun Choi Woo-young / Oska Yoo In-na Im Ah-young Full Cast & Crew Last Season Season 1 2010 | 20 Episodes Season 1 of Secret Garden premiered on November 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  7 Recommendations   2013-06-05 I Hear Your Voice 8.2    2012-03-21 Rooftop Prince 8.1    2012-12-03 School 2013 8.5    2014-03-05 Three Days 7.0    2012-08-15 Arang and the Magistrate 8.0    2010-03-31 Personal Taste 7.4    2013-08-05 Good Doctor 8.6    2015-12-09 Remember 7.9  Facts Original Name  시크릿 가든 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.tv.sbs.co.kr/secretgarden Genres Comedy Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors M 26 Maria180493 N 26 Nightowl.Kr 19 Elizabeth Jennings CM 12 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}