{"link": "https://www.themoviedb.org/tv/72635?language=en", "title": "Knight's & Magic", "resume": "A mecha otaku is reincarnated into another world as Ernesti Echevarria, also known as Eru. In this world, huge humanoid weapons known as Silhouette Knights exist. Dreaming of piloting those robots, Eru and his friends, Archid Olter and Adeltrud Olter, aim to become Knight Runners.", "rate": 85, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Sugawara Shinsuke", "Ayaka Ohashi", "Rie Takahashi"], "character": ["Archid Walter", "Adeltrud Walter", "Ernesti Echevalier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72635   Expand Knight's & Magic   (2017) User Score Overview A mecha otaku is reincarnated into another world as Ernesti Echevarria, also known as Eru. In this world, huge humanoid weapons known as Silhouette Knights exist. Dreaming of piloting those robots, Eru and his friends, Archid Olter and Adeltrud Olter, aim to become Knight Runners. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sugawara Shinsuke Archid Walter Ayaka Ohashi Adeltrud Walter Rie Takahashi Ernesti Echevalier Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Knight's & Magic premiered on July  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2017-07-03 Restaurant to Another World 8.8    2017-07-11 In Another World With My Smartphone 9.2    2008-01-03 Rosario + Vampire 9.1    2017-01-12 Miss Kobayashi's Dragon Maid 7.7    2017-07-04 Tsuredure Children 8.0    2016-07-08 Handa-kun 6.7    2017-01-05 Masamune-kun's Revenge 7.0    2017-01-06 Fuuka 7.3  Facts Original Name  ナイツ＆マジック Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://knights-magic.com/ Genres Animation Action & Adventure Comedy Keywords fantasy harem romance mecha Content Score 56 We're so close, yet so far. Top Contributors i 17 iknvya D 11 Destr0y 7 Elizabeth Jennings 7 YabukiJoe1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}