{"link": "https://www.themoviedb.org/tv/19845?language=en", "title": "Pororo the Little Penguin", "resume": "Pororo the Little Penguin is a computer-generated animated cartoon series created by Iconix Entertainment, SK Broadband, Ocon and EBS with the North Korean company Samchŏlli in Kaesŏng. Production began in 2002 and the program began airing in South Korea on EBS in 2003.\nInternationally, the program currently airs on Australian, French, Taiwanese, Indian, Italian, Puerto Rican, Singaporean and Vietnamese channels. It also started airing in Norway, on Boomerang, and Cartoonito in the UK. It will air on Disney Channel Asia and CITV in 2013.\nIn South Korea, Pororo has become famous among preschool kids and children and has earned the nickname \"Pororo the President\" while to some teenagers, \"Pororo the God\".\nThe series revolves around the adventures of Pororo and his friends who live in the snowy village of Porong Porong Forest, who often encounter challenges and learn practical and moral lessons in each episode.", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19845   Expand Pororo the Little Penguin   (2003) User Score Overview Pororo the Little Penguin is a computer-generated animated cartoon series created by Iconix Entertainment, SK Broadband, Ocon and EBS with the North Korean company Samchŏlli in Kaesŏng. Production began in 2002 and the program began airing in South Korea on EBS in 2003. Internationally, the program currently airs on Australian, French, Taiwanese, Indian, Italian, Puerto Rican, Singaporean and Vietnamese channels. It also started airing in Norway, on Boomerang, and Cartoonito in the UK. It will air on Disney Channel Asia and CITV in 2013. In South Korea, Pororo has become famous among preschool kids and children and has earned the nickname \"Pororo the President\" while to some teenagers, \"Pororo the God\". The series revolves around the adventures of Pororo and his friends who live in the snowy village of Porong Porong Forest, who often encounter challenges and learn practical and moral lessons in each episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Pororo season 3 — | 50 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pororo the Little Penguin. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 0+ Meaning Can be watched by Any Age. Type  Scripted Original Language  English Runtime  7m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 8 Евгений p 3 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}