{"link": "https://www.themoviedb.org/tv/11041?language=en", "title": "Pecola", "resume": "Pecola is a 3D Japanese anime series from Canada which stars cube-shaped anthropomorphic animals in a place called Cube Town. It is based on a series of children's picture books by Naomi Iwata. The series aired on Cartoon Network in 2003 for 26 episodes. It was produced by Nelvana and Milky Cartoon. This show uses the same graphics as Gregory Horror Show, which was also created by Iwata.\nThe series has also been shown on TV Tokyo, Teletoon in Canada, YoYo TV in Taiwan, Nick Jr. in Australia, TF1 in France and Qubo in the US.\nThe show stars Pecola, a curious and hyperactive penguin who tries to help the people of Cube Town but often wreaks havoc instead. Pecola is an orphaned penguin who lives with Pecolias, his grandfather. Cube Town is a small, isolated coastal village which contains an art museum, a beach, a lighthouse and a canal. It is located adjacent to Crescent Bay surrounded by the Rookery Mountains coastal range and serviced by regular ships which deliver mail, food and other supplies, as well as occasional tourists from a nearby metropolis named Cubic City. The heights above it lead into Glacier Valley which is snowbound even during summer.", "rate": 0, "genre": ["Animation"], "cast": ["Chika Sakamoto", "Dai Matsumoto", "Kappei Yamaguchi", "Ken'yuu Horiuchi", "Kōichi Kitamura"], "character": ["Tsunekichi", "Mr. Banard", "Bashatt", "Gazelle-san", "Officer Kumada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11041   Expand Pecola   (2003) User Score Overview Pecola is a 3D Japanese anime series from Canada which stars cube-shaped anthropomorphic animals in a place called Cube Town. It is based on a series of children's picture books by Naomi Iwata. The series aired on Cartoon Network in 2003 for 26 episodes. It was produced by Nelvana and Milky Cartoon. This show uses the same graphics as Gregory Horror Show, which was also created by Iwata. The series has also been shown on TV Tokyo, Teletoon in Canada, YoYo TV in Taiwan, Nick Jr. in Australia, TF1 in France and Qubo in the US. The show stars Pecola, a curious and hyperactive penguin who tries to help the people of Cube Town but often wreaks havoc instead. Pecola is an orphaned penguin who lives with Pecolias, his grandfather. Cube Town is a small, isolated coastal village which contains an art museum, a beach, a lighthouse and a canal. It is located adjacent to Crescent Bay surrounded by the Rookery Mountains coastal range and serviced by regular ships which deliver mail, food and other supplies, as well as occasional tourists from a nearby metropolis named Cubic City. The heights above it lead into Glacier Valley which is snowbound even during summer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chika Sakamoto Tsunekichi Dai Matsumoto Mr. Banard Kappei Yamaguchi Bashatt Ken'yuu Horiuchi Gazelle-san Kōichi Kitamura Officer Kumada Full Cast & Crew Last Season Season 1 2003 | 26 Episodes Season 1 of Pecola premiered on April 21, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pecola. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.milkycartoon.co.jp/official/pecola/tp.html Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 2 gustavohdh 2 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}