{"link": "https://www.themoviedb.org/tv/11258?language=en", "title": "McHale's Navy", "resume": "McHale's Navy is an American sitcom that aired 138 half-hour episodes over four seasons, from October 11, 1962, to April 12, 1966, on the ABC network. The series was filmed in black and white and originated from an hour drama called Seven Against the Sea, broadcast on April 3, 1962. Universal commissioned the colorization of the series in the 1980s for syndication in hope of reviving its popularity.", "rate": 73, "genre": ["Comedy"], "cast": ["Ernest Borgnine", "Joe Flynn", "Tim Conway", "Carl Ballantine", "Gary Vinson"], "character": ["Quinton McHale", "Captain Wallace B. Binghamton", "Ensign Charles Parker", "Lester Gruber", "George Christopher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11258   Expand McHale's Navy   (1962) User Score Overview McHale's Navy is an American sitcom that aired 138 half-hour episodes over four seasons, from October 11, 1962, to April 12, 1966, on the ABC network. The series was filmed in black and white and originated from an hour drama called Seven Against the Sea, broadcast on April 3, 1962. Universal commissioned the colorization of the series in the 1980s for syndication in hope of reviving its popularity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  4 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ernest Borgnine Quinton McHale Joe Flynn Captain Wallace B. Binghamton Tim Conway Ensign Charles Parker Carl Ballantine Lester Gruber Gary Vinson George Christopher Full Cast & Crew Last Season Season 4 1965 | 30 Episodes Season 4 of McHale's Navy premiered on September 14, 1965. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply hilarious Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1965-09-01 Gidget 5.2    1968-09-28 The Ghost & Mrs. Muir 6.7    1960-09-29 My Three Sons 6.0    1965-09-14 F Troop 6.4    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1958-09-24 The Donna Reed Show 6.7    1957-09-18 Wagon Train 6.3    1969-09-17 The Courtship of Eddie's Father 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords rogue navy pt boats Content Score 86 Almost there... Top Contributors 14 Steve PE 4 Patrick E. Abe 3 Farkas Tibor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}