{"link": "https://www.themoviedb.org/tv/4382?language=en", "title": "Eight Is Enough", "resume": "Eight Is Enough is an American television comedy-drama series that ran on ABC from March 15, 1977, until August 29, 1981. The show was modeled after syndicated newspaper columnist Thomas Braden, a real-life parent with eight children, who wrote a book with the same name.", "rate": 59, "genre": ["Drama", "Comedy"], "cast": ["Dick Van Patten", "Adam Rich", "Dianne Kay", "Grant Goodeve", "Willie Aames"], "character": ["Tommy Bradford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4382   Expand Eight Is Enough   (1977) User Score Overview Eight Is Enough is an American television comedy-drama series that ran on ABC from March 15, 1977, until August 29, 1981. The show was modeled after syndicated newspaper columnist Thomas Braden, a real-life parent with eight children, who wrote a book with the same name. Featured Crew Lee Mendelson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Dick Van Patten Adam Rich Dianne Kay Grant Goodeve Willie Aames Tommy Bradford Full Cast & Crew Last Season Season 5 1980 | 22 Episodes Season 5 of Eight Is Enough premiered on October 29, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Susan Richardson lives in camper Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1984-09-25 Three's a Crowd 6.7    1979-09-13 Benson 7.2    1983-01-22 Mama's Family 7.2    1983-10-03 Scarecrow and Mrs. King 5.5    1982-09-11 Faerie Tale Theatre 8.1    1974-09-07 Land of the Lost 6.9    1984-10-03 Charles in Charge 5.1    1984-03-19 Kate & Allie 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 3 seawolf 2 Daemon m 1 mode2 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}