{"link": "https://www.themoviedb.org/tv/34151?language=en", "title": "Enchantment", "resume": "Incantesimo is a long-running drama series on Italian television, broadcast on the RAI network.\nIt is set in a hospital called Clinica Life in Turin, Italy, and revolves around the life of the doctors and nurses in the hospital. According to the official website, it is \"interested in social themes, the incoherence of daily life, solidarity, love and passion, not forgetting moments of comedy\".\nIncantesimo was first broadcast in March 1997, is now in its 10th series and has broadcast 400 episodes.\nIncantesimo is also being broadcast on the Chinese CCTV 8 network, dubbed into Mandarin. Many notable Italian actors and actresses have starred in the series including, Orso Maria Guerrini, Delia Boccardo, Kaspar Capparoni, Paolo Malco, Guido Furlani, Alessio Boni, Vanessa Gravina, Paola Pitagora, Alessandra Acciai and Barbara Livi.\nThe series was especially popular in Bulgaria, where it was aired on BNT 1 and Nova Television.\nIn Armenia it was aired on ArmeniaTV and TV5 in Russian, as well as on Shant TV in Armenian.", "rate": 100, "genre": ["Drama"], "cast": ["Alessio Di Clemente", "Massimo Bulla", "Sonia Aquino", "Delia Boccardo", "Marco Quaglia"], "character": ["Alberto Curti", "Davide Curti", "Rossella Natoli", "Tilly Nardi", "Massimo Nardi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34151   Expand Enchantment   (1998) User Score Overview Incantesimo is a long-running drama series on Italian television, broadcast on the RAI network. It is set in a hospital called Clinica Life in Turin, Italy, and revolves around the life of the doctors and nurses in the hospital. According to the official website, it is \"interested in social themes, the incoherence of daily life, solidarity, love and passion, not forgetting moments of comedy\". Incantesimo was first broadcast in March 1997, is now in its 10th series and has broadcast 400 episodes. Incantesimo is also being broadcast on the Chinese CCTV 8 network, dubbed into Mandarin. Many notable Italian actors and actresses have starred in the series including, Orso Maria Guerrini, Delia Boccardo, Kaspar Capparoni, Paolo Malco, Guido Furlani, Alessio Boni, Vanessa Gravina, Paola Pitagora, Alessandra Acciai and Barbara Livi. The series was especially popular in Bulgaria, where it was aired on BNT 1 and Nova Television. In Armenia it was aired on ArmeniaTV and TV5 in Russian, as well as on Shant TV in Armenian. Featured Crew Maria Venturi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alessio Di Clemente Alberto Curti Massimo Bulla Davide Curti Sonia Aquino Rossella Natoli Delia Boccardo Tilly Nardi Marco Quaglia Massimo Nardi Full Cast & Crew Last Season Season 9 2007 | 222 Episodes Season 9 of Enchantment premiered on January  8, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Enchantment. You can help by rating TV shows you've seen. Facts Original Name  Incantesimo Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 60m Homepage   http://www.incantesimo.rai.it/raifiction2006fiction/0,,3303,00.html Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 231 shiff7 2 lineker D 2 Daniel c 1 castacasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}