{"link": "https://www.themoviedb.org/tv/27660?language=en", "title": "Legend of the Galactic Heroes", "resume": "For decades, the Galactic Empire has been locked in an interstellar war with the Free Planets Alliance, a conflict that involves thousands of spaceships and millions of soldiers on both sides. Two new commanders enter the conflict with great hopes: Imperial Admiral Reinhard von Lohengramm and the FPA's Yang Wen-Li. As they deal with superiors and subordinates, maneuver through complicated political arrangements, plot strategies, and win battles, each will be tested, and ultimately, changed, by the reality of war.", "rate": 97, "genre": ["Sci-Fi", "Fantasy", "Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27660   Expand Legend of the Galactic Heroes   (1988) User Score Overview For decades, the Galactic Empire has been locked in an interstellar war with the Free Planets Alliance, a conflict that involves thousands of spaceships and millions of soldiers on both sides. Two new commanders enter the conflict with great hopes: Imperial Admiral Reinhard von Lohengramm and the FPA's Yang Wen-Li. As they deal with superiors and subordinates, maneuver through complicated political arrangements, plot strategies, and win battles, each will be tested, and ultimately, changed, by the reality of war. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 1996 | 24 Episodes Season 4 of Legend of the Galactic Heroes premiered on October  1, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  8 Recommendations   2015-01-10 Death Parade 7.3    2004-04-06 Monster 7.7    2011-04-06 Steins;Gate 8.2    2011-10-02 Hunter x Hunter 8.5    1995-10-04 Neon Genesis Evangelion 8.0    1998-11-18 The Powerpuff Girls 7.0    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1    2005-02-21 Avatar: The Last Airbender 8.2  Facts Original Name  銀河英雄伝説 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.ginei.jp/ Genres Sci-Fi & Fantasy Animation Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 50 Elizabeth Jennings 18 deanzel 6 george674834080 3 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}