{"link": "https://www.themoviedb.org/tv/77698?language=en", "title": "Comic Girls", "resume": "Kaoruko Moeta is a 15-year-old high school student and 4-panel manga artist. After moving to a dorm especially for female manga artists, she meets shoujo manga artist Koyume, teen romance manga artist Ruki, and shounen manga artist Tsubasa. Every day, they'll work all through the night trying to ink and finish their work!", "rate": 30, "genre": ["Animation", "Comedy"], "cast": ["Akao Hikaru", "Saori Oonishi", "Rie Takahashi", "Kaede Hondo"], "character": ["Kaoruko Moeta (voice)", "Ruki Irokawa (voice)", "Tsubasa Katsuki (voice)", "Koyume Koizuka (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77698   Expand Comic Girls   (2018) User Score  Play Trailer Overview Kaoruko Moeta is a 15-year-old high school student and 4-panel manga artist. After moving to a dorm especially for female manga artists, she meets shoujo manga artist Koyume, teen romance manga artist Ruki, and shounen manga artist Tsubasa. Every day, they'll work all through the night trying to ink and finish their work! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akao Hikaru Kaoruko Moeta (voice) Saori Oonishi Ruki Irokawa (voice) Rie Takahashi Tsubasa Katsuki (voice) Kaede Hondo Koyume Koizuka (voice) Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Comic Girls premiered on April  5, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Comic Girls. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Comic Girls. You can help by rating TV shows you've seen. Facts Original Name  こみっくがーるず Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://comic-girls.com Genres Animation Comedy Keywords slice of life fan culture school life anime based on 4-koma Content Score 93 Almost there... Top Contributors 47 Marr 🇳🇱 t🇧 22 ticao2 🇧🇷 pt-BR 10 sp1ti 7 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}