{"link": "https://www.themoviedb.org/tv/65574?language=en", "title": "Those Who Can't", "resume": "There are teachers who inspire, enlighten, and challenge us. These are not those teachers.", "rate": 63, "genre": ["Comedy"], "cast": ["Adam Cayton-Holland", "Andrew Orvedahl", "Benjamin Roy", "Maria Thayer"], "character": ["Loren Payton", "Andy Fairbell", "Billy Shoemaker", "Abbey Logan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65574   Expand Those Who Can't   (2016) User Score  Play Trailer Overview There are teachers who inspire, enlighten, and challenge us. These are not those teachers. Featured Crew Adam Cayton-Holland Creator Andrew Orvedahl Creator Benjamin Roy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Cayton-Holland Loren Payton Andrew Orvedahl Andy Fairbell Benjamin Roy Billy Shoemaker Maria Thayer Abbey Logan Full Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of Those Who Can't premiered on October  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2014-10-14 Marry Me 5.9    2016-05-01 Camp WWE 3.8    2013-04-30 Inside Amy Schumer 5.4    2016-03-15 Crowded 6.4    2016-04-11 The Detour 7.5    2015-09-29 The Grinder 6.6    2016-01-22 Stan Lee's Lucky Man 7.3    2015-02-19 The Odd Couple 5.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.trutv.com/shows/those-who-cant Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 21 Elizabeth Jennings b 6 bugfix 5 dugrless a 5 apung21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}