{"link": "https://www.themoviedb.org/tv/65584?language=en", "title": "Atelier", "resume": "A young \"fabric geek\" lands a job at an upscale Japanese lingerie company — and quickly discovers she'll need help to survive.", "rate": 70, "genre": ["Drama"], "cast": ["Mirei Kiritani", "Mao Daichi", "Mayuko Kawakita"], "character": ["Mayuko Tokita", "Mayumi Nanjo", "Yuri Kouno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65584   Expand Atelier   (2015) User Score Overview A young \"fabric geek\" lands a job at an upscale Japanese lingerie company — and quickly discovers she'll need help to survive. Featured Crew Daisuke Sekiguchi\t  Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mirei Kiritani Mayuko Tokita Mao Daichi Mayumi Nanjo Mayuko Kawakita Yuri Kouno Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Atelier premiered on September  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2015-11-10 My Little Lover 6.3    2013-05-03 Maron 6.9    2016-06-02 Hibana: Spark 7.8  Facts Original Name  アンダーウェア Status  Returning Series Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  Japanese Runtime  47m Homepage   http://www.fujitv.co.jp/underwear/ Genres Drama Keywords lingerie fashion Content Score 71 Just a little bit more... Top Contributors 38 xyzl 7 Elizabeth Jennings 3 meticeo TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}