{"link": "https://www.themoviedb.org/tv/7237?language=en", "title": "The Worst Witch", "resume": "Mildred Hubble is a young witch attending Cackles Academy. She's called the \"Worst Witch\" because she's always caught getting into trouble.", "rate": 66, "genre": ["Comedy", "Drama", "Family", "Sci-Fi", "Fantasy"], "cast": ["Georgina Sherrington", "Katy Allen", "Jessica Fox", "Emma Brown", "Clare Coulter"], "character": ["Mildred Hubble", "Ethel Hallow", "Enid Nightshade", "Maud Moonshine", "Miss Amelia Cackle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7237   Expand The Worst Witch   (1998) User Score Overview Mildred Hubble is a young witch attending Cackles Academy. She's called the \"Worst Witch\" because she's always caught getting into trouble. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Georgina Sherrington Mildred Hubble Katy Allen Ethel Hallow Jessica Fox Enid Nightshade Emma Brown Maud Moonshine Clare Coulter Miss Amelia Cackle Full Cast & Crew Last Season Season 3 2000 | 13 Episodes Season 3 of The Worst Witch premiered on November  9, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Ethel: Happy Birthday Felicity Jones! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   1991-03-01 Clarissa Explains It All 6.2    1999-01-11 The League of Gentlemen 7.4    1989-01-13 A Bit of Fry and Laurie 8.0  Facts Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Comedy Drama Family Sci-Fi & Fantasy Keywords witch friendship school of witchcraft sorcery british teenager witchcraft high school rivalry Content Score 93 Almost there... Top Contributors 163 Marr 🇳🇱 c 16 clipper314 7 Banana 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}