{"link": "https://www.themoviedb.org/tv/645?language=en", "title": "Rhoda", "resume": "Rhoda is an American television sitcom, starring Valerie Harper, which aired 109 episodes over five seasons, from 1974 to 1978. The show was a spin-off of The Mary Tyler Moore Show, in which Harper between the years 1970 and 1974 had played the role of Rhoda Morgenstern, a spunky, weight-conscious, flamboyantly fashioned Jewish neighbor and native New Yorker in the role of Mary Richards' best friend. After four seasons, Rhoda left Minneapolis and returned to her original hometown of New York City. The series is noted for breaking two television records, and was the winner of two Golden Globes and two Emmy Awards.\nRhoda was filmed Friday evenings in front of a live studio audience at CBS Studio Center, Stage 14 in Studio City, Los Angeles, California.", "rate": 56, "genre": ["Comedy"], "cast": ["Valerie Harper", "Julie Kavner", "Kenneth McMillan", "Ray Buktenica", "Wil Albert"], "character": ["Rhoda Morgenstern", "Brenda Morgenstern", "Jack Doyle", "Benny Goodwin", "Gus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 645   Expand Rhoda   (1974) User Score Overview Rhoda is an American television sitcom, starring Valerie Harper, which aired 109 episodes over five seasons, from 1974 to 1978. The show was a spin-off of The Mary Tyler Moore Show, in which Harper between the years 1970 and 1974 had played the role of Rhoda Morgenstern, a spunky, weight-conscious, flamboyantly fashioned Jewish neighbor and native New Yorker in the role of Mary Richards' best friend. After four seasons, Rhoda left Minneapolis and returned to her original hometown of New York City. The series is noted for breaking two television records, and was the winner of two Golden Globes and two Emmy Awards. Rhoda was filmed Friday evenings in front of a live studio audience at CBS Studio Center, Stage 14 in Studio City, Los Angeles, California. Featured Crew Allan Burns Creator James L. Brooks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Valerie Harper Rhoda Morgenstern Julie Kavner Brenda Morgenstern Kenneth McMillan Jack Doyle Ray Buktenica Benny Goodwin Wil Albert Gus Full Cast & Crew Last Season Season 5 1978 | 13 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Brenda: Happy Birthday Julie Kavner! Open 0 by wonder2wonder\n      \n     w Rhoda: Happy Birthday Valerie Harper! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1966-09-12 Family Affair 5.4    1968-09-24 The Mod Squad 6.3    1982-03-23 Joanie Loves Chachi 2.4    1969-09-23 Marcus Welby, M.D. 6.8    1965-01-24 Branded 8.3    1971-08-01 The Sonny & Cher Comedy Hour 5.0    1963-09-24 Petticoat Junction 5.7    1970-09-25 The Partridge Family 5.5  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york jewish dating sitcom Content Score 100 Yes! Looking good! Top Contributors 11 United600 7 Banana 3 Steve 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}