{"link": "https://www.themoviedb.org/tv/34732?language=en", "title": "Tenjho Tenge", "resume": "Tenjho Tenge, also written as Tenjo Tenge, is a Japanese manga series written and illustrated by Oh! great. The story primarily focuses on the members of the Juken Club and their opposition, the Executive Council, which is the ruling student body of a high school that educates its students in the art of combat. As the story unfolds, both groups become increasingly involved with an ongoing battle that has been left unresolved for four hundred years.\nTenjho Tenge was serialized in the magazine Ultra Jump from 1998 to 2010, and collected into 22 volumes by Shūeisha. It was adapted into a twenty-four episode anime series and aired on TV Asahi between April 1, 2004 to September 16, 2004. A two-episode original video animation was also made and aired on March 16, 2005. Both versions of the series have been licensed for release in the English language by two different companies. The manga was licensed and released by CMX beginning in 2005, which came under criticism by fans for editing its sexual content. When CMX closed down in 2010, after releasing 18 volumes, Viz Media picked up the rights and completed their own release of the series in 2013. The anime was licensed and released by Geneon Entertainment, also beginning in 2005, however, it is now licensed by Discotek Media.", "rate": 80, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Soichiro Hoshi", "Shin'ichirou Miki", "Minori Chihara", "Aya Hisakawa", "Tomokazu Seki"], "character": ["Souichiro Nagi (voice)", "Bob Makihara (voice)", "Aya Natsume (voice)", "Maya Natsume (voice)", "Masataka Takayanagi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34732   Expand Tenjho Tenge   (2004) User Score Overview Tenjho Tenge, also written as Tenjo Tenge, is a Japanese manga series written and illustrated by Oh! great. The story primarily focuses on the members of the Juken Club and their opposition, the Executive Council, which is the ruling student body of a high school that educates its students in the art of combat. As the story unfolds, both groups become increasingly involved with an ongoing battle that has been left unresolved for four hundred years. Tenjho Tenge was serialized in the magazine Ultra Jump from 1998 to 2010, and collected into 22 volumes by Shūeisha. It was adapted into a twenty-four episode anime series and aired on TV Asahi between April 1, 2004 to September 16, 2004. A two-episode original video animation was also made and aired on March 16, 2005. Both versions of the series have been licensed for release in the English language by two different companies. The manga was licensed and released by CMX beginning in 2005, which came under criticism by fans for editing its sexual content. When CMX closed down in 2010, after releasing 18 volumes, Viz Media picked up the rights and completed their own release of the series in 2013. The anime was licensed and released by Geneon Entertainment, also beginning in 2005, however, it is now licensed by Discotek Media. Featured Crew Oh! great Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soichiro Hoshi Souichiro Nagi (voice) Shin'ichirou Miki Bob Makihara (voice) Minori Chihara Aya Natsume (voice) Aya Hisakawa Maya Natsume (voice) Tomokazu Seki Masataka Takayanagi (voice) Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Tenjho Tenge premiered on April  1, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations   1995-10-04 Neon Genesis Evangelion 8.0    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3  Facts Original Name  天上天下 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://mv.avex.jp/tenten/ Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 45 tmdb983464 d 3 dimmak x 3 xoINARIox m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}