{"link": "https://www.themoviedb.org/tv/4660?language=en", "title": "Adam-12", "resume": "Adam-12 is a television police drama that followed two police officers of the Los Angeles Police Department, Pete Malloy and Jim Reed, as they patrolled the streets of Los Angeles in their patrol unit, 1-Adam-12. Created by R. A. Cinader and Jack Webb, who is known for creating Dragnet, the series captured a typical day in the life of a police officer as realistically as possible. The show ran from September 21, 1968 through May 20, 1975, and helped introduce police procedures and jargon to the general public in the United States of America.", "rate": 74, "genre": ["Drama", "Action", "Adventure"], "cast": ["Martin Milner", "Kent McCord", "William Boyett", "Fred Stromsoe"], "character": ["Officer Pete Malloy", "Officer Jim Reed", "Sergeant MacDonald", "Officer Jerry Woods"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4660   Expand Adam-12   (1968) User Score Overview Adam-12 is a television police drama that followed two police officers of the Los Angeles Police Department, Pete Malloy and Jim Reed, as they patrolled the streets of Los Angeles in their patrol unit, 1-Adam-12. Created by R. A. Cinader and Jack Webb, who is known for creating Dragnet, the series captured a typical day in the life of a police officer as realistically as possible. The show ran from September 21, 1968 through May 20, 1975, and helped introduce police procedures and jargon to the general public in the United States of America. Featured Crew Jack Webb Creator Robert A. Cinader Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Milner Officer Pete Malloy Kent McCord Officer Jim Reed William Boyett Sergeant MacDonald Fred Stromsoe Officer Jerry Woods Full Cast & Crew Last Season Season 7 1974 | 24 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply one adam 12 Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1951-12-16 Dragnet 7.0    1970-01-21 Nanny and the Professor 3.5    1969-09-23 Marcus Welby, M.D. 6.8    1949-09-15 The Lone Ranger 5.4    1971-09-17 McMillan & Wife 7.2    1968-09-28 The Ghost & Mrs. Muir 6.7    1965-09-14 F Troop 6.4    1965-09-01 Gidget 5.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Action & Adventure Keywords police los angeles lapd Content Score 93 Almost there... Top Contributors 16 Banana 2 lineker 2 DarkMan M 1 MikeT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}