{"link": "https://www.themoviedb.org/tv/11920?language=en", "title": "Highway Patrol", "resume": "Highway Patrol is a syndicated action crime drama series produced from 1955 to 1959.", "rate": 70, "genre": ["Action", "Adventure", "Drama", "Documentary"], "cast": ["Broderick Crawford"], "character": ["Dan Matthews"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11920   Expand Highway Patrol   (1955) User Score Overview Highway Patrol is a syndicated action crime drama series produced from 1955 to 1959. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Broderick Crawford Dan Matthews Full Cast & Crew Last Season Season 2 — | 39 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Broderick Crawford's drinking problem affected the show Open 0 by PT 100\n      \n     n The 1950s: Women's attire was more modest, but automobile design, not so much Open 0 by nanonta\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Highway Patrol. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Drama Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 15 Steve R 2 Rebecca RW 2 Rich Wannen 1 zdlr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}