{"link": "https://www.themoviedb.org/tv/25760?language=en", "title": "Higurashi When They Cry", "resume": "After moving into the quiet town of Hinamizawa, Maebara Keiichi spends his days blissfully in school often playing games with his local friends. However, appearances can be deceiving. One fateful day, Keiichi stumbles upon news of a murder that had occurred in Hinamizawa. From this point on, horrific events unfold in front of Keiichi, as he soon learns his close friends may not be all that they seem. Based on the amateur mystery game by 07th Expansion, the story is told in a series of different scenarios.", "rate": 76, "genre": ["Animation", "Comedy", "Drama", "Mystery"], "cast": ["Yui Horie", "Mai Nakahara", "Yukari Tamura", "Mika Kanai", "Soichiro Hoshi"], "character": ["Hanyu (voice)", "Rena Ryuuguu (voice)", "Rika Furude (voice)", "Satoko Houjou (voice)", "Keiichi Maebara (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25760   Expand Higurashi When They Cry   (2007) User Score Overview After moving into the quiet town of Hinamizawa, Maebara Keiichi spends his days blissfully in school often playing games with his local friends. However, appearances can be deceiving. One fateful day, Keiichi stumbles upon news of a murder that had occurred in Hinamizawa. From this point on, horrific events unfold in front of Keiichi, as he soon learns his close friends may not be all that they seem. Based on the amateur mystery game by 07th Expansion, the story is told in a series of different scenarios. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Horie Hanyu (voice) Mai Nakahara Rena Ryuuguu (voice) Yukari Tamura Rika Furude (voice) Mika Kanai Satoko Houjou (voice) Soichiro Hoshi Keiichi Maebara (voice) Full Cast & Crew Last Season Higurashi no Naku Koro ni Rei (sort of S3) 2009 | 5 Episodes Season 3 of Higurashi When They Cry premiered on February 25, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2008-01-05 True Tears 8.0    2007-04-06 Darker than Black 7.7    2011-01-07 Puella Magi Madoka Magica 7.9    2009-04-02 Phantom: Requiem for the Phantom 6.4    2012-10-07 Code:Breaker 6.8    2010-04-04 KissXsis 5.7    2010-04-03 Angel Beats! 7.4    2011-07-01 Blood-C 7.9  Facts Original Name  ひぐらしのなく頃に Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Drama Mystery Keywords sadism mass murder village rain trauma gore baseball bat harem horror beaten to death murder psychic power rampage blood student psychological thriller torture fear psychic violence rage danger splatter witness to murder dungeon psycho killer adult animation psycho folklore bloodbath needle brunette 1980s traumatic experience anime Content Score 86 Almost there... Top Contributors d 59 disturbD 23 CrewMdk Q 20 QBCreature CM 19 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}