{"link": "https://www.themoviedb.org/tv/70881?language=en", "title": "Boruto: Naruto Next Generations", "resume": "Naruto was a young shinobi with an incorrigible knack for mischief. He achieved his dream to become the greatest ninja in the village and his face sits atop the Hokage Monument. But this is not his story. A new generation of ninja are ready to take the stage, led by Naruto's own son, Boruto.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Yuuko Sanpei", "Kokoro Kikuchi", "Ryuuichi Kijima", "Ryoko Shiraishi", "Shinji Kawada"], "character": ["Uzumaki Boruto (voice)", "Uchiha Sarada (voice)", "Mitsuki (voice)", "Akimichi Chouchou (voice)", "Aburame Shino (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70881   Expand Boruto: Naruto Next Generations   (2017) User Score  Play Trailer Overview Naruto was a young shinobi with an incorrigible knack for mischief. He achieved his dream to become the greatest ninja in the village and his face sits atop the Hokage Monument. But this is not his story. A new generation of ninja are ready to take the stage, led by Naruto's own son, Boruto. Featured Crew Makoto Uezu Creator Noriyuki Abe Creator Hiroyuki Yamashita Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  4 Images Backdrops  11 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuko Sanpei Uzumaki Boruto (voice) Kokoro Kikuchi Uchiha Sarada (voice) Ryuuichi Kijima Mitsuki (voice) Ryoko Shiraishi Akimichi Chouchou (voice) Shinji Kawada Aburame Shino (voice) Full Cast & Crew Last Season Season 1 2017 | 63 Episodes Season 1 of Boruto: Naruto Next Generations premiered on April  4, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Release Dates Open 0 by irkillroy\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  9 Recommendations   2017-04-16 Grimoire of Zero 8.3    2013-07-13 A Town Where You Live 7.5    2017-07-03 Love and Lies 8.0    2007-02-15 Naruto Shippūden 7.6    2017-07-01 Kakegurui 7.2    2017-07-01 Fate/Apocrypha 6.1    2004-10-05 Bleach 7.5    2002-10-03 Naruto 7.5  Facts Original Name  BORUTO-ボルト- NARUTO NEXT GENERATONS Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/anime/boruto/ Genres Action & Adventure Animation Keywords shounen anime Content Score 100 Yes! Looking good! Top Contributors 79 boy0815 23 iberq 16 irkillroy AK 14 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}