{"link": "https://www.themoviedb.org/tv/3333?language=en", "title": "Steptoe and Son", "resume": "Steptoe and Son is a British sitcom written by Ray Galton and Alan Simpson about a father and son played by Wilfred Brambell and Harry H. Corbett who deal in selling used items. They live on Oil Drum Lane, a fictional street in Shepherd's Bush, London. Four series were broadcast by the BBC from 1962 to 1965, followed by a second run from 1970 to 1974. Its theme tune, \"Old Ned\", was composed by Ron Grainer. The series was voted 15th in a 2004 BBC poll to find Britain's Best Sitcom. It was remade in the US as Sanford and Son, in Sweden as Albert & Herbert and in the Netherlands as Stiefbeen en zoon. In 1972 a movie adaptation of the series, Steptoe and Son, was released in cinemas, with a second Steptoe and Son Ride Again in 1973.\nThe series focussed on the inter-generational conflict of father and son. Albert Steptoe, a \"dirty old man\", is an old rag and bone man, set in his grimy and grasping ways. By contrast his 37-year-old son Harold is filled with social aspirations, not to say pretensions. The show contained elements of drama and tragedy, as Harold was continually prevented from achieving his ambitions. To this end the show was unusual at the time for casting actors rather than comedians in its lead roles, although both actors were drawn into more comedic roles as a consequence.", "rate": 83, "genre": ["Comedy"], "cast": ["Harry H. Corbett", "Wilfrid Brambell", "Joanna Lumley"], "character": ["Harold Steptoe", "Albert Steptoe", "Bunty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3333   Expand Steptoe and Son   (1962) User Score Overview Steptoe and Son is a British sitcom written by Ray Galton and Alan Simpson about a father and son played by Wilfred Brambell and Harry H. Corbett who deal in selling used items. They live on Oil Drum Lane, a fictional street in Shepherd's Bush, London. Four series were broadcast by the BBC from 1962 to 1965, followed by a second run from 1970 to 1974. Its theme tune, \"Old Ned\", was composed by Ron Grainer. The series was voted 15th in a 2004 BBC poll to find Britain's Best Sitcom. It was remade in the US as Sanford and Son, in Sweden as Albert & Herbert and in the Netherlands as Stiefbeen en zoon. In 1972 a movie adaptation of the series, Steptoe and Son, was released in cinemas, with a second Steptoe and Son Ride Again in 1973. The series focussed on the inter-generational conflict of father and son. Albert Steptoe, a \"dirty old man\", is an old rag and bone man, set in his grimy and grasping ways. By contrast his 37-year-old son Harold is filled with social aspirations, not to say pretensions. The show contained elements of drama and tragedy, as Harold was continually prevented from achieving his ambitions. To this end the show was unusual at the time for casting actors rather than comedians in its lead roles, although both actors were drawn into more comedic roles as a consequence. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Harry H. Corbett Harold Steptoe Wilfrid Brambell Albert Steptoe Joanna Lumley Bunty Full Cast & Crew Last Season Season 8 1974 | 6 Episodes Season 8 of Steptoe and Son premiered on September  4, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1974-09-05 Porridge 8.3    1976-02-20 Open All Hours 7.7    1973-01-09 Whatever Happened to the Likely Lads? 7.8    1965-07-22 Till Death Us Do Part 7.2    1973-02-15 Some Mothers Do 'Ave 'Em 7.8    1991-01-03 The Brittas Empire 7.1    1995-09-14 They Think It's All Over 7.3    1990-11-08 Harry Enfield's Television Programme 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b009j5xn Genres Comedy Keywords son dark comedy melancholy father business working class sitcom british humour Content Score 56 We're so close, yet so far. Top Contributors O 12 Ozbourne 4 Murnau 3 Elizabeth Jennings m 2 markwhitton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}