{"link": "https://www.themoviedb.org/tv/13291?language=en", "title": "Elizabeth I", "resume": "Elizabeth I is a two-part 2005 British historical drama television miniseries directed by Tom Hooper, written by Nigel Williams, and starring Helen Mirren as Elizabeth I of England. The miniseries covers approximately the last 24 years of her nearly 45-year reign. Part 1 focuses on the final years of her relationship with the Earl of Leicester, played by Jeremy Irons. Part 2 focuses on her subsequent relationship with the Earl of Essex, played by Hugh Dancy.\nThe series originally was broadcast in the United Kingdom in two two-hour segments on Channel 4. It later aired on HBO in the United States, CBC and TMN in Canada, ATV in Hong Kong, ABC in Australia, and TVNZ Television One in New Zealand.\nThe series went on to win Emmy, Peabody, and Golden Globe Awards. The same year, Helen Mirren starred as Queen Elizabeth II in The Queen, with which she dominated the award season.", "rate": 72, "genre": ["Drama"], "cast": ["Helen Mirren", "Jeremy Irons", "Hugh Dancy", "Ben Pullen", "Simon Woods"], "character": ["Queen Elizabeth I", "Earl of Leicester", "Robert Devereux, 2nd Earl of Essex", "Sir Walter Raleigh", "Gifford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13291   Expand Elizabeth I   (2005) User Score  Play Trailer Overview Elizabeth I is a two-part 2005 British historical drama television miniseries directed by Tom Hooper, written by Nigel Williams, and starring Helen Mirren as Elizabeth I of England. The miniseries covers approximately the last 24 years of her nearly 45-year reign. Part 1 focuses on the final years of her relationship with the Earl of Leicester, played by Jeremy Irons. Part 2 focuses on her subsequent relationship with the Earl of Essex, played by Hugh Dancy. The series originally was broadcast in the United Kingdom in two two-hour segments on Channel 4. It later aired on HBO in the United States, CBC and TMN in Canada, ATV in Hong Kong, ABC in Australia, and TVNZ Television One in New Zealand. The series went on to win Emmy, Peabody, and Golden Globe Awards. The same year, Helen Mirren starred as Queen Elizabeth II in The Queen, with which she dominated the award season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Helen Mirren Queen Elizabeth I Jeremy Irons Earl of Leicester Hugh Dancy Robert Devereux, 2nd Earl of Essex Ben Pullen Sir Walter Raleigh Simon Woods Gifford Full Cast & Crew Last Season Season 1 2005 | 2 Episodes Season 1 of Elizabeth I premiered on September 29, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   1977-09-04 Operation Petticoat 7.1    1964-09-17 Bewitched 7.1    1976-09-18 The Muppet Show 7.8    1990-09-14 Tiny Toon Adventures 7.3    1962-09-23 The Jetsons 6.6    1993-09-13 Late Night with Conan O'Brien 7.3    2008-03-16 John Adams 7.9    1999-03-19 Farscape 7.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  100m Homepage   http://www.channel4.com/programmes/elizabeth-i Genres Drama Keywords virgin england monarchy royal family governance queen elizabeth i miniseries queen of england palace intrigue historical drama 16th century Content Score 93 Almost there... Top Contributors TB 47 TMDb Bot 13 Banana 11 rudely_murray R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}