{"link": "https://www.themoviedb.org/tv/6770?language=en", "title": "The Tall Man", "resume": "The Tall Man is a half-hour American western television series about Sheriff Pat Garrett and the gunfighter Billy the Kid that aired seventy-five episodes on NBC from 1960 to 1962, filmed by Revue Productions.", "rate": 80, "genre": ["Western", "Action", "Adventure"], "cast": ["Clu Gulager", "Barry Sullivan"], "character": ["Billy the Kid", "Pat Garrett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6770   Expand The Tall Man   (1960) User Score Overview The Tall Man is a half-hour American western television series about Sheriff Pat Garrett and the gunfighter Billy the Kid that aired seventy-five episodes on NBC from 1960 to 1962, filmed by Revue Productions. Featured Crew Samuel A. Peeples Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clu Gulager Billy the Kid Barry Sullivan Pat Garrett Full Cast & Crew Last Season Season 2 1961 | 38 Episodes Season 2 of The Tall Man premiered on September  9, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Tall Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Action & Adventure Keywords sheriff new mexico wild west 19th century pat garrett Content Score 64 We're so close, yet so far. Top Contributors 15 Banana TM 5 Teófilo Moraes Guimarães 1 Steve d 1 dilack  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}