{"link": "https://www.themoviedb.org/tv/38881?language=en", "title": "Transformers: Rescue Bots", "resume": "A team of specialized Autobots not quite ready for prime-time battles against the Decepticons is given a vital mission by Optimus Prime. The goal for the Bots is to learn about mankind and how to help others to find out what it really means to be a hero.", "rate": 79, "genre": ["Action", "Adventure", "Animation", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Steve Blum", "D.C. Douglas", "Imari Williams", "Parvesh Cheena", "Maurice LaMarche"], "character": ["Heatwave (voice)", "Chase (voice)", "Boulder (voice)", "Blades (voice)", "Charlie Burns (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38881   Expand Transformers: Rescue Bots   (2012) User Score Overview A team of specialized Autobots not quite ready for prime-time battles against the Decepticons is given a vital mission by Optimus Prime. The goal for the Bots is to learn about mankind and how to help others to find out what it really means to be a hero. Featured Crew Nicole Dubuc Creator Brian Hohlfeld Creator Jeff Kline Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Blum Heatwave (voice) D.C. Douglas Chase (voice) Imari Williams Boulder (voice) Parvesh Cheena Blades (voice) Maurice LaMarche Charlie Burns (voice) Full Cast & Crew Last Season Season 4 2016 | 26 Episodes Season 4 of Transformers: Rescue Bots premiered on April 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2008-09-01 Sid the Science Kid 6.1    2007-09-03 Super Why! 5.7    2010-10-15 The Adventures of Chuck and Friends 6.0    2013-12-24 Turbo FAST 4.7    2009-04-05 Beyblade: Metal Fusion 3.8    2012-06-07 TRON: Uprising 7.5  Facts Status  Ended Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Action & Adventure Animation Kids Sci-Fi & Fantasy Keywords transformers robot Content Score 93 Almost there... Top Contributors 43 Travis Bell 19 betsumei R 9 RicoT 8 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}