{"link": "https://www.themoviedb.org/tv/34408?language=en", "title": "Playful Kiss", "resume": "Playful Kiss is a 2010 South Korean romantic-comedy television series, starring Jung So-min and Kim Hyun-joong. It aired on MBC from September 1 to October 21, 2010 on Wednesdays and Thursdays at 21:55 for 16 episodes.\nIt is based on the Japanese manga Itazura Na Kiss written by Tada Kaoru. The Korean series is the third television adaptation of the manga following the Taiwanese It Started With a Kiss in 2005, and its sequel They Kiss Again in 2007. Though Playful Kiss received low ratings in South Korea in the five to seven percent range, it was sold to 12 countries in Asia. Due to its international popularity, a short special edition was aired on YouTube after the series finale.", "rate": 69, "genre": ["Comedy"], "cast": ["Kim Hyun-joong", "Jung So-min", "Lee Si-young", "Abigail Alderete", "Lee Tae-sung"], "character": ["Beak Seung Jo", "Oh Ha-ni", "Yoon He Ra", "Chris", "Bong Joon-gu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34408   Expand Playful Kiss   (2010) User Score Overview Playful Kiss is a 2010 South Korean romantic-comedy television series, starring Jung So-min and Kim Hyun-joong. It aired on MBC from September 1 to October 21, 2010 on Wednesdays and Thursdays at 21:55 for 16 episodes. It is based on the Japanese manga Itazura Na Kiss written by Tada Kaoru. The Korean series is the third television adaptation of the manga following the Taiwanese It Started With a Kiss in 2005, and its sequel They Kiss Again in 2007. Though Playful Kiss received low ratings in South Korea in the five to seven percent range, it was sold to 12 countries in Asia. Due to its international popularity, a short special edition was aired on YouTube after the series finale. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hyun-joong Beak Seung Jo Jung So-min Oh Ha-ni Lee Si-young Yoon He Ra Abigail Alderete Chris Lee Tae-sung Bong Joon-gu Full Cast & Crew Last Season Specials 2010 | 16 Episodes Season 0 of Playful Kiss premiered on November  2, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  6 Recommendations   2015-08-23 Noble, My Love 7.4    2017-09-04 Argon 6.8    2011-08-08 Birdie Buddy 7.7    2016-11-21 White Nights 8.0    2008-03-16 Fated to Love You 7.3    2016-03-23 Click your Heart 7.0    2009-01-05 Boys Over Flowers 7.8  Facts Original Name  장난스런 키스 Status  Ended Networks Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/kiss/index.html Genres Comedy Keywords romance coming of age korea school first love arrogance Content Score 86 Almost there... Top Contributors N 39 Nightowl.Kr M 14 Maria180493 13 Sven-Erik Andersen 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}