{"link": "https://www.themoviedb.org/tv/3103?language=en", "title": "Bananas in Pyjamas", "resume": "Bananas in Pyjamas is an Australian children's television show that premiered on 20 July 1992 on ABC. It has since become syndicated in many different countries, and dubbed into other languages. In the United States, the \"Pyjamas\" in the title was modified to reflect the American spelling pajamas. This aired in syndication from 1995 to 1997 as a half-hour series, then became a 15-minute show paired with a short-lived 15-minute series The Crayon Box, under a 30-minute block produced by Sachs Family Entertainment titled Bananas in Pajamas & The Crayon Box. Additionally, the characters and a scene from the show were featured in the Kids for Character sequel titled Kids for Character: Choices Count. The pilot episode was Pink Mug.\nThe concept was inspired by the success of the song Bananas in Pyjamas, written by Carey Blyton in 1967, on Play School. This song, which had become a regular item on Play School, became the theme of the new series.\nIn 1997, Bumping & A Jumping, an album based on the show, was released. The series was revamped in May 2011 as a CGI animated series created by Southern Star Entertainment.", "rate": 32, "genre": ["Kids"], "cast": ["Nicholas Opolski", "Shane McNamara", "Ken Radley", "Sandie Lillingston"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3103   Expand Bananas in Pyjamas   (1992) User Score Overview Bananas in Pyjamas is an Australian children's television show that premiered on 20 July 1992 on ABC. It has since become syndicated in many different countries, and dubbed into other languages. In the United States, the \"Pyjamas\" in the title was modified to reflect the American spelling pajamas. This aired in syndication from 1995 to 1997 as a half-hour series, then became a 15-minute show paired with a short-lived 15-minute series The Crayon Box, under a 30-minute block produced by Sachs Family Entertainment titled Bananas in Pajamas & The Crayon Box. Additionally, the characters and a scene from the show were featured in the Kids for Character sequel titled Kids for Character: Choices Count. The pilot episode was Pink Mug. The concept was inspired by the success of the song Bananas in Pyjamas, written by Carey Blyton in 1967, on Play School. This song, which had become a regular item on Play School, became the theme of the new series. In 1997, Bumping & A Jumping, an album based on the show, was released. The series was revamped in May 2011 as a CGI animated series created by Southern Star Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Opolski Shane McNamara Ken Radley Sandie Lillingston Full Cast & Crew Last Season Season 5 1999 | 20 Episodes Season 5 of Bananas in Pyjamas premiered on November 22, 1999. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Bananas in Pyjamas. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1991-09-26 Brum 5.2    1992-04-06 Barney & Friends 3.6    1986-05-28 Pingu 6.5    1981-09-16 Postman Pat 6.0    1980-10-04 Heathcliff 5.0    1993-09-18 Sonic the Hedgehog 5.3    2013-07-09 Drunk History 7.2    1997-03-31 Teletubbies 2.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage   http://www.abc.net.au/abcforkids/sites/bananasinpyjamas/ Genres Kids Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 14 United600 w 4 waterhorse 2 kuzronk 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}