{"link": "https://www.themoviedb.org/tv/70875?language=en", "title": "Grimoire of Zero", "resume": "Year 526 of the Liturgical Calendar.\nThe world knew that witches existed, and that they practiced the notorious art of sorcery.\nNevertheless, the world did not know anything about the study of magic.\nOur story follows a half-man, half-beast mercenary; humans mockingly call his kind the “fallen beasts”.\nHe always dreamt of becoming a human, but one day, he met a witch who would change his life forever.\n“Do you desire a human form? Then be my escort, mercenary!”\nThe witch introduced herself as “Zero”, and explained that she was searching for a one-of-a-kind magical tome that bandits had stolen from her lair. Entitled “The Book of Zero”, the grimoire supposedly contained valuable magical knowledge that could be used to effortlessly bring the world to its knees.\nThus, in order to realize his dream of becoming a human, the mercenary must accompany Zero on her journey—despite her being one of the witches he so loathed.\nThis is the story of a haughty sorceress and a kindhearted beast.", "rate": 83, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70875   Expand Grimoire of Zero   (2017) User Score  Play Trailer Overview Year 526 of the Liturgical Calendar. The world knew that witches existed, and that they practiced the notorious art of sorcery. Nevertheless, the world did not know anything about the study of magic. Our story follows a half-man, half-beast mercenary; humans mockingly call his kind the “fallen beasts”. He always dreamt of becoming a human, but one day, he met a witch who would change his life forever. “Do you desire a human form? Then be my escort, mercenary!” The witch introduced herself as “Zero”, and explained that she was searching for a one-of-a-kind magical tome that bandits had stolen from her lair. Entitled “The Book of Zero”, the grimoire supposedly contained valuable magical knowledge that could be used to effortlessly bring the world to its knees. Thus, in order to realize his dream of becoming a human, the mercenary must accompany Zero on her journey—despite her being one of the witches he so loathed. This is the story of a haughty sorceress and a kindhearted beast. Featured Crew Tetsuo Hirakawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Grimoire of Zero premiered on April 16, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Grimoire of Zero. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Grimoire of Zero. You can help by rating TV shows you've seen. Facts Original Name  ゼロから始める魔法の書 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://zeronosyo.com/ Genres Animation Drama Sci-Fi & Fantasy Keywords based on light novel anime Content Score 71 Just a little bit more... Top Contributors 17 sp1ti 9 Jenazad 8 YareYareDaze2 Z 6 Zayrus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}