{"link": "https://www.themoviedb.org/tv/60602?language=en", "title": "Fleming", "resume": "Set at the outbreak of WWII – mischievous playboy Ian Fleming is untroubled by the specter of impending war – chasing women, collecting rare books and living off his family fortune. Forever in the shadow of his brother Peter, and an eternal disappointment to his formidable mother Eve, Fleming dreams of becoming the ‘ultimate’ man – a hero, a lover, a brute and the one who always gets the girl. He is finally given some direction in his life when he’s recruited by the Director of Naval Intelligence to help in the effort against the Nazis. Suddenly, Fleming finds his chance to shine and prove his worth.", "rate": 64, "genre": ["Drama"], "cast": ["Dominic Cooper", "Lara Pulver", "Samuel West", "Anna Chancellor", "Rupert Evans"], "character": ["Ian Fleming", "Ann O'Neill", "Rear Admiral John Godfrey", "Second Officer Monday", "Peter Fleming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60602   Expand Fleming   (2014) User Score  Play Trailer Overview Set at the outbreak of WWII – mischievous playboy Ian Fleming is untroubled by the specter of impending war – chasing women, collecting rare books and living off his family fortune. Forever in the shadow of his brother Peter, and an eternal disappointment to his formidable mother Eve, Fleming dreams of becoming the ‘ultimate’ man – a hero, a lover, a brute and the one who always gets the girl. He is finally given some direction in his life when he’s recruited by the Director of Naval Intelligence to help in the effort against the Nazis. Suddenly, Fleming finds his chance to shine and prove his worth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dominic Cooper Ian Fleming Lara Pulver Ann O'Neill Samuel West Rear Admiral John Godfrey Anna Chancellor Second Officer Monday Rupert Evans Peter Fleming Full Cast & Crew Last Season Season 1 2014 | 4 Episodes Season 1 of Fleming premiered on January 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2014-01-19 The Musketeers 6.6    2015-12-27 Trapped 7.6  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   http://bbcamerica.com/fleming/ Genres Drama Keywords spy biography historical figure miniseries writer overbearing mother period drama british secret service nazi collaborator nazi occupation 1940s 1930s Content Score 93 Almost there... Top Contributors 30 Banana P 22 Parkie TB 19 TMDb Bot M 6 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}