{"link": "https://www.themoviedb.org/tv/5660?language=en", "title": "Mobile Suit Gundam ZZ", "resume": "The year is Universal Century 0088. Directly after the end of the  Gryps War, Haman Karn and her army of Zeon remnants on the asteroid Axis  begin their quest of reviving the lost empire of the Zabi's, and  proclaim themselves as the Neo-Zeon. With the Earth Federation as  hapless as ever, only the Anti-Earth Union Group (AEUG) is able oppose  the plans of Neo-Zeon. In need of all the help it can get after being  decimated in the previous war and losing many of its key members, the  AEUG ship Argama enlists the aid of a young junk collector from the Side  1 colony of Shangri-La named Judau Ashta to pilot its newest mobile  suit, the ZZ Gundam.", "rate": 0, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Masami Kikuchi", "Hirotaka Suzuoki", "Kazuki Yao", "Chika Sakamoto", "Yoshiko Sakakibara"], "character": ["Iino Abbav", "Bright Noa", "Judau Ashta", "Shinta", "Haman Karn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5660   Expand Mobile Suit Gundam ZZ   (1986) User Score Overview The year is Universal Century 0088. Directly after the end of the  Gryps War, Haman Karn and her army of Zeon remnants on the asteroid Axis  begin their quest of reviving the lost empire of the Zabi's, and  proclaim themselves as the Neo-Zeon. With the Earth Federation as  hapless as ever, only the Anti-Earth Union Group (AEUG) is able oppose  the plans of Neo-Zeon. In need of all the help it can get after being  decimated in the previous war and losing many of its key members, the  AEUG ship Argama enlists the aid of a young junk collector from the Side  1 colony of Shangri-La named Judau Ashta to pilot its newest mobile  suit, the ZZ Gundam. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masami Kikuchi Iino Abbav Hirotaka Suzuoki Bright Noa Kazuki Yao Judau Ashta Chika Sakamoto Shinta Yoshiko Sakakibara Haman Karn Full Cast & Crew Last Season Gundam zz season 1 1986 | 47 Episodes Season 1 of Mobile Suit Gundam ZZ premiered on March  1, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam ZZ. You can help by rating TV shows you've seen. Facts Original Name  機動戦士ガンダムZZ Status  Ended Networks - Certification  - Type  Scripted Original Language  Abkhazian Runtime  25m Homepage   http://www.gundam-zz.net/ Genres Animation Drama Comedy Keywords anime Content Score 86 Almost there... Top Contributors 15 batellium t 5 tmdb983464 w 3 wyxslh 2 Terence Haejin Lee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}