{"link": "https://www.themoviedb.org/tv/12605?language=en", "title": "Mahabharata", "resume": "Mahabharat is a successful Indian television series based on the Hindu epic Mahabharata. The 94-episode Hindi series originally ran from 2 October 1988 to 24 June 1990 on DD National. It was produced by B. R. Chopra and directed by his son, Ravi Chopra. The music was composed by critically acclaimed music director Rajkamal. Each episode was approximately 45 minutes. It followed the highly successful Ramayan broadcast in 1987–1988. Costumes of the series was provided by Maganlal Dresswala.\nIt was shown in the United Kingdom by the BBC, where it achieved audience figures of 5 million. It was also the first programme broadcast on BBC2 after its 1991 revamp, but had also been shown late at night on BBC 1 the previous year. It has also been shown on FBC TV in Fiji and Star Utsav. Dubbed versions were aired in Tamil, Telugu, and Indonesian in the early 1990s.\nAccording to production team member Kishore Malhotra, the total cost of producing the series was 90000000. It was aired in the premium Sunday morning time slot of 9:00 am – 10:00 am. The series was a runaway success and public places were often deserted during the broadcast. To ensure a good voter turnout in the central election one Sunday, the telecast was delayed to the evening. This is considered the definitive filmed version of the story. Nitish Bharadwaj, who portrayed Lord Krishna, was very popular and became a Member of the Indian Parliament.", "rate": 70, "genre": ["Drama"], "cast": ["Nazneen", "Dara Singh", "Nitish Bharadwaj", "Mukesh Khanna", "Gufi Paintal"], "character": ["Kunti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12605   Expand Mahabharata   (1988) User Score Overview Mahabharat is a successful Indian television series based on the Hindu epic Mahabharata. The 94-episode Hindi series originally ran from 2 October 1988 to 24 June 1990 on DD National. It was produced by B. R. Chopra and directed by his son, Ravi Chopra. The music was composed by critically acclaimed music director Rajkamal. Each episode was approximately 45 minutes. It followed the highly successful Ramayan broadcast in 1987–1988. Costumes of the series was provided by Maganlal Dresswala. It was shown in the United Kingdom by the BBC, where it achieved audience figures of 5 million. It was also the first programme broadcast on BBC2 after its 1991 revamp, but had also been shown late at night on BBC 1 the previous year. It has also been shown on FBC TV in Fiji and Star Utsav. Dubbed versions were aired in Tamil, Telugu, and Indonesian in the early 1990s. According to production team member Kishore Malhotra, the total cost of producing the series was 90000000. It was aired in the premium Sunday morning time slot of 9:00 am – 10:00 am. The series was a runaway success and public places were often deserted during the broadcast. To ensure a good voter turnout in the central election one Sunday, the telecast was delayed to the evening. This is considered the definitive filmed version of the story. Nitish Bharadwaj, who portrayed Lord Krishna, was very popular and became a Member of the Indian Parliament. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nazneen Kunti Dara Singh Nitish Bharadwaj Mukesh Khanna Gufi Paintal Full Cast & Crew Last Season Season 1 — | 94 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-04-12 Da Vinci's Demons 7.2    2006-03-05 Planet Earth 8.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 8 alym AM 7 Ade M Saragih w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}