{"link": "https://www.themoviedb.org/tv/12597?language=en", "title": "Yes, Prime Minister", "resume": "James Hacker MP the Government's bumbling minister  for Administrative Affairs is propelled along the corridors of power to the very pinnacle of politics - No. 10.  Could this have possibly have been managed by his trusted Permanent Private Secretary, the formidably political Sir Humphrey Appleby who must move to the “Top Job” in Downing Street to support him, together with his much put upon PPS Bernard Wolley. \nWhat could possibly go wrong?", "rate": 83, "genre": ["Comedy"], "cast": ["Paul Eddington", "Derek Fowlds", "Nigel Hawthorne", "Deborah Norton", "Diana Hoddinott"], "character": ["Jim Hacker", "Bernard Woolley", "Humphrey Appleby", "Dorothy Wainwright", "Annie Hacker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12597   Expand Yes, Prime Minister   (1986) User Score Overview James Hacker MP the Government's bumbling minister  for Administrative Affairs is propelled along the corridors of power to the very pinnacle of politics - No. 10.  Could this have possibly have been managed by his trusted Permanent Private Secretary, the formidably political Sir Humphrey Appleby who must move to the “Top Job” in Downing Street to support him, together with his much put upon PPS Bernard Wolley.  What could possibly go wrong? Featured Crew Antony Jay Creator Jonathan Lynn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Eddington Jim Hacker Derek Fowlds Bernard Woolley Nigel Hawthorne Humphrey Appleby Deborah Norton Dorothy Wainwright Diana Hoddinott Annie Hacker Full Cast & Crew Last Season Series 2 1987 | 8 Episodes Season 2 of Yes, Prime Minister premiered on December  3, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1980-02-25 Yes Minister 8.0    1975-04-04 The Good Life 7.0    1984-02-26 Spitting Image 7.8    1988-09-23 Whose Line Is It Anyway? 7.8    1987-03-09 French & Saunders 7.4    2005-06-05 Mock the Week 7.0    1987-01-07 Filthy Rich & Catflap 6.7    1996-11-12 Never Mind the Buzzcocks 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00m01hr Genres Comedy Keywords government england politics prime minister satire sequel british prime minister sitcom political humour british humour Content Score 93 Almost there... Top Contributors O 9 Ozbourne 7 Elizabeth Jennings m 7 masqueraid j 6 jzvc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}