{"link": "https://www.themoviedb.org/tv/17572?language=en", "title": "Kick Buttowski: Suburban Daredevil", "resume": "Kick Buttowski: Suburban Daredevil is an Emmy Nominated animated television series created by animator Sandro Corsaro, about a young boy named Clarence \"Kick\" Buttowski, who aspires to become the world's greatest daredevil. It became the fourth Disney XD original series and the first animated series. The show premiered on February 13, 2010, with two episodes airing the first day. Also the series premiered on Disney Channel Asia on May 28, 2010 There are two 11-minute segments per show. The show uses Toon Boom Animation software. There are also some 3D-animated elements. The series is executive-produced and directed by Chris Savino. and Sandro Corsaro. Many of the characters and situations were based on the Corsaro's childhood growing up in Stoneham, Massachusetts.", "rate": 43, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Chris Edgerly", "Danny Cooksey", "John DiMaggio", "Charlie Schlatter", "Eric Christian Olsen"], "character": ["Brad Buttowski", "Mr. Vickle", "Kick Buttowski", "Wade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17572   Expand Kick Buttowski: Suburban Daredevil   (2010) User Score  Play Trailer Overview Kick Buttowski: Suburban Daredevil is an Emmy Nominated animated television series created by animator Sandro Corsaro, about a young boy named Clarence \"Kick\" Buttowski, who aspires to become the world's greatest daredevil. It became the fourth Disney XD original series and the first animated series. The show premiered on February 13, 2010, with two episodes airing the first day. Also the series premiered on Disney Channel Asia on May 28, 2010 There are two 11-minute segments per show. The show uses Toon Boom Animation software. There are also some 3D-animated elements. The series is executive-produced and directed by Chris Savino. and Sandro Corsaro. Many of the characters and situations were based on the Corsaro's childhood growing up in Stoneham, Massachusetts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Edgerly Danny Cooksey Brad Buttowski John DiMaggio Mr. Vickle Charlie Schlatter Kick Buttowski Eric Christian Olsen Wade Full Cast & Crew Last Season Season 2 2011 | 33 Episodes Season 2 of Kick Buttowski: Suburban Daredevil premiered on April 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2006-02-11 Shuriken School 4.6    2008-10-25 Kid vs. Kat 4.5    2003-11-01 Xiaolin Showdown 6.9    1999-04-12 Bob the Builder 5.5    2010-04-23 Ben 10: Ultimate Alien 6.1    2005-07-08 Camp Lazlo 5.6    2005-01-21 American Dragon: Jake Long 5.9    2001-09-03 The Legend of Tarzan 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://disneyxd.disney.com/kick-buttowski Genres Action & Adventure Animation Comedy Keywords daredevil Content Score 93 Almost there... Top Contributors 13 Banana s 4 speedycars 3 danimados 3 FelipeFusion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}