{"link": "https://www.themoviedb.org/tv/78685?language=en", "title": "The Confidence Man JP", "resume": "Dako is a con woman. She stays at a suite in a luxury hotel and schemes to take money from vicious wealthy people like yakuza bosses and evil businessmen. She works with Boku-chan and Richard. Boku-chan is a sincere and timid young con man. Richard is a veteran con man.\nDako is able to master knowledge from various professions in a short period of time and disguises herself as someone working in that field. Along with Boku-chan and Richard, they carry their plans using fantastic teamwork.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Masami Nagasawa", "Masahiro Higashide", "Fumiyo Kohinata"], "character": ["Dako", "Boku-chan", "Richard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78685   Expand The Confidence Man JP   (2018) User Score Overview Dako is a con woman. She stays at a suite in a luxury hotel and schemes to take money from vicious wealthy people like yakuza bosses and evil businessmen. She works with Boku-chan and Richard. Boku-chan is a sincere and timid young con man. Richard is a veteran con man. Dako is able to master knowledge from various professions in a short period of time and disguises herself as someone working in that field. Along with Boku-chan and Richard, they carry their plans using fantastic teamwork. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masami Nagasawa Dako Masahiro Higashide Boku-chan Fumiyo Kohinata Richard Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of The Confidence Man JP premiered on April  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Confidence Man JP. You can help by rating TV shows you've seen. Facts Original Name  コンフィデンスマンJP Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.fujitv.co.jp/confidenceman_jp/index.html Genres Comedy Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors M 21 Maria180493 10 tcx4c70 7 wufatmio h 4 huestory  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}