{"link": "https://www.themoviedb.org/tv/65220?language=en", "title": "I Am Jazz", "resume": "Meet Jazz Jennings! Jazz is a transgender teenage girl who has been living as a girl since she was in kindergarten. Parents Jeanette and Greg have spent the years finding doctors to treat their daughter, while fighting the discrimination and misconceptions associated with what it means to be transgender. But, now that Jazz is 14, she is on the brink of the biggest challenge of her life: high school.", "rate": 63, "genre": ["Reality"], "cast": ["Jazz Jennings"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65220   Expand I Am Jazz   (2015) User Score Overview Meet Jazz Jennings! Jazz is a transgender teenage girl who has been living as a girl since she was in kindergarten. Parents Jeanette and Greg have spent the years finding doctors to treat their daughter, while fighting the discrimination and misconceptions associated with what it means to be transgender. But, now that Jazz is 14, she is on the brink of the biggest challenge of her life: high school. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jazz Jennings Herself Full Cast & Crew Current Season Season 4 2018 | 8 Episodes Season 4 of I Am Jazz premiered on January  2, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply I don't think Jazz and Noelle would be friends in real life (outside of this show) Open 10 by  Poetist Jazz done goofed Open 28 by  Poetist Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I Am Jazz. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  22m Homepage   http://tlc.com/tv-shows/i-am-jazz/ Genres Reality Keywords teenager transgender lgbt Content Score 56 We're so close, yet so far. Top Contributors 20 Banana b 6 basher EL 3 Erica L Thompson 3 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}