{"link": "https://www.themoviedb.org/tv/72707?language=en", "title": "My Golden Life", "resume": "Seo Ji Ahn, a former rich girl, was forced to be her family's breadwinner after her father's bankruptcy. She is now a contractual employee and living her life with restrained emotion. The drama chronicles her struggles to find new meaning and happiness in life.", "rate": 47, "genre": ["Drama", "Family"], "cast": ["Shin Hye-sun", "Park Shi Hoo", "Lee Tae-hwan", "Lee Tae-sung", "Kim Hye-ok"], "character": ["Seo Ji-An", "Choi Do-Kyung", "Sun Woo-Hyuk", "Seo Ji-Tae", "Yang Mi-Jung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72707   Expand My Golden Life   (2017) User Score Overview Seo Ji Ahn, a former rich girl, was forced to be her family's breadwinner after her father's bankruptcy. She is now a contractual employee and living her life with restrained emotion. The drama chronicles her struggles to find new meaning and happiness in life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin Hye-sun Seo Ji-An Park Shi Hoo Choi Do-Kyung Lee Tae-hwan Sun Woo-Hyuk Lee Tae-sung Seo Ji-Tae Kim Hye-ok Yang Mi-Jung Full Cast & Crew Last Season Season 1 2017 | 52 Episodes Season 1 of My Golden Life premiered on September  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Golden Life. You can help by rating TV shows you've seen. Facts Original Name  황금빛 내 인생 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/mygoldenlife/index.html Genres Drama Family Keywords romance Content Score 86 Almost there... Top Contributors M 40 Maria180493 9 sansalayne V 8 Violsa 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}