{"link": "https://www.themoviedb.org/tv/10553?language=en", "title": "Spiral Zone", "resume": "Spiral Zone is a 1987 American science-fiction animated series produced by Atlantic-Kushner-Locke. Based in part from a toy line made by Japanese company Bandai, the series focused on an international group of soldiers fighting to free the world from a scientist who controls much of the Earth's surface. It only ran for one season, with a total count of 65 episodes.\nTonka acquired the license from Bandai and created a different treatment to the series, plus a short-lived toy line. Spiral Zone is known among fans as a series that stood out from other contemporary cartoons of the 80s because of its dark story. The series has not been officially released on DVD by Hasbro, who had acquired Tonka in the 90s, including all the copyrights to their properties.", "rate": 80, "genre": ["Animation", "Action", "Adventure"], "cast": ["Michael Bell", "Hal Rayle", "Dan Gilvezan", "Mona Marshall", "Frank Welker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10553   Expand Spiral Zone   (1987) User Score Overview Spiral Zone is a 1987 American science-fiction animated series produced by Atlantic-Kushner-Locke. Based in part from a toy line made by Japanese company Bandai, the series focused on an international group of soldiers fighting to free the world from a scientist who controls much of the Earth's surface. It only ran for one season, with a total count of 65 episodes. Tonka acquired the license from Bandai and created a different treatment to the series, plus a short-lived toy line. Spiral Zone is known among fans as a series that stood out from other contemporary cartoons of the 80s because of its dark story. The series has not been officially released on DVD by Hasbro, who had acquired Tonka in the 90s, including all the copyrights to their properties. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Bell Hal Rayle Dan Gilvezan Mona Marshall Frank Welker Full Cast & Crew Last Season Season 1 1987 | 65 Episodes Season 1 of Spiral Zone premiered on September 21, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Spiral Zone. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  20m, 30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 Robson Guedes Vieira 2 Mitsarinho 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}