{"link": "https://www.themoviedb.org/tv/66149?language=en", "title": "The Powerpuff Girls", "resume": "Three colorful, sugarcoated kids trying to juggle school and save the world before bedtime.", "rate": 35, "genre": ["Comedy", "Animation", "Action", "Adventure"], "cast": ["Kristen Li", "Haley Mancini", "Amanda Leighton", "Natalie Palamides", "Tom Kane"], "character": ["Bubbles", "Princess Morbucks", "Blossom", "Buttercup", "Professor Utonium"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66149   Expand The Powerpuff Girls   (2016) User Score  Play Trailer Overview Three colorful, sugarcoated kids trying to juggle school and save the world before bedtime. Featured Crew Bob Boyle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristen Li Bubbles Haley Mancini Princess Morbucks Amanda Leighton Blossom Natalie Palamides Buttercup Tom Kane Professor Utonium Full Cast & Crew Last Season Season 2 2017 | 5 Episodes Season 2 of The Powerpuff Girls premiered on March  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2015-10-05 Be Cool, Scooby Doo! 5.1    2011-05-03 The Looney Tunes Show 7.0    2014-01-04 Space Dandy 7.5    2014-11-08 Sonic Boom 6.0    2010-07-12 Scooby-Doo! Mystery Incorporated 7.4    1993-09-13 Animaniacs 7.6    1998-11-18 The Powerpuff Girls 7.0    2004-08-13 Foster's Home for Imaginary Friends 6.8  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage  - Genres Comedy Animation Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors R 13 Rebecca a 10 agus-rheiza c 6 coltongsmith m 3 movie28  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}