{"link": "https://www.themoviedb.org/tv/891?language=en", "title": "Thunderbirds", "resume": "Thunderbirds is a 1960s British science-fiction television series, created by Gerry and Sylvia Anderson, filmed by their production company AP Films and distributed by ITC Entertainment, which was produced using a mixed method of marionette puppetry and scale-model special effects termed \"Supermarionation\". Following the earlier Supermarionation productions Four Feather Falls, Supercar, Fireball XL5 and Stingray, the series is set in the 21st century and follows the exploits of International Rescue, a secret organisation formed to save people in mortal danger with the help of technologically advanced land, sea, air and space vehicles and equipment, launched from a hidden base on Tracy Island in the South Pacific Ocean. The main puppet characters are multi-millionaire ex-astronaut Jeff Tracy, the founder of International Rescue, and his five sons, who pilot the craft of the Thunderbirds fleet. Periodically re-aired since its original 1965–66 broadcast, Thunderbirds has influenced numerous TV programmes, films and advertisements, has been followed by three feature-length films and a stage play, and has inspired various merchandising campaigns.", "rate": 84, "genre": ["Action", "Adventure", "Animation", "Family", "Sci-Fi", "Fantasy"], "cast": ["David Holliday"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 891   Expand Thunderbirds   (1965) User Score  Play Trailer Overview Thunderbirds is a 1960s British science-fiction television series, created by Gerry and Sylvia Anderson, filmed by their production company AP Films and distributed by ITC Entertainment, which was produced using a mixed method of marionette puppetry and scale-model special effects termed \"Supermarionation\". Following the earlier Supermarionation productions Four Feather Falls, Supercar, Fireball XL5 and Stingray, the series is set in the 21st century and follows the exploits of International Rescue, a secret organisation formed to save people in mortal danger with the help of technologically advanced land, sea, air and space vehicles and equipment, launched from a hidden base on Tracy Island in the South Pacific Ocean. The main puppet characters are multi-millionaire ex-astronaut Jeff Tracy, the founder of International Rescue, and his five sons, who pilot the craft of the Thunderbirds fleet. Periodically re-aired since its original 1965–66 broadcast, Thunderbirds has influenced numerous TV programmes, films and advertisements, has been followed by three feature-length films and a stage play, and has inspired various merchandising campaigns. Featured Crew Gerry Anderson Creator Sylvia Anderson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Holliday Full Cast & Crew Last Season Season 2 1966 | 6 Episodes Season 2 of Thunderbirds premiered on October  2, 1966. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply thunderbirds Open 1 by  Jetfire59 t Hello? Open 0 by Jetfire59\n      \n     t THUNDERBIRDS ARE GO!! Open 0 by Jetfire59\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  2 Recommendations   1967-09-29 Captain Scarlet and the Mysterons 8.3    1964-10-04 Stingray 6.5    2009-06-14 Alan Carr: Chatty Man 5.0    1971-04-10 The Two Ronnies 9.0    1968-09-29 Joe 90 7.8    1975-01-02 The Sweeney 6.4    1966-01-03 Camberwick Green 8.3    1974-01-03 It Ain't Half Hot Mum 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Action & Adventure Animation Family Sci-Fi & Fantasy Keywords secret organization Content Score 71 Just a little bit more... Top Contributors O 18 Ozbourne 17 Norrin_Radd_Of_Zenn_La P 15 Peter 3 kappa-papa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}