{"link": "https://www.themoviedb.org/tv/71641?language=en", "title": "4 Blocks", "resume": "Based in Neukölln, Berlin Toni manages the daily business of dealing with the Arabic gangs and ends up wanting to leave his old life behind for his family, but as expected, its never that simple.", "rate": 73, "genre": ["Drama"], "cast": ["Frederick Lau", "Almila Bagriacik", "Oliver Masucci", "Emilio Sakraya"], "character": ["Vince", "Amara", "Hagen Kutscha", "Issam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71641   Expand 4 Blocks   (2017) User Score  Play Trailer Overview Based in Neukölln, Berlin Toni manages the daily business of dealing with the Arabic gangs and ends up wanting to leave his old life behind for his family, but as expected, its never that simple. Featured Crew Hanno Hackfort Creator Bob Konrad Creator Richard Kropf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frederick Lau Vince Almila Bagriacik Amara Oliver Masucci Hagen Kutscha Emilio Sakraya Issam Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of 4 Blocks premiered on May  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2008-01-19 Breaking Bad 8.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 25 luftikus009 T 6 Ticktock 4 Shuraaa G 3 GammPamm  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}