{"link": "https://www.themoviedb.org/tv/1698?language=en", "title": "Der Kommissar", "resume": "Der Kommissar is a German television series about a group of detectives of the Munich homicide squad. All 97 episodes, which were shot in black-and-white and first broadcast between 1969 and 1976, were written by Herbert Reinecker and starred Erik Ode as Kommissar Herbert Keller. Keller's assistants were Walter Grabert, Robert Heines, and Harry Klein who, in 1974, was replaced by his younger brother Erwin Klein.", "rate": 80, "genre": ["Drama", "Crime"], "cast": ["Erik Ode", "Günther Schramm", "Reinhard Glemnitz", "Helma Seitz", "Rosemarie Fendel"], "character": ["Kommissar Keller", "Walter Grabert", "Robert Heines", "Käthe Rehbein", "Frau Keller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1698   Expand Der Kommissar   (1969) User Score Overview Der Kommissar is a German television series about a group of detectives of the Munich homicide squad. All 97 episodes, which were shot in black-and-white and first broadcast between 1969 and 1976, were written by Herbert Reinecker and starred Erik Ode as Kommissar Herbert Keller. Keller's assistants were Walter Grabert, Robert Heines, and Harry Klein who, in 1974, was replaced by his younger brother Erwin Klein. Featured Crew Herbert Reinecker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erik Ode Kommissar Keller Günther Schramm Walter Grabert Reinhard Glemnitz Robert Heines Helma Seitz Käthe Rehbein Rosemarie Fendel Frau Keller Full Cast & Crew Last Season Season 8 1976 | 2 Episodes Season 8 of Der Kommissar premiered on January  2, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Der Kommissar. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  55m Homepage   http://www.kommissar-keller.de/ Genres Drama Crime Keywords murder Content Score 100 Yes! Looking good! Top Contributors S 646 Samara s 14 stesme 8 Elizabeth Jennings TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}