{"link": "https://www.themoviedb.org/tv/50878?language=en", "title": "Empresses In The Palace", "resume": "The Legend of Zhen Huan, also known as Hou Gong Zhen Huan Zhuan, is a Chinese television series based on the Internet novel of the same name. It first aired in China on 17 November 2011.\nIt was announced in 2013 that the drama will be exported to the U.S and re-edit into six TV movies and broadcast on mainstream TV channels in the U.S.", "rate": 80, "genre": ["Drama"], "cast": ["Sun Li", "Lan Xi", "Chen Jianbin", "Jiang Xin", "Mao Xiao Tong"], "character": ["Zhen Huan", "Shen Mei Zhuang", "Yongzheng Emperor", "Concubine Hua", "Ying Da Ying"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50878   Expand Empresses In The Palace   (2011) User Score Overview The Legend of Zhen Huan, also known as Hou Gong Zhen Huan Zhuan, is a Chinese television series based on the Internet novel of the same name. It first aired in China on 17 November 2011. It was announced in 2013 that the drama will be exported to the U.S and re-edit into six TV movies and broadcast on mainstream TV channels in the U.S. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sun Li Zhen Huan Lan Xi Shen Mei Zhuang Chen Jianbin Yongzheng Emperor Jiang Xin Concubine Hua Mao Xiao Tong Ying Da Ying Full Cast & Crew Last Season Season 1 2012 | 76 Episodes Season 1 of Empresses In The Palace premiered on March 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Empresses In The Palace. You can help by rating TV shows you've seen. Facts Original Name  后宫甄嬛传 Status  Ended Networks - Certification  - Type  Documentary Original Language  Chinese Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 sardy s 5 sleeve M 4 Maria180493 4 旧梦纷飞  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}