{"link": "https://www.themoviedb.org/tv/80251?language=en", "title": "Produce 48", "resume": "A survival reality television show in which the public “produces” a girl group by voting for members out of a pool of 96 trainees from Japan and South Korea, as well as voting for the group's concept, debut single, and group name.", "rate": 80, "genre": ["Reality"], "cast": ["Mako Kojima", "Sakura Miyawaki", "Lee Seung-gi", "Lee Hong-gi", "Soyou"], "character": ["Herself", "Herself", "Himself", "Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80251   Expand Produce 48   (2018) User Score Overview A survival reality television show in which the public “produces” a girl group by voting for members out of a pool of 96 trainees from Japan and South Korea, as well as voting for the group's concept, debut single, and group name. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mako Kojima Herself Sakura Miyawaki Herself Lee Seung-gi Himself Lee Hong-gi Himself Soyou Herself Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Produce 48 premiered on June 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Produce 48. You can help by rating TV shows you've seen. Facts Original Name  프로듀스 48 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  131m Homepage   https://sojuoppa.ga Genres Reality Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 17 afofrancis 6 Elizabeth Jennings 4 friend-series.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}