{"link": "https://www.themoviedb.org/tv/7496?language=en", "title": "The Singing Bee", "resume": "The Singing Bee is a karaoke game show that originally aired on NBC and now airs on CMT. Combining karaoke singing with a spelling bee-style competition, this show features contestants trying to remember the lyrics to popular songs. Originally slated to begin with a six episode series during the fall of 2007, it launched early in reaction to FOX's competing Don't Forget the Lyrics!.", "rate": 0, "genre": ["Music", "Reality"], "cast": ["Melissa Peterman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7496   Expand The Singing Bee   (2007) User Score Overview The Singing Bee is a karaoke game show that originally aired on NBC and now airs on CMT. Combining karaoke singing with a spelling bee-style competition, this show features contestants trying to remember the lyrics to popular songs. Originally slated to begin with a six episode series during the fall of 2007, it launched early in reaction to FOX's competing Don't Forget the Lyrics!. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melissa Peterman Full Cast & Crew Last Season Season 4 2011 | 1 Episode Season 4 of The Singing Bee premiered on April 29, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Singing Bee. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.thesingingbee.com/ Genres Music Reality Keywords karaoke song singing competition Content Score 56 We're so close, yet so far. Top Contributors 16 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}