{"link": "https://www.themoviedb.org/tv/34061?language=en", "title": "Chrno Crusade", "resume": "Chrono Crusade, in first position known as Chrno Crusade due to a typo in the original logo, is a Japanese manga series written and illustrated by Daisuke Moriyama. It was originally published by Kadokawa Shoten in Comic Dragon, then a special issue of the Dragon Magazine. A 24-episode anime television series based on the manga ran from 2003 to 2004 on Fuji TV. The animation work was done by Gonzo. The series was released in North America by ADV Manga and ADV Films, titled Chrono Crusade.\nSet in New York during the 1920s, Chrono Crusade follows the story of Rosette Christopher, and her demon partner Chrono. As members of the Magdalene Order, they travel around the country eliminating demonic threats to society, while Rosette searches for her lost brother Joshua.", "rate": 57, "genre": ["Drama", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Junko Minagawa", "Norio Wakamoto", "Michiko Neya", "Akira Ishida", "Tomomichi Nishimura"], "character": ["Joshua Christopher", "Duke Duffau", "Satella Harvenheit", "Chrono", "Edward Hamilton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34061   Expand Chrno Crusade   (2003) User Score Overview Chrono Crusade, in first position known as Chrno Crusade due to a typo in the original logo, is a Japanese manga series written and illustrated by Daisuke Moriyama. It was originally published by Kadokawa Shoten in Comic Dragon, then a special issue of the Dragon Magazine. A 24-episode anime television series based on the manga ran from 2003 to 2004 on Fuji TV. The animation work was done by Gonzo. The series was released in North America by ADV Manga and ADV Films, titled Chrono Crusade. Set in New York during the 1920s, Chrono Crusade follows the story of Rosette Christopher, and her demon partner Chrono. As members of the Magdalene Order, they travel around the country eliminating demonic threats to society, while Rosette searches for her lost brother Joshua. Featured Crew Morikawa Shigeru Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  16 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Minagawa Joshua Christopher Norio Wakamoto Duke Duffau Michiko Neya Satella Harvenheit Akira Ishida Chrono Tomomichi Nishimura Edward Hamilton Full Cast & Crew Last Season Season 1 2003 | 24 Episodes Season 1 of Chrno Crusade premiered on November 24, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  16 Posters  6 Recommendations   2005-10-08 Blood+ 7.0    2005-10-04 Hell Girl 7.0    2002-04-09 The Twelve Kingdoms 7.1    2004-07-25 Elfen Lied 7.6    1998-01-20 Dawson's Creek 6.0    2007-02-15 Naruto Shippūden 7.6    2002-10-03 Naruto 7.5  Facts Original Name  クロノクルセイド Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://animaxtv.co.za/shows/chrono-crusade Genres Drama Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 10 TheDerpMan J 8 JohnyB0y n 7 nakamas W 6 Wiruss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}