{"link": "https://www.themoviedb.org/tv/42413?language=en", "title": "Demon King Daimao", "resume": "Ichiban Ushiro no Dai Maō, also known as Demon King Daimao, is a Japanese light novel series written by Shotaro Mizuki and illustrated by Souichi Itō, published by Hobby Japan under their HJ Bunko imprint. The first volume was published on February 1, 2008, with a total of 11 volumes available as of December 2010. A manga adaptation began monthly serialization in the September 2008 issue of Akita Shoten's magazine Champion Red, and a 12-episode anime adaptation by Artland aired between April and June 2010 on Tokyo MX and other channels.", "rate": 73, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Takashi Kondō", "Youko Hikasa", "Aki Toyosaki", "Aoi Yuki", "Tsubasa Yonaga"], "character": ["Akuto Sai", "Junko Hattori", "Kena Soga", "Korone", "Hiroshi Miwa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42413   Expand Demon King Daimao   (2010) User Score Overview Ichiban Ushiro no Dai Maō, also known as Demon King Daimao, is a Japanese light novel series written by Shotaro Mizuki and illustrated by Souichi Itō, published by Hobby Japan under their HJ Bunko imprint. The first volume was published on February 1, 2008, with a total of 11 volumes available as of December 2010. A manga adaptation began monthly serialization in the September 2008 issue of Akita Shoten's magazine Champion Red, and a 12-episode anime adaptation by Artland aired between April and June 2010 on Tokyo MX and other channels. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takashi Kondō Akuto Sai Youko Hikasa Junko Hattori Aki Toyosaki Kena Soga Aoi Yuki Korone Tsubasa Yonaga Hiroshi Miwa Full Cast & Crew Last Season Season 1 2010 | 12 Episodes Season 1 of Demon King Daimao premiered on April  3, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   2006-07-03 The Familiar of Zero 8.6    2006-10-04 Negima!? Magister Negi Magi 5.9    2011-01-11 Is This a Zombie? 7.7    2005-01-06 Negima! Magister Negi Magi 6.7    2014-04-05 The Irregular at Magic High School 6.8    2012-04-05 Sankarea: Undying Love 7.0    2004-01-28 Winx Club 4.7    2007-04-13 Stigma of the Wind 8.1  Facts Original Name  いちばんうしろの大魔王 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.hobbyjapan.co.jp/hjbunko/daimaou/index.html Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords harem ecchi anime Content Score 86 Almost there... Top Contributors 18 sp1ti CM 14 Cherche Moi z 10 zurman1 c 6 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}