{"link": "https://www.themoviedb.org/tv/68101?language=en", "title": "Trickster", "resume": "It is the 2030s. The Boy Detectives Club gathers under Kogorō Akechi, the mysterious detective. The group solves cases great and small using their unique skills. One day, a member of the club, Kensuke Hanazaki, meets the boy Yoshio Kobayashi. Kobayashi's body cannot die due to the effects of the \"Unidentifiable Mist,\" but he yearns for death, and shirks from contact with other people. Taking an interest in him, Hanazaki invites him to join the Boy Detectives Club. Their meeting is connected to the fate tying together Kogorō Akechi, and the era's greatest villain, the Fiend With Twenty Faces.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Mystery"], "cast": ["Ryota Ohsaka", "Gackt Camui", "Daiki Yamashita"], "character": ["Kensuke Hanasaki (voice)", "Kaijin Nijuu Mensou (voice)", "Yoshio Kobayashi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68101   Expand Trickster   (2016) User Score Overview It is the 2030s. The Boy Detectives Club gathers under Kogorō Akechi, the mysterious detective. The group solves cases great and small using their unique skills. One day, a member of the club, Kensuke Hanazaki, meets the boy Yoshio Kobayashi. Kobayashi's body cannot die due to the effects of the \"Unidentifiable Mist,\" but he yearns for death, and shirks from contact with other people. Taking an interest in him, Hanazaki invites him to join the Boy Detectives Club. Their meeting is connected to the fate tying together Kogorō Akechi, and the era's greatest villain, the Fiend With Twenty Faces. Featured Crew Masahiro Mukai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryota Ohsaka Kensuke Hanasaki (voice) Gackt Camui Kaijin Nijuu Mensou (voice) Daiki Yamashita Yoshio Kobayashi (voice) Full Cast & Crew Last Season Season 1 2016 | 24 Episodes Season 1 of Trickster premiered on October  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Trickster. You can help by rating TV shows you've seen. Facts Original Name  Trickster -江戸川乱歩「少年探偵団」より- Status  In Production Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://trickster-project.com/anime/ Genres Action & Adventure Animation Mystery Keywords mystery animation Content Score 64 We're so close, yet so far. Top Contributors 24 iliass guendouz 11 Elizabeth Jennings 9 ioneakatzuki s 9 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}