{"link": "https://www.themoviedb.org/tv/509?language=en", "title": "CHiPs", "resume": "CHiPs is an American television drama series produced by MGM Studios that originally aired on NBC from September 15, 1977, to July 17, 1983. CHiPs followed the lives of two motorcycle police officers of the California Highway Patrol. The series ran for 139 episodes over six seasons.", "rate": 66, "genre": ["Drama", "Action", "Adventure"], "cast": ["Larry Wilcox", "Erik Estrada", "Robert Pine", "Paul Linke", "Michael Dorn"], "character": ["Officer Jon Baker", "Officer Frank Poncherello", "Sgt. Joseph Getraer", "Officer Arthur Grossman", "Officer Jebediah Turner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 509   Expand CHiPs   (1977) User Score  Play Trailer Overview CHiPs is an American television drama series produced by MGM Studios that originally aired on NBC from September 15, 1977, to July 17, 1983. CHiPs followed the lives of two motorcycle police officers of the California Highway Patrol. The series ran for 139 episodes over six seasons. Featured Crew Rick Rosner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  17 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry Wilcox Officer Jon Baker Erik Estrada Officer Frank Poncherello Robert Pine Sgt. Joseph Getraer Paul Linke Officer Arthur Grossman Michael Dorn Officer Jebediah Turner Full Cast & Crew Last Season Season 6 1982 | 22 Episodes Season 6 of CHiPs premiered on October 10, 1982. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply conecton  with   star trek Open 1 by  rycki1138 favorite charector Open 0 by manfromatlantis\n      \n     the  car chases Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  17 Posters  8 Recommendations   1977-01-14 Fantasy Island 6.5    1976-01-14 The Bionic Woman 6.2    1974-01-18 The Six Million Dollar Man 6.6    1978-11-03 Diff'rent Strokes 5.7    1976-01-27 Laverne & Shirley 6.7    1979-09-22 Hart to Hart 6.5    1965-09-18 I Dream of Jeannie 7.1    1963-09-29 My Favorite Martian 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  48m Homepage  - Genres Drama Action & Adventure Keywords california police Content Score 100 Yes! Looking good! Top Contributors 30 Banana d 9 denis 5 DarkMan T 3 Tommy2015  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}