{"link": "https://www.themoviedb.org/tv/68380?language=en", "title": "Dream Corp, LLC", "resume": "Helmed by the easily distracted Dr. Roberts, a psychotherapeutic facility treats patients with troubling dreams. Roberts employs a team of incompetent scientists to help analyze and record those thoughts plaguing the doctor's patients.", "rate": 60, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Jon Gries"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68380   Expand Dream Corp, LLC   (2016) User Score  Play Trailer Overview Helmed by the easily distracted Dr. Roberts, a psychotherapeutic facility treats patients with troubling dreams. Roberts employs a team of incompetent scientists to help analyze and record those thoughts plaguing the doctor's patients. Featured Crew Daniel Stessen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Gries Full Cast & Crew Last Season Season 1 2016 | 7 Episodes Season 1 of Dream Corp, LLC premiered on October 24, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dream Corp, LLC. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dream Corp, LLC. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  15m Homepage   http://www.adultswim.com/videos/dream-corp-llc/ Genres Action & Adventure Animation Comedy Keywords live comedy psychosis psychedelic live action and animation emotions Content Score 71 Just a little bit more... Top Contributors MP 41 Mr Pokekmen 11 Bryan Bortz 3 Maretoh f 1 fermen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}