{"link": "https://www.themoviedb.org/tv/5341?language=en", "title": "Dogtanian and the Three Muskehounds", "resume": "Dogtanian and the Three Muskehounds is an animated cartoon adaptation of the classic Alexandre Dumas story of d'Artagnan and The Three Musketeers. Most of the characters are anthropomorphizations of dogs, hence the title of the cartoon; although there are a few exceptions, most notably Dogtanian's two sidekicks Pip the mouse and Planchet the bear, among several others.", "rate": 74, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Eduardo Jover", "Gloria Cámara", "Jesus Nieto", "José Luis Gil", "Manuel Peiró"], "character": ["Dogtanian (voice)", "Juliette (voice)", "Porthos [Pontos] (voice)", "Aramis [Amis] (voice)", "Athos [Dogos] (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5341   Expand Dogtanian and the Three Muskehounds   (1981) User Score Overview Dogtanian and the Three Muskehounds is an animated cartoon adaptation of the classic Alexandre Dumas story of d'Artagnan and The Three Musketeers. Most of the characters are anthropomorphizations of dogs, hence the title of the cartoon; although there are a few exceptions, most notably Dogtanian's two sidekicks Pip the mouse and Planchet the bear, among several others. Featured Crew Claudio Biern Boyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eduardo Jover Dogtanian (voice) Gloria Cámara Juliette (voice) Jesus Nieto Porthos [Pontos] (voice) José Luis Gil Aramis [Amis] (voice) Manuel Peiró Athos [Dogos] (voice) Full Cast & Crew Last Season Season 1 1981 | 26 Episodes Season 1 of Dogtanian and the Three Muskehounds premiered on October  9, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   1982-09-24 Meister Eder und sein Pumuckl 5.6    1984-09-05 Heathcliff & the Catillac Cats 5.4    1983-08-01 Around the World with Willy Fog 7.8    1976-01-04 From the Apennines to the Andes 6.0    1988-09-06 Count Duckula 6.9    1979-04-02 Doraemon 5.6    1974-01-06 Heidi, Girl of the Alps 7.3    1960-11-14 Popeye the Sailor 5.8  Facts Original Name  D'Artacan y los Tres Mosqueperros Status  Ended Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  24m Homepage   http://www.nipponanimation.com/catalogue/036/index.html Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords france musketeer cartoon dog 17th century Content Score 93 Almost there... Top Contributors 91 BrerFox 13 Banana W 10 Wolfman z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}