{"link": "https://www.themoviedb.org/tv/66349?language=en", "title": "My Amazing Boyfriend", "resume": "How far back do their destinies cross in history? Xue Ling Qiao is a mutant man with superpowers who has been roaming the Earth for 500 years but has been trapped in a deep sleep for the past 100 years. When B-actress Tian Jing Zhi gets into a car accident, Ling Qiao is released from his sleep trap. He uses his powers to heal her wounds and bring her back to life. With nowhere else to go, Ling Qiao forces his way into rooming with Jing Zhi in her apartment, becoming embroiled in her crazy world of trying to make it as an actress under the shadows of a perfect A-list star. As they bicker their way to a better relationship, they are shocked to learn that their fates have been entangled by a conspiracy that spans many centuries!", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Kim Tae-Hwan", "Janice Wu", "Xu Ke", "Lily Tien"], "character": ["Xue Ling Qiao", "Tian Jing Zhi", "Ye Chen", "Tian Jing Zhi's mother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66349   Expand My Amazing Boyfriend   (2016) User Score Overview How far back do their destinies cross in history? Xue Ling Qiao is a mutant man with superpowers who has been roaming the Earth for 500 years but has been trapped in a deep sleep for the past 100 years. When B-actress Tian Jing Zhi gets into a car accident, Ling Qiao is released from his sleep trap. He uses his powers to heal her wounds and bring her back to life. With nowhere else to go, Ling Qiao forces his way into rooming with Jing Zhi in her apartment, becoming embroiled in her crazy world of trying to make it as an actress under the shadows of a perfect A-list star. As they bicker their way to a better relationship, they are shocked to learn that their fates have been entangled by a conspiracy that spans many centuries! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Tae-Hwan Xue Ling Qiao Janice Wu Tian Jing Zhi Xu Ke Ye Chen Lily Tien Tian Jing Zhi's mother Full Cast & Crew Last Season Season 1 2016 | 28 Episodes Season 1 of My Amazing Boyfriend premiered on April 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Amazing Boyfriend. You can help by rating TV shows you've seen. Facts Original Name  我的奇妙男友 Status  Ended Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords china romance Content Score 86 Almost there... Top Contributors M 24 Maria180493 W 9 WonderfulError z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}