{"link": "https://www.themoviedb.org/tv/43702?language=en", "title": "Katri, Girl of the Meadows", "resume": "Katri, Girl of the Meadows is an anime series based on the Finnish novel, \"Paimen, piika ja emäntä\" by Auni Nuolivaara. The series was broadcast originally in Japan in 1984 as part of the children's anthology series World Masterpiece Theater, also known simply as \"Meisaku\" from Nippon Animation. The anthology had before and after produced a great variety of animated series based on different children's novels from around the world; among them were \"My Annette: Story of the Alps\" and \"Little Princess Sara\". In Europe, where \"World Masterpiece Theater\" series have found huge success, \"Katri, Girl of the Meadows\" made its way to different countries including Spain, Italy, France and Germany. The series has never been broadcast or published in Finland where it remains mostly unknown.", "rate": 0, "genre": ["Drama", "Animation"], "cast": ["Hitomi Oikawa", "Hisako Kyouda", "Kumiko Takizawa", "Naoki Tatsuta", "Tōru Furuya"], "character": ["Katri Ukonniemi (voice)", "Ilda", "Lotta Kuusela (voice)", "Abel", "Martti Halmich (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43702   Expand Katri, Girl of the Meadows   (1984) User Score Overview Katri, Girl of the Meadows is an anime series based on the Finnish novel, \"Paimen, piika ja emäntä\" by Auni Nuolivaara. The series was broadcast originally in Japan in 1984 as part of the children's anthology series World Masterpiece Theater, also known simply as \"Meisaku\" from Nippon Animation. The anthology had before and after produced a great variety of animated series based on different children's novels from around the world; among them were \"My Annette: Story of the Alps\" and \"Little Princess Sara\". In Europe, where \"World Masterpiece Theater\" series have found huge success, \"Katri, Girl of the Meadows\" made its way to different countries including Spain, Italy, France and Germany. The series has never been broadcast or published in Finland where it remains mostly unknown. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hitomi Oikawa Katri Ukonniemi (voice) Hisako Kyouda Ilda Kumiko Takizawa Lotta Kuusela (voice) Naoki Tatsuta Abel Tōru Furuya Martti Halmich (voice) Full Cast & Crew Last Season Season 1 1984 | 49 Episodes Season 1 of Katri, Girl of the Meadows premiered on January  8, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Katri, Girl of the Meadows. You can help by rating TV shows you've seen. Facts Original Name  牧場の少女カトリ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Drama Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 63 BrerFox b 8 baux D 4 Deepjungle c 3 chloris77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}