{"link": "https://www.themoviedb.org/tv/4684?language=en", "title": "Ozzy & Drix", "resume": "Ozzy & Drix, also known as The Fantastic Voyage Adventures of Osmosis Jones & Drixenol and Osmosis Jones: The Animated Series, is an American animated television series based on the Warner Bros. film Osmosis Jones and it was produced by Warner Bros. Animation. It takes place inside the body of teenager Hector Cruz. The series premiered on September 14, 2002 on the Kids' WB; the final episode aired July 5, 2004. Unlike the original movie it spun off from, Ozzy & Drix was entirely animated and contained no live action. It stars Phil LaMarr as the replacement for Chris Rock as Osmosis Jones, and Jeff Bennett as the replacement for David Hyde Pierce as Drix. As of July 2011, episodes of the series are still available via the Kids WB website. The show also aired on Teletoon in Canada. The show is also slightly less violent than the movie, having the characters treated like people rather than simply cells, and having none of them killed off, unlike the movie where Thrax managed to kill off several cells. There are also new characters that replace the ones from the original movie such as Maria Amino replacing Leah Estrogen, Mayor Spryman replacing Mayor Phlegmming, Sylvian Fischer replacing Tom Colonic, Chief Gluteus replacing The Chief of Police, The Mole replacing Chill the Flu Shot and Scarlet Fever replacing Thrax.", "rate": 77, "genre": ["Family", "Animation", "Comedy"], "cast": ["Jeff Bennett", "Phil LaMarr", "Tasia Valenza", "Vivica A. Fox", "Jim Cummings"], "character": ["Drix (voice)", "Osmosis Jones (voice)", "Maria Amino (voice)", "Ellen Patella (voice)", "Police Chief Gluteus (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4684   Expand Ozzy & Drix   (2002) User Score Overview Ozzy & Drix, also known as The Fantastic Voyage Adventures of Osmosis Jones & Drixenol and Osmosis Jones: The Animated Series, is an American animated television series based on the Warner Bros. film Osmosis Jones and it was produced by Warner Bros. Animation. It takes place inside the body of teenager Hector Cruz. The series premiered on September 14, 2002 on the Kids' WB; the final episode aired July 5, 2004. Unlike the original movie it spun off from, Ozzy & Drix was entirely animated and contained no live action. It stars Phil LaMarr as the replacement for Chris Rock as Osmosis Jones, and Jeff Bennett as the replacement for David Hyde Pierce as Drix. As of July 2011, episodes of the series are still available via the Kids WB website. The show also aired on Teletoon in Canada. The show is also slightly less violent than the movie, having the characters treated like people rather than simply cells, and having none of them killed off, unlike the movie where Thrax managed to kill off several cells. There are also new characters that replace the ones from the original movie such as Maria Amino replacing Leah Estrogen, Mayor Spryman replacing Mayor Phlegmming, Sylvian Fischer replacing Tom Colonic, Chief Gluteus replacing The Chief of Police, The Mole replacing Chill the Flu Shot and Scarlet Fever replacing Thrax. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Bennett Drix (voice) Phil LaMarr Osmosis Jones (voice) Tasia Valenza Maria Amino (voice) Vivica A. Fox Ellen Patella (voice) Jim Cummings Police Chief Gluteus (voice) Full Cast & Crew Last Season Season 2 2003 | 13 Episodes Season 2 of Ozzy & Drix premiered on August 23, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2001-08-11 Cubix 4.3    2001-06-08 Time Squad 6.4    2004-11-19 Hi Hi Puffy AmiYumi 4.0    2003-11-01 Xiaolin Showdown 6.9    2005-12-26 My Gym Partner's a Monkey 5.0    2002-09-14 What's New, Scooby-Doo? 7.0    2004-08-13 Foster's Home for Imaginary Friends 6.8    2002-12-06 Codename: Kids Next Door 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m, 22m Homepage  - Genres Family Animation Comedy Keywords human body tiny Content Score 86 Almost there... Top Contributors 18 Banana 14 lineker A 3 AnthonyAtkins232 E 3 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}