{"link": "https://www.themoviedb.org/tv/73254?language=en", "title": "Love Actually", "resume": "It’s a story about the eras of the 70s, 80s and 90s; about the rapid development of the great era of love and how to deal with the success and failure of life, self-growth and self-transformation. It’s a drama genre of modern day city life; about singles’ rigid pursuit of love; about the lives of a group of ordinary people. It avoids dramatic negative energy. Instead, it’ll bring forth positive energy to encourage men and women to move positively forward in life and love.", "rate": 47, "genre": ["Drama"], "cast": ["Joe Chen", "Tong Dawei", "Wang Yibo"], "character": ["An Qing Huan", "Ding Ren Jian", "Zhai Zhi Wei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73254   Expand Love Actually   (2017) User Score Overview It’s a story about the eras of the 70s, 80s and 90s; about the rapid development of the great era of love and how to deal with the success and failure of life, self-growth and self-transformation. It’s a drama genre of modern day city life; about singles’ rigid pursuit of love; about the lives of a group of ordinary people. It avoids dramatic negative energy. Instead, it’ll bring forth positive energy to encourage men and women to move positively forward in life and love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Chen An Qing Huan Tong Dawei Ding Ren Jian Wang Yibo Zhai Zhi Wei Full Cast & Crew Last Season Season 1 2017 | 28 Episodes Season 1 of Love Actually premiered on August 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Love Actually. You can help by rating TV shows you've seen. Facts Original Name  人间至味是清欢 Status  Returning Series Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/rjzwsqh Genres Drama Keywords china romance Content Score 56 We're so close, yet so far. Top Contributors M 33 Maria180493 TB 2 TMDb Bot l 1 lovejohncn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}