{"link": "https://www.themoviedb.org/tv/61838?language=en", "title": "Barbie: Life in the Dreamhouse", "resume": "The series is set as a reality TV-esque show following Barbie, her sisters and her friends in the day-to-day activities that take place in the Dreamhouse and surrounding areas. Much of the humor in the show derives from parodying and lampooning both the traditional reality TV format and the Barbie franchise itself.", "rate": 75, "genre": ["Animation", "Family"], "cast": ["Kate Higgins", "Sean Hankinson"], "character": ["Barbie", "Ken"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61838   Expand Barbie: Life in the Dreamhouse   (2012) User Score Overview The series is set as a reality TV-esque show following Barbie, her sisters and her friends in the day-to-day activities that take place in the Dreamhouse and surrounding areas. Much of the humor in the show derives from parodying and lampooning both the traditional reality TV format and the Barbie franchise itself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Higgins Barbie Sean Hankinson Ken Full Cast & Crew Last Season Season 4 2015 | 13 Episodes Season 4 of Barbie: Life in the Dreamhouse premiered on April 17, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply This is actually quite fun Open 0 by Marr 🇳🇱\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2013-07-28 Inside the American Mob 8.2  Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  3m Homepage  - Genres Animation Family Keywords house barbie breaking the fourth wall cgi female protagonist Content Score 56 We're so close, yet so far. Top Contributors 148 Marr 🇳🇱 c 48 cdizzel99 7 lol32lol 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}