{"link": "https://www.themoviedb.org/tv/70636?language=en", "title": "Clockwork Planet", "resume": "One day, a black box suddenly crashed into the house of the high school dropout Naoto Miura. Inside it was a female automaton. The endless cycle of failure and success.\nThe world that does change and the mankind that does not change. At a time where reality and fantasy are screaming, the encounters of these two make the gears of fate move!", "rate": 61, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Ai Kakuma", "Yoshino Nanjou", "Saori Oonishi", "Sayaka Senbongi"], "character": ["RyuZU", "Naoto Miura", "Marie Bell Breguet", "AnchoR"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70636   Expand Clockwork Planet   (2017) User Score Overview One day, a black box suddenly crashed into the house of the high school dropout Naoto Miura. Inside it was a female automaton. The endless cycle of failure and success. The world that does change and the mankind that does not change. At a time where reality and fantasy are screaming, the encounters of these two make the gears of fate move! Featured Crew Tsubaki Himana Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ai Kakuma RyuZU Yoshino Nanjou Naoto Miura Saori Oonishi Marie Bell Breguet Sayaka Senbongi AnchoR Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Clockwork Planet premiered on April  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2015-01-04 Absolute Duo 7.6    2016-01-08 Divine Gate 5.3    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2017-07-12 My First Girlfriend is a Gal 7.4    2017-01-11 Hand Shakers 6.9    2017-04-01 The Silver Guardian 6.4    2015-10-03 Chivalry of a Failed Knight 7.9    2017-07-04 Tsuredure Children 8.0  Facts Original Name  クロックワーク・プラネット Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/cp/ Genres Animation Action & Adventure Sci-Fi & Fantasy Keywords based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 24 TenmaWorks 15 sp1ti 8 YareYareDaze2 Z 6 Zayrus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}