{"link": "https://www.themoviedb.org/tv/32377?language=en", "title": "Armored Trooper Votoms", "resume": "Armored Trooper VOTOMS is a 52-episode anime television series, created by Ryosuke Takahashi, Sunrise and Tatsunoko Production, and produced by Tatsunoko's Kenji Yoshida, featuring mechanical designs by Kunio Okawara. The series originally aired in Japan from April 1, 1983 to March 23, 1984 on TV Tokyo. Following directly in the footsteps of Takahashi's previous hit series, Fang of the Sun Dougram, VOTOMS continued the trend towards hard science in the mecha anime sub-genre. The televised series focuses on the story of stoic Armored Trooper pilot Chirico Cuvie and his quest for answers after a sudden betrayal leaves him on the run from his own military. The series was supplemented by numerous original video animation releases, and also inspired a number of spin-off works whose media ranges from serialized light novels to video games.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Hozumi Gouda", "Kazuko Yanaga", "Kousei Tomita", "Shigeru Chiba", "Yōko Kawanami"], "character": ["Chirico Cuvie", "Phantom Lady Fyana", "Bouleuse Gotho", "Vanila Varta", "Coconna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32377   Expand Armored Trooper Votoms   (1983) User Score Overview Armored Trooper VOTOMS is a 52-episode anime television series, created by Ryosuke Takahashi, Sunrise and Tatsunoko Production, and produced by Tatsunoko's Kenji Yoshida, featuring mechanical designs by Kunio Okawara. The series originally aired in Japan from April 1, 1983 to March 23, 1984 on TV Tokyo. Following directly in the footsteps of Takahashi's previous hit series, Fang of the Sun Dougram, VOTOMS continued the trend towards hard science in the mecha anime sub-genre. The televised series focuses on the story of stoic Armored Trooper pilot Chirico Cuvie and his quest for answers after a sudden betrayal leaves him on the run from his own military. The series was supplemented by numerous original video animation releases, and also inspired a number of spin-off works whose media ranges from serialized light novels to video games. Featured Crew Ryōsuke Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hozumi Gouda Chirico Cuvie Kazuko Yanaga Phantom Lady Fyana Kousei Tomita Bouleuse Gotho Shigeru Chiba Vanila Varta Yōko Kawanami Coconna Full Cast & Crew Last Season Armored Trooper Votoms: Phantom Arc 2010 | 6 Episodes Season 4 of Armored Trooper Votoms premiered on March 26, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Armored Trooper Votoms. You can help by rating TV shows you've seen. Facts Original Name  装甲騎兵ボトムズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 17 YabukiJoe1 t 11 tmdb983464 11 BrerFox S 3 Snickt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}