{"link": "https://www.themoviedb.org/tv/13555?language=en", "title": "Roots", "resume": "The epic tale of celebrated Pulitzer-prize winning author Alex Haley's ancestors as portrayed in the acclaimed twelve hour mini-series Roots, was first told in his 1976 bestseller Roots: The Saga of an American Family. The docu-drama covers a period of history that begins in mid-1700s Gambia, West Africa and concludes during post-Civil War United States, over 100 years later. This 1977 miniseries eventually won 9 Emmy awards, a Golden Globe award, and a Peabody award, and still stands as the most watched miniseries in U.S. history.", "rate": 77, "genre": ["Drama"], "cast": ["Ben Vereen", "LeVar Burton", "Cicely Tyson", "John Amos", "Sandy Duncan"], "character": ["Chicken George Moore", "Kunta Kinte", "Binta", "Toby", "Missy Anne Reynolds"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13555   Expand Roots   (1977) User Score  Play Trailer Overview The epic tale of celebrated Pulitzer-prize winning author Alex Haley's ancestors as portrayed in the acclaimed twelve hour mini-series Roots, was first told in his 1976 bestseller Roots: The Saga of an American Family. The docu-drama covers a period of history that begins in mid-1700s Gambia, West Africa and concludes during post-Civil War United States, over 100 years later. This 1977 miniseries eventually won 9 Emmy awards, a Golden Globe award, and a Peabody award, and still stands as the most watched miniseries in U.S. history. Featured Crew Alex Haley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Vereen Chicken George Moore LeVar Burton Kunta Kinte Cicely Tyson Binta John Amos Toby Sandy Duncan Missy Anne Reynolds Full Cast & Crew Last Season Season 1 1977 | 8 Episodes Season 1 of Roots premiered on January 23, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   Decker 4.8    1981-12-04 Falcon Crest 4.2    2004-11-08 Sarabhai vs Sarabhai 5.6    1973-10-24 Kojak 7.4    1970-09-16 McCloud 7.0    1968-09-22 Land of the Giants 6.3    2016-09-22 Paranoid 6.4    1993-09-10 Bill Nye The Science Guy 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Drama Keywords africa slavery plantation family history miniseries historical drama captivity genealogy Content Score 100 Yes! Looking good! Top Contributors 9 genplant29 9 Elizabeth Jennings z 8 zurman1 5 LuX  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}