{"link": "https://www.themoviedb.org/tv/5314?language=en", "title": "The Company", "resume": "The Company tells the thrilling story of Cold War CIA agents imprisoned in double lives, fighting an amoral, elusive, formidable enemy – and each other – in an internecine battle within the Company itself.", "rate": 70, "genre": ["Action", "Adventure", "Drama"], "cast": ["Chris O'Donnell", "Alfred Molina", "Michael Keaton", "Alessandro Nivola", "Rory Cochrane"], "character": ["Jack McAuliffe", "Harvey Torriti / 'The Sorcerer'", "James Jesus Angleton/ 'Mother'", "Leo Kritzky", "Yevgeny Tsipin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5314   Expand The Company   (2007) User Score Overview The Company tells the thrilling story of Cold War CIA agents imprisoned in double lives, fighting an amoral, elusive, formidable enemy – and each other – in an internecine battle within the Company itself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris O'Donnell Jack McAuliffe Alfred Molina Harvey Torriti / 'The Sorcerer' Michael Keaton James Jesus Angleton/ 'Mother' Alessandro Nivola Leo Kritzky Rory Cochrane Yevgeny Tsipin Full Cast & Crew Last Season Season 1 2007 | 3 Episodes Season 1 of The Company premiered on August  5, 2007. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Company. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   1987-11-04 A Perfect Spy 5.5    2006-01-01 In Justice 6.8    2015-04-15 The Delivery Man 6.5    2011-01-13 Kidnap and Ransom 7.6    2011-06-05 Case Histories 8.2    2012-08-30 Good Cop 6.6    2012-03-05 Dirk Gently 8.1    2013-05-12 Family Tree 6.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  95m Homepage   http://www.tnt.tv/series/thecompany/ Genres Action & Adventure Drama Keywords cia based on novel or book spy cold war miniseries Content Score 86 Almost there... Top Contributors 46 United600 F 26 FreemanSH TB 17 TMDb Bot 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}