{"link": "https://www.themoviedb.org/tv/67396?language=en", "title": "Too Close to Home", "resume": "A young woman is forced to return to her trailer-park beginnings after her political career is derailed by a sex scandal.", "rate": 46, "genre": ["Drama"], "cast": ["Danielle Savre", "Trisha Rae Stahl", "Kelly Sullivan", "Brooke Anne Smith", "Brock O'Hurn"], "character": ["Anna", "Jolene", "Bonnie", "Shelby", "Brody"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67396   Expand Too Close to Home   (2016) User Score  Play Trailer Overview A young woman is forced to return to her trailer-park beginnings after her political career is derailed by a sex scandal. Featured Crew Tyler Perry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danielle Savre Anna Trisha Rae Stahl Jolene Kelly Sullivan Bonnie Brooke Anne Smith Shelby Brock O'Hurn Brody Full Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Too Close to Home premiered on January  4, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Just started watching... Open 2 by  Kaleecee So, Tina attacks Shelby but doesn't do anything to Regina? Open 1 by  marcdilworth Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Too Close to Home. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  46m Homepage   http://www.tlc.com/tv-shows/too-close-to-home/ Genres Drama Keywords hometown fall from grace return home Content Score 100 Yes! Looking good! Top Contributors 31 Elizabeth Jennings 4 Banana 4 United600 z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}