{"link": "https://www.themoviedb.org/tv/34158?language=en", "title": "Magic Knight Rayearth", "resume": "Magic Knight Rayearth is a Japanese manga series created by Clamp, an all-female manga artist team consisting of Satsuki Igarashi, Ageha Ohkawa, Tsubaki Nekoi and Mokona. Appearing as a serial in the manga magazine Nakayoshi from the November 1993 issue to the February 1995 issue, the chapters of Magic Knight Rayearth were collected into three bound volumes by Kodansha, and published from July 1994 to March 1995. A sequel was serialized in the same manga magazine from the March 1995 issue to the April 1996 issue, and was published by Kodansha in three bound volumes from to July 1995 to April 1996. The series follows three eighth-grade girls who find themselves transported from modern-day Japan into a magical world, where they are tasked with rescuing a princess.\nRayearth combines elements from the magical girl and mecha anime genres with parallel world fantasy. The manga was adapted into two anime series in 1994 and an original video animation in 1997.", "rate": 84, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure", "Drama", "Comedy"], "cast": ["Yukimasa Kishino", "Yuka Imai", "Chinami Nishimura", "Jun'ichi Kanemaru", "Yuri Shiratori"], "character": ["Lafarga", "Mira", "Lady Aska", "Zazu Torque", "Primera"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34158   Expand Magic Knight Rayearth   (1994) User Score Overview Magic Knight Rayearth is a Japanese manga series created by Clamp, an all-female manga artist team consisting of Satsuki Igarashi, Ageha Ohkawa, Tsubaki Nekoi and Mokona. Appearing as a serial in the manga magazine Nakayoshi from the November 1993 issue to the February 1995 issue, the chapters of Magic Knight Rayearth were collected into three bound volumes by Kodansha, and published from July 1994 to March 1995. A sequel was serialized in the same manga magazine from the March 1995 issue to the April 1996 issue, and was published by Kodansha in three bound volumes from to July 1995 to April 1996. The series follows three eighth-grade girls who find themselves transported from modern-day Japan into a magical world, where they are tasked with rescuing a princess. Rayearth combines elements from the magical girl and mecha anime genres with parallel world fantasy. The manga was adapted into two anime series in 1994 and an original video animation in 1997. Featured Crew Nanase Ohkawa Creator Tsubaki Nekoi Creator Mokona Apapa Creator Satsuki Igarashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yukimasa Kishino Lafarga Yuka Imai Mira Chinami Nishimura Lady Aska Jun'ichi Kanemaru Zazu Torque Yuri Shiratori Primera Full Cast & Crew Last Season Season 2 1995 | 29 Episodes Season 2 of Magic Knight Rayearth premiered on April 10, 1995. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Magic Knight Rayearth. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Magic Knight Rayearth. You can help by rating TV shows you've seen. Facts Original Name  魔法騎士レイアース Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Animation Action & Adventure Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 13 tmdb983464 6 BlackDelivery 4 Jaime Neto p 3 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}