{"link": "https://www.themoviedb.org/tv/62783?language=en", "title": "Best Friends Whenever", "resume": "The live-action comedy follows best friends Shelby and Cyd who, when their aspiring scientist friend Barry’s invention goes awry, gain the power to leap forward and backward in time whenever they want – and sometimes when they don’t. Now, they experience the twists and turns of friendship and must decide between fixing mistakes in the past or catching a glimpse of the future. While Barry and his assistant, Naldo, try to figure out how to replicate time travel for themselves, Cyd and Shelby use their newfound power to navigate high school life and Shelby’s mischievous twin brothers, Bret and Chet.", "rate": 69, "genre": ["Comedy", "Family", "Sci-Fi", "Fantasy"], "cast": ["Landry Bender", "Lauren Taylor", "Gus Kamp", "Benjamin Cole Royer", "Matthew Lewis Royer"], "character": ["Cyd Ripley", "Shelby Marcus", "Barry Eisenberg", "Bret Marcus", "Chet Marcus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62783   Expand Best Friends Whenever   (2015) User Score Overview The live-action comedy follows best friends Shelby and Cyd who, when their aspiring scientist friend Barry’s invention goes awry, gain the power to leap forward and backward in time whenever they want – and sometimes when they don’t. Now, they experience the twists and turns of friendship and must decide between fixing mistakes in the past or catching a glimpse of the future. While Barry and his assistant, Naldo, try to figure out how to replicate time travel for themselves, Cyd and Shelby use their newfound power to navigate high school life and Shelby’s mischievous twin brothers, Bret and Chet. Featured Crew Scott Thomas Creator Jed Elinoff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Landry Bender Cyd Ripley Lauren Taylor Shelby Marcus Gus Kamp Barry Eisenberg Benjamin Cole Royer Bret Marcus Matthew Lewis Royer Chet Marcus Full Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of Best Friends Whenever premiered on July 25, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Cyd: Happy Birthday Landry Bender! Open 0 by wonder2wonder\n      \n     w Barry: Happy Birthday Gus Kamp! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2013-12-24 Turbo FAST 4.7    2016-08-12 Ask the Storybots 7.5    2015-08-07 Project Mc² 4.7    2013-07-19 Liv and Maddie 6.1    2014-01-06 Some Assembly Required 4.7    2009-04-05 Beyblade: Metal Fusion 3.8  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  23m Homepage   http://disneychannel.disney.com/best-friends-whenever Genres Comedy Family Sci-Fi & Fantasy Keywords high school time travel teenager Content Score 93 Almost there... Top Contributors 39 Elizabeth Jennings 8 Banana CM 8 Cherche Moi w 6 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}