{"link": "https://www.themoviedb.org/tv/62630?language=en", "title": "Love Once Again", "resume": "Zeynep gets married to a man whom her family does not approve and goes to the U.S.A to live there. She gives a birth to a baby boy but when her marriage does not go well she decides to return to Turkey as devastated. Fatih, on the other hand, comes from a rich family and goes to the U.S.A. to study. But, he does not find what he has expected and decides to go back to Turkey. These two people from different backgrounds come across to each other at the same flight to Turkey. They make a marriage agreement on the flight. Fatih wants Zeynep to pretend his wife because his family forces him to get married to Irem. He wants his freedom back. Zeynep, on the other hand, does not want to ask help from her family so, she accepts Fatih’s offer.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["Özge Özpirinçci", "Buğra Gülsoy", "Tamer Levent", "Nilay Deniz", "Can Sipahi"], "character": ["Zeynep Taşkın", "Fatih Şekercizade", "Şevket Taşkın (Reis)", "Selin Şekercizade", "Orhan Günay"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62630   Expand  Love Once Again   (2015) User Score  Play Trailer Overview Zeynep gets married to a man whom her family does not approve and goes to the U.S.A to live there. She gives a birth to a baby boy but when her marriage does not go well she decides to return to Turkey as devastated. Fatih, on the other hand, comes from a rich family and goes to the U.S.A. to study. But, he does not find what he has expected and decides to go back to Turkey. These two people from different backgrounds come across to each other at the same flight to Turkey. They make a marriage agreement on the flight. Fatih wants Zeynep to pretend his wife because his family forces him to get married to Irem. He wants his freedom back. Zeynep, on the other hand, does not want to ask help from her family so, she accepts Fatih’s offer. Featured Crew Ersoy Güler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Özge Özpirinçci Zeynep Taşkın Buğra Gülsoy Fatih Şekercizade Tamer Levent Şevket Taşkın (Reis) Nilay Deniz Selin Şekercizade Can Sipahi Orhan Günay Full Cast & Crew Last Season Season 2 2015 | 16 Episodes Season 2 of  Love Once Again premiered on September 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on  Love Once Again. You can help by rating TV shows you've seen. Facts Original Name  Aşk Yeniden Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors V 37 Vaine 16 Gorke07 A 13 Alenp 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}