{"link": "https://www.themoviedb.org/tv/5018?language=en", "title": "Password", "resume": "Password is an American television game show which was created by Bob Stewart for Goodson-Todman Productions. The host was Allen Ludden, who had previously been well known as the host of the G.E. College Bowl.\nPassword originally aired for 1,555 daytime telecasts each weekday from October 2, 1961 to September 15, 1967 on CBS, along with weekly prime time airings from January 2, 1962 to September 9, 1965 and December 25, 1966 to May 22, 1967. An additional 1,099 daytime shows aired from April 5, 1971 to June 27, 1975 on ABC.\nThe show's announcers were Jack Clark and Lee Vines on CBS and John Harlan on ABC.\nTwo revivals later aired on NBC from 1979–1982 and 1984–1989, followed by a prime time version on CBS from 2008–2009.\nIn 2013, TV Guide ranked it #8 in its list of the 60 greatest game shows ever.", "rate": 80, "genre": ["Reality"], "cast": ["Betty White", "Allen Ludden", "Gene Wood", "Jack Clark"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5018   Expand Password   (1961) User Score Overview Password is an American television game show which was created by Bob Stewart for Goodson-Todman Productions. The host was Allen Ludden, who had previously been well known as the host of the G.E. College Bowl. Password originally aired for 1,555 daytime telecasts each weekday from October 2, 1961 to September 15, 1967 on CBS, along with weekly prime time airings from January 2, 1962 to September 9, 1965 and December 25, 1966 to May 22, 1967. An additional 1,099 daytime shows aired from April 5, 1971 to June 27, 1975 on ABC. The show's announcers were Jack Clark and Lee Vines on CBS and John Harlan on ABC. Two revivals later aired on NBC from 1979–1982 and 1984–1989, followed by a prime time version on CBS from 2008–2009. In 2013, TV Guide ranked it #8 in its list of the 60 greatest game shows ever. Featured Crew Bill Todman Creator Mark Goodson Creator Bob Stewart Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Betty White Allen Ludden Gene Wood Jack Clark Full Cast & Crew Last Season Season 6 1966 | 4 Episodes Season 6 of Password premiered on October 24, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Password. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Reality Keywords game show password celebrity Content Score 93 Almost there... Top Contributors 12 Banana s 1 slymball PE 1 Patrick E. Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}