{"link": "https://www.themoviedb.org/tv/67043?language=en", "title": "91 Days", "resume": "During Prohibition, the law held no power and the mafia ruled the town.  The story takes place in Lawless, a town thriving on black market sales of illicitly brewed liquor. Avilio returns to Lawless after some time away, following the murder of his family in a mafia dispute there.  One day, Avilio receives a letter from a mysterious sender, prompting him to return to Lawless for revenge. He then infiltrates the Vanetti family, the ones responsible for his family's murder, and sets about befriending the don's son, Nero, to set his vengeance in motion.  Killing brings more killing, and revenge spawns more revenge. How will the 91-day story of these men guided by a tragic fate end?  (Source: Crunchyroll)", "rate": 73, "genre": ["Animation", "Crime", "Drama", "Mystery"], "cast": ["Kondou Takashi", "Takuya Eguchi", "Takahiro Sakurai", "Kenjirou Tsuda", "Kazuhiro Yamaji"], "character": ["Avilo (voice)", "Nero (voice)", "Valbero (voice)", "Fango (voice)", "Vincent (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67043   Expand 91 Days   (2016) User Score Overview During Prohibition, the law held no power and the mafia ruled the town.  The story takes place in Lawless, a town thriving on black market sales of illicitly brewed liquor. Avilio returns to Lawless after some time away, following the murder of his family in a mafia dispute there.  One day, Avilio receives a letter from a mysterious sender, prompting him to return to Lawless for revenge. He then infiltrates the Vanetti family, the ones responsible for his family's murder, and sets about befriending the don's son, Nero, to set his vengeance in motion.  Killing brings more killing, and revenge spawns more revenge. How will the 91-day story of these men guided by a tragic fate end?  (Source: Crunchyroll) Featured Crew Hiro Kaburaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Kondou Takashi Avilo (voice) Takuya Eguchi Nero (voice) Takahiro Sakurai Valbero (voice) Kenjirou Tsuda Fango (voice) Kazuhiro Yamaji Vincent (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of 91 Days premiered on July  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2010-01-05 Ladies versus Butlers! 10.0    2017-07-04 Tsuredure Children 8.0    2009-04-02 Phantom: Requiem for the Phantom 6.4    2013-07-04 Danganronpa: The Animation 7.0    2015-10-03 Chivalry of a Failed Knight 7.9    2012-01-10 Waiting in the Summer 6.7    2014-04-09 Chaika - The Coffin Princess 8.2    2015-04-04 The Disappearance of Nagato Yuki-chan 7.0  Facts Original Name  91デイズ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://91days.family/ Genres Animation Crime Drama Mystery Keywords prohibition diashow mafia anime Content Score 100 Yes! Looking good! Top Contributors n 21 nongtik 20 minusha97 p 17 pedro251 12 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}