{"link": "https://www.themoviedb.org/tv/2177?language=en", "title": "Land of the Lost", "resume": "Rick Marshall and his children Will and Holly were on a weekend expedition rafting trough a river when an enormous earthquake diverts them to an eclectic alien world inhabited by dinosaurs, chimpanzee-like cavemen called Pakuni, and aggressive, humanoid creatures called Sleestak.", "rate": 69, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Family"], "cast": ["Spencer Milligan", "Wesley Eure", "Philip Paley", "Kathy Coleman"], "character": ["Rick Marshall", "Will Marshall", "Cha-Ka", "Holly Marshall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2177   Expand Land of the Lost   (1974) User Score Overview Rick Marshall and his children Will and Holly were on a weekend expedition rafting trough a river when an enormous earthquake diverts them to an eclectic alien world inhabited by dinosaurs, chimpanzee-like cavemen called Pakuni, and aggressive, humanoid creatures called Sleestak. Featured Crew Marty Krofft Creator Sid Krofft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Spencer Milligan Rick Marshall Wesley Eure Will Marshall Philip Paley Cha-Ka Kathy Coleman Holly Marshall Full Cast & Crew Last Season Season 3 1976 | 13 Episodes Season 3 of Land of the Lost premiered on September 11, 1976. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Starring Wesley? Open 0 by movie_nazi\n      \n     did they get home? Open 0 by manfromatlantis\n      \n     what happen to mashal? Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1968-09-24 The Mod Squad 6.3    1965-01-24 Branded 8.3    1950-10-28 The Jack Benny Program 8.8    2007-06-03 Army Wives 5.9    1965-09-14 Please Don't Eat the Daisies 7.0    1954-10-27 Walt Disney's Wonderful World of Color 6.8    1969-09-06 H.R. Pufnstuf 6.8    1980-11-27 Bosom Buddies 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Family Keywords dinosaur alternative universe uncharted Content Score 93 Almost there... Top Contributors 9 Elizabeth Jennings 8 Banana c 4 curtisb 2 cedell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}