{"link": "https://www.themoviedb.org/tv/20455?language=en", "title": "Titanic", "resume": "Titanic is a made-for-TV dramatization that premiered as a 2-part miniseries on CBS in 1996. Titanic follows several characters on board the RMS Titanic when she sinks on her maiden voyage in 1912. The miniseries was directed by Robert Lieberman. The original music score was composed by Lennie Niehaus. This is the first Titanic movie to show the ship breaking in two.", "rate": 64, "genre": ["Drama"], "cast": ["Peter Gallagher", "George C. Scott", "Catherine Zeta-Jones", "Eva Marie Saint", "Tim Curry"], "character": ["Wynn Park", "Captain Edward J. Smith", "Isabella Paradine", "Hazel Foley", "Simon Doonan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20455   Expand Titanic   (1996) User Score  Play Trailer Overview Titanic is a made-for-TV dramatization that premiered as a 2-part miniseries on CBS in 1996. Titanic follows several characters on board the RMS Titanic when she sinks on her maiden voyage in 1912. The miniseries was directed by Robert Lieberman. The original music score was composed by Lennie Niehaus. This is the first Titanic movie to show the ship breaking in two. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Gallagher Wynn Park George C. Scott Captain Edward J. Smith Catherine Zeta-Jones Isabella Paradine Eva Marie Saint Hazel Foley Tim Curry Simon Doonan Full Cast & Crew Last Season Miniseries 1996 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  7 Recommendations   1997-05-18 Wyrd Sisters 6.2    1999-05-25 Cleopatra 5.8    1993-05-09 The Tommyknockers 5.1    2005-10-30 The Incredible Journey of Mary Bryant 6.9    1989-09-19 Doogie Howser, M.D. 5.7    1999-05-04 Noah's Ark 4.0    1981-09-10 The Day of the Triffids 6.7    2001-01-10 Grounded for Life 6.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  87m Homepage  - Genres Drama Keywords ship shipwreck titanic ocean liner disaster miniseries Content Score 93 Almost there... Top Contributors TB 99 TMDb Bot R 9 Rebecca 8 Steve B 4 Blackjesus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}