{"link": "https://www.themoviedb.org/tv/1850?language=en", "title": "Caroline in the City", "resume": "Caroline in the City is an American situation comedy that ran on the NBC television network. It stars Lea Thompson as cartoonist Caroline Duffy, who lives in Manhattan in New York City. The series premiered on September 21, 1995 in the \"Must See TV\" Thursday night block after Seinfeld. The show ran for 97 episodes over four seasons, before it was cancelled; its final episode was broadcast on April 26, 1999.", "rate": 67, "genre": ["Comedy"], "cast": ["Lea Thompson", "Eric Lutes", "Malcolm Gets", "Amy Pietz", "Sofia Milos"], "character": ["Caroline Duffy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1850   Expand Caroline in the City   (1995) User Score Overview Caroline in the City is an American situation comedy that ran on the NBC television network. It stars Lea Thompson as cartoonist Caroline Duffy, who lives in Manhattan in New York City. The series premiered on September 21, 1995 in the \"Must See TV\" Thursday night block after Seinfeld. The show ran for 97 episodes over four seasons, before it was cancelled; its final episode was broadcast on April 26, 1999. Featured Crew Fred Barron Creator Marco Pennette Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lea Thompson Caroline Duffy Eric Lutes Malcolm Gets Amy Pietz Sofia Milos Full Cast & Crew Last Season Season 4 1998 | 22 Episodes Season 4 of Caroline in the City premiered on September 21, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations   Dennis Miller Live 7.3    1989-09-17 Major Dad 6.8    1994-03-29 Ellen 6.2    1980-11-27 Bosom Buddies 6.6    1977-09-04 Operation Petticoat 7.1    1994-09-18 Chicago Hope 7.3    1976-10-03 Quincy, M.E. 7.0    1984-09-19 Highway to Heaven 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.carolineinthecity.com/ Genres Comedy Keywords dating manhattan, new york city sitcom cartoonist Content Score 93 Almost there... Top Contributors 12 Banana s 3 speedycars S 2 SunHomeMovie TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}