{"link": "https://www.themoviedb.org/tv/58479?language=en", "title": "Upper Middle Bogan", "resume": "Follow the stories of two families living at opposite ends of the freeway. Bess Denyar is a doctor with a posh mother, Margaret, an architect husband, Danny Bright, and twin 13-year-olds at a private school, Oscar and Edwina. When Bess finds out that she is adopted, she is stunned, but even more so when she meets her birth parents, Wayne and Julie Wheeler. She also discovers that she has three siblings: Amber, Kayne and Brianna. The bogan Wheelers head up a drag racing team in the outer suburbs and are thrilled to discover the daughter they thought they had lost.", "rate": 84, "genre": ["Comedy"], "cast": ["Annie Maynard", "Patrick Brammall", "Robyn Malcolm", "Michala Banas", "Rhys Mitchell"], "character": ["Bess Denyar", "Danny Bright", "Julie Wheeler", "Amber Wheeler", "Kayne Wheeler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58479   Expand Upper Middle Bogan   (2013) User Score  Play Trailer Overview Follow the stories of two families living at opposite ends of the freeway. Bess Denyar is a doctor with a posh mother, Margaret, an architect husband, Danny Bright, and twin 13-year-olds at a private school, Oscar and Edwina. When Bess finds out that she is adopted, she is stunned, but even more so when she meets her birth parents, Wayne and Julie Wheeler. She also discovers that she has three siblings: Amber, Kayne and Brianna. The bogan Wheelers head up a drag racing team in the outer suburbs and are thrilled to discover the daughter they thought they had lost. Featured Crew Wayne Hope Creator Robyn Butler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Annie Maynard Bess Denyar Patrick Brammall Danny Bright Robyn Malcolm Julie Wheeler Michala Banas Amber Wheeler Rhys Mitchell Kayne Wheeler Full Cast & Crew Last Season Series 3 2016 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Upper Middle Bogan. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/programs/upper-middle-bogan/ Genres Comedy Keywords white trash family biological parents Content Score 100 Yes! Looking good! Top Contributors 37 United600 30 Elizabeth Jennings 19 CouchTater D 5 Dee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}