{"link": "https://www.themoviedb.org/tv/3862?language=en", "title": "Solid Gold", "resume": "Solid Gold was an American syndicated music television series that debuted on September 13, 1980. Like many other shows of its genre, such as American Bandstand, Solid Gold featured musical performances and various other elements such as music videos. What set Solid Gold apart was a group of dancers in revealing costumes who at various points in the program performed various dances to the top ten hits of the week. Many other specials aired in which the dancers would dance to older pop hits as well. Reviews of the show were not always positive, with The New York Times referring to it as \"the pop music show that is its own parody...[enacting] mini-dramas...of covetousness, lust and aerobic toning--routines that typically have a minimal connection with the songs that back them up.\"\nThe series ran until July 23, 1988, and it was usually transmitted on Saturdays in the early evening. In 1986, Solid Gold added the current year to its title, so in the seventh season the show was known as Solid Gold '86/'87. For the eighth and last season the program became known as Solid Gold In Concert, reflecting the addition of more live performances than had previously been featured on the program in the past.", "rate": 60, "genre": [], "cast": ["Lucinda Dickey", "Charlie O'Donnell", "Chelsea Field", "Dionne Warwick", "Jeff Altman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3862   Expand Solid Gold   (1980) User Score  Play Trailer Overview Solid Gold was an American syndicated music television series that debuted on September 13, 1980. Like many other shows of its genre, such as American Bandstand, Solid Gold featured musical performances and various other elements such as music videos. What set Solid Gold apart was a group of dancers in revealing costumes who at various points in the program performed various dances to the top ten hits of the week. Many other specials aired in which the dancers would dance to older pop hits as well. Reviews of the show were not always positive, with The New York Times referring to it as \"the pop music show that is its own parody...[enacting] mini-dramas...of covetousness, lust and aerobic toning--routines that typically have a minimal connection with the songs that back them up.\" The series ran until July 23, 1988, and it was usually transmitted on Saturdays in the early evening. In 1986, Solid Gold added the current year to its title, so in the seventh season the show was known as Solid Gold '86/'87. For the eighth and last season the program became known as Solid Gold In Concert, reflecting the addition of more live performances than had previously been featured on the program in the past. Featured Crew Al Masini Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucinda Dickey Charlie O'Donnell Chelsea Field Dionne Warwick Jeff Altman Full Cast & Crew Last Season Season 1 1980 | 47 Episodes Season 1 of Solid Gold premiered on September 13, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Solid Gold. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords music tv program Content Score 79 Pump it up! We're close now. Top Contributors 2 gokhan2121 TB 1 TMDb Bot 1 Steve 1 SeventhWard  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}