{"link": "https://www.themoviedb.org/tv/19390?language=en", "title": "Maigret", "resume": "Based on the novels by Georges Simenon, Michael Gambon plays the eponymous detective from the Sûreté in this 1992 revival of the 1960s BBC drama series. Maigret is an intuitutive detective, who investigates his cases by watching and listening, getting to know everyone on his list of suspects until someone makes a slip or breaks down and confesses.", "rate": 90, "genre": ["Drama"], "cast": ["Michael Gambon", "Geoffrey Hutchings", "Jack Galloway", "James Larkin"], "character": ["Chief Inspector Maigret", "Sgt. Lucas", "Inspector Janvier", "Inspector LaPointe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19390   Expand Maigret   (1992) User Score Overview Based on the novels by Georges Simenon, Michael Gambon plays the eponymous detective from the Sûreté in this 1992 revival of the 1960s BBC drama series. Maigret is an intuitutive detective, who investigates his cases by watching and listening, getting to know everyone on his list of suspects until someone makes a slip or breaks down and confesses. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Gambon Chief Inspector Maigret Geoffrey Hutchings Sgt. Lucas Jack Galloway Inspector Janvier James Larkin Inspector LaPointe Full Cast & Crew Last Season Season 2 1993 | 6 Episodes Season 2 of Maigret premiered on March 14, 1993. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Maigret. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Maigret. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords detective french Content Score 86 Almost there... Top Contributors 24 Elizabeth Jennings z 9 zoroman1975 a 3 asusar s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}