{"link": "https://www.themoviedb.org/tv/63777?language=en", "title": "Moonbeam City", "resume": "An absurdist, retro-futuristic 80s cop extravaganza. The series follows undercover detective Dazzle Novak, a handsome idiot who commits more crimes than most criminals. His tyrannical chief, Pizzaz Miller, won't get off his back, and hotshot rookie Rad Cunningham is dying to see him fail. With the world against him, Dazzle is thrust into a living nightmare: having to do actual police work.", "rate": 55, "genre": ["Animation", "Comedy"], "cast": ["Rob Lowe", "Elizabeth Banks", "Will Forte", "Kate Mara"], "character": ["Dazzle Novak", "Pizzaz Miller", "Red Cunningham", "Chrysalis Tate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63777   Expand Moonbeam City   (2015) User Score  Play Trailer Overview An absurdist, retro-futuristic 80s cop extravaganza. The series follows undercover detective Dazzle Novak, a handsome idiot who commits more crimes than most criminals. His tyrannical chief, Pizzaz Miller, won't get off his back, and hotshot rookie Rad Cunningham is dying to see him fail. With the world against him, Dazzle is thrust into a living nightmare: having to do actual police work. Featured Crew Scott Gairdner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Lowe Dazzle Novak Elizabeth Banks Pizzaz Miller Will Forte Red Cunningham Kate Mara Chrysalis Tate Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Moonbeam City premiered on September 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  1 Recommendations   2014-01-13 Chozen 6.1    2013-07-21 Axe Cop 5.5    2012-06-07 TRON: Uprising 7.5    2011-09-25 Pan Am 5.8    2006-08-06 Metalocalypse 6.9    2016-08-19 The Tick 7.5    2010-03-17 Ugly Americans 6.9    2011-06-23 Wilfred 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.cc.com/shows/moonbeam-city Genres Animation Comedy Keywords police undercover cop dirty cop 1980s retrofuturism Content Score 100 Yes! Looking good! Top Contributors 54 Elizabeth Jennings s 5 swinkworld 3 Zlogorek z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}