{"link": "https://www.themoviedb.org/tv/68806?language=en", "title": "Shuttle Love Millennium", "resume": "A rich party boy from 2016 switches body with a legendary chef from 1936. He may have to spend the next 80 years finding a way back to his time period.", "rate": 50, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Wei Da Xun", "Janice Man", "Puff Kuo", "Edward Zhang"], "character": ["Sun Qi Long / Zhang Zhi Gang", "Wang Lin", "Fang Si Yi", "Jiang Shi Kai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68806   Expand Shuttle Love Millennium   (2016) User Score Overview A rich party boy from 2016 switches body with a legendary chef from 1936. He may have to spend the next 80 years finding a way back to his time period. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wei Da Xun Sun Qi Long / Zhang Zhi Gang Janice Man Wang Lin Puff Kuo Fang Si Yi Edward Zhang Jiang Shi Kai Full Cast & Crew Last Season Season 1 2016 | 28 Episodes Season 1 of Shuttle Love Millennium premiered on November 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shuttle Love Millennium. You can help by rating TV shows you've seen. Facts Original Name  相爱穿梭千年2：月光下的交换 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Keywords china time travel romance Content Score 86 Almost there... Top Contributors M 36 Maria180493 TB 2 TMDb Bot 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}