{"link": "https://www.themoviedb.org/tv/63314?language=en", "title": "Club de Cuervos", "resume": "When the patriarch of a prominent family dies, his heirs battle to determine who will gain control of his beloved soccer team: The Cuervos of Nuevo Toledo.", "rate": 78, "genre": ["Drama", "Comedy"], "cast": ["Luis Gerardo Méndez", "Mariana Treviño", "Stephanie Cayo", "Daniel Giménez Cacho", "Antonio de la Vega"], "character": ["Chava Iglesias", "Isabel", "Mary Luz", "Félix", "Rafael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63314   Expand Club de Cuervos   (2015) User Score  Play Trailer Overview When the patriarch of a prominent family dies, his heirs battle to determine who will gain control of his beloved soccer team: The Cuervos of Nuevo Toledo. Featured Crew Gary Alazraky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luis Gerardo Méndez Chava Iglesias Mariana Treviño Isabel Stephanie Cayo Mary Luz Daniel Giménez Cacho Félix Antonio de la Vega Rafael Full Cast & Crew Last Season Season 3 2017 | 10 Episodes Season 3 of Club de Cuervos premiered on September 29, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2015-09-12 Goldie & Bear 5.4    2015-08-07 Project Mc² 4.7    2016-08-12 Ask the Storybots 7.5    2015-01-10 My Sunshine 7.4    2002-08-07 La familia P. Luche 6.8    2014-02-23 Griselda Blanco: The Black Widow 6.2    2013-10-21 The Time in Between 8.5    2017-12-22 The Toys That Made Us 7.5  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Spanish; Castilian Runtime  40m Homepage   http://www.netflix.com/title/80030346 Genres Drama Comedy Keywords mexico sibling relationship soccer Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings 16 nycos z 10 zurman1 9 Patrik Selin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}