{"link": "https://www.themoviedb.org/tv/70382?language=en", "title": "Suomen huutokauppakeisari", "resume": "Suomen huutokauppakeisari is finnish TV serie, which follows everyday activities of auction house, located in Uurainen, Hirvaskangas.", "rate": 100, "genre": ["Reality"], "cast": ["Aki Palsanmäki", "Heli Palsanmäki", "Markku Saukko"], "character": ["himself", "herself", "himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70382   Expand Suomen huutokauppakeisari   (2013) User Score Overview Suomen huutokauppakeisari is finnish TV serie, which follows everyday activities of auction house, located in Uurainen, Hirvaskangas. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aki Palsanmäki himself Heli Palsanmäki herself Markku Saukko himself Full Cast & Crew Current Season Season 8 2018 | 12 Episodes Season 8 of Suomen huutokauppakeisari premiered on February 13, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Suomen huutokauppakeisari. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Suomen huutokauppakeisari. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  Finnish Runtime  45m Homepage   http://www.nelonen.fi/ohjelmat/suomen-huutokauppakeisari Genres Reality Keywords married couple auction celebrity entrepreneur vintage auctioneer Content Score 56 We're so close, yet so far. Top Contributors 54 BryGur j 2 januli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}