{"link": "https://www.themoviedb.org/tv/13339?language=en", "title": "Space Battleship Yamato", "resume": "Space Battleship Yamato is a Japanese science fiction anime series featuring an eponymous spacecraft. It is also known to English-speaking audiences as Space Cruiser Yamato; an English-dubbed and heavily edited version of the series was broadcast on North American and Australian television as Star Blazers. The first two seasons of this version were broadcast in Greece in 1981-82 as Διαστημόπλοιο Αργώ. An Italian-language version was also broadcast under the name Star Blazers in Italy, and a Portuguese-language version was successfully shown in Brazil under the title Patrulha Estelar and Viaje a la Ultima Galaxia or Astronave Intrepido in Spain and Latin America.\nIt is a seminal series in the history of anime, marking a turn towards more complex serious works and influencing works such as Mobile Suit Gundam and Neon Genesis Evangelion; Hideaki Anno has ranked Yamato his favorite anime and credited it with sparking his interest in anime.\nYamato was the first anime series or movie to win the Seiun Award, a feat not repeated until the 1985 Nausicaä of the Valley of the Wind.", "rate": 70, "genre": ["Animation", "Drama", "Action", "Adventure"], "cast": ["Kei Tomiyama", "Gorō Naya", "Shūsei Nakamura", "Yôko Asagami", "Takeshi Aono"], "character": ["Susumu Kodai", "Juzo Okita", "Daisuke Shima", "Yuki Mori", "Shiro Sanada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13339   Expand Space Battleship Yamato   (1974) User Score Overview Space Battleship Yamato is a Japanese science fiction anime series featuring an eponymous spacecraft. It is also known to English-speaking audiences as Space Cruiser Yamato; an English-dubbed and heavily edited version of the series was broadcast on North American and Australian television as Star Blazers. The first two seasons of this version were broadcast in Greece in 1981-82 as Διαστημόπλοιο Αργώ. An Italian-language version was also broadcast under the name Star Blazers in Italy, and a Portuguese-language version was successfully shown in Brazil under the title Patrulha Estelar and Viaje a la Ultima Galaxia or Astronave Intrepido in Spain and Latin America. It is a seminal series in the history of anime, marking a turn towards more complex serious works and influencing works such as Mobile Suit Gundam and Neon Genesis Evangelion; Hideaki Anno has ranked Yamato his favorite anime and credited it with sparking his interest in anime. Yamato was the first anime series or movie to win the Seiun Award, a feat not repeated until the 1985 Nausicaä of the Valley of the Wind. Featured Crew Yoshinobu Nishizaki Creator Leiji Matsumoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kei Tomiyama Susumu Kodai Gorō Naya Juzo Okita Shūsei Nakamura Daisuke Shima Yôko Asagami Yuki Mori Takeshi Aono Shiro Sanada Full Cast & Crew Last Season Season 3 1980 | 25 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Space Battleship Yamato. You can help by rating TV shows you've seen. Facts Original Name  宇宙戦艦ヤマト Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Drama Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 12 BlackDelivery 12 BrerFox 10 t0by 8 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}