{"link": "https://www.themoviedb.org/tv/71718?language=en", "title": "Survivor New Zealand", "resume": "A New Zealand reality game show based on the international Survivor format. Following the basic premise of other international versions of the format, it features a group of contestants who are marooned in an isolated location, where they must provide food, water, fire, and shelter for themselves. The contestants compete in challenges for rewards and immunity from elimination. The contestants are progressively eliminated from the game as they are voted out by their fellow contestants, until only one remains and is given the title of \"Sole Survivor\" and awarded the grand prize.", "rate": 0, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71718   Expand Survivor New Zealand   (2017) User Score  Play Trailer Overview A New Zealand reality game show based on the international Survivor format. Following the basic premise of other international versions of the format, it features a group of contestants who are marooned in an isolated location, where they must provide food, water, fire, and shelter for themselves. The contestants compete in challenges for rewards and immunity from elimination. The contestants are progressively eliminated from the game as they are voted out by their fellow contestants, until only one remains and is given the title of \"Sole Survivor\" and awarded the grand prize. Featured Crew Charlie Parsons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 11 Episodes Season 2 of Survivor New Zealand premiered on April 22, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Survivor New Zealand. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   https://www.tvnz.co.nz/shows/survivor-new-zealand Genres Reality Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 57 Joe Carson 8 oldboy3 2 tigru89 E 2 ErOoRek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}