{"link": "https://www.themoviedb.org/tv/61399?language=en", "title": "Red Band Society", "resume": "Children and teenagers become friends in a hospital where they are all patients. Together they try to escape the sad reality to create their own world with their own codes , while the nursing staff do their best to bring them a little happiness everyday. Charlie , in a coma for several months, attending meanwhile helplessly bustle around him. He sees nothing , but he hears everything ...", "rate": 68, "genre": ["Drama", "Comedy"], "cast": ["Octavia Spencer", "Dave Annable", "Astro", "Griffin Gluck", "Zoe Levin"], "character": ["Nurse Jackson", "Dr. Jack McAndrew", "Dash Hosney", "Charlie", "Kara Souders"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61399   Expand Red Band Society   (2014) User Score Overview Children and teenagers become friends in a hospital where they are all patients. Together they try to escape the sad reality to create their own world with their own codes , while the nursing staff do their best to bring them a little happiness everyday. Charlie , in a coma for several months, attending meanwhile helplessly bustle around him. He sees nothing , but he hears everything ... Featured Crew Albert Espinosa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Octavia Spencer Nurse Jackson Dave Annable Dr. Jack McAndrew Astro Dash Hosney Griffin Gluck Charlie Zoe Levin Kara Souders Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Red Band Society premiered on September 17, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Jordi: Happy Birthday Nolan Sotillo! Open 0 by wonder2wonder\n      \n     w Dash: Happy Birthday Astro! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2015-06-18 The Astronaut Wives Club 5.3    2013-09-25 Back in the Game 6.3    2014-09-30 Happyland 3.3    2014-07-08 Finding Carter 5.6    2013-10-22 Ravenswood 4.5    2015-01-12 Eye Candy 5.8    2014-10-02 Bad Judge 6.1    2016-03-02 The Real O'Neals 7.7  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.fox.com/red-band-society/ Genres Drama Comedy Keywords hospital doctor doctor patient relationship eating disorder child cancer hospital room teen anger hospitalization Content Score 100 Yes! Looking good! Top Contributors 29 CouchTater 14 Elizabeth Jennings M 8 Maxime84 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}