{"link": "https://www.themoviedb.org/tv/1935?language=en", "title": "Chico and the Man", "resume": "Chico and the Man is an American sitcom which ran on NBC for four seasons, from September 13, 1974, to July 21, 1978. It stars Jack Albertson as Ed Brown, the cantankerous owner of a run down garage in an East Los Angeles barrio, and Freddie Prinze as Chico Rodriguez, an upbeat, optimistic Chicano young man who comes in looking for a job. It was the first U.S. television series set in a Mexican-American neighborhood.", "rate": 62, "genre": ["Comedy"], "cast": ["Freddie Prinze", "Della Reese", "Jack Albertson", "Scatman Crothers", "Charo"], "character": ["Chico Rodriguez", "Della Rogers", "Ed Brown", "Louie", "Aunt Charo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1935   Expand Chico and the Man   (1974) User Score Overview Chico and the Man is an American sitcom which ran on NBC for four seasons, from September 13, 1974, to July 21, 1978. It stars Jack Albertson as Ed Brown, the cantankerous owner of a run down garage in an East Los Angeles barrio, and Freddie Prinze as Chico Rodriguez, an upbeat, optimistic Chicano young man who comes in looking for a job. It was the first U.S. television series set in a Mexican-American neighborhood. Featured Crew James Komack Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Freddie Prinze Chico Rodriguez Della Reese Della Rogers Jack Albertson Ed Brown Scatman Crothers Louie Charo Aunt Charo Full Cast & Crew Last Season Season 4 1977 | 23 Episodes Season 4 of Chico and the Man premiered on September 16, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1968-09-24 The Mod Squad 6.3    1961-09-24 The Bullwinkle Show 7.4    1988-11-14 Murphy Brown 6.5    1981-05-16 SCTV Network 90 8.1    1972-09-16 The Bob Newhart Show 8.1    1988-09-23 Whose Line Is It Anyway? 7.8    1977-03-15 Three's Company 7.3    1990-04-19 Wings 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords car garage los angeles mexican american sitcom Content Score 93 Almost there... Top Contributors 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}