{"link": "https://www.themoviedb.org/tv/42912?language=en", "title": "Inazuma Eleven", "resume": "Endou Mamoru is a cheerful goalkeeper in Raimon Jr High, with six other players in the team. But there was a day when the team was almost lead to disbandment by Natsumi unless they are to win the match against the Teikoku Gakuen, currently the best team of Japan. He tried to save the club by gathering four more players to the team.", "rate": 90, "genre": ["Animation"], "cast": ["Yuuki Kaji", "Haruka Tomatsu"], "character": ["Kudou Fuyuka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42912   Expand Inazuma Eleven   (2008) User Score  Play Trailer Overview Endou Mamoru is a cheerful goalkeeper in Raimon Jr High, with six other players in the team. But there was a day when the team was almost lead to disbandment by Natsumi unless they are to win the match against the Teikoku Gakuen, currently the best team of Japan. He tried to save the club by gathering four more players to the team. Featured Crew Tenya Yabuno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuki Kaji Haruka Tomatsu Kudou Fuyuka Full Cast & Crew Last Season Inazuma Eleven GO: Galaxy 2013 | 43 Episodes Season 4 of Inazuma Eleven premiered on May  8, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Inazuma Eleven. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Inazuma Eleven. You can help by rating TV shows you've seen. Facts Original Name  イナズマイレブン Status  Ended Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/anime/inazuma/index2.html Genres Animation Keywords soccer Content Score 71 Just a little bit more... Top Contributors 18 Banana 12 radocity 7 SeRuJi0 7 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}