{"link": "https://www.themoviedb.org/tv/3578?language=en", "title": "The Herculoids", "resume": "The Herculoids is an American Saturday-morning animated-cartoon television series, created and designed by Alex Toth, that was produced by Hanna-Barbera Productions. The show debuted on September 9, 1967 on CBS. Hanna-Barbera produced one season for the original airing of the show, although the original 18 episodes were rerun during the 1968–69 television season, with The Herculoids ending its run on September 6, 1969.\nEleven new episodes were produced in 1981 as part of the Space Stars show. The plotlines are rooted in science fiction, and have story direction and content similar to Jonny Quest and Space Ghost. This series is set on the distant planet Amzot. The name \"Amzot\" was first mentioned in the Space Ghost episode \"The Molten Monsters of Moltar\" and in the series proper in the \"Time Creatures\" episode.", "rate": 77, "genre": ["Animation"], "cast": ["Don Messick", "Virginia Gregg", "Mike Road", "Sparky Marcus", "Ted Cassidy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3578   Expand The Herculoids   (1967) User Score Overview The Herculoids is an American Saturday-morning animated-cartoon television series, created and designed by Alex Toth, that was produced by Hanna-Barbera Productions. The show debuted on September 9, 1967 on CBS. Hanna-Barbera produced one season for the original airing of the show, although the original 18 episodes were rerun during the 1968–69 television season, with The Herculoids ending its run on September 6, 1969. Eleven new episodes were produced in 1981 as part of the Space Stars show. The plotlines are rooted in science fiction, and have story direction and content similar to Jonny Quest and Space Ghost. This series is set on the distant planet Amzot. The name \"Amzot\" was first mentioned in the Space Ghost episode \"The Molten Monsters of Moltar\" and in the series proper in the \"Time Creatures\" episode. Featured Crew Alex Toth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Messick Virginia Gregg Mike Road Sparky Marcus Ted Cassidy Full Cast & Crew Last Season Season 2 1981 | 13 Episodes Season 2 of The Herculoids premiered on September 12, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1966-09-10 Space Ghost and Dino Boy 7.2    1964-10-03 Underdog 6.7    1974-09-07 Hong Kong Phooey 6.1    1964-09-18 Jonny Quest 7.9    2000-12-21 The Brak Show 7.0    1990-09-10 Captain Planet and the Planeteers 5.9    1995-05-28 Dr. Katz, Professional Therapist 7.6    1994-01-26 The Critic 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  9m, 10m, 30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 Robson Guedes Vieira E 4 Enigma19 4 ederbat 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}