{"link": "https://www.themoviedb.org/tv/816?language=en", "title": "Shooting Stars", "resume": "Shooting Stars is a British television comedy panel game broadcast on BBC Two as a pilot in 1993, then as 3 full series from 1995 to 1997, then on BBC Choice from January to December 2002 with 2 series before returning to BBC Two for another 3 series from 2008 until its cancellation in 2011. Created and hosted by double-act Vic Reeves and Bob Mortimer, it uses the panel show format but with the comedians' often slapstick, surreal and anarchic humour does not rely on rules in order to function, with the pair apparently ignoring existing rules or inventing new ones as and when the mood takes them.", "rate": 74, "genre": ["Comedy"], "cast": ["Matt Lucas", "Bob Mortimer", "Johnny Vegas", "Mark Lamarr", "Ulrika Jonsson"], "character": ["George Dawes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 816   Expand Shooting Stars   (1993) User Score Overview Shooting Stars is a British television comedy panel game broadcast on BBC Two as a pilot in 1993, then as 3 full series from 1995 to 1997, then on BBC Choice from January to December 2002 with 2 series before returning to BBC Two for another 3 series from 2008 until its cancellation in 2011. Created and hosted by double-act Vic Reeves and Bob Mortimer, it uses the panel show format but with the comedians' often slapstick, surreal and anarchic humour does not rely on rules in order to function, with the pair apparently ignoring existing rules or inventing new ones as and when the mood takes them. Featured Crew Vic and Bob Creator Bob Mortimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Lucas George Dawes Bob Mortimer Johnny Vegas Mark Lamarr Ulrika Jonsson Full Cast & Crew Last Season Season 8 2011 | 6 Episodes Season 8 of Shooting Stars premiered on August  8, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2002-11-14 Harry Hill's TV Burp 7.2    1996-11-12 Never Mind the Buzzcocks 7.5    1982-11-02 Countdown 5.4    1990-09-27 Rab C. Nesbitt 7.1    1981-12-24 The Kenny Everett Television Show 7.0    1993-09-21 The Smell of Reeves and Mortimer 7.7    2009-01-03 Total Wipeout 5.3    1983-09-22 Just Good Friends 6.4  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords surreal game show british humour anarchic comedy Content Score 93 Almost there... Top Contributors O 6 Ozbourne R 3 Rebecca M 2 MAthePA m 1 movienator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}