{"link": "https://www.themoviedb.org/tv/26101?language=en", "title": "The Keepers", "resume": "This docuseries examines the decades-old murder of Sister Catherine Cesnik and its suspected link to a priest accused of abuse.", "rate": 77, "genre": ["Documentary", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26101   Expand The Keepers   (2017) User Score  Play Trailer Overview This docuseries examines the decades-old murder of Sister Catherine Cesnik and its suspected link to a priest accused of abuse. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  2 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 7 Episodes Season 1 of The Keepers premiered on May 19, 2017. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply long & drawn out Open 2 by  Daddie0 Haunting -  anyone finished watching this? Open 3 by  Dedoc1967 b No thoughts? Open 4 by  Dedoc1967 Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2017-09-26 Law & Order True Crime 6.1    2016-09-18 The Case of: JonBenét Ramsey 5.3    2018-05-11 Evil Genius 8.3    2018-03-16 Wild Wild Country 7.7    2005-01-11 Auschwitz: The Nazis and the Final Solution 8.4    2017-09-15 American Vandal 7.8    2013-10-31 Darknet 7.0    2017-08-02 The Sinner 7.3  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  62m Homepage   https://www.netflix.com/title/80122179 Genres Documentary Mystery Keywords corruption nun cover-up murder miniseries Content Score 64 We're so close, yet so far. Top Contributors TB 23 TMDb Bot p 11 plumpro 9 Elizabeth Jennings 7 bstarko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}