{"link": "https://www.themoviedb.org/tv/32351?language=en", "title": "Ugly Americans", "resume": "Ugly Americans is an American animated sitcom created by Devin Clark and developed by David M. Stern. The program focuses on the life of Mark Lilly, a social worker employed by the Department of Integration, in an alternate reality version of New York City inhabited by monsters and other creatures. Daniel Powell serves as executive producer and Aaron Augenblick is supervising producer and animation director.\nUgly Americans aired on Comedy Central from March 17, 2010 to April 25, 2012 with a total of 31 episodes over two seasons.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Michael-Leon Wooley", "Maria Bamford", "Maria Bamford", "Maria Bamford", "Bill Hader"], "character": ["Dolores", "Galen", "Various", "William Dyer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32351   Expand Ugly Americans   (2010) User Score  Play Trailer Overview Ugly Americans is an American animated sitcom created by Devin Clark and developed by David M. Stern. The program focuses on the life of Mark Lilly, a social worker employed by the Department of Integration, in an alternate reality version of New York City inhabited by monsters and other creatures. Daniel Powell serves as executive producer and Aaron Augenblick is supervising producer and animation director. Ugly Americans aired on Comedy Central from March 17, 2010 to April 25, 2012 with a total of 31 episodes over two seasons. Featured Crew David M. Stern Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  7 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Michael-Leon Wooley Maria Bamford Dolores Maria Bamford Galen Maria Bamford Various Bill Hader William Dyer Full Cast & Crew Last Season Season 2 2011 | 17 Episodes Season 2 of Ugly Americans premiered on June 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  12 Posters  7 Recommendations   2010-06-07 Neighbors from Hell 7.5    2012-01-19 Unsupervised 6.6    2012-09-25 Brickleberry 7.0    2001-11-14 The Bernie Mac Show 5.7    1999-01-10 The PJs 7.4    2001-04-01 Undergrads 6.3    2014-08-22 BoJack Horseman 8.0    2010-02-15 Funny or Die Presents 5.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.comedycentral.com/shows/ugly_americans/index.jhtml Genres Animation Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors E 8 Elliottday z 5 zurman1 5 anzani-hun FM 4 FEVER MINT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}