{"link": "https://www.themoviedb.org/tv/10371?language=en", "title": "Flash Forward", "resume": "Flash Forward was a Disney Channel Original Series produced in Canada for pre-teens and teenagers which aired on both the Disney Channel and ABC from 1996-1997.\nThe show took a look at the lives of two best friends and neighbors since birth, Tucker and Rebecca, and their respective adventures as they travel through the world of eighth grade. The show was produced by Atlantic Films in association with the Disney Channel. Flash Forward is notable for being the first original series created by Disney Channel.", "rate": 0, "genre": ["Comedy"], "cast": ["Jewel Staite", "Ben Foster", "Asia Vieira", "Theodore Borders"], "character": ["Rebecca 'Becca' Fisher", "Tucker James"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10371   Expand Flash Forward   (1996) User Score Overview Flash Forward was a Disney Channel Original Series produced in Canada for pre-teens and teenagers which aired on both the Disney Channel and ABC from 1996-1997. The show took a look at the lives of two best friends and neighbors since birth, Tucker and Rebecca, and their respective adventures as they travel through the world of eighth grade. The show was produced by Atlantic Films in association with the Disney Channel. Flash Forward is notable for being the first original series created by Disney Channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jewel Staite Rebecca 'Becca' Fisher Ben Foster Tucker James Asia Vieira Theodore Borders Full Cast & Crew Last Season Season 1 1997 | 26 Episodes Season 1 of Flash Forward premiered on January  5, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Flash Forward. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Flash Forward. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords teenager best friends in love Content Score 71 Just a little bit more... Top Contributors p 5 pepitopajas S 2 Samara 2 Banana s 2 sintrode  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}