{"link": "https://www.themoviedb.org/tv/10808?language=en", "title": "Tarzan", "resume": "Tarzan is a series that aired on NBC from 1966 – 1968. The series portrayed Tarzan as a well-educated character, one who, tired of civilization, had returned to the jungle where he had been raised. The show retained many of the trappings of the classic movie series, including Cheeta, while excluding other elements, such as Jane, as part of the \"new look\" for the fabled apeman that producer Sy Weintraub had introduced in previous motion pictures starring Gordon Scott, Jock Mahoney, and Mike Henry. CBS aired repeat episodes the program during the summer of 1969.", "rate": 69, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ron Ely", "Manuel Padilla Jr.", "Alan Caillou", "Rockne Tarkington"], "character": ["Tarzan", "Jai", "Jason Flood", "Rao"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10808   Expand Tarzan   (1966) User Score Overview Tarzan is a series that aired on NBC from 1966 – 1968. The series portrayed Tarzan as a well-educated character, one who, tired of civilization, had returned to the jungle where he had been raised. The show retained many of the trappings of the classic movie series, including Cheeta, while excluding other elements, such as Jane, as part of the \"new look\" for the fabled apeman that producer Sy Weintraub had introduced in previous motion pictures starring Gordon Scott, Jock Mahoney, and Mike Henry. CBS aired repeat episodes the program during the summer of 1969. Featured Crew Sy Weintraub Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ron Ely Tarzan Manuel Padilla Jr. Jai Alan Caillou Jason Flood Rockne Tarkington Rao Full Cast & Crew Last Season Season 2 1967 | 26 Episodes Season 2 of Tarzan premiered on September 15, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1964-09-19 Flipper 4.6    1949-09-15 The Lone Ranger 5.4    1969-09-23 Marcus Welby, M.D. 6.8    1965-10-02 Secret Squirrel 4.0    1964-09-25 Gomer Pyle, U.S.M.C. 6.8    1957-09-18 Wagon Train 6.3    1954-10-15 The Adventures of Rin Tin Tin 6.5    1975-02-24 S.W.A.T. 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  46m Homepage  - Genres Action & Adventure Drama Keywords africa feral child tarzan jungle wild Content Score 93 Almost there... Top Contributors 26 Banana 10 lineker 6 jack denis 2 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}