{"link": "https://www.themoviedb.org/tv/63349?language=en", "title": "The Bastard Executioner", "resume": "A blood-soaked, medieval epic that tells the story of Wilkin Brattle, a 14th century warrior, whose life is forever changed when a divine messenger beseeches him to lay down his sword and lead the life of another man: a journeyman executioner. Set in northern Wales during a time rife with rebellion and political upheaval, Wilkin must walk a tight rope between protecting his true identity while also serving a mysterious destiny.\nGuided by Annora, a mystical healer whose seeming omniscience keeps Wilkin under her sway; manipulated by Milus Corbett, a devious Chamberlain with grand political aspirations; and driven by a deepening connection with the Baroness Lady Love, Wilkin struggles to navigate political, emotional and supernal pitfalls in his quest to understand his greater purpose.", "rate": 59, "genre": ["Drama"], "cast": ["Lee Jones", "Flora Spencer-Longhurst", "Darren Evans", "Stephen Moyer", "Katey Sagal"], "character": ["Wilkin Brattle", "Baroness Lowry 'Love' Aberffraw Ventris", "Ash y Goedwig", "Milus Corbett", "Annora of the Alders"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63349   Expand The Bastard Executioner   (2015) User Score  Play Trailer Overview A blood-soaked, medieval epic that tells the story of Wilkin Brattle, a 14th century warrior, whose life is forever changed when a divine messenger beseeches him to lay down his sword and lead the life of another man: a journeyman executioner. Set in northern Wales during a time rife with rebellion and political upheaval, Wilkin must walk a tight rope between protecting his true identity while also serving a mysterious destiny. Guided by Annora, a mystical healer whose seeming omniscience keeps Wilkin under her sway; manipulated by Milus Corbett, a devious Chamberlain with grand political aspirations; and driven by a deepening connection with the Baroness Lady Love, Wilkin struggles to navigate political, emotional and supernal pitfalls in his quest to understand his greater purpose. Featured Crew Kurt Sutter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jones Wilkin Brattle Flora Spencer-Longhurst Baroness Lowry 'Love' Aberffraw Ventris Darren Evans Ash y Goedwig Stephen Moyer Milus Corbett Katey Sagal Annora of the Alders Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of The Bastard Executioner premiered on September 15, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Bastard Executioner. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2015-10-27 Wicked City 5.4    2014-11-13 Babylon 7.1    2015-08-25 Public Morals 7.5    2013-10-02 Cleaners 7.4    2015-10-10 The Last Kingdom 7.7    2016-10-16 Eyewitness 7.4    2012-10-11 Copper 6.0    2015-06-01 The Whispers 5.7  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fxnetworks.com/shows/the-bastard-executioner Genres Drama Keywords rebellion epic wales corruption traitor peasant mystic monarchy false identity forbidden love baroness betrayal knight executioner historical fiction torture political intrigue  assumed identity medieval palace intrigue social class historical drama assumed dead british monarchy 14th century Content Score 100 Yes! Looking good! Top Contributors j 61 jberryj17 46 Elizabeth Jennings 11 Imzadi R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}