{"link": "https://www.themoviedb.org/tv/68103?language=en", "title": "Drifters", "resume": "Shimazu Toyohisa is a real-life samurai who fought in the pivotal Battle of Sekigahara. In his dying moments, Shimazu is transported to a world of magic with other famous warriors throughout history. These warriors are forced to fight each other in an endless battle.", "rate": 74, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Yutaka Aoyama", "Yuichi Nakamura", "Naoya Uchida", "Mitsuki Saiga"], "character": ["Hannibal Barca (voice)", "Toyohisa Shimazu (voice)", "Nobunaga Oda (voice)", "Yoichi Suketaka Nasu (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68103   Expand Drifters   (2016) User Score  Play Trailer Overview Shimazu Toyohisa is a real-life samurai who fought in the pivotal Battle of Sekigahara. In his dying moments, Shimazu is transported to a world of magic with other famous warriors throughout history. These warriors are forced to fight each other in an endless battle. Featured Crew Kenichi Suzuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yutaka Aoyama Hannibal Barca (voice) Yuichi Nakamura Toyohisa Shimazu (voice) Naoya Uchida Nobunaga Oda (voice) Mitsuki Saiga Yoichi Suketaka Nasu (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Drifters premiered on October  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2016-07-05 The Highschool Life of a Fudanshi 6.2    2016-07-08 Amanchu! 6.0    2016-10-08 Occultic;Nine 7.3    2015-07-02 Gangsta. 7.2    2016-10-06 Yuri!!! on Ice 8.3    2016-07-01 The Morose Mononokean 8.0    2015-07-03 Ushio to Tora 4.4    2016-04-07 Bungo Stray Dogs 7.3  Facts Original Name  ドリフターズ Status  Returning Series Network Certification R18+ Meaning Not for children under 18; this is limited to Adult \"Pay Per View\" VC 196 and 197. Content may include graphic violence, sexual situations, coarse language and explicit drug use. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords war anime Content Score 100 Yes! Looking good! Top Contributors 20 iliass guendouz 12 Elizabeth Jennings n 10 nakyl 8 ioneakatzuki  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}