{"link": "https://www.themoviedb.org/tv/63395?language=en", "title": "She's with Me", "resume": "Noa Holander has it all. She's one of the richest women in Israel. Her father is one of the one hundred richest men in the world. He owns a chain of international hotels, a private jet and anything you could possibly dream of. She lives in a mansion, she's beautiful, and she models and an acts just for the fun of it. Men want to be with her - women hate her (they're jealous, obviously). Over the past two years she's been having a highly publicized affair with Pete Evans, one of Hollywood's biggest stars. He's handsome, he's successful, he's rich - it's all perfect. And then they break up. According to the tabloids, he cheated on her. Amos Dahari is a 28-year-old guy still living with his parents in their tiny, cramped apartment in the city of Bat Yam. He works with them as well, in the family business - the bakery. He spends most of his days in front of the oven, baking pita bread, making minimum wage. When he's not working he's busy getting an earful from Vanessa - his girlfriend of nine years, who can't wait for him to whip out a ring and propose to her. Tonight, she's going to do it for him. They both - Noa and Amos - arrive at the same restaurant that night, the snazziest place in Tel Aviv. She's there to get over the breakup, and he's there to get out of an engagement. They meet by accident, an encounter they'll never forget, which leads to a love story both surprising and bigger than life. This love story seems entirely possible for a moment, but it's just that - a moment. Because Noa's father and Noa's agent, and Amos's family, and Amos's ex-girlfriend, and Noa's great big Hollywood ex, and the gaps, and the money, and of course the tabloids - and even their own selves, Noa and Amos - will put every possible obstacle in the way of this love. The climax comes in the last episode, when Pete Howens, the Hollywood ex, lands in Israel to get Noa back. And then Noa will have to choose - who it's going to be.", "rate": 0, "genre": ["Comedy", "Romance"], "cast": ["Rotem Sela", "Aviv Alush", "Hila Saada", "Mark Ivanir", "Shani Aviv"], "character": ["Noa Hollander", "Amos Dahari", "Vanessa Maimon", "Tzvika Granot", "Merav Dahari"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63395   Expand She's with Me   (2013) User Score Overview Noa Holander has it all. She's one of the richest women in Israel. Her father is one of the one hundred richest men in the world. He owns a chain of international hotels, a private jet and anything you could possibly dream of. She lives in a mansion, she's beautiful, and she models and an acts just for the fun of it. Men want to be with her - women hate her (they're jealous, obviously). Over the past two years she's been having a highly publicized affair with Pete Evans, one of Hollywood's biggest stars. He's handsome, he's successful, he's rich - it's all perfect. And then they break up. According to the tabloids, he cheated on her. Amos Dahari is a 28-year-old guy still living with his parents in their tiny, cramped apartment in the city of Bat Yam. He works with them as well, in the family business - the bakery. He spends most of his days in front of the oven, baking pita bread, making minimum wage. When he's not working he's busy getting an earful from Vanessa - his girlfriend of nine years, who can't wait for him to whip out a ring and propose to her. Tonight, she's going to do it for him. They both - Noa and Amos - arrive at the same restaurant that night, the snazziest place in Tel Aviv. She's there to get over the breakup, and he's there to get out of an engagement. They meet by accident, an encounter they'll never forget, which leads to a love story both surprising and bigger than life. This love story seems entirely possible for a moment, but it's just that - a moment. Because Noa's father and Noa's agent, and Amos's family, and Amos's ex-girlfriend, and Noa's great big Hollywood ex, and the gaps, and the money, and of course the tabloids - and even their own selves, Noa and Amos - will put every possible obstacle in the way of this love. The climax comes in the last episode, when Pete Howens, the Hollywood ex, lands in Israel to get Noa back. And then Noa will have to choose - who it's going to be. Featured Crew Assi Azar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rotem Sela Noa Hollander Aviv Alush Amos Dahari Hila Saada Vanessa Maimon Mark Ivanir Tzvika Granot Shani Aviv Merav Dahari Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of She's with Me premiered on May  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on She's with Me. You can help by rating TV shows you've seen. Facts Original Name  להיות איתה Status  Returning Series Network Certification  - Type  Scripted Original Language  Hebrew Runtime  - Homepage   http://www.mako.co.il/tv-she-is-with-me Genres Comedy Romance Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors a 24 adambakir92 m 22 mlevi 9 Elizabeth Jennings 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}