{"link": "https://www.themoviedb.org/tv/45482?language=en", "title": "A Touch of Cloth", "resume": "Hannah plays DI Jack Cloth, who is called in to investigate an apparent series of serial killings alongside his new partner, DC Anne Oldman, described as a \"plucky, no-nonsense sidekick\". Playing with the cliches and conventions of British police dramas, subplots include Cloth dealing with visions of his dead wife and the bisexual DC Oldman coming to grips with her feelings for both her female fiancee and Cloth.", "rate": 72, "genre": ["Comedy", "Crime"], "cast": ["Theo Barklem-Biggs", "John Hannah", "Navin Chowdhry", "Adrian Dunbar", "Suranne Jones"], "character": ["Darren Crossway", "DI Jack Cloth", "DC Asap Qureshi", "Damien Vull", "DI Anne Oldman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45482   Expand A Touch of Cloth   (2012) User Score Overview Hannah plays DI Jack Cloth, who is called in to investigate an apparent series of serial killings alongside his new partner, DC Anne Oldman, described as a \"plucky, no-nonsense sidekick\". Playing with the cliches and conventions of British police dramas, subplots include Cloth dealing with visions of his dead wife and the bisexual DC Oldman coming to grips with her feelings for both her female fiancee and Cloth. Featured Crew Charlie Brooker Creator Boris Starling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Theo Barklem-Biggs Darren Crossway John Hannah DI Jack Cloth Navin Chowdhry DC Asap Qureshi Adrian Dunbar Damien Vull Suranne Jones DI Anne Oldman Full Cast & Crew Last Season Season 3 2014 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2006-01-01 In Justice 6.8    2011-01-13 Kidnap and Ransom 7.6    2015-04-15 The Delivery Man 6.5    2016-06-08 Power Monkeys 7.0    2006-10-02 Three Sheets 7.3    2011-06-06 Injustice 7.3    2011-10-14 Spy 7.6    2010-09-28 Whites 6.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.sky.com/tv/show/a-touch-of-cloth Genres Comedy Crime Keywords england parody murder serial killer police detective criminal investigation sitcom british humour Content Score 93 Almost there... Top Contributors E 60 Elky 12 lineker O 10 Ozbourne 9 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}