{"link": "https://www.themoviedb.org/tv/7248?language=en", "title": "The Magic School Bus", "resume": "An eccentric schoolteacher takes her class on wondrous educational field trips with the help of a magical school bus.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Daniel DeSanto", "Stuart Stone", "Erica Luttrell", "Malcolm-Jamal Warner", "Danny Tamberelli"], "character": ["The Producer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7248   Expand The Magic School Bus   (1994) User Score Overview An eccentric schoolteacher takes her class on wondrous educational field trips with the help of a magical school bus. Featured Crew Joanna Cole Creator Bruce Degen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel DeSanto Stuart Stone Erica Luttrell Malcolm-Jamal Warner The Producer Danny Tamberelli Full Cast & Crew Last Season Season 4 1997 | 13 Episodes Season 4 of The Magic School Bus premiered on September 13, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The Magic School Bus Rides Again Open 0 by Mrs. William the Bloody\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  7 Recommendations   1996-09-02 Arthur 6.7    1993-09-10 Bill Nye The Science Guy 7.3    1995-09-13 The Drew Carey Show 6.4    1999-05-01 SpongeBob SquarePants 6.8    2002-06-07 Kim Possible 6.7    2008-10-03 Star Wars: The Clone Wars 7.4    1998-01-20 Dawson's Creek 6.0    1960-10-11 The Bugs Bunny Show 7.8  Facts Status  Ended Network Certification ALL Meaning This rating is for programming that is appropriate for all ages. This program usually involves programs designed for children or families. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors m 17 mikisoft Y 7 YJ 6 Elizabeth Jennings M 6 MLCHome  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}