{"link": "https://www.themoviedb.org/tv/62172?language=en", "title": "Gangland Undercover", "resume": "This drama series is a fictionalized retelling of the story of meth dealer-turned-ATF informant Charles Falco, who spent three years inside one of America's most dangerous motorcycle gangs, the Vagos. Although Falco originally took on the assignment to avoid spending 20 years in prison on drug charges, it eventually evolved into a quest for justice for him. “Gangland Undercover” documents the lives of outlaw bikers, who live in a world in which respect is earned through fear. The series is based on Falco's memoir, “Vagos, Mongols, and Outlaws,” and documented historical research of gang rivalries.", "rate": 75, "genre": ["Drama"], "cast": ["Damon Runyan", "Ari Cohen", "James Cade", "Ian Matthews", "Melanie Scrofano"], "character": ["Charles Falco", "Mike 'Koz' Kozinski", "Stash", "Darko", "Suzanna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62172   Expand Gangland Undercover   (2015) User Score  Play Trailer Overview This drama series is a fictionalized retelling of the story of meth dealer-turned-ATF informant Charles Falco, who spent three years inside one of America's most dangerous motorcycle gangs, the Vagos. Although Falco originally took on the assignment to avoid spending 20 years in prison on drug charges, it eventually evolved into a quest for justice for him. “Gangland Undercover” documents the lives of outlaw bikers, who live in a world in which respect is earned through fear. The series is based on Falco's memoir, “Vagos, Mongols, and Outlaws,” and documented historical research of gang rivalries. Featured Crew Charles Falco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Damon Runyan Charles Falco Ari Cohen Mike 'Koz' Kozinski James Cade Stash Ian Matthews Darko Melanie Scrofano Suzanna Full Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Gangland Undercover premiered on March  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   2012-09-25 Vegas 7.4    2007-02-26 The Black Donnellys 7.4    1999-01-10 The PJs 7.4    2016-01-26 Outsiders 6.7    2013-04-03 Rogue 7.1    2016-03-02 Hap and Leonard 7.3    2011-03-06 Breakout Kings 6.1    2004-02-24 Hustle 7.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   http://www.history.com/shows/gangland-undercover Genres Drama Keywords undercover agent outlaw organized crime motorcycle gang informant Content Score 100 Yes! Looking good! Top Contributors 39 Elizabeth Jennings G 13 GammPamm TB 7 TMDb Bot l 4 littleg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}