{"link": "https://www.themoviedb.org/tv/39677?language=en", "title": "Survivor Spain", "resume": "Survivor Spain is the Spanish version of the popular reality Survivor. This version of the show has aired on Spanish broadcast channels Telecinco, from 2000 to 2001 and 2006 to the present, Antena 3, from 2003 to 2005, and on laSiete from 2009 to the present. Throughout its time on air in Spain, Survivor has gone by many names. From 2000 to 2001 it was known as Supervivientes: Expedicion Robinson, a show that closely followed the American version of the program. From 2003 to 2004 it was known as La isla de los FamoS.O.S, which, unlike its previous incarnation, resembled more of a Big Brother format and included celebrities as contestants. In 2005, it was known as Aventura en África, and since 2006 it has been called simply Supervivientes. The prize for the winner has varied from season to season depending on the show's current format.", "rate": 20, "genre": ["Reality"], "cast": ["Jorge Javier Vázquez", "Sandra Barneda", "Lara Álvarez"], "character": ["Host", "Host", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39677   Expand Survivor Spain   (2006) User Score Overview Survivor Spain is the Spanish version of the popular reality Survivor. This version of the show has aired on Spanish broadcast channels Telecinco, from 2000 to 2001 and 2006 to the present, Antena 3, from 2003 to 2005, and on laSiete from 2009 to the present. Throughout its time on air in Spain, Survivor has gone by many names. From 2000 to 2001 it was known as Supervivientes: Expedicion Robinson, a show that closely followed the American version of the program. From 2003 to 2004 it was known as La isla de los FamoS.O.S, which, unlike its previous incarnation, resembled more of a Big Brother format and included celebrities as contestants. In 2005, it was known as Aventura en África, and since 2006 it has been called simply Supervivientes. The prize for the winner has varied from season to season depending on the show's current format. Featured Crew Charlie Parsons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jorge Javier Vázquez Host Sandra Barneda Host Lara Álvarez Host Full Cast & Crew Current Season Season 11 2018 | 109 Episodes Season 11 of Survivor Spain premiered on March 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Survivor Spain. You can help by rating TV shows you've seen. Facts Original Name  Supervivientes Status  Returning Series Network Certification  - Type  Reality Original Language  Spanish; Castilian Runtime  30m, 200m Homepage  - Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 40 LasSeries HS 32 Hugo S. 26 Elizabeth Jennings 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}