{"link": "https://www.themoviedb.org/tv/25117?language=en", "title": "Rocky Joe", "resume": "Joe Yabuki is a troubled youth, whose only solution to problems is throwing punches at them. What he lacks in manners and discipline, he makes up for with his self-taught fighting skills.\nOne day, while wandering the slums of Doya, Joe gets into a fight with the local gang. Although greatly outnumbered, he effortlessly defeats them, drawing the attention of Danpei Tange—a former boxing coach turned alcoholic. Seeing his potential, he offers to train Joe into Japan's greatest boxer. At first, Joe dismisses Danpei as a hopeless drunk; but after the trainer saves his life, he agrees to live with him and learn the art of boxing. Unfortunately, Joe's personality makes him an unruly student, and he often falls back to his old ways.\nTo survive the harsh world of his new career, Joe needs to trust his mentor and master the techniques taught to him. However, the road to becoming a professional boxer is rife with struggles that will test his mettle to the end.", "rate": 70, "genre": ["Animation", "Drama"], "cast": ["Masako Nozawa", "Fuyumi Shiraishi", "Shūsei Nakamura"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25117   Expand Rocky Joe   (1970) User Score  Play Trailer Overview Joe Yabuki is a troubled youth, whose only solution to problems is throwing punches at them. What he lacks in manners and discipline, he makes up for with his self-taught fighting skills. One day, while wandering the slums of Doya, Joe gets into a fight with the local gang. Although greatly outnumbered, he effortlessly defeats them, drawing the attention of Danpei Tange—a former boxing coach turned alcoholic. Seeing his potential, he offers to train Joe into Japan's greatest boxer. At first, Joe dismisses Danpei as a hopeless drunk; but after the trainer saves his life, he agrees to live with him and learn the art of boxing. Unfortunately, Joe's personality makes him an unruly student, and he often falls back to his old ways. To survive the harsh world of his new career, Joe needs to trust his mentor and master the techniques taught to him. However, the road to becoming a professional boxer is rife with struggles that will test his mettle to the end. Featured Crew Ikki Kajiwara Creator Tetsuya Chiba Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Fuyumi Shiraishi Shūsei Nakamura Full Cast & Crew Last Season Season 2 1980 | 47 Episodes Season 2 of Rocky Joe premiered on October 13, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rocky Joe. You can help by rating TV shows you've seen. Facts Original Name  あしたのジョー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords sport box anime Content Score 71 Just a little bit more... Top Contributors 12 BrerFox M 11 Migi 7 YabukiJoe1 k 5 kazuta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}