{"link": "https://www.themoviedb.org/tv/60621?language=en", "title": "El Príncipe", "resume": "An Intelligence Agent is sent to El Principe, on the border with Morocco, to investigate a possible police collaboration with a terrorist cell but finds unexpected love in the least suitable person: a drug baron's sister.", "rate": 100, "genre": ["Crime", "Drama"], "cast": ["Álex González", "Hiba Abouk", "José Coronado", "Rubén Cortada", "Jesús Castro"], "character": ["Javier Morey", "Fátima Ben Barek", "Francisco «Fran» Peyón", "Faruq Ben Barek", "Paco Ben Barek"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60621   Expand El Príncipe   (2014) User Score  Play Trailer Overview An Intelligence Agent is sent to El Principe, on the border with Morocco, to investigate a possible police collaboration with a terrorist cell but finds unexpected love in the least suitable person: a drug baron's sister. Featured Crew César Benítez Creator Aitor Gabilondo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Álex González Javier Morey Hiba Abouk Fátima Ben Barek José Coronado Francisco «Fran» Peyón Rubén Cortada Faruq Ben Barek Jesús Castro Paco Ben Barek Full Cast & Crew Last Season Season 2 2015 | 19 Episodes Season 2 of El Príncipe premiered on April 14, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on El Príncipe. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  75m Homepage   http://www.telecinco.es/elprincipe/ Genres Crime Drama Keywords telenovela Content Score 100 Yes! Looking good! Top Contributors V 21 Vaine M 14 Megacine 14 prm96 z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}