{"link": "https://www.themoviedb.org/tv/68358?language=en", "title": "The Princess Weiyoung", "resume": "Li Wei Young was born Princess Feng Xin Er, the third daughter of the proud royalty of the Northern Wei Dynasty. Although she never quite gets the affection of her family because she was born on a day deemed one of misfortune, Xin Er is pure of heart and sharp of mind. One fateful night, in a massacre rivaling few others, Xin Er’s kingdom is annihilated. Escaping with her life but now an orphan, Xin Er accidentally wanders into enemy territory. There, she assumes the identity of her savior Li Wei Young, the daughter of a tutor. Full of hatred for the enemy that destroyed her kingdom and lacking in the feminine graces expected in her time, the somewhat arrogant Wei Young has trouble fitting in. But, being both wise and pure of heart, she ultimately learns to channel her hatred towards those who deserve it and become a kinder person overall. And it is exactly her wisdom and humanity that attracts towards her two very different men. Tuoba Jun is the beloved, well-educated, kind prince that is favored by all, including the king, and who falls in love with Wei Young. And competing with him is his younger brother Tuoba Yu, the cold, menacing and emotionally scarred prince that truly wants to rule the empire, and sees the intelligent Wei Young as his tool and his elder sibling as his rival. Wei Young, however, only has her eyes on one thing: she was not able to save her people. Between the schemes of these two men and living in enemy territory, can Wei Young ever avenge her kingdom?", "rate": 58, "genre": ["Drama"], "cast": ["Tiffany Tang", "Luo Jin", "Vanness Wu", "Mao Xiao Tong", "Li Xin Ai"], "character": ["Li Weiyang / Xin'er", "Tuoba Jun", "Tuoba Yu", "Li Changru", "Li Changle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68358   Expand The Princess Weiyoung   (2016) User Score Overview Li Wei Young was born Princess Feng Xin Er, the third daughter of the proud royalty of the Northern Wei Dynasty. Although she never quite gets the affection of her family because she was born on a day deemed one of misfortune, Xin Er is pure of heart and sharp of mind. One fateful night, in a massacre rivaling few others, Xin Er’s kingdom is annihilated. Escaping with her life but now an orphan, Xin Er accidentally wanders into enemy territory. There, she assumes the identity of her savior Li Wei Young, the daughter of a tutor. Full of hatred for the enemy that destroyed her kingdom and lacking in the feminine graces expected in her time, the somewhat arrogant Wei Young has trouble fitting in. But, being both wise and pure of heart, she ultimately learns to channel her hatred towards those who deserve it and become a kinder person overall. And it is exactly her wisdom and humanity that attracts towards her two very different men. Tuoba Jun is the beloved, well-educated, kind prince that is favored by all, including the king, and who falls in love with Wei Young. And competing with him is his younger brother Tuoba Yu, the cold, menacing and emotionally scarred prince that truly wants to rule the empire, and sees the intelligent Wei Young as his tool and his elder sibling as his rival. Wei Young, however, only has her eyes on one thing: she was not able to save her people. Between the schemes of these two men and living in enemy territory, can Wei Young ever avenge her kingdom? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tiffany Tang Li Weiyang / Xin'er Luo Jin Tuoba Jun Vanness Wu Tuoba Yu Mao Xiao Tong Li Changru Li Xin Ai Li Changle Full Cast & Crew Last Season Season 1 2016 | 54 Episodes Season 1 of The Princess Weiyoung premiered on November 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2016-03-28 Jackpot 6.5    2016-07-24 Ice Fantasy 5.9  Facts Original Name  锦绣未央 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/5608057194 Genres Drama Keywords china romance Content Score 86 Almost there... Top Contributors M 43 Maria180493 b 4 boudhum 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}