{"link": "https://www.themoviedb.org/tv/70189?language=en", "title": "What on Earth?", "resume": "Satellites orbit Earth at 17,000 miles an hour, capturing images of our world that are breathtaking, but some are bizarre. This unique perspective reveals objects that seem to make no sense & phenomena that defy explanation. Such images force the question, what on Earth is that?", "rate": 70, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70189   Expand What on Earth?   (2015) User Score  Play Trailer Overview Satellites orbit Earth at 17,000 miles an hour, capturing images of our world that are breathtaking, but some are bizarre. This unique perspective reveals objects that seem to make no sense & phenomena that defy explanation. Such images force the question, what on Earth is that? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 4 2017 | 17 Episodes Season 4 of What on Earth? premiered on October 17, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply \"New\" Reruns Open 0 by Jetfire59\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on What on Earth?. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  44m Homepage   http://www.sciencechannel.com/tv-shows/what-on-earth/ Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 24 Elizabeth Jennings 4 tigru89 a 3 arcaida 3 oldboy3  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}