{"link": "https://www.themoviedb.org/tv/67177?language=en", "title": "Ruptures", "resume": "Ariane Beaumont, a promising young family law practitioner devotes her life to protect children. When professional issues force her to start her own practice, she discovers that saving others will come at a personal price.", "rate": 23, "genre": ["Drama"], "cast": ["Mélissa Désormeaux-Poulin", "Isabel Richer", "Normand D'Amour", "Vincent-Guillaume Otis", "Catherine Trudeau"], "character": ["Ariane Beaumont", "Claude Boily", "Jean-Luc De Vries", "Étienne Dalphond", "Marie Rousseau"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67177   Expand Ruptures   (2016) User Score Overview Ariane Beaumont, a promising young family law practitioner devotes her life to protect children. When professional issues force her to start her own practice, she discovers that saving others will come at a personal price. Featured Crew Fabienne Larouche Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mélissa Désormeaux-Poulin Ariane Beaumont Isabel Richer Claude Boily Normand D'Amour Jean-Luc De Vries Vincent-Guillaume Otis Étienne Dalphond Catherine Trudeau Marie Rousseau Full Cast & Crew Current Season Season 3 2018 | 5 Episodes Season 3 of Ruptures premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ruptures. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  French Runtime  42m Homepage   http://ruptures.radio-canada.ca Genres Drama Keywords lawyer divorce lawyer woman lawyer Content Score 93 Almost there... Top Contributors 55 Banana 9 Guipat N 4 Ney 1 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}