{"link": "https://www.themoviedb.org/tv/39485?language=en", "title": "Malviviendo", "resume": "Malviviendo is an online series produced by Diffferent and directed by David Sainz. In July 2011, the show released its fourteenth episode. The first episode launched in November 24, 2008 and became successful in a few months with positive reviews by the public.\nIt employs mostly amateur actors, and those involved in the series do it for free.\nThe series is set in the fictional neighborhood of \"Los Banderilleros\" of the Spanish city of Seville. The characters are a group of friends trapped in their everyday bad lives related to consumption of cannabis or other problems individual to each character.\nThe show contains allusions to and parodies of a variety of other series, including Dexter, My Name Is Earl, The Sopranos, Lost, ALF, The X-Files, Prison Break, Sex and the City, The Brady Bunch, South Park, Boardwalk Empire, The IT Crowd and How I Met Your Mother. Also the Spanish program Callejeros chain Cuatro in the fifth episode called Callejosos. In the third episode of the second season spoof the header of the series Misfits, but the content of the episode is a parody of the movie Inception.\nIn June 2009, the series got the support of Qualid. There it launched two mini-episodes minicapítulos. One focused on the character of Mateo and the other in \"el Puto\".", "rate": 70, "genre": ["Comedy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39485   Expand Malviviendo   (2008) User Score Overview Malviviendo is an online series produced by Diffferent and directed by David Sainz. In July 2011, the show released its fourteenth episode. The first episode launched in November 24, 2008 and became successful in a few months with positive reviews by the public. It employs mostly amateur actors, and those involved in the series do it for free. The series is set in the fictional neighborhood of \"Los Banderilleros\" of the Spanish city of Seville. The characters are a group of friends trapped in their everyday bad lives related to consumption of cannabis or other problems individual to each character. The show contains allusions to and parodies of a variety of other series, including Dexter, My Name Is Earl, The Sopranos, Lost, ALF, The X-Files, Prison Break, Sex and the City, The Brady Bunch, South Park, Boardwalk Empire, The IT Crowd and How I Met Your Mother. Also the Spanish program Callejeros chain Cuatro in the fifth episode called Callejosos. In the third episode of the second season spoof the header of the series Misfits, but the content of the episode is a parody of the movie Inception. In June 2009, the series got the support of Qualid. There it launched two mini-episodes minicapítulos. One focused on the character of Mateo and the other in \"el Puto\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2013 | 10 Episodes Season 3 of Malviviendo premiered on August  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Malviviendo. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.malviviendo.com Genres Comedy Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors F 3 FaustoJ 1 Dosedd 1 Trachemys PA 1 Paulo Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}