{"link": "https://www.themoviedb.org/tv/74044?language=en", "title": "Neo Yokio", "resume": "Joined by his faithful mecha-butler, Kaz Kaan pursues love, fashion and supernatural forces amid Neo Yokio's sinister high society.", "rate": 57, "genre": ["Animation"], "cast": ["Jaden Smith", "Jude Law", "Tavi Gevinson", "Susan Sarandon"], "character": ["Kaz Kaan (voice)", "Charles (voice)", "Helena St. Tessero (voice)", "Aunt Agatha (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74044   Expand Neo Yokio   (2017) User Score  Play Trailer Overview Joined by his faithful mecha-butler, Kaz Kaan pursues love, fashion and supernatural forces amid Neo Yokio's sinister high society. Featured Crew Ezra Koenig Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jaden Smith Kaz Kaan (voice) Jude Law Charles (voice) Tavi Gevinson Helena St. Tessero (voice) Susan Sarandon Aunt Agatha (voice) Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Neo Yokio premiered on September 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2016-07-05 Fangbone! 6.7    2016-12-08 The Cuba Libre Story 7.7    2016-08-12 Ask the Storybots 7.5    2015-09-08 Apaches 7.3    2017-09-20 Tiempos de guerra 7.0    2015-08-07 Project Mc² 4.7    2015-10-14 Call My Agent 8.2    2017-01-30 Bonus Family 8.5  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  23m Homepage   https://www.netflix.com/title/80152350 Genres Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 62 Elizabeth Jennings m 5 mehlizorg 4 Forrest73 4 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}