{"link": "https://www.themoviedb.org/tv/15069?language=en", "title": "American Masters", "resume": "American Masters is a PBS television show which produces biographies on artists, actors and writers of the United States who have left a profound impact on the nation's popular culture. It is produced by WNET in New York City. The show debuted on PBS in 1986.\nGroups or organizations featured include: Actors Studio, Algonquin Round Table, Group Theatre, Sweet Honey in the Rock, Women of Tin Pan Alley, Negro Ensemble Company, Juilliard School, the Beat Generation, The Singer-songwriters of the 1970s, Sun Records, Vaudeville, and Warner Bros. Pictures.", "rate": 78, "genre": ["Documentary", "News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15069   Expand American Masters   (1986) User Score  Play Trailer Overview American Masters is a PBS television show which produces biographies on artists, actors and writers of the United States who have left a profound impact on the nation's popular culture. It is produced by WNET in New York City. The show debuted on PBS in 1986. Groups or organizations featured include: Actors Studio, Algonquin Round Table, Group Theatre, Sweet Honey in the Rock, Women of Tin Pan Alley, Negro Ensemble Company, Juilliard School, the Beat Generation, The Singer-songwriters of the 1970s, Sun Records, Vaudeville, and Warner Bros. Pictures. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 32 2018 | 1 Episode Season 32 of American Masters premiered on January 19, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on American Masters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  90m Homepage   http://www.pbs.org/show/american-masters/ Genres Documentary News Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 48 Elizabeth Jennings 42 markt 3 SWFT 1 Nate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}