{"link": "https://www.themoviedb.org/tv/76506?language=en", "title": "Gold Rush: White Water", "resume": "Gold miners Dakota Fred and his son Dustin are back – returning to McKinley Creek Alaska, determined to make a fortune no matter the risk. But to find the big gold payout, they'll put their lives on the line by diving deep beneath the raging waters of one of Alaska's wildest creeks.", "rate": 93, "genre": ["Reality"], "cast": ["Fred Hurt", "Dustin Hurt"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76506   Expand Gold Rush: White Water   (2018) User Score  Play Trailer Overview Gold miners Dakota Fred and his son Dustin are back – returning to McKinley Creek Alaska, determined to make a fortune no matter the risk. But to find the big gold payout, they'll put their lives on the line by diving deep beneath the raging waters of one of Alaska's wildest creeks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Hurt Himself Dustin Hurt Himself Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Gold Rush: White Water premiered on January 19, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gold Rush: White Water. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  42m Homepage   https://www.discovery.com/tv-shows/gold-rush-white-water/ Genres Reality Keywords treasure treasure hunt gold miner Content Score 64 We're so close, yet so far. Top Contributors 15 Elizabeth Jennings 11 tigru89 6 oldboy3 s 5 svaraej  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}