{"link": "https://www.themoviedb.org/tv/68597?language=en", "title": "Martha & Snoop's Potluck Dinner Party", "resume": "The Queen of Cuisine and the King of Kush are coming together to invite their celebrity friends over for a little potluck fun. Games, recipes and musical guests. It's guaranteed to have everyone buzzing.", "rate": 95, "genre": ["Talk"], "cast": ["Martha Stewart", "Snoop Dogg"], "character": ["Herself - Host", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68597   Expand Martha & Snoop's Potluck Dinner Party   (2016) User Score  Play Trailer Overview The Queen of Cuisine and the King of Kush are coming together to invite their celebrity friends over for a little potluck fun. Games, recipes and musical guests. It's guaranteed to have everyone buzzing. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martha Stewart Herself - Host Snoop Dogg Himself - Host Full Cast & Crew Current Season Season 2 2017 | 8 Episodes Season 2 of Martha & Snoop's Potluck Dinner Party premiered on October 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Martha & Snoop's Potluck Dinner Party. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  39m, 21m Homepage   http://www.vh1.com/shows/martha-snoops-potluck-dinner-party Genres Talk Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 42 Elizabeth Jennings m 6 melianasaputri TB 1 TMDb Bot al 1 adi lutfi nagara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}