{"link": "https://www.themoviedb.org/tv/6094?language=en", "title": "Fantaghirò", "resume": "Fantaghirò is a 1999 Spanish animated television series that is based on the Italian fantasy movie series Fantaghirò.\nThe series was created by BRB Internacional with animation by Colorland Animation Production, with 26 episodes produced in all. The series is different from the films in that it is more fast-paced and light-hearted. Additionally, various places and people that were not named in the films have been given names in this series, such as the kingdoms of Tuan and Dana, which are Fantaghirò and Romualdo's respective home kingdoms.", "rate": 73, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Brigitte Nielsen", "Alessandra Martines", "Remo Girone", "Luca Venantini", "Kim Rossi Stuart"], "character": ["La sorcière Noire", "Fantaghiro", "Der Namenlose", "Ariès", "Romualdo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6094   Expand Fantaghirò   (1991) User Score Overview Fantaghirò is a 1999 Spanish animated television series that is based on the Italian fantasy movie series Fantaghirò. The series was created by BRB Internacional with animation by Colorland Animation Production, with 26 episodes produced in all. The series is different from the films in that it is more fast-paced and light-hearted. Additionally, various places and people that were not named in the films have been given names in this series, such as the kingdoms of Tuan and Dana, which are Fantaghirò and Romualdo's respective home kingdoms. Featured Crew Lamberto Bava Creator Gianni Romoli Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brigitte Nielsen La sorcière Noire Alessandra Martines Fantaghiro Remo Girone Der Namenlose Luca Venantini Ariès Kim Rossi Stuart Romualdo Full Cast & Crew Last Season Season 5 1996 | 2 Episodes Season 5 of Fantaghirò premiered on December 20, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Fantaghirò. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Miniseries Original Language  Italian Runtime  100m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors A 48 Antiq 30 kwagi_movie 21 Braemen 16 Baloralys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}