{"link": "https://www.themoviedb.org/tv/69225?language=en", "title": "ACCA: 13-Territory Inspection Dept.", "resume": "\"ACCA\" is a giant unified syndicate residing in a kingdom split into 13 autonomous regions. ACCA was formed back when there was threat of a coup d'etat, and has continued to protect the peace for almost one hundred years. Jean Otus, vice-chairman of the inspections department at ACCA headquarters, wanders through the 13 districts, checking to see if there is any foul play afoot. His quiet everyday life slowly gets swallowed up into the world's conspiracies!", "rate": 75, "genre": ["Animation"], "cast": ["Hiro Shimono", "Kenjirou Tsuda", "Aoi Yuki", "Junichi Suwabe", "Koji Yusa"], "character": ["Jean Otus (voice)", "Nino (voice)", "Lotta Otus (voice)", "Grossular (voice)", "Lilium (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69225   Expand ACCA: 13-Territory Inspection Dept.   (2017) User Score Overview \"ACCA\" is a giant unified syndicate residing in a kingdom split into 13 autonomous regions. ACCA was formed back when there was threat of a coup d'etat, and has continued to protect the peace for almost one hundred years. Jean Otus, vice-chairman of the inspections department at ACCA headquarters, wanders through the 13 districts, checking to see if there is any foul play afoot. His quiet everyday life slowly gets swallowed up into the world's conspiracies! Featured Crew Natsume Ono Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiro Shimono Jean Otus (voice) Kenjirou Tsuda Nino (voice) Aoi Yuki Lotta Otus (voice) Junichi Suwabe Grossular (voice) Koji Yusa Lilium (voice) Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of ACCA: 13-Territory Inspection Dept. premiered on January 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2014-01-11 No-Rin 6.0    2013-01-03 Choboraunyopomi Gekijou Ai Mai Mii 4.5    2016-10-06 Yuri!!! on Ice 8.3    2016-04-08 Shonen Maid 6.0    2014-01-05 Noragami 7.4    2009-01-24 Hetalia: Axis Powers 8.5    2017-01-07 Interviews with Monster Girls 7.2    2015-10-04 Attack on Titan: Junior High 7.0  Facts Original Name  ACCA13区監察課 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://acca-anime.com Genres Animation Keywords corruption espionage conspiracy social differences seinen anime Content Score 93 Almost there... Top Contributors 47 Marr 🇳🇱 17 Elizabeth Jennings Z 15 Zayrus 13 Shadofu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}