{"link": "https://www.themoviedb.org/tv/32552?language=en", "title": "The Gates", "resume": "Like most families that settle inside The Gates, the Monahans are unmoored from a complicated life they abandoned in Chicago. There's something very different about this place, almost... haunting. Named the new police chief of The Gates, Nick Monahan is about to be tangled up in a mystery where he will begin to piece together the dark truth about their new home, and the supernatural elements that lurk behind the shadows of The Gates.", "rate": 68, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Frank Grillo", "Marisol Nichols", "Rhona Mitra", "Luke Mably", "Chandra West"], "character": ["Nick Monohan", "Sarah Monohan", "Claire Radcliff", "Dylan Radcliff", "Devon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32552   Expand The Gates   (2010) User Score Overview Like most families that settle inside The Gates, the Monahans are unmoored from a complicated life they abandoned in Chicago. There's something very different about this place, almost... haunting. Named the new police chief of The Gates, Nick Monahan is about to be tangled up in a mystery where he will begin to piece together the dark truth about their new home, and the supernatural elements that lurk behind the shadows of The Gates. Featured Crew Richard Hatem Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  16 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Grillo Nick Monohan Marisol Nichols Sarah Monohan Rhona Mitra Claire Radcliff Luke Mably Dylan Radcliff Chandra West Devon Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of The Gates premiered on June 20, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  16 Posters  2 Recommendations   2011-02-07 The Chicago Code 7.3    2011-09-05 Zig and Sharko 5.3    2013-08-04 Southcliffe 7.4    2015-11-27 South of Hell 5.9    2010-01-06 Republic of Doyle 7.3    1998-09-09 First Wave 6.6    2009-01-05 Being Erica 5.8    2011-08-05 Friends with Benefits 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 98m Homepage   http://www.abc.go.com/shows/the-gates Genres Drama Mystery Sci-Fi & Fantasy Keywords vampire supernatural suburb succubus neighborhood chief of police gated community Content Score 93 Almost there... Top Contributors 64 Medianoche 10 Elizabeth Jennings 9 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}