{"link": "https://www.themoviedb.org/tv/249?language=en", "title": "Clarissa Explains It All", "resume": "Clarissa Explains It All is an American teen sitcom that aired on Nickelodeon. Created by Mitchell Kriegman, it aired for five seasons for a total of 65 episodes from March 23, 1991, to December 3, 1994, and then went into reruns.\nIn the series, Clarissa Darling, who is played by Melissa Joan Hart, is a teen girl who addresses the audience directly to describe the things that are happening in her life, dealing with typical pre-adolescent concerns such as school, boys, pimples, wearing her first training bra and an annoying little brother. Reruns of the show have appeared intermittently on TeenNick's channel block The '90s Are All That since July 25, 2011.", "rate": 63, "genre": ["Comedy"], "cast": ["Melissa Joan Hart", "Jason Zimbler", "Elizabeth Hess", "Joe O'Connor", "Sean O'Neal"], "character": ["Clarissa Marie Darling", "Ferguson W. Darling", "Janet Darling", "Marshall Darling", "Samuel \"Sam\" Anders"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 249   Expand Clarissa Explains It All   (1991) User Score Overview Clarissa Explains It All is an American teen sitcom that aired on Nickelodeon. Created by Mitchell Kriegman, it aired for five seasons for a total of 65 episodes from March 23, 1991, to December 3, 1994, and then went into reruns. In the series, Clarissa Darling, who is played by Melissa Joan Hart, is a teen girl who addresses the audience directly to describe the things that are happening in her life, dealing with typical pre-adolescent concerns such as school, boys, pimples, wearing her first training bra and an annoying little brother. Reruns of the show have appeared intermittently on TeenNick's channel block The '90s Are All That since July 25, 2011. Featured Crew Mitchell Kriegman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melissa Joan Hart Clarissa Marie Darling Jason Zimbler Ferguson W. Darling Elizabeth Hess Janet Darling Joe O'Connor Marshall Darling Sean O'Neal Samuel \"Sam\" Anders Full Cast & Crew Last Season Season 5 1993 | 13 Episodes Season 5 of Clarissa Explains It All premiered on October 23, 1993. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Ferguson: Happy Birthday Jason Michael Zimbler! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1994-10-30 Aaahh!!! Real Monsters 6.4    1998-10-22 The Worst Witch 6.6    1996-07-15 Kenan & Kel 7.4    1993-09-18 Rocko's Modern Life 7.7    1991-07-04 Salute Your Shorts 7.5    1993-11-28 The Adventures of Pete & Pete 8.1    1996-10-07 Hey Arnold! 6.8    1999-10-16 The Amanda Show 5.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 10 hpcodecraft w 5 wonder2wonder 3 danimados a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}