{"link": "https://www.themoviedb.org/tv/333?language=en", "title": "Dae Jang Geum", "resume": "Starring Lee Young Ae, it tells the tale of an orphaned kitchen cook who went on to become the king's first female physician. In a time when women held little influence in society, young apprentice cook Jang Geum strives to learn the secrets of Korean cooking and medicine in order to cure the King of his various ailments. It is based on the true story of Jang-geum, the first female royal physician of the Joseon Dynasty. The main themes are her perseverance and the portrayal of traditional Korean culture, including Korean royal court cuisine and traditional medicine.", "rate": 94, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 333   Expand Dae Jang Geum   (2003) User Score Overview Starring Lee Young Ae, it tells the tale of an orphaned kitchen cook who went on to become the king's first female physician. In a time when women held little influence in society, young apprentice cook Jang Geum strives to learn the secrets of Korean cooking and medicine in order to cure the King of his various ailments. It is based on the true story of Jang-geum, the first female royal physician of the Joseon Dynasty. The main themes are her perseverance and the portrayal of traditional Korean culture, including Korean royal court cuisine and traditional medicine. Featured Crew Kim Yeong-Hyeon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2003 | 54 Episodes Season 1 of Dae Jang Geum premiered on September 15, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dae Jang Geum. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2009-05-25 The Great Queen Seondeok 8.4    2010-03-22 Dong Yi 8.2  Facts Original Name  대장금 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  80m, 60m Homepage   http://www.imbc.com/broad/tv/drama/daejanggum/index.html Genres Drama Keywords korea medical drama Content Score 64 We're so close, yet so far. Top Contributors D 38 Dorin147 t 29 tmdb38202327 z 10 zurman1 G 4 Goldfinger1964  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}