{"link": "https://www.themoviedb.org/tv/406?language=en", "title": "Ӕon Flux", "resume": "Æon Flux is set in a bizarre, dystopian future world. The title character is a tall, leather-clad secret agent from the nation of Monica, skilled in assassination and acrobatics. Her mission is to infiltrate the strongholds of the neighboring country of Bregna, which is led by her sometimes-nemesis and sometimes-lover Trevor Goodchild. Monica represents a dynamic anarchist society, while Bregna embodies a police state.", "rate": 67, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 406   Expand Ӕon Flux   (1991) User Score Overview Æon Flux is set in a bizarre, dystopian future world. The title character is a tall, leather-clad secret agent from the nation of Monica, skilled in assassination and acrobatics. Her mission is to infiltrate the strongholds of the neighboring country of Bregna, which is led by her sometimes-nemesis and sometimes-lover Trevor Goodchild. Monica represents a dynamic anarchist society, while Bregna embodies a police state. Featured Crew Peter Chung Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1995 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Ӕon Flux. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1990-09-10 Captain Planet and the Planeteers 5.9    1963-09-16 The Outer Limits 7.8    2008-01-13 Terminator: The Sarah Connor Chronicles 7.3  Facts Status  Ended Networks - Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mtv.com/shows/aeon_flux/series.jhtml Genres Animation Keywords cyberpunk Content Score 64 We're so close, yet so far. Top Contributors SC 14 Steven C 8 Renato d 7 denis 5 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}