{"link": "https://www.themoviedb.org/tv/16034?language=en", "title": "Inside MMA", "resume": "Inside MMA on Mark Cuban's HDNet television network combines the strengths of the best news and sports programs on television to go deeper into the world of mixed martial arts than any other show can. A combination of talk, highlights, analysis and in-depth reporting allow the show to cover the fighting world from every angle. Since its inception in 2007, “Inside MMA” has pioneered mixed martial arts coverage and is credited with helping one of the fastest growing sports in the world continue it’s massive growth and gain mainstream acceptance.\nAward winning sports reporter, Kenny Rice, co-hosts with former UFC heavyweight champion and King of Pancrase, Bas Rutten, as they welcome the biggest personalities in MMA. The humor and enthusiasm of Rutten and his years of experience as a premiere fighter and coach compliment Rice and his hard-nosed journalistic style that doesn’t shy from the many controversies that surround the sport.\nThe show attracts the leading experts in the sport of MMA, the athletes. Fighters such as UFC champions Randy Couture, Chuck Liddell and Georges St-Pierre spend an hour each week with Kenny and Bas to give viewers a glimpse into their lives as top tier athletes. Renowned trainers, journalists, entertainers and executives also help Rutten and Rice break down the most important topics, biggest fights and best highlights in the game.", "rate": 80, "genre": [], "cast": ["Bas Rutten"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16034   Expand Inside MMA   (2007) User Score Overview Inside MMA on Mark Cuban's HDNet television network combines the strengths of the best news and sports programs on television to go deeper into the world of mixed martial arts than any other show can. A combination of talk, highlights, analysis and in-depth reporting allow the show to cover the fighting world from every angle. Since its inception in 2007, “Inside MMA” has pioneered mixed martial arts coverage and is credited with helping one of the fastest growing sports in the world continue it’s massive growth and gain mainstream acceptance. Award winning sports reporter, Kenny Rice, co-hosts with former UFC heavyweight champion and King of Pancrase, Bas Rutten, as they welcome the biggest personalities in MMA. The humor and enthusiasm of Rutten and his years of experience as a premiere fighter and coach compliment Rice and his hard-nosed journalistic style that doesn’t shy from the many controversies that surround the sport. The show attracts the leading experts in the sport of MMA, the athletes. Fighters such as UFC champions Randy Couture, Chuck Liddell and Georges St-Pierre spend an hour each week with Kenny and Bas to give viewers a glimpse into their lives as top tier athletes. Renowned trainers, journalists, entertainers and executives also help Rutten and Rice break down the most important topics, biggest fights and best highlights in the game. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bas Rutten Full Cast & Crew Last Season Season 7 2013 | 7 Episodes Season 7 of Inside MMA premiered on January 11, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Inside MMA. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hd.net/insidemma.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}