{"link": "https://www.themoviedb.org/tv/2690?language=en", "title": "The Two Ronnies", "resume": "The Two Ronnies is a British sketch show which aired on BBC1 from 1971 to 1987. It featured the double act of Ronnie Barker and Ronnie Corbett, the \"Two Ronnies\" of the title.", "rate": 90, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2690   Expand The Two Ronnies   (1971) User Score Overview The Two Ronnies is a British sketch show which aired on BBC1 from 1971 to 1987. It featured the double act of Ronnie Barker and Ronnie Corbett, the \"Two Ronnies\" of the title. Featured Crew Ronnie Corbett Creator Ronnie Barker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 13 1985 | 8 Episodes Season 13 of The Two Ronnies premiered on December 25, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1990-09-27 Rab C. Nesbitt 7.1    1961-10-12 The Morecambe & Wise Show 5.1    1981-02-26 Hi-de-Hi! 7.3    2009-01-03 Total Wipeout 5.3    2002-11-14 Harry Hill's TV Burp 7.2    1998-11-12 Dinnerladies 6.4    1974-01-03 It Ain't Half Hot Mum 8.0    1976-02-20 Open All Hours 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 45m Homepage  - Genres Comedy Keywords sketch comedy double act british humour Content Score 64 We're so close, yet so far. Top Contributors O 6 Ozbourne 1 Adam Francis Knight  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}