{"link": "https://www.themoviedb.org/tv/3540?language=en", "title": "Kenny vs. Spenny", "resume": "Kenny vs. Spenny show stars Kenny Hotz and Spencer Rice, who face each other in various competitions. The loser of each episode must perform an act of humiliation, usually selected by the winner. Hotz created the series, and it is typically shot in their hometown of Toronto, Ontario, based mostly out of the house they shared. As of November 2008, the show airs on CBC, Global and Showcase in Canada, on Comedy Central in Germany and the Netherlands, on The Comedy Channel in Australia, on Sony Max in South Africa, on FX in Portugal, on JIM in Finland, and on Comedy Central in Sweden. The series concluded with an hour-long Christmas special that aired on December 23, 2010, at 9 pm ET/PT on Showcase.\nThe series was nominated for the Canadian Comedy Awards in 2010 and 2011 and for Gemini Awards in 2005, 2006, and 2008 as the best Canadian comedy series, and received a Rose d'Or nomination in Switzerland for \"best international comedy series\". The show has spawned several replicas of its format, including a family-friendly French Canadian version called Frank vs Girard that airs on VRAK.TV. Also following the format are Ed vs. Spencer in the United Kingdom, Juan vs. Roman in Latin America, Elton vs. Simon in Germany, Katja vs. Bridget and Dennis vs. Valerio in the Netherlands, \"Sid vs. Varun\" in India. The show was named #8 among the top 10 Canadian television shows of the 21st century.", "rate": 76, "genre": ["Comedy"], "cast": ["Kenny Hotz", "Spencer Rice"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3540   Expand Kenny vs. Spenny   (2003) User Score  Play Trailer Overview Kenny vs. Spenny show stars Kenny Hotz and Spencer Rice, who face each other in various competitions. The loser of each episode must perform an act of humiliation, usually selected by the winner. Hotz created the series, and it is typically shot in their hometown of Toronto, Ontario, based mostly out of the house they shared. As of November 2008, the show airs on CBC, Global and Showcase in Canada, on Comedy Central in Germany and the Netherlands, on The Comedy Channel in Australia, on Sony Max in South Africa, on FX in Portugal, on JIM in Finland, and on Comedy Central in Sweden. The series concluded with an hour-long Christmas special that aired on December 23, 2010, at 9 pm ET/PT on Showcase. The series was nominated for the Canadian Comedy Awards in 2010 and 2011 and for Gemini Awards in 2005, 2006, and 2008 as the best Canadian comedy series, and received a Rose d'Or nomination in Switzerland for \"best international comedy series\". The show has spawned several replicas of its format, including a family-friendly French Canadian version called Frank vs Girard that airs on VRAK.TV. Also following the format are Ed vs. Spencer in the United Kingdom, Juan vs. Roman in Latin America, Elton vs. Simon in Germany, Katja vs. Bridget and Dennis vs. Valerio in the Netherlands, \"Sid vs. Varun\" in India. The show was named #8 among the top 10 Canadian television shows of the 21st century. Featured Crew Kenny Hotz Creator Spencer Rice Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenny Hotz Spencer Rice Full Cast & Crew Last Season Season 6 2009 | 13 Episodes Season 6 of Kenny vs. Spenny premiered on November 20, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations   2005-03-11 Wonder Showzen 7.4    2013-10-31 Darknet 7.0    2010-02-19 The Ricky Gervais Show 7.9    2012-08-08 Here Comes Honey Boo Boo 1.9    1992-05-25 The Tonight Show with Jay Leno 5.0    2007-02-01 The Sarah Silverman Program 5.8    2013-07-09 Drunk History 7.2    1995-11-03 Mr. Show with Bob and David 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors D 2 Daniel T 2 Tim TB 1 TMDb Bot d 1 dmfawaz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}