{"link": "https://www.themoviedb.org/tv/30986?language=en", "title": "Speed Racer", "resume": "Teenager Speed Racer aspires to be the world's best race-car champion with the help of his friends, family and his father's high-tech race-car, the Mach 5.", "rate": 73, "genre": ["Action", "Adventure", "Animation", "Family"], "cast": ["Katsuji Mori", "Teiji Ōmiya", "Ryoko Kinomiya", "Junko Hori", "Kei Tomiyama"], "character": ["Speed Racer", "Pops Racer", "Mom Racer", "Kurio Mifune", "Sparky"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30986   Expand Speed Racer   (1967) User Score  Play Trailer Overview Teenager Speed Racer aspires to be the world's best race-car champion with the help of his friends, family and his father's high-tech race-car, the Mach 5. Featured Crew Tatsuo Yoshida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katsuji Mori Speed Racer Teiji Ōmiya Pops Racer Ryoko Kinomiya Mom Racer Junko Hori Kurio Mifune Kei Tomiyama Sparky Full Cast & Crew Last Season Season 1 1967 | 52 Episodes Season 1 of Speed Racer premiered on September 23, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   1961-09-24 The Bullwinkle Show 7.4    1976-01-27 Laverne & Shirley 6.7    1970-09-19 The Mary Tyler Moore Show 7.2  Facts Original Name  Mahha GoGoGo Status  Ended Networks - Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Family Keywords racing based on manga gadget car Content Score 100 Yes! Looking good! Top Contributors 21 nujackk 7 Banana z 5 zurman1 4 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}