{"link": "https://www.themoviedb.org/tv/64671?language=en", "title": "The Asterisk War", "resume": "Invertia was a meteor storm that caused an unprecedented disaster  during the 20th century. Because of this disaster, numerous cities  around the world were destroyed. However, within the meteor, an unknown  element called mana was discovered. It allowed human technology to make  rapid strides giving rise to a new species of super-powered humans, the  Star Pulse Generation (Genestella). The Festas (Star Warrior Festivals)  host battles between Genestella at a city of six academies called  “Rikka,” also commonly known as “Asterisk.”\nScholarship student Ayato  Amagiri transferred into Seidoukan Academy in order to fulfill his own  wish, swearing he too will fight in this city.", "rate": 54, "genre": ["Action", "Animation", "Science", "Fiction"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64671   Expand The Asterisk War   (2015) User Score Overview Invertia was a meteor storm that caused an unprecedented disaster  during the 20th century. Because of this disaster, numerous cities  around the world were destroyed. However, within the meteor, an unknown  element called mana was discovered. It allowed human technology to make  rapid strides giving rise to a new species of super-powered humans, the  Star Pulse Generation (Genestella). The Festas (Star Warrior Festivals)  host battles between Genestella at a city of six academies called  “Rikka,” also commonly known as “Asterisk.” Scholarship student Ayato  Amagiri transferred into Seidoukan Academy in order to fulfill his own  wish, swearing he too will fight in this city. Featured Crew Manabu Ono Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of The Asterisk War premiered on April  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   2015-04-03 Food Wars!: Shokugeki no Soma 7.9  Facts Original Name  学戦都市アスタリスク Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://asterisk-war.com Genres Action Animation Science Fiction Keywords swordplay harem ecchi based on light novel anime Content Score 64 We're so close, yet so far. Top Contributors 98 Marr 🇳🇱 w 28 woogley 25 Elizabeth Jennings Z 18 Zayrus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}