{"link": "https://www.themoviedb.org/tv/66230?language=en", "title": "Flowers", "resume": "Dark comedy about the eccentric members of the Flowers family. Maurice and Deborah are barely together but yet to divorce. They live with Maurice's batty mother and their maladjusted twin children.", "rate": 67, "genre": ["Comedy"], "cast": ["Olivia Colman", "Julian Barratt", "Sophia Di Martino", "Daniel Rigby", "Will Sharpe"], "character": ["Deborah Flowers", "Maurice Flowers", "Amy Flowers", "Donald Flowers", "Shun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66230   Expand Flowers   (2016) User Score  Play Trailer Overview Dark comedy about the eccentric members of the Flowers family. Maurice and Deborah are barely together but yet to divorce. They live with Maurice's batty mother and their maladjusted twin children. Featured Crew Will Sharpe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olivia Colman Deborah Flowers Julian Barratt Maurice Flowers Sophia Di Martino Amy Flowers Daniel Rigby Donald Flowers Will Sharpe Shun Full Cast & Crew Current Season Season 2 2018 | 2 Episodes Season 2 of Flowers premiered on June 11, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Flowers. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2011-05-02 Case Sensitive 5.4    2013-02-27 Lightfields 7.5    2016-06-08 Power Monkeys 7.0    2016-07-04 Brief Encounters 7.3    2011-09-14 Free Agents 4.8    2015-06-30 Not Safe for Work 7.3    2006-01-01 In Justice 6.8    2009-01-12 Unforgiven 7.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.channel4.com/programmes/flowers Genres Comedy Keywords dysfunctional family eccentric british humour Content Score 100 Yes! Looking good! Top Contributors 18 EveDemocracy 18 Elizabeth Jennings 4 charlieaus O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}