{"link": "https://www.themoviedb.org/tv/38165?language=en", "title": "ThunderCats", "resume": "ThunderCats is an American/Japanese animated television series, produced by Ethan Spaulding and Michael Jelenic. A reboot of the original 1980s TV series of the same name, ThunderCats was developed by Warner Bros. Animation and Studio 4°C, and combined elements of western animation, with Japanese anime. The series began with an hour-long premiere on Cartoon Network on July 29, 2011.\nFollowing the destruction of their home, the kingdom of Thundera, the ThunderCats are forced to roam the planet Third Earth, in order to find a way to defeat the evil sorcerer Mumm-Ra, who plans on taking over the universe. Story-wise the series attempts to take a much darker and more cinematic approach than the original show, featuring a lot more focus on characterization and more sophisticated themes.\nInitially planned for 52 episodes, it was confirmed by ThunderCats art-director Dan Norton in early 2013 that the show had been canceled after only one season. Reruns of the show later aired on Adult Swim's Toonami block.", "rate": 67, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Animation"], "cast": ["Will Friedle", "Emmanuelle Chriqui", "Kevin Michael Richardson", "Satomi Kōrogi", "Robin Atkin Downes"], "character": ["Lion-O", "Cheetara", "Panthro", "Snarf", "Mumm-Ra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38165   Expand ThunderCats   (2011) User Score Overview ThunderCats is an American/Japanese animated television series, produced by Ethan Spaulding and Michael Jelenic. A reboot of the original 1980s TV series of the same name, ThunderCats was developed by Warner Bros. Animation and Studio 4°C, and combined elements of western animation, with Japanese anime. The series began with an hour-long premiere on Cartoon Network on July 29, 2011. Following the destruction of their home, the kingdom of Thundera, the ThunderCats are forced to roam the planet Third Earth, in order to find a way to defeat the evil sorcerer Mumm-Ra, who plans on taking over the universe. Story-wise the series attempts to take a much darker and more cinematic approach than the original show, featuring a lot more focus on characterization and more sophisticated themes. Initially planned for 52 episodes, it was confirmed by ThunderCats art-director Dan Norton in early 2013 that the show had been canceled after only one season. Reruns of the show later aired on Adult Swim's Toonami block. Featured Crew Tobin Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Friedle Lion-O Emmanuelle Chriqui Cheetara Kevin Michael Richardson Panthro Satomi Kōrogi Snarf Robin Atkin Downes Mumm-Ra Full Cast & Crew Last Season Season 1 2011 | 26 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2002-08-16 He-Man and the Masters of the Universe 6.7    1993-09-06 Adventures of Sonic the Hedgehog 4.9    1999-10-04 Sonic Underground 2.0    2003-07-11 Spider-Man: The New Animated Series 6.5    1994-09-24 Fantastic Four 6.7    1991-02-25 The Pirates of Dark Water 6.8    1990-09-08 The Adventures of Super Mario Bros. 3 6.2    2010-11-26 Transformers: Prime 7.4  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cartoonnetwork.com/tv_shows/thundercats/index.html Genres Sci-Fi & Fantasy Action & Adventure Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 10 Rebecca z 10 zurman1 d 6 denis 4 theramyz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}