{"link": "https://www.themoviedb.org/tv/29452?language=en", "title": "Heidi, Girl of the Alps", "resume": "Heidi after becoming an orphan is forced to live with her grandfather Öhi who lives in the mountain Alps. However he is a very bitter man who only accepts to take her in by force. Heidi's kindness may be able to open Öhi's heart. Along with Peter the goat carer and the crippled Klara, Heidi has a lot of adventures.", "rate": 75, "genre": ["Animation"], "cast": ["Noriko Ohara", "Kazuko Sugiyama", "Rihoko Yoshida", "Kōhei Miyauchi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29452   Expand Heidi, Girl of the Alps   (1974) User Score Overview Heidi after becoming an orphan is forced to live with her grandfather Öhi who lives in the mountain Alps. However he is a very bitter man who only accepts to take her in by force. Heidi's kindness may be able to open Öhi's heart. Along with Peter the goat carer and the crippled Klara, Heidi has a lot of adventures. Featured Crew Isao Takahata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noriko Ohara  Kazuko Sugiyama Rihoko Yoshida Kōhei Miyauchi Full Cast & Crew Last Season Season 1 1974 | 52 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1975-05-01 The Adventures of Maya the Honey Bee 6.6    1972-12-03 Mazinger Z 8.1    1979-04-02 Doraemon 5.6    1981-10-09 Dogtanian and the Three Muskehounds 6.5    1983-08-01 Around the World with Willy Fog 7.8    1949-09-16 The Road Runner Show 8.0    1983-10-13 Captain Tsubasa 7.0    1961-09-27 Top Cat 6.9  Facts Original Name  アルプスの少女ハイジ Status  Ended Networks - Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords cartoon children alm Content Score 93 Almost there... Top Contributors j 21 j49 d 18 dune2000 w 13 waRhawK 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}