{"link": "https://www.themoviedb.org/tv/3926?language=en", "title": "Hello! My Lady", "resume": "Hello! Miss is a 2007 South Korean television series starring Lee Da-hae, Lee Ji-hoon, Ha Seok-jin and Yeon Mi-joo. Based on Lee Ji-wan's novel Five Kimchi Mandu, the series aired on KBS2 from March 19 to May 8, 2007 on Mondays and Tuesdays at 21:55 for 16 episodes.", "rate": 65, "genre": ["Drama", "Comedy"], "cast": ["Lee Da-hae", "Lee Ji-hoon", "Jang Young-ran", "Ha Seok-jin", "Kim Hyun-ju"], "character": ["Lee Su-Ha", "Hwang Dong-Kyu", "Hwang Chan-Min"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3926   Expand Hello! My Lady   (2007) User Score Overview Hello! Miss is a 2007 South Korean television series starring Lee Da-hae, Lee Ji-hoon, Ha Seok-jin and Yeon Mi-joo. Based on Lee Ji-wan's novel Five Kimchi Mandu, the series aired on KBS2 from March 19 to May 8, 2007 on Mondays and Tuesdays at 21:55 for 16 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Da-hae Lee Su-Ha Lee Ji-hoon Hwang Dong-Kyu Jang Young-ran Ha Seok-jin Hwang Chan-Min Kim Hyun-ju Full Cast & Crew Last Season Hello, lady! season 1 2007 | 16 Episodes Season 1 of Hello! My Lady premiered on March 19, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hello! My Lady. You can help by rating TV shows you've seen. Facts Original Name  헬로! 애기씨 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m, 120m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 11 Elizabeth Jennings 9 sansalayne N 7 Nightowl.Kr 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}