{"link": "https://www.themoviedb.org/tv/70112?language=en", "title": "The Good Karma Hospital", "resume": "The story of British-Asian junior doctor Ruby Walker who arrives at the run-down Good Karma Hospital to join a dedicated team of over-worked medics. Run by a gloriously eccentric Englishwoman, Lydia Fonseca, this under-funded but creatively resourceful cottage hospital is the beating heart of the local community. It’s much more than just a medical outpost - it’s a home.", "rate": 82, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70112   Expand The Good Karma Hospital   (2017) User Score  Play Trailer Overview The story of British-Asian junior doctor Ruby Walker who arrives at the run-down Good Karma Hospital to join a dedicated team of over-worked medics. Run by a gloriously eccentric Englishwoman, Lydia Fonseca, this under-funded but creatively resourceful cottage hospital is the beating heart of the local community. It’s much more than just a medical outpost - it’s a home. Featured Crew Dan Sefton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 6 Episodes Season 2 of The Good Karma Hospital premiered on March 18, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Just started watching on Acorn TV Open 0 by lantzn\n      \n     t Great Show! Open 0 by thebigW\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Good Karma Hospital. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords hospital doctor india south india Content Score 71 Just a little bit more... Top Contributors 72 CouchTater 13 Elizabeth Jennings 5 scorpio686 3 inframundo10  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}