{"link": "https://www.themoviedb.org/tv/4270?language=en", "title": "Living Single", "resume": "Living Single is an American television sitcom that aired for five seasons on the Fox network from August 22, 1993, to January 1, 1998. The show centered on the lives of six friends who share personal and professional experiences while living in a Brooklyn brownstone.\nThroughout its run, Living Single became one of the most popular African-American sitcoms of its era, ranking among the top five in African-American ratings in all five seasons. The series was produced by Yvette Lee Bowser's company, Sister Lee, in association with Warner Bros. Television. In contrast to the popularity of NBC's \"Must See TV\" on Thursday nights in the 1990s, many African American and Latino viewers flocked to Fox's Thursday night line-up of Martin, Living Single, and New York Undercover. In fact, these were the three highest-rated series among black households for the 1996–1997 season.", "rate": 88, "genre": ["Comedy"], "cast": ["Kim Coles", "Terrence 'T.C.' Carson", "John Henton", "Erika Alexander", "Kim Fields"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4270   Expand Living Single   (1993) User Score Overview Living Single is an American television sitcom that aired for five seasons on the Fox network from August 22, 1993, to January 1, 1998. The show centered on the lives of six friends who share personal and professional experiences while living in a Brooklyn brownstone. Throughout its run, Living Single became one of the most popular African-American sitcoms of its era, ranking among the top five in African-American ratings in all five seasons. The series was produced by Yvette Lee Bowser's company, Sister Lee, in association with Warner Bros. Television. In contrast to the popularity of NBC's \"Must See TV\" on Thursday nights in the 1990s, many African American and Latino viewers flocked to Fox's Thursday night line-up of Martin, Living Single, and New York Undercover. In fact, these were the three highest-rated series among black households for the 1996–1997 season. Featured Crew Yvette Lee Bowser Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Coles Terrence 'T.C.' Carson John Henton Erika Alexander Kim Fields Full Cast & Crew Last Season Season 5 1997 | 13 Episodes Season 5 of Living Single premiered on September 11, 1997. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Now streaming on Hulu. Open 0 by MirrorMask\n      \n     First One!! Open 3 by  MirrorMask Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Living Single. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 2 Russ007  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}