{"link": "https://www.themoviedb.org/tv/59312?language=en", "title": "The Bletchley Circle", "resume": "The Bletchley Circle follows the journey of four ordinary women with extraordinary skills that helped to end World War II. Set in 1952, Susan, Millie, Lucy and Jean have returned to their normal lives, modestly setting aside the part they played in producing crucial intelligence, which helped the Allies to victory and shortened the war. When Susan discovers a hidden code behind an unsolved murder she is met by skepticism from the police. She quickly realises she can only begin to crack the murders and bring the culprit to justice with her former friends. The Bletchley Circle paints a vivid portrait of post-war Britain in this fictional tale of unsung heroes.", "rate": 77, "genre": ["Drama", "Mystery"], "cast": ["Rachael Stirling", "Julie Graham", "Sophie Rundle", "Anna Maxwell Martin", "Nick Blood"], "character": ["Millie", "Jean", "Lucy", "Susan", "Ben Gladstone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59312   Expand The Bletchley Circle   (2012) User Score  Play Trailer Overview The Bletchley Circle follows the journey of four ordinary women with extraordinary skills that helped to end World War II. Set in 1952, Susan, Millie, Lucy and Jean have returned to their normal lives, modestly setting aside the part they played in producing crucial intelligence, which helped the Allies to victory and shortened the war. When Susan discovers a hidden code behind an unsolved murder she is met by skepticism from the police. She quickly realises she can only begin to crack the murders and bring the culprit to justice with her former friends. The Bletchley Circle paints a vivid portrait of post-war Britain in this fictional tale of unsung heroes. Featured Crew Guy Burt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachael Stirling Millie Julie Graham Jean Sophie Rundle Lucy Anna Maxwell Martin Susan Nick Blood Ben Gladstone Full Cast & Crew Last Season Season 2 2014 | 4 Episodes Season 2 of The Bletchley Circle premiered on January  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2008-01-13 Lark Rise to Candleford 7.3    2008-03-10 Canterbury's Law 6.0    1997-05-09 Jonathan Creek 7.7    2012-02-24 Miss Fisher's Murder Mysteries 7.3    2000-09-04 Waking the Dead 7.9    2011-05-29 Scott & Bailey 7.5    2013-05-10 Life of Crime 6.0    2009-01-04 Above Suspicion 7.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Mystery Keywords england period drama post world war ii crime investigation 1950s war women Content Score 100 Yes! Looking good! Top Contributors 40 Banana 25 tulgha 15 Elizabeth Jennings z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}