{"link": "https://www.themoviedb.org/tv/9922?language=en", "title": "Psi Factor: Chronicles of the Paranormal", "resume": "Psi Factor: Chronicles of the Paranormal is a Canadian science fiction drama television series which was filmed in and around Toronto, Ontario, Canada, and aired 88 episodes over four seasons from 1996 to 2000. The presence of Dan Aykroyd opening and closing every episode and emphasizing the legitimacy of the organization it was inspired by led some viewers to take the show somewhat more seriously than intended, though it was in fact a scripted drama. Partly for this reason, in 1997 the Committee for Skeptical Inquiry, then called the Committee for the Scientific Investigation of Claims of the Paranormal, awarded Aykroyd a \"Snuffed Candle\" award, for \"contributing to the public's lack of understanding of the methods of scientific inquiry.\"", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Matt Frewer", "Barclay Hope", "Colin Fox", "Dan Aykroyd", "Nancy Anne Sakovich"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9922   Expand Psi Factor: Chronicles of the Paranormal   (1996) User Score Overview Psi Factor: Chronicles of the Paranormal is a Canadian science fiction drama television series which was filmed in and around Toronto, Ontario, Canada, and aired 88 episodes over four seasons from 1996 to 2000. The presence of Dan Aykroyd opening and closing every episode and emphasizing the legitimacy of the organization it was inspired by led some viewers to take the show somewhat more seriously than intended, though it was in fact a scripted drama. Partly for this reason, in 1997 the Committee for Skeptical Inquiry, then called the Committee for the Scientific Investigation of Claims of the Paranormal, awarded Aykroyd a \"Snuffed Candle\" award, for \"contributing to the public's lack of understanding of the methods of scientific inquiry.\" Featured Crew Peter Aykroyd Creator Christopher Chacon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Frewer Barclay Hope Colin Fox Dan Aykroyd Nancy Anne Sakovich Full Cast & Crew Last Season Season 4 1999 | 22 Episodes Season 4 of Psi Factor: Chronicles of the Paranormal premiered on September 26, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   1996-09-21 Dark Skies 7.6    1991-09-15 Eerie, Indiana 7.6    1987-09-12 Fraggle Rock: The Animated Series 8.1    1997-04-03 Police Academy: The Series 5.6    1976-09-11 The Scooby-Doo/Dynomutt Hour 7.1    2012-08-13 Hotel Hell 6.7    2002-09-16 Dr. Phil 2.7    2012-10-29 Primeval: New World 6.1  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords paranormal investigation Content Score 93 Almost there... Top Contributors m 5 maltsev.v.v w 4 waterhorse w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}