{"link": "https://www.themoviedb.org/tv/20044?language=en", "title": "Na dobre i na złe", "resume": "Na dobre i na złe is a Polish television medical drama series, broadcast on TVP2 since November 7, 1999. Currently in its 15th season and with over 520 episodes, it is the longest-running primetime drama on Polish TV. The show revolves around the lives of doctors and patients of a hospital in Leśna Góra near Warsaw.\nNa dobre i na złe has been very popular among the viewers, despite recent criticism on its lack of originality. It won the \"Telekamery\" award for the best TV series in 2001, 2002 and 2003.", "rate": 100, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20044   Expand Na dobre i na złe   (1999) User Score Overview Na dobre i na złe is a Polish television medical drama series, broadcast on TVP2 since November 7, 1999. Currently in its 15th season and with over 520 episodes, it is the longest-running primetime drama on Polish TV. The show revolves around the lives of doctors and patients of a hospital in Leśna Góra near Warsaw. Na dobre i na złe has been very popular among the viewers, despite recent criticism on its lack of originality. It won the \"Telekamery\" award for the best TV series in 2001, 2002 and 2003. Featured Crew Aneta Glowska Creator Agnieszka Krakowiak Creator Ilona Lepkowska Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 17 2015 | 9 Episodes Season 17 of Na dobre i na złe premiered on September  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Na dobre i na złe. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Polish Runtime  50m Homepage   http://www.nadobre.tvp.pl/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors m 25 matigrub 14 lineker 1 Bhojraj g 1 grand24  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}