{"link": "https://www.themoviedb.org/tv/5373?language=en", "title": "Angela Anaconda", "resume": "Angela Anaconda is a Canadian cutout animation television series that aired on the channels Teletoon in Canada and Fox Family in the United States. It centers on the adventures of an eight-year-old girl named Angela who lives in the fictional town of Tapwater Springs, has wacky brothers, weird friends, and hates a snobbish faux-French girl named Nanette Manoir.\nAngela Anaconda began as a short skit on the Nickelodeon show Kablam!. It later became a series and aired on Fox Family from 1999 to 2002. Each episode consisted of two 11-minute stories. In 2001, when Disney bought Fox Family and changed the network's name to ABC Family, Angela was moved and canceled after two months. Reruns returned to Nickelodeon in 2004 only to be removed about a month later.\nThe show was created by Joanna Ferrone and Sue Rose, who also voices Angela. Sue Rose created the cartoon character Fido Dido as well as Disney's Pepper Ann and Nickelodeon's Unfabulous. The show was produced by DHX Media and C.O.R.E. Digital Pictures. It premiered on Cartoon Network in the UK, and also aired there on PopGirl; it also aired on POP TV in Slovenia and ABC1 and ABC2 in Australia.\nThe show features a very distinct art style of Clip Art Animation, reminiscent of Terry Gilliam's animation from Monty Python's Flying Circus, in which all the characters are made out of cutouts of black-and-white photographs. They would have different models come in and take about 30 or more pictures for each mouth movement and use different face models for the main characters.", "rate": 39, "genre": ["Animation", "Comedy"], "cast": ["Ali Mukaddam", "Bryn McAuley", "Kevin Duhaney", "Robert Tinkler", "Edward Glen"], "character": ["Johnny Abatti", "Gina Lash", "Jimmy Jamal", "Onkel Nicky", "Gordy Rhinehart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5373   Expand Angela Anaconda   (1999) User Score Overview Angela Anaconda is a Canadian cutout animation television series that aired on the channels Teletoon in Canada and Fox Family in the United States. It centers on the adventures of an eight-year-old girl named Angela who lives in the fictional town of Tapwater Springs, has wacky brothers, weird friends, and hates a snobbish faux-French girl named Nanette Manoir. Angela Anaconda began as a short skit on the Nickelodeon show Kablam!. It later became a series and aired on Fox Family from 1999 to 2002. Each episode consisted of two 11-minute stories. In 2001, when Disney bought Fox Family and changed the network's name to ABC Family, Angela was moved and canceled after two months. Reruns returned to Nickelodeon in 2004 only to be removed about a month later. The show was created by Joanna Ferrone and Sue Rose, who also voices Angela. Sue Rose created the cartoon character Fido Dido as well as Disney's Pepper Ann and Nickelodeon's Unfabulous. The show was produced by DHX Media and C.O.R.E. Digital Pictures. It premiered on Cartoon Network in the UK, and also aired there on PopGirl; it also aired on POP TV in Slovenia and ABC1 and ABC2 in Australia. The show features a very distinct art style of Clip Art Animation, reminiscent of Terry Gilliam's animation from Monty Python's Flying Circus, in which all the characters are made out of cutouts of black-and-white photographs. They would have different models come in and take about 30 or more pictures for each mouth movement and use different face models for the main characters. Featured Crew Sue Rose Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ali Mukaddam Johnny Abatti Bryn McAuley Gina Lash Kevin Duhaney Jimmy Jamal Robert Tinkler Onkel Nicky Edward Glen Gordy Rhinehart Full Cast & Crew Last Season Season 3 2001 | 14 Episodes Season 3 of Angela Anaconda premiered on September 10, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2004-01-23 Dave the Barbarian 4.8    2000-10-25 As Told by Ginger 5.4    2003-08-01 My Life as a Teenage Robot 6.1    1997-09-13 Recess 6.8    2001-11-03 Totally Spies! 5.6    1994-10-30 Aaahh!!! Real Monsters 6.4    1997-09-16 Cow and Chicken 6.4    1998-09-01 The Wild Thornberrys 6.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.angelaa.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors J 21 Julia11111 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}