{"link": "https://www.themoviedb.org/tv/40137?language=en", "title": "Assassin's Creed: Lineage", "resume": "Three short films based on the Assassin's Creed II video game.", "rate": 66, "genre": ["Action", "Adventure"], "cast": ["Devon Bostick", "Romano Orzari", "Alex Ivanovici", "Michel Perron", "Alex Ivanovici"], "character": ["Ezio Auditore da Firenze", "Giovanni Auditore", "Lorenzo Medici", "Umberto Alberti", "Lorenzo de' Medici"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40137   Expand Assassin's Creed: Lineage   (2009) User Score  Play Trailer Overview Three short films based on the Assassin's Creed II video game. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Devon Bostick Ezio Auditore da Firenze Romano Orzari Giovanni Auditore Alex Ivanovici Lorenzo Medici Michel Perron Umberto Alberti Alex Ivanovici Lorenzo de' Medici Full Cast & Crew Last Season Season 1 2009 | 3 Episodes Season 1 of Assassin's Creed: Lineage premiered on October 26, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations   1976-06-04 Twelve Chairs 7.5    2008-03-23 The Colour of Magic 6.5    2003-03-16 Frank Herbert's Children of Dune 6.8    2007-12-02 Tin Man 6.5    2012-01-01 Treasure Island 6.5    1997-05-17 The Odyssey 6.3    2007-01-04 Afro Samurai 7.3    1999-12-24 Happy Tree Friends 6.8  Facts Status  Ended Networks Certification  - Type  Miniseries Original Language  English Runtime  36m Homepage   http://assassinscreedlineage.us.ubi.com/ Genres Action & Adventure Keywords venice video game rome family secret secret life hidden weapon walking on roof based on video game firenze 15th century Content Score 93 Almost there... Top Contributors TB 69 TMDb Bot 15 Zonekiller 11 Banana 8 digit  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}