{"link": "https://www.themoviedb.org/tv/43275?language=en", "title": "Ben and Kate", "resume": "Ben and Kate are a pair of odd-couple siblings - one, a responsible single mom; the other, an exuberant dreamer - who reunite to help raise Kate's daughter.", "rate": 57, "genre": ["Comedy"], "cast": ["Nat Faxon", "Dakota Johnson", "Maggie Elizabeth Jones", "Lucy Punch", "Echo Kellum"], "character": ["Ben Fox", "Kate Fox", "Maddie Fox", "BJ 'Beatrice Joan' Harrison", "Tommy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43275   Expand Ben and Kate   (2012) User Score  Play Trailer Overview Ben and Kate are a pair of odd-couple siblings - one, a responsible single mom; the other, an exuberant dreamer - who reunite to help raise Kate's daughter. Featured Crew Dana Fox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nat Faxon Ben Fox Dakota Johnson Kate Fox Maggie Elizabeth Jones Maddie Fox Lucy Punch BJ 'Beatrice Joan' Harrison Echo Kellum Tommy Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Absolute) Digital Order (Digital) Production Order (Production) Season 1 2012 | 13 Episodes Season 1 of Ben and Kate premiered on September 24, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Maddie: Happy Birthday Maggie Elizabeth Jones! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2012-02-20 The Bleak Old Shop of Stuff 6.7    2014-04-24 Bad Teacher 5.1    2013-09-26 The Michael J. Fox Show 5.6    2010-09-21 Running Wilde 6.8    2011-07-21 NTSF:SD:SUV:: 6.3    2013-09-23 Trophy Wife 5.7    2014-04-29 Playing House 7.4    2010-08-15 Vexed 7.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://fox.com/benandkate Genres Comedy Keywords sibling relationship single mother living with sibling Content Score 100 Yes! Looking good! Top Contributors 37 seawolf 35 Banana w 3 webmaster 3 cineemcasaoficial  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}