{"link": "https://www.themoviedb.org/tv/7011?language=en", "title": "Bernard", "resume": "Bernard is a series of animated shorts centered on the fictional polar bear and main character of the same name. It is a Korean-Spanish-French co-production.\nEach three-minute episode focuses on the bear's curiosity and have many moments of slapstick. Bernard never speaks with the exception of unintelligible noises.\nBernard is accompanied in the cartoons by a few other characters: Lloyd and Eva the penguins, Zack the lizard, Goliat the chihuahua, Sam the baby, Pilot the dog, Pokey the porcupine and Santa Claus.\nHe usually gets knocked unconscious or severely injured at the end of an episode, due to some calamity caused by his bumbling.\nProduced by the Korean company RG Animation Studios, with the investment of the South Korean broadcaster EBS, the Spanish BRB Internacional and the French M6, the animation style is of a combination of computer-generated and cel animation. The stories are written by the Spanish creative studio Screen21, the directors are José Luis Ucha Enríquez and Claudio Biern Lliviria. The music was written by Oscar Maceda Rodríguez.\nBernard has been nominated for a number of awards, including Best Animation series at the Stuttgart Festival of Animated Film, Mipcom Jr. Licensing Challenge Award, Prize in Children and Education at the Dong-A International Festival of Cartoon & Animation and was a finalist at the Annecy International Animation Festival.", "rate": 49, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7011   Expand Bernard   (2004) User Score Overview Bernard is a series of animated shorts centered on the fictional polar bear and main character of the same name. It is a Korean-Spanish-French co-production. Each three-minute episode focuses on the bear's curiosity and have many moments of slapstick. Bernard never speaks with the exception of unintelligible noises. Bernard is accompanied in the cartoons by a few other characters: Lloyd and Eva the penguins, Zack the lizard, Goliat the chihuahua, Sam the baby, Pilot the dog, Pokey the porcupine and Santa Claus. He usually gets knocked unconscious or severely injured at the end of an episode, due to some calamity caused by his bumbling. Produced by the Korean company RG Animation Studios, with the investment of the South Korean broadcaster EBS, the Spanish BRB Internacional and the French M6, the animation style is of a combination of computer-generated and cel animation. The stories are written by the Spanish creative studio Screen21, the directors are José Luis Ucha Enríquez and Claudio Biern Lliviria. The music was written by Oscar Maceda Rodríguez. Bernard has been nominated for a number of awards, including Best Animation series at the Stuttgart Festival of Animated Film, Mipcom Jr. Licensing Challenge Award, Prize in Children and Education at the Dong-A International Festival of Cartoon & Animation and was a finalist at the Annecy International Animation Festival. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2004 | 52 Episodes Season 1 of Bernard premiered on January  1, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2008-09-22 Chuggington 6.0    2013-02-18 Sarah & Duck 6.0    2009-04-04 Special Agent Oso 4.3    2011-09-05 Zig and Sharko 5.3    2009-06-25 Stoked 6.3    2010-10-04 The Octonauts 6.3    2012-02-05 Glitter Force 6.3    2013-03-25 Max Steel 4.8  Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Korean Runtime  3m Homepage   http://www.bernardbear.com Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 luftikus009 5 David b 3 bigacsiga V 1 VLPhoenix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}