{"link": "https://www.themoviedb.org/tv/72510?language=en", "title": "Netsuzou TRap", "resume": "Yuma and Hotaru have been friends since childhood, so it's only natural that when Yuma is nervous about her new boyfriend, she asks Hotaru for advice. But when Hotaru starts coming onto Yuma for what feels like more than just 'practice,' what does it mean...? With boyfriends in the foreground but a secret, passionate tryst in the background, will Yuma and Hotaru try to forget what happened between them or have they fallen into a trap of true love and betrayal?", "rate": 57, "genre": ["Drama", "Comedy"], "cast": ["Wataru Usami", "Chika Yoshitomi", "Kenya Tomatsu", "Shohei Yamaguchi", "Ai Kakuma"], "character": ["customer", "classmate A", "Customer", "boyfriend", "Yuma Okazaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72510   Expand Netsuzou TRap   (2017) User Score Overview Yuma and Hotaru have been friends since childhood, so it's only natural that when Yuma is nervous about her new boyfriend, she asks Hotaru for advice. But when Hotaru starts coming onto Yuma for what feels like more than just 'practice,' what does it mean...? With boyfriends in the foreground but a secret, passionate tryst in the background, will Yuma and Hotaru try to forget what happened between them or have they fallen into a trap of true love and betrayal? Featured Crew Hirasawa Hisayoshi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wataru Usami customer Chika Yoshitomi classmate A Kenya Tomatsu Customer Shohei Yamaguchi boyfriend Ai Kakuma Yuma Okazaki Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Netsuzou TRap premiered on July  4, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Netsuzou TRap. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2017-10-12 Last Hero Inuyashiki 7.4  Facts Original Name  捏造トラップ―NTR― Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  9m Homepage   http://netsuzoutrap.com/ Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 34 Sergiojamon C 15 Chintaran 14 Danu t 8 tmdb46417706  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}