{"link": "https://www.themoviedb.org/tv/63214?language=en", "title": "Supermansion", "resume": "Aging superhero, Titanium Rex, and his has-been team known as The League of Freedom struggle to stay relevant in a changing world.", "rate": 71, "genre": ["Comedy", "Animation"], "cast": ["Bryan Cranston", "Seth Green", "Keegan-Michael Key", "Jillian Bell", "Chris Pine"], "character": ["Titanium Rex", "American Ranger", "Lex Lightning"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63214   Expand Supermansion   (2015) User Score  Play Trailer Overview Aging superhero, Titanium Rex, and his has-been team known as The League of Freedom struggle to stay relevant in a changing world. Featured Crew Bryan Cranston Creator Zeb Wells Creator Matthew Senreich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bryan Cranston Titanium Rex Seth Green Keegan-Michael Key American Ranger Jillian Bell Lex Lightning Chris Pine Full Cast & Crew Current Season Season 3 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Cast and Creative Interviews From New York Comic Con Open 0 by garethmb\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2013-07-21 Axe Cop 5.5    2016-03-13 Houdini & Doyle 5.7    2010-12-25 Come Fly With Me 6.6  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.crackle.com/c/supermansion Genres Comedy Animation Keywords superhero parody elderly aging superhero Content Score 100 Yes! Looking good! Top Contributors 39 Elizabeth Jennings 13 Banana 12 Wong 4 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}