{"link": "https://www.themoviedb.org/tv/42240?language=en", "title": "The Winds of War", "resume": "The Winds of War is a 1983 miniseries that follows the book of the same name by Herman Wouk. Just as in the book, in addition to the lives of the Henry and Jastrow families, much time in the miniseries is devoted to the major global events of this period. Adolf Hitler and the German military staff with the fictitious general von Roon as a major character is a prominent subplot of the miniseries. Winds of War also includes segments of documentary footage narrated by William Woodson to explain major events and important characters.\nAccording to the DVD-featurette \"From Novel to Television,\" The Winds of War became a smashing television success, and a US national television event as never seen before. It was followed by a sequel War and Remembrance in 1988, also directed by Dan Curtis.", "rate": 70, "genre": ["War", "Politics", "Drama"], "cast": ["Robert Mitchum", "Ali MacGraw", "Jan-Michael Vincent", "John Houseman", "Polly Bergen"], "character": ["Victor 'Pug' Henry", "Natalie Jastrow", "Byron Henry", "Aaron Jastrow", "Rhoda Henry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42240   Expand The Winds of War   (1983) User Score Overview The Winds of War is a 1983 miniseries that follows the book of the same name by Herman Wouk. Just as in the book, in addition to the lives of the Henry and Jastrow families, much time in the miniseries is devoted to the major global events of this period. Adolf Hitler and the German military staff with the fictitious general von Roon as a major character is a prominent subplot of the miniseries. Winds of War also includes segments of documentary footage narrated by William Woodson to explain major events and important characters. According to the DVD-featurette \"From Novel to Television,\" The Winds of War became a smashing television success, and a US national television event as never seen before. It was followed by a sequel War and Remembrance in 1988, also directed by Dan Curtis. Featured Crew Dan Curtis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Mitchum Victor 'Pug' Henry Ali MacGraw Natalie Jastrow Jan-Michael Vincent Byron Henry John Houseman Aaron Jastrow Polly Bergen Rhoda Henry Full Cast & Crew Last Season Season 1 1983 | 7 Episodes Season 1 of The Winds of War premiered on February  6, 1983. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply L Excellent!! Open 0 by Lloyd\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1988-11-13 War and Remembrance 7.8    1982-09-20 Smiley's People 7.9    1968-09-17 Julia 6.3    1979-09-10 Tinker Tailor Soldier Spy 7.7    1971-09-17 The Persuaders! 8.0    A Christmas Carol 7.5    2008-03-05 The War 8.1    2002-10-27 Foyle's War 8.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  126m Homepage  - Genres War & Politics Drama Keywords based on novel or book world war ii miniseries Content Score 93 Almost there... Top Contributors S 31 Samara 8 Banana 4 TomTen 4 derKaetzer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}