{"link": "https://www.themoviedb.org/tv/34438?language=en", "title": "Outcasts", "resume": "Outcasts is a 2011 British television science-fiction drama serial, starring Liam Cunningham, Hermione Norris, Amy Manson, Daniel Mays, Jamie Bamber, Eric Mabius and Ashley Walters. It originally aired on BBC One, and BBC HD. It was broadcast in the United States on BBC America.", "rate": 62, "genre": ["Drama", "Science", "Fiction"], "cast": ["Daniel Mays", "Hermione Norris", "Liam Cunningham", "Ashley Walters", "Jamie Bamber"], "character": ["Stella Isen", "Mitchell Hoban"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34438   Expand Outcasts   (2011) User Score Overview Outcasts is a 2011 British television science-fiction drama serial, starring Liam Cunningham, Hermione Norris, Amy Manson, Daniel Mays, Jamie Bamber, Eric Mabius and Ashley Walters. It originally aired on BBC One, and BBC HD. It was broadcast in the United States on BBC America. Featured Crew Bharat Nalluri Creator Omar Madha Creator Andy Goddard Creator Jamie Payne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel Mays Hermione Norris Stella Isen Liam Cunningham Ashley Walters Jamie Bamber Mitchell Hoban Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of Outcasts premiered on February  7, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   2001-05-26 Messiah 8.0    2008-11-23 Survivors 7.2    2002-03-03 Jeremiah 7.0    2010-09-20 The Event 6.2    2013-08-11 Low Winter Sun 6.4    2009-05-18 1066: The Battle for Middle Earth 6.0    2001-09-24 Murphy's Law 6.8    2009-08-02 Defying Gravity 6.6  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/tv/comingup/outcasts/ Genres Drama Science Fiction Keywords future post-apocalyptic space colony space Content Score 93 Almost there... Top Contributors 17 Banana B 8 Bonsai 6 galani w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}