{"link": "https://www.themoviedb.org/tv/1489?language=en", "title": "Jimmy Kimmel Live!", "resume": "Jimmy Kimmel Live! is an American late-night talk show, created and hosted by Jimmy Kimmel and broadcast on ABC.", "rate": 59, "genre": ["Talk", "Comedy"], "cast": ["Jimmy Kimmel"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1489   Expand Jimmy Kimmel Live!   (2003) User Score  Play Trailer Overview Jimmy Kimmel Live! is an American late-night talk show, created and hosted by Jimmy Kimmel and broadcast on ABC. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Kimmel Himself - Host Full Cast & Crew Last Season Season 15 — | 6 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Does something just bug you about Kimmel? Open 0 by TalisBriedis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  6 Recommendations   2009-03-02 Late Night with Jimmy Fallon 6.0    2010-11-08 Conan 7.4    2005-01-03 The Late Late Show with Craig Ferguson 7.5    1993-09-13 Late Night with Conan O'Brien 7.3    2009-06-01 The Tonight Show with Conan O'Brien 7.8    1992-05-25 The Tonight Show with Jay Leno 5.0    1993-08-30 Late Show with David Letterman 6.9    2006-08-07 Gene Simmons Family Jewels 4.4  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  45m Homepage   http://abc.go.com/shows/jimmy-kimmel-live Genres Talk Comedy Keywords talk show celebrity late night Content Score 64 We're so close, yet so far. Top Contributors TB 57 TMDb Bot 26 Elizabeth Jennings 19 lineker 18 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}