{"link": "https://www.themoviedb.org/tv/744?language=en", "title": "Jekyll", "resume": "Jekyll is a British television drama serial produced by Hartswood Films and Stagescreen Productions for BBC One. The series also received funding from BBC America. Steven Moffat wrote all six episodes, with Douglas Mackinnon and Matt Lipsey each directing three episodes.\nThe series is described by its creators as a sequel to the novella Strange Case of Dr Jekyll and Mr Hyde, rather than an adaptation of it, and the Robert Louis Stevenson tale is used within the series as a back story. It stars James Nesbitt as Tom Jackman, a modern-day descendant of Dr. Jekyll, who has recently begun transforming into a version of Mr. Hyde. Jackman is aided by psychiatric nurse Katherine Reimer, played by Michelle Ryan. Gina Bellman also appears as Claire, Tom's wife.\nFilming took place at various locations around southern England in late 2006. The series was first transmitted on BBC One in June and July 2007, receiving mainly positive reviews.", "rate": 81, "genre": ["Drama"], "cast": ["James Nesbitt", "Gina Bellman", "Michelle Ryan", "Meera Syal", "Denis Lawson"], "character": ["Dr. Tom Jackman", "Claire Jackman", "Katherine Reimer", "Miranda", "Peter Syme"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 744   Expand Jekyll   (2007) User Score Overview Jekyll is a British television drama serial produced by Hartswood Films and Stagescreen Productions for BBC One. The series also received funding from BBC America. Steven Moffat wrote all six episodes, with Douglas Mackinnon and Matt Lipsey each directing three episodes. The series is described by its creators as a sequel to the novella Strange Case of Dr Jekyll and Mr Hyde, rather than an adaptation of it, and the Robert Louis Stevenson tale is used within the series as a back story. It stars James Nesbitt as Tom Jackman, a modern-day descendant of Dr. Jekyll, who has recently begun transforming into a version of Mr. Hyde. Jackman is aided by psychiatric nurse Katherine Reimer, played by Michelle Ryan. Gina Bellman also appears as Claire, Tom's wife. Filming took place at various locations around southern England in late 2006. The series was first transmitted on BBC One in June and July 2007, receiving mainly positive reviews. Featured Crew Robert Louis Stevenson Creator Steven Moffat Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Nesbitt Dr. Tom Jackman Gina Bellman Claire Jackman Michelle Ryan Katherine Reimer Meera Syal Miranda Denis Lawson Peter Syme Full Cast & Crew Last Season Season 1 2007 | 6 Episodes Season 1 of Jekyll premiered on June 16, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  3 Recommendations   2016-04-25 After the Thrones 4.6    2002-10-31 Värsta språket 6.0    2011-01-06 The Reckoning 3.7    2004-08-30 John Safran vs God 7.3    2008-03-10 The Fixer 7.6    2013-11-07 Folkets främsta företrädare 5.0    2006-09-20 Kidnapped 7.0    1987-09-05 På spåret 5.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 55m Homepage   http://www.bbc.co.uk/drama/jekyll/ Genres Drama Keywords miniseries jekyll and hyde split personality dr. jekyll Content Score 93 Almost there... Top Contributors TB 13 TMDb Bot R 8 Rebecca 5 Steve L 3 Lysator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}