{"link": "https://www.themoviedb.org/tv/431?language=en", "title": "One on One", "resume": "One on One is an American sitcom that aired on the now-defunct UPN from September 3, 2001 to May 15, 2006. The series stars Flex Alexander as a single sportscaster, who becomes a full-time dad when his ex-wife decides to accept a job out of the country and his teenage daughter Breanna moves in with him. The series was based in Baltimore for the first four seasons before changing settings to Los Angeles for the final season.\nThe series featured guest appearances from numerous celebrities and athletes including Lil Zane, Chris Brown, Brave from RichGirl, Lil' Romeo, Eve, Lloyd, Floetry, Angie Stone, Mario, Omarion, Brandy, Solange Knowles, Marques Houston, Smokey Robinson, Avant, New Edition, Jennifer Freeman, Method Man, Bobby V, and Lisa Leslie, among others. The show was cancelled when The WB and UPN merged to form The CW.", "rate": 78, "genre": ["Comedy"], "cast": ["Kyla Pratt", "Sicily", "Kelly Perine", "Robert Ri'chard"], "character": ["Breanna Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 431   Expand One on One   (2001) User Score Overview One on One is an American sitcom that aired on the now-defunct UPN from September 3, 2001 to May 15, 2006. The series stars Flex Alexander as a single sportscaster, who becomes a full-time dad when his ex-wife decides to accept a job out of the country and his teenage daughter Breanna moves in with him. The series was based in Baltimore for the first four seasons before changing settings to Los Angeles for the final season. The series featured guest appearances from numerous celebrities and athletes including Lil Zane, Chris Brown, Brave from RichGirl, Lil' Romeo, Eve, Lloyd, Floetry, Angie Stone, Mario, Omarion, Brandy, Solange Knowles, Marques Houston, Smokey Robinson, Avant, New Edition, Jennifer Freeman, Method Man, Bobby V, and Lisa Leslie, among others. The show was cancelled when The WB and UPN merged to form The CW. Featured Crew Eunetta T. Boone Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyla Pratt Breanna Barnes Sicily Kelly Perine Robert Ri'chard Full Cast & Crew Last Season Season 5 2005 | 22 Episodes Season 5 of One on One premiered on September 19, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Breanna: Happy Birthday Kyla Pratt! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1999-08-30 The Parkers 3.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage  - Genres Comedy Keywords sport baltimore wealthy single father black family sitcom sportscaster black sitcom Content Score 79 Pump it up! We're close now. Top Contributors 12 Banana w 1 woogoldsgreat R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}