{"link": "https://www.themoviedb.org/tv/43775?language=en", "title": "Dog With a Blog", "resume": "Avery Jennings and Tyler James are step-siblings who are complete opposites. The family faces an even bigger adjustment when their new dog, Stan, can talk and also has a blog, unbeknownst to the family. Stan uses his blog to discuss the happenings in the Jennings-James household. Avery and Tyler later learn of Stan's talking ability and agree to keep it a secret from their parents.", "rate": 57, "genre": ["Comedy", "Family"], "cast": ["G. Hannelius", "Blake Michael", "Francesca Capaldi", "Regan Burns", "Beth Littleford"], "character": ["Avery Jennings", "Tyler James", "Chloe James", "Bennett James", "Ellen Jennings"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43775   Expand Dog With a Blog   (2012) User Score Overview Avery Jennings and Tyler James are step-siblings who are complete opposites. The family faces an even bigger adjustment when their new dog, Stan, can talk and also has a blog, unbeknownst to the family. Stan uses his blog to discuss the happenings in the Jennings-James household. Avery and Tyler later learn of Stan's talking ability and agree to keep it a secret from their parents. Featured Crew Michael B. Kaplan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast G. Hannelius Avery Jennings Blake Michael Tyler James Francesca Capaldi Chloe James Regan Burns Bennett James Beth Littleford Ellen Jennings Full Cast & Crew Last Season Season 3 2014 | 24 Episodes Season 3 of Dog With a Blog premiered on September 26, 2014. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Tyler James: Happy Birthday Blake Michael! Open 0 by wonder2wonder\n      \n     w Ellen Jennings: Happy Birthday Beth Littleford! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2011-12-02 Austin & Ally 5.8    2011-09-30 Jessie 6.3    2014-01-17 I Didn't Do It 6.8    2011-06-13 Kickin' It 6.5    2010-11-07 Shake It Up 2.8    2007-01-12 Cory in the House 5.4    2010-04-04 Good Luck Charlie 5.8    2013-07-19 Liv and Maddie 6.1  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 21m Homepage   http://disneychannel.disney.com/dog-with-a-blog Genres Comedy Family Keywords talking animal talking dog teenager dog blended family Content Score 93 Almost there... Top Contributors 24 Elizabeth Jennings TB 18 TMDb Bot 11 Banana c 11 courtneysmith86  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}