{"link": "https://www.themoviedb.org/tv/6513?language=en", "title": "M.I. High", "resume": "M.I. High is a BBC children's spy-fi adventure series. It was produced for the BBC by the independent production company Kudos, who also produced the hit BBC spy drama Spooks. It follows in the success of the Young Bond and the Alex Rider series of books and films. M.I. High is recorded in high definition and is shown on the CBBC Channel and CBBC Outputs on BBC One and BBC Two. M.I. High is also shown on the BBC HD Channel. Repeats also frequently air in Australia on ABC3. As of October 2012 the series has began airing on the UKTV channel Watch.", "rate": 0, "genre": [], "cast": ["Danny John-Jules", "Bel Powley", "Konnie Huq", "Holliday Grainger"], "character": ["Lenny Bicknall", "Daisy Millar", "Blue Peter Presenter", "Leah Retsam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6513   Expand M.I. High   (2007) User Score Overview M.I. High is a BBC children's spy-fi adventure series. It was produced for the BBC by the independent production company Kudos, who also produced the hit BBC spy drama Spooks. It follows in the success of the Young Bond and the Alex Rider series of books and films. M.I. High is recorded in high definition and is shown on the CBBC Channel and CBBC Outputs on BBC One and BBC Two. M.I. High is also shown on the BBC HD Channel. Repeats also frequently air in Australia on ABC3. As of October 2012 the series has began airing on the UKTV channel Watch. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danny John-Jules Lenny Bicknall Bel Powley Daisy Millar Konnie Huq Blue Peter Presenter Holliday Grainger Leah Retsam Full Cast & Crew Last Season Season 5 2011 | 13 Episodes Season 5 of M.I. High premiered on January 10, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on M.I. High. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 rudely_murray 2 Alexandre Oliveira MP 1 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}