{"link": "https://www.themoviedb.org/tv/2082?language=en", "title": "ChuckleVision", "resume": "ChuckleVision is a British comedy television series shown mainly on BBC One and CBBC channel. New episodes are always first aired on BBC One, and occasionally episodes are shown on BBC Two. The first episode was shown on 26 September 1987. ChuckleVision focusses on Paul & Barry Chuckle and follows them throughout various comical situations. The twenty-first series of ChuckleVision was broadcast in December 2009 on BBC One. A 3D movie was also in production and was set to possibly be released in late 2012, however it has since been confirmed that the funding for this is no longer available.", "rate": 70, "genre": ["Comedy"], "cast": ["Barry Chuckle", "Paul Chuckle"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2082   Expand ChuckleVision   (1987) User Score Overview ChuckleVision is a British comedy television series shown mainly on BBC One and CBBC channel. New episodes are always first aired on BBC One, and occasionally episodes are shown on BBC Two. The first episode was shown on 26 September 1987. ChuckleVision focusses on Paul & Barry Chuckle and follows them throughout various comical situations. The twenty-first series of ChuckleVision was broadcast in December 2009 on BBC One. A 3D movie was also in production and was set to possibly be released in late 2012, however it has since been confirmed that the funding for this is no longer available. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barry Chuckle Himself Paul Chuckle Himself Full Cast & Crew Last Season Season 21 — | 5 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1986-05-01 Bread 7.4    2002-10-04 The Basil Brush Show 8.0    1991-01-03 The Brittas Empire 7.1    A Question of Sport 6.5    1978-02-24 Going Straight 7.3    1973-09-25 Police Story 6.4    1972-10-16 Rainbow 7.0    1973-01-09 Whatever Happened to the Likely Lads? 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors N 22 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}