{"link": "https://www.themoviedb.org/tv/64457?language=en", "title": "Divorce", "resume": "Bálint Sáfár, the charming businessman has several affairs, and when his wife Zsófi - with whom he has two children - finds out about his infidelity, she breaks up with him. Bálint decides to move to one of his houses on sale. On the same day Bálint's subcontractor Joci, who renovates his houses, breaks up with his girlfriend Szonja and decides to stay at this same house. Joci has some serious issues in his private life. His girlfriend Szonja couldn't get pregnant for years, and after her hormone therapy, he just can't live with her anymore. Dávid Jakab, successful businessman realises that his wife, Tamara hates him and wants to get a divorce on their 16th anniversary. Dávid asks Bálint if he could stay at his house while he tries to save his marriage. The series follows these freshly-divorced guys' lives as they try to solve their relationship problems.", "rate": 84, "genre": [], "cast": ["Stohl András", "Tamás Lengyel", "Péter Scherer", "Gabriella Gubás", "Eszter Földes"], "character": ["Bálint Sáfár", "Joci Hatvani", "Dávid Jakab", "Zsófi Sáfár", "Szonja Vándor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64457   Expand Divorce   (2015) User Score Overview Bálint Sáfár, the charming businessman has several affairs, and when his wife Zsófi - with whom he has two children - finds out about his infidelity, she breaks up with him. Bálint decides to move to one of his houses on sale. On the same day Bálint's subcontractor Joci, who renovates his houses, breaks up with his girlfriend Szonja and decides to stay at this same house. Joci has some serious issues in his private life. His girlfriend Szonja couldn't get pregnant for years, and after her hormone therapy, he just can't live with her anymore. Dávid Jakab, successful businessman realises that his wife, Tamara hates him and wants to get a divorce on their 16th anniversary. Dávid asks Bálint if he could stay at his house while he tries to save his marriage. The series follows these freshly-divorced guys' lives as they try to solve their relationship problems. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stohl András Bálint Sáfár Tamás Lengyel Joci Hatvani Péter Scherer Dávid Jakab Gabriella Gubás Zsófi Sáfár Eszter Földes Szonja Vándor Full Cast & Crew Current Season Season 3 2018 | 10 Episodes Season 3 of Divorce premiered on January  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Divorce. You can help by rating TV shows you've seen. Facts Original Name  Válótársak Status  Cancelled Network Certification  - Type  Scripted Original Language  Hungarian Runtime  - Homepage   http://rtl.hu/rtlklub/valotarsak Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors S 11 Sinya007 10 Tifar k 4 kisgab88 x 3 xtzy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}