{"link": "https://www.themoviedb.org/tv/18686?language=en", "title": "Fanboy and Chum Chum", "resume": "Fanboy & Chum Chum is an American CGI animated television series created by Eric Robles for Nickelodeon. It is based on Fanboy, an animated short created by Robles for Nickelodeon and Frederator Studios, which was broadcast August 14, 2008 on Random! Cartoons.\nThe series premiere drew 5.8 million viewers. The second episode was watched by 5.4 million viewers.\nThe theme song was written by Brad Joseph Breeck and performed by experimental punk band The Mae Shi.\nNo third season was announced at Nickelodeon's upfront for the 2013-2014 season.", "rate": 35, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Nika Futterman", "Jamie Kennedy", "Josh Duhamel", "Jeff Bennett", "David Hornsby"], "character": ["Kyle", "Oz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18686   Expand Fanboy and Chum Chum   (2009) User Score Overview Fanboy & Chum Chum is an American CGI animated television series created by Eric Robles for Nickelodeon. It is based on Fanboy, an animated short created by Robles for Nickelodeon and Frederator Studios, which was broadcast August 14, 2008 on Random! Cartoons. The series premiere drew 5.8 million viewers. The second episode was watched by 5.4 million viewers. The theme song was written by Brad Joseph Breeck and performed by experimental punk band The Mae Shi. No third season was announced at Nickelodeon's upfront for the 2013-2014 season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nika Futterman Jamie Kennedy Kyle Josh Duhamel Oz Jeff Bennett David Hornsby Full Cast & Crew Last Season Season 2 2011 | 28 Episodes Season 2 of Fanboy and Chum Chum premiered on April 25, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   2010-10-02 T.U.F.F. Puppy 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m, 30m Homepage   http://frederatorblogs.com/fan_boy/ Genres Action & Adventure Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 3 speedycars A 2 AnthonyAtkins232 2 Alexandre Oliveira 2 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}