{"link": "https://www.themoviedb.org/tv/5911?language=en", "title": "Gary Unmarried", "resume": "Gary Unmarried is an American sitcom created by Ed Yeager, which ran on CBS from September 24, 2008 to March 17, 2010. The series focuses on a recently divorced couple sharing custody of their kids while starting new relationships. The show was produced by ABC Studios and CBS Television Studios, and Yeager and Ric Swartzlander served as Executive Producers for the first season. The series was known as Project Gary during tapings before premiering on television. On May 18, 2010, CBS announced that it had canceled the show.", "rate": 51, "genre": ["Comedy"], "cast": ["Jay Mohr", "Ed Begley Jr.", "Paula Marshall", "Ryan Malgarini", "Al Madrigal"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5911   Expand Gary Unmarried   (2008) User Score  Play Trailer Overview Gary Unmarried is an American sitcom created by Ed Yeager, which ran on CBS from September 24, 2008 to March 17, 2010. The series focuses on a recently divorced couple sharing custody of their kids while starting new relationships. The show was produced by ABC Studios and CBS Television Studios, and Yeager and Ric Swartzlander served as Executive Producers for the first season. The series was known as Project Gary during tapings before premiering on television. On May 18, 2010, CBS announced that it had canceled the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Mohr Ed Begley Jr. Paula Marshall Ryan Malgarini Al Madrigal Full Cast & Crew Last Season Season 2 2009 | 17 Episodes Season 2 of Gary Unmarried premiered on September 23, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2010-09-21 Running Wilde 6.8    2009-09-21 Accidentally on Purpose 4.8    2011-02-09 Mr. Sunshine 6.4    2001-01-10 Grounded for Life 6.9    1992-01-12 As Time Goes By 8.0    2013-09-26 The Crazy Ones 5.8    2008-12-08 Childrens Hospital 7.0    2000-09-19 My Family 7.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords dating divorce divorced parents sitcom divorced couple Content Score 93 Almost there... Top Contributors 13 Banana b 6 bugfix s 5 speedycars h 4 hasab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}