{"link": "https://www.themoviedb.org/tv/390?language=en", "title": "Evening Shade", "resume": "Evening Shade is an American sitcom television series that aired on CBS from 1990 to 1994. The series stars Burt Reynolds as Wood Newton, an ex-professional football player for the Pittsburgh Steelers, who returns to rural Evening Shade, Arkansas to coach a high school football team with a long losing streak. Reynolds personally requested to use the Steelers as his former team because he is a fan.\nThe general theme of the show is the appeal of small town life. Episodes ended with a closing narration by Ossie Davis summing up the events of the episode, always closing with \"... in a place called Evening Shade.\" The show's final episode saw the guest appearances of Willie Nelson and Buzz Aldrin as escaped convicts on the run from authorities, the final scene being a spectacular shoot-out reminiscent of the final scene of Butch Cassidy and the Sundance Kid.\nThe opening segment included clips from around Arkansas, including the famous McClard's Bar-be-que, which is situated on Albert Pike Blvd. and South Patterson St. in Hot Springs National Park.", "rate": 70, "genre": ["Comedy"], "cast": ["Burt Reynolds", "Marilu Henner", "Hal Holbrook", "Charles Durning", "Ann Wedgeworth"], "character": ["Wood Newton", "Ava Evans Newton", "Evan Evans", "Harlan Elldridge", "Merleen Elldridge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 390   Expand Evening Shade   (1990) User Score Overview Evening Shade is an American sitcom television series that aired on CBS from 1990 to 1994. The series stars Burt Reynolds as Wood Newton, an ex-professional football player for the Pittsburgh Steelers, who returns to rural Evening Shade, Arkansas to coach a high school football team with a long losing streak. Reynolds personally requested to use the Steelers as his former team because he is a fan. The general theme of the show is the appeal of small town life. Episodes ended with a closing narration by Ossie Davis summing up the events of the episode, always closing with \"... in a place called Evening Shade.\" The show's final episode saw the guest appearances of Willie Nelson and Buzz Aldrin as escaped convicts on the run from authorities, the final scene being a spectacular shoot-out reminiscent of the final scene of Butch Cassidy and the Sundance Kid. The opening segment included clips from around Arkansas, including the famous McClard's Bar-be-que, which is situated on Albert Pike Blvd. and South Patterson St. in Hot Springs National Park. Featured Crew Linda Bloodworth-Thomason Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Burt Reynolds Wood Newton Marilu Henner Ava Evans Newton Hal Holbrook Evan Evans Charles Durning Harlan Elldridge Ann Wedgeworth Merleen Elldridge Full Cast & Crew Last Season Season 4 1993 | 26 Episodes Season 4 of Evening Shade premiered on September 20, 1993. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply O A bit strange but funny show Open 0 by Ogopogo99\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Evening Shade. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords high school small town american football american football coach sitcom Content Score 93 Almost there... Top Contributors 14 Banana 11 United600 2 Zlogorek TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}