{"link": "https://www.themoviedb.org/tv/485?language=en", "title": "Police Rescue", "resume": "Police Rescue was an Australian television series which originally aired on ABC TV between 1989 and 1996. It was produced by ABC and Southern Star Xanadu in association with the BBC.\nApart from the 61 episodes, there was a 90-minute pilot episode as well as a feature film in 1994, starring Zoe Carides.\nThe series dealt with the New South Wales Police Rescue Squad based in Sydney and their work attending to various incidents from road accidents to train crashes. The show was very well received for the first four series, however a decline in ratings by the commencement of the 1996 series saw the cancellation of the show, following an almost epitaph in the final three episodes.\nPolice Rescue was shown in the United Kingdom and aired on Sky One, in parts of Italy as Polizia Squadra Soccorso on T9, in France on TF1 as Sydney Police, in Germany on VOX as Police Rescue – Gefährlicher Einsatz, in Norway, Sweden, the Netherlands and Denmark on the United Kingdom-based TV3, and in the Republic of Ireland on RTÉ.", "rate": 30, "genre": ["Action", "Adventure", "Drama"], "cast": ["Steve Bastoni", "Steve Bisley", "Tammy Macintosh", "Jeremy Callaghan", "John Clayton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 485   Expand Police Rescue   (1989) User Score Overview Police Rescue was an Australian television series which originally aired on ABC TV between 1989 and 1996. It was produced by ABC and Southern Star Xanadu in association with the BBC. Apart from the 61 episodes, there was a 90-minute pilot episode as well as a feature film in 1994, starring Zoe Carides. The series dealt with the New South Wales Police Rescue Squad based in Sydney and their work attending to various incidents from road accidents to train crashes. The show was very well received for the first four series, however a decline in ratings by the commencement of the 1996 series saw the cancellation of the show, following an almost epitaph in the final three episodes. Police Rescue was shown in the United Kingdom and aired on Sky One, in parts of Italy as Polizia Squadra Soccorso on T9, in France on TF1 as Sydney Police, in Germany on VOX as Police Rescue – Gefährlicher Einsatz, in Norway, Sweden, the Netherlands and Denmark on the United Kingdom-based TV3, and in the Republic of Ireland on RTÉ. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Bastoni Steve Bisley Tammy Macintosh Jeremy Callaghan John Clayton Full Cast & Crew Last Season Season 5 1996 | 9 Episodes Season 5 of Police Rescue premiered on September 20, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Police Rescue. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Action & Adventure Drama Keywords australia police rescue team Content Score 86 Almost there... Top Contributors 13 Banana 7 lineker TB 4 TMDb Bot 1 genplant29  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}