{"link": "https://www.themoviedb.org/tv/61587?language=en", "title": "The Nightly Show with Larry Wilmore", "resume": "The Nightly Show provides viewers with Larry Wilmore's distinct point of view and comedic take on current events and pop culture. Hosted by Wilmore, the series features a diverse panel of voices, providing a perspective largely missing in the late night television landscape.", "rate": 64, "genre": ["Talk", "Comedy", "News"], "cast": ["Larry Wilmore"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61587   Expand The Nightly Show with Larry Wilmore   (2015) User Score Overview The Nightly Show provides viewers with Larry Wilmore's distinct point of view and comedic take on current events and pop culture. Hosted by Wilmore, the series features a diverse panel of voices, providing a perspective largely missing in the late night television landscape. Featured Crew Jon Stewart Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry Wilmore Himself - Host Full Cast & Crew Last Season Season 2 2015 | 52 Episodes Season 2 of The Nightly Show with Larry Wilmore premiered on September 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  9 Recommendations   1999-04-07 Strangers with Candy 7.0    1995-09-09 Earthworm Jim 6.6    1999-04-11 The Awful Truth 6.4    1982-02-01 Late Night with David Letterman 7.2    1962-10-01 The Tonight Show Starring Johnny Carson 8.5    1994-03-29 Ellen 6.2  Facts Status  In Production Network Certification  - Type  Talk Show Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/the-nightly-show Genres Talk Comedy News Keywords news broadcast political satire Content Score 64 We're so close, yet so far. Top Contributors 82 Elizabeth Jennings TB 31 TMDb Bot 6 BudsieBuds 5 mgl solu191  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}