{"link": "https://www.themoviedb.org/tv/74089?language=en", "title": "GARO -VANISHING LINE-", "resume": "In a prosperous city named Russell City, an omen that threatens to shake its world begins to move within it. A man named Sword is the first to hear the first stirrings of the plot, and throws himself into a shadow war in order to expose it. His only clue is the key word \"El Dorado.\" He meets Sophie, a woman searching for her missing older brother who has only left her with the same words: \"El Dorado.\" With Sword having also lost his younger sister in the past, both are drawn together by the words, and work together to find out its meaning.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74089   Expand GARO -VANISHING LINE-   (2017) User Score Overview In a prosperous city named Russell City, an omen that threatens to shake its world begins to move within it. A man named Sword is the first to hear the first stirrings of the plot, and throws himself into a shadow war in order to expose it. His only clue is the key word \"El Dorado.\" He meets Sophie, a woman searching for her missing older brother who has only left her with the same words: \"El Dorado.\" With Sword having also lost his younger sister in the past, both are drawn together by the words, and work together to find out its meaning. Featured Crew Park Seong-ho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2017 | 24 Episodes Season 1 of GARO -VANISHING LINE- premiered on October  6, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for GARO -VANISHING LINE-. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on GARO -VANISHING LINE-. You can help by rating TV shows you've seen. Facts Original Name  牙狼＜GARO＞-VANISHING LINE- Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://vanishing-line.jp/index.html Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords mystery tokusatsu demon anime Content Score 64 We're so close, yet so far. Top Contributors 16 sp1ti 15 YabukiJoe1 D 11 Destr0y 7 sekaidown04  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}