{"link": "https://www.themoviedb.org/tv/62125?language=en", "title": "Vixen", "resume": "Originally from Africa, Mari McGabe's parents were killed by local greed, corruption and wanton violence.But the orphaned Marl refuses to succumb to the terrors surrounding her.\nInheriting her family's Tantu Totem, Mari can access the powers of animals - anything from the super-strength of a gorilla to the speed of a cheetah. As Vixen she fights valiantly to protect the world from threats like those that claimed her family.", "rate": 68, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Megalyn Echikunwoke", "Grant Gustin", "Carlos Valdes"], "character": ["Mari Jiwe McCabe / Vixen (voice)", "Barry Allen / The Flash (voice)", "Cisco Ramon (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62125   Expand Vixen   (2015) User Score  Play Trailer Overview Originally from Africa, Mari McGabe's parents were killed by local greed, corruption and wanton violence.But the orphaned Marl refuses to succumb to the terrors surrounding her. Inheriting her family's Tantu Totem, Mari can access the powers of animals - anything from the super-strength of a gorilla to the speed of a cheetah. As Vixen she fights valiantly to protect the world from threats like those that claimed her family. Featured Crew Marc Guggenheim Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megalyn Echikunwoke Mari Jiwe McCabe / Vixen (voice) Grant Gustin Barry Allen / The Flash (voice) Carlos Valdes Cisco Ramon (voice) Full Cast & Crew Last Season Season 2 2016 | 6 Episodes Season 2 of Vixen premiered on October 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   2007-01-01 The IT Crowd 7.2    2009-04-24 Iron Man: Armored Adventures 7.1    Holliston 7.2    2016-01-19 The Wizards of Aus 7.0    2013-08-11 Marvel’s Hulk and the Agents of S.M.A.S.H 5.5    2015-09-22 The Muppets 7.2    2003-07-11 Spider-Man: The New Animated Series 6.5    2014-08-28 Hand of God 6.8  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  5m Homepage   http://www.cwseed.com/shows/vixen Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords dc comics superheroine based on comic arrow super power masked superhero Content Score 71 Just a little bit more... Top Contributors 41 Martin R 34 Rebecca D 9 Dave_Cruz 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}