{"link": "https://www.themoviedb.org/tv/46332?language=en", "title": "H+: The Digital Series", "resume": "H+: The Digital Series is a web series produced by Bryan Singer and created by John Cabrera and Cosimo De Tommaso. The series, which touches on the subject of transhumanism, premiered on August 8, 2012 on YouTube with two episodes. Two new episodes were then released every week on Wednesdays until the season finale on January 16, 2013. A second season is currently in production.", "rate": 74, "genre": ["Drama", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Amir Arison", "Caitriona Balfe", "Nikki Crawford", "Alexis Denisof", "Hannah Simone"], "character": ["Y. Gurveer", "Breanna Sheehan", "Julie Martin", "Conall Sheehan", "Leena Param"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46332   Expand H+: The Digital Series   (2012) User Score Overview H+: The Digital Series is a web series produced by Bryan Singer and created by John Cabrera and Cosimo De Tommaso. The series, which touches on the subject of transhumanism, premiered on August 8, 2012 on YouTube with two episodes. Two new episodes were then released every week on Wednesdays until the season finale on January 16, 2013. A second season is currently in production. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amir Arison Y. Gurveer Caitriona Balfe Breanna Sheehan Nikki Crawford Julie Martin Alexis Denisof Conall Sheehan Hannah Simone Leena Param Full Cast & Crew Last Season Season 1 2012 | 48 Episodes Season 1 of H+: The Digital Series premiered on August  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on H+: The Digital Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage   http://www.hplusdigitalseries.com/ Genres Drama Action & Adventure Sci-Fi & Fantasy Keywords future computer virus technology nanotechnology disaster implant multinational brain implant computer in brain Content Score 86 Almost there... Top Contributors 21 Banana 12 Nero Kosonen 7 Mitsarinho 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}