{"link": "https://www.themoviedb.org/tv/925?language=en", "title": "77 Sunset Strip", "resume": "77 Sunset Strip is an hour-length American television private detective series created by Roy Huggins and starring Efrem Zimbalist, Jr., Roger Smith, and Edd Byrnes.\nThe show was the subject of an ownership battle between Roy Huggins and Warner Brothers, which was the proximate cause of Huggins' departure from the studio. The series was based on novels and short stories written by Huggins prior to his arrival at Warner, but, as a matter of legal record, derived from a brief Caribbean theatrical release of its pilot, Girl on the Run. The show ran from 1958 to 1964.", "rate": 78, "genre": ["Drama", "Crime"], "cast": ["Efrem Zimbalist, Jr.", "Roger Smith", "Edd Byrnes", "Jacqueline Beer", "Louis Quinn"], "character": ["Stuart Bailey", "Jeff Spencer", "Gerald Lloyd \"Kookie\" Kookson III", "Suzanne Fabray", "Roscoe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 925   Expand 77 Sunset Strip   (1958) User Score Overview 77 Sunset Strip is an hour-length American television private detective series created by Roy Huggins and starring Efrem Zimbalist, Jr., Roger Smith, and Edd Byrnes. The show was the subject of an ownership battle between Roy Huggins and Warner Brothers, which was the proximate cause of Huggins' departure from the studio. The series was based on novels and short stories written by Huggins prior to his arrival at Warner, but, as a matter of legal record, derived from a brief Caribbean theatrical release of its pilot, Girl on the Run. The show ran from 1958 to 1964. Featured Crew Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Efrem Zimbalist, Jr. Stuart Bailey Roger Smith Jeff Spencer Edd Byrnes Gerald Lloyd \"Kookie\" Kookson III Jacqueline Beer Suzanne Fabray Louis Quinn Roscoe Full Cast & Crew Last Season Season 6 1963 | 20 Episodes Season 6 of 77 Sunset Strip premiered on September 20, 1963. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply l New here. Open 7 by  JohnSteed l MeTV restarting the series Open 3 by  JohnSteed l Rest In Peace Roger Smith 1932 - 2017 Open 1 by  JohnSteed Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1958-09-24 The Donna Reed Show 6.7    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1961-09-28 Hazel 7.8    1969-09-17 The Courtship of Eddie's Father 6.2    1973-01-28 Barnaby Jones 8.0    1968-01-09 It Takes a Thief 7.4    1959-10-05 Adventures in Paradise 7.5    1961-10-02 Ben Casey 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Crime Keywords private detective hip and cool Content Score 93 Almost there... Top Contributors 8 lineker PE 4 Patrick E. Abe 3 Steve S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}