{"link": "https://www.themoviedb.org/tv/6971?language=en", "title": "XIII", "resume": "The first female US President Sally Sheridan is shot dead by a sniper during her Veterans Day speech. Her assassin narrowly escapes the scene with his life, national security hot on his heels - or so it seems. Three months later, an elderly couple discover the body of a wounded man in a tree, wearing a parachute. The young man cannot remember the slightest thing about his own identity.", "rate": 62, "genre": ["Action", "Adventure", "War", "Politics"], "cast": ["Stephen McHattie", "Jessalyn Gilsig", "Val Kilmer", "Stephen Dorff", "Jacqueline Pillon"], "character": ["General Carrington", "Kim Rowland", "La Mangouste", "Ross Tanner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6971   Expand XIII   (2008) User Score Overview The first female US President Sally Sheridan is shot dead by a sniper during her Veterans Day speech. Her assassin narrowly escapes the scene with his life, national security hot on his heels - or so it seems. Three months later, an elderly couple discover the body of a wounded man in a tree, wearing a parachute. The young man cannot remember the slightest thing about his own identity. Featured Crew Philippe Lyon Creator David Wolkove Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  35 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen McHattie General Carrington Jessalyn Gilsig Kim Rowland Val Kilmer La Mangouste Stephen Dorff Ross Tanner Jacqueline Pillon Full Cast & Crew Last Season Season 1 2008 | 2 Episodes Season 1 of XIII premiered on October  6, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for XIII. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  35 Posters  8 Recommendations   2004-07-19 The Grid 7.0    2011-06-06 Injustice 7.3    2012-08-30 Good Cop 6.6    2006-01-01 In Justice 6.8    2010-07-12 The Silence 6.8    2011-01-13 Kidnap and Ransom 7.6    2013-09-05 The Guilty 7.0    2004-10-24 ReGenesis 7.0  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  86m Homepage  - Genres Action & Adventure War & Politics Keywords amnesia false identity plastic surgery based on comic memory loss conspiracy man hunt miniseries torture based on graphic novel multiple identities assassination of president Content Score 93 Almost there... Top Contributors TB 63 TMDb Bot 20 Marr 🇳🇱 14 Banana o 13 orhan_yümücly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}