{"link": "https://www.themoviedb.org/tv/5343?language=en", "title": "Beakman's World", "resume": "Beakman's World is an educational children's television show. The program is based on the Universal Press Syndicate syndicated comic strip You Can with Beakman and Jax created by Jok Church. The series premiered September 18, 1992 on The Learning Channel cable network and in national syndication.\nOn September 18, 1993 it moved from national syndication to CBS Saturday morning children’s lineup. At the peak of its popularity, it was seen in nearly 90 countries around the world. The series was canceled in 1998. Reruns returned to national syndication in September 2006, after which it was transferred to local stations such as KICU. The show debuted a year prior to Bill Nye the Science Guy, which covered similar topics. The show's host, Paul Zaloom, still performs as Beakman in live appearances around the globe.", "rate": 83, "genre": ["Comedy", "Family", "Kids"], "cast": ["Paul Zaloom", "Jean Stapleton", "Alanna Ubach", "Senta Moses", "Mark Ritts"], "character": ["Beakman", "Beakman's Mom", "Josie", "Phoebe", "Lester"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5343   Expand Beakman's World   (1992) User Score Overview Beakman's World is an educational children's television show. The program is based on the Universal Press Syndicate syndicated comic strip You Can with Beakman and Jax created by Jok Church. The series premiered September 18, 1992 on The Learning Channel cable network and in national syndication. On September 18, 1993 it moved from national syndication to CBS Saturday morning children’s lineup. At the peak of its popularity, it was seen in nearly 90 countries around the world. The series was canceled in 1998. Reruns returned to national syndication in September 2006, after which it was transferred to local stations such as KICU. The show debuted a year prior to Bill Nye the Science Guy, which covered similar topics. The show's host, Paul Zaloom, still performs as Beakman in live appearances around the globe. Featured Crew Jok R. Church Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Zaloom Beakman Jean Stapleton Beakman's Mom Alanna Ubach Josie Senta Moses Phoebe Mark Ritts Lester Full Cast & Crew Last Season Season 4 1996 | 26 Episodes Season 4 of Beakman's World premiered on September 14, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1990-09-10 Captain Planet and the Planeteers 5.9    1994-01-26 The Critic 7.7    1994-09-10 The Tick 7.7    1984-11-05 Muppet Babies 7.2    1990-09-14 Tiny Toon Adventures 7.3  Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  26m, 30m, 22m Homepage  - Genres Comedy Family Kids Keywords experiment based on comic scientist educational science Content Score 93 Almost there... Top Contributors 16 Banana 8 vestival 8 TheOneManBoxOffice z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}