{"link": "https://www.themoviedb.org/tv/73178?language=en", "title": "The Long Road Home", "resume": "Relive a heroic fight for survival during the Iraq War, when the 1st Cavalry Division from Fort Hood was ferociously ambushed on April 4, 2004, in Sadr City, Baghdad — a day that came to be known in military annals as “Black Sunday.”", "rate": 74, "genre": ["War", "Politics"], "cast": ["Michael Kelly", "E.J. Bonilla", "Noel Fisher", "Darius Homayoun", "Jon Beavers"], "character": ["Lt. Col. Gary Volesky", "Lt. Shane Aguero", "Pvt Tomas Young", "Jassim Al-Lani", "Sgt. Eric Bourquin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73178   Expand The Long Road Home   (2017) User Score  Play Trailer Overview Relive a heroic fight for survival during the Iraq War, when the 1st Cavalry Division from Fort Hood was ferociously ambushed on April 4, 2004, in Sadr City, Baghdad — a day that came to be known in military annals as “Black Sunday.” Featured Crew Mikko Alanne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Kelly Lt. Col. Gary Volesky E.J. Bonilla Lt. Shane Aguero Noel Fisher Pvt Tomas Young Darius Homayoun Jassim Al-Lani Jon Beavers Sgt. Eric Bourquin Full Cast & Crew Current Season Season 1 2017 | 7 Episodes Season 1 of The Long Road Home premiered on November  7, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Episode Listings Modify Request Open 0 by Curtis G Hanson\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  2 Recommendations   2017-10-09 Valor 6.3    2017-09-25 The Brave 6.6    2017-10-03 The Mayor 6.7    2017-10-21 Gunpowder 6.8    2017-09-07 Tin Star 7.3    2017-09-27 SEAL Team 6.6    2017-03-05 Time After Time 7.1    2017-10-02 The Gifted 7.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  47m, 95m Homepage   http://channel.nationalgeographic.com/the-long-road-home/ Genres War & Politics Keywords shooting soldier iraq war warfield Content Score 100 Yes! Looking good! Top Contributors 23 Elizabeth Jennings p 18 plumpro G 8 Gonçalo 7 Farkas Tibor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}