{"link": "https://www.themoviedb.org/tv/11196?language=en", "title": "Catweazle", "resume": "Catweazle is a British television series, created and written by Richard Carpenter which was produced and directed by Quentin Lawrence for London Weekend Television under the LWI banner, and screened in the UK on ITV in 1970. A second season in 1971 was directed by David Reid and David Lane. Both series had thirteen episodes each, with Geoffrey Bayldon playing the leading role.\nThe series was broadcast in Ireland, Britain, Gibraltar, New Zealand, The Netherlands, Germany, Australia, Sweden, Norway, Iceland, Czechoslovakia, Nicaragua and Quebec. The first episode is available to view in full at the BFI Screenonline site.", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Geoffrey Bayldon", "Charles Tingwell", "Moray Watson", "Neil McCarthy", "Robin Davies"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11196   Expand Catweazle   (1970) User Score Overview Catweazle is a British television series, created and written by Richard Carpenter which was produced and directed by Quentin Lawrence for London Weekend Television under the LWI banner, and screened in the UK on ITV in 1970. A second season in 1971 was directed by David Reid and David Lane. Both series had thirteen episodes each, with Geoffrey Bayldon playing the leading role. The series was broadcast in Ireland, Britain, Gibraltar, New Zealand, The Netherlands, Germany, Australia, Sweden, Norway, Iceland, Czechoslovakia, Nicaragua and Quebec. The first episode is available to view in full at the BFI Screenonline site. Featured Crew Richard Carpenter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Geoffrey Bayldon Charles Tingwell Moray Watson Neil McCarthy Robin Davies Full Cast & Crew Last Season Season 2 1971 | 13 Episodes Season 2 of Catweazle premiered on January 10, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1974-04-03 Vicky the Viking 6.1    1972-09-16 The Streets of San Francisco 7.1    1959-09-12 Bonanza 5.9    1954-09-12 Lassie 5.3    1974-03-27 The Rockford Files 7.2    1972-09-14 The Waltons 6.6    1975-09-10 Starsky & Hutch 6.5    1973-10-24 Kojak 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 7 Samara M 6 Marc j 5 jzvc k 3 kevin-93  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}