{"link": "https://www.themoviedb.org/tv/70793?language=en", "title": "Oasis", "resume": "Set in the near future, Oasis tells the story of priest Peter Leigh, who is called to a remote planet where a mysterious multinational company is building the first permanent off-Earth human colony. The planet, Oasis, is humanity’s last chance to escape from Earth’s impending collapse, but it quickly becomes apparent that it may not be as hospitable to humanity as it seems...\nNote: This is a pilot episode only.", "rate": 73, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Richard Madden", "Anil Kapoor", "Antje Traue", "Haley Joel Osment", "Zawe Ashton"], "character": ["Peter Leigh", "Vikram Danesh", "Sara Keller", "Sy Phillips", "Severin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70793   Expand Oasis   (2017) User Score Overview Set in the near future, Oasis tells the story of priest Peter Leigh, who is called to a remote planet where a mysterious multinational company is building the first permanent off-Earth human colony. The planet, Oasis, is humanity’s last chance to escape from Earth’s impending collapse, but it quickly becomes apparent that it may not be as hospitable to humanity as it seems... Note: This is a pilot episode only. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Madden Peter Leigh Anil Kapoor Vikram Danesh Antje Traue Sara Keller Haley Joel Osment Sy Phillips Zawe Ashton Severin Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of Oasis premiered on March 16, 2017. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Season 1 Open 7 by  Martin Baars Any news on season 1? Open 0 by Martin Baars\n      \n     The plot summary ... Open 0 by cursethedarkness\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2017-06-01 Missions 8.7    2006-11-02 The State Within 7.8    2016-06-01 Cleverman 5.7    2016-10-11 Channel Zero 6.6    2012-06-26 Line of Duty 8.0    2012-08-13 Major Crimes 6.7    2016-01-26 Outsiders 6.7    2016-03-30 The Path 6.6  Facts Status  Pilot Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  59m Homepage   https://www.amazon.com/dp/B06W5H33JH Genres Sci-Fi & Fantasy Keywords fantasy Content Score 86 Almost there... Top Contributors 23 Elizabeth Jennings d 22 diablo1 14 outlawx C 11 Chigraz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}