{"link": "https://www.themoviedb.org/tv/43065?language=en", "title": "Treasure Island", "resume": "Treasure Island is a two-part British television miniseries adaptation of the novel Treasure Island by Robert Louis Stevenson. The screenplay was written by Stewart Harcourt, produced by Laurie Borg and directed by Steve Barron. It was made by BSkyB and first shown in the United Kingdom on Sky1 on 1 & 2 January 2012.", "rate": 65, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Eddie Izzard", "Philip Glenister", "Rupert Penry-Jones", "Toby Regbo", "Daniel Mays"], "character": ["Long John Silver", "Captain Smollett", "Squire John Trelawney", "Jim Hawkins", "Dr. David Livesey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43065   Expand Treasure Island   (2012) User Score  Play Trailer Overview Treasure Island is a two-part British television miniseries adaptation of the novel Treasure Island by Robert Louis Stevenson. The screenplay was written by Stewart Harcourt, produced by Laurie Borg and directed by Steve Barron. It was made by BSkyB and first shown in the United Kingdom on Sky1 on 1 & 2 January 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eddie Izzard Long John Silver Philip Glenister Captain Smollett Rupert Penry-Jones Squire John Trelawney Toby Regbo Jim Hawkins Daniel Mays Dr. David Livesey Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of Treasure Island premiered on January  1, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  15 Recommendations   2011-09-14 Planet Dinosaur 7.9    2011-05-07 The Witches of Oz 4.4    2009-01-25 The Last Templar 5.0    1999-11-14 Aftershock: Earthquake in New York 4.9    2011-03-06 Wonders of the Universe 8.2    2013-02-14 Zero Hour 4.9    1997-05-11 20,000 Leagues Under the Sea 4.6    2008-03-23 The Colour of Magic 6.5  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Action & Adventure Animation Drama Keywords ship based on novel or book treasure map miniseries pirate treasure island Content Score 93 Almost there... Top Contributors TB 83 TMDb Bot 16 Banana 12 Travis Bell s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}