{"link": "https://www.themoviedb.org/tv/869?language=en", "title": "Son of the Beach", "resume": "A parody of \"Baywatch\" featuring Malibu Adjacent's Notch Johnson, the world's greatest lifeguard (hardly), and his unit SPF-30.", "rate": 71, "genre": ["Comedy"], "cast": ["Timothy Stack", "Jaime Bergman", "Leila Arcieri", "Kimberly Oja", "Lisa Banes"], "character": ["Notch Johnson", "B.J. Cummings", "Jamaica St. Croix", "Kimberlee Clark", "Mayor Anita Massengil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 869   Expand Son of the Beach   (2000) User Score  Play Trailer Overview A parody of \"Baywatch\" featuring Malibu Adjacent's Notch Johnson, the world's greatest lifeguard (hardly), and his unit SPF-30. Featured Crew Timothy Stack Creator James R. Stein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  1 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Timothy Stack Notch Johnson Jaime Bergman B.J. Cummings Leila Arcieri Jamaica St. Croix Kimberly Oja Kimberlee Clark Lisa Banes Mayor Anita Massengil Full Cast & Crew Last Season Season 3 2002 | 14 Episodes Season 3 of Son of the Beach premiered on June 18, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply O Love how Notch says things with sexual innuendos Open 0 by Ogopogo99\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  2 Posters  1 Recommendations   1988-11-14 Murphy Brown 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords spoof lifeguard sitcom Content Score 100 Yes! Looking good! Top Contributors 14 Elizabeth Jennings 5 Banana O 4 Ogopogo99 W 2 Wakaku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}