{"link": "https://www.themoviedb.org/tv/19849?language=en", "title": "Blood+", "resume": "Blood+, pronounced as \"Blood Plus\", is an anime series produced by Production I.G and Aniplex and directed by Junichi Fujisaku. The series premiered in Japan on Sony's anime satellite channel, Animax, as well as on terrestrial networks such as MBS, TBS, and RKB on October 8, 2005. The final episode aired on September 23, 2006. Blood+ is licensed for international distribution in several regions through Sony Pictures' international arm, Sony Pictures Television International.\nBlood+ was inspired by the 2000 anime film Blood: The Last Vampire; however, there are only a few allusions and basic elements from the film. Fujisaku has been involved with both works, including acting as the director for Blood+ and writing the novelization of Blood: The Last Vampire.", "rate": 70, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Akira Ishida", "Akiko Yajima", "Katsuyuki Konishi", "Eri Kitamura", "Hōchū Ōtsuka"], "character": ["Saya Otonashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19849   Expand Blood+   (2005) User Score Overview Blood+, pronounced as \"Blood Plus\", is an anime series produced by Production I.G and Aniplex and directed by Junichi Fujisaku. The series premiered in Japan on Sony's anime satellite channel, Animax, as well as on terrestrial networks such as MBS, TBS, and RKB on October 8, 2005. The final episode aired on September 23, 2006. Blood+ is licensed for international distribution in several regions through Sony Pictures' international arm, Sony Pictures Television International. Blood+ was inspired by the 2000 anime film Blood: The Last Vampire; however, there are only a few allusions and basic elements from the film. Fujisaku has been involved with both works, including acting as the director for Blood+ and writing the novelization of Blood: The Last Vampire. Featured Crew Nanase Ohkawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akira Ishida Akiko Yajima Katsuyuki Konishi Eri Kitamura Saya Otonashi Hōchū Ōtsuka Full Cast & Crew Last Season + season 4 2006 | 11 Episodes Season 4 of Blood+ premiered on July  8, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   2003-11-24 Chrno Crusade 5.7    2012-12-03 Guilty Crown 7.4    2007-04-03 Claymore 7.1    2007-07-05 Higurashi When They Cry 7.6    2004-07-25 Elfen Lied 7.6    2007-06-09 Ergo Proxy 7.3    2010-07-05 Highschool of the Dead 7.0    2008-01-08 Spice and Wolf 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 11 benf45 t 4 tmdb983464 W 4 Wiruss L 4 LordAfro420  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}