{"link": "https://www.themoviedb.org/tv/4508?language=en", "title": "The Zeta Project", "resume": "The Zeta Project is an American science fiction animated television series produced by Warner Bros. Animation. It first aired on Kids' WB in January 2001. It is a spin-off series based on the character Zeta from the Batman Beyond episode of the same name. Consequently, it is part of the DC animated universe. The show was created by Robert Goodman and Warner Bros. Animation.\nThe story's main character, Infiltration Unit Zeta, is a humanoid robot designed to carry out covert assassinations on the behalf of the National Security Agency. However, when Zeta discovers that one of his targets is innocent, he experiences a kind of existential crisis about goodness and the value of life; following this epiphany, Zeta finds he can no longer kill. The newly enlightened Zeta refuses to continue on as an infiltration unit and abandons his mission, going rogue. Zeta is pursued by a team of NSA agents, led by the obsessed Agent Bennett, and is aided by a 15-year-old runaway, Rosalie \"Ro\" Rowan.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Diedrich Bader", "Kurtwood Smith", "Michael Rosenbaum", "Julie Nathanson", "Dominique Jennings"], "character": ["Zee (voice)", "Agent James Bennet (voice)", "Agent West (voice)", "Rosalie Rowan (voice)", "Agent Rush (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4508   Expand The Zeta Project   (2001) User Score Overview The Zeta Project is an American science fiction animated television series produced by Warner Bros. Animation. It first aired on Kids' WB in January 2001. It is a spin-off series based on the character Zeta from the Batman Beyond episode of the same name. Consequently, it is part of the DC animated universe. The show was created by Robert Goodman and Warner Bros. Animation. The story's main character, Infiltration Unit Zeta, is a humanoid robot designed to carry out covert assassinations on the behalf of the National Security Agency. However, when Zeta discovers that one of his targets is innocent, he experiences a kind of existential crisis about goodness and the value of life; following this epiphany, Zeta finds he can no longer kill. The newly enlightened Zeta refuses to continue on as an infiltration unit and abandons his mission, going rogue. Zeta is pursued by a team of NSA agents, led by the obsessed Agent Bennett, and is aided by a 15-year-old runaway, Rosalie \"Ro\" Rowan. Featured Crew Bob Goodman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diedrich Bader Zee (voice) Kurtwood Smith Agent James Bennet (voice) Michael Rosenbaum Agent West (voice) Julie Nathanson Rosalie Rowan (voice) Dominique Jennings Agent Rush (voice) Full Cast & Crew Last Season Season 2 2002 | 14 Episodes Season 2 of The Zeta Project premiered on March 23, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Zeta Project. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords robot Content Score 93 Almost there... Top Contributors 20 Banana CM 8 Cherche Moi R 4 Rebecca 3 Rafaelasauani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}