{"link": "https://www.themoviedb.org/tv/64237?language=en", "title": "Historia de un Clan", "resume": "This drama based on a true story follows the Puccios, a criminal family who kidnaps wealthy people and holds them hostage in their home.", "rate": 76, "genre": ["Crime", "Drama"], "cast": ["Cecilia Roth", "Alejandro Awada", "Chino Darín", "Nazareno Casero", "Tristán"], "character": ["Epifania Calvo de Puccio", "Arquimides Puccio", "Alejandro Puccio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64237   Expand Historia de un Clan   (2015) User Score  Play Trailer Overview This drama based on a true story follows the Puccios, a criminal family who kidnaps wealthy people and holds them hostage in their home. Featured Crew Luis Ortega Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cecilia Roth Epifania Calvo de Puccio Alejandro Awada Arquimides Puccio Chino Darín Alejandro Puccio Nazareno Casero Tristán Full Cast & Crew Last Season Season 1 2015 | 11 Episodes Season 1 of Historia de un Clan premiered on September  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Historia de un Clan. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Telefe Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage   https://www.netflix.com/title/80125593 Genres Crime Drama Keywords family crime family puccio Content Score 86 Almost there... Top Contributors 27 juanchixx 5 joeynotjoe 5 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}