{"link": "https://www.themoviedb.org/tv/6298?language=en", "title": "Dengeki Sentai Changeman", "resume": "After already conquering hundreds of planets, the Great Star League Gozma sets its sights onto Earth. To defend the lands in such a great crisis, the military begins a special branch known as the Earth Defense Force, comprised of elite members from all areas of the military. Under the supervision of Commander Ibuki, the numerous gathered soldiers of the Earth Defense Force begin a harsh training.", "rate": 90, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Haruki Hamada", "Takahashi Kazuoki", "Shirô Izumi", "Hiroko Nishimoto", "Mai Ooishi"], "character": ["Change Dragon", "Change Griffon", "Change Pegasus", "Change Mermaid", "Change Phoenix"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6298   Expand Dengeki Sentai Changeman   (1985) User Score Overview After already conquering hundreds of planets, the Great Star League Gozma sets its sights onto Earth. To defend the lands in such a great crisis, the military begins a special branch known as the Earth Defense Force, comprised of elite members from all areas of the military. Under the supervision of Commander Ibuki, the numerous gathered soldiers of the Earth Defense Force begin a harsh training. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruki Hamada Change Dragon Takahashi Kazuoki Change Griffon Shirô Izumi Change Pegasus Hiroko Nishimoto Change Mermaid Mai Ooishi Change Phoenix Full Cast & Crew Last Season Season 1 1985 | 55 Episodes Season 1 of Dengeki Sentai Changeman premiered on February  2, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   1985-03-15 Kyojuu Tokusou Juspion 9.0  Facts Original Name  電撃戦隊チェンジマン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  20m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords super sentai changeman sentaï Content Score 86 Almost there... Top Contributors P 53 PC 20 Renato NS 14 Norte Serra 11 Jack Duiz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}