{"link": "https://www.themoviedb.org/tv/60901?language=en", "title": "Welcome to Sweden", "resume": "The fish-out-of-water story of New York accountant Bruce, who falls in love with a Swedish girl named Emma and follows her to Sweden.", "rate": 63, "genre": ["Comedy"], "cast": ["Greg Poehler", "Josephine Bornebusch", "Lena Olin", "Claes Månsson"], "character": ["Bruce", "Emma", "Viveka", "Emma's Father"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60901   Expand Welcome to Sweden   (2014) User Score  Play Trailer Overview The fish-out-of-water story of New York accountant Bruce, who falls in love with a Swedish girl named Emma and follows her to Sweden. Featured Crew Greg Poehler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Poehler Bruce Josephine Bornebusch Emma Lena Olin Viveka Claes Månsson Emma's Father Full Cast & Crew Last Season Season 2 2015 | 10 Episodes Season 2 of Welcome to Sweden premiered on April  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2015-06-10 The Interceptor 5.7    2015-03-17 Ordinary Lies 7.0    2015-09-30 Marley's Ghosts 7.0    2015-03-25 Big Time in Hollywood, Fl 5.7    2015-01-13 Cockroaches 6.0    2013-08-05 Quick Draw 6.3    2015-06-08 Odd Mom Out 6.7    2013-04-19 Alpha House 7.3  Facts Status  Cancelled Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.tv4.se/welcome-to-sweden Genres Comedy Keywords sweden scandinavia fish out of water expatriate Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings z 6 zurman1 AK 5 Avshalom Kor b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}