{"link": "https://www.themoviedb.org/tv/67013?language=en", "title": "The Highschool Life of a Fudanshi", "resume": "Sakaguchi is a high school boy and also a \"fudanshi\" who loves boys-love stories. He hangs out with his friends, a fujoshi named Rumi, his gay friend Yūjirō, fellow fundashi Daigo, and his \"normal\" friend Nakamura.", "rate": 62, "genre": ["Animation", "Comedy", "Soap"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67013   Expand The Highschool Life of a Fudanshi   (2016) User Score Overview Sakaguchi is a high school boy and also a \"fudanshi\" who loves boys-love stories. He hangs out with his friends, a fujoshi named Rumi, his gay friend Yūjirō, fellow fundashi Daigo, and his \"normal\" friend Nakamura. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of The Highschool Life of a Fudanshi premiered on July  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2017-01-06 Saga of Tanya the Evil 7.6    2015-07-03 Ushio to Tora 4.4  Facts Original Name  腐男子高校生活 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  3m Homepage  - Genres Animation Comedy Soap Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 10 karaa 9 Elizabeth Jennings 8 Jenazad R 4 RsTxSpyMaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}