{"link": "https://www.themoviedb.org/tv/13881?language=en", "title": "The Invaders", "resume": "The Invaders, alien beings from a dying planet. Their destination: the Earth. Their purpose: to make it their world. David Vincent has seen them, for him it began one lost night on a lonely country road, looking for a shortcut that he never found. It began with a closed deserted diner, and a man too long without sleep to continue his journey. It began with the landing of a craft from another galaxy. Now, David Vincent knows that the Invaders are here, that they have taken human form. Somehow he must convince a disbelieving world that the nightmare has already begun.", "rate": 73, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Roy Thinnes"], "character": ["David Vincent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13881   Expand The Invaders   (1967) User Score Overview The Invaders, alien beings from a dying planet. Their destination: the Earth. Their purpose: to make it their world. David Vincent has seen them, for him it began one lost night on a lonely country road, looking for a shortcut that he never found. It began with a closed deserted diner, and a man too long without sleep to continue his journey. It began with the landing of a craft from another galaxy. Now, David Vincent knows that the Invaders are here, that they have taken human form. Somehow he must convince a disbelieving world that the nightmare has already begun. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roy Thinnes David Vincent Full Cast & Crew Last Season Season 2 1967 | 26 Episodes Season 2 of The Invaders premiered on September  5, 1967. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply the experiment Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   A Christmas Carol 7.5    2009-08-24 Pointless 6.9    1966-01-11 Daktari 5.0    1979-09-30 To the Manor Born 7.1    2002-06-08 Ant & Dec's Saturday Night Takeaway 4.8    1967-09-10 The High Chaparral 8.3    1976-09-06 George and Mildred 6.6    1978-11-10 Butterflies 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords alien ufo Content Score 64 We're so close, yet so far. Top Contributors 18 Elizabeth Jennings 10 Mitsarinho z 6 zurman1 p 3 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}