{"link": "https://www.themoviedb.org/tv/9203?language=en", "title": "10.5: Apocalypse", "resume": "Deadly seismic activities that peaked with a 10.5 earthquake and devastated the West Coast have altered the core structure of the earth and now threaten to jeopardize North America and the Western hemisphere. In a desperate bid to save lives--and the country--President Hollister calls once again upon one of the nation's top seismologists, controversial scientist Dr. Samantha Hill and her supervisor and former boyfriend Dr. Jordan Fisher, to interpret the latest onslaught of quakes.", "rate": 51, "genre": ["Action", "Adventure", "Drama"], "cast": ["Carly Pope", "Kim Delaney", "David Cubitt", "Carlos Bernard", "Frank Langella"], "character": ["Dr. Samantha Hill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9203   Expand 10.5: Apocalypse   (2006) User Score  Play Trailer Overview Deadly seismic activities that peaked with a 10.5 earthquake and devastated the West Coast have altered the core structure of the earth and now threaten to jeopardize North America and the Western hemisphere. In a desperate bid to save lives--and the country--President Hollister calls once again upon one of the nation's top seismologists, controversial scientist Dr. Samantha Hill and her supervisor and former boyfriend Dr. Jordan Fisher, to interpret the latest onslaught of quakes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carly Pope Kim Delaney Dr. Samantha Hill David Cubitt Carlos Bernard Frank Langella Full Cast & Crew Last Season Season 1 2006 | 2 Episodes Season 1 of 10.5: Apocalypse premiered on May 21, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  10 Recommendations   2004-05-02 10.5 6.0    2009-07-26 The Storm 4.0    2004-05-15 Strictly Come Dancing 4.8    2013-02-08 CAT. 8 6.2    2007-01-10 Killer Wave 5.7    1999-11-14 Aftershock: Earthquake in New York 4.9    2009-02-14 Impact 5.1    1998-05-18 Creature 4.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  240m Homepage  - Genres Action & Adventure Drama Keywords natural disaster earthquake sequel miniseries Content Score 93 Almost there... Top Contributors TB 45 TMDb Bot 13 Banana N 3 Norbi86k86 t 1 thomas-dawidowski  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}