{"link": "https://www.themoviedb.org/tv/42567?language=en", "title": "Ai Yori Aoshi", "resume": "Kaoru is a college boy with everything going for him. He lives in a mansion with his beautiful fiancé, Aoi, all his roommates are babes, and they all have the hots for him. There’s just one hitch: due to family complications, Kaoru and his beloved have to keep their engagement a secret. As he gets tangled in countless steamy situations, can Kaoru overcome temptation and stay true to the lovely Aoi? Two is company and eight is a party in this romping romance brought to you by the director of Saber Marionette J.", "rate": 74, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Ayako Kawasumi", "Soichiro Hoshi", "Akiko Hiramatsu", "Haruko Momoi", "Kaori Mizuhashi"], "character": ["Aoi Sakuraba", "Kaoru Hanabishi", "Miyabi Kagurazaki", "Chika Minazuki", "Taeko Minazuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42567   Expand Ai Yori Aoshi   (2002) User Score Overview Kaoru is a college boy with everything going for him. He lives in a mansion with his beautiful fiancé, Aoi, all his roommates are babes, and they all have the hots for him. There’s just one hitch: due to family complications, Kaoru and his beloved have to keep their engagement a secret. As he gets tangled in countless steamy situations, can Kaoru overcome temptation and stay true to the lovely Aoi? Two is company and eight is a party in this romping romance brought to you by the director of Saber Marionette J. Featured Crew Kou Fumizuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayako Kawasumi Aoi Sakuraba Soichiro Hoshi Kaoru Hanabishi Akiko Hiramatsu Miyabi Kagurazaki Haruko Momoi Chika Minazuki Kaori Mizuhashi Taeko Minazuki Full Cast & Crew Last Season Season 2 2003 | 12 Episodes Season 2 of Ai Yori Aoshi premiered on October 12, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  7 Recommendations   2004-10-05 School Rumble 7.3    2005-01-06 Negima! Magister Negi Magi 6.7    2006-04-04 Ouran High School Host Club 7.6  Facts Original Name  藍より青し Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.funimation.com/shows/ai-yori-aoshi/home Genres Animation Comedy Drama Keywords harem romance slice of life anime fan service Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 23 WillofOwn 9 Levi Seguel CM 9 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}