{"link": "https://www.themoviedb.org/tv/57278?language=en", "title": "Secret Love", "resume": "A devoted woman makes the ultimate sacrifice for her boyfriend, only to learn that love doesn't always conquer all. Yoo Jeong (Hwang Jeong Eum) is a sweet, upbeat person who has always stuck by her boyfriend, Ahn Do Hoon (Bae Soo Bin), all through school as he cared for a disabled father. But Do Hoon gets into a car accident that results in the death of a woman. Unable to face her boyfriend having to go to jail for a hit-and-run accident, the self-sacrificing Yoo Jeong takes the blame for the accident and serves time in prison in his place. Min Hyeok (Ji Sung), a cold-hearted heir to a business empire, had just begun to open his heart to a woman when she is killed in the hit-and-run accident. Years later, he is engaged to Shin Se Yeon (Lee Da Hee), a congressman's daughter. Can Yoo Jeong and Min Hyeok mend their wounded hearts and discover the real meaning of love?", "rate": 85, "genre": ["Drama"], "cast": ["Hwang Jung-eum", "Ji Sung", "Bae Soo-bin", "Lee Da-hee", "Lee Deok-hwa "], "character": ["Kang Yoo-jung", "Jo Min-hyuk", "Ahn Do-hoon", "Shin Se-yeon", "Chairman Jo Han-il"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57278   Expand Secret Love   (2013) User Score  Play Trailer Overview A devoted woman makes the ultimate sacrifice for her boyfriend, only to learn that love doesn't always conquer all. Yoo Jeong (Hwang Jeong Eum) is a sweet, upbeat person who has always stuck by her boyfriend, Ahn Do Hoon (Bae Soo Bin), all through school as he cared for a disabled father. But Do Hoon gets into a car accident that results in the death of a woman. Unable to face her boyfriend having to go to jail for a hit-and-run accident, the self-sacrificing Yoo Jeong takes the blame for the accident and serves time in prison in his place. Min Hyeok (Ji Sung), a cold-hearted heir to a business empire, had just begun to open his heart to a woman when she is killed in the hit-and-run accident. Years later, he is engaged to Shin Se Yeon (Lee Da Hee), a congressman's daughter. Can Yoo Jeong and Min Hyeok mend their wounded hearts and discover the real meaning of love?  Featured Crew 黄向阳 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hwang Jung-eum Kang Yoo-jung Ji Sung Jo Min-hyuk Bae Soo-bin Ahn Do-hoon Lee Da-hee Shin Se-yeon Lee Deok-hwa  Chairman Jo Han-il Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of Secret Love premiered on September 25, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2017-01-23 Defendant 7.1    2015-01-07 Kill Me, Heal Me 8.7    2012-05-30 Bridal Mask 9.5    2013-08-05 Good Doctor 8.6    2014-12-08 Healer 8.7    2017-05-22 Fight For My Way 7.3  Facts Original Name  비밀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/secretlove/ Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors M 47 Maria180493 CM 4 Cherche Moi t 4 tmdb38202327 h 4 hxy112922  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}