{"link": "https://www.themoviedb.org/tv/70664?language=en", "title": "I Love My President Though He Is A Psycho", "resume": "Shi Xiao Nian is a third-rate cartoonist living an ordinary life. Until one day Gong Ou, a rich CEO of an IT company, suffering from paranoid personality disorder, captures her and asks her to return their child, which she “supposedly” gave birth to 3 years before. He utilizes every mean to force an answer and to pursue her, including low-EQ techniques. But as he faces her gentleness and courage, they fall in love...", "rate": 0, "genre": ["Drama"], "cast": ["Pan Zi Jian", "Nicole Zhu", "Yvonne Yung Hung"], "character": ["Gong Ou", "Shi Xiao Nian", "Luo Qi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70664   Expand I Love My President Though He Is A Psycho   (2017) User Score Overview Shi Xiao Nian is a third-rate cartoonist living an ordinary life. Until one day Gong Ou, a rich CEO of an IT company, suffering from paranoid personality disorder, captures her and asks her to return their child, which she “supposedly” gave birth to 3 years before. He utilizes every mean to force an answer and to pursue her, including low-EQ techniques. But as he faces her gentleness and courage, they fall in love... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pan Zi Jian Gong Ou Nicole Zhu Shi Xiao Nian Yvonne Yung Hung Luo Qi Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of I Love My President Though He Is A Psycho premiered on February 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Love My President Though He Is A Psycho. You can help by rating TV shows you've seen. Facts Original Name  总裁在上我在下 Status  Ended Network LeTV Certification  - Type  Scripted Original Language  Chinese Runtime  60m Homepage  - Genres Drama Keywords china romance Content Score 56 We're so close, yet so far. Top Contributors M 12 Maria180493 11 mp4soju 4 thirstyhippo S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}