{"link": "https://www.themoviedb.org/tv/43822?language=en", "title": "Billy on the Street", "resume": "Funny Or Die’s Billy on the Street is an American comedy game show on the Fuse TV television network, hosted by Billy Eichner, where Billy goes out to the streets of New York and ask pedestrians questions about pop culture. Known games are \"For A Dollar\" and \"Quizzed in the Face\". Billy is also the Executive Producer and creator of the show.\nOn July 16th, 2013, the series was renewed for a third season.", "rate": 66, "genre": ["Comedy"], "cast": ["Billy Eichner"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43822   Expand Billy on the Street   (2011) User Score Overview Funny Or Die’s Billy on the Street is an American comedy game show on the Fuse TV television network, hosted by Billy Eichner, where Billy goes out to the streets of New York and ask pedestrians questions about pop culture. Known games are \"For A Dollar\" and \"Quizzed in the Face\". Billy is also the Executive Producer and creator of the show. On July 16th, 2013, the series was renewed for a third season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Eichner Himself Full Cast & Crew Last Season Season 5 2016 | 3 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Billy on the Street. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2016-10-14 Haters Back Off 6.1  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.funnyordie.com/billyonthestreet Genres Comedy Keywords quiz show street Content Score 56 We're so close, yet so far. Top Contributors A 14 Asset z 5 zurman1 5 Banana 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}