{"link": "https://www.themoviedb.org/tv/72785?language=en", "title": "In the Dark", "resume": "DI Helen Weeks grapples with pregnancy as she undertakes a very personal abduction case.", "rate": 66, "genre": ["Crime", "Drama"], "cast": ["MyAnna Buring", "Ben Batt", "David Leon", "Emma Fryer", "Louise Delamere"], "character": ["DI Helen Weeks", "DI Paul Hopkins", "DI Adam Perrin", "Linda Bates", "Sarah Rushton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72785   Expand In the Dark   (2017) User Score  Play Trailer Overview DI Helen Weeks grapples with pregnancy as she undertakes a very personal abduction case. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast MyAnna Buring DI Helen Weeks Ben Batt DI Paul Hopkins David Leon DI Adam Perrin Emma Fryer Linda Bates Louise Delamere Sarah Rushton Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of In the Dark premiered on July 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on In the Dark. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  58m Homepage   http://www.bbc.co.uk/programmes/b08ygbvr Genres Crime Drama Keywords miniseries Content Score 93 Almost there... Top Contributors TB 55 TMDb Bot 21 Elizabeth Jennings 12 ultraviolet R 10 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}