{"link": "https://www.themoviedb.org/tv/70781?language=en", "title": "Samurai Gourmet", "resume": "Recent retiree Takeshi rediscovers his passion for food and life by getting in touch with his inner warrior and eating what he truly desires.", "rate": 82, "genre": ["Drama"], "cast": ["Naoto Takenaka", "Honami Suzuki", "Tetsuji Tamayama"], "character": ["Takeshi Kasumi", "Shizuko Kasumi", "The Samurai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70781   Expand Samurai Gourmet   (2017) User Score Overview Recent retiree Takeshi rediscovers his passion for food and life by getting in touch with his inner warrior and eating what he truly desires. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Naoto Takenaka Takeshi Kasumi Honami Suzuki Shizuko Kasumi Tetsuji Tamayama The Samurai Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Samurai Gourmet premiered on March 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2013-10-08 Russell Peters vs. the World 6.5    2016-03-21 72 Dangerous Places to Live 6.0    2015-10-04 One-Punch Man 8.2  Facts Original Name  野武士のグルメ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m, 18m Homepage   https://www.netflix.com/title/80132738 Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 9 Elizabeth Jennings MP 7 Mr. Peanutbutter c 4 ctchim j 3 jeksn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}