{"link": "https://www.themoviedb.org/tv/46922?language=en", "title": "Ben 10: Omniverse", "resume": "Ben 10: Omniverse is an American animated television series currently airing on Cartoon Network, in the United States. The series is the fourth installment in the Ben 10 franchise. Man of Action created the franchise.\nThe series was announced at Cartoon Network's Upfront in 2011. Concept art, described as an homage to the original Ben 10 series, designed by Derrick J. Wyatt was first unveiled at the 2012 UK Toy Fair.\nThe series premiered on September 22, 2012, with a \"sneak episode\" that aired on August 1, 2012. A \"sneak peek\" of the series aired after \"Ben 10 Week\".\nThe show has been on hiatus since April 2013, and new episodes are scheduled to return on 5 October.", "rate": 61, "genre": ["Action", "Adventure", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46922   Expand Ben 10: Omniverse   (2012) User Score Overview Ben 10: Omniverse is an American animated television series currently airing on Cartoon Network, in the United States. The series is the fourth installment in the Ben 10 franchise. Man of Action created the franchise. The series was announced at Cartoon Network's Upfront in 2011. Concept art, described as an homage to the original Ben 10 series, designed by Derrick J. Wyatt was first unveiled at the 2012 UK Toy Fair. The series premiered on September 22, 2012, with a \"sneak episode\" that aired on August 1, 2012. A \"sneak peek\" of the series aired after \"Ben 10 Week\". The show has been on hiatus since April 2013, and new episodes are scheduled to return on 5 October. Featured Crew Joe Kelly Creator Joe Casey Creator Steven T. Seagle Creator Duncan Rouleau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season The Time War 2014 | 10 Episodes Season 8 of Ben 10: Omniverse premiered on November  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2010-04-23 Generator Rex 5.3    2008-04-18 Ben 10: Alien Force 6.1    2010-04-23 Ben 10: Ultimate Alien 6.1    2004-11-19 Hi Hi Puffy AmiYumi 4.0    2005-12-27 Ben 10 6.2    2005-12-26 My Gym Partner's a Monkey 5.0    2013-04-23 Teen Titans Go! 4.4    2010-11-26 Young Justice 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Action & Adventure Animation Keywords extraterrestrial technology transformation alien universe parallel world alien race Content Score 64 We're so close, yet so far. Top Contributors 15 Warenward k 10 k.OS S 3 Sokarius s 3 slartus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}