{"link": "https://www.themoviedb.org/tv/2282?language=en", "title": "Aquí no hay quien viva", "resume": "Aquí no hay quien viva is a Spanish television comedy focusing on the inhabitants of the fictional building in Desengaño 21, Calle Desengaño being a street between the Districts of Gran Via and Chueca in Madrid. The episodes debuted on the Antena 3 network, and were later rerun by the same network as well as cable/satellite channels Neox and Paramount Comedy. Antena 3 Internacional satellite channel broadcasts the series to Latin America. The series debuted in 2003 and became popular thanks to its funny characters, witty script, and capacity to integrate and poke fun at contemporary issues; the program presents a caustic satire of many of the 'types' found in Spanish society.\nIn 2006, Antena 3's rival Telecinco acquired a 15% share of Miramón Mendi, the company that produces the series. Miramón's contract with Antena 3 expired on June 2006 and was not renewed, bringing the series to an end, since the actors' contracts bind them to the production company and not to the network. Miramón Mendi then created a new series for Telecinco with most of the same actors and a similar setting, but with brand-new characters and storyline. La que se avecina débuted 22 April 2007.", "rate": 69, "genre": ["Comedy"], "cast": ["Fernando Tejero", "José Luis Gil", "Malena Alterio", "Luis Merlo", "Adrià Collado"], "character": ["Emilio Delgado Martínez", "Juan Cuesta", "Belén López Vázquez", "Mauricio Hidalgo Torres", "Fernando Navarro Sánchez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2282   Expand Aquí no hay quien viva   (2003) User Score Overview Aquí no hay quien viva is a Spanish television comedy focusing on the inhabitants of the fictional building in Desengaño 21, Calle Desengaño being a street between the Districts of Gran Via and Chueca in Madrid. The episodes debuted on the Antena 3 network, and were later rerun by the same network as well as cable/satellite channels Neox and Paramount Comedy. Antena 3 Internacional satellite channel broadcasts the series to Latin America. The series debuted in 2003 and became popular thanks to its funny characters, witty script, and capacity to integrate and poke fun at contemporary issues; the program presents a caustic satire of many of the 'types' found in Spanish society. In 2006, Antena 3's rival Telecinco acquired a 15% share of Miramón Mendi, the company that produces the series. Miramón's contract with Antena 3 expired on June 2006 and was not renewed, bringing the series to an end, since the actors' contracts bind them to the production company and not to the network. Miramón Mendi then created a new series for Telecinco with most of the same actors and a similar setting, but with brand-new characters and storyline. La que se avecina débuted 22 April 2007. Featured Crew Laura Caballero Creator Alberto Caballero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fernando Tejero Emilio Delgado Martínez José Luis Gil Juan Cuesta Malena Alterio Belén López Vázquez Luis Merlo Mauricio Hidalgo Torres Adrià Collado Fernando Navarro Sánchez Full Cast & Crew Last Season Season 5 2006 | 13 Episodes Season 5 of Aquí no hay quien viva premiered on April  6, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2005-01-16 Aída 4.0    1999-01-17 7 vidas 5.9    2001-09-13 Cuéntame cómo pasó 6.6    2007-04-22 La Que Se Avecina 6.3    2003-04-22 Los Serrano 5.1    2008-02-04 Física o Química 3.0    1979-04-02 Doraemon 5.6    1992-04-13 Crayon Shin-chan 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage   http://www.antena3.com/neox/series/aqui-no-hay-quien-viva/ Genres Comedy Keywords neighbor new neighbor building noisy neighbor resident next door neighbor neighbor neighbor relationship Content Score 93 Almost there... Top Contributors 88 prm96 a 30 aballester N 5 NoemiTalavera 5 NEOhidra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}