{"link": "https://www.themoviedb.org/tv/69836?language=en", "title": "Filha da Lei", "resume": "Filha da Lei, a criminal series on a Chief Inspector, Isabel Garcia, and the investigation of the most important police case in Portugal in the last 20 years. Garcia is faced with the greatest challenge of her career when she is assigned to lead the Investigation of the violent serial murders that devastate the city. Samuel Lopes, Trainee Inspector with a degree in Criminal Psychology, joins the Garcia Brigade where he will have to earn his place and the respect of the most experienced inspectors. The interaction with the Trainee Inspector helps Garcia to better understand his daughter Sara, a 16-year-old teenager who was married to the implacable journalist Jaime.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Alda Baptista", "Bárbara Lourenço", "Joana Brandão", "Alfredo Brito", "Anabela Moreira"], "character": ["Sara", "Olívia", "Carmo", "Inácio Costa", "Inspetora Isabel Garcia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69836   Expand Filha da Lei   (2017) User Score Overview Filha da Lei, a criminal series on a Chief Inspector, Isabel Garcia, and the investigation of the most important police case in Portugal in the last 20 years. Garcia is faced with the greatest challenge of her career when she is assigned to lead the Investigation of the violent serial murders that devastate the city. Samuel Lopes, Trainee Inspector with a degree in Criminal Psychology, joins the Garcia Brigade where he will have to earn his place and the respect of the most experienced inspectors. The interaction with the Trainee Inspector helps Garcia to better understand his daughter Sara, a 16-year-old teenager who was married to the implacable journalist Jaime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alda Baptista Sara Bárbara Lourenço Olívia Joana Brandão Carmo Alfredo Brito Inácio Costa Anabela Moreira Inspetora Isabel Garcia Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Filha da Lei premiered on January 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Filha da Lei. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  45m Homepage   http://media.rtp.pt/filhadalei/ Genres Crime Drama Keywords police Content Score 86 Almost there... Top Contributors HS 43 Hugo S. 14 Banana 3 Blackspirits  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}