{"link": "https://www.themoviedb.org/tv/39644?language=en", "title": "Parade's End", "resume": "The story of a love triangle between a conservative English aristocrat, his mean socialite wife and a young suffragette in the midst of World War I and a Europe on the brink of profound change.", "rate": 67, "genre": ["Drama"], "cast": ["Benedict Cumberbatch", "Rebecca Hall", "Adelaide Clemens", "Miranda Richardson", "Roger Allam"], "character": ["Christopher Tietjens", "Sylvia Tietjens", "Valentine Wannop", "Mrs. Wannop", "General Campion"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39644   Expand Parade's End   (2012) User Score  Play Trailer Overview The story of a love triangle between a conservative English aristocrat, his mean socialite wife and a young suffragette in the midst of World War I and a Europe on the brink of profound change. Featured Crew Susanna White Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benedict Cumberbatch Christopher Tietjens Rebecca Hall Sylvia Tietjens Adelaide Clemens Valentine Wannop Miranda Richardson Mrs. Wannop Roger Allam General Campion Full Cast & Crew Last Season Season 1 2012 | 5 Episodes Season 1 of Parade's End premiered on August 24, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2003-06-29 Fortysomething 7.4    2012-09-25 The Paradise 6.8    2012-09-11 The New Normal 5.2    2017-06-04 I'm Dying Up Here 6.9    2015-11-04 Good Girls Revolt 7.8    2013-10-29 The Escape Artist 7.0    2016-03-03 The Family 6.3    2016-06-09 New Blood 6.5  Facts Status  Ended Networks Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b01m7rn8 Genres Drama Keywords war world war i miniseries period drama Content Score 100 Yes! Looking good! Top Contributors 12 Banana 10 lineker 9 Elizabeth Jennings A 4 Altaise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}