{"link": "https://www.themoviedb.org/tv/3233?language=en", "title": "De Mol", "resume": "The Mole is a reality television game show which was originally created in 1999 by Woestijnvis and broadcast on VRT in Belgium. It was conceived by Michiel Devlieger, Bart de Pauw, Tom Lenaerts and Michel Vanhove, and won the famous Rose d'Or in Montreux, Switzerland, in 2000. The format has been licensed in 40 countries from all around the world.\nPlayers in The Mole must work together to complete various physical and mental challenges to build up a significant cash prize for the winner. One of them, however, is \"the Mole\", a double agent hired by the producers to sabotage the efforts of the group. The Mole must be careful to avoid drawing too much suspicion to himself or herself. Using journals, players must track vast amounts of data about the person they suspect of being the Mole, such as seating positions, clothing colors, minor discussion topics, and so on. The quiz at the end of each episode tests players' knowledge of the Mole, and determines by lowest score who is eliminated from the game.", "rate": 23, "genre": ["Reality"], "cast": ["Gilles De Coster", "Bahador Sabouri", "Lloyd Vermeulen", "Pieter Delanoy", "Pascale Van Leeuwen"], "character": ["Presentator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3233   Expand De Mol User Score Overview The Mole is a reality television game show which was originally created in 1999 by Woestijnvis and broadcast on VRT in Belgium. It was conceived by Michiel Devlieger, Bart de Pauw, Tom Lenaerts and Michel Vanhove, and won the famous Rose d'Or in Montreux, Switzerland, in 2000. The format has been licensed in 40 countries from all around the world. Players in The Mole must work together to complete various physical and mental challenges to build up a significant cash prize for the winner. One of them, however, is \"the Mole\", a double agent hired by the producers to sabotage the efforts of the group. The Mole must be careful to avoid drawing too much suspicion to himself or herself. Using journals, players must track vast amounts of data about the person they suspect of being the Mole, such as seating positions, clothing colors, minor discussion topics, and so on. The quiz at the end of each episode tests players' knowledge of the Mole, and determines by lowest score who is eliminated from the game. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gilles De Coster Presentator Bahador Sabouri Lloyd Vermeulen Pieter Delanoy Pascale Van Leeuwen Full Cast & Crew Current Season Season 6 2018 | 6 Episodes Season 6 of De Mol premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Reality Original Language  Dutch; Flemish Runtime  - Homepage  - Genres Reality Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 18 Wouter d 13 daniquew95 m 5 mw1 2 niknetniko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}