{"link": "https://www.themoviedb.org/tv/66875?language=en", "title": "Non Non Biyori", "resume": "Hotaru Ichijo, a fifth grader from Tokyo, transfers into Asahigaoka Branch School, far out at the countryside, and has to adjust to her new environment with her new friends.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Rie Murakawa", "Kana Asumi", "Ayane Sakura", "Kotori Koiwai", "Rina Satou"], "character": ["Hotaru Ichijou", "Komari Koshigaya", "Natsumi Koshigaya", "Renge Miyauchi", "Kaede Kagayama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66875   Expand Non Non Biyori   (2013) User Score  Play Trailer Overview Hotaru Ichijo, a fifth grader from Tokyo, transfers into Asahigaoka Branch School, far out at the countryside, and has to adjust to her new environment with her new friends. Featured Crew Shinya Kawamo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Murakawa Hotaru Ichijou Kana Asumi Komari Koshigaya Ayane Sakura Natsumi Koshigaya Kotori Koiwai Renge Miyauchi Rina Satou Kaede Kagayama Full Cast & Crew Last Season Non Non Biyori Repeat 2015 | 12 Episodes Season 2 of Non Non Biyori premiered on July  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2014-07-06 Monthly Girls' Nozaki-kun 7.7    2012-04-22 Hyouka 8.3    2011-04-15 Anohana: The Flower We Saw That Day 7.6  Facts Original Name  のんのんびより Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://nonnontv.com/ Genres Animation Comedy Keywords country life slice of life japanese culture school based on manga anime Content Score 100 Yes! Looking good! Top Contributors 51 Sadwick 14 CrewMdk d 11 desert188 7 thriem  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}