{"link": "https://www.themoviedb.org/tv/13892?language=en", "title": "Sense and Sensibility", "resume": "Marianne Dashwood wears her heart on her sleeve when she falls in love with the charming but unsuitable John Willoughby, ignoring her sister Elinor's warning that her impulsive behavior leaves her open to gossip and innuendo. Elinor, sensitive to social convention, struggles to conceal her own romantic disappointment, even from those closest to her. Will the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love?", "rate": 77, "genre": ["Drama"], "cast": ["Hattie Morahan", "Charity Wakefield", "David Morrissey", "Mark Gatiss", "Janet McTeer"], "character": ["Elinor Dashwood", "Marianne Dashwood", "Colonel Brandon", "John Dashwood", "Mrs. Dashwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13892   Expand Sense and Sensibility   (2008) User Score Overview Marianne Dashwood wears her heart on her sleeve when she falls in love with the charming but unsuitable John Willoughby, ignoring her sister Elinor's warning that her impulsive behavior leaves her open to gossip and innuendo. Elinor, sensitive to social convention, struggles to conceal her own romantic disappointment, even from those closest to her. Will the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love? Featured Crew Andrew Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hattie Morahan Elinor Dashwood Charity Wakefield Marianne Dashwood David Morrissey Colonel Brandon Mark Gatiss John Dashwood Janet McTeer Mrs. Dashwood Full Cast & Crew Last Season Miniseries 2008 | 3 Episodes Season 1 of Sense and Sensibility premiered on January  1, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Sense and Sensibility. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2009-10-04 Emma 7.7    2008-09-03 Lost in Austen 7.2    2008-09-14 Tess of the D'Urbervilles 7.4    2008-10-26 Little Dorrit 7.7    2013-12-26 Death Comes to Pemberley 6.8    1996-11-17 The Tenant of Wildfell Hall 7.3    1999-11-28 Wives and Daughters 7.3    2004-11-14 North & South 8.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/drama/senseandsensibility/ Genres Drama Keywords based on novel or book miniseries period drama Content Score 93 Almost there... Top Contributors TB 33 TMDb Bot R 8 Rebecca 5 Steve k 4 kromlech  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}