{"link": "https://www.themoviedb.org/tv/16361?language=en", "title": "Huntik: Secrets & Seekers", "resume": "Huntik: Secrets & Seekers is an Italian/American animated television series, begun in 2009, created and directed by Iginio Straffi. It was a co-production between Big Bocca Productions, a company owned by Richard McWilliam, CEO and owner of Upper Deck and Rainbow S.p.A. It acts like one of the spin-offs to the Winx Club series. All of the show's designs, animation and visual style were created in Italy, while the scriptwriting and original voice recording were done in the United States. It aired on The CW4Kids at 11:30am Eastern Standard Time on Saturdays. In Europe, the series used to air on Disney XD, and on CITV. In India, the series' first season aired on Disney XD in 2010. The series premiered on January 3, 2009, with one episode in the US and the first four episodes in Europe, making Jetix the home for premieres beyond the first episode. It was revealed in a magazine with the new season of the Winx Club, that the second season of Huntik would air in fall 2012 in the US. However, the second season began airing in the spring of 2012 in UK on CITV & Australia on channel eleven. The first season was released on DVD by Anime Works in 2010.", "rate": 86, "genre": ["Sci-Fi", "Fantasy", "Animation"], "cast": ["Yuri Lowenthal", "Rebecca Soler", "Maddie Blaustein", "Mike Pollock", "Marc Thompson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16361   Expand Huntik: Secrets & Seekers   (2009) User Score Overview Huntik: Secrets & Seekers is an Italian/American animated television series, begun in 2009, created and directed by Iginio Straffi. It was a co-production between Big Bocca Productions, a company owned by Richard McWilliam, CEO and owner of Upper Deck and Rainbow S.p.A. It acts like one of the spin-offs to the Winx Club series. All of the show's designs, animation and visual style were created in Italy, while the scriptwriting and original voice recording were done in the United States. It aired on The CW4Kids at 11:30am Eastern Standard Time on Saturdays. In Europe, the series used to air on Disney XD, and on CITV. In India, the series' first season aired on Disney XD in 2010. The series premiered on January 3, 2009, with one episode in the US and the first four episodes in Europe, making Jetix the home for premieres beyond the first episode. It was revealed in a magazine with the new season of the Winx Club, that the second season of Huntik would air in fall 2012 in the US. However, the second season began airing in the spring of 2012 in UK on CITV & Australia on channel eleven. The first season was released on DVD by Anime Works in 2010. Featured Crew Iginio Straffi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuri Lowenthal Rebecca Soler Maddie Blaustein Mike Pollock Marc Thompson Full Cast & Crew Last Season Season 2 2012 | 26 Episodes Season 2 of Huntik: Secrets & Seekers premiered on April  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-12-24 Turbo FAST 4.7    2001-09-15 The Proud Family 5.9    2013-08-11 Marvel’s Hulk and the Agents of S.M.A.S.H 5.5    2004-01-28 Winx Club 4.7    2015-04-05 Blood Blockade Battlefront 7.7    2008-10-02 Black Butler 7.1    2010-01-08 Durarara!! 7.4    2005-01-21 American Dragon: Jake Long 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.huntik.com/ Genres Sci-Fi & Fantasy Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 Maikkoum 3 MichelD 2 IonutG 1 kuzronk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}