{"link": "https://www.themoviedb.org/tv/35335?language=en", "title": "The Jungle Book", "resume": "The Jungle Book is a 2010 3D CGI animated TV series.\nThis series is based on the original book by Rudyard Kipling.\nStarting in June 2012, the first season of the series will be seen in the U.S. on Disney XD.\nIt currently airs on TVO Kids in Canada.\nThe Jungle Book: TV Movie is announced to be premiere on Disney Channel Asia.", "rate": 55, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35335   Expand The Jungle Book   (2010) User Score Overview The Jungle Book is a 2010 3D CGI animated TV series. This series is based on the original book by Rudyard Kipling. Starting in June 2012, the first season of the series will be seen in the U.S. on Disney XD. It currently airs on TVO Kids in Canada. The Jungle Book: TV Movie is announced to be premiere on Disney Channel Asia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2013 | 52 Episodes Season 2 of The Jungle Book premiered on December 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Jungle Book. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  German Runtime  22m, 11m Homepage   http://www.zdf-enterprises.de/thejunglebook/ Genres Animation Keywords based on novel or book feral child jungle india wild Content Score 56 We're so close, yet so far. Top Contributors m 9 moviedbmailinator 8 Banana p 8 p681 S 5 SpikeNbg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}