{"link": "https://www.themoviedb.org/tv/61657?language=en", "title": "Bluegrass Underground", "resume": "A musical adventure series emanating from the Volcano Room, a subterranean amphitheater 333 feet below McMinnville, Tennessee at historic Cumberland Caverns. Celebrating the diversity of America's musical heritage with artists from the full spectrum of genres: Bluegrass, yes but also Americana, Country, Soul, Blues, Rock N Roll, Gospel, Folk, and everything between.", "rate": 100, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61657   Expand Bluegrass Underground   (2011) User Score Overview A musical adventure series emanating from the Volcano Room, a subterranean amphitheater 333 feet below McMinnville, Tennessee at historic Cumberland Caverns. Celebrating the diversity of America's musical heritage with artists from the full spectrum of genres: Bluegrass, yes but also Americana, Country, Soul, Blues, Rock N Roll, Gospel, Folk, and everything between. Featured Crew Todd Mayo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2017 | 12 Episodes Season 7 of Bluegrass Underground premiered on September  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bluegrass Underground. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Documentary Original Language  English Runtime  30m Homepage   http://www.pbs.org/show/bluegrass-underground/ Genres Documentary Keywords music folk music live concert americana bluegrass roots rock Content Score 64 We're so close, yet so far. Top Contributors 76 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}