{"link": "https://www.themoviedb.org/tv/13887?language=en", "title": "Lawman", "resume": "Lawman is an American western television series originally telecast on ABC from 1958 to 1962 starring John Russell as Marshal Dan Troop and featuring Peter Brown as Deputy Marshal Johnny McKay. The series was set in Laramie, Wyoming during 1879 and the 1880s. Warner Bros. already had several western series on the air at the time, having launched Cheyenne with Clint Walker as early as 1955. The studio continued the trend in 1957 with the additions of Maverick with James Garner and Jack Kelly, Colt .45 with Wayde Preston, and Sugarfoot with Will Hutchins. One year later, Warner Bros. added Lawman and Bronco with Ty Hardin.\nPrior to the beginning of production, Russell and Brown and producer Jules Schermer made a pact to maintain the quality of the series so that it would not be seen as \"just another western.\" At the start of season two, Russell and Brown were joined by Peggie Castle as Lily Merrill, the owner of the Birdcage Saloon, and a love interest for Dan.", "rate": 60, "genre": ["Western"], "cast": ["John Russell", "Peter Brown", "James Bell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13887   Expand Lawman   (1958) User Score Overview Lawman is an American western television series originally telecast on ABC from 1958 to 1962 starring John Russell as Marshal Dan Troop and featuring Peter Brown as Deputy Marshal Johnny McKay. The series was set in Laramie, Wyoming during 1879 and the 1880s. Warner Bros. already had several western series on the air at the time, having launched Cheyenne with Clint Walker as early as 1955. The studio continued the trend in 1957 with the additions of Maverick with James Garner and Jack Kelly, Colt .45 with Wayde Preston, and Sugarfoot with Will Hutchins. One year later, Warner Bros. added Lawman and Bronco with Ty Hardin. Prior to the beginning of production, Russell and Brown and producer Jules Schermer made a pact to maintain the quality of the series so that it would not be seen as \"just another western.\" At the start of season two, Russell and Brown were joined by Peggie Castle as Lily Merrill, the owner of the Birdcage Saloon, and a love interest for Dan. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Russell Peter Brown James Bell Full Cast & Crew Last Season Season 4 1961 | 41 Episodes Season 4 of Lawman premiered on September 17, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lawman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Western Keywords lawmen Content Score 43 There's no 'I' in team... Top Contributors 6 Steve j 4 j2k15 PE 3 Patrick E. Abe 3 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}