{"link": "https://www.themoviedb.org/tv/20861?language=en", "title": "Jazz", "resume": "Jazz is a ten part series that explores the evolution – and the genius – of America’s greatest original art form, focusing on the extraordinary men and women who could do something remarkable – create art on the spot. Jazz celebrates their profoundly enduring, endlessly varied, and infinitely alluring music in the context of the complicated country that gave birth to and influenced it, and was in turn transformed by it.", "rate": 66, "genre": ["Documentary"], "cast": ["Keith David"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20861   Expand Jazz   (2001) User Score Overview Jazz is a ten part series that explores the evolution – and the genius – of America’s greatest original art form, focusing on the extraordinary men and women who could do something remarkable – create art on the spot. Jazz celebrates their profoundly enduring, endlessly varied, and infinitely alluring music in the context of the complicated country that gave birth to and influenced it, and was in turn transformed by it. Featured Crew Ken Burns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith David Narrator Full Cast & Crew Last Season Miniseries 2001 | 10 Episodes Season 1 of Jazz premiered on January  9, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations   1990-09-23 The Civil War 8.9    1990-07-12 Northern Exposure 8.1    1985-02-24 The Boat 8.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.pbs.org/kenburns/jazz/home/ Genres Documentary Keywords jazz music jazz musician history Content Score 64 We're so close, yet so far. Top Contributors R 13 Rebecca TB 3 TMDb Bot m 2 marlonius 1 rpeters  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}