{"link": "https://www.themoviedb.org/tv/5256?language=en", "title": "The Mists of Avalon", "resume": "The Mists of Avalon is a 2001 miniseries based on the novel of the same name by Marion Zimmer Bradley. It was produced by American cable channel TNT and directed by Uli Edel.", "rate": 68, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Michael Vartan", "Samantha Mathis", "Anjelica Huston", "Clive Russell", "Caroline Goodall"], "character": ["Lancelot", "Gwenwyfar", "Vivianne", "Igraine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5256   Expand The Mists of Avalon   (2001) User Score  Play Trailer Overview The Mists of Avalon is a 2001 miniseries based on the novel of the same name by Marion Zimmer Bradley. It was produced by American cable channel TNT and directed by Uli Edel. Featured Crew Gavin Scott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Vartan Lancelot Samantha Mathis Gwenwyfar Anjelica Huston Vivianne Clive Russell Caroline Goodall Igraine Full Cast & Crew Last Season Season 1 2001 | 2 Episodes Season 1 of The Mists of Avalon premiered on July 15, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  11 Recommendations   2000-04-30 Arabian Nights 6.8    2002-09-18 Fastlane 4.7    2004-12-13 Legend of Earthsea 5.7    1995-10-27 Golden Boy 7.3    2009-01-25 The Last Templar 5.0    1998-04-26 Merlin 6.3    1999-04-03 The Lost World 7.4    2007-09-26 Bionic Woman 5.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  183m, 180m Homepage   http://alt.tnt.tv/movies/tntoriginals/mists/ Genres Sci-Fi & Fantasy Keywords based on novel or book miniseries morgana Content Score 100 Yes! Looking good! Top Contributors TB 67 TMDb Bot R 8 Rebecca P 6 PlexRowe s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}