{"link": "https://www.themoviedb.org/tv/2701?language=en", "title": "Napoleon", "resume": "The life of Napoleon Bonaparte.", "rate": 71, "genre": ["Drama", "War", "Politics"], "cast": ["Christian Clavier", "Isabella Rossellini", "Gérard Depardieu", "John Malkovich", "Anouk Aimée"], "character": ["Napoleone Bonaparte", "Joséphine de Beauharnais", "Joseph Fouché", "Charles Talleyrand", "Letizia Ramolino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2701   Expand Napoleon   (2002) User Score  Play Trailer Overview The life of Napoleon Bonaparte. Featured Crew Max Gallo Creator Yves Simoneau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Clavier Napoleone Bonaparte Isabella Rossellini Joséphine de Beauharnais Gérard Depardieu Joseph Fouché John Malkovich Charles Talleyrand Anouk Aimée Letizia Ramolino Full Cast & Crew Last Season Napoleon season 1 2002 | 4 Episodes Season 1 of Napoleon premiered on October  7, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Napoleon. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   2000-09-04 Les Misérables 7.0    1978-04-16 Holocaust 7.6    1998-09-07 The Count of Monte Cristo 7.2  Facts Status  Ended Network Certification 12 Meaning translation missing: en-US.certifications.tv_series.HU.4.meaning Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama War & Politics Keywords war history napoleonic wars napoleon bonaparte Content Score 100 Yes! Looking good! Top Contributors m 50 magico77 TB 24 TMDb Bot 19 Banana 6 alupan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}