{"link": "https://www.themoviedb.org/tv/25992?language=en", "title": "Masterchef Goes Large", "resume": "John Torode and Gregg Wallace are looking for the country's next star chef. Those who make it through to the quarter-final must prove their knowledge and passion for food. The heats have produced four exceptional cooks, but only one of them will make it through today to become a semi-finalist. Initially named Masterchef Goes Large, the series changed it's name to Masterchef in 2008.", "rate": 48, "genre": ["Reality"], "cast": ["John Torode", "Gregg Wallace"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25992   Expand Masterchef Goes Large   (2005) User Score  Play Trailer Overview John Torode and Gregg Wallace are looking for the country's next star chef. Those who make it through to the quarter-final must prove their knowledge and passion for food. The heats have produced four exceptional cooks, but only one of them will make it through today to become a semi-finalist. Initially named Masterchef Goes Large, the series changed it's name to Masterchef in 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Torode Gregg Wallace Full Cast & Crew Last Season Season 3 2007 | 33 Episodes Season 3 of Masterchef Goes Large premiered on January 22, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1983-09-22 Just Good Friends 6.4    1990-01-10 Oranges Are Not the Only Fruit 7.6    2005-02-16 The Apprentice 5.2    1984-02-26 Spitting Image 7.8    1987-03-09 French & Saunders 7.4    1998-09-04 Who Wants to Be a Millionaire? 6.1    1965-07-22 Till Death Us Do Part 7.2    1994-07-04 Room 101 5.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006t1k5 Genres Reality Keywords game show Content Score 64 We're so close, yet so far. Top Contributors - 6 -Alexander- R 2 Rebecca 1 Elizabeth Jennings 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}