{"link": "https://www.themoviedb.org/tv/733?language=en", "title": "Sabrina: The Animated Series", "resume": "Sabrina: The Animated Series is an American animated television series based on the Archie Comics character Sabrina, the Teenage Witch. It was produced by Savage Studios Ltd. and Hartbreak Films in association with DIC Entertainment, which was owned by Disney at the time. The cartoon series is a spin-off of the popular live action series that ran on ABC. Later, a movie, Sabrina: Friends Forever, and a spin-off series, Sabrina's Secret Life, were produced by DiC, this time without the ownership of Disney. Reruns currently air on the \"This Is for Kids\" block on the TV channel This.", "rate": 61, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy", "Family"], "cast": ["Chantal Strand", "Melissa Joan Hart", "Bill Switzer", "Jason Michas", "Cree Summer"], "character": ["Gem Stone", "Hilda Spellman", "Harvey Kinkle", "Slugloafe the School Bully", "Chloe Flan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 733   Expand Sabrina: The Animated Series   (1999) User Score Overview Sabrina: The Animated Series is an American animated television series based on the Archie Comics character Sabrina, the Teenage Witch. It was produced by Savage Studios Ltd. and Hartbreak Films in association with DIC Entertainment, which was owned by Disney at the time. The cartoon series is a spin-off of the popular live action series that ran on ABC. Later, a movie, Sabrina: Friends Forever, and a spin-off series, Sabrina's Secret Life, were produced by DiC, this time without the ownership of Disney. Reruns currently air on the \"This Is for Kids\" block on the TV channel This. Featured Crew Savage Steve Holland Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chantal Strand Gem Stone Melissa Joan Hart Hilda Spellman Bill Switzer Harvey Kinkle Jason Michas Slugloafe the School Bully Cree Summer Chloe Flan Full Cast & Crew Last Season Sabrina, the animated series season 1 1999 | 65 Episodes Season 1 of Sabrina: The Animated Series premiered on September  6, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1983-10-10 Alice in Wonderland 5.6    1999-11-28 Little Bill 3.6    2001-08-11 Cubix 4.3    1993-09-06 Adventures of Sonic the Hedgehog 4.9    2001-01-12 Lizzie McGuire 5.6    2001-06-02 Braceface 6.1    1996-09-02 Quack Pack 6.9    2002-12-06 Codename: Kids Next Door 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors B 6 BCEMovieDB P 5 Prototyp206 4 Banana a 3 adltata  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}