{"link": "https://www.themoviedb.org/tv/62717?language=en", "title": "Jonathan Strange & Mr Norrell", "resume": "With magic long since lost to England, two men are destined to bring it back; the reclusive Mr. Norrell and daring novice Jonathan Strange. So begins a dangerous battle between two great minds.", "rate": 79, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Bertie Carvel", "Eddie Marsan", "Marc Warren", "Charlotte Riley", "Alice Englert"], "character": ["Jonathan Strange", "Mr Norrell", "The Gentleman", "Arabella", "Lady Pole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62717   Expand Jonathan Strange & Mr Norrell   (2015) User Score  Play Trailer Overview With magic long since lost to England, two men are destined to bring it back; the reclusive Mr. Norrell and daring novice Jonathan Strange. So begins a dangerous battle between two great minds. Featured Crew Peter Harness Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bertie Carvel Jonathan Strange Eddie Marsan Mr Norrell Marc Warren The Gentleman Charlotte Riley Arabella Alice Englert Lady Pole Full Cast & Crew Last Season Season 1 2015 | 7 Episodes Season 1 of Jonathan Strange & Mr Norrell premiered on May 17, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2014-09-21 The Code 7.4    2015-03-16 Spotless 7.3    2006-10-10 Intelligence 8.3    2015-03-30  Fartsa 6.3    2008-03-10 The Fixer 7.6    2014-08-23 Intruders 6.5    2013-04-22 Rectify 7.6    2015-07-09 Glitch 6.6  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p02mrqzv Genres Drama Sci-Fi & Fantasy Keywords magic Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings CM 6 Cherche Moi j 5 jasenc w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}