{"link": "https://www.themoviedb.org/tv/3474?language=en", "title": "Danger Mouse", "resume": "Danger Mouse, the world's greatest secret agent, and his side-kick Penfold work to foil the evil schemes of Baron Greenback.", "rate": 77, "genre": ["Animation", "Comedy"], "cast": ["David Jason", "Edward Kelsey", "Terry Scott", "Brian Trueman", "Jimmy Hibbert"], "character": ["Danger Mouse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3474   Expand Danger Mouse   (1981) User Score  Play Trailer Overview Danger Mouse, the world's greatest secret agent, and his side-kick Penfold work to foil the evil schemes of Baron Greenback. Featured Crew Cosgrove Hall Films Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Jason Danger Mouse Edward Kelsey Terry Scott Brian Trueman Jimmy Hibbert Full Cast & Crew Last Season Danger mouse season 10 1992 | 7 Episodes Season 10 of Danger Mouse premiered on February  6, 1992. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply He's the greatest He's fantastic.. Open 0 by CaseyJones\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   1988-09-06 Count Duckula 6.9    2009-02-25 Burnistoun 7.8    1999-01-13 Chewin' the Fat 8.2    2011-07-04 Pointless Celebrities 7.5    A Question of Sport 6.5    1978-11-10 Butterflies 6.9    1994-11-04 Harry Enfield and Chums 7.8    2002-09-06 Bo' Selecta! 7.0  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords espionage secret agent parody british humour danger mouse Content Score 100 Yes! Looking good! Top Contributors V 19 Vivo O 8 Ozbourne 3 niqo19 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}