{"link": "https://www.themoviedb.org/tv/61422?language=en", "title": "The Fruit of Grisaia", "resume": "Mihama Academy—on the surface, a closed learning environment established to nurture students who find themselves at odds with the world around them; in actuality, an orchard-cum-prison built to preserve fruit that has fallen too far from its tree. Yet with the arrival of the institute's first male student, the nearly preposterously opaque Kazami Yuuji, the students at Mihama begin to fall out of step with their predetermined rhythms. Will Yuuji prove to be the element the girls around him needed to take hold of their lives once more, or will the weight of their pasts prove too steep a wall to overcome?", "rate": 77, "genre": ["Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61422   Expand The Fruit of Grisaia   (2014) User Score Overview Mihama Academy—on the surface, a closed learning environment established to nurture students who find themselves at odds with the world around them; in actuality, an orchard-cum-prison built to preserve fruit that has fallen too far from its tree. Yet with the arrival of the institute's first male student, the nearly preposterously opaque Kazami Yuuji, the students at Mihama begin to fall out of step with their predetermined rhythms. Will Yuuji prove to be the element the girls around him needed to take hold of their lives once more, or will the weight of their pasts prove too steep a wall to overcome? Featured Crew Tanaka Motoki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season The Fruit of Grisaia 2014 | 13 Episodes Season 1 of The Fruit of Grisaia premiered on October  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2017-07-01 Kakegurui 7.2    2012-10-04 BTOOOM! 6.3    2013-07-08 Blood Lad 6.8    2015-04-05 Plastic Memories 6.8    2012-07-06 Aesthetica of a Rogue Hero 7.1    2014-07-06 Akame ga Kill! 7.0  Facts Original Name  グリザイアの果実 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.grisaia-anime.com Genres Animation Drama Keywords harem anime based on visual novel based on eroge Content Score 71 Just a little bit more... Top Contributors 19 sp1ti S 19 SuperTouch 18 Elizabeth Jennings 13 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}