{"link": "https://www.themoviedb.org/tv/6445?language=en", "title": "Cosby", "resume": "Cosby is an American situation comedy television series broadcast on CBS from September 16, 1996 to April 28, 2000, loosely based on the British sitcom One Foot in the Grave. The program stars Bill Cosby and Phylicia Rashād, who previously worked with Cosby in the 1984–1992 NBC sitcom The Cosby Show. Madeline Kahn portrayed their neighbor, Pauline, until her death in 1999.", "rate": 64, "genre": ["Comedy"], "cast": ["Bill Cosby", "Doug E. Doug", "T'Keyah Crystal Keymáh", "Phylicia Rashād", "Madeline Kahn"], "character": ["Ruth Lucas", "Pauline Fox"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6445   Expand Cosby   (1996) User Score Overview Cosby is an American situation comedy television series broadcast on CBS from September 16, 1996 to April 28, 2000, loosely based on the British sitcom One Foot in the Grave. The program stars Bill Cosby and Phylicia Rashād, who previously worked with Cosby in the 1984–1992 NBC sitcom The Cosby Show. Madeline Kahn portrayed their neighbor, Pauline, until her death in 1999. Featured Crew Bill Cosby Creator David Renwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Cosby Doug E. Doug T'Keyah Crystal Keymáh Phylicia Rashād Ruth Lucas Madeline Kahn Pauline Fox Full Cast & Crew Last Season Season 4 1999 | 21 Episodes Season 4 of Cosby premiered on September 29, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1980-11-11 Too Close for Comfort 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords retirement remake black family elderly sitcom black sitcom Content Score 93 Almost there... Top Contributors 19 Banana s 3 speedycars O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}