{"link": "https://www.themoviedb.org/tv/73375?language=en", "title": "Tom Clancy's Jack Ryan", "resume": "When CIA analyst Jack Ryan stumbles upon a suspicious series of bank transfers his search for answers pulls him from the safety of his desk job and catapults him into a deadly game of cat and mouse throughout Europe and the Middle East, with a rising terrorist figurehead preparing for a massive attack against the US and her allies.", "rate": 0, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["John Krasinski", "Abbie Cornish", "Wendell Pierce"], "character": ["Jack Ryan", "Cathy Mueller", "James Greer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73375   Expand Tom Clancy's Jack Ryan   (2018) User Score  Play Trailer Overview When CIA analyst Jack Ryan stumbles upon a suspicious series of bank transfers his search for answers pulls him from the safety of his desk job and catapults him into a deadly game of cat and mouse throughout Europe and the Middle East, with a rising terrorist figurehead preparing for a massive attack against the US and her allies. Featured Crew Graham Roland Creator Carlton Cuse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Krasinski Jack Ryan Abbie Cornish Cathy Mueller Wendell Pierce James Greer Full Cast & Crew Next Season Season 1 2018 | 1 Episode Season 1 of Tom Clancy's Jack Ryan is set to premiere on August 31, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  3 Posters  2 Facts Status  In Production Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://www.amazon.com/dp/B073RQ7KP4 Genres Action & Adventure Drama War & Politics Keywords cia thriller Content Score 71 Just a little bit more... Top Contributors 117 Ibuddy66 41 Elizabeth Jennings j 4 jd1048576 3 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}