{"link": "https://www.themoviedb.org/tv/4550?language=en", "title": "7th Heaven", "resume": "7th Heaven is an American family drama television series, created and produced by Brenda Hampton. The series premiered on August 26, 1996, on The WB, the first time that the network aired Monday night programming, and was originally broadcast from August 26, 1996 to May 13, 2007. The series finale was scheduled for May 8, 2006; however, the show was renewed by The CW when the intended final episode received high ratings. The final season premiered on Monday, September 25, 2006 and ended on May 13, 2007.\n7th Heaven is the longest-running series that has ever aired on The WB and is the longest-running family drama in television history. It is also the longest-running show produced by Aaron Spelling.\nDan Foliart composed the theme song \"7th Heaven\", which is performed by Steve Plunkett in the introduction of each episode.", "rate": 52, "genre": ["Family", "Drama"], "cast": ["Beverley Mitchell", "Stephen Collins", "Catherine Hicks", "Mackenzie Rosman", "David Gallagher"], "character": ["Lucy Camden", "Eric Camden", "Annie Camden", "Ruthie Camden", "Simon Camden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4550   Expand 7th Heaven   (1996) User Score Overview 7th Heaven is an American family drama television series, created and produced by Brenda Hampton. The series premiered on August 26, 1996, on The WB, the first time that the network aired Monday night programming, and was originally broadcast from August 26, 1996 to May 13, 2007. The series finale was scheduled for May 8, 2006; however, the show was renewed by The CW when the intended final episode received high ratings. The final season premiered on Monday, September 25, 2006 and ended on May 13, 2007. 7th Heaven is the longest-running series that has ever aired on The WB and is the longest-running family drama in television history. It is also the longest-running show produced by Aaron Spelling. Dan Foliart composed the theme song \"7th Heaven\", which is performed by Steve Plunkett in the introduction of each episode. Featured Crew Brenda Hampton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  18 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Beverley Mitchell Lucy Camden Stephen Collins Eric Camden Catherine Hicks Annie Camden Mackenzie Rosman Ruthie Camden David Gallagher Simon Camden Full Cast & Crew Last Season Season 11 2006 | 22 Episodes View All Seasons Social Reviews  0 Discussions  19 Subject Status Replies Last Reply w Lucy: Happy Birthday Beverley Mitchell! Open 0 by wonder2wonder\n      \n     S The Camdens taking everyone on a road trip as the finale Open 0 by Strannger18\n      \n     S Rose Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1987-09-22 Full House 5.9    1992-07-08 Melrose Place 4.9    1991-09-17 Home Improvement 7.0    1997-09-08 Ally McBeal 5.9    1992-09-23 Mad About You 6.0    2001-10-05 Reba 5.7    1994-09-21 Touched by an Angel 5.3    1996-09-27 Sabrina, the Teenage Witch 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage   http://www.7thheavenhaven.com/ Genres Family Drama Keywords big family religion family drama Content Score 93 Almost there... Top Contributors 13 waaw a 11 asusar 10 Blackskyliner 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}