{"link": "https://www.themoviedb.org/tv/71074?language=en", "title": "The President Show", "resume": "President Trump is bypassing the crooked media by hosting a late-night show direct from the Oval Office. No unfair questions from reporters, no awkward photo ops with German ladies, and no bedtimes. The weekly series will have the best guests, the “hottest women,” and only the nicest of questions.", "rate": 61, "genre": ["Comedy"], "cast": ["Anthony Atamanuik", "Peter Grosz"], "character": ["Donald J. Trump", "Mike Pence"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71074   Expand The President Show   (2017) User Score  Play Trailer Overview President Trump is bypassing the crooked media by hosting a late-night show direct from the Oval Office. No unfair questions from reporters, no awkward photo ops with German ladies, and no bedtimes. The weekly series will have the best guests, the “hottest women,” and only the nicest of questions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Atamanuik Donald J. Trump Peter Grosz Mike Pence Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of The President Show premiered on April 27, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Spot On Impression! Open 2 by  fonzie Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The President Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/the-president-show Genres Comedy Keywords usa president political satire Content Score 64 We're so close, yet so far. Top Contributors 47 Elizabeth Jennings 6 Marco 4 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}