{"link": "https://www.themoviedb.org/tv/34663?language=en", "title": "Zenki", "resume": "Zenki is a Japanese manga series written by Kikuhide Tani and illustrated by Yoshihiro Kuroiwa. It was serealized in the Shueisha publication, Monthly Shōnen Jump from 1992 to 1996. Zenki was adapted into a fifty-one episode anime television series in 1995 by Studio Deen and also spawned five video games. Enoki Films handles the English language version of the anime.", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy", "Action", "Adventure"], "cast": ["Chisa Yokoyama", "Jūrōta Kosugi", "Kappei Yamaguchi", "Eiji Maruyama", "Keiichi Nanba"], "character": ["Chiaki Enno", "Zenki", "Zenki", "Bonze Jukai", "Gulen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34663   Expand Zenki   (1995) User Score Overview Zenki is a Japanese manga series written by Kikuhide Tani and illustrated by Yoshihiro Kuroiwa. It was serealized in the Shueisha publication, Monthly Shōnen Jump from 1992 to 1996. Zenki was adapted into a fifty-one episode anime television series in 1995 by Studio Deen and also spawned five video games. Enoki Films handles the English language version of the anime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chisa Yokoyama Chiaki Enno Jūrōta Kosugi Zenki Kappei Yamaguchi Zenki Eiji Maruyama Bonze Jukai Keiichi Nanba Gulen Full Cast & Crew Last Season Season 1 1995 | 51 Episodes Season 1 of Zenki premiered on January  9, 1995. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Zenki. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Zenki. You can help by rating TV shows you've seen. Facts Original Name  鬼神童子 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 9 BrerFox R 6 Rebecca p 3 pepitopajas 3 enams90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}