{"link": "https://www.themoviedb.org/tv/13023?language=en", "title": "El Chapulín Colorado", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 83, "genre": ["Comedy", "Family", "Mystery", "Crime"], "cast": ["Roberto Gómez Bolaños", "Ramón Valdés", "Carlos Villagrán", "María Antonieta de las Nieves", "Édgar Vivar"], "character": ["Chapolin, Chaves", "Sr.Madruga, Tripa Seca, Conde Terra Nova, Lobisomem; Alma Negra etc.", "Kiko, Fura Tripas, Quase Nada, Riacho Molhado", "Chiquinha / Dona Neves", "Sr. Barriga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13023   Expand El Chapulín Colorado   (1972) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Roberto Gómez Bolaños Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roberto Gómez Bolaños Chapolin, Chaves Ramón Valdés Sr.Madruga, Tripa Seca, Conde Terra Nova, Lobisomem; Alma Negra etc. Carlos Villagrán Kiko, Fura Tripas, Quase Nada, Riacho Molhado María Antonieta de las Nieves Chiquinha / Dona Neves Édgar Vivar Sr. Barriga Full Cast & Crew Last Season Season 1 1972 | 39 Episodes Season 1 of El Chapulín Colorado premiered on April 11, 1972. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Episódios Open 0 by wdrp88\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1972-04-09 El Chavo del Ocho 8.5    2006-10-21 El Chavo: The Animated Series 5.3    1989-01-19 Carrusel 7.2    1961-01-30 The Yogi Bear Show 6.8    1959-09-29 The Quick Draw McGraw Show 6.7    1964-09-19 The Famous Adventures of Mr. Magoo 7.0    2003-08-23 Duck Dodgers 7.4    2003-08-01 My Life as a Teenage Robot 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  22m Homepage  - Genres Comedy Family Mystery Crime Keywords superhero parody Content Score 86 Almost there... Top Contributors w 28 wdrp88 10 Marr 🇳🇱 6 Jaime Neto e 4 eriick_munhoz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}