{"link": "https://www.themoviedb.org/tv/73132?language=en", "title": "Wet Hot American Summer: 10 Years Later", "resume": "A decade after their wild summer as junior counselors, the gang reunites for a weekend of bonding, hanky-panky and hair-raising adventures.", "rate": 67, "genre": ["Comedy"], "cast": ["Amy Poehler", "Elizabeth Banks", "Lake Bell", "H. Jon Benjamin", "Michael Ian Black"], "character": ["Susie", "Lindsay", "Donna", "Can of Vegetables (voice)", "McKinley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73132   Expand Wet Hot American Summer: 10 Years Later   (2017) User Score Overview A decade after their wild summer as junior counselors, the gang reunites for a weekend of bonding, hanky-panky and hair-raising adventures. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amy Poehler Susie Elizabeth Banks Lindsay Lake Bell Donna H. Jon Benjamin Can of Vegetables (voice) Michael Ian Black McKinley Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Wet Hot American Summer: 10 Years Later premiered on August  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2015-07-31 Wet Hot American Summer: First Day of Camp 6.4    2015-01-22 Backstrom 6.4    2014-09-26 Transparent 6.7    2017-06-30 Gypsy 6.0    2017-09-15 American Vandal 7.8    2017-05-19 The Keepers 7.6    2015-11-06 Master of None 8.0    2011-04-06 Workaholics 6.9  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  28m Homepage   https://www.netflix.com/title/80117800 Genres Comedy Keywords summer camp spoof miniseries Content Score 86 Almost there... Top Contributors TB 69 TMDb Bot 15 dariorufi 15 Elizabeth Jennings b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}