{"link": "https://www.themoviedb.org/tv/6673?language=en", "title": "The Marvelous Misadventures of Flapjack", "resume": "The Marvelous Misadventures of Flapjack is an American animated television series created by Thurop Van Orman for Cartoon Network that premiered on June 5, 2008, and ended on August 30, 2010. On April 20, 2012, this series returned to Cartoon Network to show re-runs on the revived block, \"Cartoon Planet\".", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Comedy", "Animation"], "cast": ["Roz Ryan", "Kevin Michael Richardson", "Richard McGonagle", "Jeff Bennett", "Brian Doyle-Murray"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6673   Expand The Marvelous Misadventures of Flapjack   (2008) User Score Overview The Marvelous Misadventures of Flapjack is an American animated television series created by Thurop Van Orman for Cartoon Network that premiered on June 5, 2008, and ended on August 30, 2010. On April 20, 2012, this series returned to Cartoon Network to show re-runs on the revived block, \"Cartoon Planet\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roz Ryan Kevin Michael Richardson Richard McGonagle Jeff Bennett Brian Doyle-Murray Full Cast & Crew Last Season Season 3 2010 | 12 Episodes Season 3 of The Marvelous Misadventures of Flapjack premiered on July  4, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Marvelous Misadventures of Flapjack. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2007-11-16 Chowder 6.5    2005-07-08 Camp Lazlo 5.6    2005-12-26 My Gym Partner's a Monkey 5.0    2004-08-13 Foster's Home for Imaginary Friends 6.8    2003-08-01 My Life as a Teenage Robot 6.1    2007-07-08 Total Drama Island 6.2    2004-11-19 Hi Hi Puffy AmiYumi 4.0    2005-09-17 Johnny Test 4.2  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cartoonnetwork.com/tv_shows/flapjack/index.html Genres Sci-Fi & Fantasy Comedy Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors r 8 rinaldovianna 5 CrewMdk 3 Banana l 3 lyuikov  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}