{"link": "https://www.themoviedb.org/tv/2739?language=en", "title": "Samantha Who?", "resume": "Samantha Newly has been a bad, bad girl. But thanks to an 8-day coma, she can't remember a thing. Fortunately her best friend Andrea is by her side with a cocktail and the 4-1-1 on every dirty deed. But the more Sam pieces together her past, the less she likes her old self. Maybe this is a chance to start over and do it all again.", "rate": 66, "genre": ["Comedy"], "cast": ["Christina Applegate", "Jennifer Esposito", "Kevin Dunn", "Melissa McCarthy", "Tim Russ"], "character": ["Samantha Newly", "Andrea Belladonna", "Howard", "Dena", "Frank"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2739   Expand Samantha Who?   (2007) User Score Overview Samantha Newly has been a bad, bad girl. But thanks to an 8-day coma, she can't remember a thing. Fortunately her best friend Andrea is by her side with a cocktail and the 4-1-1 on every dirty deed. But the more Sam pieces together her past, the less she likes her old self. Maybe this is a chance to start over and do it all again. Featured Crew Donald Todd Creator Cecelia Ahern Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Applegate Samantha Newly Jennifer Esposito Andrea Belladonna Kevin Dunn Howard Melissa McCarthy Dena Tim Russ Frank Full Cast & Crew Last Season Season 2 2008 | 20 Episodes Season 2 of Samantha Who? premiered on October 13, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  3 Recommendations   2010-03-14 Sons of Tucson 7.0    2010-06-28 Huge 5.5    2011-06-15 Happily Divorced 5.7    2013-09-23 Trophy Wife 5.7    2012-06-11 Bunheads 6.4    2011-09-22 Prime Suspect 7.1    2014-03-31 Friends with Better Lives 5.4    2010-09-22 The Defenders 7.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  25m, 30m, 22m Homepage   http://abc.go.com/primetime/samanthawho/index Genres Comedy Keywords memory loss good deed Content Score 93 Almost there... Top Contributors 10 Banana b 5 bugfix 3 MacFly 🇫🇷 3 Евгений  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}