{"link": "https://www.themoviedb.org/tv/35351?language=en", "title": "Smile Dong Hae", "resume": "Raised in America by his mentally handicapped mother Anna, Dong Hae (Ji Chang Wook) dreams of traveling to Korea to propose to the woman he loves.. After qualifying for a speed skating competition, he smuggles his mother to Korea with him, but his undying devotion to her soon begins causing him problems. Finally reconnecting with his lost love Saewa, Dong Hae finds his affections divided when things don’t work out as he planned in this award-winning daily drama.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Ji Chang-wook", "Do Ji-won", "Lee Ju-yeon", "Park Hae Mi", "Lee Bo-hee"], "character": ["Carl Laker / Dong-hae", "Anna Laker / Jo Dong-baek", "Yoon Sae-young", "Byun Sool-nyeo", "Gye Sun-ok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35351   Expand Smile Dong Hae   (2010) User Score Overview Raised in America by his mentally handicapped mother Anna, Dong Hae (Ji Chang Wook) dreams of traveling to Korea to propose to the woman he loves.. After qualifying for a speed skating competition, he smuggles his mother to Korea with him, but his undying devotion to her soon begins causing him problems. Finally reconnecting with his lost love Saewa, Dong Hae finds his affections divided when things don’t work out as he planned in this award-winning daily drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Chang-wook Carl Laker / Dong-hae Do Ji-won Anna Laker / Jo Dong-baek Lee Ju-yeon Yoon Sae-young Park Hae Mi Byun Sool-nyeo Lee Bo-hee Gye Sun-ok Full Cast & Crew Last Season Season 1 2010 | 159 Episodes Season 1 of Smile Dong Hae premiered on October  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Smile Dong Hae. You can help by rating TV shows you've seen. Facts Original Name  웃어라 동해야 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/donghae/ Genres Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 23 Maria180493 t 3 tmdb38202327 TB 1 TMDb Bot R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}