{"link": "https://www.themoviedb.org/tv/5340?language=en", "title": "Tak and the Power of Juju", "resume": "Tak and the Power of Juju is an all CGI-based animated series that premiered on Nickelodeon on August 31, 2007 and on Nicktoons on September 1, 2007. It has been showing on Nicktoons in the United Kingdom since 5 July 2008. Based on the video game of the same name, the show consists of two eleven minute stories per half hour episode. It is Nickelodeon's first all-CGI series and the company's 30th Nicktoons. The series was produced by Nick Jennings and directed, among others, by Mark Risley, Jim Schumann, and Heiko Drengenberg. The show struggled to gain an audience, received many negative reviews and ended up being cancelled in November 2008 after only 26 episodes.", "rate": 60, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Maurice LaMarche", "Kari Wahlgren", "Patrick Warburton", "John DiMaggio", "Hal Sparks"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5340   Expand Tak and the Power of Juju   (2007) User Score Overview Tak and the Power of Juju is an all CGI-based animated series that premiered on Nickelodeon on August 31, 2007 and on Nicktoons on September 1, 2007. It has been showing on Nicktoons in the United Kingdom since 5 July 2008. Based on the video game of the same name, the show consists of two eleven minute stories per half hour episode. It is Nickelodeon's first all-CGI series and the company's 30th Nicktoons. The series was produced by Nick Jennings and directed, among others, by Mark Risley, Jim Schumann, and Heiko Drengenberg. The show struggled to gain an audience, received many negative reviews and ended up being cancelled in November 2008 after only 26 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maurice LaMarche Kari Wahlgren Patrick Warburton John DiMaggio Hal Sparks Full Cast & Crew Last Season Season 1 — | 25 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Tak and the Power of Juju. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  21m, 30m Homepage   http://www.nick.com/all_nick/shows/tak Genres Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 Maikkoum s 3 speedycars 2 kuzronk A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}