{"link": "https://www.themoviedb.org/tv/6809?language=en", "title": "El hormiguero", "resume": "El Hormiguero is a Spanish television program with a live audience focusing on comedy, science, and politics running since September 2006. It is hosted and produced by screenwriter Pablo Motos. The show aired on Spain's Cuatro channel from launch until June 2011 and is now broadcast on Antena 3. Recurring guests on the show include Luis Piedrahita, Raquel Martos, Marron & \"The Man in Black\", and puppet ants Trancas and Barrancas. It has proved a ratings success, and has expanded from a weekly 120-minute show to a daily 40-minute show in its third season, which began on September 17, 2007. The show won the Entertainment prize at the 2009 Rose d'Or ceremony.", "rate": 54, "genre": ["Comedy"], "cast": ["Juan Ibáñez Pérez", "Damián Mollá", "Jorge Marrón", "Jandro López", "Dani Rovira"], "character": ["Trancas, colaborador", "Barrancas, colaborador", "Marron, colaborador", "Jandro, colaborador", "Colaborador"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6809   Expand El hormiguero   (2006) User Score Overview El Hormiguero is a Spanish television program with a live audience focusing on comedy, science, and politics running since September 2006. It is hosted and produced by screenwriter Pablo Motos. The show aired on Spain's Cuatro channel from launch until June 2011 and is now broadcast on Antena 3. Recurring guests on the show include Luis Piedrahita, Raquel Martos, Marron & \"The Man in Black\", and puppet ants Trancas and Barrancas. It has proved a ratings success, and has expanded from a weekly 120-minute show to a daily 40-minute show in its third season, which began on September 17, 2007. The show won the Entertainment prize at the 2009 Rose d'Or ceremony. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Juan Ibáñez Pérez Trancas, colaborador Damián Mollá Barrancas, colaborador Jorge Marrón Marron, colaborador Jandro López Jandro, colaborador Dani Rovira Colaborador Full Cast & Crew Last Season Season 9 2014 | 162 Episodes Season 9 of El hormiguero premiered on September  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on El hormiguero. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Talk Show Original Language  Spanish; Castilian Runtime  120m, 50m Homepage   http://cuatro.com/elhormiguero Genres Comedy Keywords talk show humor interview based on interviews Content Score 86 Almost there... Top Contributors 73 prm96 z 15 zurman1 9 Dancor 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}