{"link": "https://www.themoviedb.org/tv/36062?language=en", "title": "Best Friends", "resume": "Best Friends follows the life of a group of friends at their high school ‘Spangalis College’. Inside and outside of school exciting and challenging experiences take place. Growing up is never easy; every character has its own, unique story of love, friendship, loneliness, sorrow, discovery. There is drama and joy in school, family, teachers, parents, divorce, bullying, and always dreams for the future.", "rate": 80, "genre": ["Comedy", "Drama", "Soap"], "cast": ["Hassan Slaby", "Bruno Prent", "Iris Amber Stenger", "Tobias Oelderik", "Joe Sinduhije"], "character": ["Eman Loukili", "Dylan King", "Caro Out", "Otis Marchand", "Jip Baltus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36062   Expand Best Friends   (2007) User Score Overview Best Friends follows the life of a group of friends at their high school ‘Spangalis College’. Inside and outside of school exciting and challenging experiences take place. Growing up is never easy; every character has its own, unique story of love, friendship, loneliness, sorrow, discovery. There is drama and joy in school, family, teachers, parents, divorce, bullying, and always dreams for the future. Featured Crew Anya Koek Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hassan Slaby Eman Loukili Bruno Prent Dylan King Iris Amber Stenger Caro Out Tobias Oelderik Otis Marchand Joe Sinduhije Jip Baltus Full Cast & Crew Last Season Season 11 2017 | 100 Episodes Season 11 of Best Friends premiered on September  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Best Friends. You can help by rating TV shows you've seen. Facts Original Name  SpangaS Status  Returning Series Networks Certification AL Meaning Not harmful / All Ages. Type  Scripted Original Language  Dutch; Flemish Runtime  12m, 20m Homepage   http://spangas.ncrv.nl Genres Comedy Drama Soap Keywords high school teenager high school friends Content Score 93 Almost there... Top Contributors 164 Marr 🇳🇱 7 30 7Bee-NL 2 Elizabeth Jennings J 1 Jordi0686  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}