{"link": "https://www.themoviedb.org/tv/18109?language=en", "title": "Melrose Place", "resume": "In an elegant Spanish-style apartment building in the trendy Melrose neighborhood of Los Angeles, a diverse group of 20-somethings have formed a close-knit surrogate family. However, when a bloody body is found floating in the courtyard pool, the police soon discover that almost everyone had a reason to want the deceased out of the way.", "rate": 37, "genre": ["Drama"], "cast": ["Katie Cassidy", "Ashlee Simpson", "Jessica Lucas", "Stephanie Jacobsen", "Michael Rady"], "character": ["Eleanor 'Ella' Simms", "Violet Foster", "Riley Richmond", "Lauren Yung", "Jonah Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18109   Expand Melrose Place   (2009) User Score Overview In an elegant Spanish-style apartment building in the trendy Melrose neighborhood of Los Angeles, a diverse group of 20-somethings have formed a close-knit surrogate family. However, when a bloody body is found floating in the courtyard pool, the police soon discover that almost everyone had a reason to want the deceased out of the way. Featured Crew Darren Star Creator Todd Slavkin Creator Darren Swimmer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katie Cassidy Eleanor 'Ella' Simms Ashlee Simpson Violet Foster Jessica Lucas Riley Richmond Stephanie Jacobsen Lauren Yung Michael Rady Jonah Miller Full Cast & Crew Last Season Season 1 2009 | 18 Episodes Season 1 of Melrose Place premiered on September  8, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Melrose Place. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  41m Homepage   http://www.cwtv.com/shows/melrose-place Genres Drama Keywords california neighbor beverly hills twenty something young adult Content Score 93 Almost there... Top Contributors 14 Banana 9 Atanas b 5 bBop87 b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}