{"link": "https://www.themoviedb.org/tv/13908?language=en", "title": "The Rat Patrol", "resume": "The exploits of four Allied soldiers — three Americans and one Englishman — who are part of a long-range desert patrol group in the North African campaign during World War II. Their mission: \"to attack, harass and wreak havoc on Field Marshal Rommel's vaunted Afrika Korps\".", "rate": 80, "genre": ["Action", "Adventure", "War", "Politics"], "cast": ["Eric Braeden", "Christopher George", "Gary Raymond", "Larry Casey", "Justin Tarr"], "character": ["Sam Troy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13908   Expand The Rat Patrol   (1966) User Score  Play Trailer Overview The exploits of four Allied soldiers — three Americans and one Englishman — who are part of a long-range desert patrol group in the North African campaign during World War II. Their mission: \"to attack, harass and wreak havoc on Field Marshal Rommel's vaunted Afrika Korps\". Featured Crew Tom Gries Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Eric Braeden Christopher George Sam Troy Gary Raymond Larry Casey Justin Tarr Full Cast & Crew Last Season Season 2 1967 | 26 Episodes Season 2 of The Rat Patrol premiered on September 11, 1967. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of my all time favorite shows Open 0 by Taylorfirst1\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  2 Recommendations   1978-11-27 The White Shadow 7.5    1968-09-24 The Mod Squad 6.3    1977-05-07 Quark 6.5    1966-09-12 Family Affair 5.4    1968-09-28 The Ghost & Mrs. Muir 6.7    1949-09-15 The Lone Ranger 5.4    1958-09-22 Peter Gunn 8.3    1965-09-14 F Troop 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure War & Politics Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 13 Elizabeth Jennings 6 Mitsarinho TB 2 TMDb Bot 2 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}