{"link": "https://www.themoviedb.org/tv/4943?language=en", "title": "La Petite Vie", "resume": "La petite vie was first a stage sketch of the comedy duo Ding et Dong, formed by Claude Meunier and Serge Thériault, and later a hit Quebec television sitcom aired by Radio-Canada from 1993 to 1999. In total, 59 episodes were created plus 3 specials, two for Christmas and one for New Year's 2000.\nIt is to date the only Canadian TV show to ever gather more than 4 million viewers, a performance it achieved twice in 1995.", "rate": 70, "genre": ["Comedy"], "cast": ["Marc Labrèche", "Marc Messier", "Michel Côté", "Serge Thériault", "Diane Lavallée"], "character": ["Rénald Paré", "Réjean Pinard", "Jean-Louis 'Jean-Lou' Pichette", "Jacquelyne 'Moman' Paré", "Thérèse Paré"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4943   Expand La Petite Vie User Score Overview La petite vie was first a stage sketch of the comedy duo Ding et Dong, formed by Claude Meunier and Serge Thériault, and later a hit Quebec television sitcom aired by Radio-Canada from 1993 to 1999. In total, 59 episodes were created plus 3 specials, two for Christmas and one for New Year's 2000. It is to date the only Canadian TV show to ever gather more than 4 million viewers, a performance it achieved twice in 1995. Featured Crew Claude Meunier Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Labrèche Rénald Paré Marc Messier Réjean Pinard Michel Côté Jean-Louis 'Jean-Lou' Pichette Serge Thériault Jacquelyne 'Moman' Paré Diane Lavallée Thérèse Paré Full Cast & Crew Last Season Season 5 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  23m Homepage  - Genres Comedy Keywords quebec satire family Content Score 86 Almost there... Top Contributors 23 Banana M 1 MarioCine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}