{"link": "https://www.themoviedb.org/tv/34708?language=en", "title": "Genshiken", "resume": "Sasahara Kanji is a college freshman who decides to join a student society to share his hidden thoughts on manga, anime and gaming. As he participates in club activities such as visiting dojin shops and anime festivals he opens his mind and resolves that he will make his way into the otaku world.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Satsuki Yukino", "Takanori Ooyama", "Mitsuki Saiga", "Ayako Kawasumi", "Kaori Shimizu"], "character": ["Saki Kasukabe", "Kanji Sasahara", "Makoto Kosaka", "Kanako Ohno", "Keiko Sasahara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34708   Expand Genshiken   (2004) User Score Overview Sasahara Kanji is a college freshman who decides to join a student society to share his hidden thoughts on manga, anime and gaming. As he participates in club activities such as visiting dojin shops and anime festivals he opens his mind and resolves that he will make his way into the otaku world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satsuki Yukino Saki Kasukabe Takanori Ooyama Kanji Sasahara Mitsuki Saiga Makoto Kosaka Ayako Kawasumi Kanako Ohno Kaori Shimizu Keiko Sasahara Full Cast & Crew Last Season Genshiken: Second Generation 2013 | 13 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Genshiken. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Genshiken. You can help by rating TV shows you've seen. Facts Original Name  げんしけん Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://genshiken-2daime.com/ Genres Animation Comedy Keywords fan based on manga doujinshi anime monthly afternoon Content Score 86 Almost there... Top Contributors 27 Matthew Sanders 11 sp1ti 6 SWFT p 5 psy4trik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}