{"link": "https://www.themoviedb.org/tv/13895?language=en", "title": "Bat Masterson", "resume": "Bat Masterson is an American Western television series which showed a fictionalized account of the life of real-life marshal/gambler/dandy Bat Masterson. The title character was played by Gene Barry and the half-hour black-and-white shows ran on NBC from 1958 to 1961. The series was produced by Ziv Television Productions, the company responsible for such hit series as Sea Hunt and Highway Patrol.", "rate": 80, "genre": ["Western"], "cast": ["Gene Barry"], "character": ["Bat Masterson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13895   Expand Bat Masterson   (1958) User Score Overview Bat Masterson is an American Western television series which showed a fictionalized account of the life of real-life marshal/gambler/dandy Bat Masterson. The title character was played by Gene Barry and the half-hour black-and-white shows ran on NBC from 1958 to 1961. The series was produced by Ziv Television Productions, the company responsible for such hit series as Sea Hunt and Highway Patrol. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gene Barry Bat Masterson Full Cast & Crew Last Season Season 3 1960 | 34 Episodes Season 3 of Bat Masterson premiered on September 29, 1960. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Same background music as in Trackdown Open 0 by pt100\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bat Masterson. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Keywords wild west 19th century Content Score 56 We're so close, yet so far. Top Contributors 9 Banana 3 t0by 2 Zlogorek 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}