{"link": "https://www.themoviedb.org/tv/64089?language=en", "title": "Nightwatch", "resume": "Meet Keelin, Vladimir and Wilko, also known as The Nightwatch, a secret covenant with only one purpose: fight the evil from the underworld.", "rate": 85, "genre": ["Kids"], "cast": ["Giovanni Kemper", "Louis Thyssen", "Luna Van Avermaet", "Brigitte Heitzer", "Céline Verbeeck"], "character": ["Wilko", "Vladimir", "Sacha", "Helena", "Keelin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64089   Expand Nightwatch   (2015) User Score Overview Meet Keelin, Vladimir and Wilko, also known as The Nightwatch, a secret covenant with only one purpose: fight the evil from the underworld. Featured Crew Anja van Mensel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Giovanni Kemper Wilko Louis Thyssen Vladimir Luna Van Avermaet Sacha Brigitte Heitzer Helena Céline Verbeeck Keelin Full Cast & Crew Last Season Season 3 2017 | 13 Episodes Season 3 of Nightwatch premiered on September 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Nightwatch. You can help by rating TV shows you've seen. Facts Original Name  Nachtwacht Status  Returning Series Network Certification 6 Meaning Take care with children under 6. Type  Scripted Original Language  Dutch; Flemish Runtime  25m Homepage   https://studio100.com/be/nl/nachtwacht Genres Kids Keywords fantasy elves vampire werewolf Content Score 100 Yes! Looking good! Top Contributors 57 Lord Vetinari D 12 DoliMima t 11 timmie87 s 7 supermike  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}