{"link": "https://www.themoviedb.org/tv/63039?language=en", "title": "Bordertown", "resume": "The comedy, which takes place in a fictitious desert town near the U.S.-Mexico border, centers on the intertwining daily lives of neighbors Bud Buckwald and Ernesto Gonzales. Bud, a married father of three, is a Border Patrol agent who feels threatened by the cultural changes that have transformed his neighborhood. Living next door is Ernesto, an industrious Mexican immigrant and father of four, who is proud to be making it in America. As Bud and Ernesto’s paths begin to cross, their families become bound by friendship, romance and conflict.", "rate": 55, "genre": ["Animation", "Comedy"], "cast": ["Zach Villa", "Hank Azaria", "Missi Pyle", "Judah Friedlander", "Jacqueline Pinol"], "character": ["Carlos Sanchez", "Bud Buckwald", "Gert Buckwald", "Sanford Buckwald", "Pepito Gonzalez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63039   Expand Bordertown   (2016) User Score Overview The comedy, which takes place in a fictitious desert town near the U.S.-Mexico border, centers on the intertwining daily lives of neighbors Bud Buckwald and Ernesto Gonzales. Bud, a married father of three, is a Border Patrol agent who feels threatened by the cultural changes that have transformed his neighborhood. Living next door is Ernesto, an industrious Mexican immigrant and father of four, who is proud to be making it in America. As Bud and Ernesto’s paths begin to cross, their families become bound by friendship, romance and conflict. Featured Crew Mark Hentemann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zach Villa Carlos Sanchez Hank Azaria Bud Buckwald Missi Pyle Gert Buckwald Judah Friedlander Sanford Buckwald Jacqueline Pinol Pepito Gonzalez Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Bordertown premiered on January  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2011-02-08 Traffic Light 7.2    2015-12-01 Real Rob 5.8    2015-06-18 Hoff the Record 6.0    2017-01-01 Beau Séjour 7.9  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.fox.com/bordertown Genres Animation Comedy Keywords immigration dysfunctional family adult animation Content Score 93 Almost there... Top Contributors j 65 jnylen 10 Banana z 8 zyck 7 Wong  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}