{"link": "https://www.themoviedb.org/tv/8308?language=en", "title": "Expeditie Robinson", "resume": "Expeditie Robinson is a popular reality television program in the Netherlands, that debuted in 2000. It was the second production worldwide of a format that was developed in the UK, a format that has since then also been produced in many other countries, most notable under the title Survivor. The name of the show alludes to Swiss Family Robinson and Robinson Crusoe, two stories featuring people marooned by shipwrecks.\nThe fifteenth season in 2013 will be the first season without contestants from Belgium, due to lack of television ratings in Belgium. However, the Flemish host Evi Hanssen will continue co-host the show with Dutch host Dennis Weening.", "rate": 0, "genre": [], "cast": ["Dennis Weening", "Nicolette Kluijver", "Kay Nambiar", "Krystl Pullens", "Lobke Berkhout"], "character": ["Host", "Host", "Himself (Contestent)", "Herself (Contestent)", "Herself (Contestent)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8308   Expand Expeditie Robinson User Score Overview Expeditie Robinson is a popular reality television program in the Netherlands, that debuted in 2000. It was the second production worldwide of a format that was developed in the UK, a format that has since then also been produced in many other countries, most notable under the title Survivor. The name of the show alludes to Swiss Family Robinson and Robinson Crusoe, two stories featuring people marooned by shipwrecks. The fifteenth season in 2013 will be the first season without contestants from Belgium, due to lack of television ratings in Belgium. However, the Flemish host Evi Hanssen will continue co-host the show with Dutch host Dennis Weening. Featured Crew Charlie Parsons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dennis Weening Host Nicolette Kluijver Host Kay Nambiar Himself (Contestent) Krystl Pullens Herself (Contestent) Lobke Berkhout Herself (Contestent) Full Cast & Crew Last Season Season 15 2014 | 8 Episodes Season 15 of Expeditie Robinson premiered on September 11, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  60m Homepage   http://www.rtl.nl/reality/expeditierobinson/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors E 72 EvEs0r  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}