{"link": "https://www.themoviedb.org/tv/53052?language=en", "title": "From the New World", "resume": "Born into a world 1000 years in our future, Saki and her friends live in utopia. Not only is their idyllic community overflowing with resources, but technology is obsolete, thanks to a magical power that grants the ability to materialize anything. However, when Saki discovers a lost artifact, the facade is shattered! Faced with a startling truth about their town, Saki and her companions face dangers they never knew existed, and their choices may change the fate of everyone.", "rate": 83, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Risa Taneda", "Yuuki Kaji", "Aya Endo"], "character": ["Saki Watanabe (voice)", "Satoru Asahina (age 14-26) (voice)", "Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53052   Expand From the New World   (2012) User Score Overview Born into a world 1000 years in our future, Saki and her friends live in utopia. Not only is their idyllic community overflowing with resources, but technology is obsolete, thanks to a magical power that grants the ability to materialize anything. However, when Saki discovers a lost artifact, the facade is shattered! Faced with a startling truth about their town, Saki and her companions face dangers they never knew existed, and their choices may change the fate of everyone. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Risa Taneda Saki Watanabe (voice) Yuuki Kaji Satoru Asahina (age 14-26) (voice) Aya Endo Narrator (voice) Full Cast & Crew Last Season Season 1 2012 | 25 Episodes Season 1 of From the New World premiered on September 29, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of the best animes I've seen. Open 0 by Marr 🇳🇱\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2009-04-02 Phantom: Requiem for the Phantom 6.4    2010-04-02 Maid Sama! 6.3    2014-04-08 Black Bullet 6.8    2012-10-12 Psycho-Pass 7.7    2010-04-03 Angel Beats! 7.4    2015-07-05 Rokka: Braves of the Six Flowers 5.9    2007-04-01 Gurren Lagann 7.9    2015-01-10 Death Parade 7.3  Facts Original Name  新世界より Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tv-asahi.co.jp/shinsekaiyori/ Genres Animation Sci-Fi & Fantasy Keywords based on novel or book dystopia coming of age childhood friends dystopian future anime Content Score 56 We're so close, yet so far. Top Contributors 94 Marr 🇳🇱 45 Indi c 10 cherok t 8 themacguffinman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}