{"link": "https://www.themoviedb.org/tv/79148?language=en", "title": "Britain's Best Home Cook", "resume": "Queen of home cooking, Mary Berry, chef Dan Doherty and produce expert, Chris Bevin search for Britain's best home cook over eight weeks.", "rate": 0, "genre": ["Reality"], "cast": ["Mary Berry", "Chris Bavin", "Dan Doherty", "Claudia Winkleman"], "character": ["Herself - Judge", "Himself - Judge", "Himself - Judge", "Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79148   Expand Britain's Best Home Cook   (2018) User Score  Play Trailer Overview Queen of home cooking, Mary Berry, chef Dan Doherty and produce expert, Chris Bevin search for Britain's best home cook over eight weeks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Berry Herself - Judge Chris Bavin Himself - Judge Dan Doherty Himself - Judge Claudia Winkleman Herself - Host Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Britain's Best Home Cook premiered on May  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Britain's Best Home Cook. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   https://www.bbc.co.uk/programmes/b0b22t4x Genres Reality Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 23 Ash 16 Elizabeth Jennings I 1 IAmMrDexB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}