{"link": "https://www.themoviedb.org/tv/64040?language=en", "title": "My Daughter, Geum Sa-Wol", "resume": "A family has been dismantled by revenge and hate, but Geum Sa-Wol (Baek Jin-Hee) attempts to build up a dream house for the dismantled family.", "rate": 85, "genre": ["Drama", "Family", "Romance"], "cast": ["Baek Jin-hee", "Yoon Hyun-min", "Park Se-young", "Do Ji-won", "Do Sang-woo"], "character": ["Geum Sa Wol", "Kang Chan Bin", "Oh Hye Sang", "Han Ji Hye", "Joo Se Hoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64040   Expand My Daughter, Geum Sa-Wol   (2015) User Score Overview A family has been dismantled by revenge and hate, but Geum Sa-Wol (Baek Jin-Hee) attempts to build up a dream house for the dismantled family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Baek Jin-hee Geum Sa Wol Yoon Hyun-min Kang Chan Bin Park Se-young Oh Hye Sang Do Ji-won Han Ji Hye Do Sang-woo Joo Se Hoon Full Cast & Crew Last Season Season 1 2015 | 51 Episodes Season 1 of My Daughter, Geum Sa-Wol premiered on September  5, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for My Daughter, Geum Sa-Wol. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Daughter, Geum Sa-Wol. You can help by rating TV shows you've seen. Facts Original Name  내 딸, 금사월 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/gumsawall Genres Drama Family Romance Keywords korea Content Score 86 Almost there... Top Contributors t 43 tmdb38202327 8 Charles M 2 Maria180493 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}