{"link": "https://www.themoviedb.org/tv/17450?language=en", "title": "Whitechapel", "resume": "Whitechapel is a British television drama series produced by Carnival Films, in which detectives in London's Whitechapel district deal with murders which replicate historical crimes. The first series was first broadcast in the UK on 2 February 2009 and depicted the search for a modern copycat killer replicating the murders of Jack the Ripper.\nA second series was commissioned by ITV in September 2009 with the focus on the Kray twins. The first episode of this second series was broadcast on 11 October 2010.\nA third series was commissioned by ITV in March 2011, which was extended to six episodes as three two-part stories.\nThe first and second series were broadcast in the United States on six consecutive Wednesday evenings beginning 26 October 2011 on the BBC America cable network. The third was broadcast in the US starting on Wednesday 28 March 2012, also on BBC America.\nOn 24 September 2012, ITV renewed Whitechapel for a fourth series consisting of 6 episodes. The first episode was broadcast on 4 September 2013.", "rate": 75, "genre": ["Drama"], "cast": ["Steve Pemberton", "Phil Davis", "Alex Jennings", "Rupert Penry-Jones"], "character": ["Edward Buchan", "Ray Miles", "Anderson", "DI Joseph Chandler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17450   Expand Whitechapel   (2009) User Score Overview Whitechapel is a British television drama series produced by Carnival Films, in which detectives in London's Whitechapel district deal with murders which replicate historical crimes. The first series was first broadcast in the UK on 2 February 2009 and depicted the search for a modern copycat killer replicating the murders of Jack the Ripper. A second series was commissioned by ITV in September 2009 with the focus on the Kray twins. The first episode of this second series was broadcast on 11 October 2010. A third series was commissioned by ITV in March 2011, which was extended to six episodes as three two-part stories. The first and second series were broadcast in the United States on six consecutive Wednesday evenings beginning 26 October 2011 on the BBC America cable network. The third was broadcast in the US starting on Wednesday 28 March 2012, also on BBC America. On 24 September 2012, ITV renewed Whitechapel for a fourth series consisting of 6 episodes. The first episode was broadcast on 4 September 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Pemberton Edward Buchan Phil Davis Ray Miles Alex Jennings Anderson Rupert Penry-Jones DI Joseph Chandler Full Cast & Crew Last Season Season 4 2013 | 6 Episodes Season 4 of Whitechapel premiered on September  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2011-05-05 The Shadow Line 8.1    2011-09-13 The Body Farm 6.2    2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2011-06-05 Case Histories 8.2    2010-07-12 The Silence 6.8    2015-11-11 The Frankenstein Chronicles 6.9    2013-10-16 The Tunnel 7.5  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.itv.com/Whitechapel/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 lineker md 11 movie dino 10 Simon V. S 9 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}