{"link": "https://www.themoviedb.org/tv/20959?language=en", "title": "Calimero", "resume": "Calimero is an Italian/Japanese cartoon about a charming, but hapless anthropomorphized cartoon chicken; the only black one in a family of yellow chickens. He wears half of his egg shell still on his head. Calimero originally appeared on the Italian television show Carosello on July 14, 1963, and soon became a popular icon in Italy.\nThe characters were created by the animation studio Organizzazione Pagot and originated as a series of animated advertisements for Miralanza AVA soap products shown throughout Italy. At the end of each episode, it turns out that Calimero is not actually black, but only very dirty, and becomes white after being washed by the advertised soap products.\nThe characters were later licensed in Japan as an anime series, twice. The first was made by Toei Animation and ran from October 15, 1974 to September 30, 1975, and the second, with new settings and characters, was made in 1992. Altogether, 99 Japanese episodes were made. The series mostly consists of the many adventures of Calimero and his friends as they solve mysteries and make documentaries. However, their adventures usually get them into quite a bit of trouble. The first series was also broadcast on European networks such as TROS, ZDF and RTL II or TVE.", "rate": 55, "genre": ["Animation"], "cast": ["Katsue Miwa", "Kaneta Kimotsuki", "Masako Nozawa", "Sachiko Chijimatsu", "Masako Nozawa"], "character": ["Calimero", "Peter Jobatta", "Buta", "Deppa", "Calimero's mother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20959   Expand Calimero   (1974) User Score Overview Calimero is an Italian/Japanese cartoon about a charming, but hapless anthropomorphized cartoon chicken; the only black one in a family of yellow chickens. He wears half of his egg shell still on his head. Calimero originally appeared on the Italian television show Carosello on July 14, 1963, and soon became a popular icon in Italy. The characters were created by the animation studio Organizzazione Pagot and originated as a series of animated advertisements for Miralanza AVA soap products shown throughout Italy. At the end of each episode, it turns out that Calimero is not actually black, but only very dirty, and becomes white after being washed by the advertised soap products. The characters were later licensed in Japan as an anime series, twice. The first was made by Toei Animation and ran from October 15, 1974 to September 30, 1975, and the second, with new settings and characters, was made in 1992. Altogether, 99 Japanese episodes were made. The series mostly consists of the many adventures of Calimero and his friends as they solve mysteries and make documentaries. However, their adventures usually get them into quite a bit of trouble. The first series was also broadcast on European networks such as TROS, ZDF and RTL II or TVE. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katsue Miwa Calimero Kaneta Kimotsuki Peter Jobatta Masako Nozawa Buta Sachiko Chijimatsu Deppa Masako Nozawa Calimero's mother Full Cast & Crew Last Season Season 1 — | 52 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Calimero. You can help by rating TV shows you've seen. Facts Original Name  カリメロ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.calimero.com/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 Elizabeth Jennings 5 Wong D 4 Decaliax z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}