{"link": "https://www.themoviedb.org/tv/12883?language=en", "title": "The Ghost & Mrs. Muir", "resume": "The Ghost & Mrs. Muir is an American situation comedy based on the 1947 film of the same name, which was based on the 1945 novel by R. A. Dick. It premiered in September 1968 on NBC. After NBC canceled the series, it aired on ABC for one season before being canceled a final time.", "rate": 78, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Edward Mulhare", "Hope Lange", "Charles Nelson Reilly", "Reta Shaw"], "character": ["Captain Daniel Gregg", "Carolyn Muir", "Claymore Gregg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12883   Expand The Ghost & Mrs. Muir   (1968) User Score Overview The Ghost & Mrs. Muir is an American situation comedy based on the 1947 film of the same name, which was based on the 1945 novel by R. A. Dick. It premiered in September 1968 on NBC. After NBC canceled the series, it aired on ABC for one season before being canceled a final time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edward Mulhare Captain Daniel Gregg Hope Lange Carolyn Muir Charles Nelson Reilly Claymore Gregg Reta Shaw Full Cast & Crew Last Season Season 2 1969 | 24 Episodes Season 2 of The Ghost & Mrs. Muir premiered on September 18, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1965-09-14 F Troop 6.4    1965-09-01 Gidget 5.2    1962-10-11 McHale's Navy 6.1    1966-09-12 Family Affair 5.4    1960-09-29 My Three Sons 6.0    1949-09-15 The Lone Ranger 5.4    1962-10-01 The Lucy Show 7.0    1972-09-12 Maude 4.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors GB 7 Guillaume Beyssac 3 Elizabeth Jennings m 2 matthew_hogan 2 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}