{"link": "https://www.themoviedb.org/tv/2081?language=en", "title": "South of Nowhere", "resume": "South of Nowhere is an American teen drama television series created by Thomas W. Lynch. Aimed primarily at teenagers, it first aired on November 4, 2005 and was one of six original series on The N. The second half of the third and final season aired October 10, 2008 and the final episode aired on December 12, 2008. Live webisodes were also created to accompany each episode in the season 2 storyline, and were seen exclusively through The N's website on the Click.\nThe show follows the lives of the members of the Carlin family as they adjust to moving from Ohio to Los Angeles, California. One of the main focuses include the relationship between Spencer Carlin and her bisexual friend, Ashley Davies. The close friendship between Ashley and Spencer led Spencer to question her own sexuality, a subject which created controversy before the show first aired. It was the first series on The N to deal with such a subject relating to the primary characters, and the first television show ever to have non-heterosexual teenagers as the top-billed characters.South of Nowhere has received outstanding reviews from TV Guide, The Boston Tribute, New York Post, New York Daily News, Entertainment Weekly, and Variety.", "rate": 65, "genre": ["Drama"], "cast": ["Gabrielle Christian", "Mandy Musgrave", "Matt Cohen", "Chris Hunter", "Maeve Quinlan"], "character": ["Spencer Carlin", "Ashley Davies", "Aiden Dennison", "Glen Carlin", "Paula Carlin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2081   Expand South of Nowhere   (2005) User Score Overview South of Nowhere is an American teen drama television series created by Thomas W. Lynch. Aimed primarily at teenagers, it first aired on November 4, 2005 and was one of six original series on The N. The second half of the third and final season aired October 10, 2008 and the final episode aired on December 12, 2008. Live webisodes were also created to accompany each episode in the season 2 storyline, and were seen exclusively through The N's website on the Click. The show follows the lives of the members of the Carlin family as they adjust to moving from Ohio to Los Angeles, California. One of the main focuses include the relationship between Spencer Carlin and her bisexual friend, Ashley Davies. The close friendship between Ashley and Spencer led Spencer to question her own sexuality, a subject which created controversy before the show first aired. It was the first series on The N to deal with such a subject relating to the primary characters, and the first television show ever to have non-heterosexual teenagers as the top-billed characters.South of Nowhere has received outstanding reviews from TV Guide, The Boston Tribute, New York Post, New York Daily News, Entertainment Weekly, and Variety. Featured Crew Thomas W. Lynch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabrielle Christian Spencer Carlin Mandy Musgrave Ashley Davies Matt Cohen Aiden Dennison Chris Hunter Glen Carlin Maeve Quinlan Paula Carlin Full Cast & Crew Last Season Season 3 2007 | 16 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Aiden: Happy Birthday Matt Cohen! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2010-10-12 Lip Service 6.6    2012-06-17 True Love 6.3    2014-04-22 Faking It 5.3    2014-07-08 Finding Carter 5.6    2011-06-06 Switched at Birth 6.1    2011-07-19 Awkward. 6.2    2014-09-17 Red Band Society 6.4    2014-03-16 Crisis 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Drama Keywords high school love triangle lesbian relationship bisexual woman teen drama Content Score 93 Almost there... Top Contributors 31 Banana e 3 error666 2 thelword N 2 Ney  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}