{"link": "https://www.themoviedb.org/tv/13375?language=en", "title": "RahXephon", "resume": "In a world where time passes at a crawl and the blood of your neighbor runs blue, 17 year old high school student Ayato Kamina goes about his daily life within Tokyo Jupiter oblivious to the world around him, having been educated with the fact that the all civilization but Tokyo has been destroyed. But all that changes when the mysterious civilization \"MU\" invades his home, raining destruction down from the sky in the form of strange monsters called Dolems. The events that occur next will lead Ayato to the mysterious woman named Reika Mishima, to the truth of their existence, the discovery of what and who he is, and to the powerful angelic robot RahXephon.", "rate": 87, "genre": ["Sci-Fi", "Fantasy", "Animation", "Drama", "Action", "Adventure"], "cast": ["Chikao Ohtsuka", "Jouji Nakata", "Kae Araki", "Maaya Sakamoto", "Yumi Kakazu"], "character": ["Shougo Rikudoh", "Jin Kunugi", "Cathy MacMahon", "Reika Mishima", "Hiroko Asahina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13375   Expand RahXephon   (2002) User Score Overview In a world where time passes at a crawl and the blood of your neighbor runs blue, 17 year old high school student Ayato Kamina goes about his daily life within Tokyo Jupiter oblivious to the world around him, having been educated with the fact that the all civilization but Tokyo has been destroyed. But all that changes when the mysterious civilization \"MU\" invades his home, raining destruction down from the sky in the form of strange monsters called Dolems. The events that occur next will lead Ayato to the mysterious woman named Reika Mishima, to the truth of their existence, the discovery of what and who he is, and to the powerful angelic robot RahXephon. Featured Crew Yutaka Izubuchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chikao Ohtsuka Shougo Rikudoh Jouji Nakata Jin Kunugi Kae Araki Cathy MacMahon Maaya Sakamoto Reika Mishima Yumi Kakazu Hiroko Asahina Full Cast & Crew Last Season Season 1 2002 | 26 Episodes Season 1 of RahXephon premiered on January 21, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on RahXephon. You can help by rating TV shows you've seen. Facts Original Name  ラーゼフォン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.mediafactory.co.jp/anime/rahxephon/ Genres Sci-Fi & Fantasy Animation Drama Action & Adventure Keywords mecha military anime Content Score 93 Almost there... Top Contributors 19 Ailurus Fulgens J 7 JeremyRogers 5 Danzoc M 3 MGB89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}