{"link": "https://www.themoviedb.org/tv/54553?language=en", "title": "The Genius", "resume": "A reality series pitting people identified with \"genius traits\" against one another in social games of strategy, logic, and negotiation skills. Each episode consists of a main match and a death math. The main match decides the winner and elimination candidate for the day. The winner receives a token of life, which grants immunity from the death match, and potentially garnets, a game currency worth ₩1,000,000 each. Garnets can be used to improve a player's chances of winning a game, as well as be traded with other players to gain favor. The elimination candidate chooses a player without a token of life to take part in a 1v1 game called the death match. The player who loses the death match is eliminated, and the winner of the death match gains their garnets. The last remaining player is the champion, and the total garnets held by the champion will be the final prize.", "rate": 83, "genre": ["Reality"], "cast": ["Jin Ho Hong", "Kyung-ran Kim", "Lee Sang-min", "Jang Dong-min"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54553   Expand The Genius   (2013) User Score Overview A reality series pitting people identified with \"genius traits\" against one another in social games of strategy, logic, and negotiation skills. Each episode consists of a main match and a death math. The main match decides the winner and elimination candidate for the day. The winner receives a token of life, which grants immunity from the death match, and potentially garnets, a game currency worth ₩1,000,000 each. Garnets can be used to improve a player's chances of winning a game, as well as be traded with other players to gain favor. The elimination candidate chooses a player without a token of life to take part in a 1v1 game called the death match. The player who loses the death match is eliminated, and the winner of the death match gains their garnets. The last remaining player is the champion, and the total garnets held by the champion will be the final prize. Featured Crew Jung Joon-Young Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jin Ho Hong Kyung-ran Kim Lee Sang-min Jang Dong-min Full Cast & Crew Last Season Grand Final 2015 | 12 Episodes Season 4 of The Genius premiered on June 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2009-01-21 Lie to Me 7.4    2013-09-17 Brooklyn Nine-Nine 7.5    2004-11-16 House 8.1  Facts Original Name  더 지니어스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  80m Homepage  - Genres Reality Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors c 32 ctchim 31 huggi 4 helloskies 4 Hillja  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}