{"link": "https://www.themoviedb.org/tv/9240?language=en", "title": "Love & War", "resume": "Love & War is an American television sitcom, which aired on CBS from September 21, 1992 to February 1, 1995.\nCreated by Diane English, the series originally starred Susan Dey as Wally Porter, a Chicago restaurateur, and Jay Thomas as Jack Stein, a sportswriter with whom she had an on-again, off-again romance.\nAfter the first season, however, the show was retooled and Dey was fired by the producers of the show, claiming that she and Thomas had \"no chemistry\" together. She was replaced by Annie Potts as Dana Palladino, who bought Porter's restaurant and also became a love interest for Jack.\nThe first season also featured moments when Jack or Wally would break the fourth wall and address the camera directly, generally using it as an opportunity to discuss an emotional crisis. This mechanic was dropped in later seasons.\nOne episode featured a guest appearance from Jerry Seinfeld and Larry David as themselves, they did this as a \"thank you\" to creator Diane English for allowing a brief scene on Murphy Brown in an episode of Seinfeld where Kramer is cast as the titular character's secretary.\nThe show's supporting cast included Suzie Plakson, Joanna Gleason, Joel Murray, Charles Robinson and Michael Nouri. John Hancock, who had a recurring role as a judge on L.A. Law with Susan Dey previously, portrayed bartender Ike for the first half of season one, until he died of a heart attack in late 1992. His death was subsequently written into the series and he was replaced by actor Charlie Robinson.", "rate": 0, "genre": ["Comedy"], "cast": ["Jay Thomas", "Susan Dey", "Annie Potts", "Joel Murray", "Joanna Gleason"], "character": ["Jack Stein", "Wally Porter", "Dana Palladino", "Ray Litvak", "Nadine Berkus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9240   Expand Love & War   (1992) User Score Overview Love & War is an American television sitcom, which aired on CBS from September 21, 1992 to February 1, 1995. Created by Diane English, the series originally starred Susan Dey as Wally Porter, a Chicago restaurateur, and Jay Thomas as Jack Stein, a sportswriter with whom she had an on-again, off-again romance. After the first season, however, the show was retooled and Dey was fired by the producers of the show, claiming that she and Thomas had \"no chemistry\" together. She was replaced by Annie Potts as Dana Palladino, who bought Porter's restaurant and also became a love interest for Jack. The first season also featured moments when Jack or Wally would break the fourth wall and address the camera directly, generally using it as an opportunity to discuss an emotional crisis. This mechanic was dropped in later seasons. One episode featured a guest appearance from Jerry Seinfeld and Larry David as themselves, they did this as a \"thank you\" to creator Diane English for allowing a brief scene on Murphy Brown in an episode of Seinfeld where Kramer is cast as the titular character's secretary. The show's supporting cast included Suzie Plakson, Joanna Gleason, Joel Murray, Charles Robinson and Michael Nouri. John Hancock, who had a recurring role as a judge on L.A. Law with Susan Dey previously, portrayed bartender Ike for the first half of season one, until he died of a heart attack in late 1992. His death was subsequently written into the series and he was replaced by actor Charlie Robinson. Featured Crew Diane English Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Thomas Jack Stein Susan Dey Wally Porter Annie Potts Dana Palladino Joel Murray Ray Litvak Joanna Gleason Nadine Berkus Full Cast & Crew Last Season Season 3 1994 | 22 Episodes Season 3 of Love & War premiered on September 19, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love & War. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords chicago restaurant dating sitcom newspaper columnist Content Score 93 Almost there... Top Contributors 15 Banana R 3 Rebecca 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}