{"link": "https://www.themoviedb.org/tv/4111?language=en", "title": "Largo Winch", "resume": "Largo Winch is a television program based on the Belgian comic book series of the same name by Philippe Francq and Jean Van Hamme that first aired on January 26, 2001 in France on M6, and May 3, 2001 in Germany on ProSieben. The show lasted two seasons.\nGuest stars included Kim Poirier, Vernon Dobtcheff, Elisha Cuthbert and David Carradine.", "rate": 63, "genre": ["Action", "Adventure"], "cast": ["Kim Poirier", "Sydney Penny", "Paolo Seganti", "Serge Houde", "Geordie Johnson"], "character": ["Joy Arden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4111   Expand Largo Winch   (2001) User Score Overview Largo Winch is a television program based on the Belgian comic book series of the same name by Philippe Francq and Jean Van Hamme that first aired on January 26, 2001 in France on M6, and May 3, 2001 in Germany on ProSieben. The show lasted two seasons. Guest stars included Kim Poirier, Vernon Dobtcheff, Elisha Cuthbert and David Carradine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Poirier Sydney Penny Joy Arden Paolo Seganti Serge Houde Geordie Johnson Full Cast & Crew Last Season Season 2 2002 | 13 Episodes Season 2 of Largo Winch premiered on September  1, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Largo Winch. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Largo Winch. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 Banana w 4 waterhorse s 3 speedycars 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}