{"link": "https://www.themoviedb.org/tv/2715?language=en", "title": "Hang Time", "resume": "Hang Time is an American teen sitcom about a fictional Indiana high school's boys' basketball team \"Deering\" with one female player, that aired from 1995–2000. It aired on Saturday mornings on NBC as part of the network's TNBC morning block. It was created by Troy Searer, Robert Tarlow, and Mark Fink. The show lasted six seasons, during which the cast was changed almost in its entirety. Only two cast members stayed with the show throughout its entire run, similar to Saved by the Bell: The New Class.", "rate": 85, "genre": ["Comedy"], "cast": ["Dick Butkus", "Amber Barretto", "Reggie Theus", "Megan Parlen", "Danso Gordon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2715   Expand Hang Time   (1995) User Score Overview Hang Time is an American teen sitcom about a fictional Indiana high school's boys' basketball team \"Deering\" with one female player, that aired from 1995–2000. It aired on Saturday mornings on NBC as part of the network's TNBC morning block. It was created by Troy Searer, Robert Tarlow, and Mark Fink. The show lasted six seasons, during which the cast was changed almost in its entirety. Only two cast members stayed with the show throughout its entire run, similar to Saved by the Bell: The New Class. Featured Crew Mark Fink Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dick Butkus Amber Barretto Reggie Theus Megan Parlen Danso Gordon Full Cast & Crew Last Season Season 6 2000 | 12 Episodes Season 6 of Hang Time premiered on September 23, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hang Time. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  21m, 30m Homepage  - Genres Comedy Keywords high school sport basketball teen comedy Content Score 79 Pump it up! We're close now. Top Contributors 10 Banana z 4 zurman1 R 1 Rebafan23 1 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}