{"link": "https://www.themoviedb.org/tv/38251?language=en", "title": "Toriko", "resume": "Toriko is a Japanese manga series written and illustrated by Mitsutoshi Shimabukuro. It has been serialized in Weekly Shōnen Jump since May 19, 2008, and has been collected into 25 tankōbon volumes by Shueisha as of July 4, 2013. It follows the adventure of Toriko, a Gourmet Hunter, as he searches for rare, diverse foods to complete a full-course meal. On his journey, he is accompanied by a timid chef who wants to improve his skills.\nA short film was created by Ufotable for the Jump Super Anime Tour 2009, with another created for the 2010 tour. The series has also been adapted into a television anime series produced by Toei Animation, which has been broadcast in Japan since 2011. Additionally, Toei developed a 2011 animated 3D short film and a 2013 feature film. The manga series is licensed for an English-language release by Viz Media in North America and Madman Entertainment in Australasia. Madman also licensed the anime series in Australasia, while Funimation Entertainment licensed it in North America.", "rate": 62, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy", "Action", "Adventure"], "cast": ["Mitsuo Iwata", "Romi Park", "Takahiro Sakurai", "Ryotaro Okiayu", "Nana Mizuki"], "character": ["Sunny", "Komatsu", "Coco", "Toriko", "Tina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38251   Expand Toriko   (2011) User Score Overview Toriko is a Japanese manga series written and illustrated by Mitsutoshi Shimabukuro. It has been serialized in Weekly Shōnen Jump since May 19, 2008, and has been collected into 25 tankōbon volumes by Shueisha as of July 4, 2013. It follows the adventure of Toriko, a Gourmet Hunter, as he searches for rare, diverse foods to complete a full-course meal. On his journey, he is accompanied by a timid chef who wants to improve his skills. A short film was created by Ufotable for the Jump Super Anime Tour 2009, with another created for the 2010 tour. The series has also been adapted into a television anime series produced by Toei Animation, which has been broadcast in Japan since 2011. Additionally, Toei developed a 2011 animated 3D short film and a 2013 feature film. The manga series is licensed for an English-language release by Viz Media in North America and Madman Entertainment in Australasia. Madman also licensed the anime series in Australasia, while Funimation Entertainment licensed it in North America. Featured Crew Mitsutoshi Shimabukuro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitsuo Iwata Sunny Romi Park Komatsu Takahiro Sakurai Coco Ryotaro Okiayu Toriko Nana Mizuki Tina Full Cast & Crew Last Season Season 3 2013 | 50 Episodes Season 3 of Toriko premiered on April 14, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Toriko. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Toriko. You can help by rating TV shows you've seen. Facts Original Name  トリコ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.shonenjump.com/j/rensai/toriko/index.html Genres Animation Sci-Fi & Fantasy Comedy Action & Adventure Keywords shounen anime Content Score 100 Yes! Looking good! Top Contributors 8 benf45 5 cwhboy M 4 MiniCine 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}