{"link": "https://www.themoviedb.org/tv/5610?language=en", "title": "Ciao Darwin", "resume": "Ciao Darwin is a variety game show format from Italy sold under licence to several countries, including Romania, Hungary, Poland, Serbia, Canada, USA, China and Greece.\nThere are two competing teams of about 50 people each, usually made up of people who fit certain opposing stereotypes. In each game two members of the audience are selected at random, one from each team, indicated by a light in front of them which remains illuminated when all the other team members' lights have gone off.\nThe games involve contestants competing in acts of bravery, style and talent, some of which are designed to humiliate the contestants, especially an assault course which was introduced with the Italian version in 2010, and the Finale which is a water tank game.", "rate": 0, "genre": ["Reality"], "cast": ["Paolo Bonolis", "Luca Laurenti", "Claudio Gregori", "Pasquale Petrolo", "Giada Pezzaioli"], "character": ["Prima Donna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5610   Expand Ciao Darwin   (1998) User Score Overview Ciao Darwin is a variety game show format from Italy sold under licence to several countries, including Romania, Hungary, Poland, Serbia, Canada, USA, China and Greece. There are two competing teams of about 50 people each, usually made up of people who fit certain opposing stereotypes. In each game two members of the audience are selected at random, one from each team, indicated by a light in front of them which remains illuminated when all the other team members' lights have gone off. The games involve contestants competing in acts of bravery, style and talent, some of which are designed to humiliate the contestants, especially an assault course which was introduced with the Italian version in 2010, and the Finale which is a water tank game. Featured Crew Paolo Bonolis Creator Stefano Magnaghi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paolo Bonolis Luca Laurenti Claudio Gregori Pasquale Petrolo Giada Pezzaioli Prima Donna Full Cast & Crew Last Season Season 7 2016 | 8 Episodes Season 7 of Ciao Darwin premiered on March 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Ciao Darwin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  Italian Runtime  180m Homepage   http://www.ciaodarwin.mediaset.it/ Genres Reality Keywords game show quiz game variety trash takeshi Content Score 93 Almost there... Top Contributors C 122 Cataloguer TB 3 TMDb Bot 1 TechShooter 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}