{"link": "https://www.themoviedb.org/tv/39268?language=en", "title": "Whitney", "resume": "Whitney is an American sitcom that ran on NBC from September 22, 2011 to March 27, 2013. The series originally aired in the 9:30 pm /8:30 pm Thursday night timeslot. The show stars Whitney Cummings and is based on her real-life experience and her comedy routines. On September 25, 2011, the pilot of Whitney was multipurposed on various NBCUniversal networks, including Oxygen, E!, Style, and Bravo; it last aired on E!.\nOn May 9, 2013, Whitney was canceled by NBC.", "rate": 41, "genre": ["Comedy"], "cast": ["Whitney Cummings", "Chris D'Elia", "Zoe Lister-Jones", "Rhea Seehorn", "Dan O'Brien"], "character": ["Whitney", "Alex Green", "Lily", "Roxanne", "Mark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39268   Expand Whitney   (2011) User Score  Play Trailer Overview Whitney is an American sitcom that ran on NBC from September 22, 2011 to March 27, 2013. The series originally aired in the 9:30 pm /8:30 pm Thursday night timeslot. The show stars Whitney Cummings and is based on her real-life experience and her comedy routines. On September 25, 2011, the pilot of Whitney was multipurposed on various NBCUniversal networks, including Oxygen, E!, Style, and Bravo; it last aired on E!. On May 9, 2013, Whitney was canceled by NBC. Featured Crew Whitney Cummings Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Whitney Cummings Whitney Chris D'Elia Alex Green Zoe Lister-Jones Lily Rhea Seehorn Roxanne Dan O'Brien Mark Full Cast & Crew Last Season Season 2 2012 | 16 Episodes Season 2 of Whitney premiered on October 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2011-09-14 Up All Night 6.2    2011-04-13 Happy Endings 7.3    2012-02-20 The Bleak Old Shop of Stuff 6.7    2011-01-17 Being Human 5.8    2014-10-10 Cristela 6.1    George Carlin: Life Is Worth Losing 7.5    2013-10-03 Welcome to the Family 5.7    2012-09-26 The Neighbors 6.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/whitney/ Official website Genres Comedy Keywords chicago relationship sitcom actor straight relationship Content Score 100 Yes! Looking good! Top Contributors 16 isavedtheday 9 Banana 5 lineker s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}