{"link": "https://www.themoviedb.org/tv/71328?language=en", "title": "Sea of the Woman", "resume": "Set in the 1960's and 1970's. Soo-In is a smart student who has never missed ranking at the top of her class. Due to her poor family situation, she begins to work at a factory instead of going to college. Nevertheless, she pursues her dream.", "rate": 60, "genre": ["Drama", "Family"], "cast": ["Oh Seung-A", "Kim Joo-Young", "Choi Sung-Jae", "Park Hyun-Suk", "Lee Hyun-Kyung"], "character": ["Yoon Soo-In", "Choi Jung-Wook", "Kim Sun-Woo", "Park Soon-Ok", "Lee Young-Sun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71328   Expand Sea of the Woman   (2017) User Score Overview Set in the 1960's and 1970's. Soo-In is a smart student who has never missed ranking at the top of her class. Due to her poor family situation, she begins to work at a factory instead of going to college. Nevertheless, she pursues her dream. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Seung-A Yoon Soo-In Kim Joo-Young Choi Jung-Wook Choi Sung-Jae Kim Sun-Woo Park Hyun-Suk Park Soon-Ok Lee Hyun-Kyung Lee Young-Sun Full Cast & Crew Last Season Season 1 2017 | 120 Episodes Season 1 of Sea of the Woman premiered on February 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sea of the Woman. You can help by rating TV shows you've seen. Facts Original Name  그 여자의 바다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  40m Homepage  - Genres Drama Family Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors n 35 nubie 19 Elizabeth Jennings 1 friend-series.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}