{"link": "https://www.themoviedb.org/tv/1898?language=en", "title": "Odyssey 5", "resume": "Odyssey 5 is a Canadian science fiction series that first ran in 2002 on Showtime in the United States and on Space in Canada.\nOdyssey 5 is the brainchild of Manny Coto, who served as a script-writer and executive producer during the series run. Through his website and in interviews, Coto has expressed his interest in returning to the series at some point, either continuing it or giving it a conclusion.", "rate": 76, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Christopher Gorham", "Peter Weller", "Sebastian Roché", "Leslie Silva", "Lindy Booth"], "character": ["Neil Taggart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1898   Expand Odyssey 5   (2002) User Score Overview Odyssey 5 is a Canadian science fiction series that first ran in 2002 on Showtime in the United States and on Space in Canada. Odyssey 5 is the brainchild of Manny Coto, who served as a script-writer and executive producer during the series run. Through his website and in interviews, Coto has expressed his interest in returning to the series at some point, either continuing it or giving it a conclusion. Featured Crew Manny Coto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Gorham Neil Taggart Peter Weller Sebastian Roché Leslie Silva Lindy Booth Full Cast & Crew Last Season Season 1 2002 | 20 Episodes Season 1 of Odyssey 5 premiered on June 21, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I demand a return of this series... Open 0 by RoidDroidVoid\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1999-09-24 Now and Again 6.1    1999-04-07 The Last Train 7.5    2011-02-07 Outcasts 6.2    2005-09-16 Threshold 6.9    2013-02-14 Zero Hour 4.9    2012-01-22 Real Humans 7.7    2010-09-20 The Event 6.2    2007-01-21 The Dresden Files 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 45m, 60m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords technology time travel end of the world astronaut changing the past or future Content Score 93 Almost there... Top Contributors 7 Banana z 5 zurman1 m 4 misak0007 s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}