{"link": "https://www.themoviedb.org/tv/69288?language=en", "title": "Kemono Friends", "resume": "The anime's story takes place in Japari Park, a \"gigantic integrated zoo.\" In the zoo, due to the mysterious \"sand star\" substance, the animals start turning into human-shaped creatures called Animal Girls. Japari Park is a place where many people visit and have fun at, but one day a lost child wanders into the park. The lost child starts a journey to return, but because so many Animal Girls join in on the quest it becomes an unexpected grand adventure.", "rate": 48, "genre": ["Animation", "Comedy"], "cast": ["Yuka Ozaki", "Aya Uchida"], "character": ["Serval", "Kaban / Lucky Beast / Mirai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69288   Expand Kemono Friends   (2017) User Score Overview The anime's story takes place in Japari Park, a \"gigantic integrated zoo.\" In the zoo, due to the mysterious \"sand star\" substance, the animals start turning into human-shaped creatures called Animal Girls. Japari Park is a place where many people visit and have fun at, but one day a lost child wanders into the park. The lost child starts a journey to return, but because so many Animal Girls join in on the quest it becomes an unexpected grand adventure. Featured Crew Tatsuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuka Ozaki Serval Aya Uchida Kaban / Lucky Beast / Mirai Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Kemono Friends premiered on January 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kemono Friends. You can help by rating TV shows you've seen. Facts Original Name  けものフレンズ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://kemono-friends.jp/ Genres Animation Comedy Keywords anime Content Score 64 We're so close, yet so far. Top Contributors Z 17 Zayrus 16 sp1ti z 8 zurman1 8 RubeensVinicius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}