{"link": "https://www.themoviedb.org/tv/75953?language=en", "title": "Oh My General", "resume": "The drama tells of the peculiar love story between a stoic and strong female general Ye Zhao, and a good-for-nothing but gorgeous prince Zhao Yu Jin, after they were betrothed to each other by the empress dowager.", "rate": 87, "genre": ["Comedy"], "cast": ["Ma Sichun", "Peter Sheng", "Zhu Yong Teng", "Sookie Pan"], "character": ["Ye Zhao", "Zhao Yu Jin", "Qi Wang", "Qiu Shui"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75953   Expand Oh My General   (2017) User Score Overview The drama tells of the peculiar love story between a stoic and strong female general Ye Zhao, and a good-for-nothing but gorgeous prince Zhao Yu Jin, after they were betrothed to each other by the empress dowager. Featured Crew Clarence Ford Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ma Sichun Ye Zhao Peter Sheng Zhao Yu Jin Zhu Yong Teng Qi Wang Sookie Pan Qiu Shui Full Cast & Crew Current Season Season 1 2017 | 60 Episodes Season 1 of Oh My General premiered on October 25, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Oh My General. You can help by rating TV shows you've seen. Facts Original Name  将军在上 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors s 23 sinistervn M 16 Maria180493 8 friend-series.com k 3 khyungil  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}