{"link": "https://www.themoviedb.org/tv/65414?language=en", "title": "The Quiz", "resume": "De Kwis is a dutch comedy game show that discusses and highlights the news of the week with a famous dutch person as the quiz candidate", "rate": 0, "genre": ["Comedy"], "cast": ["Paul de Leeuw", "Niels van der Laan", "Jeroen Woe", "Joep van Deudekom", "Rob Urgert"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65414   Expand The Quiz   (2013) User Score Overview De Kwis is a dutch comedy game show that discusses and highlights the news of the week with a famous dutch person as the quiz candidate Featured Crew Niels van der Laan Creator Jeroen Woe Creator Joep van Deudekom Creator Rob Urgert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul de Leeuw Niels van der Laan Jeroen Woe Joep van Deudekom Rob Urgert Full Cast & Crew Last Season Season 7 2016 | 5 Episodes Season 7 of The Quiz premiered on November  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Quiz. You can help by rating TV shows you've seen. Facts Original Name  De Kwis Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  - Homepage   http://programma.vara.nl/dekwis Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors g 31 gogNavySeal s 5 spiezmaestro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}