{"link": "https://www.themoviedb.org/tv/64560?language=en", "title": "Tellus", "resume": "As a group of Finish ecoterrorists escalate their attacks, they are pursued by an environmentally conscious detective who's less radical about his activism and tries to save the earth in his own personal way.", "rate": 60, "genre": ["Drama", "Crime"], "cast": ["Minka Kuustonen", "Lauri Tilkanen", "Pirkka-Pekka Petelius", "Henrik Hammarberg", "Eppu Pastinen"], "character": ["Eevi Forsman", "Alex Jäntti", "Taneli Lokka", "Janne Hentilä", "Sami Horto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64560   Expand Tellus   (2014) User Score  Play Trailer Overview As a group of Finish ecoterrorists escalate their attacks, they are pursued by an environmentally conscious detective who's less radical about his activism and tries to save the earth in his own personal way. Featured Crew JP Siili Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minka Kuustonen Eevi Forsman Lauri Tilkanen Alex Jäntti Pirkka-Pekka Petelius Taneli Lokka Henrik Hammarberg Janne Hentilä Eppu Pastinen Sami Horto Full Cast & Crew Last Season Season 1 2014 | 6 Episodes Season 1 of Tellus premiered on November 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Tellus. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Take care with children under 12. Type  Scripted Original Language  Finnish Runtime  50m Homepage   https://yle.fi/aihe/tellus Genres Drama Crime Keywords eco terrorism environmental activist eco crime Content Score 100 Yes! Looking good! Top Contributors 64 Marr 🇳🇱 23 Elizabeth Jennings 7 gianpoker z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}