{"link": "https://www.themoviedb.org/tv/61755?language=en", "title": "WATAMOTE", "resume": "At the tender age of 15, Kuroki Tomoko has already dated dozens and dozens of boys and she's easily the most popular girl around! The only problem is that absolutely none of that is real, and her perfect world exists only via dating games and romance shows. In fact, the sad truth is that she gets tongue tied just talking to people, and throughout middle school she's only had one actual friend. All of which makes Kuroki's entrance into the social pressure cooker of high school a new and special kind of hell. Because while Kuroki desperately wants to be popular, she's actually worse off than she would be if she was completely clueless as to how to go about it. After all, the things that work in \"otome\" games rarely play out the same way in reality, especially when the self-appointed \"leading lady\" isn't the paragon she thinks she is. There's not much gain and plenty of pain ahead, but even if it happens again and again, there's always someone else to blame in WATAMOTE ~ No Matter How I Look at It, It's You Guys' Fault I'm Not Popular!", "rate": 83, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Izumi Kitta", "Yuichi Nakamura", "Kana Hanazawa", "Rie Kugimiya", "Risa Hayamizu"], "character": ["Tomoko Kuroki", "Tomoki Kuroki", "Yū Naruse", "Kiko (voice)", "Kuroki's mother (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61755   Expand WATAMOTE   (2013) User Score Overview At the tender age of 15, Kuroki Tomoko has already dated dozens and dozens of boys and she's easily the most popular girl around! The only problem is that absolutely none of that is real, and her perfect world exists only via dating games and romance shows. In fact, the sad truth is that she gets tongue tied just talking to people, and throughout middle school she's only had one actual friend. All of which makes Kuroki's entrance into the social pressure cooker of high school a new and special kind of hell. Because while Kuroki desperately wants to be popular, she's actually worse off than she would be if she was completely clueless as to how to go about it. After all, the things that work in \"otome\" games rarely play out the same way in reality, especially when the self-appointed \"leading lady\" isn't the paragon she thinks she is. There's not much gain and plenty of pain ahead, but even if it happens again and again, there's always someone else to blame in WATAMOTE ~ No Matter How I Look at It, It's You Guys' Fault I'm Not Popular! Featured Crew Shin Ōnuma Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Izumi Kitta Tomoko Kuroki Yuichi Nakamura Tomoki Kuroki Kana Hanazawa Yū Naruse Rie Kugimiya Kiko (voice) Risa Hayamizu Kuroki's mother (voice) Full Cast & Crew Last Season Season 1 2013 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2010-10-02 Panty & Stocking with Garterbelt 7.6    2013-10-03 Outbreak Company 8.8    2015-07-09 Himouto! Umaru-chan 8.6    2011-07-07 Mayo Chiki! 9.5    2005-01-06 Ah! My Goddess 9.0    2014-01-07 D-Frag! 8.0    2007-10-02 Bamboo Blade 9.5    2014-04-05 Dragonar Academy 7.0  Facts Original Name  ワタモテ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://watamote.jp/ Genres Animation Comedy Drama Keywords nerd slice of life based on manga recluse anime Content Score 93 Almost there... Top Contributors 29 WillofOwn 20 Elizabeth Jennings 15 CrewMdk 9 saicohtic  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}