{"link": "https://www.themoviedb.org/tv/57263?language=en", "title": "The Mill", "resume": "Powerful historical drama series, based on the lives of real people, telling the story of young 19th-century apprentices taking their lives into their own hands for the first time.", "rate": 75, "genre": ["Drama"], "cast": ["Katherine Rose Morley", "Connor Dempsey", "Richard Banks", "Neil Broome", "Joshua Isherwood"], "character": ["Lucy", "Tommy Priestley", "Mule Worker", "Mill Worker", "Jack"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57263   Expand The Mill   (2013) User Score  Play Trailer Overview Powerful historical drama series, based on the lives of real people, telling the story of young 19th-century apprentices taking their lives into their own hands for the first time. Featured Crew John Fay Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine Rose Morley Lucy Connor Dempsey Tommy Priestley Richard Banks Mule Worker Neil Broome Mill Worker Joshua Isherwood Jack Full Cast & Crew Last Season Series 2 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Wish This Would Come to the U.S. Open 0 by Satai Delenn\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Mill. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/the-mill Genres Drama Keywords biography period drama Content Score 100 Yes! Looking good! Top Contributors 31 Elizabeth Jennings 26 achail mohammed 17 Markxist 3 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}