{"link": "https://www.themoviedb.org/tv/5114?language=en", "title": "Veritas: The Quest", "resume": "Veritas: The Quest is a television program that aired in 2003. It follows a rebellious but intelligent teenager, Nikko Zond, discovering that his father Solomon's profession is much more mystical and adventurous than he previously thought. Solomon and his team search for the answers to some of the world's mysteries, a quest began because of the mysterious disappearance of Nikko's mother during an archaeological dig. Thus begins Nikko's fantastical journey into an Indiana Jones-style adventure with his father and his colleagues in trying to follow in his mother's footsteps to discover what strange secrets she was uncovering. The series was cancelled in the United States by ABC with only four episodes being aired. Thirteen episodes were broadcast on Sci Fi Channel in the United Kingdom, on Rai 2 and Rai 4 in Italy, Sony Entertainment Television of Spain.\nThis was the first program where Cobie Smulders had a series regular role, and notable guest stars included Liz Vassey, Carlo Rota, Roger Rees, and Eli Wallach.", "rate": 63, "genre": ["Action", "Adventure"], "cast": ["Eric Balfour", "Ryan Merriman", "Cobie Smulders", "Cynthia Martells", "Arnold Vosloo"], "character": ["Calvin Banks", "Nikko Zond", "Juliet Droil", "Maggie Hayes", "Vincent Siminou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5114   Expand Veritas: The Quest   (2003) User Score Overview Veritas: The Quest is a television program that aired in 2003. It follows a rebellious but intelligent teenager, Nikko Zond, discovering that his father Solomon's profession is much more mystical and adventurous than he previously thought. Solomon and his team search for the answers to some of the world's mysteries, a quest began because of the mysterious disappearance of Nikko's mother during an archaeological dig. Thus begins Nikko's fantastical journey into an Indiana Jones-style adventure with his father and his colleagues in trying to follow in his mother's footsteps to discover what strange secrets she was uncovering. The series was cancelled in the United States by ABC with only four episodes being aired. Thirteen episodes were broadcast on Sci Fi Channel in the United Kingdom, on Rai 2 and Rai 4 in Italy, Sony Entertainment Television of Spain. This was the first program where Cobie Smulders had a series regular role, and notable guest stars included Liz Vassey, Carlo Rota, Roger Rees, and Eli Wallach. Featured Crew Patrick Massett Creator John Zinman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Balfour Calvin Banks Ryan Merriman Nikko Zond Cobie Smulders Juliet Droil Cynthia Martells Maggie Hayes Arnold Vosloo Vincent Siminou Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Veritas: The Quest premiered on January 27, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2015-04-15 The Delivery Man 6.5    2016-06-08 Power Monkeys 7.0    2006-01-01 In Justice 6.8    2011-01-13 Kidnap and Ransom 7.6    2011-05-02 Case Sensitive 5.4    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0    2013-09-05 The Guilty 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 JoanaCR 3 MacFly 🇫🇷 W 1 Witch22 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}