{"link": "https://www.themoviedb.org/tv/1887?language=en", "title": "Alfred J. Kwak", "resume": "Alfred J. Kwak is a cartoon television series based on a Dutch theatre show by Herman van Veen and was co-produced by VARA, Telecable Benelux B.V. and TV Tokyo and first shown in 1989. It consists of 52 episodes. The series characters were designed by Harald Siepermann. There are also toys and a comic based on the animated series.\nThe series has been broadcast in many countries and has been dubbed and subtitled in Dutch, French, Japanese, Greek, English, Italian, Spanish, Hebrew, Arabic, Hungarian, Finnish, Serbian, Polish, German, Swedish, Danish, Icelandic, Chinese, Czech, Korean and Norwegian.\nIn 1991, Herman van Veen won the Goldene Kamera award for the cartoon.", "rate": 84, "genre": ["Animation"], "cast": ["Ryan van den Akker", "Frits Lambrechts", "Herman van Veen", "Doris Baaten", "Johnny Kraaykamp jr."], "character": ["Alfred J. Kwak", "Henk de Mol", "Krabnagel de Kater", "Ollie de Ooievaar", "Dolf"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1887   Expand Alfred J. Kwak   (1989) User Score Overview Alfred J. Kwak is a cartoon television series based on a Dutch theatre show by Herman van Veen and was co-produced by VARA, Telecable Benelux B.V. and TV Tokyo and first shown in 1989. It consists of 52 episodes. The series characters were designed by Harald Siepermann. There are also toys and a comic based on the animated series. The series has been broadcast in many countries and has been dubbed and subtitled in Dutch, French, Japanese, Greek, English, Italian, Spanish, Hebrew, Arabic, Hungarian, Finnish, Serbian, Polish, German, Swedish, Danish, Icelandic, Chinese, Czech, Korean and Norwegian. In 1991, Herman van Veen won the Goldene Kamera award for the cartoon. Featured Crew Herman van Veen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan van den Akker Alfred J. Kwak Frits Lambrechts Henk de Mol Herman van Veen Krabnagel de Kater Doris Baaten Ollie de Ooievaar Johnny Kraaykamp jr. Dolf Full Cast & Crew Last Season Alfred jodocus kwak season 2 1989 | 26 Episodes Season 2 of Alfred J. Kwak premiered on October  2, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2011-07-03 Penguindrum 7.8    1971-03-07 Die Sendung mit der Maus 6.4    1992-06-20 On the Air 9.4    2015-01-05 Yurikuma Arashi 7.7    1981-02-14 Wanna bet, that..? 3.2    1980-01-08 The Wonderful Adventures of Nils 6.8    1959-09-12 Bonanza 5.9    2002-01-25 Mr. Bean: The Animated Series 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  25m Homepage   http://www.alfredjodocuskwak.com Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 30 Martijn635 w 6 waterhorse c 5 ctheiss z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}