{"link": "https://www.themoviedb.org/tv/74185?language=en", "title": "Girls' Last Tour", "resume": "In a future where most of humanity has perished, two girls explore the ruins of civilization, looking for food and fuel. With Chito behind the wheel and Yuuri handling gun duties, they try to salvage what’s left of their post-apocalyptic world.", "rate": 75, "genre": ["Mystery", "Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Yurika Kubo", "Inori Minase", "Akira Ishida", "Kotono Mitsuishi", "Yuuki Kaji"], "character": ["Yuuri (Voice)", "Chito (Voice)", "Kanazawa (Voice)", "Ishii (Voice)", "Automaton (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74185   Expand Girls' Last Tour   (2017) User Score  Play Trailer Overview In a future where most of humanity has perished, two girls explore the ruins of civilization, looking for food and fuel. With Chito behind the wheel and Yuuri handling gun duties, they try to salvage what’s left of their post-apocalyptic world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yurika Kubo Yuuri (Voice) Inori Minase Chito (Voice) Akira Ishida Kanazawa (Voice) Kotono Mitsuishi Ishii (Voice) Yuuki Kaji Automaton (Voice) Full Cast & Crew Current Season Season 1 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  5 Recommendations   2017-07-07 MADE IN ABYSS 8.2  Facts Original Name  少女終末旅行 Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://girls-last-tour.com/ Genres Mystery Action & Adventure Animation Sci-Fi & Fantasy Keywords slice of life military anime post apocalypse Content Score 93 Almost there... Top Contributors 34 sp1ti 33 Mar2ck D 16 Destr0y M 14 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}