{"link": "https://www.themoviedb.org/tv/69322?language=en", "title": "Strawberry smell", "resume": "A hardworking girl and a reckless boy.. Although their major differences, fate on the other hand has other plans for them.", "rate": 0, "genre": ["Comedy"], "cast": ["Yusuf Çim", "Leyla Uner Ermaya", "Demet Özdemir", "Ekin Mert Daymaz", "Mine Tugay"], "character": ["Burak", "Sukran", "Asli", "Volkan", "Elçin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69322   Expand Strawberry smell User Score Overview A hardworking girl and a reckless boy.. Although their major differences, fate on the other hand has other plans for them. Featured Crew Filiz Gülmez Pakman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yusuf Çim Burak Leyla Uner Ermaya Sukran Demet Özdemir Asli Ekin Mert Daymaz Volkan Mine Tugay Elçin Full Cast & Crew Last Season Season 1 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Facts Original Name  Çilek Kokusu Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Comedy Keywords romance Content Score 86 Almost there... Top Contributors A 30 Alenp x 19 xoplax82 11 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}