{"link": "https://www.themoviedb.org/tv/8129?language=en", "title": "Busytown Mysteries", "resume": "Busytown Mysteries, also known as Hurray for Huckle!, is a Canadian animated television series created by Cookie Jar Entertainment. Currently the series airs in Canada as part of the Kids' CBC block on the Tiny Pop channel and in the United States as part of the Cookie Jar TV block on CBS. Both season one and season two are available for viewing through Netflix streaming on demand. It takes place in Richard Scarry's Busytown and teaches the scientific method through stories in which Huckle Cat solve mysteries by examining evidence.\nSeason one was directed by Ken Cunningham and produced by Christine Davis. Animation for season one was produced by Heli Digital inc. Post production was handled by Fearless films and Supersonics productions inc. Season one was the winner of the 2009 CFTPA award for best children's program, and nominated for the 2009 Pulcinella award for best preschool series at Italy’s prestigious \"Cartoons on the Bay\".\nSeason two was directed by Larry Jacobs with post directing by Ken Cunningham and produced by Genna Du Plessis, and Audrey Velichka.", "rate": 70, "genre": [], "cast": ["Joanne Vannicola", "Catherine Disher"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8129   Expand Busytown Mysteries   (2007) User Score Overview Busytown Mysteries, also known as Hurray for Huckle!, is a Canadian animated television series created by Cookie Jar Entertainment. Currently the series airs in Canada as part of the Kids' CBC block on the Tiny Pop channel and in the United States as part of the Cookie Jar TV block on CBS. Both season one and season two are available for viewing through Netflix streaming on demand. It takes place in Richard Scarry's Busytown and teaches the scientific method through stories in which Huckle Cat solve mysteries by examining evidence. Season one was directed by Ken Cunningham and produced by Christine Davis. Animation for season one was produced by Heli Digital inc. Post production was handled by Fearless films and Supersonics productions inc. Season one was the winner of the 2009 CFTPA award for best children's program, and nominated for the 2009 Pulcinella award for best preschool series at Italy’s prestigious \"Cartoons on the Bay\". Season two was directed by Larry Jacobs with post directing by Ken Cunningham and produced by Genna Du Plessis, and Audrey Velichka. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joanne Vannicola Catherine Disher Full Cast & Crew Last Season Season 2 2009 | 52 Episodes Season 2 of Busytown Mysteries premiered on November 14, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Busytown Mysteries. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cbc.ca/programguide/program/busytown_mysteries_dv Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors b 12 bandibacsi 3 Banana A 2 AnthonyAtkins232 CC 1 Chris Chiappa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}