{"link": "https://www.themoviedb.org/tv/66837?language=en", "title": "Lego Star Wars: The Freemaker Adventures", "resume": "Set between The Empire Strikes Back and Return of the Jedi, The Freemaker Adventures centers on a family of three young siblings—young boy Rowan, his sister Kordi, and their brother Zander—known as the Freemakers, who salvage parts from destroyed or damaged ships which they use to build new ones, which they sell in order to make their living. They are accompanied by their salvaged battle droid Roger.", "rate": 76, "genre": ["Animation"], "cast": ["Venessa Lengies", "Nicolas Cantu", "Eugene Byrd", "Matthew Wood", "Grey DeLisle"], "character": ["Kordi Freemaker (voice)", "Rowan Freemaker (voice)", "Zander Freemaker (voice)", "R0-GR \"Roger\"  (voice)", "Naare (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66837   Expand Lego Star Wars: The Freemaker Adventures   (2016) User Score  Play Trailer Overview Set between The Empire Strikes Back and Return of the Jedi, The Freemaker Adventures centers on a family of three young siblings—young boy Rowan, his sister Kordi, and their brother Zander—known as the Freemakers, who salvage parts from destroyed or damaged ships which they use to build new ones, which they sell in order to make their living. They are accompanied by their salvaged battle droid Roger. Featured Crew Bill Motz Creator Bob Roth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Venessa Lengies Kordi Freemaker (voice) Nicolas Cantu Rowan Freemaker (voice) Eugene Byrd Zander Freemaker (voice) Matthew Wood R0-GR \"Roger\"  (voice) Grey DeLisle Naare (voice) Full Cast & Crew Last Season Season 2 2017 | 13 Episodes Season 2 of Lego Star Wars: The Freemaker Adventures premiered on June 17, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Lego Star Wars: The Freemaker Adventures. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2009-01-23 Wolverine and the X-Men 7.0  Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage   http://disneyxd.disney.com/lego-star-wars-freemaker Genres Animation Keywords lego Content Score 100 Yes! Looking good! Top Contributors 31 ichigogreg S 23 Sithlord82 w 20 wayned42 D 10 Doramius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}