{"link": "https://www.themoviedb.org/tv/14261?language=en", "title": "Stagecoach West", "resume": "Stagecoach West is an American Western drama television series which ran for thirty-eight episodes on the ABC network from October 4, 1960, until June 27, 1961. Characters Luke Perry and Simon Kane operate the Timberland Stage Line from fictitious Outpost, Missouri to San Francisco, California. Simon's 15-year-old son, David \"Davey\" Kane, joins the two as they face stagecoach robbers, murderers, inclement weather, and human interest stories. Perry and Kane, who are both deputy U.S. marshals, had been on opposite sides of the American Civil War; Kane, a captain in the Union Army, while Perry had fought for the Confederate States of America. The one-hour black-and-white program was offered at 9 p.m. Eastern on Tuesdays opposite NBC's Thriller, hosted by Boris Karloff, and CBS's The Red Skelton Show.\nRogers became well-known a dozen years later on MAS*H, and Bray later portrayed the forest ranger Corey Stuart on Lassie from 1964–1969, both on CBS. Child actor Richard Eyer had starred in a number of films in the 1950s, including Friendly Persuasion and Desperate Hours.\nStagecoach West was produced by Dick Powell's Four Star Television. It is believed that the series was cancelled despite the high quality of its production because of the glut of westerns on television at the time that it aired. The same fate had fallen on CBS's Johnny Ringo, a 1959 one-season spin-off of Dick Powell's Zane Grey Theater.", "rate": 80, "genre": ["Western"], "cast": ["Wayne Rogers", "Robert Bray", "Richard Eyer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14261   Expand Stagecoach West   (1960) User Score Overview Stagecoach West is an American Western drama television series which ran for thirty-eight episodes on the ABC network from October 4, 1960, until June 27, 1961. Characters Luke Perry and Simon Kane operate the Timberland Stage Line from fictitious Outpost, Missouri to San Francisco, California. Simon's 15-year-old son, David \"Davey\" Kane, joins the two as they face stagecoach robbers, murderers, inclement weather, and human interest stories. Perry and Kane, who are both deputy U.S. marshals, had been on opposite sides of the American Civil War; Kane, a captain in the Union Army, while Perry had fought for the Confederate States of America. The one-hour black-and-white program was offered at 9 p.m. Eastern on Tuesdays opposite NBC's Thriller, hosted by Boris Karloff, and CBS's The Red Skelton Show. Rogers became well-known a dozen years later on M A S*H, and Bray later portrayed the forest ranger Corey Stuart on Lassie from 1964–1969, both on CBS. Child actor Richard Eyer had starred in a number of films in the 1950s, including Friendly Persuasion and Desperate Hours. Stagecoach West was produced by Dick Powell's Four Star Television. It is believed that the series was cancelled despite the high quality of its production because of the glut of westerns on television at the time that it aired. The same fate had fallen on CBS's Johnny Ringo, a 1959 one-season spin-off of Dick Powell's Zane Grey Theater. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wayne Rogers Robert Bray Richard Eyer Full Cast & Crew Last Season Season 1 1960 | 38 Episodes Season 1 of Stagecoach West premiered on October  4, 1960. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Stagecoach West. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}