{"link": "https://www.themoviedb.org/tv/70796?language=en", "title": "The Marvelous Mrs. Maisel", "resume": "It’s 1958 Manhattan and Miriam “Midge” Maisel has everything she’s ever wanted - the perfect husband, kids, and Upper West Side apartment. But when her life suddenly takes a turn and Midge must start over, she discovers a previously unknown talent - one that will take her all the way from the comedy clubs of Greenwich Village to a spot on Johnny Carson’s couch.", "rate": 77, "genre": ["Comedy", "Drama"], "cast": ["Rachel Brosnahan", "Alex Borstein", "Michael Zegen", "Tony Shalhoub", "Marin Hinkle"], "character": ["Miriam “Midge” Maisel", "Susie Myerson", "Joel Maisel", "Abe Weinberg", "Rose Weinberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70796   Expand The Marvelous Mrs. Maisel   (2017) User Score  Play Trailer Overview It’s 1958 Manhattan and Miriam “Midge” Maisel has everything she’s ever wanted - the perfect husband, kids, and Upper West Side apartment. But when her life suddenly takes a turn and Midge must start over, she discovers a previously unknown talent - one that will take her all the way from the comedy clubs of Greenwich Village to a spot on Johnny Carson’s couch. Featured Crew Amy Sherman-Palladino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel Brosnahan Miriam “Midge” Maisel Alex Borstein Susie Myerson Michael Zegen Joel Maisel Tony Shalhoub Abe Weinberg Marin Hinkle Rose Weinberg Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of The Marvelous Mrs. Maisel premiered on March 16, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I like it Open 2 by  MirrorMask Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  3 Recommendations   2016-06-07 Agatha Raisin 6.3    2016-10-09 Divorce 6.1    2015-08-05 Difficult People 7.4    2017-11-05 SMILF 6.7    2016-07-21 Fleabag 7.2    2016-10-19 HIM 6.2    2013-11-24 Getting On 6.8    2016-04-10 Dice 7.4  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  57m Homepage   https://www.amazon.com/dp/B06WPB59TM Genres Comedy Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 47 Elizabeth Jennings 23 matclou k 9 karina_petrova 5 Richard Findlay  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}