{"link": "https://www.themoviedb.org/tv/66124?language=en", "title": "That Life Is Mine", "resume": "Bahar and Efsun grow up as sisters even though they don't share the same blood. Their parents work under a rich man named Mehmet Emin. Later, he finds out that Efsun is his long-lost daughter. At least, that's what the parents of the girls tell him.", "rate": 50, "genre": ["Drama"], "cast": ["Ezgi Asaroğlu", "Ceren Moray Brun", "Didem Inselel", "Bahar Sahin", "Keremcem"], "character": ["Bahar Demirci", "Efsun Demirci", "Fulya Atahan", "Müge", "Ateş"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66124   Expand That Life Is Mine   (2014) User Score Overview Bahar and Efsun grow up as sisters even though they don't share the same blood. Their parents work under a rich man named Mehmet Emin. Later, he finds out that Efsun is his long-lost daughter. At least, that's what the parents of the girls tell him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ezgi Asaroğlu Bahar Demirci Ceren Moray Brun Efsun Demirci Didem Inselel Fulya Atahan Bahar Sahin Müge Keremcem Ateş Full Cast & Crew Last Season Season 1 2014 | 100 Episodes Season 1 of That Life Is Mine premiered on February 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on That Life Is Mine. You can help by rating TV shows you've seen. Facts Original Name  O Hayat Benim Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   http://www.fox.com.tr/O-Hayat-Benim Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 25 Maikkoum b 24 bluwy 2 markno275 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}