{"link": "https://www.themoviedb.org/tv/76375?language=en", "title": "Two You Project - Sugar Man", "resume": "Two teams battle while attempting to revamp an old song by a one-hit wonder who has since disappeared from the public eye.", "rate": 0, "genre": ["Talk"], "cast": ["Yoo Jae-suk", "You Hee-yeol", "Park Na-Rae", "Joy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76375   Expand Two You Project - Sugar Man   (2015) User Score Overview Two teams battle while attempting to revamp an old song by a one-hit wonder who has since disappeared from the public eye. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Jae-suk You Hee-yeol Park Na-Rae Joy Full Cast & Crew Current Season Season 2 2018 | 19 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Two You Project - Sugar Man. You can help by rating TV shows you've seen. Facts Original Name  투유 프로젝트 – 슈가맨 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  80m Homepage   http://tv.jtbc.joins.com/sugarman2 Genres Talk Keywords music Content Score 86 Almost there... Top Contributors 26 barto d 23 daphie k 5 ksj82519@gmail.com 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}