{"link": "https://www.themoviedb.org/tv/772?language=en", "title": "Footballers' Wives", "resume": "Footballers' Wives is a British television drama surrounding the fictional Premier League Association football club Earls Park F.C., its players, and their wives. It was broadcast on the ITV network from 8 January 2002 to 14 April 2006. The show began with a multi-lateral focus on a variety of different types of relationships explored; however, from the third series onward, the primary focus was on a complex love triangle between Tanya Turner, Amber Gates and Conrad Gates.", "rate": 68, "genre": ["Drama"], "cast": ["Laila Rouass", "Ben Richards", "Sarah Barrand", "Jamie Davis", "Gillian Taylforth"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 772   Expand Footballers' Wives   (2002) User Score Overview Footballers' Wives is a British television drama surrounding the fictional Premier League Association football club Earls Park F.C., its players, and their wives. It was broadcast on the ITV network from 8 January 2002 to 14 April 2006. The show began with a multi-lateral focus on a variety of different types of relationships explored; however, from the third series onward, the primary focus was on a complex love triangle between Tanya Turner, Amber Gates and Conrad Gates. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laila Rouass Ben Richards Sarah Barrand Jamie Davis Gillian Taylforth Full Cast & Crew Last Season Season 6 2006 | 1 Episode Season 6 of Footballers' Wives premiered on July 15, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Footballers' Wives. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords sex sport money glamour affair sports Content Score 86 Almost there... Top Contributors O 10 Ozbourne 10 Banana w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}