{"link": "https://www.themoviedb.org/tv/4244?language=en", "title": "Figure It Out", "resume": "Figure It Out is an American children's game show that airs on Nickelodeon. The original series, hosted by Summer Sanders, ran for four seasons from July 7, 1997 to January 12, 2000; the revival of the show began running on June 11, 2012 and is hosted by Jeff Sutphen.\nKids with special skills or unique achievements compete as contestants on the show while a panel of four Nick celebrities try to guess the predetermined phrase that describes the contestant's talent. The series is a loose adaptation of What's My Line? and I've Got a Secret, both established panel shows created by Mark Goodson and Bill Todman.\nShortly after the series aired its last first-run episode, Figure It Out began airing repeats on Nick GAS until the network ceased at the end of 2007. Its tagline is That Strain on the Brain. The series was originally recorded at Nickelodeon Studios at Universal Studios in Orlando, Florida. The revival episodes are filmed on stage 19 at Paramount Studios in Los Angeles.\nReruns of the Sanders-hosted series were among the shows carried on the now-defunct cable channel Nickelodeon Games and Sports for Kids; and also several episodes of the Sanders-hosted series have also aired as part of The '90s Are All That, a 1990s-oriented rerun block that airs on TeenNick, as the series aired on the block from August 3, 2012, to August 5, 2012.", "rate": 60, "genre": [], "cast": ["Adam Busch", "Alisa Reyes", "Arjay Smith", "Josh Server", "Kel Mitchell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4244   Expand Figure It Out   (1997) User Score Overview Figure It Out is an American children's game show that airs on Nickelodeon. The original series, hosted by Summer Sanders, ran for four seasons from July 7, 1997 to January 12, 2000; the revival of the show began running on June 11, 2012 and is hosted by Jeff Sutphen. Kids with special skills or unique achievements compete as contestants on the show while a panel of four Nick celebrities try to guess the predetermined phrase that describes the contestant's talent. The series is a loose adaptation of What's My Line? and I've Got a Secret, both established panel shows created by Mark Goodson and Bill Todman. Shortly after the series aired its last first-run episode, Figure It Out began airing repeats on Nick GAS until the network ceased at the end of 2007. Its tagline is That Strain on the Brain. The series was originally recorded at Nickelodeon Studios at Universal Studios in Orlando, Florida. The revival episodes are filmed on stage 19 at Paramount Studios in Los Angeles. Reruns of the Sanders-hosted series were among the shows carried on the now-defunct cable channel Nickelodeon Games and Sports for Kids; and also several episodes of the Sanders-hosted series have also aired as part of The '90s Are All That, a 1990s-oriented rerun block that airs on TeenNick, as the series aired on the block from August 3, 2012, to August 5, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Busch Alisa Reyes Arjay Smith Josh Server Kel Mitchell Full Cast & Crew Last Season Season 5 2012 | 30 Episodes Season 5 of Figure It Out premiered on October 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Figure It Out. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m, 24m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 1 kuzronk 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}