{"link": "https://www.themoviedb.org/tv/983?language=en", "title": "Department S", "resume": "Department S is a United Kingdom spy-fi adventure series produced by ITC Entertainment. The series consists of 28 episodes which originally aired in 1969–1970. It starred Peter Wyngarde as author Jason King, Joel Fabiani as Stewart Sullivan, and Rosemary Nicols as computer expert Annabelle Hurst. The trio were agents for a fictional special department of Interpol. The head of Department S was Sir Curtis Seretse.", "rate": 43, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Peter Wyngarde", "Rosemary Nicols", "Joel Fabiani", "Dennis Alaba Peters"], "character": ["Jason KIng", "Annabelle Hurst", "Stewart Sullivan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 983   Expand Department S   (1969) User Score Overview Department S is a United Kingdom spy-fi adventure series produced by ITC Entertainment. The series consists of 28 episodes which originally aired in 1969–1970. It starred Peter Wyngarde as author Jason King, Joel Fabiani as Stewart Sullivan, and Rosemary Nicols as computer expert Annabelle Hurst. The trio were agents for a fictional special department of Interpol. The head of Department S was Sir Curtis Seretse. Featured Crew Dennis Spooner Creator Monty Berman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Wyngarde Jason KIng Rosemary Nicols Annabelle Hurst Joel Fabiani Stewart Sullivan Dennis Alaba Peters Full Cast & Crew Last Season Season 1 1969 | 28 Episodes Season 1 of Department S premiered on September  9, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Department S. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 25 zurman1 8 zoltan140 S 6 Samara CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}