{"link": "https://www.themoviedb.org/tv/345?language=en", "title": "My Little Pony", "resume": "My Little Pony is an American animated television series produced by Marvel Productions and Sunbow Productions based on the My Little Pony toys released by Hasbro. The series featured as the first segment of a program called My Little Pony 'n Friends. The second segment would be an unrelated cartoon based on another Hasbro franchise - including The Glo Friends, MoonDreamers and the Potato Head Kids. The series debuted in September 15, 1986, a few months after the release of My Little Pony: The Movie, and ended in September 23, 1987. Two previous television specials were also edited into segments of My Little Pony 'n Friends: Rescue from Midnight Castle and Escape from Catrina.\nThe complete series of My Little Pony segments have been released on DVD in Regions 1 and 4. As of January 25, 2012, none of the other segments have been released on DVD.", "rate": 75, "genre": ["Animation"], "cast": ["Jennifer Darling", "David Mendenhall", "Mona Marshall", "Russi Taylor", "Nancy Cartwright"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 345   Expand My Little Pony   (1984) User Score Overview My Little Pony is an American animated television series produced by Marvel Productions and Sunbow Productions based on the My Little Pony toys released by Hasbro. The series featured as the first segment of a program called My Little Pony 'n Friends. The second segment would be an unrelated cartoon based on another Hasbro franchise - including The Glo Friends, MoonDreamers and the Potato Head Kids. The series debuted in September 15, 1986, a few months after the release of My Little Pony: The Movie, and ended in September 23, 1987. Two previous television specials were also edited into segments of My Little Pony 'n Friends: Rescue from Midnight Castle and Escape from Catrina. The complete series of My Little Pony segments have been released on DVD in Regions 1 and 4. As of January 25, 2012, none of the other segments have been released on DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Darling David Mendenhall Mona Marshall Russi Taylor Nancy Cartwright Full Cast & Crew Last Season Season 3 1984 | 27 Episodes Season 3 of My Little Pony premiered on April 14, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for My Little Pony. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Little Pony. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  15m, 30m Homepage  - Genres Animation Keywords friendship pony Content Score 86 Almost there... Top Contributors 9 Maikkoum d 2 docwho D 2 Daniel S 1 Starscream  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}