{"link": "https://www.themoviedb.org/tv/71315?language=en", "title": "Little Giants", "resume": "Shinichiro Kosaka is a detective of the major cases unit of the Tokyo Metropolitan Police and on the path to become captain of the unit when he makes a mistake during an investigation. Kosaka was subsequently demoted to precinct duty, where he finds his new colleagues taking on small cases tirelessly with a sense of justice untinged by workplace politics and internal disputes.", "rate": 80, "genre": ["Crime", "Drama"], "cast": ["Hiroki Hasegawa", "Masaki Okada", "Kyoko Yoshine", "Ken Yasuda", "Shota Shunputei"], "character": ["Shinichiro Kosaka", "Haruhiko Yamada", "Yuri Mishima", "Hisashi Watanabe", "Yohei Mikasa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71315   Expand Little Giants   (2017) User Score  Play Trailer Overview Shinichiro Kosaka is a detective of the major cases unit of the Tokyo Metropolitan Police and on the path to become captain of the unit when he makes a mistake during an investigation. Kosaka was subsequently demoted to precinct duty, where he finds his new colleagues taking on small cases tirelessly with a sense of justice untinged by workplace politics and internal disputes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroki Hasegawa Shinichiro Kosaka Masaki Okada Haruhiko Yamada Kyoko Yoshine Yuri Mishima Ken Yasuda Hisashi Watanabe Shota Shunputei Yohei Mikasa Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Little Giants premiered on April 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Little Giants. You can help by rating TV shows you've seen. Facts Original Name  小さな巨人 Status  In Production Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.tbs.co.jp/chiisanakyojin_tbs/ Genres Crime Drama Keywords police investigation Content Score 93 Almost there... Top Contributors 39 thirstyhippo w 3 woogoldsgreat TB 1 TMDb Bot 1 fmsonic  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}