{"link": "https://www.themoviedb.org/tv/28472?language=en", "title": "Mafiosa", "resume": "By the will of her dead uncle who was murdered Sandra Paoli is propelled to the head of a powerful mafia clan. She becomes a respected, but also hated, woman in a world of men, murder and criminality.", "rate": 70, "genre": ["Drama"], "cast": ["Hélène Fillières", "Véronique Volta", "Jean-Pierre Kalfon", "Linda Hardy", "Éric Fraticelli"], "character": ["Sandra Paoli", "Saudade", "Toussaint", "Livia", "Tony"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28472   Expand Mafiosa   (2006) User Score  Play Trailer Overview By the will of her dead uncle who was murdered Sandra Paoli is propelled to the head of a powerful mafia clan. She becomes a respected, but also hated, woman in a world of men, murder and criminality. Featured Crew Hugues Pagan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hélène Fillières Sandra Paoli Véronique Volta Saudade Jean-Pierre Kalfon Toussaint Linda Hardy Livia Éric Fraticelli Tony Full Cast & Crew Last Season Season 5 2014 | 8 Episodes Season 5 of Mafiosa premiered on April 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Mafiosa. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  52m Homepage  - Genres Drama Keywords mafia Content Score 100 Yes! Looking good! Top Contributors 111 rantamplan 7 EveDemocracy s 6 sheva_vitali 4 Julien Lefebvre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}