{"link": "https://www.themoviedb.org/tv/70?language=en", "title": "This Hour Has 22 Minutes", "resume": "This Hour Has 22 Minutes is a weekly Canadian television comedy that airs on CBC Television. Launched in 1993 during Canada's 35th general election, the show focuses on Canadian politics, combining news parody, sketch comedy and satirical editorials. Originally featuring Cathy Jones, Rick Mercer, Greg Thomey and Mary Walsh, the series featured satirical sketches of the weekly news and Canadian political events. The show's format is a mock news program, intercut with comic sketches, parody commercials and humorous interviews of public figures. The on-location segments are frequently filmed with slanted camera angles.\nIts full name is a parody of This Hour Has Seven Days, a CBC newsmagazine from the 1960s; the \"22 Minutes\" refers to the fact that a half-hour television program in Canada and the U.S. is typically 22 minutes long with eight minutes of commercials.\nJones and Walsh had previously worked together on the sketch comedy series CODCO, on which Thomey sometimes appeared as a guest. Mercer had been a notable young writer and performer on his own, touring several successful one-man shows of comedic political commentary.", "rate": 68, "genre": ["News", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70   Expand This Hour Has 22 Minutes   (2009) User Score  Play Trailer Overview This Hour Has 22 Minutes is a weekly Canadian television comedy that airs on CBC Television. Launched in 1993 during Canada's 35th general election, the show focuses on Canadian politics, combining news parody, sketch comedy and satirical editorials. Originally featuring Cathy Jones, Rick Mercer, Greg Thomey and Mary Walsh, the series featured satirical sketches of the weekly news and Canadian political events. The show's format is a mock news program, intercut with comic sketches, parody commercials and humorous interviews of public figures. The on-location segments are frequently filmed with slanted camera angles. Its full name is a parody of This Hour Has Seven Days, a CBC newsmagazine from the 1960s; the \"22 Minutes\" refers to the fact that a half-hour television program in Canada and the U.S. is typically 22 minutes long with eight minutes of commercials. Jones and Walsh had previously worked together on the sketch comedy series CODCO, on which Thomey sometimes appeared as a guest. Mercer had been a notable young writer and performer on his own, touring several successful one-man shows of comedic political commentary. Featured Crew Mary Walsh Creator Rick Mercer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 23 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on This Hour Has 22 Minutes. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.cbc.ca/22minutes Genres News Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 30 Marr 🇳🇱 z 10 zurman1 m 5 mario - 2 -Alexander-  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}