{"link": "https://www.themoviedb.org/tv/55397?language=en", "title": "Masha's tales", "resume": "Usmievavé dievčatko Máša, známa zo seriálu Máša a medveď (od r. 2010), vám prerozpráva rôzne populárne rozprávky. Bohužiaľ, niekedy sa pomýli a kadečo popletie, a tak vznikne úplne iný príbeh, než na ktorý ste boli zvyknutí. No a čo je najdôležitejšie, koniec príbehu so sebou vždy prináša morálne ponaučenie.", "rate": 0, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55397   Expand Masha's tales   (2012) User Score Overview Usmievavé dievčatko Máša, známa zo seriálu Máša a medveď (od r. 2010), vám prerozpráva rôzne populárne rozprávky. Bohužiaľ, niekedy sa pomýli a kadečo popletie, a tak vznikne úplne iný príbeh, než na ktorý ste boli zvyknutí. No a čo je najdôležitejšie, koniec príbehu so sebou vždy prináša morálne ponaučenie. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Husy - labute 2012 | 10 Episodes Season 2 of Masha's tales premiered on January  1, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Masha's tales. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Masha's tales. You can help by rating TV shows you've seen. Facts Original Name  Машины сказки Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Russian Runtime  - Homepage  - Genres Animation Kids Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 17 peter.bucan 10 Lord Vetinari 5 tkozyrski g 4 gpiotrek2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}