{"link": "https://www.themoviedb.org/tv/1856?language=en", "title": "Histeria!", "resume": "Histeria! is an American animated series created by Tom Ruegger and produced by Warner Bros. Animation. Unlike other animated series produced by Warner Bros. in the 1990s, Histeria! stood out as the most explicitly educational program in order to meet FCC requirements for educational/informational content for children.\nHisteria! was featured on Kids' WB from 1998 to 2000. Kids WB continued to air reruns until August 30, 2001. It was to be WB's most ambitious project since Animaniacs. Like the aforementioned, there were 65 episodes that were originally going to be made, but due to being $10 million over budget, only 52 episodes were completed before production of the series was canceled in November 1998. More recently, the show was featured on In2TV, first from March to July 2006, and then returning in October of that year. In January 2009, all of the episodes were taken off the site. No DVD set has yet been announced.\nHisteria! may have been influenced by 1978 French TV series Il était une fois l'homme. The French series featured the familiar series cast reappears as the contemporary figures of every historical time. Another possible influence is the 1988 miniseries This is America, Charlie Brown, which featured the cast of Peanuts interspersed within various events in American history.", "rate": 47, "genre": ["Animation", "Documentary", "Comedy"], "cast": ["Laraine Newman", "Jeff Bennett", "Frank Welker", "Maurice LaMarche", "Billy West"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1856   Expand Histeria!   (1998) User Score Overview Histeria! is an American animated series created by Tom Ruegger and produced by Warner Bros. Animation. Unlike other animated series produced by Warner Bros. in the 1990s, Histeria! stood out as the most explicitly educational program in order to meet FCC requirements for educational/informational content for children. Histeria! was featured on Kids' WB from 1998 to 2000. Kids WB continued to air reruns until August 30, 2001. It was to be WB's most ambitious project since Animaniacs. Like the aforementioned, there were 65 episodes that were originally going to be made, but due to being $10 million over budget, only 52 episodes were completed before production of the series was canceled in November 1998. More recently, the show was featured on In2TV, first from March to July 2006, and then returning in October of that year. In January 2009, all of the episodes were taken off the site. No DVD set has yet been announced. Histeria! may have been influenced by 1978 French TV series Il était une fois l'homme. The French series featured the familiar series cast reappears as the contemporary figures of every historical time. Another possible influence is the 1988 miniseries This is America, Charlie Brown, which featured the cast of Peanuts interspersed within various events in American history. Featured Crew Tom Ruegger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laraine Newman Jeff Bennett Frank Welker Maurice LaMarche Billy West Full Cast & Crew Last Season Season 2 2000 | 6 Episodes Season 2 of Histeria! premiered on July 17, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1990-09-14 Tiny Toon Adventures 7.3  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Documentary Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 3 speedycars TB 2 TMDb Bot 2 TheOneManBoxOffice A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}