{"link": "https://www.themoviedb.org/tv/79720?language=en", "title": "When Heroes Fly", "resume": "Eleven years after falling out, four friends, war veterans of a Special Forces unit, reunite for one final mission: to find Yaeli, a former lover of one of them and sister of another. Their journey will take them deep into the Colombian jungle but, as to succeed, first they must confront the trauma that tore them apart.", "rate": 0, "genre": ["Drama"], "cast": ["Tomer Kapon", "Moshe Ashkenazi", "Michael Aloni", "Nadav Nates", "Ninet Tayeb"], "character": ["Aviv Danino", "Yakir 'Benda' Ben-David", "Dotan 'Himler' Friedman", "Dov 'Dubi' Ashkenazi", "Yaeli Ashkenazi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79720   Expand When Heroes Fly   (2018) User Score Overview Eleven years after falling out, four friends, war veterans of a Special Forces unit, reunite for one final mission: to find Yaeli, a former lover of one of them and sister of another. Their journey will take them deep into the Colombian jungle but, as to succeed, first they must confront the trauma that tore them apart. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomer Kapon Aviv Danino Moshe Ashkenazi Yakir 'Benda' Ben-David Michael Aloni Dotan 'Himler' Friedman Nadav Nates Dov 'Dubi' Ashkenazi Ninet Tayeb Yaeli Ashkenazi Full Cast & Crew Current Season Season 1 2018 | 9 Episodes Season 1 of When Heroes Fly premiered on May 13, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on When Heroes Fly. You can help by rating TV shows you've seen. Facts Original Name  בשבילה גיבורים עפים Status  Returning Series Network Certification  - Type  Scripted Original Language  Hebrew Runtime  45m Homepage   https://www.mako.co.il/mako-vod-keshet/when_heroes_fly Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors AK 35 Avshalom Kor 5 Elizabeth Jennings g 5 guyly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}