{"link": "https://www.themoviedb.org/tv/74829?language=en", "title": "Just Between Lovers", "resume": "Lee Gang-Doo dreamed of becoming a soccer player, but an accident ended those dreams. His father died in the accident and he broke his leg. Lee Gang-Doo spent 3 years in rehab. Now, he doesn't have anything and just wastes his days. Lee Gang-Doo then meets Ha Moon-Soo.\nHa Moon-Soo makes architecture models. Ha Moon-Soo also endured an accident that killed her younger sibling. She has suffered from guilt that she survived. She has lived her life earnestly, while suppressing her feelings. After meeting Lee Gang-Doo, Ha Moon-Soo begins to express her hidden feelings.", "rate": 75, "genre": ["Drama"], "cast": ["Lee Jun-ho", "Won Jin-A", "Lee Ki-Woo", "Kang Han-Na", "Kim Hye-jun"], "character": ["Lee Gang-Doo", "Ha Moon-Soo", "Seo Joo-Won", "Jung Yoo-Jin", "Lee Jae-Young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74829   Expand Just Between Lovers   (2017) User Score Overview Lee Gang-Doo dreamed of becoming a soccer player, but an accident ended those dreams. His father died in the accident and he broke his leg. Lee Gang-Doo spent 3 years in rehab. Now, he doesn't have anything and just wastes his days. Lee Gang-Doo then meets Ha Moon-Soo. Ha Moon-Soo makes architecture models. Ha Moon-Soo also endured an accident that killed her younger sibling. She has suffered from guilt that she survived. She has lived her life earnestly, while suppressing her feelings. After meeting Lee Gang-Doo, Ha Moon-Soo begins to express her hidden feelings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jun-ho Lee Gang-Doo Won Jin-A Ha Moon-Soo Lee Ki-Woo Seo Joo-Won Kang Han-Na Jung Yoo-Jin Kim Hye-jun Lee Jae-Young Full Cast & Crew Current Season Season 1 2017 | 16 Episodes Season 1 of Just Between Lovers premiered on December 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2017-03-20 The Liar and His Lover 8.3    2017-10-11 Mad Dog 8.0    2017-11-11 Money Flower 8.0    2017-01-16 Introverted Boss 8.7    2017-10-09 Witch's Court 9.3    2017-03-25 Tunnel 6.6    2017-09-27 While You Were Sleeping 9.0    2017-05-29 My Sassy Girl 8.3  Facts Original Name  그냥 사랑하는 사이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  72m Homepage   http://tv.jtbc.joins.com/rainshine Genres Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 57 Maria180493 6 andermairena b 4 boudhum 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}