{"link": "https://www.themoviedb.org/tv/34201?language=en", "title": "Eden's Bowy", "resume": "Eden's Bowy is manga series written and illustrated by Kitsune Tennouji. It was originally published in the magazine Comptiq, but it soon moved to Shōnen Ace after the latter publication's creation in 1994. Eden's Bowy was adapted into a 26-episode anime series by Studio Deen in 1999.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Action", "Adventure"], "cast": ["Chiaki Kuriyama", "Kappei Yamaguchi", "Ken Narita", "Yuko Nagashima", "Yuko Nagashima"], "character": ["Konyako Persia", "Jorrne", "Wietoo", "Fennis", "Jorrne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34201   Expand Eden's Bowy   (1999) User Score Overview Eden's Bowy is manga series written and illustrated by Kitsune Tennouji. It was originally published in the magazine Comptiq, but it soon moved to Shōnen Ace after the latter publication's creation in 1994. Eden's Bowy was adapted into a 26-episode anime series by Studio Deen in 1999. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chiaki Kuriyama Konyako Persia Kappei Yamaguchi Jorrne Ken Narita Wietoo Yuko Nagashima Fennis Yuko Nagashima Jorrne Full Cast & Crew Last Season Season 1 1999 | 26 Episodes Season 1 of Eden's Bowy premiered on April  6, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Eden's Bowy. You can help by rating TV shows you've seen. Facts Original Name  エデンズボゥイ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 BrerFox R 3 Rebecca m 3 magoozin n 2 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}