{"link": "https://www.themoviedb.org/tv/58812?language=en", "title": "Serangoon Road", "resume": "1964-65. Singapore is a city at a crossroads. Political and racial tensions are at fever pitch as the British pull out, and a new nation is about to be born. The lights of Bugis Street have never burned so bright: bootleg copies of Motown songs boom out from street stalls; the Rolling Stones are in town along with tourists and American sailors fresh from Vietnam. They join British and Australian soldiers checking out the prostitutes and gambling dens en route to their own war in Borneo.\nThis is the city of Sam Callaghan, Patricia Cheng, the CIA’s Conrad Harrison and the clients of the Cheng Detective Agency. The agency’s cases range from the usual (straying spouses and petty fraudsters) to events with international implications and complications. Sam’s contacts from his military days are useful - but they start to drag him back into a dark world that he would prefer to leave behind.", "rate": 65, "genre": ["Drama"], "cast": ["Don Hany", "Joan Chen", "Maeve Dermody", "Alaric Tay", "Michael Dorman"], "character": ["Sam Callaghan", "Patricia Cheng", "Claire Simpson", "Kang", "Conrad Harrison"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58812   Expand Serangoon Road   (2013) User Score  Play Trailer Overview 1964-65. Singapore is a city at a crossroads. Political and racial tensions are at fever pitch as the British pull out, and a new nation is about to be born. The lights of Bugis Street have never burned so bright: bootleg copies of Motown songs boom out from street stalls; the Rolling Stones are in town along with tourists and American sailors fresh from Vietnam. They join British and Australian soldiers checking out the prostitutes and gambling dens en route to their own war in Borneo. This is the city of Sam Callaghan, Patricia Cheng, the CIA’s Conrad Harrison and the clients of the Cheng Detective Agency. The agency’s cases range from the usual (straying spouses and petty fraudsters) to events with international implications and complications. Sam’s contacts from his military days are useful - but they start to drag him back into a dark world that he would prefer to leave behind. Featured Crew Paul D. Barron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Hany Sam Callaghan Joan Chen Patricia Cheng Maeve Dermody Claire Simpson Alaric Tay Kang Michael Dorman Conrad Harrison Full Cast & Crew Last Season Series 1 2013 | 10 Episodes Season 1 of Serangoon Road premiered on September 22, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Serangoon Road. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  53m Homepage   http://hboasia.com/HBO/en-sg/shows/serangoon-road/ Genres Drama Keywords singapore private detective 1960s Content Score 100 Yes! Looking good! Top Contributors 42 United600 s 5 speedycars TB 3 TMDb Bot 3 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}