{"link": "https://www.themoviedb.org/tv/71871?language=en", "title": "The Best Hit", "resume": "Yoo Hyun-Jae is a member of a popular idol group. He has a lot of fans and he is a scandal maker. Meanwhile, Lee Ji-Hoon is an aspiring singer. He pretends to be studying for his civil servant exam, but he is actually struggling to become an idol.", "rate": 70, "genre": [], "cast": ["Yoon Shi-Yoon", "Kim Min-jae", "Lee Se-young", "Cha Tae-hyun", "Yoon Son-ha"], "character": ["Yoo Hyun-Jae", "Lee Ji-Hoon", "Choi Woo-Seung", "Lee Gwang-Jae", "Hong Bo-Hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71871   Expand The Best Hit   (2017) User Score Overview Yoo Hyun-Jae is a member of a popular idol group. He has a lot of fans and he is a scandal maker. Meanwhile, Lee Ji-Hoon is an aspiring singer. He pretends to be studying for his civil servant exam, but he is actually struggling to become an idol. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Shi-Yoon Yoo Hyun-Jae Kim Min-jae Lee Ji-Hoon Lee Se-young Choi Woo-Seung Cha Tae-hyun Lee Gwang-Jae Yoon Son-ha Hong Bo-Hee Full Cast & Crew Last Season Season 1 2017 | 32 Episodes Season 1 of The Best Hit premiered on June  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2017-04-15 Band of Sisters 8.5    2006-01-11 Princess Hours 6.7    2017-04-21 Man to Man 7.2  Facts Original Name  최고의 한방 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/bestpunch/index.html Genres No genres have been added. Keywords music romance korea youth Content Score 79 Pump it up! We're close now. Top Contributors M 33 Maria180493 6 Elizabeth Jennings 5 Hillja 4 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}