{"link": "https://www.themoviedb.org/tv/65536?language=en", "title": "The Embassy", "resume": "Luis Salinas, the new ambassador to Thailand, who knows he's going to get his hands dirty in the next four years – if he makes it that long. He's accompanied by his wife, Claudia, and their daughter Ester. Aware that the familiar constellation of life in the embassy is about to change radically, the staff gear up in nervous anticipation. Life does change, but in a way that Luis would never have imagined it. He must not only cope with the chaos and corruption he was expecting, but also with the implosion of his family life, as Claudia and Ester become involved in affairs that might seriously damage relations between Spain and Thailand. Will the glamorous, globe-trotting diplomatic life swallow up Luis or will he continue to fight for integrity and morals?", "rate": 75, "genre": ["Drama", "War", "Politics"], "cast": ["Abel Folk", "Belén Rueda", "Úrsula Corberó", "Raúl Arévalo", "Chino Darín"], "character": ["Luis Salinas", "Claudia", "Ester", "Eduardo", "Carlos"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65536   Expand The Embassy   (2016) User Score Overview Luis Salinas, the new ambassador to Thailand, who knows he's going to get his hands dirty in the next four years – if he makes it that long. He's accompanied by his wife, Claudia, and their daughter Ester. Aware that the familiar constellation of life in the embassy is about to change radically, the staff gear up in nervous anticipation. Life does change, but in a way that Luis would never have imagined it. He must not only cope with the chaos and corruption he was expecting, but also with the implosion of his family life, as Claudia and Ester become involved in affairs that might seriously damage relations between Spain and Thailand. Will the glamorous, globe-trotting diplomatic life swallow up Luis or will he continue to fight for integrity and morals?            Featured Crew Gema R. Neira Creator Ramón Campos Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Abel Folk Luis Salinas Belén Rueda Claudia Úrsula Corberó Ester Raúl Arévalo Eduardo Chino Darín Carlos Full Cast & Crew Last Season Season 1 2016 | 11 Episodes Season 1 of The Embassy premiered on April 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2011-04-17 Game of Thrones 8.2  Facts Original Name  La embajada Status  Cancelled Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  70m Homepage   http://www.antena3.com/series/la-embajada/ Genres Drama War & Politics Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 33 prm96 9 stego77 6 EveDemocracy z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}