{"link": "https://www.themoviedb.org/tv/79058?language=en", "title": "Hana Nochi Hare: HanaDan Next Season", "resume": "The setting of the drama takes place 10 years after the F4 graduated from Eitoku Academy. Edogawa Oto is the daughter of a former company president. Her life completely changed after their family business went bankrupt. Her fiance is Hase Tenma, the popular student council president of the rival school. With declining enrollment due to a recession and the rise of a rival school, Eitoku Academy is now ruled by the Correct5 whose leader is Kakuragi Haruto. The group seeks out, then runs out, any students whose families haven’t made appropriate donations to the school. When Haruto and Oto discover each other’s secrets — that Haruto buys self-help items to get stronger, and that Oto is poor and works at a convenience store – they promise to keep each other’s secret.", "rate": 80, "genre": ["Drama", "Drama"], "cast": ["Hana Sugisaki", "Sho Hirano", "Taishi Nakagawa", "Tatsuomi Hamada"], "character": ["Oto Edogawa", "Haruto Kaguragi", "Tenma Hase", "Kaito Taira"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79058   Expand Hana Nochi Hare: HanaDan Next Season   (2018) User Score Overview The setting of the drama takes place 10 years after the F4 graduated from Eitoku Academy. Edogawa Oto is the daughter of a former company president. Her life completely changed after their family business went bankrupt. Her fiance is Hase Tenma, the popular student council president of the rival school. With declining enrollment due to a recession and the rise of a rival school, Eitoku Academy is now ruled by the Correct5 whose leader is Kakuragi Haruto. The group seeks out, then runs out, any students whose families haven’t made appropriate donations to the school. When Haruto and Oto discover each other’s secrets — that Haruto buys self-help items to get stronger, and that Oto is poor and works at a convenience store – they promise to keep each other’s secret. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hana Sugisaki Oto Edogawa Sho Hirano Haruto Kaguragi Taishi Nakagawa Tenma Hase Tatsuomi Hamada Kaito Taira Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Hana Nochi Hare: HanaDan Next Season premiered on April 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hana Nochi Hare: HanaDan Next Season. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Drama Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 36 NOSoba 4 galactica_j A 3 Aka75 3 azngtx2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}