{"link": "https://www.themoviedb.org/tv/34631?language=en", "title": "Real Romance Love Letter", "resume": "Real Romance Love Letter was a South Korean television game show broadcast from 16 October 2004 to 28 October 2006 for three seasons. It was part of the line-up of programme for Real Situation Saturday which was broadcast from 8 November 2003 to 5 January 2007 on SBS network.\nThe programme was hosted by Kang Ho Dong and it featured male and female contestants competing for \"each other\" in romance games. For example guests have to dance in order to impress the person they are after. Contestants were artists, actors, models, comedians, and MCs of the South Korean entertainment industry.", "rate": 80, "genre": ["Comedy"], "cast": ["Kang Ho-dong"], "character": ["MC"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34631   Expand Real Romance Love Letter   (2004) User Score Overview Real Romance Love Letter was a South Korean television game show broadcast from 16 October 2004 to 28 October 2006 for three seasons. It was part of the line-up of programme for Real Situation Saturday which was broadcast from 8 November 2003 to 5 January 2007 on SBS network. The programme was hosted by Kang Ho Dong and it featured male and female contestants competing for \"each other\" in romance games. For example guests have to dance in order to impress the person they are after. Contestants were artists, actors, models, comedians, and MCs of the South Korean entertainment industry. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Ho-dong MC Full Cast & Crew Last Season Season 3 2006 | 23 Episodes Season 3 of Real Romance Love Letter premiered on May 27, 2006. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Real Romance Love Letter. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Real Romance Love Letter. You can help by rating TV shows you've seen. Facts Original Name  리얼 로망스 연애편지 Status  Ended Network Certification  - Type  Reality Original Language  Korean Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors t 28 tmdb983464 s 3 sheva_vitali 2 lineker A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}