{"link": "https://www.themoviedb.org/tv/62511?language=en", "title": "Who Are You: School 2015", "resume": "Set at a prestigious private high school in Gangnam, Seoul, South Korea. Eun-Byeol is a popular student at the private high school. She goes missing and returns, but she has lost her memory. She tries to find out the truth.", "rate": 68, "genre": ["Drama", "Mystery", "Romance"], "cast": ["Kim So-hyun", "Nam Joo-hyuk", "Yook Sung-jae", "Lee Cho-hee", "Jeon No-min"], "character": ["Lee Eun-bi / Go Eun-byul", "Han Yi-ahn", "Gong Tae-kwang", "Lee Shi-jin", "Gong Jae-ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62511   Expand Who Are You: School 2015   (2015) User Score Overview Set at a prestigious private high school in Gangnam, Seoul, South Korea. Eun-Byeol is a popular student at the private high school. She goes missing and returns, but she has lost her memory. She tries to find out the truth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim So-hyun Lee Eun-bi / Go Eun-byul Nam Joo-hyuk Han Yi-ahn Yook Sung-jae Gong Tae-kwang Lee Cho-hee Lee Shi-jin Jeon No-min Gong Jae-ho Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Who Are You: School 2015 premiered on April 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Who Are You: School 2015. You can help by rating TV shows you've seen. Facts Original Name  후아유 - 학교 2015 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/school2015 Genres Drama Mystery Romance Keywords korea school Content Score 93 Almost there... Top Contributors M 62 Maria180493 t 10 tmdb38202327 z 5 zurman1 4 refresh_daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}