{"link": "https://www.themoviedb.org/tv/63842?language=en", "title": "Olmos y Robles", "resume": "Olmos is a corporal of the Civil Guard's Public Order and Prevention service who works in the station of his birthplace, Ezcaray, a small town in La Rioja. Robles is a lieutenant of the Rapid Reaction Group, one of the most prestigious units of the Civil Guard, an urban and modern officer. They see themselves forced to work together if they want to solve the international case which, as luck would have it, has united them in this town in La Rioja. They are polar opposites, but together they make up a great team.", "rate": 0, "genre": ["Comedy"], "cast": ["Rubén Cortada", "Pepe Viyuela", "Enrique Villén", "Alex O'Dogherty", "Pilar Castro"], "character": ["Agustín Robles", "Sebastián Olmos", "Gregorio Atiza", "Damián Navarro", "Isabel \"Isa\" Antúnez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63842   Expand Olmos y Robles   (2015) User Score Overview Olmos is a corporal of the Civil Guard's Public Order and Prevention service who works in the station of his birthplace, Ezcaray, a small town in La Rioja. Robles is a lieutenant of the Rapid Reaction Group, one of the most prestigious units of the Civil Guard, an urban and modern officer. They see themselves forced to work together if they want to solve the international case which, as luck would have it, has united them in this town in La Rioja. They are polar opposites, but together they make up a great team. Featured Crew Carlos Martín Creator Jorge Lara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rubén Cortada Agustín Robles Pepe Viyuela Sebastián Olmos Enrique Villén Gregorio Atiza Alex O'Dogherty Damián Navarro Pilar Castro Isabel \"Isa\" Antúnez Full Cast & Crew Last Season Season 2 2016 | 10 Episodes Season 2 of Olmos y Robles premiered on September 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Olmos y Robles. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  70m Homepage   http://www.rtve.es/olmosyrobles Genres Comedy Keywords españa policia Content Score 93 Almost there... Top Contributors 45 prm96 36 United600 17 danichispa 16 cucuxenxo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}