{"link": "https://www.themoviedb.org/tv/4563?language=en", "title": "Never the Twain", "resume": "Never the Twain is a British sitcom that ran for eleven series from 7 September 1981 to 9 October 1991. It was created by Johnnie Mortimer, and was the only sitcom he ever created without his usual writing partner, Brian Cooke. Mortimer wrote the entirety of the first two series and four episodes out of six of the eighth, with the rest being mainly written by Vince Powell and John Kane.\nIt starred Windsor Davies and Donald Sinden as rival antique dealers, and also starred Robin Kermode, Julia Watson, Honor Blackman, Teddy Turner, Derek Deadman, Maria Charles and Zara Nutley.\nIt was made by Thames Television for the ITV network. Since it finished, it has been repeated a few times on satellite television: first on UK Gold and later on ITV3.\nThe title is taken from the Rudyard Kipling poem; The Ballad of East and West.", "rate": 60, "genre": ["Comedy"], "cast": ["Donald Sinden", "Teddy Turner", "Windsor Davies", "Maria Charles", "Gordon Peters"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4563   Expand Never the Twain   (1981) User Score Overview Never the Twain is a British sitcom that ran for eleven series from 7 September 1981 to 9 October 1991. It was created by Johnnie Mortimer, and was the only sitcom he ever created without his usual writing partner, Brian Cooke. Mortimer wrote the entirety of the first two series and four episodes out of six of the eighth, with the rest being mainly written by Vince Powell and John Kane. It starred Windsor Davies and Donald Sinden as rival antique dealers, and also starred Robin Kermode, Julia Watson, Honor Blackman, Teddy Turner, Derek Deadman, Maria Charles and Zara Nutley. It was made by Thames Television for the ITV network. Since it finished, it has been repeated a few times on satellite television: first on UK Gold and later on ITV3. The title is taken from the Rudyard Kipling poem; The Ballad of East and West. Featured Crew Johnnie Mortimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Donald Sinden Teddy Turner Windsor Davies Maria Charles Gordon Peters Full Cast & Crew Last Season Season 11 1991 | 6 Episodes Season 11 of Never the Twain premiered on September  4, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Never the Twain. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords rivalry feud sitcom british humour businessman Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}