{"link": "https://www.themoviedb.org/tv/77341?language=en", "title": "Enemigo íntimo", "resume": "The story of two siblings who witness the murder of their parents in the hands of one of the drug cartels in Mexico, after which Alejandro Ferrer's younger sister is kidnapped. 25 years later, Alejandro is now the captain of the Federal Police and seeks revenge against the narcos for destroying his family.", "rate": 90, "genre": ["Action", "Adventure"], "cast": ["Matías Novoa", "Fernanda Castillo", "Raúl Méndez", "Leonardo Daniel", "Alejandro Speitzer"], "character": ["Daniel Laborde", "Roxana Rodiles", "Alejandro Ferrer", "Comandante David Gómez", "Luis Rendón 'El Berebere'"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77341   Expand Enemigo íntimo   (2018) User Score Overview The story of two siblings who witness the murder of their parents in the hands of one of the drug cartels in Mexico, after which Alejandro Ferrer's younger sister is kidnapped. 25 years later, Alejandro is now the captain of the Federal Police and seeks revenge against the narcos for destroying his family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matías Novoa Daniel Laborde Fernanda Castillo Roxana Rodiles Raúl Méndez Alejandro Ferrer Leonardo Daniel Comandante David Gómez Alejandro Speitzer Luis Rendón 'El Berebere' Full Cast & Crew Current Season Season 1 2018 | 44 Episodes Season 1 of Enemigo íntimo premiered on February 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Enemigo íntimo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://www.telemundo.com/super-series/enemigo-intimo Genres Action & Adventure Keywords telenovela Content Score 93 Almost there... Top Contributors 22 O2 15 dhanny 13 Elizabeth Jennings z 5 zerox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}