{"link": "https://www.themoviedb.org/tv/65927?language=en", "title": "Dr. Oakley, Yukon Vet", "resume": "Spanning thousands of acres and incorporating hundreds of species of animals; Michelle Oakley’s veterinary practice is Yukon tough. There is no such thing as a typical day in Michelle’s practice. House calls can range from expelling dogs anal glands to getting chased down by the very large Arctic musk-ox. Accompanied by her teenage daughters and armed with humor as sharp as scalpel, Michelle deftly juggles being a full time Veterinarian, wife and doctor; taking us into unexplored and unexamined regions of the Yukon.", "rate": 20, "genre": ["Reality"], "cast": ["Michelle Oakley"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65927   Expand Dr. Oakley, Yukon Vet   (2014) User Score Overview Spanning thousands of acres and incorporating hundreds of species of animals; Michelle Oakley’s veterinary practice is Yukon tough. There is no such thing as a typical day in Michelle’s practice. House calls can range from expelling dogs anal glands to getting chased down by the very large Arctic musk-ox. Accompanied by her teenage daughters and armed with humor as sharp as scalpel, Michelle deftly juggles being a full time Veterinarian, wife and doctor; taking us into unexplored and unexamined regions of the Yukon. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Oakley Herself Full Cast & Crew Current Season Season 5 2017 | 4 Episodes Season 5 of Dr. Oakley, Yukon Vet premiered on October 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Dr. Oakley, Yukon Vet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  - Homepage   http://channel.nationalgeographic.com/wild/dr-oakley-yukon-vet/ Genres Reality Keywords veterinarian yukon Content Score 56 We're so close, yet so far. Top Contributors 42 Elizabeth Jennings H 11 HBO A 2 Aukland  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}