{"link": "https://www.themoviedb.org/tv/347?language=en", "title": "Ultimate Force", "resume": "Ultimate Force is a British television drama series that was shown on ITV, which deals with the activities of the fictional Red Troop of the SAS. The programme started on 16 September 2002 and four series were produced.", "rate": 69, "genre": ["Drama", "Action", "Adventure"], "cast": ["Ross Kemp", "Miles Anderson", "Christopher Fox", "Alex Reid", "Danny Sapani"], "character": ["Henry Garvie", "Aidan Dempsey", "Louis Hoffman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 347   Expand Ultimate Force   (2002) User Score Overview Ultimate Force is a British television drama series that was shown on ITV, which deals with the activities of the fictional Red Troop of the SAS. The programme started on 16 September 2002 and four series were produced. Featured Crew Chris Ryan Creator Rob Heyland Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ross Kemp Henry Garvie Miles Anderson Aidan Dempsey Christopher Fox Louis Hoffman Alex Reid Danny Sapani Full Cast & Crew Last Season Season 4 2006 | 5 Episodes Season 4 of Ultimate Force premiered on April 29, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ultimate Force. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  70m Homepage   - Genres Drama Action & Adventure Keywords england british army special forces military Content Score 93 Almost there... Top Contributors l 11 longwoo 9 Banana s 4 speedycars 4 LookinGood  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}