{"link": "https://www.themoviedb.org/tv/65553?language=en", "title": "Crowded", "resume": "No more sex, booze and paying the bills naked. After 20 years of parenting, empty nesters Mike and Martina are finally reclaiming their wild side. But when both of their two grown daughters unexpectedly move back in and Mike's parents scratch their plans to spend their golden years in Florida, their roost is full again. This new (and very timely) family comedy proves that life is crazy with a full house, especially the second time around.", "rate": 65, "genre": ["Comedy"], "cast": ["Patrick Warburton", "Carrie Preston", "Miranda Cosgrove", "Mia Serafino", "Stacy Keach"], "character": ["Mike Moore", "Martina Moore", "Shea Moore", "Stella Moore", "Bob Moore"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65553   Expand Crowded   (2016) User Score Overview No more sex, booze and paying the bills naked. After 20 years of parenting, empty nesters Mike and Martina are finally reclaiming their wild side. But when both of their two grown daughters unexpectedly move back in and Mike's parents scratch their plans to spend their golden years in Florida, their roost is full again. This new (and very timely) family comedy proves that life is crazy with a full house, especially the second time around. Featured Crew Suzanne Martin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Warburton Mike Moore Carrie Preston Martina Moore Miranda Cosgrove Shea Moore Mia Serafino Stella Moore Stacy Keach Bob Moore Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Crowded premiered on March 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2015-01-13 Cockroaches 6.0    2015-04-08 Your Family or Mine 4.6    2010-03-14 Sons of Tucson 7.0    2016-01-07 Angel from Hell 6.1    2015-02-19 The Odd Couple 5.4    2015-09-29 The Grinder 6.6    2016-02-18 Join or Die with Craig Ferguson 8.3    2016-01-13 Teachers 7.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/crowded Genres Comedy Keywords family sitcom Content Score 93 Almost there... Top Contributors 30 United600 30 Elizabeth Jennings 10 Maretoh 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}