{"link": "https://www.themoviedb.org/tv/78457?language=en", "title": "Wotakoi: Love is Hard for Otaku", "resume": "After discovering that they work at the same company, a gaming crazed otaku and a fujoshi reunite for the first time since middle school. After some post-work drinking sessions they begin dating, but will it be a perfect relationship for the two?", "rate": 90, "genre": ["Comedy", "Animation"], "cast": ["Itou Kento", "Arisa Date", "Tomokazu Sugita", "Miyuki Sawashiro", "Yuuki Kaji"], "character": ["Hirotaka Nifuji (Voice)", "Narumi Momose (Voice)", "Tarou Kabakura (Voice)", "Hanako Koyanagi (Voice)", "Naoya Nifuji (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78457   Expand Wotakoi: Love is Hard for Otaku   (2018) User Score Overview After discovering that they work at the same company, a gaming crazed otaku and a fujoshi reunite for the first time since middle school. After some post-work drinking sessions they begin dating, but will it be a perfect relationship for the two? Featured Crew Fujita Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Itou Kento Hirotaka Nifuji (Voice) Arisa Date Narumi Momose (Voice) Tomokazu Sugita Tarou Kabakura (Voice) Miyuki Sawashiro Hanako Koyanagi (Voice) Yuuki Kaji Naoya Nifuji (Voice) Full Cast & Crew Current Season Season 1 2018 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Wotakoi: Love is Hard for Otaku. You can help by rating TV shows you've seen. Facts Original Name  ヲタクに恋は難しい Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://wotakoi-anime.com/ Genres Comedy Animation Keywords romance based on manga noitamina josei Content Score 93 Almost there... Top Contributors 38 neonime 16 sp1ti 15 Elizabeth Jennings 5 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}