{"link": "https://www.themoviedb.org/tv/56484?language=en", "title": "Death Comes to Pemberley", "resume": "Adaptation of PD James's bestselling homage to Pride and Prejudice. Elizabeth and Darcy, now six years married, are preparing for their annual ball when festivities are brought to an abrupt halt.", "rate": 68, "genre": ["Drama", "Mystery"], "cast": ["Matthew Rhys", "Anna Maxwell Martin", "Matthew Goode", "Trevor Eve", "Jenna Coleman"], "character": ["Fitzwilliam Darcy", "Elizabeth Darcy", "George Wickham", "Sir Selwyn Hardcastle", "Lydia Wickham"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56484   Expand Death Comes to Pemberley   (2013) User Score  Play Trailer Overview Adaptation of PD James's bestselling homage to Pride and Prejudice. Elizabeth and Darcy, now six years married, are preparing for their annual ball when festivities are brought to an abrupt halt. Featured Crew Ben Stephenson Creator Danny Cohen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Rhys Fitzwilliam Darcy Anna Maxwell Martin Elizabeth Darcy Matthew Goode George Wickham Trevor Eve Sir Selwyn Hardcastle Jenna Coleman Lydia Wickham Full Cast & Crew Last Season Season 1 2013 | 3 Episodes Season 1 of Death Comes to Pemberley premiered on December 26, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2008-09-03 Lost in Austen 7.2    2009-10-04 Emma 7.7    2008-01-01 Sense and Sensibility 7.7    2008-01-13 Lark Rise to Candleford 7.3    2012-09-25 The Paradise 6.8    2002-11-23 Daniel Deronda 7.2    2012-09-06 The Bletchley Circle 7.8    2008-09-14 Tess of the D'Urbervilles 7.4  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Miniseries Original Language  English Runtime  180m Homepage   http://www.bbc.co.uk/programmes/p01mqkm5 Genres Drama Mystery Keywords england servant sequel derbyshire miniseries period drama housekeeper estate gentleman costume drama murder mystery drawing room upstairs downstairs 19th century empire fashion regency period Content Score 100 Yes! Looking good! Top Contributors TB 52 TMDb Bot 15 Steve 10 Elizabeth Jennings CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}