{"link": "https://www.themoviedb.org/tv/727?language=en", "title": "Return to Eden", "resume": "Stephanie Harper is rich but insecure 40 year old heiress with two failed marriages behind her. Stephanie believes that she has found true love with tennis pro Greg Marsden, but after the wedding, Greg promptly begins an affair with Stephanie’s best friend Jilly Stewart. Whilst on their honeymoon, Greg pushes Stephanie into a crocodile-infested swamp, and he and Jilly watch as she is apparently mauled to death. However, Stephanie miraculously survives and goes to an island clinic where she meets Dr. Dan Marshall, a brilliant plastic surgeon who uses his talents to repair her face and body. Using her new identity and fortune, she plots her revenge on Greg and Jilly and aims to take back what is rightfully hers.", "rate": 0, "genre": ["Soap", "Drama"], "cast": ["Daniel Abineri", "Peta Toppano", "Rebecca Gilling", "Megan Williams", "Peter Cousens"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 727   Expand Return to Eden   (1983) User Score Overview Stephanie Harper is rich but insecure 40 year old heiress with two failed marriages behind her. Stephanie believes that she has found true love with tennis pro Greg Marsden, but after the wedding, Greg promptly begins an affair with Stephanie’s best friend Jilly Stewart. Whilst on their honeymoon, Greg pushes Stephanie into a crocodile-infested swamp, and he and Jilly watch as she is apparently mauled to death. However, Stephanie miraculously survives and goes to an island clinic where she meets Dr. Dan Marshall, a brilliant plastic surgeon who uses his talents to repair her face and body. Using her new identity and fortune, she plots her revenge on Greg and Jilly and aims to take back what is rightfully hers. Featured Crew Michael Laurence Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel Abineri Peta Toppano Rebecca Gilling Megan Williams Peter Cousens Full Cast & Crew Last Season Season 2 1986 | 22 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Return to Eden. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Return to Eden. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Scripted Original Language  English Runtime  60m, 90m Homepage  - Genres Soap Drama Keywords revenge soap opera Content Score 93 Almost there... Top Contributors 20 Banana 14 neyura i 4 ismax935 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}