{"link": "https://www.themoviedb.org/tv/1463?language=en", "title": "The Adventures of Brisco County, Jr.", "resume": "A tough-as-rawhide cowpoke, debonair ladies' man and Harvard-educated smarty-britches roams from Frisco to Jalisco in pursuit of outlaws who killed his father...and in search of a mysterious orb possessing out-of-this world powers. Hot lead and cool anachronisms await Brisco as he and his sidekicks - including Comet, the intellectual equine who doesn't know he's a horse - fight for justice in the way, way, way-out West.", "rate": 76, "genre": ["Western", "Comedy", "Action", "Adventure"], "cast": ["Bruce Campbell", "Julius Carry", "Christian Clemenson"], "character": ["Brisco County, Jr."], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1463   Expand The Adventures of Brisco County, Jr.   (1993) User Score Overview A tough-as-rawhide cowpoke, debonair ladies' man and Harvard-educated smarty-britches roams from Frisco to Jalisco in pursuit of outlaws who killed his father...and in search of a mysterious orb possessing out-of-this world powers. Hot lead and cool anachronisms await Brisco as he and his sidekicks - including Comet, the intellectual equine who doesn't know he's a horse - fight for justice in the way, way, way-out West. Featured Crew Jeffrey Boam Creator Carlton Cuse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce Campbell Brisco County, Jr. Julius Carry Christian Clemenson Full Cast & Crew Last Season Season 1 1993 | 27 Episodes Season 1 of The Adventures of Brisco County, Jr. premiered on August 27, 1993. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply some shows just dont need a second season. Open 0 by StonerWithaBoner\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   1991-02-25 The Pirates of Dark Water 6.8    2006-08-07 Gene Simmons Family Jewels 4.4    1972-09-09 Fat Albert and the Cosby Kids 8.0    1989-09-18 Alien Nation 6.9    2000-01-17 Jack of All Trades 7.7    1986-09-15 Rambo 5.7    1995-05-28 Dr. Katz, Professional Therapist 7.6    1968-09-21 Adam-12 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Western Comedy Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors N 8 NachBM84 5 Elizabeth Jennings R 4 Rebecca w 4 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}