{"link": "https://www.themoviedb.org/tv/3318?language=en", "title": "Street Hawk", "resume": "Street Hawk is an American television series that aired for 13 episodes on ABC in 1985. The series is a Limekiln and Templar Production in association with Universal Television. Its central characters were created by Paul M. Belous and Robert \"Bob\" Wolterstorff, and its core format was developed by Bruce Lansbury, who had initially commissioned the program's creation. This series was originally planned for the fall of 1984, Mondays at 8:00PM Eastern/7:00PM Central. However, ABC executives changed their minds when the summer series Call to Glory did well, and Street Hawk was pushed to mid-season. Street Hawk made its debut on January 4, 1985 on ABC at 9:00PM Eastern/8:00PM Central and ran until May 16, 1985.\nReruns aired on the USA Network on Saturdays at 10:00AM from 1990-91.", "rate": 67, "genre": ["Action", "Adventure", "Mystery"], "cast": ["Rex Smith", "Joe Regalbuto", "Richard Venture", "Jeannie Wilson", "Ernie Anderson"], "character": ["Jesse Mach", "Norman Tuttle", "Lt. Cmdr. Leo Altobelli", "Rachel Adams", "Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3318   Expand Street Hawk   (1985) User Score  Play Trailer Overview Street Hawk is an American television series that aired for 13 episodes on ABC in 1985. The series is a Limekiln and Templar Production in association with Universal Television. Its central characters were created by Paul M. Belous and Robert \"Bob\" Wolterstorff, and its core format was developed by Bruce Lansbury, who had initially commissioned the program's creation. This series was originally planned for the fall of 1984, Mondays at 8:00PM Eastern/7:00PM Central. However, ABC executives changed their minds when the summer series Call to Glory did well, and Street Hawk was pushed to mid-season. Street Hawk made its debut on January 4, 1985 on ABC at 9:00PM Eastern/8:00PM Central and ran until May 16, 1985. Reruns aired on the USA Network on Saturdays at 10:00AM from 1990-91. Featured Crew Paul M. Belous Creator Robert Wolterstorff Creator Bruce Lansbury Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rex Smith Jesse Mach Joe Regalbuto Norman Tuttle Richard Venture Lt. Cmdr. Leo Altobelli Jeannie Wilson Rachel Adams Ernie Anderson Narrator (voice) Full Cast & Crew Last Season Season 1 1985 | 13 Episodes Season 1 of Street Hawk premiered on January  4, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   1979-02-10 B. J. and the Bear 6.0    1977-09-15 CHiPs 6.1    1977-09-16 Logan's Run 7.9    1983-12-15 Automan 6.5    1976-01-14 The Bionic Woman 6.2    1978-03-10 The Incredible Hulk 6.4    1968-09-22 Land of the Giants 6.3    1974-09-13 Planet of the Apes 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres Action & Adventure Mystery Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 20 TonAngel 4 Steve d 4 denis 3 Drek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}