{"link": "https://www.themoviedb.org/tv/7486?language=en", "title": "Aaron Stone", "resume": "Aaron Stone is a live-action, single-camera adventure series created by Bruce Kalish. Originally broadcast with the launch of Disney XD on February 13, 2009. It was the first original series to air on the network.\nThe series is about a teenager named Charlie Landers who is enlisted to become the real-life counterpart of his world-renowned avatar Aaron Stone from the fictional video game Hero Rising. The series also stars David Lambert, Tania Gunadi and J. P. Manoux. Unlike most of Disney's live-action shows, Aaron Stone features a darker tone with complex storyline.\nProduction for the first season ran from June 2, to December 19, 2008. The first season aired on Disney XD from February 13, to November 27, 2009. On May 5, 2009, Disney announced that the show had been renewed for a second season. Kelly Blatz confirmed via Twitter account that production for the second season began on June 22, 2009.\nOn November 11, 2009 in a Live Ustream chat with J. P. Manoux, Tania Gunadi and Bruce Kalish, it was announced that Aaron Stone would not be renewed for a third season, with the second season being its last. The given reason was that Disney XD has made the decision to put more emphasis on live-action programming that is primarily comedy-based. This announcement was made before season one was concluded in the United States. A total of 14 episodes were produced for the second season premiering on February 24, 2010. The last remaining 8 episodes began airing on June 16 and concluded on July 30, 2010. As of 2012, Disney XD discontinued airing reruns of Aaron Stone in the United States.", "rate": 80, "genre": ["Action", "Adventure", "Comedy"], "cast": ["J.P. Manoux", "Jacob Kraemer", "Tania Gunadi", "Shauna MacDonald", "Kelly Blatz"], "character": ["S.T.A.N.", "Baxley", "Emma Lau", "Amanda Landers", "Aaron Stone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7486   Expand Aaron Stone   (2009) User Score Overview Aaron Stone is a live-action, single-camera adventure series created by Bruce Kalish. Originally broadcast with the launch of Disney XD on February 13, 2009. It was the first original series to air on the network. The series is about a teenager named Charlie Landers who is enlisted to become the real-life counterpart of his world-renowned avatar Aaron Stone from the fictional video game Hero Rising. The series also stars David Lambert, Tania Gunadi and J. P. Manoux. Unlike most of Disney's live-action shows, Aaron Stone features a darker tone with complex storyline. Production for the first season ran from June 2, to December 19, 2008. The first season aired on Disney XD from February 13, to November 27, 2009. On May 5, 2009, Disney announced that the show had been renewed for a second season. Kelly Blatz confirmed via Twitter account that production for the second season began on June 22, 2009. On November 11, 2009 in a Live Ustream chat with J. P. Manoux, Tania Gunadi and Bruce Kalish, it was announced that Aaron Stone would not be renewed for a third season, with the second season being its last. The given reason was that Disney XD has made the decision to put more emphasis on live-action programming that is primarily comedy-based. This announcement was made before season one was concluded in the United States. A total of 14 episodes were produced for the second season premiering on February 24, 2010. The last remaining 8 episodes began airing on June 16 and concluded on July 30, 2010. As of 2012, Disney XD discontinued airing reruns of Aaron Stone in the United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast J.P. Manoux S.T.A.N. Jacob Kraemer Baxley Tania Gunadi Emma Lau Shauna MacDonald Amanda Landers Kelly Blatz Aaron Stone Full Cast & Crew Last Season Season 2 2010 | 14 Episodes Season 2 of Aaron Stone premiered on February 24, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2006-06-26 Kyle XY 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://disney.go.com/disneyxd/#/disneyxd/shows/aaronstone/ Genres Action & Adventure Comedy Keywords video game teen superhero Content Score 86 Almost there... Top Contributors 21 Banana d 5 denis z 5 zurman1 N 3 NoemiTalavera  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}