{"link": "https://www.themoviedb.org/tv/7425?language=en", "title": "The Doctors", "resume": "The Doctors is an American syndicated talk show airing daily in the U.S., Canada, Mexico, Australia, Ireland, Sweden and Finland. It debuted on September 8, 2008. The hour-long daytime program is produced by Phil McGraw and his son Jay McGraw and is distributed domestically and globally by CBS Television Distribution. The series is a spin-off of Dr. Phil and is the first talk show to be a third generation talk show spin-off, as Dr. Phil itself spun-off of The Oprah Winfrey Show.\nIt was announced in December 2009, during its second season, that The Doctors was cleared through the 2011-2012 season. The third season premiered September 13, 2010, in high definition. In late August 2012, The Doctors was renewed through the 2015-2016 season. The fifth season started on September 10, 2012. The series' sixth season premiered on September 9, 2013. Dr. Lisa Masterson did not return for the sixth season. Urologist Dr. Jennifer Berman and family medicine physician and sexologist Dr. Rachael Ross joined the series.", "rate": 90, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7425   Expand The Doctors   (2008) User Score Overview The Doctors is an American syndicated talk show airing daily in the U.S., Canada, Mexico, Australia, Ireland, Sweden and Finland. It debuted on September 8, 2008. The hour-long daytime program is produced by Phil McGraw and his son Jay McGraw and is distributed domestically and globally by CBS Television Distribution. The series is a spin-off of Dr. Phil and is the first talk show to be a third generation talk show spin-off, as Dr. Phil itself spun-off of The Oprah Winfrey Show. It was announced in December 2009, during its second season, that The Doctors was cleared through the 2011-2012 season. The third season premiered September 13, 2010, in high definition. In late August 2012, The Doctors was renewed through the 2015-2016 season. The fifth season started on September 10, 2012. The series' sixth season premiered on September 9, 2013. Dr. Lisa Masterson did not return for the sixth season. Urologist Dr. Jennifer Berman and family medicine physician and sexologist Dr. Rachael Ross joined the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2012 | 165 Episodes Season 5 of The Doctors premiered on September 11, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Doctors. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.thedoctorstv.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}