{"link": "https://www.themoviedb.org/tv/9343?language=en", "title": "Paranoia Agent", "resume": "The infamous Shounen Bat (Lil' Slugger) is terrorizing the residents of Musashino City. Flying around on his rollerblades and beating people down with a golden baseball bat, the assailant seems impossible to catch—much less understand. His first victim, the well-known yet timid character designer Tsukiko Sagi, is suspected of orchestrating the attacks. Believed only by her anthropomorphic pink stuffed animal, Maromi, Tsukiko is just one of Shounen Bat's many victims. As Shounen Bat continues his relentless assault on the town, detectives Keiichi Ikari and Mitsuhiro Maniwa begin to investigate the identity of the attacker. However, more and more people fall victim to the notorious golden bat, and news of the assailant begins circulating around the town. Paranoia starts to set in as chilling rumors spread amongst adults and children alike. Will the two detectives be able to unravel the truth behind Shounen Bat, or will the paranoia get to them first?", "rate": 78, "genre": ["Animation", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Daisuke Sakaguchi", "Mamiko Noto", "Haruko Momoi", "Shozo Iizuka", "Hisako Kyouda"], "character": ["Lil' Slugger", "Tsukiko Sagi", "Maromi", "Keiichi Ikari", "Mysterious Old Woman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9343   Expand Paranoia Agent   (2004) User Score Overview The infamous Shounen Bat (Lil' Slugger) is terrorizing the residents of Musashino City. Flying around on his rollerblades and beating people down with a golden baseball bat, the assailant seems impossible to catch—much less understand. His first victim, the well-known yet timid character designer Tsukiko Sagi, is suspected of orchestrating the attacks. Believed only by her anthropomorphic pink stuffed animal, Maromi, Tsukiko is just one of Shounen Bat's many victims. As Shounen Bat continues his relentless assault on the town, detectives Keiichi Ikari and Mitsuhiro Maniwa begin to investigate the identity of the attacker. However, more and more people fall victim to the notorious golden bat, and news of the assailant begins circulating around the town. Paranoia starts to set in as chilling rumors spread amongst adults and children alike. Will the two detectives be able to unravel the truth behind Shounen Bat, or will the paranoia get to them first? Featured Crew Satoshi Kon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Sakaguchi Lil' Slugger Mamiko Noto Tsukiko Sagi Haruko Momoi Maromi Shozo Iizuka Keiichi Ikari Hisako Kyouda Mysterious Old Woman Full Cast & Crew Last Season Season 1 2004 | 13 Episodes Season 1 of Paranoia Agent premiered on February  3, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   1998-07-06 Serial Experiments Lain 8.2    2004-04-06 Monster 7.7    2003-03-19 The Diary of Tortov Roddle 8.8    1997-10-07 Berserk 8.1    2002-10-09 Haibane Renmei 7.9    2007-07-19 Death Frenzy 8.0    2014-07-11 Terror in Resonance 6.7    1995-10-04 Neon Genesis Evangelion 8.0  Facts Original Name  妄想代理人 Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://mousou.asmik-ace.co.jp/ Genres Animation Drama Mystery Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 18 BrerFox p 6 psy4trik 6 RLozada t 6 tmdb25781371  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}