{"link": "https://www.themoviedb.org/tv/53113?language=en", "title": "The New Adventures of Peter Pan", "resume": "Featuring first-in-class animation, comedy and adventure, The New Adventures of Peter Pan transports Peter Pan, Wendy, John, Michael and the Lost Boys and Girls to wondrous places that often turn out to be far more dangerous than anyone would have ever expected! In order to keep Neverland safe from Captain Hook, Peter and his friends fly head on into adventure to protect their right to never grow up.", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53113   Expand The New Adventures of Peter Pan   (2013) User Score Overview Featuring first-in-class animation, comedy and adventure, The New Adventures of Peter Pan transports Peter Pan, Wendy, John, Michael and the Lost Boys and Girls to wondrous places that often turn out to be far more dangerous than anyone would have ever expected! In order to keep Neverland safe from Captain Hook, Peter and his friends fly head on into adventure to protect their right to never grow up. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 26 Episodes Season 2 of The New Adventures of Peter Pan premiered on July 26, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The New Adventures of Peter Pan. You can help by rating TV shows you've seen. Facts Original Name  Les nouvelles aventures de Peter Pan Status  Returning Series Networks Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  French Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 12 Elizabeth Jennings j 10 j.l80 v 4 vilbox s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}