{"link": "https://www.themoviedb.org/tv/47039?language=en", "title": "Vicious", "resume": "Freddie and Stuart are an old couple who have been together for decades and bicker constantly. Their lives are turned upside down by their new upstairs neighbor Ash, who is sure to cause trouble in their mundane lives.", "rate": 79, "genre": ["Comedy"], "cast": ["Derek Jacobi", "Ian McKellen", "Iwan Rheon", "Frances de la Tour", "Marcia Warren"], "character": ["Stuart Bixby", "Freddie Thornhill", "Ash Weston", "Violet Crosby", "Penelope"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47039   Expand Vicious   (2013) User Score  Play Trailer Overview Freddie and Stuart are an old couple who have been together for decades and bicker constantly. Their lives are turned upside down by their new upstairs neighbor Ash, who is sure to cause trouble in their mundane lives. Featured Crew Mark Ravenhill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Jacobi Stuart Bixby Ian McKellen Freddie Thornhill Iwan Rheon Ash Weston Frances de la Tour Violet Crosby Marcia Warren Penelope Full Cast & Crew Last Season Season 2 2015 | 6 Episodes Season 2 of Vicious premiered on June  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2015-03-31 Weird Loners 5.8    2013-11-14 Ground Floor 6.1    2014-09-30 Selfie 6.4    2014-10-02 A to Z 5.7    2003-06-29 Fortysomething 7.4    2016-03-15 Crowded 6.4    2015-03-17 One Big Happy 6.0    2015-06-16 Clipped 4.1  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   https://www.itv.com/itvplayer/vicious Genres Comedy Keywords london england gay old man gay relationship gay man apartment lgbt elderly sitcom british humour Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 15 Banana TB 7 TMDb Bot 7 MrSwift  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}