{"link": "https://www.themoviedb.org/tv/74821?language=en", "title": "Prison Playbook", "resume": "With his major league baseball debut right around the corner, a star pitcher lands in prison and must learn to navigate his new world.", "rate": 73, "genre": ["Comedy", "Drama"], "cast": ["Park Hae-soo", "Jung Kyung-ho", "Krystal Jung", "Lee Kyu-hyung", "Choi Moo-seong"], "character": ["Kim Je-Hyeok", "Lee Joon-Ho", "Ji-Ho", "\"Looney\"", "Min-Chul"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74821   Expand Prison Playbook   (2017) User Score Overview With his major league baseball debut right around the corner, a star pitcher lands in prison and must learn to navigate his new world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Hae-soo Kim Je-Hyeok Jung Kyung-ho Lee Joon-Ho Krystal Jung Ji-Ho Lee Kyu-hyung \"Looney\" Choi Moo-seong Min-Chul Full Cast & Crew Current Season Season 1 2017 | 16 Episodes Season 1 of Prison Playbook premiered on November 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2017-09-04 Argon 6.8    2016-11-21 White Nights 8.0    2008-03-16 Fated to Love You 7.3    2015-07-22 Diamond Lover 6.9    2011-08-08 Birdie Buddy 7.7    2016-03-23 Click your Heart 7.0    2016-03-06 Refresh Man 7.0  Facts Original Name  슬기로운 감빵생활 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  105m Homepage   http://program.tving.com/tvn/prisonplaybook Genres Comedy Drama Keywords prisoner Content Score 86 Almost there... Top Contributors M 77 Maria180493 5 Elizabeth Jennings g 5 gogogo 3 aekyo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}