{"link": "https://www.themoviedb.org/tv/11191?language=en", "title": "The Kids from Room 402", "resume": "The Kids from Room 402 is a television program that originally aired on Fox Family in the USA starting in 1999, previously aired on Teletoon, and currently airs in the UK.\nThe show is focused primarily on the students from Room 402, as the title implies. Miss Graves, the teacher, is usually shown as an interlocutor in the problems and injustices that are inflicted upon the students, whether the dilemmas be internal or external. Each show usually ends with a substantiated moral or lesson resulting from such aforementioned situations.\nThe show is based on the children's book The Kids from Room 402 by Betty Paraskevas and Michael Paraskevas. It was developed for television by Cindy Begel and Lesa Kite who wrote all 52 episodes.", "rate": 84, "genre": ["Animation"], "cast": ["Andrew Lawrence", "April Winchell", "Bryton James", "Edie McClurg", "Lori Alan"], "character": ["Vinnie Nasta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11191   Expand The Kids from Room 402 User Score Overview The Kids from Room 402 is a television program that originally aired on Fox Family in the USA starting in 1999, previously aired on Teletoon, and currently airs in the UK. The show is focused primarily on the students from Room 402, as the title implies. Miss Graves, the teacher, is usually shown as an interlocutor in the problems and injustices that are inflicted upon the students, whether the dilemmas be internal or external. Each show usually ends with a substantiated moral or lesson resulting from such aforementioned situations. The show is based on the children's book The Kids from Room 402 by Betty Paraskevas and Michael Paraskevas. It was developed for television by Cindy Begel and Lesa Kite who wrote all 52 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Lawrence Vinnie Nasta April Winchell Bryton James Edie McClurg Lori Alan Full Cast & Crew Last Season Season 2 — | 30 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 3 mercuriy_v s 2 speedycars D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}