{"link": "https://www.themoviedb.org/tv/74064?language=en", "title": "Go Back Couple", "resume": "Choi Ban Do and Ma Jin Joo are both 38-years-old and a married couple. Choi Ban Do has been burdened with being the breadwinner and Ma Jin Joo is a housewife with low self-esteem. Even though they loved each other when they married, they now hate each other. They both regret marrying at such a young age. The couple travel through time and find themselves as 20-year-old university students, when they met for the first time.", "rate": 60, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Son Ho-jun", "Jang Na-ra", "Han Bo-Reum", "Heo Jung-min", "Jang Ki-Yong"], "character": ["Choi Ban-Do", "Ma Jin-Joo", "Yoon Bo-Reum", "An Jae-Woo", "Jung Nam-Gil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74064   Expand Go Back Couple   (2017) User Score Overview Choi Ban Do and Ma Jin Joo are both 38-years-old and a married couple. Choi Ban Do has been burdened with being the breadwinner and Ma Jin Joo is a housewife with low self-esteem. Even though they loved each other when they married, they now hate each other. They both regret marrying at such a young age. The couple travel through time and find themselves as 20-year-old university students, when they met for the first time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Son Ho-jun Choi Ban-Do Jang Na-ra Ma Jin-Joo Han Bo-Reum Yoon Bo-Reum Heo Jung-min An Jae-Woo Jang Ki-Yong Jung Nam-Gil Full Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of Go Back Couple premiered on October 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Go Back Couple. You can help by rating TV shows you've seen. Facts Original Name  고백부부 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/gobackbubu/ Genres Comedy Sci-Fi & Fantasy Keywords time travel romance korea Content Score 86 Almost there... Top Contributors M 50 Maria180493 24 huggi 16 Elizabeth Jennings k 5 keror0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}