{"link": "https://www.themoviedb.org/tv/70837?language=en", "title": "Charité", "resume": "Berlin, 1888. After penniless Ida’s life is saved at the Charité Hospital she must work off the treatment costs. While she becomes acquainted with the most brilliant physicians of this era at the world-famous hospital, the self-determined young woman discovers her passion for medicine.", "rate": 70, "genre": ["Drama"], "cast": ["Alicia von Rittberg", "Justus von Dohnányi", "Matthias Koeberlin", "Christoph Bach", "Ernst Stötzner"], "character": ["Ida Lenze", "Robert Koch", "Emil Behring", "Paul Ehrlich", "Rudolf Virchow"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70837   Expand Charité   (2017) User Score Overview Berlin, 1888. After penniless Ida’s life is saved at the Charité Hospital she must work off the treatment costs. While she becomes acquainted with the most brilliant physicians of this era at the world-famous hospital, the self-determined young woman discovers her passion for medicine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alicia von Rittberg Ida Lenze Justus von Dohnányi Robert Koch Matthias Koeberlin Emil Behring Christoph Bach Paul Ehrlich Ernst Stötzner Rudolf Virchow Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Charité premiered on March 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Charité. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Drama Keywords historical medical drama Content Score 86 Almost there... Top Contributors f 22 fita24 s 11 schlambambomil 10 moviemac 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}