{"link": "https://www.themoviedb.org/tv/32200?language=en", "title": "Criminal Minds: Suspect Behavior", "resume": "Criminal Minds: Suspect Behavior was a short-lived American police procedural drama that aired on CBS. The show debuted in 2011 as a spin-off from the successful Criminal Minds, which had premiered in 2005. This edition's profiling team also worked for the Federal Bureau of Investigation's Behavioral Analysis Unit in Quantico, Virginia. In an April 2010 episode of Criminal Minds, during the show's fifth season, the original team met the new team and worked with them to find a San Francisco serial killer. This episode served as the new series' backdoor pilot.\nJust like the parent series, CBS owned the underlying North American rights, while ABC owned the international rights. The series premiered on February 16, 2011, and filled the Wednesday 10 pm time slot, airing immediately after the original Criminal Minds.\nCBS cancelled the series on May 17, 2011. The series ends with a cliffhanger. On September 6, 2011 CBS DVD released the complete series as a 4 disc-set. It is packaged as \"The DVD Edition\". There are numerous special features and two episode commentaries with the cast and crew. The set includes the backdoor pilot from season five of the original show.", "rate": 64, "genre": ["Drama", "Mystery"], "cast": ["Forest Whitaker", "Beau Garrett", "Michael Kelly", "Kirsten Vangsness", "Richard Schiff"], "character": ["Sam Cooper", "Gina LaSalle", "Jonathan 'Prophet' Simms", "Penelope Garcia", "Jack Fickler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32200   Expand Criminal Minds: Suspect Behavior   (2011) User Score  Play Trailer Overview Criminal Minds: Suspect Behavior was a short-lived American police procedural drama that aired on CBS. The show debuted in 2011 as a spin-off from the successful Criminal Minds, which had premiered in 2005. This edition's profiling team also worked for the Federal Bureau of Investigation's Behavioral Analysis Unit in Quantico, Virginia. In an April 2010 episode of Criminal Minds, during the show's fifth season, the original team met the new team and worked with them to find a San Francisco serial killer. This episode served as the new series' backdoor pilot. Just like the parent series, CBS owned the underlying North American rights, while ABC owned the international rights. The series premiered on February 16, 2011, and filled the Wednesday 10 pm time slot, airing immediately after the original Criminal Minds. CBS cancelled the series on May 17, 2011. The series ends with a cliffhanger. On September 6, 2011 CBS DVD released the complete series as a 4 disc-set. It is packaged as \"The DVD Edition\". There are numerous special features and two episode commentaries with the cast and crew. The set includes the backdoor pilot from season five of the original show. Featured Crew Edward Allen Bernero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Forest Whitaker Sam Cooper Beau Garrett Gina LaSalle Michael Kelly Jonathan 'Prophet' Simms Kirsten Vangsness Penelope Garcia Richard Schiff Jack Fickler Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Criminal Minds: Suspect Behavior premiered on February 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations   2005-12-10 Painkiller Jane 6.0    2014-03-10 Believe 6.3    2001-08-08 McLeod's Daughters 7.4    2010-07-11 The Glades 6.3    1999-10-06 Roswell 7.0    2013-11-14 Ground Floor 6.1    2011-02-07 The Chicago Code 7.3    2007-09-25 Reaper 7.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.cbs.com/primetime/criminal_minds_suspect_behavior/ Genres Drama Mystery Keywords spin off crime investigation human behavior criminology Content Score 100 Yes! Looking good! Top Contributors R 9 Rebecca 9 Banana z 4 zurman1 N 4 NightwingSK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}