{"link": "https://www.themoviedb.org/tv/4424?language=en", "title": "The Colbys", "resume": "The Colbys is an American prime time soap opera, which originally aired on ABC from November 20, 1985 to March 26, 1987. Produced by Aaron Spelling, it was a spin-off of Dynasty, which had been the highest rated series for the 1984–1985 U.S. television season. The Colbys revolved around another wealthy, upper-class family, who were distant relatives of the Carringtons of Dynasty and who owned a large multi-national corporation. Intended to surpass its predecessor in opulence, the series' producers were handed an immensely high budget for the era and cast a handful of well-known movie stars among its leads, including Charlton Heston, Barbara Stanwyck, Katharine Ross and Ricardo Montalban. However, The Colbys was ultimately a ratings disappointment, and was canceled after two seasons.", "rate": 40, "genre": ["Drama"], "cast": ["Stephanie Beacham", "Ricardo Montalban", "Maxwell Caulfield", "Emma Samms", "Claire Yarlett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4424   Expand The Colbys   (1985) User Score Overview The Colbys is an American prime time soap opera, which originally aired on ABC from November 20, 1985 to March 26, 1987. Produced by Aaron Spelling, it was a spin-off of Dynasty, which had been the highest rated series for the 1984–1985 U.S. television season. The Colbys revolved around another wealthy, upper-class family, who were distant relatives of the Carringtons of Dynasty and who owned a large multi-national corporation. Intended to surpass its predecessor in opulence, the series' producers were handed an immensely high budget for the era and cast a handful of well-known movie stars among its leads, including Charlton Heston, Barbara Stanwyck, Katharine Ross and Ricardo Montalban. However, The Colbys was ultimately a ratings disappointment, and was canceled after two seasons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephanie Beacham Ricardo Montalban Maxwell Caulfield Emma Samms Claire Yarlett Full Cast & Crew Last Season Season 2 1986 | 25 Episodes Season 2 of The Colbys premiered on September 24, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Colbys. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 10 zurman1 o 5 olgenia 4 Steve p 3 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}