{"link": "https://www.themoviedb.org/tv/2309?language=en", "title": "Danny Phantom", "resume": "Danny Phantom is an American animated television series created by Butch Hartman for Nickelodeon, produced by Billionfold Studios. It was distributed by Nelvana, a Canadian animation company, as was The Fairly OddParents.\nThe show is about a 14-year-old named Danny Fenton who, after an accident with an unpredictable portal between the human world and the supernatural \"Ghost Zone\", becomes half-ghost and frequently saves his town and the world from ghost attacks, while attempting to keep his ghost half a secret from everyone, except his best friends Tucker Foley and Samantha Manson.\nThe series premiered on April 3, 2004 and ended on August 24, 2007; it ran for 3 seasons with a total of 53 episodes. It is currently being released on DVD.\nOn August 5, 2013, Hartman announced the possible revival of the show as a result of persisted praise from fans and successful T.U.F.F. Puppy ratings on his Twitter account, but there has been not yet been any official word from Hartman or Nickelodeon.", "rate": 67, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["David Kaufman", "Colleen O'Shaughnessey", "Grey DeLisle", "Rickey D'Shon Collins", "Rob Paulsen"], "character": ["Danny Phantom", "Jazz Fenton", "Samantha \"Sam\" Manson", "Tucker Foley", "Jack Fenton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2309   Expand Danny Phantom   (2004) User Score Overview Danny Phantom is an American animated television series created by Butch Hartman for Nickelodeon, produced by Billionfold Studios. It was distributed by Nelvana, a Canadian animation company, as was The Fairly OddParents. The show is about a 14-year-old named Danny Fenton who, after an accident with an unpredictable portal between the human world and the supernatural \"Ghost Zone\", becomes half-ghost and frequently saves his town and the world from ghost attacks, while attempting to keep his ghost half a secret from everyone, except his best friends Tucker Foley and Samantha Manson. The series premiered on April 3, 2004 and ended on August 24, 2007; it ran for 3 seasons with a total of 53 episodes. It is currently being released on DVD. On August 5, 2013, Hartman announced the possible revival of the show as a result of persisted praise from fans and successful T.U.F.F. Puppy ratings on his Twitter account, but there has been not yet been any official word from Hartman or Nickelodeon. Featured Crew Butch Hartman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast David Kaufman Danny Phantom Colleen O'Shaughnessey Jazz Fenton Grey DeLisle Samantha \"Sam\" Manson Rickey D'Shon Collins Tucker Foley Rob Paulsen Jack Fenton Full Cast & Crew Last Season Season 3 2007 | 12 Episodes Season 3 of Danny Phantom premiered on August 20, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2002-12-06 Codename: Kids Next Door 6.5    2003-08-01 My Life as a Teenage Robot 6.1    2004-08-13 Foster's Home for Imaginary Friends 6.8    2001-03-30 The Fairly OddParents 6.7    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    2005-12-26 My Gym Partner's a Monkey 5.0    1998-11-18 The Powerpuff Girls 7.0    1999-01-04 Ed, Edd n Eddy 7.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nick.com/shows/danny_phantom/index.jhtml Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords teenager ghost teen superhero Content Score 100 Yes! Looking good! Top Contributors 13 Banana R 12 Rebecca z 5 zurman1 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}