{"link": "https://www.themoviedb.org/tv/68815?language=en", "title": "Solomon's Perjury", "resume": "A male student's body is found at school. Authorities assume that the student killed himself in a fall. Other students at the school hold a trial to uncover the truth behind his death.", "rate": 63, "genre": ["Mystery"], "cast": ["Kim Hyun-soo", "Jang Dong-Yoon", "Seo Ji-Hoon", "Seo Young-Joo", "Jo Jae-hyeon"], "character": ["Ko Seo-Yeon", "Han Ji-Hoon", "Bae Joon-Young", "Lee So-Woo", "Han Kyung-Moon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68815   Expand Solomon's Perjury   (2016) User Score  Play Trailer Overview A male student's body is found at school. Authorities assume that the student killed himself in a fall. Other students at the school hold a trial to uncover the truth behind his death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hyun-soo Ko Seo-Yeon Jang Dong-Yoon Han Ji-Hoon Seo Ji-Hoon Bae Joon-Young Seo Young-Joo Lee So-Woo Jo Jae-hyeon Han Kyung-Moon Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Solomon's Perjury premiered on December 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2017-07-01 My Only Love Song 7.3    2016-11-21 White Nights 8.0    2017-09-04 Argon 6.8    2011-08-08 Birdie Buddy 7.7    2008-03-16 Fated to Love You 7.3    2015-07-22 Diamond Lover 6.9    2016-03-23 Click your Heart 7.0    2016-03-06 Refresh Man 7.0  Facts Original Name  솔로몬의 위증 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.joins.com/solomon/ Genres Mystery Keywords korea Content Score 93 Almost there... Top Contributors M 52 Maria180493 7 Danu s 3 sheva_vitali 3 Ankhaanaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}