{"link": "https://www.themoviedb.org/tv/1909?language=en", "title": "The Greatest American Hero", "resume": "The chronicles of  teacher Ralph Hinkley's adventures after a group of aliens gives him a red suit that gives him superhuman abilities. Unfortunately, Ralph, who hates wearing the suit, immediately loses its instruction booklet, and thus has to learn how to use its powers by trial and error, often with comical results.", "rate": 71, "genre": ["Action", "Adventure", "Comedy", "Crime"], "cast": ["William Katt", "Robert Culp", "Connie Sellecca", "Faye Grant", "Michael Paré"], "character": ["Bill Maxwell", "Pam Davidson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1909   Expand The Greatest American Hero   (1981) User Score Overview The chronicles of  teacher Ralph Hinkley's adventures after a group of aliens gives him a red suit that gives him superhuman abilities. Unfortunately, Ralph, who hates wearing the suit, immediately loses its instruction booklet, and thus has to learn how to use its powers by trial and error, often with comical results. Featured Crew Stephen J. Cannell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Katt Robert Culp Bill Maxwell Connie Sellecca Pam Davidson Faye Grant Michael Paré Full Cast & Crew Last Season Season 3 1982 | 14 Episodes Season 3 of The Greatest American Hero premiered on October 29, 1982. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply M Bill Maxwell Open 4 by  MirrorUniverse Greatest Theme of All Time? Open 10 by  Moonglum9 M I wonder if the aliens Open 0 by Moonglum9\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   1982-10-03 Voyagers! 7.5    1974-09-07 Land of the Lost 6.9    2009-01-13 Chopped 4.8    1999-04-07 Strangers with Candy 7.0    1986-09-17 Head of the Class 6.3    1984-09-18 Punky Brewster 6.8    1983-10-03 Scarecrow and Mrs. King 5.5    1984-10-03 Charles in Charge 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Comedy Crime Keywords alien encounter special suit Content Score 93 Almost there... Top Contributors 9 Elizabeth Jennings 8 Batliebre PE 8 Patrick E. Abe CN 5 Carmelo Nicolosi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}