{"link": "https://www.themoviedb.org/tv/69923?language=en", "title": "Thumping Spike", "resume": "A volleyball coach and his players aim for success during which they develop stronger bond and friendship for each other as well as teamwork. This youthful story shows sportsmanship and heart thumping romance.", "rate": 0, "genre": ["Drama"], "cast": ["Lee Won-keun", "Kim So-eun", "Sun Woong", "Shin Hyun-Soo", "Bae Jin-woong"], "character": ["Dong Hae Sung", "Han Da Woon / Han Ah Reum", "Go Yi Ra", "Lee Han Sol", "Pyo Jin Ha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69923   Expand Thumping Spike   (2016) User Score Overview A volleyball coach and his players aim for success during which they develop stronger bond and friendship for each other as well as teamwork. This youthful story shows sportsmanship and heart thumping romance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Won-keun Dong Hae Sung Kim So-eun Han Da Woon / Han Ah Reum Sun Woong Go Yi Ra Shin Hyun-Soo Lee Han Sol Bae Jin-woong Pyo Jin Ha Full Cast & Crew Last Season Season 2 2016 | 20 Episodes Season 2 of Thumping Spike premiered on September 24, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Thumping Spike. You can help by rating TV shows you've seen. Facts Original Name  두근두근 스파이크 Status  Ended Networks Maeil Broadcasting Network Sohu Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage  - Genres Drama Keywords sport romance korea Content Score 86 Almost there... Top Contributors M 36 Maria180493 15 mp4soju 6 empireyura 4 MundoAsian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}