{"link": "https://www.themoviedb.org/tv/901?language=en", "title": "The Sarah Silverman Program", "resume": "The Sarah Silverman Program is an American television series, which ran from February 1, 2007 to April 15, 2010 on Comedy Central starring comedian and actress Sarah Silverman, who created the series with Dan Harmon and Rob Schrab.\nThe Sarah Silverman Program faced cancellation in 2009 when Comedy Central and the producers were unable to reach an agreement for the show's per-episode budget. LGBT-interest cable channel Logo stepped in to co-produce the third season.", "rate": 61, "genre": ["Comedy"], "cast": ["Laura Silverman", "Jay Johnston", "Brian Posehn", "Steve Agee", "Sarah Silverman"], "character": ["Sarah Silverman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 901   Expand The Sarah Silverman Program   (2007) User Score Overview The Sarah Silverman Program is an American television series, which ran from February 1, 2007 to April 15, 2010 on Comedy Central starring comedian and actress Sarah Silverman, who created the series with Dan Harmon and Rob Schrab. The Sarah Silverman Program faced cancellation in 2009 when Comedy Central and the producers were unable to reach an agreement for the show's per-episode budget. LGBT-interest cable channel Logo stepped in to co-produce the third season. Featured Crew Sarah Silverman Creator Dan Harmon Creator Rob Schrab Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Silverman Jay Johnston Brian Posehn Steve Agee Sarah Silverman Sarah Silverman Full Cast & Crew Last Season Season 3 2010 | 10 Episodes Season 3 of The Sarah Silverman Program premiered on February  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  1 Recommendations   2012-02-20 The Bleak Old Shop of Stuff 6.7    1999-04-07 Strangers with Candy 7.0    2008-12-08 Childrens Hospital 7.0    2007-04-22 Kingdom 7.0    2014-07-17 Married 6.3    2011-09-22 Whitney 3.8    2012-01-31 Key & Peele 7.2    2003-07-23 Reno 911! 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://sarahsilverman.comedycentral.com/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors b 6 bugfix W 2 Widered 2 kuzronk w 1 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}