{"link": "https://www.themoviedb.org/tv/66297?language=en", "title": "The Other Kingdom", "resume": "Astral is a fairy princess who lives in the secret fairy kingdom of Athenia which is full of mythical creatures. While that sounds amazing, Astral likes to fantasize about living in the human world and attending high school. Once she leaves her home to do just that, she has to try to fit in and keep her identity a secret.", "rate": 51, "genre": ["Comedy", "Drama", "Family", "Sci-Fi", "Fantasy"], "cast": ["Esther Zynn", "Callan Potter", "Celina Martin", "Taylor Adams", "Josette Halpert"], "character": ["Astral", "Tristan", "Morgan", "Devon", "Hailey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66297   Expand The Other Kingdom   (2016) User Score Overview Astral is a fairy princess who lives in the secret fairy kingdom of Athenia which is full of mythical creatures. While that sounds amazing, Astral likes to fantasize about living in the human world and attending high school. Once she leaves her home to do just that, she has to try to fit in and keep her identity a secret. Featured Crew Thomas W. Lynch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Esther Zynn Astral Callan Potter Tristan Celina Martin Morgan Taylor Adams Devon Josette Halpert Hailey Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of The Other Kingdom premiered on April 10, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Princess Astral: Happy Birthday Esther Zynn! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2018-02-01 A.P. Bio 5.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.nick.com/the-other-kingdom/ Genres Comedy Drama Family Sci-Fi & Fantasy Keywords princess high school magic kingdom fairy fish out of water teenager sitcom Content Score 93 Almost there... Top Contributors 45 Ly 25 Elizabeth Jennings 11 Banana o 4 olgenia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}