{"link": "https://www.themoviedb.org/tv/70195?language=en", "title": "Radiant Office", "resume": "Ho Won is a young woman who struggles to find a steady job. Tired and hopeless, she attempted suicide. Hospital check-up discovers she might have terminal illness. Soon after, a furniture company accepts her as a contract worker. Faced with a possibility of dying, Ho Won decides to just let herself loose. Her newfound bold attitude puts her at odds with her workaholic manager Woo Jin.", "rate": 73, "genre": ["Comedy"], "cast": ["Go Ah-sung", "Ha Seok-jin", "Lee Dong-hwi", "Kim Dong-wook", "Kwon Hae-hyo"], "character": ["Eun Ho-Won", "Seo Woo-Jin", "Do Ki-Taek", "Seo Hyun", "Park Sang-Man"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70195   Expand Radiant Office   (2017) User Score Overview Ho Won is a young woman who struggles to find a steady job. Tired and hopeless, she attempted suicide. Hospital check-up discovers she might have terminal illness. Soon after, a furniture company accepts her as a contract worker. Faced with a possibility of dying, Ho Won decides to just let herself loose. Her newfound bold attitude puts her at odds with her workaholic manager Woo Jin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Go Ah-sung Eun Ho-Won Ha Seok-jin Seo Woo-Jin Lee Dong-hwi Do Ki-Taek Kim Dong-wook Seo Hyun Kwon Hae-hyo Park Sang-Man Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Radiant Office premiered on March 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2017-10-11 Mad Dog 8.0    2017-11-11 Money Flower 8.0    2017-04-17 My Secret Romance 7.6    2017-10-09 Witch's Court 9.3    2017-01-16 Introverted Boss 8.7    2017-07-03 Bride of the Water God 5.4    2017-09-27 While You Were Sleeping 9.0    2017-01-25 Chief Kim 7.5  Facts Original Name  자체발광 오피스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/joffice/ Genres Comedy Keywords workplace romance korea Content Score 86 Almost there... Top Contributors M 42 Maria180493 V 10 Violsa l 4 llluqiang 4 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}