{"link": "https://www.themoviedb.org/tv/21266?language=en", "title": "The Flying House", "resume": "Corky, Angey, and Justin are playing hide and seek in the woods when a sudden storm appears and they come upon a house in the woods. They go inside and meet Professor Bumble and his Solar Ion Robot, SIR. They discover the house is a flying time machine and a sudden mishap send them into the past where they end up witnessing events from The Bible's New Testament as they keep trying to get home.", "rate": 100, "genre": ["Animation"], "cast": ["Runa Akiyama", "Yoshito Yasuhara", "Sanae Takagi", "Kyōko Tongū", "Satomi Majima"], "character": ["Tsukubô Natsuyama", "Dr. Tokio Taimu", "Kanna Natsuyama", "Kandenchin", "Gen Adachi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21266   Expand The Flying House   (1982) User Score Overview Corky, Angey, and Justin are playing hide and seek in the woods when a sudden storm appears and they come upon a house in the woods. They go inside and meet Professor Bumble and his Solar Ion Robot, SIR. They discover the house is a flying time machine and a sudden mishap send them into the past where they end up witnessing events from The Bible's New Testament as they keep trying to get home. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Runa Akiyama Tsukubô Natsuyama Yoshito Yasuhara Dr. Tokio Taimu Sanae Takagi Kanna Natsuyama Kyōko Tongū Kandenchin Satomi Majima Gen Adachi Full Cast & Crew Last Season Season 1 1982 | 52 Episodes Season 1 of The Flying House premiered on April  5, 1982. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Flying House. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Flying House. You can help by rating TV shows you've seen. Facts Original Name  トンデラハウスの大冒険 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 Elizabeth Jennings z 5 zurman1 4 lineker 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}