{"link": "https://www.themoviedb.org/tv/64532?language=en", "title": "Wu Xin: The Monster Killer", "resume": "Wu Xin is an immortal who doesn't know where he was from, how long he lived, or what he is. He wanders the earth with no purpose in life and no money. During one of his destitute spells, he meets Yue Ya who gives him her last morsel of food. To repay her kindness and get more food in their stomach, he decides to capitalize his only skill set: Killing monsters. They begin a wondrous and often dangerous adventure of fighting supernatural evil, one paying customer at a time.", "rate": 90, "genre": ["Mystery"], "cast": ["Elvis Han", "Gina Jin", "Ian Wang", "Pirath Nitipaisankul", "Sebrina Chen"], "character": ["Wu Xin", "Yue Ya", "Gu Xuan Wu", "Bai Liu Li", "Yue Qiluo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64532   Expand Wu Xin: The Monster Killer   (2015) User Score Overview Wu Xin is an immortal who doesn't know where he was from, how long he lived, or what he is. He wanders the earth with no purpose in life and no money. During one of his destitute spells, he meets Yue Ya who gives him her last morsel of food. To repay her kindness and get more food in their stomach, he decides to capitalize his only skill set: Killing monsters. They begin a wondrous and often dangerous adventure of fighting supernatural evil, one paying customer at a time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elvis Han Wu Xin Gina Jin Yue Ya Ian Wang Gu Xuan Wu Pirath Nitipaisankul Bai Liu Li Sebrina Chen Yue Qiluo Full Cast & Crew Last Season Season 2 2017 | 27 Episodes Season 2 of Wu Xin: The Monster Killer premiered on August 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wu Xin: The Monster Killer. You can help by rating TV shows you've seen. Facts Original Name  无心法师 Status  Returning Series Network Sohu Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   https://nonton.drakor-id.com/ Genres Mystery Keywords china Content Score 86 Almost there... Top Contributors M 32 Maria180493 10 Charles 鱼 8 鱼太咸 5 Drakor-ID  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}