{"link": "https://www.themoviedb.org/tv/71103?language=en", "title": "It's All About the Looks", "resume": "Jun Jonochi works at a paper manufacturing company. She is earnest, but clueless about her own appearance. She doesn't have any interest in making herself look good. One day, she realizes that people don't view her as other women. She begins to read up on things like make-up and fashion trends with her two female colleagues.", "rate": 0, "genre": ["Comedy"], "cast": ["Mirei Kiritani", "Asami Mizukawa", "Buruzon Chiemi", "Ryou Narita", "Keita Machida"], "character": ["Jun Jonochi", "Mitsuko Maeda", "Seira Sato", "Keiichi Sakaki", "Takuma Maruo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71103   Expand It's All About the Looks   (2017) User Score Overview Jun Jonochi works at a paper manufacturing company. She is earnest, but clueless about her own appearance. She doesn't have any interest in making herself look good. One day, she realizes that people don't view her as other women. She begins to read up on things like make-up and fashion trends with her two female colleagues. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mirei Kiritani Jun Jonochi Asami Mizukawa Mitsuko Maeda Buruzon Chiemi Seira Sato Ryou Narita Keiichi Sakaki Keita Machida Takuma Maruo Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of It's All About the Looks premiered on April 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on It's All About the Looks. You can help by rating TV shows you've seen. Facts Original Name  人は見た目が100パーセント Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.fujitv.co.jp/hitopa/ Genres Comedy Keywords japan Content Score 86 Almost there... Top Contributors M 28 Maria180493 8 Elizabeth Jennings 5 thirstyhippo l 3 losernator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}