{"link": "https://www.themoviedb.org/tv/78824?language=en", "title": "King Liar", "resume": "When Jari Aarnio was younger, he was honored as ‘Police Officer of the Year’, and quickly became Chief of the Narcotics Squad. The Squad boasted quick results and flashy confiscations. Aarnio’s reputation as a hero cop grew when he used a pair of garden sheers to diffuse a grenade which was tossed into his backyard by a vengeful criminal. Now, the hero cop is in prison, serving a maximum sentence. King Liar follows how Aarnio’s abuse of power was discovered through hard work and persistent investigation by Finland’s National Bureau of Investigation (KRP) and two reporters from the country’s largest newspaper. Together, they uncovered the most unbelievable tale of crime, bribery, prostitution, drug trafficking, and money laundering. When he was arrested, Aarnio denied all charges and tried to use his allies in the police department, media, and even the government to make it all seem like a witch hunt orchestrated by the KRP.", "rate": 0, "genre": ["Crime"], "cast": ["Veera Lehtinen", "Kari Hietalahti", "Kirsi Ylijoki", "Pilvi Hämäläinen", "Mikko Leppilampi"], "character": ["Riina Väliaho", "Jari Aarnio", "Susanna Reinboth", "Minna Passi", "Jarkko Rautavaara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78824   Expand King Liar   (2018) User Score Overview When Jari Aarnio was younger, he was honored as ‘Police Officer of the Year’, and quickly became Chief of the Narcotics Squad. The Squad boasted quick results and flashy confiscations. Aarnio’s reputation as a hero cop grew when he used a pair of garden sheers to diffuse a grenade which was tossed into his backyard by a vengeful criminal. Now, the hero cop is in prison, serving a maximum sentence. King Liar follows how Aarnio’s abuse of power was discovered through hard work and persistent investigation by Finland’s National Bureau of Investigation (KRP) and two reporters from the country’s largest newspaper. Together, they uncovered the most unbelievable tale of crime, bribery, prostitution, drug trafficking, and money laundering. When he was arrested, Aarnio denied all charges and tried to use his allies in the police department, media, and even the government to make it all seem like a witch hunt orchestrated by the KRP. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Veera Lehtinen Riina Väliaho Kari Hietalahti Jari Aarnio Kirsi Ylijoki Susanna Reinboth Pilvi Hämäläinen Minna Passi Mikko Leppilampi Jarkko Rautavaara Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of King Liar premiered on April 14, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on King Liar. You can help by rating TV shows you've seen. Facts Original Name  Keisari Aarnio Status  Returning Series Network Certification  - Type  Scripted Original Language  Finnish Runtime  42m Homepage   https://www.ruutu.fi/ohjelmat/keisari-aarnio Genres Crime Keywords police corruption narcotics cop drug ring based on true events Content Score 86 Almost there... Top Contributors 23 Hevinalle K 16 Kaide 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}