{"link": "https://www.themoviedb.org/tv/77591?language=en", "title": "Flint Town", "resume": "Over a two-year period, filmmakers embedded with cops in Flint, Michigan, reveal a department grappling with volatile issues in untenable conditions.", "rate": 84, "genre": ["Documentary", "Crime", "Action", "Adventure"], "cast": ["Timothy Johnson", "Bridgette Balasko", "Devon Bernritter", "John Boismier", "Esther Campbell"], "character": ["Himself/Chief of Police - Flint, Michigan Police Department", "Herself/Flint, Michigan Police Officer", "Himself/Flint, Michigan Police Officer/Captain", "Himself/Flint, MIchigan Police Officer/Field Training Officer", "Herself/Flint, MIchigan Police Officer/Sergeant"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77591   Expand Flint Town   (2018) User Score  Play Trailer Overview Over a two-year period, filmmakers embedded with cops in Flint, Michigan, reveal a department grappling with volatile issues in untenable conditions. Featured Crew Zackary Canepari Creator Drea Cooper Creator Jessica Dimmock Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Timothy Johnson Himself/Chief of Police - Flint, Michigan Police Department Bridgette Balasko Herself/Flint, Michigan Police Officer Devon Bernritter Himself/Flint, Michigan Police Officer/Captain John Boismier Himself/Flint, MIchigan Police Officer/Field Training Officer Esther Campbell Herself/Flint, MIchigan Police Officer/Sergeant Full Cast & Crew Current Season Season 1 2018 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Flint Town. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  50m Homepage   https://www.netflix.com/title/80156688 Genres Documentary Crime Action & Adventure Keywords police brutality police michigan politics gun mayor basic rights and human rights police chief protest interview street riots video surveillance community shooting cops cop president water supply thief murder stealing gang dead body american culture sociology voting racism shooter relationship crime theft violence city cultural election human rights police car political police academy social injustice illegal drugs militarism social justice public health gun violence flint michigan social media current affairs steal abandoned current events criminal justice gun control black lives matter social & cultural docs ride along bernie sanders water crisis Content Score 100 Yes! Looking good! Top Contributors 77 Ibuddy66 21 Daddie0 11 United600 7 peliculastop  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}