{"link": "https://www.themoviedb.org/tv/5986?language=en", "title": "Some Mothers Do 'Ave 'Em", "resume": "Some Mothers Do 'Ave 'Em is a BBC situation comedy, written by Raymond Allen and starring Michael Crawford and Michele Dotrice. It was first broadcast in 1973 and ran for three series, ending in 1978.\nThe series follows the accident-prone Frank Spencer and his tolerant, if long-suffering, wife, Betty, through Frank's various attempts to hold down a job, which frequently end in disaster.\nNoted for its stuntwork, performed by Michael Crawford himself as well as featuring various well-remembered catchphrases, the series was voted #22 in the BBC's poll \"Britain's Best Sitcom\".", "rate": 78, "genre": ["Comedy"], "cast": ["Michele Dotrice", "Michael Crawford", "Anthony Woodruff", "Patrick McAlinney", "Dick Bentley"], "character": ["Betty Spencer", "Frank Spencer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5986   Expand Some Mothers Do 'Ave 'Em   (1973) User Score Overview Some Mothers Do 'Ave 'Em is a BBC situation comedy, written by Raymond Allen and starring Michael Crawford and Michele Dotrice. It was first broadcast in 1973 and ran for three series, ending in 1978. The series follows the accident-prone Frank Spencer and his tolerant, if long-suffering, wife, Betty, through Frank's various attempts to hold down a job, which frequently end in disaster. Noted for its stuntwork, performed by Michael Crawford himself as well as featuring various well-remembered catchphrases, the series was voted #22 in the BBC's poll \"Britain's Best Sitcom\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michele Dotrice Betty Spencer Michael Crawford Frank Spencer Anthony Woodruff Patrick McAlinney Dick Bentley Full Cast & Crew Last Season Season 3 1978 | 7 Episodes Season 3 of Some Mothers Do 'Ave 'Em premiered on November 11, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   1976-02-20 Open All Hours 7.7    1974-09-05 Porridge 8.3    1962-01-04 Steptoe and Son 8.2    1965-07-22 Till Death Us Do Part 7.2    1991-01-03 The Brittas Empire 7.1    1990-01-04 One Foot in the Grave 7.5    1982-11-02 Countdown 5.4    1983-09-22 Just Good Friends 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords marriage farce sitcom british humour Content Score 86 Almost there... Top Contributors O 10 Ozbourne R 9 Rebecca S 3 Spock2001 B 1 BWYoda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}