{"link": "https://www.themoviedb.org/tv/2559?language=en", "title": "Boon", "resume": "Boon is a British television drama and modern-day western series starring Michael Elphick, David Daker, and later Neil Morrissey. It was created by Jim Hill and Bill Stair and filmed by Central Television for ITV. It revolved around the life of a modern-day Lone Ranger and ex-firefighter, Ken Boon.", "rate": 48, "genre": ["Comedy", "Drama"], "cast": ["Michael Elphick", "David Daker", "Neil Morrissey", "Elizabeth Carling", "Amanda Burton"], "character": ["Rocky Cassidy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2559   Expand Boon   (1986) User Score Overview Boon is a British television drama and modern-day western series starring Michael Elphick, David Daker, and later Neil Morrissey. It was created by Jim Hill and Bill Stair and filmed by Central Television for ITV. It revolved around the life of a modern-day Lone Ranger and ex-firefighter, Ken Boon. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Elphick David Daker Neil Morrissey Rocky Cassidy Elizabeth Carling Amanda Burton Full Cast & Crew Last Season Season 8 1992 | 14 Episodes Season 8 of Boon premiered on September  8, 1992. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t Hi-yo Silver!  - the cockney lone ranger is riding on down to rescue me. Open 0 by De Burgh\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1995-09-14 They Think It's All Over 7.3    1989-11-16 Maid Marian and Her Merry Men 7.3    1984-01-29 Ever Decreasing Circles 6.5    1990-11-08 Harry Enfield's Television Programme 7.6    1973-11-12 Last of the Summer Wine 6.5    1965-07-22 Till Death Us Do Part 7.2    1993-01-27 The Detectives 7.1    1974-09-02 Rising Damp 7.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Drama Keywords private investigator Content Score 86 Almost there... Top Contributors O 16 Outofbounds7 16 Banana z 2 zoroman2017 F 1 Felixwerewolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}