{"link": "https://www.themoviedb.org/tv/3574?language=en", "title": "In Search of...", "resume": "In Search of... is a television series that was broadcast weekly from 1977 to 1982, devoted to mysterious phenomena. It was created after the success of three one-hour TV documentaries produced by creator Alan Landsburg: In Search of Ancient Astronauts in 1973, In Search of Ancient Mysteries and The Outer Space Connection, both in 1975. All three featured narration by Rod Serling, who was the initial choice to host the spin-off show. After Serling's death, Leonard Nimoy was selected to be the host.", "rate": 86, "genre": ["Documentary"], "cast": ["Leonard Nimoy"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3574   Expand In Search of...   (1977) User Score  Play Trailer Overview In Search of... is a television series that was broadcast weekly from 1977 to 1982, devoted to mysterious phenomena. It was created after the success of three one-hour TV documentaries produced by creator Alan Landsburg: In Search of Ancient Astronauts in 1973, In Search of Ancient Mysteries and The Outer Space Connection, both in 1975. All three featured narration by Rod Serling, who was the initial choice to host the spin-off show. After Serling's death, Leonard Nimoy was selected to be the host. Featured Crew Alan Landsburg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leonard Nimoy Narrator Full Cast & Crew Last Season Season 7 2002 | 8 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply St Best. Show. EVER. Open 1 by  genplant29 Freakiest moments of In Search Of.... Open 1 by  censorshipsucks06 Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on In Search of.... You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Keywords monster documentary paranormal investigation ghost Content Score 71 Just a little bit more... Top Contributors 32 OzDrDj St 3 Satch the Cineaste 3 Banana 1 amian123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}