{"link": "https://www.themoviedb.org/tv/1062?language=en", "title": "F Troop", "resume": "F Troop is a satirical American television sitcom that originally aired for two seasons on ABC-TV. It debuted in the United States on September 14, 1965 and concluded its run on April 6, 1967 with a total of 65 episodes. The first season of 34 episodes was filmed in black-and-white, but the show switched to color for its second season.", "rate": 71, "genre": ["Western", "Comedy"], "cast": ["Forrest Tucker", "Larry Storch", "Ken Berry", "Melody Patterson", "James Hampton"], "character": ["Sergeant. Morgan O'Rourke", "Corporal Randolph Agarn", "Captain Wilton Parmenter", "Wrangler Jane Angelica Thrift", "Hannibal Dobbs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1062   Expand F Troop   (1965) User Score Overview F Troop is a satirical American television sitcom that originally aired for two seasons on ABC-TV. It debuted in the United States on September 14, 1965 and concluded its run on April 6, 1967 with a total of 65 episodes. The first season of 34 episodes was filmed in black-and-white, but the show switched to color for its second season. Featured Crew Seaman Jacobs Creator Ed James Creator James Barnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Forrest Tucker Sergeant. Morgan O'Rourke Larry Storch Corporal Randolph Agarn Ken Berry Captain Wilton Parmenter Melody Patterson Wrangler Jane Angelica Thrift James Hampton Hannibal Dobbs Full Cast & Crew Last Season Season 2 1966 | 31 Episodes Season 2 of F Troop premiered on September  8, 1966. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Funny theme song the into Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1968-09-28 The Ghost & Mrs. Muir 6.7    1965-09-01 Gidget 5.2    1960-09-29 My Three Sons 6.0    1967-09-10 Gentle Ben 5.0    1967-09-07 The Flying Nun 5.0    1961-09-28 Hazel 7.8    1962-10-11 McHale's Navy 6.1    1966-09-12 Family Affair 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Comedy Keywords wild west sitcom 19th century period sitcom Content Score 93 Almost there... Top Contributors 8 Banana DR 4 David R Somers 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}