{"link": "https://www.themoviedb.org/tv/72506?language=en", "title": "A Centaur's Life", "resume": "Kimihara Himeno, also known as \"Hime,\" goes about her life, love, and studies just like any ordinary high school girl. The only difference is that she's a centaur. She enjoys her school life along with classmates of many unique shapes, including Nozomi the draconid, Kyoko the goatfolk, an angelfolk class representative, and Sassas-chan the Antarctican. Hime's younger cousin Shino-chan, her friend Maki-chan, and the class representative's four younger sisters also join the cast in this very cute slice-of-life story about girls who are human, yet aren't!", "rate": 88, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Seria Fukagawa", "Yuuki Kuwahara", "Haruka Shiraishi"], "character": ["Himeno Kimihara", "Nozomi Gokuraku", "Kyouko Naraku"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72506   Expand A Centaur's Life   (2017) User Score Overview Kimihara Himeno, also known as \"Hime,\" goes about her life, love, and studies just like any ordinary high school girl. The only difference is that she's a centaur. She enjoys her school life along with classmates of many unique shapes, including Nozomi the draconid, Kyoko the goatfolk, an angelfolk class representative, and Sassas-chan the Antarctican. Hime's younger cousin Shino-chan, her friend Maki-chan, and the class representative's four younger sisters also join the cast in this very cute slice-of-life story about girls who are human, yet aren't! Featured Crew Fumitoshi Oizaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seria Fukagawa Himeno Kimihara Yuuki Kuwahara Nozomi Gokuraku Haruka Shiraishi Kyouko Naraku Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of A Centaur's Life premiered on July  9, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A Centaur's Life. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   Digimon Adventure 02 5.6    2016-07-02 First Love Monster 5.7    Digimon Frontier 6.3    2006-09-08 Black Blood Brothers 7.4    2017-01-04 Akiba's Trip The Animation 8.8    2002-03-01 Digimon Tamers 5.9    2013-07-04 Danganronpa: The Animation 7.0    2004-07-10 DearS 5.0  Facts Original Name  セントールの悩み Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://centaur-anime.com/ Genres Animation Comedy Sci-Fi & Fantasy Keywords fantasy slice of life based on manga anime Content Score 64 We're so close, yet so far. Top Contributors 22 sp1ti 8 Despair-Paradise 7 Zorro1 R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}