{"link": "https://www.themoviedb.org/tv/712?language=en", "title": "Designing Women", "resume": "Designing Women is an American television sitcom that centered on the working and personal lives of four Southern women and one man in an interior design firm in Atlanta, Georgia. It aired on the CBS television network from September 29, 1986 until May 24, 1993. The show was created by head writer Linda Bloodworth-Thomason, who wrote many of the episodes in the show's initial seasons. As of 2011, the series currently airs in syndication on the Comedy Gold and TVGN channels.", "rate": 73, "genre": ["Comedy"], "cast": ["Annie Potts", "Delta Burke", "Meshach Taylor", "Jean Smart", "Dixie Carter"], "character": ["Mary-Jo Shively", "Suzanne Sugarbaker", "Anthony Bouvier", "Charlene Frazier Stillfield", "Julia Sugarbaker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 712   Expand Designing Women   (1986) User Score  Play Trailer Overview Designing Women is an American television sitcom that centered on the working and personal lives of four Southern women and one man in an interior design firm in Atlanta, Georgia. It aired on the CBS television network from September 29, 1986 until May 24, 1993. The show was created by head writer Linda Bloodworth-Thomason, who wrote many of the episodes in the show's initial seasons. As of 2011, the series currently airs in syndication on the Comedy Gold and TVGN channels. Featured Crew Linda Bloodworth-Thomason Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Annie Potts Mary-Jo Shively Delta Burke Suzanne Sugarbaker Meshach Taylor Anthony Bouvier Jean Smart Charlene Frazier Stillfield Dixie Carter Julia Sugarbaker Full Cast & Crew Last Season Season 8 2003 | 1 Episode Season 8 of Designing Women premiered on July 28, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Mary-Jo Shively: Happy Birthday Annie Potts! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   1981-10-29 Gimme a Break! 5.7    1976-08-31 Alice 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords career woman sitcom interior design workplace comedy Content Score 100 Yes! Looking good! Top Contributors 10 Banana RH 10 Rafael Herbert 3 Zlogorek 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}