{"link": "https://www.themoviedb.org/tv/58957?language=en", "title": "Nathan For You", "resume": "Self-proclaimed business expert, writer, director and comedian Nathan Fielder helps real small businesses turn a profit with marketing tactics that no ordinary consultant would dare to attempt. From driving foot traffic to an off-the-strip souvenir shop by using Hollywood flair and a Johnny Depp impersonator, to creating a rebate that can only be redeemed by climbing a mountain, to founding a coffee shop called \"Dumb Starbucks,” Nathan has always gone to the limit to make his ideas come to life. With his unorthodox approach to problem solving, Nathan’s genuine efforts to do good often draw the real people he encounters into an experience far beyond what they signed up for.", "rate": 80, "genre": ["Comedy"], "cast": ["Nathan Fielder"], "character": ["Nathan Fielder"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58957   Expand Nathan For You   (2013) User Score Overview Self-proclaimed business expert, writer, director and comedian Nathan Fielder helps real small businesses turn a profit with marketing tactics that no ordinary consultant would dare to attempt. From driving foot traffic to an off-the-strip souvenir shop by using Hollywood flair and a Johnny Depp impersonator, to creating a rebate that can only be redeemed by climbing a mountain, to founding a coffee shop called \"Dumb Starbucks,” Nathan has always gone to the limit to make his ideas come to life. With his unorthodox approach to problem solving, Nathan’s genuine efforts to do good often draw the real people he encounters into an experience far beyond what they signed up for. Featured Crew Michael Koman Creator Nathan Fielder Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nathan Fielder Nathan Fielder Full Cast & Crew Last Season Season 4 2017 | 7 Episodes Season 4 of Nathan For You premiered on September 28, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply What's with the holdup on season 4? Open 1 by  Nanook Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2013-01-16 Kroll Show 7.1    2001-04-01 Undergrads 6.3    2011-05-07 My Cat from Hell 6.4    2012-05-20 The Eric Andre Show 7.2    2010-05-16 Check It Out! with Dr. Steve Brule 8.5    2013-04-19 Alpha House 7.3    2014-03-06 Review 7.6    2013-07-09 Drunk History 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  21m Homepage   http://www.cc.com/shows/nathan-for-you Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings 5 lewisq94 4 Bendik v 3 veltshmerts  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}