{"link": "https://www.themoviedb.org/tv/9834?language=en", "title": "Little Bear", "resume": "Maurice Sendak's Little Bear is an educational Canadian children's television series based on the Little Bear series of books which were written by Else Holmelund Minarik, and illustrated by Maurice Sendak. Originally produced by Nelvana for Nickelodeon, it currently airs on Treehouse TV in Canada and Nick Jr. in the United States. It was first shown in the UK on the Children's BBC, and a part of Toy Box BBC video collection in the late 90s. It was also shown on Nick Jr UK and now airs on Tiny Pop. A direct-to-video/DVD full-length feature film was also created after the series ended.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9834   Expand Little Bear   (1995) User Score Overview Maurice Sendak's Little Bear is an educational Canadian children's television series based on the Little Bear series of books which were written by Else Holmelund Minarik, and illustrated by Maurice Sendak. Originally produced by Nelvana for Nickelodeon, it currently airs on Treehouse TV in Canada and Nick Jr. in the United States. It was first shown in the UK on the Children's BBC, and a part of Toy Box BBC video collection in the late 90s. It was also shown on Nick Jr UK and now airs on Tiny Pop. A direct-to-video/DVD full-length feature film was also created after the series ended. Featured Crew Jeff Goode Creator Maurice Sendak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1997 | 39 Episodes Season 3 of Little Bear premiered on September 14, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Little Bear. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 goodeyesoftware 4 marxc88 R 3 RWRiedel3 s 1 saisica  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}