{"link": "https://www.themoviedb.org/tv/1267?language=en", "title": "Acropolis Now", "resume": "Acropolis Now was an Australian sitcom set in a Greek cafe in Melbourne of the same name that ran for 63 episodes from 1989 to 1992 on the Seven Network. It was created by Nick Giannopoulos, George Kapiniaris and Simon Palomares, who also starred in the series. They were already quite well known for their comedy stage show, Wogs out of Work. The title is a play on the film Apocalypse Now. Each episode was 30 minutes in length and filmed in front of a live audience.\nJim's father asks him to run the family business, the Acropolis café, when he suddenly leaves Australia to return to his homeland Greece. The series centres around the activities of the cafe staff. Greek Jim Stephanidis, is the immature owner and his best friend, Spaniard Ricky Martinez is the sensible manager. Memo is the traditional Greek waiter, Liz is the liberated Australian waitress. Skip is the naïve new cook from the bush and Manolis is the stubborn cook from the old cafe. 'Hilarity' prevails from the clash of cultures and beliefs.\nJim's hairdresser cousin Effie, played by Mary Coustas, became a hugely popular and enduring character during the run of the show. Coustas later reprised the role for several TV specials and series including Effie, Just Quietly, an SBS comedy / interview show, and Greeks on the Roof, a short-lived Greek-Australian version of the British talk show The Kumars at No. 42.", "rate": 0, "genre": ["Comedy"], "cast": ["George Kapiniaris", "Simon Palomares", "Mary Coustas"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1267   Expand Acropolis Now   (1989) User Score Overview Acropolis Now was an Australian sitcom set in a Greek cafe in Melbourne of the same name that ran for 63 episodes from 1989 to 1992 on the Seven Network. It was created by Nick Giannopoulos, George Kapiniaris and Simon Palomares, who also starred in the series. They were already quite well known for their comedy stage show, Wogs out of Work. The title is a play on the film Apocalypse Now. Each episode was 30 minutes in length and filmed in front of a live audience. Jim's father asks him to run the family business, the Acropolis café, when he suddenly leaves Australia to return to his homeland Greece. The series centres around the activities of the cafe staff. Greek Jim Stephanidis, is the immature owner and his best friend, Spaniard Ricky Martinez is the sensible manager. Memo is the traditional Greek waiter, Liz is the liberated Australian waitress. Skip is the naïve new cook from the bush and Manolis is the stubborn cook from the old cafe. 'Hilarity' prevails from the clash of cultures and beliefs. Jim's hairdresser cousin Effie, played by Mary Coustas, became a hugely popular and enduring character during the run of the show. Coustas later reprised the role for several TV specials and series including Effie, Just Quietly, an SBS comedy / interview show, and Greeks on the Roof, a short-lived Greek-Australian version of the British talk show The Kumars at No. 42. Featured Crew Simon Palomares Creator George Kapiniaris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Kapiniaris Simon Palomares Mary Coustas Full Cast & Crew Last Season Season 5 1992 | 13 Episodes Season 5 of Acropolis Now premiered on August 12, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Acropolis Now. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors z 10 zurman1 6 lineker 5 Elizabeth Jennings 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}