{"link": "https://www.themoviedb.org/tv/5921?language=en", "title": "The Life & Times of Tim", "resume": "The Life & Times of Tim is an HBO comedy animated television series, which premiered on September 28, 2008. The series was created by Steve Dildarian, and is about a hapless man in his mid-20's named Tim who lives in New York City with his girlfriend Amy. Throughout the series, Tim constantly finds himself in increasingly awkward situations in both his work and personal life.\nThe first season aired in 2008 and has since been aired in numerous countries, and has developed a cult following. The second season debuted on February 19, 2010 on HBO. On June 4, 2010, HBO announced it was canceling the show. There were rumors that it was going to be picked up by another network. On the 16th of August, 2010, it was announced HBO had reversed their original decision to cancel the show, and as a result, a third season was ordered. Season 3 of The Life and Times of Tim premiered on December 16, 2011. The first season was released on DVD on February 9, 2010, the second season was released on DVD on December 13, 2011, and the third season was released on DVD on December 18, 2012.\nOn April 20, 2012, HBO cancelled the series after three seasons.\nThe theme song is \"I'll Never Get Out of This World Alive\" performed by country music star Hank Williams.", "rate": 77, "genre": ["Animation", "Comedy"], "cast": ["Lizzy Caplan", "Jennifer Coolidge", "Melanie Lynskey", "Judah Friedlander", "Nick Kroll"], "character": ["Actress", "Becky", "Ping Pong Guy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5921   Expand The Life & Times of Tim   (2008) User Score Overview The Life & Times of Tim is an HBO comedy animated television series, which premiered on September 28, 2008. The series was created by Steve Dildarian, and is about a hapless man in his mid-20's named Tim who lives in New York City with his girlfriend Amy. Throughout the series, Tim constantly finds himself in increasingly awkward situations in both his work and personal life. The first season aired in 2008 and has since been aired in numerous countries, and has developed a cult following. The second season debuted on February 19, 2010 on HBO. On June 4, 2010, HBO announced it was canceling the show. There were rumors that it was going to be picked up by another network. On the 16th of August, 2010, it was announced HBO had reversed their original decision to cancel the show, and as a result, a third season was ordered. Season 3 of The Life and Times of Tim premiered on December 16, 2011. The first season was released on DVD on February 9, 2010, the second season was released on DVD on December 13, 2011, and the third season was released on DVD on December 18, 2012. On April 20, 2012, HBO cancelled the series after three seasons. The theme song is \"I'll Never Get Out of This World Alive\" performed by country music star Hank Williams. Featured Crew Steve Dildarian Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lizzy Caplan Jennifer Coolidge Actress Melanie Lynskey Becky Judah Friedlander Ping Pong Guy Nick Kroll Full Cast & Crew Last Season Season 3 2011 | 20 Episodes Season 3 of The Life & Times of Tim premiered on December 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  13 Recommendations   2009-05-27 The Goode Family 6.0    2004-09-03 Green Wing 8.0    2007-09-05 Summer Heights High 7.4    2011-05-11 Angry Boys 6.5    60 Minutes 7.5    2004-05-18 The Mighty Boosh 7.5    2012-01-29 Luck 7.8    2009-03-20 Party Down 7.4  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  12m Homepage   http://www.hbo.com/the-life-and-times-of-tim Genres Animation Comedy Keywords crude humor adult animation swearing innuendo dirty joke Content Score 93 Almost there... Top Contributors a 16 alexmate 8 Elizabeth Jennings TB 2 TMDb Bot 2 quartier  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}