{"link": "https://www.themoviedb.org/tv/10094?language=en", "title": "Julia", "resume": "Julia is an American sitcom notable for being one of the first weekly series to depict an African American woman in a non-stereotypical role. Previous television series featured African American lead characters, but the characters were usually servants. The show stars actress and singer Diahann Carroll, and ran for 86 episodes on NBC from September 17, 1968 to March 23, 1971. The series was produced by Savannah Productions, Inc., Hanncar Productions, Inc., and 20th Century-Fox Television.\nDuring pre-production, the proposed series title was Mama's Man. The series was also unique in that it was among the few situation comedies in the late 1960s that did not use a laugh track; however, 20th Century-Fox Television added them when the series was reissued for syndication and cable rebroadcasts in the late 1980s.", "rate": 63, "genre": ["Comedy"], "cast": ["Diahann Carroll", "Lloyd Nolan", "Eugene Jackson", "Paul Winfield", "Lurene Tuttle"], "character": ["Julia Baker", "Dr. Morton Chegley", "Uncle Lou", "Paul Cameron", "Hannah Yarby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10094   Expand Julia   (1968) User Score Overview Julia is an American sitcom notable for being one of the first weekly series to depict an African American woman in a non-stereotypical role. Previous television series featured African American lead characters, but the characters were usually servants. The show stars actress and singer Diahann Carroll, and ran for 86 episodes on NBC from September 17, 1968 to March 23, 1971. The series was produced by Savannah Productions, Inc., Hanncar Productions, Inc., and 20th Century-Fox Television. During pre-production, the proposed series title was Mama's Man. The series was also unique in that it was among the few situation comedies in the late 1960s that did not use a laugh track; however, 20th Century-Fox Television added them when the series was reissued for syndication and cable rebroadcasts in the late 1980s. Featured Crew Hal Kanter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diahann Carroll Julia Baker Lloyd Nolan Dr. Morton Chegley Eugene Jackson Uncle Lou Paul Winfield Paul Cameron Lurene Tuttle Hannah Yarby Full Cast & Crew Last Season Season 3 1970 | 26 Episodes Season 3 of Julia premiered on September 15, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1981-05-16 SCTV Network 90 8.1    1970-09-24 The Odd Couple 7.1    1965-09-15 Green Acres 6.9    1975-01-23 Barney Miller 7.5    1963-09-17 The Fugitive 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords nurse single mother sitcom black sitcom Content Score 79 Pump it up! We're close now. Top Contributors 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}