{"link": "https://www.themoviedb.org/tv/35583?language=en", "title": "Guyver: The Bioboosted Armor", "resume": "Guyver: The Bioboosted Armor is a Japanese anime series based on the long-running manga series, Bio Booster Armor Guyver, written by Yoshiki Takaya, adapting chapters 1 - 59 of the manga. The production was in association with ADV Films and Kadokawa Shoten. The series first episode aired in Japan on August 6, 2005 and the last episode aired on February 18, 2006.\nThe series aired in North America on December 20, 2010, on the FUNimation Channel.", "rate": 65, "genre": ["Animation", "Action", "Adventure", "Mystery", "Action", "Adventure"], "cast": ["Nana Mizuki"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35583   Expand Guyver: The Bioboosted Armor   (2005) User Score Overview Guyver: The Bioboosted Armor is a Japanese anime series based on the long-running manga series, Bio Booster Armor Guyver, written by Yoshiki Takaya, adapting chapters 1 - 59 of the manga. The production was in association with ADV Films and Kadokawa Shoten. The series first episode aired in Japan on August 6, 2005 and the last episode aired on February 18, 2006. The series aired in North America on December 20, 2010, on the FUNimation Channel. Featured Crew Katsuhito Akiyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nana Mizuki Full Cast & Crew Last Season Season 1 2005 | 26 Episodes Season 1 of Guyver: The Bioboosted Armor premiered on August  6, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Guyver: The Bioboosted Armor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Action & Adventure Mystery Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 6 Marc d 6 denis 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}