{"link": "https://www.themoviedb.org/tv/2143?language=en", "title": "Dramarama", "resume": "Dramarama is the name of a British children's anthology series broadcast on ITV between 1983 and 1989. It tended to feature drama of a science fiction or supernatural bent. The series was created by Anna Home, then head of children's and youth programming at TVS, however production responsibilities were divided amongst most of the regional ITV franchise holders. Thus, each episode was in practice a one-off production with its own cast and crew, up to and including the executive producer.\nDramarama was largely a place for new talent to prove themselves and was a launching pad for the likes of Anthony Horowitz, Paul Abbott, Kay Mellor, Janice Hally, Tony Kearney, David Tennant and Ann Marie Di Mambro. It was one of Dennis Spooner's last credits.\nOne of Dramarama's episodes, \"Dodger, Bonzo And The Rest\", gained so much popularity that it was turned in to its own series the following year. It starred Lee Ross and was based around a large foster home. The episode \"Blackbird Singing In The Dead of Night\" was developed by Granada into the TV series Children's Ward. It was also repeated for the first time since its original broadcast on 5 January 2013, during CITV's 30th anniversary Old Skool Weekend. The Series 7 episode \"Back To Front\" – notable for featuring a mirror image of the Yorkshire Television logo card at the end – was repeated on 6 January 2013, again as part of CITV's 30th anniversary Old Skool Weekend.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Gary Oldman", "Nicholas Bond-Owen"], "character": ["Ben"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2143   Expand Dramarama   (1983) User Score Overview Dramarama is the name of a British children's anthology series broadcast on ITV between 1983 and 1989. It tended to feature drama of a science fiction or supernatural bent. The series was created by Anna Home, then head of children's and youth programming at TVS, however production responsibilities were divided amongst most of the regional ITV franchise holders. Thus, each episode was in practice a one-off production with its own cast and crew, up to and including the executive producer. Dramarama was largely a place for new talent to prove themselves and was a launching pad for the likes of Anthony Horowitz, Paul Abbott, Kay Mellor, Janice Hally, Tony Kearney, David Tennant and Ann Marie Di Mambro. It was one of Dennis Spooner's last credits. One of Dramarama's episodes, \"Dodger, Bonzo And The Rest\", gained so much popularity that it was turned in to its own series the following year. It starred Lee Ross and was based around a large foster home. The episode \"Blackbird Singing In The Dead of Night\" was developed by Granada into the TV series Children's Ward. It was also repeated for the first time since its original broadcast on 5 January 2013, during CITV's 30th anniversary Old Skool Weekend. The Series 7 episode \"Back To Front\" – notable for featuring a mirror image of the Yorkshire Television logo card at the end – was repeated on 6 January 2013, again as part of CITV's 30th anniversary Old Skool Weekend. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Oldman Ben Nicholas Bond-Owen Full Cast & Crew Last Season Season 7 1989 | 11 Episodes Season 7 of Dramarama premiered on June 12, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dramarama. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords anthology Content Score 56 We're so close, yet so far. Top Contributors 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}