{"link": "https://www.themoviedb.org/tv/67614?language=en", "title": "Premonitions", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Pascale Bussières", "Sophie Desmarais", "Mikhaïl Ahooja", "Jade Charbonneau"], "character": ["Clara Jacob", "Liliane Jacob", "Arnaud Jacob", "Félicia Jacob"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67614   Expand Premonitions   (2016) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Patrick Lowe Creator Estelle Bouchard Creator Charles-Olivier Michaud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pascale Bussières Clara Jacob Sophie Desmarais Liliane Jacob Mikhaïl Ahooja Arnaud Jacob Jade Charbonneau Félicia Jacob Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Premonitions premiered on August 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Premonitions. You can help by rating TV shows you've seen. Facts Original Name  Prémonitions Status  Cancelled Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  43m Homepage   http://premonitions.ca Genres Drama Sci-Fi & Fantasy Keywords psychic power Content Score 86 Almost there... Top Contributors 59 Banana GB 3 Guillaume Beyssac V 3 Vince m 1 malahayati121  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}