{"link": "https://www.themoviedb.org/tv/66806?language=en", "title": "Paquita Salas", "resume": "One of Spain's best talent agents in the '90s, Paquita now finds herself searching desperately for new stars after suddenly losing her biggest client.", "rate": 78, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66806   Expand Paquita Salas   (2016) User Score Overview One of Spain's best talent agents in the '90s, Paquita now finds herself searching desperately for new stars after suddenly losing her biggest client. Featured Crew Javier Ambrossi Creator Javier Calvo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 5 Episodes Season 2 of Paquita Salas premiered on June 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2015-12-13 LEGO Nexo Knights 6.0    2016-01-01 72 Cutest Animals 5.0  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage  - Genres Comedy Keywords female agent talent agent talent manager Content Score 64 We're so close, yet so far. Top Contributors 28 Medianoche 25 prm96 21 LasSeries 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}