{"link": "https://www.themoviedb.org/tv/31628?language=en", "title": "Pair of Kings", "resume": "Pair of Kings is an American television sitcom shown on the cable channel Disney XD. The sitcom's target audience are teenagers. The series began production on February 15, 2010, with stars Mitchel Musso and Doc Shaw departing fellow Disney series Hannah Montana and The Suite Life on Deck respectively, and premiered on September 10, 2010 on the Disney Channel. The show is filmed before a live studio audience. On November 20, 2010, Disney XD announced that Pair of Kings had been renewed for a second season, which premiered on June 13, 2011. In December 2011, the series was renewed for a third season, however Disney announced that Musso would be replaced with actor Adam Hicks who has worked with Disney on previous projects such as Zeke and Luther. The third season premiered on June 18, 2012. However, it was announced on Adam Hicks' Twitter page that Disney XD would not renew Pair of Kings for a fourth season.", "rate": 50, "genre": ["Action", "Adventure", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Mitchel Musso", "Ryan Ochoa", "Kelsey Asbille", "Geno Segers", "Adam Hicks"], "character": ["Brady", "Lanny", "Mikayla Makoola", "Mason Makoola", "King Boz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31628   Expand Pair of Kings   (2010) User Score Overview Pair of Kings is an American television sitcom shown on the cable channel Disney XD. The sitcom's target audience are teenagers. The series began production on February 15, 2010, with stars Mitchel Musso and Doc Shaw departing fellow Disney series Hannah Montana and The Suite Life on Deck respectively, and premiered on September 10, 2010 on the Disney Channel. The show is filmed before a live studio audience. On November 20, 2010, Disney XD announced that Pair of Kings had been renewed for a second season, which premiered on June 13, 2011. In December 2011, the series was renewed for a third season, however Disney announced that Musso would be replaced with actor Adam Hicks who has worked with Disney on previous projects such as Zeke and Luther. The third season premiered on June 18, 2012. However, it was announced on Adam Hicks' Twitter page that Disney XD would not renew Pair of Kings for a fourth season. Featured Crew Dan Cross Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitchel Musso Brady Ryan Ochoa Lanny Kelsey Asbille Mikayla Makoola Geno Segers Mason Makoola Adam Hicks King Boz Full Cast & Crew Last Season Season 3 2012 | 22 Episodes Season 3 of Pair of Kings premiered on June 18, 2012. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Mikayla: Happy Birthday Kelsey Chow! Open 0 by wonder2wonder\n      \n     w Brady: Happy Birthday Mitchel Musso! Open 0 by wonder2wonder\n      \n     w Lanny: Happy Birthday Ryan Ochoa! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2011-06-13 Kickin' It 6.5    2011-05-06 A.N.T. Farm 3.7    2012-02-27 Lab Rats 6.9    2008-10-25 Kid vs. Kat 4.5    2014-01-17 I Didn't Do It 6.8    2010-11-07 Shake It Up 2.8    2012-10-12 Dog With a Blog 5.3    2004-12-18 W.I.T.C.H. 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://disneyxd.disney.com/pair-of-kings Genres Action & Adventure Comedy Sci-Fi & Fantasy Keywords island sibling relationship one-sided love jungle king teenager twins evil dead parents sitcom Content Score 93 Almost there... Top Contributors 17 minusha97 12 Banana S 2 Samara 1 pedrosfh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}