{"link": "https://www.themoviedb.org/tv/11894?language=en", "title": "The Naked Truth", "resume": "The Naked Truth is an American television sitcom that aired on ABC from 1995 to 1996, and on NBC from 1996 to 1998. The series stars Téa Leoni and co-starred Holland Taylor. The show took place at the office of a tabloid news publication.", "rate": 72, "genre": ["Comedy"], "cast": ["Holland Taylor", "Tom Verica", "George Wendt", "Jonathan Penner", "Téa Leoni"], "character": ["Nora Wilde"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11894   Expand The Naked Truth   (1995) User Score Overview The Naked Truth is an American television sitcom that aired on ABC from 1995 to 1996, and on NBC from 1996 to 1998. The series stars Téa Leoni and co-starred Holland Taylor. The show took place at the office of a tabloid news publication. Featured Crew Chris Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Holland Taylor Tom Verica George Wendt Jonathan Penner Téa Leoni Nora Wilde Full Cast & Crew Last Season Season 3 1997 | 22 Episodes Season 3 of The Naked Truth premiered on September 22, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1995-03-21 NewsRadio 7.3    1992-09-23 Mad About You 6.0    1998-11-02 Becker 6.9    1995-09-13 The Drew Carey Show 6.4    1993-11-03 The Nanny 6.5    1998-09-21 Will & Grace 6.5    1996-01-09 3rd Rock from the Sun 7.3    1996-09-13 Everybody Loves Raymond 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords magazine tabloid sitcom Content Score 79 Pump it up! We're close now. Top Contributors 7 Banana 3 Steve 2 Zlogorek 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}