{"link": "https://www.themoviedb.org/tv/6623?language=en", "title": "Big Brother: After Dark", "resume": "Big Brother: After Dark was an uncensored, uncut live feed from the American Big Brother House while broadcast on Showtime2. The program debuted on July 5, 2007 as a companion show since Big Brother 8 and it aired on Showtime 2 in the United States and Slice in Canada.\nThe program was the only first-run original program produced specifically for any of Showtime's seven multiplex channels.\nOn May 29, 2013, it was announced that Big Brother: After Dark will move to TVGN beginning on June 26. While it was promoted by TVGN as remaining uncensored as it was on Showtime 2, on TVGN \"Big Brother: After Dark\" is now rated TV14 and censored for language by muting of the audio.. The network says that nine words and nudity will be censored from the show, though some profanity still goes through. The broadcast airs uncensored over Slice in Canada.\nA version of this program was also developed as a companion series to Big Brother Canada on Slice.", "rate": 80, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6623   Expand Big Brother: After Dark User Score Overview Big Brother: After Dark was an uncensored, uncut live feed from the American Big Brother House while broadcast on Showtime2. The program debuted on July 5, 2007 as a companion show since Big Brother 8 and it aired on Showtime 2 in the United States and Slice in Canada. The program was the only first-run original program produced specifically for any of Showtime's seven multiplex channels. On May 29, 2013, it was announced that Big Brother: After Dark will move to TVGN beginning on June 26. While it was promoted by TVGN as remaining uncensored as it was on Showtime 2, on TVGN \"Big Brother: After Dark\" is now rated TV14 and censored for language by muting of the audio.. The network says that nine words and nudity will be censored from the show, though some profanity still goes through. The broadcast airs uncensored over Slice in Canada. A version of this program was also developed as a companion series to Big Brother Canada on Slice. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 18 2016 | 9 Episodes Season 18 of Big Brother: After Dark premiered on June 24, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Facts Status  Ended Networks TVGN Certification  - Type  Scripted Original Language  English Runtime  180m, 120m Homepage  - Genres Reality Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 26 Elizabeth Jennings 3 ubed 2 Obong Squad A 1 Alexandria  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}