{"link": "https://www.themoviedb.org/tv/23374?language=en", "title": "The Mysterious Play", "resume": "Miaka, a junior high school student in Tokyo, has normal problems: fights with her mom, entrance exams, and deciding where's she's going to go eat with her friends. Then, she finds a mysterious book, the Universe of the Four Gods, in the library, and her life is changed forever when she and her friend Yui are transported into the book!\nUpon arriving in this new universe, the girls are immediately attacked by would-be slavers. Lucky for them that a dashing young man happens to be around! Saved from the would-be slavers, both girls are enthralled with him, but all he's really after is money! When Miaka isn't looking, both Tamahome and Yui vanish. Could he have kidnapped her to sell her for money?\nUnbeknownst to Miaka, Yui has been sucked back into the real world. Back in the library, all she can do is read on as her childhood friend sets out for the city to find the mysterious young boy and save her friend.\nBut what awaits for Miaka isn't what either of the girls expect - and now Miaka's only way back to her world is to become the Priestess of Suzaku and save their world.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Nobutoshi Canna", "Hikaru Midorikawa", "Takehito Koyasu", "Tomokazu Seki", "Yumi Touma"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23374   Expand The Mysterious Play   (1995) User Score Overview Miaka, a junior high school student in Tokyo, has normal problems: fights with her mom, entrance exams, and deciding where's she's going to go eat with her friends. Then, she finds a mysterious book, the Universe of the Four Gods, in the library, and her life is changed forever when she and her friend Yui are transported into the book! Upon arriving in this new universe, the girls are immediately attacked by would-be slavers. Lucky for them that a dashing young man happens to be around! Saved from the would-be slavers, both girls are enthralled with him, but all he's really after is money! When Miaka isn't looking, both Tamahome and Yui vanish. Could he have kidnapped her to sell her for money? Unbeknownst to Miaka, Yui has been sucked back into the real world. Back in the library, all she can do is read on as her childhood friend sets out for the city to find the mysterious young boy and save her friend. But what awaits for Miaka isn't what either of the girls expect - and now Miaka's only way back to her world is to become the Priestess of Suzaku and save their world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nobutoshi Canna Hikaru Midorikawa Takehito Koyasu Tomokazu Seki Yumi Touma Full Cast & Crew Last Season Original Air Date Original Air Date DVD Order (DVD) Season 1 1995 | 52 Episodes Season 1 of The Mysterious Play premiered on April  6, 1995. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for The Mysterious Play. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Mysterious Play. You can help by rating TV shows you've seen. Facts Original Name  ふしぎ遊戯 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Drama Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 38 Banana s 7 sheravi 5 matar12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}