{"link": "https://www.themoviedb.org/tv/18241?language=en", "title": "The Big O", "resume": "The Big O is a Japanese animated television series created by director Kazuyoshi Katayama and writer Chiaki J. Konaka for Sunrise. The writing staff was assembled by the series' head writer, Chiaki J. Konaka who is known for his work in the Digimon season, Digimon Tamers.\nThe story takes place forty years after a mysterious occurrence causes the residents of Paradigm City to lose their memories. The series follows Roger Smith, Paradigm City's top Negotiator. He provides this much needed service with the help of a Gynoid named R. Dorothy Wayneright and his butler Norman Burg. When the need arises, Roger calls upon Big O, a giant relic from the city's past.\nThe television series is designed as a tribute to Japanese and Western shows from the 1960s and 1970s. The series is done in the style of film noir and combines the feel of a detective show with the mecha genre of anime. The setpieces are reminiscent of Toho kaiju movies and the score is an eclectic mix of styles and musical homages.\nThe Big O premiered 13 October 1999 on WOWOW satellite television. It finished its run on 19 January 2000. The English-language version premiered on Cartoon Network on 2 April 2001 and ended on 18 April 2001. Originally a 26 episode series, low viewership in Japan cut it down to the just first 13. However, positive fan response internationally resulted in a second season co-produced by Cartoon Network, Sunrise, and Bandai Visual consisting of the remaining 13 episodes. Season two premiered on Japan's SUN-TV on January 2003, with the American premiere taking place seven months later. Following the closure of Bandai Entertainment in 2012, Sunrise had announced at Otakon 2013, that both seasons of The Big O along with a handful of former BEI titles would be rescued by Sentai Filmworks.", "rate": 73, "genre": ["Animation", "Drama", "Action", "Adventure"], "cast": ["Alan Oppenheimer", "Crispin Freeman", "Michael McConnohie", "Emi Shinohara", "Gorō Naya"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18241   Expand The Big O   (2001) User Score Overview The Big O is a Japanese animated television series created by director Kazuyoshi Katayama and writer Chiaki J. Konaka for Sunrise. The writing staff was assembled by the series' head writer, Chiaki J. Konaka who is known for his work in the Digimon season, Digimon Tamers. The story takes place forty years after a mysterious occurrence causes the residents of Paradigm City to lose their memories. The series follows Roger Smith, Paradigm City's top Negotiator. He provides this much needed service with the help of a Gynoid named R. Dorothy Wayneright and his butler Norman Burg. When the need arises, Roger calls upon Big O, a giant relic from the city's past. The television series is designed as a tribute to Japanese and Western shows from the 1960s and 1970s. The series is done in the style of film noir and combines the feel of a detective show with the mecha genre of anime. The setpieces are reminiscent of Toho kaiju movies and the score is an eclectic mix of styles and musical homages. The Big O premiered 13 October 1999 on WOWOW satellite television. It finished its run on 19 January 2000. The English-language version premiered on Cartoon Network on 2 April 2001 and ended on 18 April 2001. Originally a 26 episode series, low viewership in Japan cut it down to the just first 13. However, positive fan response internationally resulted in a second season co-produced by Cartoon Network, Sunrise, and Bandai Visual consisting of the remaining 13 episodes. Season two premiered on Japan's SUN-TV on January 2003, with the American premiere taking place seven months later. Following the closure of Bandai Entertainment in 2012, Sunrise had announced at Otakon 2013, that both seasons of The Big O along with a handful of former BEI titles would be rescued by Sentai Filmworks. Featured Crew Hajime Yatate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Oppenheimer Crispin Freeman Michael McConnohie Emi Shinohara Gorō Naya Full Cast & Crew Last Season Season 2 2003 | 13 Episodes Season 2 of The Big O premiered on August  3, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2010-07-12 Scooby-Doo! Mystery Incorporated 7.4  Facts Original Name  The ビッグオー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Drama Action & Adventure Keywords detective mecha Content Score 93 Almost there... Top Contributors 8 BrerFox 6 Razze l 6 l2010 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}