{"link": "https://www.themoviedb.org/tv/76068?language=en", "title": "Longing Heart", "resume": "Kang Shin-Woo is a math teacher with a good looking appearance. He has not forgotten his first love Han Ji-Soo for the past 10 years. By an accident, he travels to the past when he was a high school student. There, he meets his younger self. Kang Shin-Woo struggles to make the younger Kang Shin-Woo's love come true.", "rate": 60, "genre": ["Comedy"], "cast": ["Lee Jung-Shin", "Seo Ji-Hoon", "Lee Yeol-eum", "Jo Seung-Hee"], "character": ["Kang Shin-Woo", "Kang Shin-Woo (18 years old)", "Han Ji-Soo", "Baek Na-Hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76068   Expand Longing Heart   (2018) User Score Overview Kang Shin-Woo is a math teacher with a good looking appearance. He has not forgotten his first love Han Ji-Soo for the past 10 years. By an accident, he travels to the past when he was a high school student. There, he meets his younger self. Kang Shin-Woo struggles to make the younger Kang Shin-Woo's love come true. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jung-Shin Kang Shin-Woo Seo Ji-Hoon Kang Shin-Woo (18 years old) Lee Yeol-eum Han Ji-Soo Jo Seung-Hee Baek Na-Hee Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Longing Heart premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Longing Heart. You can help by rating TV shows you've seen. Facts Original Name  애간장 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/ocn/myfirstlove/ Genres Comedy Keywords based on comic romance Content Score 86 Almost there... Top Contributors M 29 Maria180493 3 Alex2017 1 Elizabeth Jennings 1 adamsp09  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}