{"link": "https://www.themoviedb.org/tv/4619?language=en", "title": "Blade - The Series", "resume": "Blade: The Series is a 2006 American live-action television program based on the Marvel Comics character and film series. It premiered on Spike on June 28, 2006. Kirk \"Sticky Fingaz\" Jones starred in the title role, along with Jill Wagner as Krista Starr, Neil Jackson as Marcus Van Sciver, Jessica Gower as Chase and Nelson Lee as Shen.\nThe two-hour pilot was directed by Peter O'Fallon from a script by David S. Goyer and comic book writer Geoff Johns.", "rate": 65, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jill Wagner", "Sticky Fingaz", "Neil Jackson", "Jessica Gower", "Nelson Lee"], "character": ["Krista Starr", "Blade", "Marcus Van Sciver", "Chase", "Shen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4619   Expand Blade - The Series   (2006) User Score  Play Trailer Overview Blade: The Series is a 2006 American live-action television program based on the Marvel Comics character and film series. It premiered on Spike on June 28, 2006. Kirk \"Sticky Fingaz\" Jones starred in the title role, along with Jill Wagner as Krista Starr, Neil Jackson as Marcus Van Sciver, Jessica Gower as Chase and Nelson Lee as Shen. The two-hour pilot was directed by Peter O'Fallon from a script by David S. Goyer and comic book writer Geoff Johns. Featured Crew David S. Goyer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jill Wagner Krista Starr Sticky Fingaz Blade Neil Jackson Marcus Van Sciver Jessica Gower Chase Nelson Lee Shen Full Cast & Crew Last Season Season 1 2006 | 12 Episodes Season 1 of Blade - The Series premiered on June 28, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Blade - The Series. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  6 Recommendations   2005-12-10 Painkiller Jane 6.0    2007-09-26 Bionic Woman 5.5    2000-06-09 The Invisible Man 7.2    2006-03-07 The Unit 7.1    2002-09-20 John Doe 7.5    2008-11-23 Survivors 7.2    2002-05-13 Spooks 7.5    2006-06-26 Kyle XY 7.0  Facts Status  Ended Network Certification 18 Meaning Can be aired only from 11:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Action & Adventure Drama Keywords undercover vampire based on comic Content Score 100 Yes! Looking good! Top Contributors 13 Banana s 13 stingray23 AK 11 Avshalom Kor p 6 plumpa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}