{"link": "https://www.themoviedb.org/tv/3126?language=en", "title": "Byker Grove", "resume": "Byker Grove was a British television series which aired between 1989 and 2006 and was created by Adele Rose. The show was broadcast at 5.10pm after Newsround on CBBC on BBC One. It was aimed at an older teenager and young adult audience, tackling serious and sometimes controversial storylines.", "rate": 63, "genre": ["Drama"], "cast": ["Declan Donnelly", "Andrew Hayden-Smith", "Donna Air", "Caspar Berry", "Nicola Bell"], "character": ["Duncan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3126   Expand Byker Grove   (1989) User Score Overview Byker Grove was a British television series which aired between 1989 and 2006 and was created by Adele Rose. The show was broadcast at 5.10pm after Newsround on CBBC on BBC One. It was aimed at an older teenager and young adult audience, tackling serious and sometimes controversial storylines. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Declan Donnelly Duncan Andrew Hayden-Smith Donna Air Caspar Berry Nicola Bell Full Cast & Crew Last Season Season 18 2006 | 20 Episodes Season 18 of Byker Grove premiered on October  7, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2002-11-14 Harry Hill's TV Burp 7.2    1995-09-14 They Think It's All Over 7.3    1990-11-08 Harry Enfield's Television Programme 7.6    1984-02-26 Spitting Image 7.8    1994-07-04 Room 101 5.9    2000-01-12 That Peter Kay Thing 6.4    1973-01-09 Whatever Happened to the Likely Lads? 7.8    1978-02-08 Grange Hill 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.bbc.co.uk/cbbc/yourlife/bykergrove/ Genres Drama Keywords youth center newcastle upon tyne Content Score 71 Just a little bit more... Top Contributors 19 Banana 9 seawolf 6 rudely_murray 3 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}