{"link": "https://www.themoviedb.org/tv/55011?language=en", "title": "Gargantia on the Verdurous Planet", "resume": "Gargantia on the Verdurous Planet is a Japanese anime television series produced by Production I.G and directed by Kazuya Murata, and aired between April and June 2013.", "rate": 67, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kaito Ishikawa", "Hisako Kanemoto", "Shizuka Itou", "Kayano Ai", "Kana Asumi"], "character": ["Ledo", "Amy", "Bellows", "Grace", "Melty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55011   Expand Gargantia on the Verdurous Planet   (2013) User Score Overview Gargantia on the Verdurous Planet is a Japanese anime television series produced by Production I.G and directed by Kazuya Murata, and aired between April and June 2013. Featured Crew Kazuya Murata Creator Gen Urobuchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaito Ishikawa Ledo Hisako Kanemoto Amy Shizuka Itou Bellows Kayano Ai Grace Kana Asumi Melty Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Gargantia on the Verdurous Planet premiered on April  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2016-03-21 72 Dangerous Places to Live 6.0    2014-07-05 Aldnoah.Zero 6.6    2014-04-11 Knights of Sidonia 7.9    2014-05-16 Magi: Adventure of Sinbad 6.7    2013-10-05 Log Horizon 7.8    2013-04-04 The Devil Is a Part-Timer! 7.1    2008-04-07 Soul Eater 7.0    2013-10-04 Kill la Kill 7.7  Facts Original Name  翠星のガルガンティア Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://gargantia.jp/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords artificial intelligence civilization space mecha anime Content Score 93 Almost there... Top Contributors 28 Nakirasu 15 Indi 8 BrerFox 8 miryoku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}