{"link": "https://www.themoviedb.org/tv/31580?language=en", "title": "Heart of a Samurai", "resume": "Tenchijin is the 48th NHK Taiga drama. It airs on NHK from January 4, 2009 every Sunday from 20:00 to 20:44 JST to November 22, 2009 spanning 47 episodes. The story centers on the life of the 16th century samurai Naoe Kanetsugu.\nProduction began on April 27, 2007. The story is based on the novel Tenchijin by Masashi Hisaka and was adapted for screen by scriptwriter Eriko Komatsu. The series' music composer was Michiru Oshima.\nThe protagonist of the drama, Naoe Kanetsugu, was taught by Uesugi Kenshin in his youth that to conquer the world is a trifling matter, but what matters is to live one's life with righteousness. After Uesugi's death, Naoe supports Uesugi Kagekatsu, who holds the destiny of Echigo province.", "rate": 0, "genre": ["Drama"], "cast": ["Satoshi Tsumabuki", "Hiroshi Abe", "Michiko Kichise", "Saki Aibu", "Masami Nagasawa"], "character": ["Kenshin Uesugi", "Oyū", "Hanahime"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31580   Expand Heart of a Samurai   (2009) User Score Overview Tenchijin is the 48th NHK Taiga drama. It airs on NHK from January 4, 2009 every Sunday from 20:00 to 20:44 JST to November 22, 2009 spanning 47 episodes. The story centers on the life of the 16th century samurai Naoe Kanetsugu. Production began on April 27, 2007. The story is based on the novel Tenchijin by Masashi Hisaka and was adapted for screen by scriptwriter Eriko Komatsu. The series' music composer was Michiru Oshima. The protagonist of the drama, Naoe Kanetsugu, was taught by Uesugi Kenshin in his youth that to conquer the world is a trifling matter, but what matters is to live one's life with righteousness. After Uesugi's death, Naoe supports Uesugi Kagekatsu, who holds the destiny of Echigo province. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satoshi Tsumabuki Hiroshi Abe Kenshin Uesugi Michiko Kichise Oyū Saki Aibu Hanahime Masami Nagasawa Full Cast & Crew Last Season Tenchijin season 1 2009 | 47 Episodes Season 1 of Heart of a Samurai premiered on January  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Heart of a Samurai. You can help by rating TV shows you've seen. Facts Original Name  天地人 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  50m Homepage  - Genres Drama Keywords taiga drama Content Score 86 Almost there... Top Contributors A 7 Aka75 s 3 speedycars 3 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}