{"link": "https://www.themoviedb.org/tv/70873?language=en", "title": "I'm Your Destiny", "resume": "Makoto Masaki and Haruko Kogetsu are both 29 years old and single. Since they were children, they have passed each other at various places like on the beach and shrines. Yet, the two are not aware of each other at all. One day, a man appears in front of Makoto Masaki and introduces himself as God. He tells Makoto Masaki about his destined soul mate and that she works next door. When he faces Haruko Kogetsu, he tells her \"I'm your destiny.\"", "rate": 33, "genre": ["Comedy"], "cast": ["Kazuya Kamenashi", "Fumino Kimura", "Tomohisa Yamashita", "Nanao", "Yu Sawabe"], "character": ["Makoto Masaki", "Haruko Kogetsu", "Mysterious man", "Sankei Yotsuya", "Kazuo Katsuragi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70873   Expand I'm Your Destiny   (2017) User Score Overview Makoto Masaki and Haruko Kogetsu are both 29 years old and single. Since they were children, they have passed each other at various places like on the beach and shrines. Yet, the two are not aware of each other at all. One day, a man appears in front of Makoto Masaki and introduces himself as God. He tells Makoto Masaki about his destined soul mate and that she works next door. When he faces Haruko Kogetsu, he tells her \"I'm your destiny.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kazuya Kamenashi Makoto Masaki Fumino Kimura Haruko Kogetsu Tomohisa Yamashita Mysterious man Nanao Sankei Yotsuya Yu Sawabe Kazuo Katsuragi Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of I'm Your Destiny premiered on April 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I'm Your Destiny. You can help by rating TV shows you've seen. Facts Original Name  ボク、運命の人です。 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ntv.co.jp/boku-unmei/ Genres Comedy Keywords japan romance Content Score 86 Almost there... Top Contributors M 41 Maria180493 5 Elizabeth Jennings g 3 g6man i 3 innocence1211  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}