{"link": "https://www.themoviedb.org/tv/60182?language=en", "title": "The Wrong Mans", "resume": "Comedy thriller about two well-meaning idiots who become entangled in a hideous world of crime, conspiracy and corruption.", "rate": 76, "genre": ["Comedy"], "cast": ["Mathew Baynton", "James Corden"], "character": ["Sam", "Phil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60182   Expand The Wrong Mans   (2013) User Score  Play Trailer Overview Comedy thriller about two well-meaning idiots who become entangled in a hideous world of crime, conspiracy and corruption. Featured Crew James Corden Creator Mathew Baynton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mathew Baynton Sam James Corden Phil Full Cast & Crew Last Season Season 2 2014 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2012-08-30 Good Cop 6.6    2006-01-01 In Justice 6.8    2015-06-30 Not Safe for Work 7.3    2011-06-05 Case Histories 8.2    2015-04-15 The Delivery Man 6.5    2011-01-13 Kidnap and Ransom 7.6    2011-03-22 White Van Man 6.5    2015-04-06 Code of a Killer 7.0  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p02bhkmm Genres Comedy Keywords hostage mistaken identity british comedy british humour Content Score 71 Just a little bit more... Top Contributors 21 Joe Carson 15 Banana 12 Elizabeth Jennings z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}