{"link": "https://www.themoviedb.org/tv/72092?language=en", "title": "Xuan-Yuan Sword: Han Cloud", "resume": "After the ancient Emperor defeated the demons, the shattered sword was broken into two parts. Two sword spirits were born - Zhaoyun and Muyun. However, due to the chaos caused by the battles, the two brothers were separated since birth. Zhaoyun was raised by a group of warriors called Flying Feathers, in charge of aiding Gong Yangxiang’s quest to expand the Kingdom of Xiaoyue; while Muyun was under the Bronze Bird army of Wei Kingdom, who are cruel and oppressive, and often invade the neighboring countries. The two brothers were reunited in a battle between their kingdoms. When Zhaoyun discovers the truth, he uses their bloodline to save Muyun from danger.\nThe kind-hearted Zhaoyun was heartbroken to see the people suffering due to war. With the help of Yeyaxi, a princess from a tribe, the two brothers worked together and overcame dangerous and difficult situations. In the end, they found the Emperor sword which symbolizes justice, using it to defeat the cruel and barbaric Chun Yuyue, therefore destroying the Bronze Bird army and bringing peace back to the world.", "rate": 40, "genre": ["Drama"], "cast": ["Leon Zhang", "Alan Yu", "Guan Xiao Tong", "Karlina Zhang", "Vengo Gao"], "character": ["Zhao Yun", "Mu Yun", "Ye Ya Xi", "Heng Ai", "Zi Yi Zun Zhe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72092   Expand Xuan-Yuan Sword: Han Cloud   (2017) User Score Overview After the ancient Emperor defeated the demons, the shattered sword was broken into two parts. Two sword spirits were born - Zhaoyun and Muyun. However, due to the chaos caused by the battles, the two brothers were separated since birth. Zhaoyun was raised by a group of warriors called Flying Feathers, in charge of aiding Gong Yangxiang’s quest to expand the Kingdom of Xiaoyue; while Muyun was under the Bronze Bird army of Wei Kingdom, who are cruel and oppressive, and often invade the neighboring countries. The two brothers were reunited in a battle between their kingdoms. When Zhaoyun discovers the truth, he uses their bloodline to save Muyun from danger. The kind-hearted Zhaoyun was heartbroken to see the people suffering due to war. With the help of Yeyaxi, a princess from a tribe, the two brothers worked together and overcame dangerous and difficult situations. In the end, they found the Emperor sword which symbolizes justice, using it to defeat the cruel and barbaric Chun Yuyue, therefore destroying the Bronze Bird army and bringing peace back to the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leon Zhang Zhao Yun Alan Yu Mu Yun Guan Xiao Tong Ye Ya Xi Karlina Zhang Heng Ai Vengo Gao Zi Yi Zun Zhe Full Cast & Crew Last Season Season 1 2017 | 58 Episodes Season 1 of Xuan-Yuan Sword: Han Cloud premiered on August 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Xuan-Yuan Sword: Han Cloud. You can help by rating TV shows you've seen. Facts Original Name  軒轅劍之漢之雲 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/5664044761 Genres Drama Keywords fantasy china romance based on video game xianxia Content Score 86 Almost there... Top Contributors M 38 Maria180493 s 2 sinistervn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}