{"link": "https://www.themoviedb.org/tv/35305?language=en", "title": "The Ricky Gervais Show", "resume": "The Ricky Gervais Show is an American cartoon series produced for and broadcast by HBO and Channel 4. The series is an animated version of the popular British audio podcasts and audiobooks of the same name, which feature Ricky Gervais and Stephen Merchant, along with colleague and friend Karl Pilkington, talking about various subjects behind the microphone. The TV show consists of past audio recordings of these unscripted \"pointless conversations,\" with animation drawn in a style similar to classic era Hanna-Barbera cartoons, presenting jokes and situations in a literal context.\nThe animated Ricky Gervais Show has aired 39 episodes across three seasons since it premiered in 2010. There were some plans for a possible fourth season which would have used newly recorded audio, but this was shelved in June 2012. Series 3 of The Ricky Gervais Show premiered on 20 April 2012 on HBO, and on 8 May 2012 on E4.", "rate": 79, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35305   Expand The Ricky Gervais Show   (2010) User Score Overview The Ricky Gervais Show is an American cartoon series produced for and broadcast by HBO and Channel 4. The series is an animated version of the popular British audio podcasts and audiobooks of the same name, which feature Ricky Gervais and Stephen Merchant, along with colleague and friend Karl Pilkington, talking about various subjects behind the microphone. The TV show consists of past audio recordings of these unscripted \"pointless conversations,\" with animation drawn in a style similar to classic era Hanna-Barbera cartoons, presenting jokes and situations in a literal context. The animated Ricky Gervais Show has aired 39 episodes across three seasons since it premiered in 2010. There were some plans for a possible fourth season which would have used newly recorded audio, but this was shelved in June 2012. Series 3 of The Ricky Gervais Show premiered on 20 April 2012 on HBO, and on 8 May 2012 on E4. Featured Crew Ricky Gervais Creator Stephen Merchant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2012 | 13 Episodes Season 3 of The Ricky Gervais Show premiered on April 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  5 Recommendations   2010-09-23 An Idiot Abroad 7.8    2005-07-21 Extras 7.8    2008-01-04 Between Two Ferns with Zach Galifianakis 8.1    2004-05-18 The Mighty Boosh 7.5    2001-07-09 The Office 8.1    2011-11-10 Life's Too Short 7.1    2007-06-17 Flight of the Conchords 7.9    2006-02-27 Snuff Box 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hbo.com/the-ricky-gervais-show/index.html Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 A 4 AnthonyAtkins232 s 3 speedycars 3 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}