{"link": "https://www.themoviedb.org/tv/17438?language=en", "title": "Boys Over Flowers", "resume": "Hana Yori Dango is a Japanese television drama series, broadcast on TBS in 2005. It is based on Japanese shōjo manga series, Boys Over Flowers, written by Yoko Kamio. The series is the third television adaptation of the manga following Meteor Garden and its sequel Meteor Garden II in Taiwan. It also resulted in a sequel Hana Yori Dango Returns and a movie adaptation Hana Yori Dango Final. It was one of the most popular dramas of the year and won many major awards.", "rate": 86, "genre": ["Comedy"], "cast": ["Mao Inoue", "Jun Matsumoto", "Shun Oguri", "Shota Matsuda", "Tsuyoshi Abe"], "character": ["Tsukushi Makino", "Tsukasa Domyouji", "Rui Hanazawa", "Sojiro Nishikado", "Akira Mimasaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17438   Expand Boys Over Flowers   (2005) User Score Overview Hana Yori Dango is a Japanese television drama series, broadcast on TBS in 2005. It is based on Japanese shōjo manga series, Boys Over Flowers, written by Yoko Kamio. The series is the third television adaptation of the manga following Meteor Garden and its sequel Meteor Garden II in Taiwan. It also resulted in a sequel Hana Yori Dango Returns and a movie adaptation Hana Yori Dango Final. It was one of the most popular dramas of the year and won many major awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mao Inoue Tsukushi Makino Jun Matsumoto Tsukasa Domyouji Shun Oguri Rui Hanazawa Shota Matsuda Sojiro Nishikado Tsuyoshi Abe Akira Mimasaka Full Cast & Crew Last Season Season 2 2007 | 11 Episodes Season 2 of Boys Over Flowers premiered on January  5, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Boys Over Flowers. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2009-10-07 You're Beautiful 7.9    2002-04-17 Gokusen 7.5    2006-01-11 Princess Hours 6.7    2011-06-06 Switched at Birth 6.1    2014-02-17 Star-Crossed 5.6    2008-09-03 Lost in Austen 7.2    2005-01-03 Medium 6.4    1994-09-22 Friends 7.8  Facts Original Name  花より男子 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.tbs.co.jp/hanayoridango/ Genres Comedy Keywords rich man poor woman Content Score 86 Almost there... Top Contributors 17 Wendy A 15 Aka75 s 5 sheva_vitali NS 5 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}