{"link": "https://www.themoviedb.org/tv/6326?language=en", "title": "Dog Whisperer", "resume": "Cesar Millan has been called the Dr. Phil for Dogs. With an uncanny ability to rehabilitate problem dogs of all shapes and sizes. Each episode of the Dog Whisperer documents the remarkable transformations that take place under Cesar's guidance and teaching, helping dogs and their owners live happier lives together.", "rate": 79, "genre": ["Family"], "cast": ["Cesar Millan"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6326   Expand Dog Whisperer   (2004) User Score Overview Cesar Millan has been called the Dr. Phil for Dogs. With an uncanny ability to rehabilitate problem dogs of all shapes and sizes. Each episode of the Dog Whisperer documents the remarkable transformations that take place under Cesar's guidance and teaching, helping dogs and their owners live happier lives together. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cesar Millan Himself Full Cast & Crew Last Season Season 4 2013 | 18 Episodes Season 4 of Dog Whisperer premiered on December  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Dog Whisperer. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Reality Original Language  English Runtime  60m Homepage   http://channel.nationalgeographic.com/channel/dogwhisperer/ Genres Family Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors p 11 planner0 9 United600 D 4 Daniel S 4 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}