{"link": "https://www.themoviedb.org/tv/39259?language=en", "title": "Pan Am", "resume": "Pan Am is an American period drama television series created by writer Jack Orman. Named for the iconic Pan American World Airways, the series features the pilots and stewardesses of the airline as it operated in the early 1960s at the beginning of the commercial Jet Age.", "rate": 58, "genre": ["Drama"], "cast": ["Christina Ricci", "Margot Robbie", "Michael Mosley", "Karine Vanasse", "Mike Vogel"], "character": ["Maggie Ryan", "Laura Cameron", "Ted Vanderway", "Colette Valois", "Dean Lowrey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39259   Expand Pan Am   (2011) User Score Overview Pan Am is an American period drama television series created by writer Jack Orman. Named for the iconic Pan American World Airways, the series features the pilots and stewardesses of the airline as it operated in the early 1960s at the beginning of the commercial Jet Age. Featured Crew Nancy Hult Ganis Creator Jack Orman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Ricci Maggie Ryan Margot Robbie Laura Cameron Michael Mosley Ted Vanderway Karine Vanasse Colette Valois Mike Vogel Dean Lowrey Full Cast & Crew Last Season Season 1 2011 | 14 Episodes Season 1 of Pan Am premiered on September 25, 2011. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Why was this cancelled? Open 0 by MongoLloyd\n      \n     shame Open 1 by  Jacinto Cupboard Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   2001-05-26 Messiah 8.0    2005-06-05 The Comeback 7.6    2009-06-04 Royal Pains 6.4    2014-08-23 Intruders 6.5    2015-09-16 Moonbeam City 5.5    2014-08-04 Partners 5.1    1982-09-20 Smiley's People 7.9    1995-09-21 Caroline in the City 6.7  Facts Status  Cancelled Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.abc.go.com/shows/pan-am Genres Drama Keywords paris parent child relationship jfk international airport pilot period drama airline 1960s Content Score 93 Almost there... Top Contributors T 23 Thuresson 14 Banana 12 Elizabeth Jennings R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}