{"link": "https://www.themoviedb.org/tv/9768?language=en", "title": "Nanny and the Professor", "resume": "Nanny and the Professor is an American fantasy situation comedy created by AJ Carothers and Thomas L. Miller for 20th Century Fox Television. During pre-production, the proposed title was Nanny Will Do.", "rate": 47, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Juliet Mills", "Richard Long", "Trent Lehman", "Kim Richards", "David Doremus"], "character": ["Nanny", "Prudence"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9768   Expand Nanny and the Professor   (1970) User Score Overview Nanny and the Professor is an American fantasy situation comedy created by AJ Carothers and Thomas L. Miller for 20th Century Fox Television. During pre-production, the proposed title was Nanny Will Do. Featured Crew AJ Carothers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Juliet Mills Nanny Richard Long Trent Lehman Kim Richards Prudence David Doremus Full Cast & Crew Last Season Season 3 1971 | 15 Episodes Season 3 of Nanny and the Professor premiered on September 13, 1971. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Prudence: Happy Birthday Kim Richards! Open 1 by  LastLion Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1969-09-23 Marcus Welby, M.D. 6.8    1949-09-15 The Lone Ranger 5.4    1968-09-21 Adam-12 6.7    1957-09-18 Wagon Train 6.3    1963-09-29 My Favorite Martian 5.4    1971-09-17 McMillan & Wife 7.2    1968-09-28 The Ghost & Mrs. Muir 6.7    1966-09-12 Family Affair 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 2 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}