{"link": "https://www.themoviedb.org/tv/68375?language=en", "title": "Trailer Park Boys: Out of the Park: Europe", "resume": "A lot of liquor an whores, mustard and bologna, maybe some cigarettes and dope, but mostly just liquor and whores, cigarettes and balogna, as well as mustard and dope.", "rate": 61, "genre": ["Action", "Adventure", "Comedy"], "cast": ["John Paul Tremblay", "Robb Wells", "Mike Smith"], "character": ["Julian", "Ricky", "Bubbles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68375   Expand Trailer Park Boys: Out of the Park: Europe   (2016) User Score  Play Trailer Overview A lot of liquor an whores, mustard and bologna, maybe some cigarettes and dope, but mostly just liquor and whores, cigarettes and balogna, as well as mustard and dope. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Paul Tremblay Julian Robb Wells Ricky Mike Smith Bubbles Full Cast & Crew Current Season Season 2 2017 | 8 Episodes Season 2 of Trailer Park Boys: Out of the Park: Europe premiered on November 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2008-10-20 Danny Dyer's Deadliest Men 7.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://www.netflix.com/id/title/80094260 Genres Action & Adventure Comedy Keywords trailer park Content Score 64 We're so close, yet so far. Top Contributors MP 85 Mr Pokekmen 17 Elizabeth Jennings m 3 micaela.ara 2 meliel1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}