{"link": "https://www.themoviedb.org/tv/4593?language=en", "title": "The French Chef", "resume": "The French Chef is a television cooking show created and hosted by Julia Child, and produced and broadcast by WGBH, the public television station in Boston, Massachusetts, from February 11, 1963 to 1973. It was one of the first cooking shows on American television.\nThe show grew out of some special presentations that Child did based on the book Mastering the Art of French Cooking, which she had co-authored. The French Chef was produced from 1963 to 1973 by WGBH for National Educational Television. Reruns continued on PBS until 1989, and currently air on Cooking Channel as of 2010.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4593   Expand The French Chef   (1963) User Score Overview The French Chef is a television cooking show created and hosted by Julia Child, and produced and broadcast by WGBH, the public television station in Boston, Massachusetts, from February 11, 1963 to 1973. It was one of the first cooking shows on American television. The show grew out of some special presentations that Child did based on the book Mastering the Art of French Cooking, which she had co-authored. The French Chef was produced from 1963 to 1973 by WGBH for National Educational Television. Reruns continued on PBS until 1989, and currently air on Cooking Channel as of 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 10 — | 15 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The French Chef. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  28m, 30m, 29m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors G 1 Gonçalo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}