{"link": "https://www.themoviedb.org/tv/24?language=en", "title": "Presidio Med", "resume": "Presidio Med is an American medical drama that aired on CBS from September 2002, to January 2003. The series centers on a San Francisco hospital. It was created by John Wells and Lydia Woodward, who also created ER.", "rate": 0, "genre": ["Drama"], "cast": ["Dana Delany", "Paul Blackthorne", "David Kaufman", "Anna Deavere Smith", "Blythe Danner"], "character": ["Dr. Rae Brennan", "Dr. Matt Slingerland"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24   Expand Presidio Med   (2002) User Score Overview Presidio Med is an American medical drama that aired on CBS from September 2002, to January 2003. The series centers on a San Francisco hospital. It was created by John Wells and Lydia Woodward, who also created ER. Featured Crew John Wells Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dana Delany Dr. Rae Brennan Paul Blackthorne Dr. Matt Slingerland David Kaufman Anna Deavere Smith Blythe Danner Full Cast & Crew Last Season Season 1 2002 | 16 Episodes Season 1 of Presidio Med premiered on September 24, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Presidio Med. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m, 44m Homepage  - Genres Drama Keywords san francisco hospital doctor medical drama Content Score 79 Pump it up! We're close now. Top Contributors 7 Banana 3 Zlogorek R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}