{"link": "https://www.themoviedb.org/tv/707?language=en", "title": "Boomtown", "resume": "Each episode of this series, set in contemporary Los Angeles, examines one crime from many different viewpoints - uniformed cops, detectives, witnesses, the media, the fire department and rescue squad, even the criminals themselves.", "rate": 84, "genre": ["Mystery", "Drama", "Action", "Adventure"], "cast": ["Donnie Wahlberg", "Gary Basaraba", "Nina Garbiras", "Neal McDonough", "Lana Parrilla"], "character": ["Detective Joel Stevens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 707   Expand Boomtown   (2002) User Score Overview Each episode of this series, set in contemporary Los Angeles, examines one crime from many different viewpoints - uniformed cops, detectives, witnesses, the media, the fire department and rescue squad, even the criminals themselves. Featured Crew Graham Yost Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Donnie Wahlberg Detective Joel Stevens Gary Basaraba Nina Garbiras Neal McDonough Lana Parrilla Full Cast & Crew Last Season Season 2 2003 | 6 Episodes Season 2 of Boomtown premiered on September 26, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2003-02-02 Kingpin 6.9    2005-12-13 Spiral 8.2    1987-04-12 21 Jump Street 6.1    2009-03-15 Kings 7.9    1995-09-22 American Gothic 7.7    2005-12-04 Sleeper Cell 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Mystery Drama Action & Adventure Keywords los angeles criminal investigation Content Score 93 Almost there... Top Contributors 5 Banana s 3 speedycars PS 2 P. Snoopy 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}