{"link": "https://www.themoviedb.org/tv/39684?language=en", "title": "Prime Suspect", "resume": "Detective Jane Timoney finds that being a homicide detective in New York City is tough enough and having to contend with a male-dominated police department to get respect makes it that much tougher. She's an outsider who has just transferred to a new precinct dominated by an impenetrable clique of a boys' club. Timoney has her own vices too – with a questionable past – and she tends to be forceful, rude and reckless. But she's also a brilliant cop who keeps her eye on one thing: the prime suspect.", "rate": 71, "genre": ["Drama", "Action", "Adventure"], "cast": ["Maria Bello", "Aidan Quinn", "Brían F. O'Byrne", "Kirk Acevedo", "Peter Gerety"], "character": ["Jane Timoney", "Kevin Sweeney", "Reg Duffy", "Luisito Calderon", "Desmond Timoney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39684   Expand Prime Suspect   (2011) User Score  Play Trailer Overview Detective Jane Timoney finds that being a homicide detective in New York City is tough enough and having to contend with a male-dominated police department to get respect makes it that much tougher. She's an outsider who has just transferred to a new precinct dominated by an impenetrable clique of a boys' club. Timoney has her own vices too – with a questionable past – and she tends to be forceful, rude and reckless. But she's also a brilliant cop who keeps her eye on one thing: the prime suspect. Featured Crew Lynda La Plante Creator Alexandra Cunningham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maria Bello Jane Timoney Aidan Quinn Kevin Sweeney Brían F. O'Byrne Reg Duffy Kirk Acevedo Luisito Calderon Peter Gerety Desmond Timoney Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Prime Suspect premiered on September 22, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2011-02-07 The Chicago Code 7.3    2012-10-11 Copper 6.0    2012-08-16 Bullet in the Face 7.5    2013-09-22 By Any Means 7.0    2013-09-24 The Wrong Mans 7.6    2014-01-10 Enlisted 6.2    2008-03-04 New Amsterdam 7.5    2011-08-29 Death Valley 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/prime-suspect/ Genres Drama Action & Adventure Keywords new york based on tv series police detective nypd female detective homicide detective Content Score 100 Yes! Looking good! Top Contributors 24 United600 R 16 Rebecca 11 Banana z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}