{"link": "https://www.themoviedb.org/tv/64474?language=en", "title": "Hitlåtens historia", "resume": "Music show that tells the story behind modern pop classics.", "rate": 90, "genre": ["History", "Music"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64474   Expand Hitlåtens historia   (2010) User Score Overview Music show that tells the story behind modern pop classics. Featured Crew Magnus Broni Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 10 2018 | 6 Episodes Season 10 of Hitlåtens historia premiered on April 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hitlåtens historia. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Documentary Original Language  Swedish Runtime  30m Homepage   http://www.svt.se/hitlatens-historia/ Genres History Music Keywords music history documentary Content Score 71 Just a little bit more... Top Contributors 30 Acki p 19 prm_68 10 Tomas Bäckman 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}