{"link": "https://www.themoviedb.org/tv/3486?language=en", "title": "Surface", "resume": "Surface is a science fiction television series that premiered on NBC on September 19, 2005. The program aired ten episodes before going on hiatus on November 28, 2005 due to NBC's coverage of the 2006 Winter Olympics. It returned for five more episodes, beginning January 2, 2006. On May 15, 2006, NBC officially announced the series' cancellation.", "rate": 68, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Leighton Meester", "Carter Jenkins", "Lake Bell", "Jay R. Ferguson", "Eddie Hassell"], "character": ["Savannah Barnett", "Dr. Laura Daughtery"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3486   Expand Surface   (2005) User Score Overview Surface is a science fiction television series that premiered on NBC on September 19, 2005. The program aired ten episodes before going on hiatus on November 28, 2005 due to NBC's coverage of the 2006 Winter Olympics. It returned for five more episodes, beginning January 2, 2006. On May 15, 2006, NBC officially announced the series' cancellation. Featured Crew Jonas Pate Creator Josh Pate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leighton Meester Savannah Barnett Carter Jenkins Lake Bell Dr. Laura Daughtery Jay R. Ferguson Eddie Hassell Full Cast & Crew Last Season Season 1 2005 | 15 Episodes Season 1 of Surface premiered on September 19, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  8 Recommendations   2004-10-24 ReGenesis 7.0    2006-01-01 In Justice 6.8    2004-07-11 The 4400 6.9    2005-09-19 Invasion 6.9    2004-07-19 The Grid 7.0    2015-04-15 The Delivery Man 6.5    2003-01-27 Veritas: The Quest 6.3    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m, 60m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords monster marine biologist scientist sea monster Content Score 93 Almost there... Top Contributors 12 Banana g 12 gismo33 w 8 webmaster M 5 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}