{"link": "https://www.themoviedb.org/tv/46553?language=en", "title": "Reply 1997", "resume": "Reply 1997 is a 2012 South Korean television series that centers on the lives of five friends in Busan, as the timeline moves back and forth between their past as 18-year-old high schoolers in 1997 and their present as 33-year-olds at their high school reunion dinner in 2012, where one couple will announce that they're getting married. The coming-of-age drama also examines the extreme fan culture that emerged in the 1990s when first generation idol groups such as H.O.T. and Sechs Kies took center stage and K-pop was just blossoming.", "rate": 85, "genre": ["Comedy"], "cast": ["Jung Eun-ji", "Seo In Guk", "Eun Ji-won", "Hoya", "Shin So-yul"], "character": ["Sung Shi-won", "Yoon Yoon-jae", "Do Hak-chan", "Kang Joon-hee", "Mo Yoo-jung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46553   Expand Reply 1997   (2012) User Score Overview Reply 1997 is a 2012 South Korean television series that centers on the lives of five friends in Busan, as the timeline moves back and forth between their past as 18-year-old high schoolers in 1997 and their present as 33-year-olds at their high school reunion dinner in 2012, where one couple will announce that they're getting married. The coming-of-age drama also examines the extreme fan culture that emerged in the 1990s when first generation idol groups such as H.O.T. and Sechs Kies took center stage and K-pop was just blossoming. Featured Crew Lee Woo-Jung Creator Shin Won-Ho Creator Lee Sun-Hye Creator Kim Ran-Joo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  21 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Eun-ji Sung Shi-won Seo In Guk Yoon Yoon-jae Eun Ji-won Do Hak-chan Hoya Kang Joon-hee Shin So-yul Mo Yoo-jung Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of Reply 1997 premiered on July 24, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  21 Posters  9 Recommendations   2015-07-03 Oh My Ghostess 7.9    2014-03-17 Secret Love Affair 7.8    2014-01-06 Aftermath 6.3    2012-08-18 Panda and Hedgehog 6.0    2014-07-23 It's Okay, That's Love 9.3    2013-10-18 Answer Me 1994 8.4    2013-11-28 Let's Eat 7.8    2016-03-14 Nightmare Teacher 7.5  Facts Original Name  응답하라 1997 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.interest.me/tvn/reply1997/ Genres Comedy Keywords friendship korea school Content Score 93 Almost there... Top Contributors M 45 Maria180493 13 moonsolar 8 Imzadi 6 Kyuhwan Kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}