{"link": "https://www.themoviedb.org/tv/46661?language=en", "title": "Twisted", "resume": "A one-hour mystery full of twists and turns that follows Danny Desai, a charismatic 16-year-old with a troubled past who returns to his hometown after spending five years in juvenile detention. Immediately branded an outcast, Danny attempts to reconnect with his two childhood best friends, Jo and Lacey. But when a fellow student is found dead in her home, Danny instantly becomes the prime suspect and town spirals into a frenzy of suspicion and mystery. Jo and Lacey must decide if their childhood friend is unforgivable, or if he's really a victim being persecuted for his own twisted secrets.", "rate": 63, "genre": ["Mystery", "Drama"], "cast": ["Maddie Hasson", "Avan Jogia", "Kylie Bunbury", "Kimberly Quinn", "Sam Robards"], "character": ["Jo Masterson", "Danny Desai", "Lacey Porter", "Tess Masterson", "Kyle Masterson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46661   Expand Twisted   (2013) User Score Overview A one-hour mystery full of twists and turns that follows Danny Desai, a charismatic 16-year-old with a troubled past who returns to his hometown after spending five years in juvenile detention. Immediately branded an outcast, Danny attempts to reconnect with his two childhood best friends, Jo and Lacey. But when a fellow student is found dead in her home, Danny instantly becomes the prime suspect and town spirals into a frenzy of suspicion and mystery. Jo and Lacey must decide if their childhood friend is unforgivable, or if he's really a victim being persecuted for his own twisted secrets. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maddie Hasson Jo Masterson Avan Jogia Danny Desai Kylie Bunbury Lacey Porter Kimberly Quinn Tess Masterson Sam Robards Kyle Masterson Full Cast & Crew Last Season Season 1 2013 | 19 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Twisted. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2011-08-15 The Lying Game 6.1    2010-01-18 Life Unexpected 7.4    2007-07-09 Greek 6.3    2013-01-14 The Carrie Diaries 4.9    2011-09-26 Hart of Dixie 6.9    2014-07-08 Finding Carter 5.6    2012-06-20 Baby Daddy 5.9    2002-09-17 8 Simple Rules 6.3  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  43m, 42m Homepage   http://freeform.go.com/shows/twisted Genres Mystery Drama Keywords troubled teen teen drama murder suspect Content Score 86 Almost there... Top Contributors 19 wick3dsentinel 17 Banana 6 Elizabeth Jennings S 5 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}