{"link": "https://www.themoviedb.org/tv/41072?language=en", "title": "Weissensee", "resume": "Weissensee is a German television series. The series is set in East Berlin in 1980 and 1987 and follows two families.", "rate": 83, "genre": ["Drama"], "cast": ["Florian Lukas", "Uwe Kockisch", "Jörg Hartmann", "Ruth Reinecke", "Katrin Sass"], "character": ["Martin Kupfer", "Hans Kupfer", "Falk Kupfer", "Marlene Kupfer", "Dunja Hausmann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41072   Expand Weissensee   (2010) User Score  Play Trailer Overview Weissensee is a German television series. The series is set in East Berlin in 1980 and 1987 and follows two families. Featured Crew Friedemann Fromm Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Florian Lukas Martin Kupfer Uwe Kockisch Hans Kupfer Jörg Hartmann Falk Kupfer Ruth Reinecke Marlene Kupfer Katrin Sass Dunja Hausmann Full Cast & Crew Current Season Season 4 2018 | 6 Episodes Season 4 of Weissensee premiered on May  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2010-09-30 Dag 8.4  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  50m Homepage  - Genres Drama Keywords berlin germany berlin wall german democratic republic stasi east berlin Content Score 100 Yes! Looking good! Top Contributors S 51 Samara S 23 Sebastian n 7 nashbln 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}