{"link": "https://www.themoviedb.org/tv/3817?language=en", "title": "The Land Before Time", "resume": "The Land Before Time is an animated television series, based on the Land Before Time film series created by Judy Freudberg and Tony Geiss. It was developed for television by Ford Riley for Universal Animation Studios and Amblin Entertainment, and first premiered on YTV in Canada for a test on January 5, 2007.\nThe show officially premiered on Cartoon Network in the United States on March 5, 2007 after the DVD release of The Land Before Time XII: The Great Day of the Flyers. It aired on Boomerang in the United Kingdom on April 16, 2007. It first premiered in Japan on Kids Station in May 2007. The first season has begun airing on Cartoon Network India, with its premiere on April 7, 2008. The show has neither aired on Cartoon Network in the United States nor on YTV in Canada since March 2008. It aired on Spacetoon in January 1, 2011 after Spacetoon English closed and the Spacetoon Group was rebranded. It aired on Tv Russia in May 2, 2009 after TV Russia Service Television closed.\nIt was made as traditionally-animated with computer-animated backgrounds, which the past sequels from The Land Before Time X: The Great Longneck Migration onwards have used, with occasional cel-shaded computer animated characters in wide shots. The main antagonists in the series are Red Claw, an evil villainous Tyrannosaurus, and Screech and Thud, two henchmen Velociraptors. The TV series takes place after the events of The Land Before Time XIII: The Wisdom of Friends.", "rate": 40, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Aria Curzon", "Jeff Bennett", "Anndi McAfee", "Rob Paulsen", "Max Burkholder"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3817   Expand The Land Before Time   (2007) User Score Overview The Land Before Time is an animated television series, based on the Land Before Time film series created by Judy Freudberg and Tony Geiss. It was developed for television by Ford Riley for Universal Animation Studios and Amblin Entertainment, and first premiered on YTV in Canada for a test on January 5, 2007. The show officially premiered on Cartoon Network in the United States on March 5, 2007 after the DVD release of The Land Before Time XII: The Great Day of the Flyers. It aired on Boomerang in the United Kingdom on April 16, 2007. It first premiered in Japan on Kids Station in May 2007. The first season has begun airing on Cartoon Network India, with its premiere on April 7, 2008. The show has neither aired on Cartoon Network in the United States nor on YTV in Canada since March 2008. It aired on Spacetoon in January 1, 2011 after Spacetoon English closed and the Spacetoon Group was rebranded. It aired on Tv Russia in May 2, 2009 after TV Russia Service Television closed. It was made as traditionally-animated with computer-animated backgrounds, which the past sequels from The Land Before Time X: The Great Longneck Migration onwards have used, with occasional cel-shaded computer animated characters in wide shots. The main antagonists in the series are Red Claw, an evil villainous Tyrannosaurus, and Screech and Thud, two henchmen Velociraptors. The TV series takes place after the events of The Land Before Time XIII: The Wisdom of Friends. Featured Crew Tony Geiss Creator Charles Grosvenor Creator Judy Freudberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aria Curzon Jeff Bennett Anndi McAfee Rob Paulsen Max Burkholder Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of The Land Before Time premiered on March  5, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   1976-09-18 The Muppet Show 7.8    1962-09-23 The Jetsons 6.6  Facts Status  Ended Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cartoonnetwork.com/tv_shows/landbeforetime/ Genres Action & Adventure Animation Comedy Keywords based on movie Content Score 93 Almost there... Top Contributors 10 TheOneManBoxOffice A 6 Aranyfiam 6 waaw p 5 p681  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}