{"link": "https://www.themoviedb.org/tv/1679?language=en", "title": "The Tracey Ullman Show", "resume": "The Tracey Ullman Show is an American television variety show, hosted by British-born comedian and onetime pop singer Tracey Ullman. It debuted on April 5, 1987 as the Fox network's second primetime series after Married... with Children, and ran until May 26, 1990. The show is produced by Gracie Films and 20th Century Fox Television. The show blended sketch comedy shorts with many musical numbers, featuring choreography by Paula Abdul. The show also produced The Simpsons shorts before it spun off into its own show, which was also produced by Gracie Films and 20th Century Fox Television.", "rate": 77, "genre": ["Animation", "Comedy"], "cast": ["Yeardley Smith", "Nancy Cartwright", "Julie Kavner", "Anna Levine", "Dan Castellaneta"], "character": ["Lisa Simpson", "Bart Simpson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1679   Expand The Tracey Ullman Show   (1987) User Score Overview The Tracey Ullman Show is an American television variety show, hosted by British-born comedian and onetime pop singer Tracey Ullman. It debuted on April 5, 1987 as the Fox network's second primetime series after Married... with Children, and ran until May 26, 1990. The show is produced by Gracie Films and 20th Century Fox Television. The show blended sketch comedy shorts with many musical numbers, featuring choreography by Paula Abdul. The show also produced The Simpsons shorts before it spun off into its own show, which was also produced by Gracie Films and 20th Century Fox Television. Featured Crew James L. Brooks Creator Jerry Belson Creator Tracey Ullman Creator Ken Estin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeardley Smith Lisa Simpson Nancy Cartwright Bart Simpson Julie Kavner Anna Levine Dan Castellaneta Full Cast & Crew Last Season Season 4 1989 | 24 Episodes Season 4 of The Tracey Ullman Show premiered on September 10, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1982-03-25 Cagney & Lacey 6.0    1979-08-24 The Facts of Life 5.8    1970-09-24 The Odd Couple 7.1    1978-11-03 Diff'rent Strokes 5.7    1988-11-14 Murphy Brown 6.5    1975-01-18 The Jeffersons 6.7    1984-01-04 Night Court 6.9    1977-01-14 Fantasy Island 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 2 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}