{"link": "https://www.themoviedb.org/tv/42821?language=en", "title": "Welcome to the N.H.K.", "resume": "Sato’s life – or what’s left of it – is a paranoid mess of conspiracy theories and social anxieties. He’s terrified of the outside world; his apartment is overflowing with the remnants of cheap take-out food; and his retinas have been permanently scarred by a steady diet of internet porn. But maybe it’s not all his fault. After all, the nefarious N-H-K is out there, and they’re determined to turn society’s fringe-dwellers into a brainwashed lot of jobless, hopeless, futureless recluses.\nEnter Misaki – a mysterious girl-next-door type who is Sato’s last chance to beat-down his inner demons and venture out into the light of day. She’s ready to help him overcome his crippling phobias, but Sato would rather cower in his existential foxhole and pretend to work on the demo for his virtual sex game.\nHe’s afraid to face the world. She’s strangely desperate to fix a total stranger. Maybe together they can be normal", "rate": 85, "genre": ["Mystery", "Drama", "Comedy", "Animation", "Romance"], "cast": ["Sanae Kobayashi", "Yui Makino", "Risa Hayamizu", "Daisuke Sakaguchi", "Yutaka Koizumi"], "character": ["Hitomi Kashiwa", "Misaki Nakahara", "Megumi Kobayashi", "Kaoru Yamazaki", "Tatsuhiro Sato"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42821   Expand Welcome to the N.H.K.   (2006) User Score  Play Trailer Overview Sato’s life – or what’s left of it – is a paranoid mess of conspiracy theories and social anxieties. He’s terrified of the outside world; his apartment is overflowing with the remnants of cheap take-out food; and his retinas have been permanently scarred by a steady diet of internet porn. But maybe it’s not all his fault. After all, the nefarious N-H-K is out there, and they’re determined to turn society’s fringe-dwellers into a brainwashed lot of jobless, hopeless, futureless recluses. Enter Misaki – a mysterious girl-next-door type who is Sato’s last chance to beat-down his inner demons and venture out into the light of day. She’s ready to help him overcome his crippling phobias, but Sato would rather cower in his existential foxhole and pretend to work on the demo for his virtual sex game. He’s afraid to face the world. She’s strangely desperate to fix a total stranger. Maybe together they can be normal Featured Crew Tatsuhiko Takimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanae Kobayashi Hitomi Kashiwa Yui Makino Misaki Nakahara Risa Hayamizu Megumi Kobayashi Daisuke Sakaguchi Kaoru Yamazaki Yutaka Koizumi Tatsuhiro Sato Full Cast & Crew Last Season Welcome to the nhk season 1 2006 | 24 Episodes Season 1 of Welcome to the N.H.K. premiered on July  9, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of my favorite series Open 0 by BenCaesar\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2012-07-08 Kokoro Connect 7.0    2015-07-07 Bikini Warriors 4.4    2006-04-04 Air Gear 5.3    2009-10-05 Heaven's Lost Property 5.3    2013-07-08 WATAMOTE 8.3    2011-04-16 Deadman Wonderland 7.1    Sekirei Pure Engagement 8.2    2011-04-14 Aria the Scarlet Ammo 6.4  Facts Original Name  NHKにようこそ! Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.funimation.com/shows/welcome-to-the-n-h-k/home Genres Mystery Drama Comedy Animation Romance Keywords nerd satire slice of life conspiracy psychological recluse game design game developer anime fan service game development neet Content Score 100 Yes! Looking good! Top Contributors 42 WillofOwn s 6 sheva_vitali 4 Kenta Nomura m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}