{"link": "https://www.themoviedb.org/tv/61460?language=en", "title": "Trinity Seven", "resume": "In this \"romantic comedy but sometime serious magical school story,\" life as Arata Kasuga knows it is wiped out by a bizarre incident known as \"Collapse Phenomenon,\" which causes worldwide destruction and takes his cousin Hijiri Kasuga to the next world. To resolve the \"Collapse Phenomenon\" and bring back Hijiri, Arata enrolls in the Royal Biblia Academy. Waiting in the school are seven beautiful female magic users — the Trinity Seven.", "rate": 72, "genre": ["Animation", "Comedy"], "cast": ["Yoshitsugu Matsuoka", "Yumi Hara", "Ryoka Yuzuki", "Aya Uchida", "Ayane Sakura"], "character": ["Arata Kasuga", "Lilith Asami", "Akio Fudou", "Arin Kannazuki", "Levi Kazama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61460   Expand Trinity Seven   (2014) User Score Overview In this \"romantic comedy but sometime serious magical school story,\" life as Arata Kasuga knows it is wiped out by a bizarre incident known as \"Collapse Phenomenon,\" which causes worldwide destruction and takes his cousin Hijiri Kasuga to the next world. To resolve the \"Collapse Phenomenon\" and bring back Hijiri, Arata enrolls in the Royal Biblia Academy. Waiting in the school are seven beautiful female magic users — the Trinity Seven. Featured Crew Hiroshi Nishikiori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshitsugu Matsuoka Arata Kasuga Yumi Hara Lilith Asami Ryoka Yuzuki Akio Fudou Aya Uchida Arin Kannazuki Ayane Sakura Levi Kazama Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Trinity Seven premiered on October  8, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2015-01-07 The Testament of Sister New Devil 6.8    2011-10-09 The Future Diary 6.8    2011-04-16 Deadman Wonderland 7.1    2014-07-06 Akame ga Kill! 7.0    2014-10-05 The Seven Deadly Sins 7.9    2014-07-03 Tokyo Ghoul 7.2  Facts Original Name  トリニティセブン Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://trinity-7.com/ Genres Animation Comedy Keywords animation shounen Content Score 100 Yes! Looking good! Top Contributors S 29 SuperTouch 16 Animes Flix 10 Sadwick n 9 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}