{"link": "https://www.themoviedb.org/tv/17535?language=en", "title": "The Tonight Show with Conan O'Brien", "resume": "The Tonight Show with Conan O'Brien is an American late-night talk show that featured Conan O'Brien as host from June 1, 2009 to January 22, 2010 as part of NBC's long-running Tonight Show franchise. The program's host, Conan O'Brien, previously hosted NBC's Late Night with Conan O'Brien, which followed The Tonight Show with Jay Leno for 16 years, until O'Brien's brief succession over Leno.\nMany members of the Late Night cast and crew made the transition to The Tonight Show. The Max Weinberg 7, the house band from O'Brien's Late Night, served as the house band under the new name, Max Weinberg and The Tonight Show Band. Andy Richter returned to the show as announcer, and also began resuming his role as sidekick, shortly before the show's conclusion. The opening and closing theme song from Late Night was also carried over to Tonight, in a slightly altered form.\nIn January 2010, after the show had been on the air for seven months, it was announced that NBC was intending to move Jay Leno from primetime back to his original timeslot at 11:35 pm, with O'Brien's show starting shortly after midnight. In response to the announcement, O'Brien released a press statement saying that he would not continue as host of The Tonight Show if it was moved to any time after midnight to accommodate The Jay Leno Show. He feared it would ruin the long and rich tradition of The Tonight Show. It had been on after the late local newscasts from the beginning. After two weeks of negotiations, NBC announced that they had paid $45 million to buy out O'Brien's contract, ending both his tenure as host as well as his relationship with NBC after 22 years.", "rate": 77, "genre": ["Talk", "Comedy"], "cast": ["Max Weinberg", "Eric Callero", "Andy Richter", "Conan O'Brien"], "character": ["Cody Deveraux", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17535   Expand The Tonight Show with Conan O'Brien   (2009) User Score Overview The Tonight Show with Conan O'Brien is an American late-night talk show that featured Conan O'Brien as host from June 1, 2009 to January 22, 2010 as part of NBC's long-running Tonight Show franchise. The program's host, Conan O'Brien, previously hosted NBC's Late Night with Conan O'Brien, which followed The Tonight Show with Jay Leno for 16 years, until O'Brien's brief succession over Leno. Many members of the Late Night cast and crew made the transition to The Tonight Show. The Max Weinberg 7, the house band from O'Brien's Late Night, served as the house band under the new name, Max Weinberg and The Tonight Show Band. Andy Richter returned to the show as announcer, and also began resuming his role as sidekick, shortly before the show's conclusion. The opening and closing theme song from Late Night was also carried over to Tonight, in a slightly altered form. In January 2010, after the show had been on the air for seven months, it was announced that NBC was intending to move Jay Leno from primetime back to his original timeslot at 11:35 pm, with O'Brien's show starting shortly after midnight. In response to the announcement, O'Brien released a press statement saying that he would not continue as host of The Tonight Show if it was moved to any time after midnight to accommodate The Jay Leno Show. He feared it would ruin the long and rich tradition of The Tonight Show. It had been on after the late local newscasts from the beginning. After two weeks of negotiations, NBC announced that they had paid $45 million to buy out O'Brien's contract, ending both his tenure as host as well as his relationship with NBC after 22 years. Featured Crew Conan O'Brien Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Max Weinberg Eric Callero Cody Deveraux Andy Richter Conan O'Brien Host Full Cast & Crew Last Season Season 1 2009 | 146 Episodes Season 1 of The Tonight Show with Conan O'Brien premiered on June  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  1 Recommendations   2010-11-08 Conan 7.4    1993-09-13 Late Night with Conan O'Brien 7.3    1992-05-25 The Tonight Show with Jay Leno 5.0    2014-12-02 Late Night with Seth Meyers 5.6    1993-08-30 Late Show with David Letterman 6.9    2009-03-02 Late Night with Jimmy Fallon 6.0    2003-01-26 Jimmy Kimmel Live! 6.0    2002-01-08 Last Call with Carson Daly 2.2  Facts Status  Ended Network Certification  - Type  Talk Show Original Language  English Runtime  60m, 62m Homepage   http://www.tonightshowwithconanobrien.com/ Genres Talk Comedy Keywords talk show Content Score 93 Almost there... Top Contributors 21 Banana D 2 Daniel 1 Rug 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}