{"link": "https://www.themoviedb.org/tv/68178?language=en", "title": "Tutankhamun", "resume": "The remarkable story of the chance meeting that transformed penniless, ostracised archaeologist Howard Carter into a household name following his discovery of the tomb of the boy-king, Tutankhamun.", "rate": 54, "genre": ["Drama"], "cast": ["Max Irons", "Amy Wren", "Sam Neill", "Catherine Steadman", "Jonathan Aris"], "character": ["Howard Carter", "Lady Evelyn Carnarvon", "Lord Carnarvon", "Maggie Lewis", "Herbert Winlock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68178   Expand Tutankhamun   (2016) User Score  Play Trailer Overview The remarkable story of the chance meeting that transformed penniless, ostracised archaeologist Howard Carter into a household name following his discovery of the tomb of the boy-king, Tutankhamun. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Max Irons Howard Carter Amy Wren Lady Evelyn Carnarvon Sam Neill Lord Carnarvon Catherine Steadman Maggie Lewis Jonathan Aris Herbert Winlock Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Tutankhamun premiered on October 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  1 Recommendations   2014-03-31 Friends with Better Lives 5.4    2012-05-22 Hit & Miss 7.3    2012-04-08 The Client List 5.4    2013-04-29 Vicious 7.9    2016-04-03 The Durrells 7.0    2015-06-17 Deutschland 83 7.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage   https://itvstudios.com/programmes/tutankhamun Genres Drama Keywords egypt explorer king tut Content Score 93 Almost there... Top Contributors p 26 plumpro 15 Elizabeth Jennings 8 valdu06 G 5 Gonçalo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}