{"link": "https://www.themoviedb.org/tv/3962?language=en", "title": "Masters of Science Fiction", "resume": "Masters of Science Fiction is an American television anthology series by the same creators as Masters of Horror. The show debuted on ABC on August 4, 2007 at 10PM for a run of four episodes. It was originally scheduled to run in six parts, but two episodes were removed from the schedule for undisclosed reasons.\nThe show follows a similar format as Masters of Horror, with each hour long episode taking the form of a separate short film adaptation of a story by a respected member of the science fiction community, hence the Masters in the title.\nIn December 2007, the show was picked up by Space in Canada. This then allowed the North American premiere of the missing two episodes. A Region 1 DVD of all six episodes was released on August 5, 2008. On February 12, 2012, the Science Channel began airing the episodes, under the title \"Stephen Hawking's Sci-Fi Masters\", beginning with the first domestic airing of the episode \"Watchbirds\".\nThe show is hosted off-screen by physicist Stephen Hawking.", "rate": 62, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Stephen Hawking"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3962   Expand Masters of Science Fiction   (2007) User Score Overview Masters of Science Fiction is an American television anthology series by the same creators as Masters of Horror. The show debuted on ABC on August 4, 2007 at 10PM for a run of four episodes. It was originally scheduled to run in six parts, but two episodes were removed from the schedule for undisclosed reasons. The show follows a similar format as Masters of Horror, with each hour long episode taking the form of a separate short film adaptation of a story by a respected member of the science fiction community, hence the Masters in the title. In December 2007, the show was picked up by Space in Canada. This then allowed the North American premiere of the missing two episodes. A Region 1 DVD of all six episodes was released on August 5, 2008. On February 12, 2012, the Science Channel began airing the episodes, under the title \"Stephen Hawking's Sci-Fi Masters\", beginning with the first domestic airing of the episode \"Watchbirds\". The show is hosted off-screen by physicist Stephen Hawking. Featured Crew Harold Becker Creator Jonathan Frakes Creator Darnell Martin Creator Michael Petroni Creator Mark Rydell Creator Michael Tolkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Hawking Himself - Host Full Cast & Crew Last Season Season 1 2007 | 6 Episodes Season 1 of Masters of Science Fiction premiered on August  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   2010-10-26 Riese: Kingdom Falling 6.1    2002-09-23 Brigada 7.2    2006-10-07 Robin Hood 6.5    2002-03-03 Jeremiah 7.0    2000-06-09 The Invisible Man 7.2    2011-02-07 Outcasts 6.2    2000-05-07 Jason and the Argonauts 5.6    1995-03-22 Sliders 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.mastersofscifi.com Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors C 26 CoLibrus 6 BlackDelivery d 6 denis CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}