{"link": "https://www.themoviedb.org/tv/37851?language=en", "title": "Digimon Fusion", "resume": "Digimon Fusion, known in Japan as Digimon Xros Wars and in Malaysia as Digimon Fusion Battles, is the sixth anime children television series in the Digimon franchise by Akiyoshi Hongō, produced by Toei Animation. It follows a boy named Taiki Kudō who utilizes the power of joining together Digimon in order to save the Digital World. The series' was broadcast on TV Asahi and Asahi Broadcasting Corporation between July 6, 2010 and March 25, 2012, divided into three seasons, titled Xros Wars, The Evil Death Generals and the Seven Kingdoms and The Young Hunters Who Leapt Through Time respectively.\nThe series has been licensed outside of Asia by Saban Brands and is internationally by MarVista Entertainment. An English-language version, produced by Saban, began airing in North America on Nickelodeon from September 7, 2013 and will later air on The CW's Vortexx programming block. An alternate English-language version began airing on Disney XD in Malaysia from December 8, 2012.", "rate": 48, "genre": ["Animation", "Action", "Adventure"], "cast": ["Bin Shimada", "Chika Sakamoto", "Daisuke Kishio", "Houko Kuwashima", "Houko Kuwashima"], "character": ["Tactimon", "Shoutmon", "Zenjirou Tsurugi", "Cutemon", "Nene Amano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37851   Expand Digimon Fusion   (2010) User Score Overview Digimon Fusion, known in Japan as Digimon Xros Wars and in Malaysia as Digimon Fusion Battles, is the sixth anime children television series in the Digimon franchise by Akiyoshi Hongō, produced by Toei Animation. It follows a boy named Taiki Kudō who utilizes the power of joining together Digimon in order to save the Digital World. The series' was broadcast on TV Asahi and Asahi Broadcasting Corporation between July 6, 2010 and March 25, 2012, divided into three seasons, titled Xros Wars, The Evil Death Generals and the Seven Kingdoms and The Young Hunters Who Leapt Through Time respectively. The series has been licensed outside of Asia by Saban Brands and is internationally by MarVista Entertainment. An English-language version, produced by Saban, began airing in North America on Nickelodeon from September 7, 2013 and will later air on The CW's Vortexx programming block. An alternate English-language version began airing on Disney XD in Malaysia from December 8, 2012. Featured Crew Akiyoshi Hongo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bin Shimada Tactimon Chika Sakamoto Shoutmon Daisuke Kishio Zenjirou Tsurugi Houko Kuwashima Cutemon Houko Kuwashima Nene Amano Full Cast & Crew Last Season Season 2 2011 | 25 Episodes Season 2 of Digimon Fusion premiered on October  2, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Digimon Fusion. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2014-04-05 Dragonar Academy 7.0    2010-07-10 Cat Planet Cuties 6.0    2004-07-10 DearS 5.0    2011-10-08 Ben-To 7.2    2014-07-05 Sailor Moon Crystal 7.8    2012-07-06 Aesthetica of a Rogue Hero 7.1    2006-04-04 Air Gear 5.3  Facts Original Name  デジモンクロスウォーズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tv-asahi.co.jp/digimon_2010/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 11 Elizabeth Jennings 3 Maikkoum m 3 magoozin 2 MichelD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}