{"link": "https://www.themoviedb.org/tv/34390?language=en", "title": "Skins", "resume": "A wild ride through the lives of a group of high school friends stumbling through the mine field of adolescence... and stepping on most of the mines as they go.", "rate": 42, "genre": ["Drama", "Comedy"], "cast": ["Danny Flaherty", "Ron Mustafaa", "James Newman", "Jesse Carere", "Rachel Thevenard"], "character": ["Stanley Lucerne", "Abbud Siddiqui", "Tony Snyder", "Chris Collins", "Michelle Richardson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34390   Expand Skins   (2011) User Score Overview A wild ride through the lives of a group of high school friends stumbling through the mine field of adolescence... and stepping on most of the mines as they go. Featured Crew Bryan Elsley Creator Jamie Brittain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danny Flaherty Stanley Lucerne Ron Mustafaa Abbud Siddiqui James Newman Tony Snyder Jesse Carere Chris Collins Rachel Thevenard Michelle Richardson Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of Skins premiered on January 17, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2007-01-25 Skins 7.4    2011-08-15 The Lying Game 6.1    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    2003-09-23 One Tree Hill 6.5    2006-09-24 Brothers and Sisters 6.8    2009-01-18 United States of Tara 7.3    2006-09-28 Ugly Betty 5.5    2013-01-18 Best of the Worst 8.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://mtv.com/shows/skins Genres Drama Comedy Keywords high school remake teenager teenage sexuality teen drama Content Score 93 Almost there... Top Contributors 20 Banana 6 lineker b 4 bugfix 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}