{"link": "https://www.themoviedb.org/tv/27866?language=en", "title": "ef", "resume": "On Christmas Eve, Hiro Hirono meets a girl named Miyako Miyamura as she chases a purse snatcher. Hiro later finds out that Miyako also goes to the same school as he does and they start hanging out together. This makes Hiro's childhood friend, Kei Shindō, feel left out, so she tries to compete with Miyako for Hiro's affection, creating a love triangle. Meanwhile, Renji Asō meets a girl named Chihiro Shindō at an abandoned train station. He soon learns that Chihiro suffers from a type of amnesia where her memory lasts for only 13 hours. He also discovers Chihiro's dream of writing a novel, but she has never been able to fulfill that dream due to her condition. Renji then decides to help her fulfill that dream.", "rate": 82, "genre": ["Animation", "Drama", "Romance"], "cast": ["Natsumi Yanase", "Hiro Shimono"], "character": ["Chihiro Shindō", "Hiro Hirono"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27866   Expand ef   (2007) User Score Overview On Christmas Eve, Hiro Hirono meets a girl named Miyako Miyamura as she chases a purse snatcher. Hiro later finds out that Miyako also goes to the same school as he does and they start hanging out together. This makes Hiro's childhood friend, Kei Shindō, feel left out, so she tries to compete with Miyako for Hiro's affection, creating a love triangle. Meanwhile, Renji Asō meets a girl named Chihiro Shindō at an abandoned train station. He soon learns that Chihiro suffers from a type of amnesia where her memory lasts for only 13 hours. He also discovers Chihiro's dream of writing a novel, but she has never been able to fulfill that dream due to her condition. Renji then decides to help her fulfill that dream. Featured Crew Shin Ōnuma Creator Katsuhiko Takayama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natsumi Yanase Chihiro Shindō Hiro Shimono Hiro Hirono Full Cast & Crew Last Season A Tale of Melodies 2008 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on ef. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.ef-memo.com/ Genres Animation Drama Romance Keywords amnesia psychological anime Content Score 64 We're so close, yet so far. Top Contributors 55 sp1ti 27 WillofOwn 5 Elizabeth Jennings 4 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}