{"link": "https://www.themoviedb.org/tv/72532?language=en", "title": "Siege in Fog", "resume": "An arrogant third master of a powerful family falls in love at first sight with a pretty young maiden and uses every means possible to force her hand in marriage, despite her harboring a crush on another man. In the beginning of a coerced marriage, she resents him and rejects all his advances and gestures of love, but their love story slowly develops after going through obstacles in times of war and chaos. However, things get complicated when her old flame returns and becomes her husband’s assistant.\n~~ Adapted from the novel by Fei Wo Si Cun.", "rate": 0, "genre": ["Drama"], "cast": ["Elvis Han", "Sun Yi", "Jeremy Xu Zheng-Xi", "Ma Jing Han", "Hao Ze Jia"], "character": ["Yi Lian Kai", "Qin Sang", "Pan Jian Chi / Liu Wang Ping", "Yi Lian Yi", "Deng Yu Lin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72532   Expand Siege in Fog   (2018) User Score Overview An arrogant third master of a powerful family falls in love at first sight with a pretty young maiden and uses every means possible to force her hand in marriage, despite her harboring a crush on another man. In the beginning of a coerced marriage, she resents him and rejects all his advances and gestures of love, but their love story slowly develops after going through obstacles in times of war and chaos. However, things get complicated when her old flame returns and becomes her husband’s assistant. ~~ Adapted from the novel by Fei Wo Si Cun. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elvis Han Yi Lian Kai Sun Yi Qin Sang Jeremy Xu Zheng-Xi Pan Jian Chi / Liu Wang Ping Ma Jing Han Yi Lian Yi Hao Ze Jia Deng Yu Lin Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Siege in Fog premiered on March  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Siege in Fog. You can help by rating TV shows you've seen. Facts Original Name  人生若如初相见 Status  Returning Series Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords romance Content Score 71 Just a little bit more... Top Contributors j 25 jklmo M 17 Maria180493 15 Elizabeth Jennings w 2 woogoldsgreat  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}