{"link": "https://www.themoviedb.org/tv/63409?language=en", "title": "Gokusen", "resume": "Newly graduate Yamaguchi Kumiko an idealistic teacher who entered Shirokin High to be a math teacher. Having high hopes for her students, her world turned up side down when she finds out that she'll be teaching the class 3-D the hardest class to take care of. Class 3-D is a bunch of students who looks more like delinquents and trouble makers. The students show no respect to teachers nor a little kindness. Each and every student doesn't like teacher for almost everyone has no good memories of them. The leader of the class is Sawada Shin. He is well respected for there are rumors that he beat a teacher to death. The students try there hardest to bully and make fun of her so she'll quit but all there efforts went to waste because Yamaguchi ain't an ordinary Teacher. Yamaguchi Kumiko is actually the 4th generation heir to Oedo group, a yakuza clan. Even though everyone in there clan wants her to the next leader, she made up her mind and so everyone accepted it. Eventually in the story, the students found out that she is different from other teacher and earned their respects. They called her Yankumi...", "rate": 75, "genre": ["Drama"], "cast": ["Yukie Nakama"], "character": ["Kumiko Yamaguchi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63409   Expand Gokusen   (2002) User Score Overview Newly graduate Yamaguchi Kumiko an idealistic teacher who entered Shirokin High to be a math teacher. Having high hopes for her students, her world turned up side down when she finds out that she'll be teaching the class 3-D the hardest class to take care of. Class 3-D is a bunch of students who looks more like delinquents and trouble makers. The students show no respect to teachers nor a little kindness. Each and every student doesn't like teacher for almost everyone has no good memories of them. The leader of the class is Sawada Shin. He is well respected for there are rumors that he beat a teacher to death. The students try there hardest to bully and make fun of her so she'll quit but all there efforts went to waste because Yamaguchi ain't an ordinary Teacher. Yamaguchi Kumiko is actually the 4th generation heir to Oedo group, a yakuza clan. Even though everyone in there clan wants her to the next leader, she made up her mind and so everyone accepted it. Eventually in the story, the students found out that she is different from other teacher and earned their respects. They called her Yankumi... Featured Crew Kozueko Morimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yukie Nakama Kumiko Yamaguchi Full Cast & Crew Last Season Season 3 2008 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2005-10-21 Boys Over Flowers 7.9    1998-10-07 Charmed 6.7  Facts Original Name  ｢ごくせん｣ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors s 11 s2upid 9 Elizabeth Jennings A 8 Aka75 S 5 SnM  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}