{"link": "https://www.themoviedb.org/tv/71994?language=en", "title": "Extinct", "resume": "400 years after the extinction of the human race, a small group of humans are revived by an alien civilization. The colony of revived humans encounter struggles with the aliens who extinguished humankind centuries before, while trying to understand and get along with the mysterious aliens who revived them.", "rate": 57, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Victoria Atkin", "Chad Michael Collins", "Matthew Bellows", "Yorke Fryer"], "character": ["Feena", "Ezra", "Jax", "Abram"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71994   Expand Extinct   (2017) User Score  Play Trailer Overview 400 years after the extinction of the human race, a small group of humans are revived by an alien civilization. The colony of revived humans encounter struggles with the aliens who extinguished humankind centuries before, while trying to understand and get along with the mysterious aliens who revived them. Featured Crew Orson Scott Card Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victoria Atkin Feena Chad Michael Collins Ezra Matthew Bellows Jax Yorke Fryer Abram Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Extinct premiered on October  1, 2017. View All Seasons Social Reviews  1 Discussions  0 m A review by mercuryman  7.0 Written by  mercuryman  on October  5, 2017 This is my first ever post on anything, anywhere ever!!!  So Wish me Luck.\nExtinct features some quite interesting sci-fi themes and ideas in this new series such as the possible futre uses of nanotechnology, time-travel and AI to mention a few.  Set in a dystopian future 400 yrs hence, it focuses on the trials,tribulations and conundrums that a nano-regenerated group of humans face to restart society in a desolate and barren world. The regenerated humans have also to contend with unknown alien parasites and the presence of a powerful, but unknown alien power/force. For a lowish bu...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2017-12-06 Knightfall 6.2    2017-07-24 Midnight, Texas 6.6    2017-10-05 Ghost Wars 6.0    2017-09-29 Marvel's Inhumans 5.6    2017-12-10 Counterpart 7.2    2016-02-26 Fuller House 5.6    2016-10-17 Travelers 7.5    2017-12-06 HAPPY! 7.4  Facts Status  Cancelled Network BYU Television Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://extinct.tv/ Genres Sci-Fi & Fantasy Keywords future alien survival Content Score 100 Yes! Looking good! Top Contributors 20 curtisgibby 8 Nero Kosonen 5 Mervan 5 hairball  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}