{"link": "https://www.themoviedb.org/tv/72141?language=en", "title": "The Defiant Ones", "resume": "A four-part documentary series that tells the stories of Jimmy Iovine and Dr. Dre -- one the son of a Brooklyn longshoreman, the other straight out of Compton - -- and their improbable partnership and surprising leading roles in a series of transformative events in contemporary culture.", "rate": 77, "genre": ["Documentary"], "cast": ["Dr. Dre", "Jimmy Iovine"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72141   Expand The Defiant Ones   (2017) User Score Overview A four-part documentary series that tells the stories of Jimmy Iovine and Dr. Dre -- one the son of a Brooklyn longshoreman, the other straight out of Compton - -- and their improbable partnership and surprising leading roles in a series of transformative events in contemporary culture. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dr. Dre Himself Jimmy Iovine Himself Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of The Defiant Ones premiered on July  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2017-08-01 Manhunt: Unabomber 7.8    2017-07-21 Ozark 8.0    2013-03-04 Broadchurch 8.1    2016-07-10 The Night Of 7.7    2013-02-01 House of Cards 8.2    2007-08-13 Californication 7.4    2017-10-13 Mindhunter 7.4    1997-03-10 Buffy the Vampire Slayer 8.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  90m, 60m Homepage   https://defiantones.com/ Genres Documentary Keywords rap music Content Score 56 We're so close, yet so far. Top Contributors 33 Elizabeth Jennings 8 Travis Bell 4 SmacBasanKasap a 2 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}