{"link": "https://www.themoviedb.org/tv/1551?language=en", "title": "The Kids in the Hall", "resume": "The Kids in the Hall is a Canadian sketch comedy group formed in 1984, consisting of comedians Dave Foley, Kevin McDonald, Bruce McCulloch, Mark McKinney, and Scott Thompson. Their eponymous television show ran from 1988 to 1994 on CBC in Canada, and 1989 to 1995 on CBS and HBO in the United States. The theme song for the show was the instrumental \"Having an Average Weekend\" by the Canadian band Shadowy Men on a Shadowy Planet.\nThe troupe made one movie, Brain Candy, which was released in 1996. The troupe reformed for various tours and comedy festivals in 2000. They released an eight-part miniseries, Death Comes to Town in January, 2010.\nThe name of the group came from Sid Caesar, who, if a joke didn't go over, or played worse than expected, would attribute it to \"the kids in the hall\", referring to a group of young writers hanging around the studio.", "rate": 79, "genre": ["Comedy"], "cast": ["Mark McKinney", "Scott Thompson", "Dave Foley", "Kevin McDonald", "Bruce McCulloch"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1551   Expand The Kids in the Hall   (1989) User Score Overview The Kids in the Hall is a Canadian sketch comedy group formed in 1984, consisting of comedians Dave Foley, Kevin McDonald, Bruce McCulloch, Mark McKinney, and Scott Thompson. Their eponymous television show ran from 1988 to 1994 on CBC in Canada, and 1989 to 1995 on CBS and HBO in the United States. The theme song for the show was the instrumental \"Having an Average Weekend\" by the Canadian band Shadowy Men on a Shadowy Planet. The troupe made one movie, Brain Candy, which was released in 1996. The troupe reformed for various tours and comedy festivals in 2000. They released an eight-part miniseries, Death Comes to Town in January, 2010. The name of the group came from Sid Caesar, who, if a joke didn't go over, or played worse than expected, would attribute it to \"the kids in the hall\", referring to a group of young writers hanging around the studio. Featured Crew Mark McKinney Creator Dave Foley Creator Bruce McCulloch Creator Kevin McDonald Creator Scott Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark McKinney Scott Thompson Dave Foley Kevin McDonald Bruce McCulloch Full Cast & Crew Last Season Season 5 1994 | 22 Episodes Season 5 of The Kids in the Hall premiered on October  5, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   1988-11-14 Murphy Brown 6.5    1999-04-07 Strangers with Candy 7.0    2010-01-12 The Kids in the Hall: Death Comes to Town 6.0    2007-08-06 Drunk History 6.6    1981-05-16 SCTV Network 90 8.1    2007-04-22 Kingdom 7.0    1971-01-12 All in the Family 7.8    1969-09-26 The Brady Bunch 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 3 sashacmc 1 RubeensVinicius 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}