{"link": "https://www.themoviedb.org/tv/11515?language=en", "title": "The Defenders", "resume": "The Defenders is an American courtroom drama series that ran on CBS from 1961–1965. It starred E. G. Marshall and Robert Reed as father-and-son defense attorneys who specialized in legally complex cases, with defendants such as neo-Nazis, conscientious objectors, civil rights demonstrators, a schoolteacher fired for being an atheist, an author accused of pornography, and a physician charged in a mercy killing. It was created by television writer Reginald Rose.\nThe Museum of Broadcast Communications called it \"perhaps the most socially conscious series the medium has ever seen\", a show \"singularly resonant with New Frontier liberalism.\"\nIn 2002, The Defenders was ranked #31 on TV Guide's 50 Greatest TV Shows of All Time. and in 2013 TV Guide ranked it #8 in its list of The 60 Greatest Dramas of All Time.", "rate": 90, "genre": ["Drama"], "cast": ["E.G. Marshall", "Robert Reed", "Joan Hackett", "Polly Rowles", "Robert Redford"], "character": ["Lawrence Preston", "Kenneth Preston", "Joan Miller", "Helen Donaldson", "Gary Degan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11515   Expand The Defenders   (1961) User Score Overview The Defenders is an American courtroom drama series that ran on CBS from 1961–1965. It starred E. G. Marshall and Robert Reed as father-and-son defense attorneys who specialized in legally complex cases, with defendants such as neo-Nazis, conscientious objectors, civil rights demonstrators, a schoolteacher fired for being an atheist, an author accused of pornography, and a physician charged in a mercy killing. It was created by television writer Reginald Rose. The Museum of Broadcast Communications called it \"perhaps the most socially conscious series the medium has ever seen\", a show \"singularly resonant with New Frontier liberalism.\" In 2002, The Defenders was ranked #31 on TV Guide's 50 Greatest TV Shows of All Time. and in 2013 TV Guide ranked it #8 in its list of The 60 Greatest Dramas of All Time. Featured Crew Reginald Rose Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast E.G. Marshall Lawrence Preston Robert Reed Kenneth Preston Joan Hackett Joan Miller Polly Rowles Helen Donaldson Robert Redford Gary Degan Full Cast & Crew Last Season Season 4 1964 | 30 Episodes Season 4 of The Defenders premiered on September 24, 1964. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Defenders. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords parent child relationship lawyer courtroom defense attorney courtroom drama Content Score 93 Almost there... Top Contributors 48 Steve 9 Banana 3 niqo19 D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}