{"link": "https://www.themoviedb.org/tv/1165?language=en", "title": "Rebus", "resume": "Rebus is the title of the detective drama TV series based on the Inspector Rebus novels by the Scottish author Ian Rankin set in and around Edinburgh. The series was produced by STV Productions for the ITV network.\nFour seasons have been aired; series 1 starred John Hannah and was made for STV by his own production company, Clerkenwell Films. A new cast featuring Ken Stott as DI John Rebus was introduced for the second and subsequent series.", "rate": 59, "genre": ["Drama"], "cast": ["Ken Stott", "Claire Price", "John Hannah", "Sara Stewart"], "character": ["Rebus", "Siobhan Clarke", "Rebus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1165   Expand Rebus   (2000) User Score Overview Rebus is the title of the detective drama TV series based on the Inspector Rebus novels by the Scottish author Ian Rankin set in and around Edinburgh. The series was produced by STV Productions for the ITV network. Four seasons have been aired; series 1 starred John Hannah and was made for STV by his own production company, Clerkenwell Films. A new cast featuring Ken Stott as DI John Rebus was introduced for the second and subsequent series. Featured Crew Ian Rankin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Stott Rebus Claire Price Siobhan Clarke John Hannah Rebus Sara Stewart Full Cast & Crew Last Season Season 4 2007 | 4 Episodes Season 4 of Rebus premiered on October  5, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2013-10-16 The Tunnel 7.5    2007-04-08 Inspector George Gently 8.3    2003-03-27 New Tricks 7.3    1992-12-06 A Touch of Frost 7.9    2011-09-16 DCI Banks 7.9    2007-02-18 Inspector Lewis 7.6    2009-02-02 Whitechapel 7.5    2002-10-27 Foyle's War 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Drama Keywords scotland self-destruction police detective police inspector Content Score 93 Almost there... Top Contributors 9 Banana m 7 miro22 3 Markxist S 2 Saltpieter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}