{"link": "https://www.themoviedb.org/tv/2210?language=en", "title": "Tarzan", "resume": "From the day two decades ago that young John Clayton's parents died and left him alone in the African jungle, he was raised by apes and has emerged as the fearless Tarzan. Captured by his billionaire uncle, Richard Clayton, the CEO of powerful Greystoke Industries, Tarzan is returned, against his will, to his family's home in New York City. Resisting captivity, he escapes into the concrete jungle of New York City where he encounters the strong-willed NYPD detective Jane Porter. Jane's perfectly ordered life is turned upside-down by Tarzan's dangerous yet profoundly untainted morality. Romantically involved with another member of the force, Detective Michael Foster, Jane is left to choose between reason and instinct, civilization and pure humanity, her head and her heart.", "rate": 47, "genre": ["Action", "Adventure", "Drama"], "cast": ["Travis Fimmel", "Sarah Wayne Callies", "Miguel A. Núñez, Jr.", "Leighton Meester", "Lucy Lawless"], "character": ["John Clayton Jr. / Tarzan", "Officer Jane Porter", "Detective Sam Sullivan", "Nicki Porter", "Kathleen Clayton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2210   Expand Tarzan   (2003) User Score Overview From the day two decades ago that young John Clayton's parents died and left him alone in the African jungle, he was raised by apes and has emerged as the fearless Tarzan. Captured by his billionaire uncle, Richard Clayton, the CEO of powerful Greystoke Industries, Tarzan is returned, against his will, to his family's home in New York City. Resisting captivity, he escapes into the concrete jungle of New York City where he encounters the strong-willed NYPD detective Jane Porter. Jane's perfectly ordered life is turned upside-down by Tarzan's dangerous yet profoundly untainted morality. Romantically involved with another member of the force, Detective Michael Foster, Jane is left to choose between reason and instinct, civilization and pure humanity, her head and her heart. Featured Crew Eric Kripke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Travis Fimmel John Clayton Jr. / Tarzan Sarah Wayne Callies Officer Jane Porter Miguel A. Núñez, Jr. Detective Sam Sullivan Leighton Meester Nicki Porter Lucy Lawless Kathleen Clayton Full Cast & Crew Last Season Season 1 2003 | 8 Episodes Season 1 of Tarzan premiered on October  5, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tarzan. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Action & Adventure Drama Keywords new york feral child tarzan police detective nypd female detective Content Score 93 Almost there... Top Contributors 26 Banana 6 Travis Bell 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}