{"link": "https://www.themoviedb.org/tv/72851?language=en", "title": "Live Up To Your Name", "resume": "Heo Im is an oriental doctor, acknowledged as the best in acupuncture and moxibustion in Joseon. His success is blocked due to his low status.\nOne day, Heo Im travels though time and finds himself in present day Seoul. He meets Choi Yeon-Kyung. She is doctor firmly believing in only modern medicine.", "rate": 51, "genre": ["Drama"], "cast": ["Kim Nam-gil", "Kim Ah-joong", "Yoo Min-kyu", "Moon Ga-young", "Uhm Hyo-sup"], "character": ["Heo Im", "Choi Yeon-Kyung", "Yoo Jae-Ha / Yoo Jin-O", "Dongmakgae", "Heo Jun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72851   Expand Live Up To Your Name   (2017) User Score Overview Heo Im is an oriental doctor, acknowledged as the best in acupuncture and moxibustion in Joseon. His success is blocked due to his low status. One day, Heo Im travels though time and finds himself in present day Seoul. He meets Choi Yeon-Kyung. She is doctor firmly believing in only modern medicine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Nam-gil Heo Im Kim Ah-joong Choi Yeon-Kyung Yoo Min-kyu Yoo Jae-Ha / Yoo Jin-O Moon Ga-young Dongmakgae Uhm Hyo-sup Heo Jun Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Live Up To Your Name premiered on August 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2017-08-09 Manhole 7.3    2017-07-19 Reunited Worlds 8.3    2017-07-19 Man Who Dies to Live 8.3    2017-08-05 Save Me 7.0    2017-07-24 Falsify 6.1    2017-05-10 Ruler: Master of the Mask 6.7    2017-08-04 Strongest Deliveryman 6.3    2017-08-30 Hospital Ship 4.8  Facts Original Name  명불허전 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/tvndrheo/ Genres Drama Keywords time travel medicine romance korea Content Score 86 Almost there... Top Contributors M 43 Maria180493 12 Sarah V 7 Violsa t 4 taxigps  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}