{"link": "https://www.themoviedb.org/tv/74830?language=en", "title": "Oh, the Mysterious", "resume": "Il Seung was wrongly accused of a crime and imprisoned, and has spent ten years on death row. He manages to break out of prison and somehow becomes a fake cop, then sets out to find a hidden stash of 100 billion won (nearly 100 million dollars) on behalf of criminals who will supply him with a new identity upon receipt. He has three days to find the cash and begin his new life.", "rate": 65, "genre": ["Drama"], "cast": ["Yoon Kyun-sang", "Jung Hye-sung", "Kim Hee-won", "Do Ki-Seok", "Kang Shin-hyo"], "character": ["Oh Il-Seung", "Jin Jin-Young", "Park Soo-Chil", "Kim Min-Pyo", "Kwon Dae-Woong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74830   Expand Oh, the Mysterious   (2017) User Score Overview Il Seung was wrongly accused of a crime and imprisoned, and has spent ten years on death row. He manages to break out of prison and somehow becomes a fake cop, then sets out to find a hidden stash of 100 billion won (nearly 100 million dollars) on behalf of criminals who will supply him with a new identity upon receipt. He has three days to find the cash and begin his new life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Kyun-sang Oh Il-Seung Jung Hye-sung Jin Jin-Young Kim Hee-won Park Soo-Chil Do Ki-Seok Kim Min-Pyo Kang Shin-hyo Kwon Dae-Woong Full Cast & Crew Current Season Season 1 2017 | 40 Episodes Season 1 of Oh, the Mysterious premiered on November 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Oh, the Mysterious. You can help by rating TV shows you've seen. Facts Original Name  의문의 일승 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://programs.sbs.co.kr/drama/ohthemysterious/ Genres Drama Keywords thriller Content Score 86 Almost there... Top Contributors M 45 Maria180493 9 Elizabeth Jennings 3 seboseboss 1 davidjoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}