{"link": "https://www.themoviedb.org/tv/65746?language=en", "title": "Goodbye Mr. Black", "resume": "Cha Ji-Won is a UDT officer of the Navy Special Operations Force. He is positive and has personal charm, but he falls into a desperate situation due to a friend's betrayal. He goes through numerous life or death situations. Cha Ji-Won then enters into a fake marriage with Swan to hide his identity. Through the bright persona of Swan, Cha Ji-Won falls in love and regains his trust of others.", "rate": 54, "genre": ["Drama"], "cast": ["Lee Jin-wook", "Moon Chae-won", "Kim Kang-woo", "Song Jae-rim", "Yoo In-young"], "character": ["Cha Ji-won / Mr. Black", "Kim Swan", "Min Seon-jae", "Seo Woo-jin", "Yoon Ma-ri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65746   Expand Goodbye Mr. Black   (2016) User Score Overview Cha Ji-Won is a UDT officer of the Navy Special Operations Force. He is positive and has personal charm, but he falls into a desperate situation due to a friend's betrayal. He goes through numerous life or death situations. Cha Ji-Won then enters into a fake marriage with Swan to hide his identity. Through the bright persona of Swan, Cha Ji-Won falls in love and regains his trust of others. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jin-wook Cha Ji-won / Mr. Black Moon Chae-won Kim Swan Kim Kang-woo Min Seon-jae Song Jae-rim Seo Woo-jin Yoo In-young Yoon Ma-ri Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of Goodbye Mr. Black premiered on March 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2016-03-18 Ms. Temper & Nam Jung Gi 6.0    2012-08-18 Panda and Hedgehog 6.0    2016-08-27 Our Gap Soon 9.3    2014-03-17 Secret Love Affair 7.8    2017-09-04 Argon 6.8    2016-11-21 White Nights 8.0    2016-05-13 Mirror of the Witch 5.2    2016-09-02 Fantastic 4.9  Facts Original Name  굿바이 미스터 블랙 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/mrblack/ Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors M 41 Maria180493 t 7 tmdb38202327 5 Zlogorek z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}