{"link": "https://www.themoviedb.org/tv/37646?language=en", "title": "The Nine Lives of Chloe King", "resume": "Chloe King is looking forward to celebrating her birthday with her friends and single mother, just like every other year... that is until she starts developing heightened abilities and discovers she's being pursued by a mysterious figure. Chloe soon learns she's part of an ancient race which has been hunted by human assassins for millennia —and that she may be their only hope for ultimate survival.", "rate": 64, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Skyler Samuels", "Benjamin Stone", "Grey Damon", "Ki Hong Lee", "Alyssa Diaz"], "character": ["Chloe King", "Alek Petrov", "Brian Rezza", "Paul", "Jasmine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37646   Expand The Nine Lives of Chloe King   (2011) User Score Overview Chloe King is looking forward to celebrating her birthday with her friends and single mother, just like every other year... that is until she starts developing heightened abilities and discovers she's being pursued by a mysterious figure. Chloe soon learns she's part of an ancient race which has been hunted by human assassins for millennia —and that she may be their only hope for ultimate survival. Featured Crew Dan Berendsen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Skyler Samuels Chloe King Benjamin Stone Alek Petrov Grey Damon Brian Rezza Ki Hong Lee Paul Alyssa Diaz Jasmine Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of The Nine Lives of Chloe King premiered on June 14, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply L Wonderful show. Possibilities! Open 0 by Lloyd\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  6 Recommendations   2014-02-17 Star-Crossed 5.6    2012-11-24 Labyrinth 5.7    2008-04-15 Absolute Boyfriend 8.0    2014-10-02 A to Z 5.7    2011-09-15 The Secret Circle 6.6    2012-10-11 Beauty and the Beast 5.7    2010-09-08 Hellcats 5.6    2012-03-21 Bent 6.5  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://freeform.go.com/shows/the-nine-lives-of-chloe-king Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords high school teenager supernatural ability supernatural teen based on young adult novel Content Score 93 Almost there... Top Contributors 25 Banana 18 Elizabeth Jennings 6 MrDCamargo z 6 zvat  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}