{"link": "https://www.themoviedb.org/tv/417?language=en", "title": "The Class", "resume": "A group of 20-somethings are linked through attending the same third-grade class. An impromptu reunion begins on the 20th anniversary of the day they all met and each is wondering if they'll have anything in common. Some are eager to show off, some want to rekindle old playground crushes, but most just want to satisfy their curiosity.", "rate": 73, "genre": ["Comedy"], "cast": ["Andrea Anders", "Jon Bernthal", "Lizzy Caplan", "Jesse Tyler Ferguson", "Heather Goldenhersh"], "character": ["Nicole Allen", "Duncan Carmello", "Kat Warbler", "Richie Velch", "Lina Warbler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 417   Expand The Class   (2006) User Score Overview A group of 20-somethings are linked through attending the same third-grade class. An impromptu reunion begins on the 20th anniversary of the day they all met and each is wondering if they'll have anything in common. Some are eager to show off, some want to rekindle old playground crushes, but most just want to satisfy their curiosity. Featured Crew David Crane Creator Jeffrey Klarik Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Andrea Anders Nicole Allen Jon Bernthal Duncan Carmello Lizzy Caplan Kat Warbler Jesse Tyler Ferguson Richie Velch Heather Goldenhersh Lina Warbler Full Cast & Crew Last Season Season 1 2006 | 19 Episodes Season 1 of The Class premiered on September 18, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2015-03-31 Weird Loners 5.8    2006-07-12 Nightmares & Dreamscapes: From the Stories of Stephen King 6.4  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://theclass.warnerbrostv.com/theclass/default.aspx Genres Comedy Keywords group of friends class reunion sitcom Content Score 100 Yes! Looking good! Top Contributors 6 ModrejTom 6 Banana 5 Travis Bell w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}