{"link": "https://www.themoviedb.org/tv/3213?language=en", "title": "Marcus Welby, M.D.", "resume": "Marcus Welby, M.D. is an American medical drama television program that aired on ABC from September 23, 1969, to July 29, 1976. It starred Robert Young as a family practitioner with a kind bedside manner and James Brolin as the younger doctor he often worked with, and was produced by David Victor and David J. O'Connell. The pilot, A Matter of Humanities, had aired as an ABC Movie of the Week on March 26, 1969.", "rate": 79, "genre": ["Drama"], "cast": ["Robert Young", "James Brolin", "Pamela Hensley", "Sharon Gless", "Elena Verdugo"], "character": ["Consuelo Lopez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3213   Expand Marcus Welby, M.D.   (1969) User Score Overview Marcus Welby, M.D. is an American medical drama television program that aired on ABC from September 23, 1969, to July 29, 1976. It starred Robert Young as a family practitioner with a kind bedside manner and James Brolin as the younger doctor he often worked with, and was produced by David Victor and David J. O'Connell. The pilot, A Matter of Humanities, had aired as an ABC Movie of the Week on March 26, 1969. Featured Crew David Victor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Young James Brolin Pamela Hensley Sharon Gless Elena Verdugo Consuelo Lopez Full Cast & Crew Last Season Season 7 1975 | 23 Episodes Season 7 of Marcus Welby, M.D. premiered on September  9, 1975. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Dr. Steven Kiley: Happy Birthday James Brolin! Open 0 by wonder2wonder\n      \n     Welcome Open 0 by Jayhn1111\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1949-09-15 The Lone Ranger 5.4    1974-09-09 Rhoda 4.5    1970-01-21 Nanny and the Professor 3.5    1968-09-21 Adam-12 6.7    1963-09-29 My Favorite Martian 5.4    1971-09-17 McMillan & Wife 7.2    1957-09-18 Wagon Train 6.3    1966-09-08 Tarzan 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords hospital doctor santa monica california Content Score 93 Almost there... Top Contributors R 9 Rebecca 9 lineker S 3 Samara 2 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}