{"link": "https://www.themoviedb.org/tv/14555?language=en", "title": "Baantjer", "resume": "Baantjer is a Dutch television programme which was broadcast by RTL 4 from 6 October 1995 until 1 December 2006 for a total of 123 episodes in 12 seasons. It stars Piet Römer as Jurriaan 'Jurre' de Cock, a police detective, and Victor Reinier as Dick Vledder, his helper. The series is based on the novels of writer A. C. Baantjer.\nIn 1999, RTL 4 broadcast the television film Baantjer, de film: De Cock en de wraak zonder einde because of the tenth anniversary of the network.", "rate": 90, "genre": ["Crime"], "cast": ["Piet Römer", "Victor Reinier", "Kirsten van Dissel", "Martin Schwab", "Serge-Henri Valcke"], "character": ["De Cock", "Dick Vledder", "Iris de Graaff", "Ab Keizer", "Corneel Buitendam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14555   Expand Baantjer   (1995) User Score Overview Baantjer is a Dutch television programme which was broadcast by RTL 4 from 6 October 1995 until 1 December 2006 for a total of 123 episodes in 12 seasons. It stars Piet Römer as Jurriaan 'Jurre' de Cock, a police detective, and Victor Reinier as Dick Vledder, his helper. The series is based on the novels of writer A. C. Baantjer. In 1999, RTL 4 broadcast the television film Baantjer, de film: De Cock en de wraak zonder einde because of the tenth anniversary of the network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Piet Römer De Cock Victor Reinier Dick Vledder Kirsten van Dissel Iris de Graaff Martin Schwab Ab Keizer Serge-Henri Valcke Corneel Buitendam Full Cast & Crew Last Season Season 12 2006 | 8 Episodes Season 12 of Baantjer premiered on August 18, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Baantjer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.baantjer.org/televisie/tv-serie.htm Genres Crime Keywords amsterdam Content Score 93 Almost there... Top Contributors 7 18 7Bee-NL 13 whazaaa 3 BudsieBuds 2 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}