{"link": "https://www.themoviedb.org/tv/21750?language=en", "title": "Eden of the East", "resume": "Eden of the East is a Japanese anime television series, which premiered on Fuji TV's noitaminA timeslot on April 9, 2009. Created, directed and written by Kenji Kamiyama, it features character designs by Chika Umino and animation production by Production I.G. Based on an original story by Kamiyama, it is the first original noitaminA series.\nA compilation of the TV series, Eden of The East Compilation: Air Communication, had a limited theatrical release on September 26, 2009. Two other theatrical films have also been released. Eden of the East Movie I: The King of Eden was released in Japan on November 28, 2009 and the second movie, Eden of the East the Movie II: Paradise Lost, was released on March 13, 2010. The TV series and both films have been licensed for release in North America by Funimation Entertainment. On December 27, 2010, the series made its North American debut on the FUNimation Channel.", "rate": 70, "genre": ["Animation", "Drama", "Mystery", "Comedy", "Action", "Adventure"], "cast": ["Saori Hayami", "Ryohei Kimura", "Atsushi Miyauchi", "Ayaka Saitou", "Hayato Taya"], "character": ["Saki Morimi", "Akira Takizawa", "Daiju Mononobe", "Mikuru Katsuhara", "Haruo Kasuga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21750   Expand Eden of the East   (2009) User Score Overview Eden of the East is a Japanese anime television series, which premiered on Fuji TV's noitaminA timeslot on April 9, 2009. Created, directed and written by Kenji Kamiyama, it features character designs by Chika Umino and animation production by Production I.G. Based on an original story by Kamiyama, it is the first original noitaminA series. A compilation of the TV series, Eden of The East Compilation: Air Communication, had a limited theatrical release on September 26, 2009. Two other theatrical films have also been released. Eden of the East Movie I: The King of Eden was released in Japan on November 28, 2009 and the second movie, Eden of the East the Movie II: Paradise Lost, was released on March 13, 2010. The TV series and both films have been licensed for release in North America by Funimation Entertainment. On December 27, 2010, the series made its North American debut on the FUNimation Channel. Featured Crew Kenji Kamiyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saori Hayami Saki Morimi Ryohei Kimura Akira Takizawa Atsushi Miyauchi Daiju Mononobe Ayaka Saitou Mikuru Katsuhara Hayato Taya Haruo Kasuga Full Cast & Crew Last Season Higashi no eden season 1 2009 | 11 Episodes Season 1 of Eden of the East premiered on April  9, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  5 Recommendations   2012-10-12 Robotics;Notes 4.7    2012-04-05 Sankarea: Undying Love 7.0    2016-06-30 Sweetness & Lightning 7.3    2007-07-27 Baccano! 8.4    2015-04-05 Plastic Memories 6.8    2012-07-08 Kokoro Connect 7.0    2003-08-26 Full Metal Panic? Fumoffu 6.7    2008-10-02 Toradora! 7.5  Facts Original Name  東のエデン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Mystery Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors r 13 rocman p 8 p.dio b 5 beachsounddog J 4 JohnyB0y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}