{"link": "https://www.themoviedb.org/tv/60627?language=en", "title": "Xanadu", "resume": "The family Valadine has produced porno movies since years. But the golden age of the erotic film is over. The market, the business and the movies are getting harder. Nevertheless Alex Valadine refuses to go with the latest trends and gets in conflict with his sons, the next generation of porno maker. The family empire bursts under the consequences of intrigues and corruption. In this world of love and hate, sex and violence the family is facing a big challenge.", "rate": 63, "genre": [], "cast": ["Jean-Baptiste Malartre", "Julien Boisselier", "Julien Boisselier", "Swann Arlaud", "Nora Arnezeder"], "character": ["Alex Valadine", "Laurent Valadine", "Sarah Valadine", "Lapo Valadine", "Varvara Valadine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60627   Expand Xanadu   (2011) User Score Overview The family Valadine has produced porno movies since years. But the golden age of the erotic film is over. The market, the business and the movies are getting harder. Nevertheless Alex Valadine refuses to go with the latest trends and gets in conflict with his sons, the next generation of porno maker. The family empire bursts under the consequences of intrigues and corruption. In this world of love and hate, sex and violence the family is facing a big challenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jean-Baptiste Malartre Alex Valadine Julien Boisselier Laurent Valadine Julien Boisselier Sarah Valadine Swann Arlaud Lapo Valadine Nora Arnezeder Varvara Valadine Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of Xanadu premiered on April 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Xanadu. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors M 53 Mr_Popeye d 5 denis z 5 zurman1 3 ibinbin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}