{"link": "https://www.themoviedb.org/tv/61333?language=en", "title": "Stigma of the Wind", "resume": "Four years ago, Kazuma Kannagi was defeated by his cousin Ayano Kannagi for the right to be the successor of Enraiha, a sword passed down in the Kannagi family. His defeat, along with his lack of talent for En-Jutsu, the fire arts, the Kannagis' specialty, resulted in his banishment from the family. Now, Kazuma returns as Kazuma Yagami, a skilled master of Fū-Jutsu, the wind arts.", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Ayumi Fujimura", "Cherami Leigh", "Daisuke Ono", "Robert McCollum", "Kanako Sakai"], "character": ["Ayano KANNAGI", "Ayano KANNAGI", "Kazuma YAGAMI", "Kazuma YAGAMI", "Ayumi TSUWABUKI"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61333   Expand Stigma of the Wind   (2007) User Score  Play Trailer Overview Four years ago, Kazuma Kannagi was defeated by his cousin Ayano Kannagi for the right to be the successor of Enraiha, a sword passed down in the Kannagi family. His defeat, along with his lack of talent for En-Jutsu, the fire arts, the Kannagis' specialty, resulted in his banishment from the family. Now, Kazuma returns as Kazuma Yagami, a skilled master of Fū-Jutsu, the wind arts. Featured Crew Yamato Takahiro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayumi Fujimura Ayano KANNAGI Cherami Leigh Ayano KANNAGI Daisuke Ono Kazuma YAGAMI Robert McCollum Kazuma YAGAMI Kanako Sakai Ayumi TSUWABUKI Full Cast & Crew Last Season Season 1 2007 | 24 Episodes Season 1 of Stigma of the Wind premiered on April 13, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  7 Recommendations   2006-10-04 Negima!? Magister Negi Magi 5.9    2012-04-05 Sankarea: Undying Love 7.0    2005-04-04 Aquarion 5.8    2014-10-04 Lord Marksman and Vanadis 10.0    2012-07-06 Aesthetica of a Rogue Hero 7.1    2005-01-06 Negima! Magister Negi Magi 6.7    2014-04-05 Dragonar Academy 7.0    2012-04-08 Dusk Maiden of Amnesia 7.6  Facts Original Name  風のスティグマ Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/kaze-no-stigma/home Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords magic super power seinen contemporary fantasy based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 118 Ronnie Borgquist 12 Elizabeth Jennings t 12 theusedversion 11 WillofOwn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}