{"link": "https://www.themoviedb.org/tv/72884?language=en", "title": "Jérémie", "resume": "This summer, Jérémie is determined to mojo back! Haunted by a painful secret, the young woman finds refuge in a new job at the Domaine du Lac beach along with five lifeguards: Raphaëlle, Camille, Olivier, Thomas and Maxim. What better way to forget your troubles than partying in the sun?", "rate": 100, "genre": ["Drama"], "cast": ["Karelle Tremblay", "Stéphanie Arav-Clocchiatti", "Claudia Bouvette", "Antoine L'Écuyer", "Lou-Pascal Tremblay"], "character": ["Jérémie Archambault", "Camille Desjardins-Bouchard", "Raphaëlle Parker", "Olivier", "Maxime Castonguay"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72884   Expand Jérémie   (2015) User Score Overview This summer, Jérémie is determined to mojo back! Haunted by a painful secret, the young woman finds refuge in a new job at the Domaine du Lac beach along with five lifeguards: Raphaëlle, Camille, Olivier, Thomas and Maxim. What better way to forget your troubles than partying in the sun? Featured Crew Marie-Hélène Lapierre Creator Kristine Metz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karelle Tremblay Jérémie Archambault Stéphanie Arav-Clocchiatti Camille Desjardins-Bouchard Claudia Bouvette Raphaëlle Parker Antoine L'Écuyer Olivier Lou-Pascal Tremblay Maxime Castonguay Full Cast & Crew Last Season Season 3 2017 | 17 Episodes Season 3 of Jérémie premiered on September  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Jérémie. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  French Runtime  23m Homepage   http://www.vrak.tv/emissions/jeremie-1.1490337 Genres Drama Keywords beach quebec summer group of friends lifeguard summer job young adult Content Score 93 Almost there... Top Contributors 82 Guipat 57 Banana 5 warham28 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}