{"link": "https://www.themoviedb.org/tv/3454?language=en", "title": "Stingray", "resume": "Stingray is a British children's Supermarionation television series, created by Gerry and Sylvia Anderson and produced by AP Films for ATV and ITC Entertainment between 1964 and 1965. Its 39 half-hour episodes were originally screened on ATV in the United Kingdom and in syndication in the United States. The scriptwriters included the Andersons, Alan Fennell and Dennis Spooner. Barry Gray composed the music, and Derek Meddings served as special effects director.\nStingray was the first Supermarionation production to be filmed in colour, and also the first in which the marionette puppet characters had interchangeable heads featuring a variety of expressions. It was furthermore the first British TV programme to be filmed entirely in colour. At this time American TV networks were preparing for full-time colour broadcasting, although independent television in the UK did not commence colour transmission until November 1969.", "rate": 68, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Lois Maxwell", "Don Mason", "Ray Barrett", "David Graham", "Robert Easton"], "character": ["Lt Atlantis Shore", "Captain Troy Tempest", "Commander Sam Shore", "Marinville Tracking Station", "Lieutenant George Lee Sheridan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3454   Expand Stingray   (1964) User Score Overview Stingray is a British children's Supermarionation television series, created by Gerry and Sylvia Anderson and produced by AP Films for ATV and ITC Entertainment between 1964 and 1965. Its 39 half-hour episodes were originally screened on ATV in the United Kingdom and in syndication in the United States. The scriptwriters included the Andersons, Alan Fennell and Dennis Spooner. Barry Gray composed the music, and Derek Meddings served as special effects director. Stingray was the first Supermarionation production to be filmed in colour, and also the first in which the marionette puppet characters had interchangeable heads featuring a variety of expressions. It was furthermore the first British TV programme to be filmed entirely in colour. At this time American TV networks were preparing for full-time colour broadcasting, although independent television in the UK did not commence colour transmission until November 1969. Featured Crew Gerry Anderson Creator Sylvia Anderson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lois Maxwell Lt Atlantis Shore Don Mason Captain Troy Tempest Ray Barrett Commander Sam Shore David Graham Marinville Tracking Station Robert Easton Lieutenant George Lee Sheridan Full Cast & Crew Last Season (1964) season 1 1964 | 40 Episodes Season 1 of Stingray premiered on October  4, 1964. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1967-09-29 Captain Scarlet and the Mysterons 8.3    1968-09-29 Joe 90 7.8    1965-09-30 Thunderbirds 8.1    1967-09-09 Spider-Man 7.9    1968-09-14 Wacky Races 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 17 Norrin_Radd_Of_Zenn_La R 4 Rebecca a 3 adltata 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}