{"link": "https://www.themoviedb.org/tv/31179?language=en", "title": "The Lone Ranger", "resume": "The Lone Ranger is an American western television series that ran from 1949 to 1957, starring Clayton Moore with Jay Silverheels as Tonto. The live-action series initially featured Gerald Mohr as the episode narrator. Fred Foy served as both narrator and announcer of the radio series from 1948 to its finish and became announcer of the television version when story narration was dropped there. This was by far the highest-rated television program on the ABC network in the early 1950s and its first true \"hit\".", "rate": 66, "genre": ["Western", "Action", "Adventure"], "cast": ["Clayton Moore", "Jay Silverheels", "John Hart"], "character": ["The Lone Ranger", "Tonto", "The Lone Ranger (Season 2 only)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31179   Expand The Lone Ranger   (1949) User Score Overview The Lone Ranger is an American western television series that ran from 1949 to 1957, starring Clayton Moore with Jay Silverheels as Tonto. The live-action series initially featured Gerald Mohr as the episode narrator. Fred Foy served as both narrator and announcer of the radio series from 1948 to its finish and became announcer of the television version when story narration was dropped there. This was by far the highest-rated television program on the ABC network in the early 1950s and its first true \"hit\". Featured Crew George W. Trendle Creator Fran Striker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clayton Moore The Lone Ranger Jay Silverheels Tonto John Hart The Lone Ranger (Season 2 only) Full Cast & Crew Last Season Season 3 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1952-12-05 The Abbott and Costello Show 5.6    1969-09-23 Marcus Welby, M.D. 6.8    1970-01-21 Nanny and the Professor 3.5    1971-09-17 McMillan & Wife 7.2    1963-09-29 My Favorite Martian 5.4    1968-09-21 Adam-12 6.7    1966-09-08 Tarzan 5.5    1957-09-18 Wagon Train 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 Elizabeth Jennings 4 Steve RW 3 Rich Wannen R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}