{"link": "https://www.themoviedb.org/tv/72632?language=en", "title": "Enmusubi no Youko-chan", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 70, "genre": ["Comedy", "Animation"], "cast": ["Hatano Wataru", "Kana Asumi", "Shinnosuke Tachibana", "Daisuke Kirii", "Asami Imai"], "character": ["Haku Gauche", "Tosan Suusu", "Han Unhi", "Ou Fuuki", "Reki Setsuyou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72632   Expand Enmusubi no Youko-chan   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Xin Wang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hatano Wataru Haku Gauche Kana Asumi Tosan Suusu Shinnosuke Tachibana Han Unhi Daisuke Kirii Ou Fuuki Asami Imai Reki Setsuyou Full Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of Enmusubi no Youko-chan premiered on June 30, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Enmusubi no Youko-chan. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Enmusubi no Youko-chan. You can help by rating TV shows you've seen. Facts Original Name  縁結びの妖狐ちゃん Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://enmusuyouko.com/ Genres Comedy Animation Keywords fantasy romance demon combat youkai Content Score 86 Almost there... Top Contributors i 21 iknvya D 17 Destr0y 16 Zorro1 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}