{"link": "https://www.themoviedb.org/tv/47801?language=en", "title": "Last Tango in Halifax", "resume": "Celia and Alan are both widowed and in their seventies. When their respective grandsons put their details on Facebook, they rediscover a passionate relationship that started over sixty years ago.", "rate": 66, "genre": ["Drama", "Comedy"], "cast": ["Anne Reid", "Derek Jacobi", "Sarah Lancashire", "Nicola Walker", "Tony Gardner"], "character": ["Celia", "Alan", "Caroline", "Gillian", "John"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47801   Expand Last Tango in Halifax   (2012) User Score Overview Celia and Alan are both widowed and in their seventies. When their respective grandsons put their details on Facebook, they rediscover a passionate relationship that started over sixty years ago. Featured Crew Sally Wainwright Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Reid Celia Derek Jacobi Alan Sarah Lancashire Caroline Nicola Walker Gillian Tony Gardner John Full Cast & Crew Last Season Series 4 2016 | 2 Episodes Season 4 of Last Tango in Halifax premiered on December 19, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Is this series still active, and will it eventually resume airing on PBS? Open 4 by  genplant29 Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2013-03-18 WPC 56 5.5    2011-10-25 Death in Paradise 7.6  Facts Status  Returning Series Networks Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b03h4107 Genres Drama Comedy Keywords northern england romance yorkshire love school farmer british humour Content Score 93 Almost there... Top Contributors 38 Elizabeth Jennings 19 Steve O 7 Ozbourne w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}