{"link": "https://www.themoviedb.org/tv/43657?language=en", "title": "Arne Dahl", "resume": "An elite, seven-member team is tasked with solving the most complex crimes in Sweden, from murder and drug trafficking to espionage.", "rate": 60, "genre": ["Mystery", "Crime"], "cast": ["Malin Arvidsson", "Natalie Minnevik", "Shanti Roney", "Alexander Salzberger", "Magnus Samuelsson"], "character": ["Kerstin Holm", "Ida Jankowicz", "Paul Hjelm", "Jorge Chavez", "Gunnar Nyberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43657   Expand Arne Dahl   (2011) User Score Overview An elite, seven-member team is tasked with solving the most complex crimes in Sweden, from murder and drug trafficking to espionage. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Malin Arvidsson Kerstin Holm Natalie Minnevik Ida Jankowicz Shanti Roney Paul Hjelm Alexander Salzberger Jorge Chavez Magnus Samuelsson Gunnar Nyberg Full Cast & Crew Last Season Season 2 2015 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply S02E09/10 - I don't trust Helena Open 0 by Marr 🇳🇱\n      \n     Malin Arvidsson looks so different in Season 2! Open 0 by Marr\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Arne Dahl. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Swedish Runtime  58m, 88m Homepage   https://www.arnedahl.net/?rID=1114&page=film-&-tv Genres Mystery Crime Keywords based on novel or book police sweden organized crime serial killer crime investigation nordic noir Content Score 93 Almost there... Top Contributors 151 Marr 🇳🇱 TB 7 TMDb Bot z 3 zhoreto 3 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}