{"link": "https://www.themoviedb.org/tv/11563?language=en", "title": "Bread", "resume": "Bread is a British television sitcom, written by Carla Lane, produced by the BBC and screened on BBC1 from 1 May 1986 to 3 November 1991.\nThe series focused on the devoutly-Catholic and extended Boswell family of Liverpool, in the district of Dingle, led by its matriarch Nellie through a number of ups and downs as they tried to make their way through life in Thatcher's Britain with no visible means of support. The street shown at the start of each programme is Elswick Street. A family called Boswell had also featured in Lane's earlier sitcom The Liver Birds and Lane admitted in interviews that the two families were probably related.\nNellie's feckless and estranged husband, Freddie, left her for another woman known as 'Lilo Lill'. Her children Joey, Jack, Adrian, Aveline and Billy continued to live in the family home in Kelsall Street and contributed money to the central family fund, largely through benefit fraud and the sale of stolen goods.", "rate": 78, "genre": ["Comedy"], "cast": ["Peter Howitt", "Jean Boht", "Bryan Murray", "Graham Bickley", "Nick Conway"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11563   Expand Bread   (1986) User Score Overview Bread is a British television sitcom, written by Carla Lane, produced by the BBC and screened on BBC1 from 1 May 1986 to 3 November 1991. The series focused on the devoutly-Catholic and extended Boswell family of Liverpool, in the district of Dingle, led by its matriarch Nellie through a number of ups and downs as they tried to make their way through life in Thatcher's Britain with no visible means of support. The street shown at the start of each programme is Elswick Street. A family called Boswell had also featured in Lane's earlier sitcom The Liver Birds and Lane admitted in interviews that the two families were probably related. Nellie's feckless and estranged husband, Freddie, left her for another woman known as 'Lilo Lill'. Her children Joey, Jack, Adrian, Aveline and Billy continued to live in the family home in Kelsall Street and contributed money to the central family fund, largely through benefit fraud and the sale of stolen goods. Featured Crew Carla Lane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Howitt Jean Boht Bryan Murray Graham Bickley Nick Conway Full Cast & Crew Last Season Season 7 1991 | 10 Episodes Season 7 of Bread premiered on September  1, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1986-09-01 Brush Strokes 7.8    1981-12-24 The Kenny Everett Television Show 7.0    1987-09-26 ChuckleVision 6.3    1974-01-03 It Ain't Half Hot Mum 8.0    1995-09-14 They Think It's All Over 7.3    1979-10-29 Only When I Laugh 6.0    1984-03-07 Fresh Fields 7.0    1984-01-29 Ever Decreasing Circles 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords mother northern england liverpool family unemployment benefits sitcom british humour Content Score 93 Almost there... Top Contributors O 11 Ozbourne o 1 olivermoran  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}