{"link": "https://www.themoviedb.org/tv/71014?language=en", "title": "Sagrada Reset", "resume": "Nearly half the population of Sakurada, a small town near the Pacific Ocean, has some sort of unique power. These powers range from being able to enter the mind of a cat, to resetting the world back to a certain point in time in the past. There is a group known as the \"Kanrikyoku\" that controls and monitors the use of these powers. Asai Kei and Haruki Misora work for their school's club called \"Houshi\" club, which execute any missions received from the Kanrikyoku. Misora has the ability to reset the world 3 days. This means that all events and any memory of the past 3 days that \"could have\" happened, never happened. Kei has the ability to \"remember\" the past. Even after Misora uses her powers to reset the world back 3 days, Kei will retain those 3 days in his memory. Combining their powers, these two solve missions issued by the Kanrikyoku.", "rate": 90, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kaito Ishikawa", "Kana Hanazawa"], "character": ["Kei Asai (voice)", "Misora Haruki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71014   Expand Sagrada Reset   (2017) User Score  Play Trailer Overview Nearly half the population of Sakurada, a small town near the Pacific Ocean, has some sort of unique power. These powers range from being able to enter the mind of a cat, to resetting the world back to a certain point in time in the past. There is a group known as the \"Kanrikyoku\" that controls and monitors the use of these powers. Asai Kei and Haruki Misora work for their school's club called \"Houshi\" club, which execute any missions received from the Kanrikyoku. Misora has the ability to reset the world 3 days. This means that all events and any memory of the past 3 days that \"could have\" happened, never happened. Kei has the ability to \"remember\" the past. Even after Misora uses her powers to reset the world back 3 days, Kei will retain those 3 days in his memory. Combining their powers, these two solve missions issued by the Kanrikyoku. Featured Crew Shinya Kawamo Creator Katsuhiko Takayama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaito Ishikawa Kei Asai (voice) Kana Hanazawa Misora Haruki (voice) Full Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of Sagrada Reset premiered on April  5, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Sagrada Reset. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Sagrada Reset. You can help by rating TV shows you've seen. Facts Original Name  サクラダリセット Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://sagrada-anime.com/ Genres Animation Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors C 24 Chintaran 14 sp1ti 7 Despair-Paradise s 7 scott2029  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}