{"link": "https://www.themoviedb.org/tv/6046?language=en", "title": "El Tigre: The Adventures of Manny Rivera", "resume": "El Tigre: The Adventures of Manny Rivera is Nickelodeon's first ever flash animation series produced for Nickelodeon and Nicktoons Network. The first screening of the show was on January 19, 2007 in the first ever Nickelodeon Creative Summit held in San Juan, Puerto Rico as a special treat for the 60 exclusive attendees. Later sneak peeks aired on February 19, with the series television debut on March 3, 2007 for both networks. It premiered on YTV on May 4, 2007. The entire series is available on iTunes as Season 1, and is also available on the PlayStation Network Store. The Entire series is also available for viewing on the Nickelodeon website.", "rate": 50, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Alanna Ubach", "Grey DeLisle", "April Stewart"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6046   Expand El Tigre: The Adventures of Manny Rivera   (2007) User Score Overview El Tigre: The Adventures of Manny Rivera is Nickelodeon's first ever flash animation series produced for Nickelodeon and Nicktoons Network. The first screening of the show was on January 19, 2007 in the first ever Nickelodeon Creative Summit held in San Juan, Puerto Rico as a special treat for the 60 exclusive attendees. Later sneak peeks aired on February 19, with the series television debut on March 3, 2007 for both networks. It premiered on YTV on May 4, 2007. The entire series is available on iTunes as Season 1, and is also available on the PlayStation Network Store. The Entire series is also available for viewing on the Nickelodeon website. Featured Crew Jorge Gutiérrez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alanna Ubach Grey DeLisle April Stewart Full Cast & Crew Last Season Season 1 2007 | 19 Episodes Season 1 of El Tigre: The Adventures of Manny Rivera premiered on February 19, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2003-08-01 My Life as a Teenage Robot 6.1    2003-04-12 All Grown Up! 4.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage   http://www.nick.com/shows/el_tigre/index.jhtml Genres Action & Adventure Animation Comedy Keywords mexico teen superhero Content Score 50 Still needs a little work. Top Contributors 10 Banana s 3 speedycars 3 danimados t 1 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}