{"link": "https://www.themoviedb.org/tv/74887?language=en", "title": "Money Flower", "resume": "The story of people driven by greed. Kang Pil-Joo grew up at an orphanage, but he now works as a managing director of a legal team at a corporation. He is acknowledged for his intelligence and his exemplary job performance. Some of those that work around him are jealous of him. Na Mo-Hyun is an environmental activist and a science teacher at a middle school. She is a good listener and laughs a lot. She dreams of a love driven by fate.", "rate": 87, "genre": ["Drama"], "cast": ["Jang Hyuk", "Park Se-young", "Jang Seung-jo", "Lee Soon-jae", "Lee Mi-sook"], "character": ["Kang Pil-Joo", "Na Mo-Hyun", "Jang Boo-Chun", "Jang Gook-Hwan", "Jung Mal-Ran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74887   Expand Money Flower   (2017) User Score Overview The story of people driven by greed. Kang Pil-Joo grew up at an orphanage, but he now works as a managing director of a legal team at a corporation. He is acknowledged for his intelligence and his exemplary job performance. Some of those that work around him are jealous of him. Na Mo-Hyun is an environmental activist and a science teacher at a middle school. She is a good listener and laughs a lot. She dreams of a love driven by fate. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Hyuk Kang Pil-Joo Park Se-young Na Mo-Hyun Jang Seung-jo Jang Boo-Chun Lee Soon-jae Jang Gook-Hwan Lee Mi-sook Jung Mal-Ran Full Cast & Crew Current Season Season 1 2017 | 24 Episodes Season 1 of Money Flower premiered on November 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2017-10-11 Mad Dog 8.0    2017-10-09 Witch's Court 9.3    2017-01-16 Introverted Boss 8.7    2017-09-27 While You Were Sleeping 9.0    2017-03-15 Radiant Office 6.9    2017-01-25 Chief Kim 7.5    2017-03-20 The Liar and His Lover 8.3    2017-04-17 My Secret Romance 7.6  Facts Original Name  돈꽃 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/moneyflower/ Genres Drama Keywords romance Content Score 86 Almost there... Top Contributors 24 huggi M 23 Maria180493 7 Elizabeth Jennings 3 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}