{"link": "https://www.themoviedb.org/tv/63822?language=en", "title": "Delete", "resume": "Delete imagines a disaster in our all-too-fragile digital world where all computers could become dangerously self-aware with one systematic purpose–to destroy mankind. Faced with possible extinction, there is only one way out–create a second artificial intelligence, just as alive, just as intelligent and just as dangerous.", "rate": 57, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Keir Gilchrist", "Erin Karpluk", "Ryan Robbins", "Gil Bellows", "Seth Green"], "character": ["Daniel Gerson", "Jesse White", "Max Hollis", "Lt. General Michael Overson", "Lucifer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63822   Expand Delete   (2013) User Score  Play Trailer Overview Delete imagines a disaster in our all-too-fragile digital world where all computers could become dangerously self-aware with one systematic purpose–to destroy mankind. Faced with possible extinction, there is only one way out–create a second artificial intelligence, just as alive, just as intelligent and just as dangerous. Featured Crew Steve Barron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keir Gilchrist Daniel Gerson Erin Karpluk Jesse White Ryan Robbins Max Hollis Gil Bellows Lt. General Michael Overson Seth Green Lucifer Full Cast & Crew Last Season Season 1 2013 | 2 Episodes Season 1 of Delete premiered on August 19, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations   2009-02-14 Impact 5.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  88m Homepage   http://www.reelz.com/delete/ Genres Sci-Fi & Fantasy Keywords artificial intelligence computer hacker computer virus technology martial law street riots disaster miniseries computer hacker human vs computer Content Score 100 Yes! Looking good! Top Contributors 96 Marr 🇳🇱 35 Banana TB 20 TMDb Bot 12 Owla  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}