{"link": "https://www.themoviedb.org/tv/206?language=en", "title": "Picket Fences", "resume": "Picket Fences is an American television drama about the residents of the town of Rome, Wisconsin, created and produced by David E. Kelley. The show initially ran from September 18, 1992, to June 26, 1996, on the CBS television network in the United States. It sometimes struggled to maintain a stable prime-time audience and had fluctuating ratings, due in part to its Friday night time slot. In its first season on the air it placed 80th in the prime-time Nielsen ratings and in its second season it moved to 66th. The show's exteriors were shot in the L.A. suburb of Monrovia, California, with many of the townspeople appearing in the background of episodes.", "rate": 77, "genre": ["Drama", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 206   Expand Picket Fences   (1992) User Score Overview Picket Fences is an American television drama about the residents of the town of Rome, Wisconsin, created and produced by David E. Kelley. The show initially ran from September 18, 1992, to June 26, 1996, on the CBS television network in the United States. It sometimes struggled to maintain a stable prime-time audience and had fluctuating ratings, due in part to its Friday night time slot. In its first season on the air it placed 80th in the prime-time Nielsen ratings and in its second season it moved to 66th. The show's exteriors were shot in the L.A. suburb of Monrovia, California, with many of the townspeople appearing in the background of episodes. Featured Crew David E. Kelley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 1995 | 6 Episodes Season 4 of Picket Fences premiered on September 22, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Picket Fences. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Drama Comedy Keywords small town small town sheriff Content Score 64 We're so close, yet so far. Top Contributors 23 Banana 5 Medianoche 4 lineker 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}