{"link": "https://www.themoviedb.org/tv/2354?language=en", "title": "Home and Away", "resume": "Home and Away is set in the fictional town of Summer Bay, a coastal town in New South Wales, and follows the personal and professional lives of the people living in the area. The show initially focused on the Fletcher family, Pippa and Tom Fletcher and their five foster children Frank Morgan, Carly Morris, Steven Matheson, Lynn Davenport and Sally Keating, who would go on to become one of the show's longest-running characters. The show also originally and currently focuses on the Stewart family. During the early 2000s, the central storylines focused on the Sutherlands and later, the Hunters. Home and Away had proved popular when it premiered in 1988 and had risen to become a hit in Australia, and after only a few weeks, the show tackled its first major and disturbing storyline, the rape of Carly Morris; it was one of the first shows to feature such storylines during the early timeslot. H&A has tackled many adult-themed and controversial storylines; something rarely found in its restricted timeslot.", "rate": 41, "genre": ["Soap", "Drama"], "cast": ["Ray Meagher", "Scott Lee", "Olivia Deeble", "Sophie Dillman", "Anna Cocquerel"], "character": ["Alf Stewart", "Hunter King", "Raffy Morrison", "Ziggy Astoni", "CoCo Astoni"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2354   Expand Home and Away   (1988) User Score Overview Home and Away is set in the fictional town of Summer Bay, a coastal town in New South Wales, and follows the personal and professional lives of the people living in the area. The show initially focused on the Fletcher family, Pippa and Tom Fletcher and their five foster children Frank Morgan, Carly Morris, Steven Matheson, Lynn Davenport and Sally Keating, who would go on to become one of the show's longest-running characters. The show also originally and currently focuses on the Stewart family. During the early 2000s, the central storylines focused on the Sutherlands and later, the Hunters. Home and Away had proved popular when it premiered in 1988 and had risen to become a hit in Australia, and after only a few weeks, the show tackled its first major and disturbing storyline, the rape of Carly Morris; it was one of the first shows to feature such storylines during the early timeslot. H&A has tackled many adult-themed and controversial storylines; something rarely found in its restricted timeslot. Featured Crew Alan Bateman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ray Meagher Alf Stewart Scott Lee Hunter King Olivia Deeble Raffy Morrison Sophie Dillman Ziggy Astoni Anna Cocquerel CoCo Astoni Full Cast & Crew Current Season Season 31 2018 | 8 Episodes Season 31 of Home and Away premiered on January 29, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply U John is a sick fuck Open 0 by UrielF\n      \n     U Stop saying \"Veeje\" Open 0 by UrielF\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations   1995-08-12 Soccer AM 5.0    A Question of Sport 6.5  Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  20m, 21m, 22m Homepage   http://yahoo7.com.au/homeandaway Genres Soap Drama Keywords australia beach Content Score 93 Almost there... Top Contributors c 2,712 courtneysmith86 47 Medianoche TB 23 TMDb Bot 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}