{"link": "https://www.themoviedb.org/tv/49071?language=en", "title": "Valley of the Wolves: Ambush", "resume": "A continuation series of Osman Sinav's The Wolves Of The Valley. This produce focuses on politics, National Security and Regional Middle East problems. The Wolves of The Valley: Ambush serie also attracts attention by two film; The Wolves of The Valley: Iraq and The Wolves of The Valley: Palestine.", "rate": 55, "genre": ["Action", "Adventure", "Drama"], "cast": ["Muhammed Necati Şaşmaz", "Kenan Çoban", "Erhan Ufak", "Cahit Kayaoğlu", "Ayşe Çiğdem Batur"], "character": ["Polat Alemdar", "Abdülhey Çoban", "Güllü Erhan", "Cahit Kaya", "Savcı Leyla Türkmen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49071   Expand Valley of the Wolves: Ambush   (2007) User Score Overview A continuation series of Osman Sinav's The Wolves Of The Valley. This produce focuses on politics, National Security and Regional Middle East problems. The Wolves of The Valley: Ambush serie also attracts attention by two film; The Wolves of The Valley: Iraq and The Wolves of The Valley: Palestine. Featured Crew Raci Şaşmaz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Muhammed Necati Şaşmaz Polat Alemdar Kenan Çoban Abdülhey Çoban Erhan Ufak Güllü Erhan Cahit Kayaoğlu Cahit Kaya Ayşe Çiğdem Batur Savcı Leyla Türkmen Full Cast & Crew Last Season Season 10 2015 | 37 Episodes Season 10 of Valley of the Wolves: Ambush premiered on September 17, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Valley of the Wolves: Ambush. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Valley of the Wolves: Ambush. You can help by rating TV shows you've seen. Facts Original Name  Kurtlar Vadisi: Pusu Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  90m Homepage   https://www.kanald.com.tr/kurtlar-vadisi-pusu Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors P 57 Pisac 27 mtastepe 12 Elizabeth Jennings 12 Mucahid Zeyrek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}