{"link": "https://www.themoviedb.org/tv/63088?language=en", "title": "Aoharu x Machinegun", "resume": "When Hotaru moves into a new apartment alone, there's a mysterious man standing nearby the apartment. Hotaru decides to confront the man, who turns out to live in the neighboring apartment. The next day at school, Hotaru's best friend Kanae tells Hotaru that a host tricked her out of her money. When Hotaru goes to confront the host, he happens to be none other than Hotaru's neighbor, Masamune?!", "rate": 70, "genre": ["Action", "Animation", "Comedy"], "cast": ["Yoshitsugu Matsuoka", "Mikako Komatsu", "Kazuyuki Okitsu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63088   Expand Aoharu x Machinegun   (2015) User Score Overview When Hotaru moves into a new apartment alone, there's a mysterious man standing nearby the apartment. Hotaru decides to confront the man, who turns out to live in the neighboring apartment. The next day at school, Hotaru's best friend Kanae tells Hotaru that a host tricked her out of her money. When Hotaru goes to confront the host, he happens to be none other than Hotaru's neighbor, Masamune?! Featured Crew NAOE Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshitsugu Matsuoka Mikako Komatsu Kazuyuki Okitsu Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Aoharu x Machinegun premiered on July  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Aoharu x Machinegun. You can help by rating TV shows you've seen. Facts Original Name  青春×機関銃 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tbs.co.jp/anime/aoharu/ Genres Action Animation Comedy Keywords based on manga anime Content Score 64 We're so close, yet so far. Top Contributors j 35 jnylen 10 Banana 8 BrerFox 8 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}