{"link": "https://www.themoviedb.org/tv/63593?language=en", "title": "Documentary Now!", "resume": "Documentary Now lovingly parodies some of the world's best-known documentaries. Each episode is shot in a different style of documentary filmmaking, and honors some of the most important stories that didn't actually happen.", "rate": 75, "genre": ["Comedy"], "cast": ["Bill Hader", "Fred Armisen"], "character": ["Various Characters", "Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63593   Expand Documentary Now!   (2015) User Score Overview Documentary Now lovingly parodies some of the world's best-known documentaries. Each episode is shot in a different style of documentary filmmaking, and honors some of the most important stories that didn't actually happen. Featured Crew Seth Meyers Creator Bill Hader Creator Fred Armisen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Hader Various Characters Fred Armisen Various Characters Full Cast & Crew Last Season Season 2 2016 | 7 Episodes Season 2 of Documentary Now! premiered on September 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2015-12-24 Dawn of the Croods 6.6    2011-02-08 Traffic Light 7.2    2009-07-08 Getting On 6.7    2015-06-12 Conspiracy 5.7    2014-04-28 Heartless 5.9    2015-06-18 Hoff the Record 6.0    2017-01-01 Beau Séjour 7.9    2015-12-01 Real Rob 5.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.ifc.com/shows/documentary-now Genres Comedy Keywords parody mockumentary Content Score 64 We're so close, yet so far. Top Contributors A 26 Asset 24 Elizabeth Jennings z 4 zurman1 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}