{"link": "https://www.themoviedb.org/tv/60216?language=en", "title": "The Voice Spain", "resume": "La Voz is a Spanish reality talent show that premiered on 19 September 2012 on Telecinco. It is part of the international syndication The Voice based on the original Dutch television program The Voice of Holland, created by Dutch television producer John de Mol.\nOne of the important premises of the show is the quality of the singing talent. Four coaches, themselves popular performing artists, train the talents in their group and occasionally perform with them. Talents are selected in blind auditions, where the coaches cannot see, but only hear the audition.\nThe series is hosted by Jesús Vázquez, with Tania Llasera as social media correspondent. The original judging panel consisted of David Bisbal, Rosario Flores, Malú and Melendi as the four coaches. In the second season, Antonio Orozco replaced Melendi.", "rate": 90, "genre": ["Reality"], "cast": ["Manuel Carrasco", "Pablo López", "Malú", "Juanes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60216   Expand The Voice Spain User Score Overview La Voz is a Spanish reality talent show that premiered on 19 September 2012 on Telecinco. It is part of the international syndication The Voice based on the original Dutch television program The Voice of Holland, created by Dutch television producer John de Mol. One of the important premises of the show is the quality of the singing talent. Four coaches, themselves popular performing artists, train the talents in their group and occasionally perform with them. Talents are selected in blind auditions, where the coaches cannot see, but only hear the audition. The series is hosted by Jesús Vázquez, with Tania Llasera as social media correspondent. The original judging panel consisted of David Bisbal, Rosario Flores, Malú and Melendi as the four coaches. In the second season, Antonio Orozco replaced Melendi. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Manuel Carrasco Pablo López Malú Juanes Full Cast & Crew Last Season Season 5 2017 | 5 Episodes Season 5 of The Voice Spain premiered on September 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Original Name  La Voz Status  Returning Series Network Certification  - Type  Reality Original Language  Spanish; Castilian Runtime  200m Homepage   19 de septiembre de 2012 Genres Reality Keywords music tv show Content Score 93 Almost there... Top Contributors 27 virtualnation 21 Elizabeth Jennings p 2 pepecine TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}