{"link": "https://www.themoviedb.org/tv/76139?language=en", "title": "Pop Team Epic", "resume": "Crude, rude, and a little…cute? Get ready for the larger-than-life attitude of Popuko and Pipimi, the small and tall stars of Pop Team Epic! Based off the bizarre four-panel webcomic by Bukubu Okawa comes a comedy that’ll throw you off with its out-there jokes and intense absurdity. You think you’re ready for these girls? Think again, F#%**er!", "rate": 64, "genre": ["Comedy", "Animation"], "cast": ["Shunsuke Itakura", "Tōru Adachi", "Fanny Bloc", "Christine Bellier"], "character": ["Popuko [Bob Team Epic] (voice)", "Pipimi [Bob Team Epic] (voice)", "Popuko [JAPON MiGNON] (voice)", "Pipimi [JAPON MiGNON] (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76139   Expand Pop Team Epic   (2018) User Score Overview Crude, rude, and a little…cute? Get ready for the larger-than-life attitude of Popuko and Pipimi, the small and tall stars of Pop Team Epic! Based off the bizarre four-panel webcomic by Bukubu Okawa comes a comedy that’ll throw you off with its out-there jokes and intense absurdity. You think you’re ready for these girls? Think again, F#%**er! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Shunsuke Itakura Popuko [Bob Team Epic] (voice) Tōru Adachi Pipimi [Bob Team Epic] (voice) Fanny Bloc Popuko [JAPON MiGNON] (voice) Christine Bellier Pipimi [JAPON MiGNON] (voice) Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Pop Team Epic premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for Pop Team Epic. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Pop Team Epic. You can help by rating TV shows you've seen. Facts Original Name  ポプテピピック Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://hoshiiro.jp Genres Comedy Animation Keywords based on 4-koma Content Score 93 Almost there... Top Contributors 21 brockero 13 sp1ti 9 Despair-Paradise 6 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}