{"link": "https://www.themoviedb.org/tv/12908?language=en", "title": "Flikken", "resume": "Flikken was a popular Flemish-Belgian TV series about a police-department located in Ghent. The show started in 1999 and ended recently on 19 April 2009. In the series, a team of six police officers solved various crimes, petty crimes as well as organised crime. The series always aimed at showing the policework in a realistic way - though a little personal drama was never far off. Of all the actors that came along during the ten seasons, only Mark Tijsmans and Ludo Hellinx appeared throughout the entire series.\nFlikken was produced by the VRT and broadcast on Belgian public channel Eén and TROS in the Netherlands. Flikken is very popular in Belgium and the Netherlands. The show has had very high ratings of up to 1.8 million viewers during the last season.\nEvery year the VRT organises the Flikkendag, a family day where the public can meet the actors of the show. There are many games, demonstrations of the real police and other safety organisations and performances of singers. On 18 April 2009, a special farewell party was organised in Ghent, in which the actors and crew said goodbye to their fans - thousands had assembled to watch the show on stage.", "rate": 60, "genre": ["Drama", "Action", "Adventure"], "cast": ["Mark Tijsmans", "Ludo Hellinx", "Jo De Meyere", "Ianka Fleerackers", "Pascale Michiels"], "character": ["Wilfried Pasmans", "Raymond Jacobs", "John Nauwelaerts", "Emma Boon", "Cat Reyniers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12908   Expand Flikken   (1999) User Score Overview Flikken was a popular Flemish-Belgian TV series about a police-department located in Ghent. The show started in 1999 and ended recently on 19 April 2009. In the series, a team of six police officers solved various crimes, petty crimes as well as organised crime. The series always aimed at showing the policework in a realistic way - though a little personal drama was never far off. Of all the actors that came along during the ten seasons, only Mark Tijsmans and Ludo Hellinx appeared throughout the entire series. Flikken was produced by the VRT and broadcast on Belgian public channel Eén and TROS in the Netherlands. Flikken is very popular in Belgium and the Netherlands. The show has had very high ratings of up to 1.8 million viewers during the last season. Every year the VRT organises the Flikkendag, a family day where the public can meet the actors of the show. There are many games, demonstrations of the real police and other safety organisations and performances of singers. On 18 April 2009, a special farewell party was organised in Ghent, in which the actors and crew said goodbye to their fans - thousands had assembled to watch the show on stage. Featured Crew Pierre De Clercq Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Tijsmans Wilfried Pasmans Ludo Hellinx Raymond Jacobs Jo De Meyere John Nauwelaerts Ianka Fleerackers Emma Boon Pascale Michiels Cat Reyniers Full Cast & Crew Last Season Season 10 2009 | 10 Episodes Season 10 of Flikken premiered on February 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2007-09-03 Flikken Maastricht 6.8  Facts Status  Ended Network Certification 6 Meaning Take care with children under 6. Type  Scripted Original Language  Dutch; Flemish Runtime  50m Homepage  - Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 118 tmdb61358576 11 tafelpoowt 2 Banana 7 1 7Bee-NL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}