{"link": "https://www.themoviedb.org/tv/39048?language=en", "title": "Jane by Design", "resume": "Jane by Design is an American comedy-drama television series on ABC Family. The series followed the life of Jane Quimby, a teenager who had to be mistaken for an adult to finally get her fashion dream job and work with a world-famous designer, Gray Chandler Murray. She has to juggle between two secret lives: one in high school, and one in high fashion. The network green-lighted the series in April 2011. The series premiered on January 3, 2012, following Switched at Birth. On February 29, 2012, the series was given an 8-episode back order. It premiered in the summer on June 5, 2012 and ended on July 31, 2012. On August 17, 2012, ABC Family announced that the show was canceled.", "rate": 58, "genre": ["Drama", "Comedy"], "cast": ["Andie MacDowell", "India de Beaufort", "Erica Dasher", "Rowly Dennis", "Matthew Atkinson"], "character": ["Gray Chandler Murray", "India Jordain", "Jane Quimby", "Jeremy Jones", "Gray Chandler Murray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39048   Expand Jane by Design   (2012) User Score Overview Jane by Design is an American comedy-drama television series on ABC Family. The series followed the life of Jane Quimby, a teenager who had to be mistaken for an adult to finally get her fashion dream job and work with a world-famous designer, Gray Chandler Murray. She has to juggle between two secret lives: one in high school, and one in high fashion. The network green-lighted the series in April 2011. The series premiered on January 3, 2012, following Switched at Birth. On February 29, 2012, the series was given an 8-episode back order. It premiered in the summer on June 5, 2012 and ended on July 31, 2012. On August 17, 2012, ABC Family announced that the show was canceled. Featured Crew April Blair Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andie MacDowell Gray Chandler Murray India de Beaufort India Jordain Erica Dasher Jane Quimby Rowly Dennis Jeremy Jones Matthew Atkinson Gray Chandler Murray Full Cast & Crew Last Season Season 1 2012 | 18 Episodes Season 1 of Jane by Design premiered on January  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations   2013-06-23 Devious Maids 5.8    2013-01-14 The Carrie Diaries 4.9    2012-09-11 The New Normal 5.2    2014-07-08 Finding Carter 5.6    1998-06-06 Sex and the City 5.5    2004-10-03 Desperate Housewives 6.6    2011-10-23 Once Upon a Time 6.4    2005-03-27 Grey's Anatomy 6.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.abcfamily.go.com/shows/jane-by-design Genres Drama Comedy Keywords high school fashion lying Content Score 93 Almost there... Top Contributors 24 Banana R 5 Rebecca D 4 David1886 p 3 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}