{"link": "https://www.themoviedb.org/tv/521?language=en", "title": "Fetch! with Ruff Ruffman", "resume": "Fetch! with Ruff Ruffman, sometimes shortened as Fetch!, is a children's television series for children ages 6–12 on PBS during the PBS Kids Go! block of educational programming. It is a game show/reality show that is hosted by an animated anthropomorphic dog named Ruff Ruffman who dispenses challenges to the show's real-life contestants. The series ran for five seasons and 100 episodes from May 29, 2006 to November 4, 2010 on PBS, with 30 contestants in that time. In June 2010, WGBH announced that the series would end due to lack of funding. In June 2008, the series received its first Emmy for Best Original Song for its theme.", "rate": 0, "genre": ["Animation"], "cast": ["Jim Conroy"], "character": ["Ruff Ruffman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 521   Expand Fetch! with Ruff Ruffman   (2006) User Score Overview Fetch! with Ruff Ruffman, sometimes shortened as Fetch!, is a children's television series for children ages 6–12 on PBS during the PBS Kids Go! block of educational programming. It is a game show/reality show that is hosted by an animated anthropomorphic dog named Ruff Ruffman who dispenses challenges to the show's real-life contestants. The series ran for five seasons and 100 episodes from May 29, 2006 to November 4, 2010 on PBS, with 30 contestants in that time. In June 2010, WGBH announced that the series would end due to lack of funding. In June 2008, the series received its first Emmy for Best Original Song for its theme. Featured Crew Kate Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Conroy Ruff Ruffman Full Cast & Crew Last Season Season 5 2010 | 20 Episodes Season 5 of Fetch! with Ruff Ruffman premiered on October  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fetch! with Ruff Ruffman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.wgbh.org/ Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}