{"link": "https://www.themoviedb.org/tv/21771?language=en", "title": "The Great Queen Seondeok", "resume": "Queen Seondeok is a 2009 South Korean historical drama, starring Lee Yo-won, Go Hyun-jung, Uhm Tae-woong, Park Ye-jin, Kim Nam-gil and Yoo Seung-ho. It chronicles the life of Queen Seondeok of Silla. It aired on MBC from May 25 to December 22, 2009 on Mondays and Tuesdays at 21:55 for 62 episodes.\nThe viewership ratings for the show topped TV charts almost every week during its run, peaking at 44.7 percent. It swept the 2009 MBC Drama Awards; actress Go Hyun-jung's performance and subsequent grand prize win received near-universal acclaim.", "rate": 84, "genre": ["Drama", "History"], "cast": ["Lee Yo-won", "Nam Ji-hyeon", "Kim Nam-gil", "Ko Hyun-jung", "Uhm Tae-woong"], "character": ["Princess Deokman", "young Princess Deokman", "Bidam", "Lady Mishil", "Kim Yushin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21771   Expand The Great Queen Seondeok   (2009) User Score  Play Trailer Overview Queen Seondeok is a 2009 South Korean historical drama, starring Lee Yo-won, Go Hyun-jung, Uhm Tae-woong, Park Ye-jin, Kim Nam-gil and Yoo Seung-ho. It chronicles the life of Queen Seondeok of Silla. It aired on MBC from May 25 to December 22, 2009 on Mondays and Tuesdays at 21:55 for 62 episodes. The viewership ratings for the show topped TV charts almost every week during its run, peaking at 44.7 percent. It swept the 2009 MBC Drama Awards; actress Go Hyun-jung's performance and subsequent grand prize win received near-universal acclaim. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yo-won Princess Deokman Nam Ji-hyeon young Princess Deokman Kim Nam-gil Bidam Ko Hyun-jung Lady Mishil Uhm Tae-woong Kim Yushin Full Cast & Crew Last Season Season 1 2009 | 62 Episodes Season 1 of The Great Queen Seondeok premiered on May 25, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  13 Posters  3 Recommendations   2010-03-22 Dong Yi 8.2    2003-09-15 Dae Jang Geum 9.4  Facts Original Name  선덕여왕 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/seonduk/ Genres Drama History Keywords empire kingdom queen history korea Content Score 93 Almost there... Top Contributors 28 digit t 20 tmdb38202327 M 18 Maria180493 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}