{"link": "https://www.themoviedb.org/tv/20695?language=en", "title": "Yu-Gi-Oh! 5D's", "resume": "Yu-Gi-Oh! 5DS is an anime series and the third installment in the franchise of Yu-Gi-Oh! anime series. It aired in Japan between April 2, 2008 and March 30, 2011, following the conclusion of the previous series, Yu-Gi-Oh! GX. In America, most episodes of Yu-Gi-Oh! 5D's were dubbed by 4Kids Entertainment. Yu-Gi-Oh! 5D's was succeeded by Yu-Gi-Oh! Zexal.\nMuch like the previous series, it focuses around characters playing a card game Duel Monsters, despite the fact the 'Duel Monsters' tagline has been dropped from the Japanese title. This series introduces new types of cards such as Synchro Monsters, that are reflected in the Official Trading Card Game. During the series, in addition to regular duels using Duel Disks, a new type of Duel Disk, motorcycle-like vehicles, called \"D-Wheels\" are used, and the duelists engage in games called \"Riding Duels\". The show is set in the distant future, where the upper class population live in New Domino City and the lower class in a remote island where Domino's sewage is transported, Satellite. Yusei Fudo, the 18 year-old main protagonist, lives in Satellite and makes it his objective to reach his rival Jack Atlas, who lives in Domino. The series focuses on the five Signers, people embodied with a mark of one of the legendary Five Dragons, of which Yusei and Jack are two, and their conflict with the main antagonists Dark Signers and the Three Emperors of Yilaster.", "rate": 95, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Ai Horanai", "Ayumi Kinoshita", "Takanori Hoshino", "Yuka Terasaki", "Yuya Miyashita"], "character": ["Lua", "Aki Izayoi", "Jack Atlas", "Luca", "Yusei Fudo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20695   Expand Yu-Gi-Oh! 5D's   (2008) User Score Overview Yu-Gi-Oh! 5DS is an anime series and the third installment in the franchise of Yu-Gi-Oh! anime series. It aired in Japan between April 2, 2008 and March 30, 2011, following the conclusion of the previous series, Yu-Gi-Oh! GX. In America, most episodes of Yu-Gi-Oh! 5D's were dubbed by 4Kids Entertainment. Yu-Gi-Oh! 5D's was succeeded by Yu-Gi-Oh! Zexal. Much like the previous series, it focuses around characters playing a card game Duel Monsters, despite the fact the 'Duel Monsters' tagline has been dropped from the Japanese title. This series introduces new types of cards such as Synchro Monsters, that are reflected in the Official Trading Card Game. During the series, in addition to regular duels using Duel Disks, a new type of Duel Disk, motorcycle-like vehicles, called \"D-Wheels\" are used, and the duelists engage in games called \"Riding Duels\". The show is set in the distant future, where the upper class population live in New Domino City and the lower class in a remote island where Domino's sewage is transported, Satellite. Yusei Fudo, the 18 year-old main protagonist, lives in Satellite and makes it his objective to reach his rival Jack Atlas, who lives in Domino. The series focuses on the five Signers, people embodied with a mark of one of the legendary Five Dragons, of which Yusei and Jack are two, and their conflict with the main antagonists Dark Signers and the Three Emperors of Yilaster. Featured Crew Kazuki Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ai Horanai Lua Ayumi Kinoshita Aki Izayoi Takanori Hoshino Jack Atlas Yuka Terasaki Luca Yuya Miyashita Yusei Fudo Full Cast & Crew Last Season Season 4 2010 | 62 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Yu-Gi-Oh! 5D's. You can help by rating TV shows you've seen. Facts Original Name  遊☆戯☆王5D's Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 10 Indi c 8 coffinbearer g 5 gibsonjd 4 Ly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}