{"link": "https://www.themoviedb.org/tv/4569?language=en", "title": "Jake 2.0", "resume": "Jake 2.0 is an American science fiction television series originally broadcast on UPN in 2003. The series was canceled on January 14, 2004 due to low ratings, leaving four episodes unaired in the United States. In the United Kingdom, all the episodes aired on Sky1. The series later aired in syndication on HDNet and the Sci Fi Channel.\nThe series revolves around a computer expert, Jake Foley, who works for the U.S. government's National Security Agency and was accidentally infected by nanobots which give him superhuman powers. He is able to control technology with his brain, making him \"the ultimate human upgrade\" according to the show's introduction.", "rate": 65, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama"], "cast": ["Keegan Connor Tracy", "Christopher Gorham", "Philip Anthony-Rodriguez", "Judith Scott", "Marina Black"], "character": ["Jake Foley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4569   Expand Jake 2.0   (2003) User Score Overview Jake 2.0 is an American science fiction television series originally broadcast on UPN in 2003. The series was canceled on January 14, 2004 due to low ratings, leaving four episodes unaired in the United States. In the United Kingdom, all the episodes aired on Sky1. The series later aired in syndication on HDNet and the Sci Fi Channel. The series revolves around a computer expert, Jake Foley, who works for the U.S. government's National Security Agency and was accidentally infected by nanobots which give him superhuman powers. He is able to control technology with his brain, making him \"the ultimate human upgrade\" according to the show's introduction. Featured Crew Silvio Horta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keegan Connor Tracy Christopher Gorham Jake Foley Philip Anthony-Rodriguez Judith Scott Marina Black Full Cast & Crew Last Season Season 1 2003 | 16 Episodes Season 1 of Jake 2.0 premiered on September 10, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2007-05-10 Traveler 6.9    2005-12-10 Painkiller Jane 6.0    1998-09-09 First Wave 6.6    2007-08-10 Flash Gordon 3.9    2011-06-14 The Nine Lives of Chloe King 6.5    2011-01-20 Fairly Legal 5.8    2005-09-19 Invasion 6.9    2002-03-03 Jeremiah 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Drama Keywords superhuman national security government agent computer in brain Content Score 93 Almost there... Top Contributors 6 Banana 3 niqo19 R 3 Rebecca 3 shadowfurious  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}