{"link": "https://www.themoviedb.org/tv/982?language=en", "title": "Transformers: Armada", "resume": "Transformers: Armada, known in Japan as Chō Robot Seimeitai Transformers: Micron Densetsu, is a Transformers animated series, comic series and toy line which ran from 2002–2003. It was originally scheduled for 2001, however was delayed until early-2002. As the first series co-produced between the American toy company, Hasbro, and their Japanese counterpart, Takara, Armada begins a new continuity/universe for Transformers, with no ties to any of the previous series, including the immediately prior Transformers: Robots in Disguise in 2001. It would go on to birth a sequel in the form of Transformers: Energon.", "rate": 63, "genre": ["Animation"], "cast": ["Brian Dobson", "Michael Dobson", "Tabitha St. Germain", "Garry Chalk", "Dale Wilson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 982   Expand Transformers: Armada   (2002) User Score Overview Transformers: Armada, known in Japan as Chō Robot Seimeitai Transformers: Micron Densetsu, is a Transformers animated series, comic series and toy line which ran from 2002–2003. It was originally scheduled for 2001, however was delayed until early-2002. As the first series co-produced between the American toy company, Hasbro, and their Japanese counterpart, Takara, Armada begins a new continuity/universe for Transformers, with no ties to any of the previous series, including the immediately prior Transformers: Robots in Disguise in 2001. It would go on to birth a sequel in the form of Transformers: Energon. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Dobson Michael Dobson Tabitha St. Germain Garry Chalk Dale Wilson Full Cast & Crew Last Season Transformers armada season 2 2004 | 40 Episodes Season 2 of Transformers: Armada premiered on January 31, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  10 Recommendations   2008-04-18 Ben 10: Alien Force 6.1  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 23 ajaconis83 f 3 fdaniel i 3 iegolas D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}