{"link": "https://www.themoviedb.org/tv/62202?language=en", "title": "Spotless", "resume": "Set in London, SPOTLESS is the story of a troubled crime scene cleaner, Jean, whose tidy life is turned upside down when his outlaw brother Martin crash lands into his world, entangling them in the deadly dynamics of organized crime.", "rate": 74, "genre": ["Drama", "Crime"], "cast": ["Denis Ménochet", "Marc-André Grondin", "Miranda Raison", "Brendan Coyle"], "character": ["Martin Bastière", "Jean Bastière", "Julie Greer-Bastière", "Nelson Clay"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62202   Expand Spotless   (2015) User Score Overview Set in London, SPOTLESS is the story of a troubled crime scene cleaner, Jean, whose tidy life is turned upside down when his outlaw brother Martin crash lands into his world, entangling them in the deadly dynamics of organized crime. Featured Crew Corinne Marrinan Creator Ed McCardie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denis Ménochet Martin Bastière Marc-André Grondin Jean Bastière Miranda Raison Julie Greer-Bastière Brendan Coyle Nelson Clay Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Spotless premiered on March 16, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply SB SPOILERS - started well but..... Open 0 by Strange Bedfellows\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2016-08-02 Borderline 7.1    2016-06-02 Hibana: Spark 7.8    2014-10-06 Strange Empire 6.2    2016-01-07 Deep 7.0    2015-09-02 Atelier 7.2    2013-05-03 Maron 6.9    2015-03-17 Ordinary Lies 7.0    2017-01-10 The Frozen Dead 6.6  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://canalplus.fr/spotless/ Genres Drama Crime Keywords london england sibling relationship crime scene cleaner Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings 12 Banana t 5 theotheshark 5 NEOhidra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}