{"link": "https://www.themoviedb.org/tv/60563?language=en", "title": "Mammon", "resume": "Peter Verås is an uncompromising journalist in the most respected newspaper in Norway. He makes his life’s biggest mistake when he gets hold of evidence of a financial fraud from an anonymous source. It turns out the evidence points to his own brother. As he still pursues and the story breaks, the brother commits suicide. Peter tries to track down the anonymous source, only to discover that the source was the brother himself. A search for the truth has commenced that involves media, high – ranked politicians as well as the financial elite. The closer he gets to the truth, the more dangerous it becomes for him and his brother’s family.", "rate": 74, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Jon Øigarden", "Laura Christensen", "Nils Ole Oftebro", "Trond Espen Seim", "Ingar Helge Gimle"], "character": ["Peter Verås", "Ellen Claussen", "Frank Mathiesen", "Statsminister Michael Woll", "Finansminister Erik Ulrichsen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60563   Expand Mammon   (2014) User Score  Play Trailer Overview Peter Verås is an uncompromising journalist in the most respected newspaper in Norway. He makes his life’s biggest mistake when he gets hold of evidence of a financial fraud from an anonymous source. It turns out the evidence points to his own brother. As he still pursues and the story breaks, the brother commits suicide. Peter tries to track down the anonymous source, only to discover that the source was the brother himself. A search for the truth has commenced that involves media, high – ranked politicians as well as the financial elite. The closer he gets to the truth, the more dangerous it becomes for him and his brother’s family. Featured Crew Vegard Stenberg Eriksen Creator Gjermund Stenberg Eriksen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Øigarden Peter Verås Laura Christensen Ellen Claussen Nils Ole Oftebro Frank Mathiesen Trond Espen Seim Statsminister Michael Woll Ingar Helge Gimle Finansminister Erik Ulrichsen Full Cast & Crew Last Season Season 2 2016 | 8 Episodes Season 2 of Mammon premiered on January  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  1 Recommendations   2014-11-30 Blue Eyes 7.0    2015-09-23 Modus 7.0    2015-12-27 Trapped 7.6    2015-01-29 Fortitude 6.9    2011-09-21 The Bridge 8.0    2010-05-04 Luther 7.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  60m Homepage  - Genres Crime Drama Mystery Keywords journalist norway conspiracy nordic noir Content Score 100 Yes! Looking good! Top Contributors 39 Bendik 31 martinmyrvold p 15 perern 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}