{"link": "https://www.themoviedb.org/tv/44150?language=en", "title": "The Hire", "resume": "BMW film presents \"The Hire\", a series of eight short films produced for the Internet in 2001 and 2002. A form of branded content, all eight films feature popular filmmakers from across the globe, star Clive Owen as the \"The Driver\" and highlight the performance aspects of various BMW automobiles. The series made a comeback in 2016, fifteen years after its original run ended.", "rate": 87, "genre": ["Action", "Adventure", "Crime"], "cast": ["Clive Owen"], "character": ["The Driver"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44150   Expand The Hire   (2001) User Score Overview BMW film presents \"The Hire\", a series of eight short films produced for the Internet in 2001 and 2002. A form of branded content, all eight films feature popular filmmakers from across the globe, star Clive Owen as the \"The Driver\" and highlight the performance aspects of various BMW automobiles. The series made a comeback in 2016, fifteen years after its original run ended. Featured Crew David Fincher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clive Owen The Driver Full Cast & Crew Last Season Season 3 2016 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Hire. You can help by rating TV shows you've seen. Facts Status  Returning Series Network BMW Films Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://bmwfilms.com/ Genres Action & Adventure Crime Keywords drive car chase driver driving skills bmw Content Score 64 We're so close, yet so far. Top Contributors 37 Uli666 TB 2 TMDb Bot w 1 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}