{"link": "https://www.themoviedb.org/tv/43?language=en", "title": "31 Minutos", "resume": "31 minutos is a Chilean television show which takes the form of a mock news broadcast, and is fronted by puppets who present various items. The program was devised by Álvaro Díaz and Pedro Peirano and is produced by their own company, APLAPLAC. It was first aired in March 2003 on the TVN channel in Chile.\n31 minutos has achieved considerable success in Chilean television, captivating adult viewers as well as children. The sarcastic and carefree humor along with the producers' reputation in Chile of being the essential part of the extinct cult show Plan Z earned the series immediate acceptance among the public and helped boost its popularity, being considered a spiritual successor of sorts of that earlier show. When the first season had its debut, it occupied the morning time slot on Saturdays. But its orientation toward children was somewhat questioned because of the enthusiastic response from adult audiences; therefore the second season was moved to the time slot after the night time news at 10:00 pm on Fridays. Its almost explosive commercial success is reflected in the range and quantity of products spawned by the show, including an audio CD with the songs from its first season. In 2004, Nickelodeon started airing the first season across Latin America, being particularly popular in Brazil and Argentina, and a second CD was released with music from the second season. In 2005, a third album was released, with the third season's music and some extras.", "rate": 93, "genre": ["Comedy"], "cast": ["Rodrigo Salinas", "Alejandra Dueñas", "Pedro Peirano", "Álvaro Díaz"], "character": ["Juanín Juan Harry / Mario Hugo (voice)", "Patana Tufillo (voice)", "Tulio Triviño (voice)", "Juan Carlos Bodoque (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43   Expand 31 Minutos   (2003) User Score Overview 31 minutos is a Chilean television show which takes the form of a mock news broadcast, and is fronted by puppets who present various items. The program was devised by Álvaro Díaz and Pedro Peirano and is produced by their own company, APLAPLAC. It was first aired in March 2003 on the TVN channel in Chile. 31 minutos has achieved considerable success in Chilean television, captivating adult viewers as well as children. The sarcastic and carefree humor along with the producers' reputation in Chile of being the essential part of the extinct cult show Plan Z earned the series immediate acceptance among the public and helped boost its popularity, being considered a spiritual successor of sorts of that earlier show. When the first season had its debut, it occupied the morning time slot on Saturdays. But its orientation toward children was somewhat questioned because of the enthusiastic response from adult audiences; therefore the second season was moved to the time slot after the night time news at 10:00 pm on Fridays. Its almost explosive commercial success is reflected in the range and quantity of products spawned by the show, including an audio CD with the songs from its first season. In 2004, Nickelodeon started airing the first season across Latin America, being particularly popular in Brazil and Argentina, and a second CD was released with music from the second season. In 2005, a third album was released, with the third season's music and some extras. Featured Crew Álvaro Díaz Creator Pedro Peirano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rodrigo Salinas Juanín Juan Harry / Mario Hugo (voice) Alejandra Dueñas Patana Tufillo (voice) Pedro Peirano Tulio Triviño (voice) Álvaro Díaz Juan Carlos Bodoque (voice) Full Cast & Crew Last Season Season 4 2014 | 12 Episodes Season 4 of 31 Minutos premiered on October  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on 31 Minutos. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage   http://www.31minutos.cl/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 29 Mikedeth5 N 12 NoemiTalavera z 4 zurman1 1 Xenus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}