{"link": "https://www.themoviedb.org/tv/75365?language=en", "title": "Boru", "resume": "Turkey in the spring of 2014. A time when the enemies are growing on the border, the circle of danger inside is becoming narrower. The Republic of Turkey faces the greatest threats of recent history. BÖRÜ tells the story of heroic heroes who are touched by love. They are the last castle.", "rate": 100, "genre": ["Action", "Adventure", "War", "Politics", "Reality", "War", "Politics"], "cast": ["Ahu Türkpençe", "Özge Gürel", "Serkan Çayoglu", "Mesut Akusta", "Murat Arkın"], "character": ["Asena Tümer", "Gökçe Demir", "Kaya Ülgen", "İrfan Aladağ", "Kemal Boratav"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75365   Expand Boru   (2018) User Score Overview Turkey in the spring of 2014. A time when the enemies are growing on the border, the circle of danger inside is becoming narrower. The Republic of Turkey faces the greatest threats of recent history. BÖRÜ tells the story of heroic heroes who are touched by love. They are the last castle. Featured Crew Alper Çağlar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ahu Türkpençe Asena Tümer Özge Gürel Gökçe Demir Serkan Çayoglu Kaya Ülgen Mesut Akusta İrfan Aladağ Murat Arkın Kemal Boratav Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Boru premiered on February 28, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply 5. Bölüm Sorgu Sahnesi Open 0 by İlkiny\n      \n     Beğendik mi? Open 0 by İlkiny\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Boru. You can help by rating TV shows you've seen. Facts Original Name  Börü Status  Ended Network Certification  - Type  Miniseries Original Language  Turkish Runtime  80m Homepage   https://www.startv.com.tr/dizi/boru/ Genres Action & Adventure War & Politics Reality War & Politics Keywords police military Content Score 100 Yes! Looking good! Top Contributors 119 İlkiny 17 lineker 11 sinefil TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}