{"link": "https://www.themoviedb.org/tv/37264?language=en", "title": "Birdy the Mighty", "resume": "Birdy the Mighty is a Japanese manga series written and illustrated by Masami Yuki. His initial work on the series was quickly abandoned, but it was made into an anime, which was produced and, on the last episode, scripted by Yoshiaki Kawajiri, who is known for anime titles such as Vampire Hunter D, and Ninja Scroll. The character designer and animation director for the series was Kumiko Takahashi. In 2003, Yuki began serializing a second, more ambitious Birdy the Mighty manga in Weekly Young Sunday.\nA TV anime adaptation, titled Birdy the Mighty: Decode, was animated by A-1 Pictures and produced by Aniplex, premiered in Japan on TV Saitama and other broadcast networks on July 4, 2008. The series is directed by Kazuki Akane, written by Hiroshi Ōnogi, with its character designer and overseeing animation director being Ryo Timo. It also aired on the satellite network Animax from July 14, 2008. The second season titled Birdy the Mighty Decode 02 aired Jan 9, 2009 to Mar 27, 2009. The TV series featured a different voice acting cast from the original OVA series. At Anime USA 2009, Funimation Entertainment announced that it had acquired the show. As of June 30, 2010, Funimation released all episodes of Season 1 and Season 2 English Subbed, and released them English Dubbed in October 2010.", "rate": 65, "genre": ["Animation"], "cast": ["Keiji Fujiwara", "Kaori Nazuka", "Kenichi Suzumura", "Saeko Chiba", "Miyu Irino"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37264   Expand Birdy the Mighty   (2008) User Score Overview Birdy the Mighty is a Japanese manga series written and illustrated by Masami Yuki. His initial work on the series was quickly abandoned, but it was made into an anime, which was produced and, on the last episode, scripted by Yoshiaki Kawajiri, who is known for anime titles such as Vampire Hunter D, and Ninja Scroll. The character designer and animation director for the series was Kumiko Takahashi. In 2003, Yuki began serializing a second, more ambitious Birdy the Mighty manga in Weekly Young Sunday. A TV anime adaptation, titled Birdy the Mighty: Decode, was animated by A-1 Pictures and produced by Aniplex, premiered in Japan on TV Saitama and other broadcast networks on July 4, 2008. The series is directed by Kazuki Akane, written by Hiroshi Ōnogi, with its character designer and overseeing animation director being Ryo Timo. It also aired on the satellite network Animax from July 14, 2008. The second season titled Birdy the Mighty Decode 02 aired Jan 9, 2009 to Mar 27, 2009. The TV series featured a different voice acting cast from the original OVA series. At Anime USA 2009, Funimation Entertainment announced that it had acquired the show. As of June 30, 2010, Funimation released all episodes of Season 1 and Season 2 English Subbed, and released them English Dubbed in October 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keiji Fujiwara Kaori Nazuka Kenichi Suzumura Saeko Chiba Miyu Irino Full Cast & Crew Last Season decode season 2 2009 | 12 Episodes Season 2 of Birdy the Mighty premiered on January  9, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Birdy the Mighty. You can help by rating TV shows you've seen. Facts Original Name  鉄腕バーディー Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.birdy-tv.com/ Genres Animation Keywords anime Content Score 86 Almost there... Top Contributors J 9 JeremyRogers M 6 Migi m 3 magoozin 2 WillofOwn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}