{"link": "https://www.themoviedb.org/tv/35942?language=en", "title": "Cadfael", "resume": "Cadfael is the name given to the TV series of The Cadfael Chronicles adaptations produced by British television company ITV Central between 1994 and 1998. The series was broadcast on the ITV network in the UK, and starred Sir Derek Jacobi as the medieval detective.", "rate": 68, "genre": ["Drama"], "cast": ["Derek Jacobi", "Michael Culver", "Terrence Hardiman", "Julian Firth", "Mark Charnock"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35942   Expand Cadfael   (1994) User Score Overview Cadfael is the name given to the TV series of The Cadfael Chronicles adaptations produced by British television company ITV Central between 1994 and 1998. The series was broadcast on the ITV network in the UK, and starred Sir Derek Jacobi as the medieval detective. Featured Crew Edith Pargeter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Jacobi Michael Culver Terrence Hardiman Julian Firth Mark Charnock Full Cast & Crew Last Season Season 4 1998 | 3 Episodes Season 4 of Cadfael premiered on June 23, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1975-12-17 Rumpole of the Bailey 7.9    2003-03-27 New Tricks 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 75m Homepage  - Genres Drama Keywords england monk detective mystery period drama medieval 12th century Content Score 93 Almost there... Top Contributors O 5 Ozbourne w 3 webmaster 3 Steve TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}