{"link": "https://www.themoviedb.org/tv/61162?language=en", "title": "The Great British Bake Off: An Extra Slice", "resume": "The Great British Bake Off: An Extra Slice, sometimes shortened to An Extra Slice is a British television show made by the BBC and filmed at The London Studios as a spin-off from the reality TV hit series The Great British Bake Off which airs on BBC One.\nEach week, host Jo Brand is joined by three different celebrity Bake Off fans. Jo shines a spotlight on the good, the bad and the soggy bottomed from the week's episode with chat, unseen footage from the BBC One show and an interview with the week's eliminated baker.\nThe studio audience are challenged to bring a bake in from home from the week's baking theme, be that bread, pastry, or cakes, and viewers are invited to share photos of their efforts too.", "rate": 0, "genre": ["Documentary", "Reality"], "cast": ["Jo Brand"], "character": ["Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61162   Expand The Great British Bake Off: An Extra Slice   (2014) User Score Overview The Great British Bake Off: An Extra Slice, sometimes shortened to An Extra Slice is a British television show made by the BBC and filmed at The London Studios as a spin-off from the reality TV hit series The Great British Bake Off which airs on BBC One. Each week, host Jo Brand is joined by three different celebrity Bake Off fans. Jo shines a spotlight on the good, the bad and the soggy bottomed from the week's episode with chat, unseen footage from the BBC One show and an interview with the week's eliminated baker. The studio audience are challenged to bring a bake in from home from the week's baking theme, be that bread, pastry, or cakes, and viewers are invited to share photos of their efforts too. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Brand Herself - Host Full Cast & Crew Last Season Series 8 2017 | 10 Episodes Season 8 of The Great British Bake Off: An Extra Slice premiered on August 30, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Great British Bake Off: An Extra Slice. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Great British Bake Off: An Extra Slice. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b04dclt3 Genres Documentary Reality Keywords cooking food baking cooking competition Content Score 56 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings k 18 kevn57 s 11 slobjoe 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}