{"link": "https://www.themoviedb.org/tv/4898?language=en", "title": "Bizarre Foods with Andrew Zimmern", "resume": "Bizarre Foods with Andrew Zimmern is a travel and cuisine television show hosted by Andrew Zimmern on the Travel Channel. The first season debuted on Monday, February 26, 2007 at 9pm ET/PT.\nBizarre Foods focuses on regional cuisine from around the world which is typically perceived by Americans as being disgusting, exotic, or bizarre. In each episode, Zimmern focuses on the cuisine of a particular country or region. He typically shows how the food is procured, where it is served, and, usually without hesitation, eats it.\nOriginally a one-hour documentary titled Bizarre Foods of Asia, repeated showings on the Travel Channel drew consistent, considerable audiences. In late 2006, it was decided to turn the documentary into a weekly, one-hour show with the same premise and with Andrew Zimmern as the host. In 2009, Zimmern took a break from Bizarre Foods to work on one season of the spin-off Bizarre World.", "rate": 78, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4898   Expand Bizarre Foods with Andrew Zimmern   (2006) User Score  Play Trailer Overview Bizarre Foods with Andrew Zimmern is a travel and cuisine television show hosted by Andrew Zimmern on the Travel Channel. The first season debuted on Monday, February 26, 2007 at 9pm ET/PT. Bizarre Foods focuses on regional cuisine from around the world which is typically perceived by Americans as being disgusting, exotic, or bizarre. In each episode, Zimmern focuses on the cuisine of a particular country or region. He typically shows how the food is procured, where it is served, and, usually without hesitation, eats it. Originally a one-hour documentary titled Bizarre Foods of Asia, repeated showings on the Travel Channel drew consistent, considerable audiences. In late 2006, it was decided to turn the documentary into a weekly, one-hour show with the same premise and with Andrew Zimmern as the host. In 2009, Zimmern took a break from Bizarre Foods to work on one season of the spin-off Bizarre World. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 11 2017 | 13 Episodes Season 11 of Bizarre Foods with Andrew Zimmern premiered on January 17, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply One of the most entertaining travel food shows! Open 0 by lmao7\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2011-11-21 The Layover 7.8    2005-07-25 Anthony Bourdain: No Reservations 7.9    2008-12-03 Man v. Food 6.7    2013-04-14 Anthony Bourdain: Parts Unknown 6.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.travelchannel.com/TV_Shows/Bizarre_Foods Genres Documentary Keywords travel food Content Score 64 We're so close, yet so far. Top Contributors 11 Elizabeth Jennings TB 10 TMDb Bot 5 szab 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}