{"link": "https://www.themoviedb.org/tv/61580?language=en", "title": "Tomorrow's Cantabile", "resume": "Musical prodigy Cha Yoo Jin dreams of conducting orchestras, but despite his ambitions and international upbringing, he's begrudgingly stuck in South Korea because of a traumatic childhood accident. Cue Seol Nae Il, a nutty classmate who eschews the rules and plays everything by ear, from music to life. Though initially repelled by her unrefined ways, Yoo Jin slowly discovers Nae Il is the unique melody to his harmony: combined, the two create a song that makes their hearts soar.", "rate": 73, "genre": ["Comedy"], "cast": ["Joo Won", "Shim Eun-kyung", "Park Bo-gum", "Min Do-hee", "Ko Kyoung-pyo"], "character": ["Cha Yoo-jin", "Seol Nae-il", "Lee Yoon-hoo", "Choi Min-hee", "Yoo Il-rak"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61580   Expand Tomorrow's Cantabile   (2014) User Score  Play Trailer Overview Musical prodigy Cha Yoo Jin dreams of conducting orchestras, but despite his ambitions and international upbringing, he's begrudgingly stuck in South Korea because of a traumatic childhood accident. Cue Seol Nae Il, a nutty classmate who eschews the rules and plays everything by ear, from music to life. Though initially repelled by her unrefined ways, Yoo Jin slowly discovers Nae Il is the unique melody to his harmony: combined, the two create a song that makes their hearts soar. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joo Won Cha Yoo-jin Shim Eun-kyung Seol Nae-il Park Bo-gum Lee Yoon-hoo Min Do-hee Choi Min-hee Ko Kyoung-pyo Yoo Il-rak Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Tomorrow's Cantabile premiered on October 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Tomorrow's Cantabile. You can help by rating TV shows you've seen. Facts Original Name  내일도 칸타빌레 Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.kbs.co.kr/drama/cantabile/ Genres Comedy Keywords remake korea based on manga Content Score 93 Almost there... Top Contributors M 53 Maria180493 16 Elizabeth Jennings CM 7 Cherche Moi c 3 creativo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}