{"link": "https://www.themoviedb.org/tv/69190?language=en", "title": "Beau Séjour", "resume": "Hotel Beau Séjour. Kato, covered in blood, wakes up without any recollection of what happened the night before. Moreover, nobody seems to see or hear her. Slowly it sinks in: she's dead. Who did this to her? And how come a handful of people can still see her, as if she's among the living? Why them specifically? In her search to uncover the truth Kato will discover that a lot of secrets lie dormant under the surface of her supposedly peaceful village community.", "rate": 79, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Lynn Van Royen", "Johan van Assche", "Inge Paulussen", "Kris Cuppens", "Jan Hammenecker"], "character": ["Kato Hoeven", "Alexander Vinken", "Kristel Brouwers", "Luc Hoeven", "Marcus Otten"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69190   Expand Beau Séjour   (2017) User Score  Play Trailer Overview Hotel Beau Séjour. Kato, covered in blood, wakes up without any recollection of what happened the night before. Moreover, nobody seems to see or hear her. Slowly it sinks in: she's dead. Who did this to her? And how come a handful of people can still see her, as if she's among the living? Why them specifically? In her search to uncover the truth Kato will discover that a lot of secrets lie dormant under the surface of her supposedly peaceful village community. Featured Crew Benjamin Sprengers Creator Sanne Nuyens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lynn Van Royen Kato Hoeven Johan van Assche Alexander Vinken Inge Paulussen Kristel Brouwers Kris Cuppens Luc Hoeven Jan Hammenecker Marcus Otten Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Beau Séjour premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  4 Recommendations   2011-02-08 Traffic Light 7.2    2015-06-18 Hoff the Record 6.0    2015-12-01 Real Rob 5.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  50m Homepage   http://www.demensen.be/nl/producties/beau-s%C3%A9jour Genres Crime Drama Mystery Keywords dutch belgium noir european Content Score 100 Yes! Looking good! Top Contributors 27 warregubbi 23 Razorback121 22 Maretoh 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}