{"link": "https://www.themoviedb.org/tv/4246?language=en", "title": "Evil Con Carne", "resume": "Evil Con Carne is an American animated series/spin-off of Grim & Evil and sister show of The Grim Adventures of Billy & Mandy, created by Maxwell Atoms. The series first appeared on Cartoon Network during the show Grim & Evil, along with The Grim Adventures of Billy and Mandy. The two series later became separate programs in 2003. While The Grim Adventures of Billy and Mandy ran for six seasons, Evil Con Carne only ran fourteen episodes and ended on October 22, 2004. It was also part of Cartoon Network's series, Cartoon Cartoons, and is the 15th and final cartoon of the series. Season 2 was released unannounced in 2004.\nOn April 13, 2012, the series returned to Cartoon Network in reruns on the revived block, Cartoon Planet.", "rate": 85, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Phil LaMarr", "Grey DeLisle", "Armin Shimerman", "Frank Welker", "Jesse Corti"], "character": ["Hector Con Carne (voice)", "Major Dr. Ghastly (voice)", "General Skarr/Stomach (voice)", "Boskov (voice)", "Boskov/Commando (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4246   Expand Evil Con Carne   (2003) User Score  Play Trailer Overview Evil Con Carne is an American animated series/spin-off of Grim & Evil and sister show of The Grim Adventures of Billy & Mandy, created by Maxwell Atoms. The series first appeared on Cartoon Network during the show Grim & Evil, along with The Grim Adventures of Billy and Mandy. The two series later became separate programs in 2003. While The Grim Adventures of Billy and Mandy ran for six seasons, Evil Con Carne only ran fourteen episodes and ended on October 22, 2004. It was also part of Cartoon Network's series, Cartoon Cartoons, and is the 15th and final cartoon of the series. Season 2 was released unannounced in 2004. On April 13, 2012, the series returned to Cartoon Network in reruns on the revived block, Cartoon Planet. Featured Crew Maxwell Atoms Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Phil LaMarr Hector Con Carne (voice) Grey DeLisle Major Dr. Ghastly (voice) Armin Shimerman General Skarr/Stomach (voice) Frank Welker Boskov (voice) Jesse Corti Boskov/Commando (voice) Full Cast & Crew Last Season Season 2 2004 | 9 Episodes Season 2 of Evil Con Carne premiered on January  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Evil Con Carne. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords general brain bear robot dog stomach jar Content Score 100 Yes! Looking good! Top Contributors 31 Cwf97 4 Banana TB 2 TMDb Bot R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}