{"link": "https://www.themoviedb.org/tv/2416?language=en", "title": "Count Duckula", "resume": "Count Duckula is a British children's drama, horror, comedy, animated television series created by British studio Cosgrove Hall and a spin-off from DangerMouse, a show in which the Count Duckula character was a recurring villain. The series aired on 6 September 1988 and was produced by Thames Television for three series and Central Television for the fourth and final series. In all, 65 episodes were made, each about 22 minutes long. All 65 episodes have been released to DVD in the UK, while only the first series has been released in North America. Both the series and its characters continue to have a large following on the internet.\nThe show is a loose parody of the story of Count Dracula. Set in Transylvania, Duckula lives in a spooky castle known as Castle Duckula alongside his butler Igor and his large nanny. Almost all of the characters in the show are anthropomorphised birds.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["David Jason", "Ruby Wax", "Jack May", "Brian Trueman", "Barry Clayton"], "character": ["Count Duckula"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2416   Expand Count Duckula   (1988) User Score Overview Count Duckula is a British children's drama, horror, comedy, animated television series created by British studio Cosgrove Hall and a spin-off from DangerMouse, a show in which the Count Duckula character was a recurring villain. The series aired on 6 September 1988 and was produced by Thames Television for three series and Central Television for the fourth and final series. In all, 65 episodes were made, each about 22 minutes long. All 65 episodes have been released to DVD in the UK, while only the first series has been released in North America. Both the series and its characters continue to have a large following on the internet. The show is a loose parody of the story of Count Dracula. Set in Transylvania, Duckula lives in a spooky castle known as Castle Duckula alongside his butler Igor and his large nanny. Almost all of the characters in the show are anthropomorphised birds. Featured Crew Cosgrove Hall Films Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Jason Count Duckula Ruby Wax Jack May Brian Trueman Barry Clayton Full Cast & Crew Last Season Season 4 1993 | 7 Episodes Season 4 of Count Duckula premiered on January  5, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1982-11-01 SuperTed 6.8    1991-01-03 The Brittas Empire 7.1    1980-12-08 Button Moon 6.8    1972-10-16 Rainbow 7.0    1986-09-01 Brush Strokes 7.8    1986-10-06 The Trap Door 7.3    1981-09-28 Danger Mouse 7.4    1981-12-24 The Kenny Everett Television Show 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Comedy Keywords transylvania vampire servant duck butler nanny castle vegetarian parody spin off british humour spooky Content Score 93 Almost there... Top Contributors O 16 Ozbourne JK 5 Jan Kofron z 5 zurman1 CN 5 Carmelo Nicolosi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}