{"link": "https://www.themoviedb.org/tv/2511?language=en", "title": "Family Fortunes", "resume": "Family Fortunes was a British game show, based on the American game show Family Feud. The programme ran on ITV from 6 January 1980 to 6 December 2002 before being revived by the same channel in 2006 under the title of All Star Family Fortunes. Revived episodes are currently being shown on ITV on Sunday evenings and have been presented by Vernon Kay since 2006.", "rate": 80, "genre": [], "cast": ["Bob Monkhouse", "Max Bygraves", "Les Dennis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2511   Expand Family Fortunes   (1980) User Score Overview Family Fortunes was a British game show, based on the American game show Family Feud. The programme ran on ITV from 6 January 1980 to 6 December 2002 before being revived by the same channel in 2006 under the title of All Star Family Fortunes. Revived episodes are currently being shown on ITV on Sunday evenings and have been presented by Vernon Kay since 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Monkhouse Max Bygraves Les Dennis Full Cast & Crew Last Season Season 22 — | 56 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Family Fortunes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  35m, 30m Homepage   http://www.itv.com/Games/Gameshows/FamilyFortunes/default.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}