{"link": "https://www.themoviedb.org/tv/51425?language=en", "title": "Betrayal", "resume": "Centers on Sara, a beautiful but unhappily married female photographer who begins a torrid affair with Jack, a lawyer for a powerful family.", "rate": 72, "genre": ["Drama"], "cast": ["Hannah Ware", "Henry Thomas", "Wendy Moniz", "Braeden Lemasters", "Elizabeth McLaughlin"], "character": ["Sara Hanley", "T.J. Karsten", "Elaine McAllister", "Victor McAllister", "Valerie McAllister"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51425   Expand Betrayal   (2013) User Score  Play Trailer Overview Centers on Sara, a beautiful but unhappily married female photographer who begins a torrid affair with Jack, a lawyer for a powerful family. Featured Crew David Zabel Creator Henry Thomas Creator Hannah Ware Creator Wendy Moniz Creator Braeden Lemasters Creator Stuart Townsend Creator James Cromwell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hannah Ware Sara Hanley Henry Thomas T.J. Karsten Wendy Moniz Elaine McAllister Braeden Lemasters Victor McAllister Elizabeth McLaughlin Valerie McAllister Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Betrayal premiered on September 29, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2016-06-06 Secret City 6.6    2014-07-20 The Lottery 4.9    1998-09-09 First Wave 6.6    2014-06-29 Reckless 5.5    1966-09-09 The Time Tunnel 7.0    1968-09-20 Hawaii Five-O 6.7    2010-07-13 Covert Affairs 6.4    2010-07-09 Haven 7.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords cheating murder trial Content Score 100 Yes! Looking good! Top Contributors 16 Elizabeth Jennings n 16 ninbo z 4 zurman1 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}