{"link": "https://www.themoviedb.org/tv/11978?language=en", "title": "The Name of the Game", "resume": "The Name of the Game is an American television series starring Tony Franciosa, Gene Barry, and Robert Stack that ran from 1968 to 1971 on NBC, totaling 76 episodes of 90 minutes. It was a pioneering wheel series, setting the stage for The Bold Ones and the NBC Mystery Movie in the 1970s. The show had an extremely large budget for a television series.", "rate": 83, "genre": ["Mystery"], "cast": ["Susan Saint James", "Anthony Franciosa", "Robert Stack", "Ben Murphy", "Mark Miller"], "character": ["Peggy Maxwell", "Jeff Dillon", "Dan Farrell", "Joe Sample", "Ross Craig"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11978   Expand The Name of the Game   (1968) User Score Overview The Name of the Game is an American television series starring Tony Franciosa, Gene Barry, and Robert Stack that ran from 1968 to 1971 on NBC, totaling 76 episodes of 90 minutes. It was a pioneering wheel series, setting the stage for The Bold Ones and the NBC Mystery Movie in the 1970s. The show had an extremely large budget for a television series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susan Saint James Peggy Maxwell Anthony Franciosa Jeff Dillon Robert Stack Dan Farrell Ben Murphy Joe Sample Mark Miller Ross Craig Full Cast & Crew Last Season Season 3 1970 | 24 Episodes Season 3 of The Name of the Game premiered on September 18, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Name of the Game. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Mystery Keywords journalist magazine Content Score 71 Just a little bit more... Top Contributors 12 Banana 2 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}