{"link": "https://www.themoviedb.org/tv/66247?language=en", "title": "American Grit", "resume": "American Grit contestants will be mentored by \"The Cadre,\" made up of military members who, along with Cena, will push their civilian charges throughout the competition. The Cadre consists of: Navy Seal trainer, Rorke Denver; Purple Heart recipient, U.S. Army veteran Noah Galloway; Veteran U.S. Marine Gunnery Sergeant, Tawanda “Tee” Hanible; and U.S. Army Ranger sniper, Nick “The Reaper” Irving.", "rate": 72, "genre": ["Reality"], "cast": ["John Cena"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66247   Expand American Grit   (2016) User Score  Play Trailer Overview American Grit contestants will be mentored by \"The Cadre,\" made up of military members who, along with Cena, will push their civilian charges throughout the competition. The Cadre consists of: Navy Seal trainer, Rorke Denver; Purple Heart recipient, U.S. Army veteran Noah Galloway; Veteran U.S. Marine Gunnery Sergeant, Tawanda “Tee” Hanible; and U.S. Army Ranger sniper, Nick “The Reaper” Irving. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Cena Host Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of American Grit premiered on June 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on American Grit. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  44m Homepage   http://www.fox.com/american-grit Genres Reality Keywords reality competition military training Content Score 64 We're so close, yet so far. Top Contributors 16 Banana 8 helmetcreator b 5 basher 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}