{"link": "https://www.themoviedb.org/tv/46157?language=en", "title": "The Carrie Diaries", "resume": "Before she was a fashion icon, before her column in the New York Star, before Mr. Big, Carrie Bradshaw was an innocent 16-year-old girl living in suburban Connecticut.", "rate": 54, "genre": ["Drama", "Comedy"], "cast": ["AnnaSophia Robb", "Austin Butler", "Ellen Wong", "Katie Findlay", "Stefania LaVie Owen"], "character": ["Carrie Bradshaw", "Sebastian Kydd", "Jill 'Mouse' Chen", "Maggie Landers", "Dorrit Bradshaw"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46157   Expand The Carrie Diaries   (2013) User Score Overview Before she was a fashion icon, before her column in the New York Star, before Mr. Big, Carrie Bradshaw was an innocent 16-year-old girl living in suburban Connecticut. Featured Crew Candace Bushnell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast AnnaSophia Robb Carrie Bradshaw Austin Butler Sebastian Kydd Ellen Wong Jill 'Mouse' Chen Katie Findlay Maggie Landers Stefania LaVie Owen Dorrit Bradshaw Full Cast & Crew Last Season Season 2 2013 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2011-02-08 Traffic Light 7.2    2015-06-12 Conspiracy 5.7    2016-01-11 Crashing 7.2    Decker 4.8    2010-08-02 Teresa 7.7    2011-08-05 Friends with Benefits 6.1    2017-01-01 Beau Séjour 7.9    2015-06-18 Hoff the Record 6.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://cwtv.com/shows/the-carrie-diaries/ Genres Drama Comedy Keywords high school new york retro teen drama 1980s Content Score 93 Almost there... Top Contributors 15 tldev 14 Banana 8 Maikkoum w 6 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}