{"link": "https://www.themoviedb.org/tv/1717?language=en", "title": "Pet Alien", "resume": "Pet Alien is a US computer-animated series produced by Mike Young Productions and Antefilms Productions in 2005. It was created by Jeff Muncy and the episodes are mainly written by Dan Danko and directed by Andrew Young. The series centres around the 15-year-old boy Tommy Cadle, whose lighthouse is invaded by five aliens. Crest Animation studios brought this story to life with their computer graphics expertise and this series was executed by a crew based in Mumbai, India.", "rate": 60, "genre": ["Comedy"], "cast": ["Candi Milo", "Charlie Adler", "Charlie Schlatter", "Jess Harnell", "Bill Fagerbakke"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1717   Expand Pet Alien   (2005) User Score Overview Pet Alien is a US computer-animated series produced by Mike Young Productions and Antefilms Productions in 2005. It was created by Jeff Muncy and the episodes are mainly written by Dan Danko and directed by Andrew Young. The series centres around the 15-year-old boy Tommy Cadle, whose lighthouse is invaded by five aliens. Crest Animation studios brought this story to life with their computer graphics expertise and this series was executed by a crew based in Mumbai, India. Featured Crew Andrew Young Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Candi Milo Charlie Adler Charlie Schlatter Jess Harnell Bill Fagerbakke Full Cast & Crew Last Season Season 1 2005 | 52 Episodes Season 1 of Pet Alien premiered on January 23, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pet Alien. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.petalien.com/ Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 7 Sergiojamon s 3 speedycars TB 2 TMDb Bot 2 Simon V.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}