{"link": "https://www.themoviedb.org/tv/12505?language=en", "title": "Wolf Lake", "resume": "Wolf Lake is an American television series that originally aired on CBS. Wolf Lake follows a pack of werewolves living in a Seattle suburb. The first 5 episodes aired on CBS, but due to low ratings CBS cancelled it. A total of nine aired episodes and a non-aired pilot were made before the show was cancelled. UPN acquired the rights and re-aired the entire show. ITV bought the rights to show the series in the United Kingdom and the SCI FI Channel bought the rights to show the series in the United States. Ran Galor's song \"Quiet the Night\" was the theme song. There was an unaired pilot to the series that would have taken the storyline in a very different direction.\nWolf Lake: The Complete Series is available on DVD.", "rate": 75, "genre": ["Action", "Adventure"], "cast": ["Lou Diamond Phillips", "Mia Kirshner", "Sharon Lawrence", "Tim Matheson", "Bruce McGill"], "character": ["Ruby Cates"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12505   Expand Wolf Lake   (2001) User Score Overview Wolf Lake is an American television series that originally aired on CBS. Wolf Lake follows a pack of werewolves living in a Seattle suburb. The first 5 episodes aired on CBS, but due to low ratings CBS cancelled it. A total of nine aired episodes and a non-aired pilot were made before the show was cancelled. UPN acquired the rights and re-aired the entire show. ITV bought the rights to show the series in the United Kingdom and the SCI FI Channel bought the rights to show the series in the United States. Ran Galor's song \"Quiet the Night\" was the theme song. There was an unaired pilot to the series that would have taken the storyline in a very different direction. Wolf Lake: The Complete Series is available on DVD. Featured Crew John Leekley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lou Diamond Phillips Mia Kirshner Ruby Cates Sharon Lawrence Tim Matheson Bruce McGill Full Cast & Crew Last Season Season 1 2001 | 9 Episodes Season 1 of Wolf Lake premiered on September 19, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wolf Lake. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Action & Adventure Keywords werewolf Content Score 93 Almost there... Top Contributors 8 Banana 3 Zlogorek M 1 Monstalova 1 arsyidahmadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}