{"link": "https://www.themoviedb.org/tv/3097?language=en", "title": "Iron Man", "resume": "Iron Man, also known as Iron Man: The Animated Series, is an American animated television series based on Marvel Comics' superhero Iron Man. The series aired from 1994 to 1996 in syndication as part of The Marvel Action Hour, which packaged Iron Man with another animated series based on Marvel properties, the Fantastic Four, with one half-hour episode from each series airing back-to-back. The show was backed by a toy line that featured many armor variants.\nThis series of Iron Man was among the few television series to be re-recorded in THX. This may have been usual at the time for a motion picture, but it is rare for a television series. Off the heels of the release of the live-action Iron Man film in 2008, reruns began airing on the Jetix block on Toon Disney. Additionally, all 26 episodes are currently available for streaming through LoveFilm.", "rate": 67, "genre": ["Animation", "Action", "Adventure"], "cast": ["Robert Ito", "James Warwick", "Jim Cummings", "Katherine Moffat", "Casey Defranco"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3097   Expand Iron Man   (1994) User Score Overview Iron Man, also known as Iron Man: The Animated Series, is an American animated television series based on Marvel Comics' superhero Iron Man. The series aired from 1994 to 1996 in syndication as part of The Marvel Action Hour, which packaged Iron Man with another animated series based on Marvel properties, the Fantastic Four, with one half-hour episode from each series airing back-to-back. The show was backed by a toy line that featured many armor variants. This series of Iron Man was among the few television series to be re-recorded in THX. This may have been usual at the time for a motion picture, but it is rare for a television series. Off the heels of the release of the live-action Iron Man film in 2008, reruns began airing on the Jetix block on Toon Disney. Additionally, all 26 episodes are currently available for streaming through LoveFilm. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Ito James Warwick Jim Cummings Katherine Moffat Casey Defranco Full Cast & Crew Last Season Season 2 1995 | 13 Episodes Season 2 of Iron Man premiered on September 23, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1999-10-30 The Avengers: United They Stand 6.0    Silver Surfer: The Animated Series 7.7    1996-09-08 The Incredible Hulk 6.3    1982-09-18 The Incredible Hulk 8.2    1997-04-03 Police Academy: The Series 5.6    1980-10-04 Heathcliff 5.0    1995-06-18 Life with Louie 5.9    2013-08-11 Marvel’s Hulk and the Agents of S.M.A.S.H 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  26m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors J 3 JohnyB0y D 3 Daniel 2 Marr 🇳🇱 s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}