{"link": "https://www.themoviedb.org/tv/39803?language=en", "title": "Moby Dick", "resume": "The sole survivor of a lost whaling ship relates the tale of his captain's self-destructive obsession to hunt the white whale, Moby Dick. This is a TV series starring William Hurt, Ethan Hawke, and Charlie Cox.", "rate": 52, "genre": ["Drama"], "cast": ["Gillian Anderson", "Ethan Hawke", "William Hurt", "Donald Sutherland", "Charlie Cox"], "character": ["Elizabeth", "Starbuck", "Captain Ahab", "acteur", "Ishmael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39803   Expand Moby Dick   (2011) User Score  Play Trailer Overview The sole survivor of a lost whaling ship relates the tale of his captain's self-destructive obsession to hunt the white whale, Moby Dick. This is a TV series starring William Hurt, Ethan Hawke, and Charlie Cox. Featured Crew Mike Barker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gillian Anderson Elizabeth Ethan Hawke Starbuck William Hurt Captain Ahab Donald Sutherland acteur Charlie Cox Ishmael Full Cast & Crew Last Season Season 1 2011 | 4 Episodes Season 1 of Moby Dick premiered on May  8, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Moby Dick. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  7 Recommendations   1995-05-14 The Langoliers 5.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  184m Homepage  - Genres Drama Keywords sea ship mutiny based on novel or book whale obsession tale miniseries pirate Content Score 100 Yes! Looking good! Top Contributors TB 27 TMDb Bot 11 Banana 3 rtentser w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}