{"link": "https://www.themoviedb.org/tv/3673?language=en", "title": "Crown Court", "resume": "Crown Court is an afternoon television courtroom drama produced by Granada Television for the ITV network that ran from 1972, when the Crown Court system replaced Assize courts and Quarter sessions in the legal system of England and Wales, to 1984.\nA court case in the crown court of the fictional town of Fulchester would typically be played out over three afternoons in half-hour episodes and the most frequent format was for the prosecution case to be presented in the first two episodes and the defence in the third, although there were some later, brief variations. Although those involved in the case were actors, the jury was made up of members of the general public from the immediate Granada Television franchise area taken from the electoral register and eligible for real jury service: it was this jury alone which decided the verdict. Indeed, production publicity of the time stated that, for many of the scripts, two endings were written and rehearsed to cope with the jury's independent decision which was delivered for the first time, as in a real court case, when the foreman was asked by the actor playing the judge, while the programme's recording progressed. However, the course of some cases would lead the jury being directed to return \"not guilty\" verdicts.", "rate": 0, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3673   Expand Crown Court   (1972) User Score Overview Crown Court is an afternoon television courtroom drama produced by Granada Television for the ITV network that ran from 1972, when the Crown Court system replaced Assize courts and Quarter sessions in the legal system of England and Wales, to 1984. A court case in the crown court of the fictional town of Fulchester would typically be played out over three afternoons in half-hour episodes and the most frequent format was for the prosecution case to be presented in the first two episodes and the defence in the third, although there were some later, brief variations. Although those involved in the case were actors, the jury was made up of members of the general public from the immediate Granada Television franchise area taken from the electoral register and eligible for real jury service: it was this jury alone which decided the verdict. Indeed, production publicity of the time stated that, for many of the scripts, two endings were written and rehearsed to cope with the jury's independent decision which was delivered for the first time, as in a real court case, when the foreman was asked by the actor playing the judge, while the programme's recording progressed. However, the course of some cases would lead the jury being directed to return \"not guilty\" verdicts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 1975 | 13 Episodes Season 4 of Crown Court premiered on January  2, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crown Court. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 60m, 30m Homepage  - Genres Drama Keywords courtroom drama Content Score 56 We're so close, yet so far. Top Contributors t 6 tmdb15589237 4 Banana PS 3 P. Snoopy z 2 zoroman20083636  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}