{"link": "https://www.themoviedb.org/tv/45997?language=en", "title": "The Devil Is a Part-Timer!", "resume": "Foiled by a hero when he’s inches away from conquering the world, the devil finds himself in modern-day Tokyo. With no real-world skills to speak of, the devil is forced to make ends meet flipping burgers at a fast food joint! To stall any further plans of world domination, the hero tracks the devil’s trail and takes on the lowly tasks of a telemarketer.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Youko Hikasa", "Yuki Ono", "Nao Touyama", "Ryota Ohsaka", "Anthony BOWLING"], "character": ["Emi Yusa", "Shirou Ashiya", "Chiho Sasaki", "Sadao Maou", "Shiro Ashiya (English Dub)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45997   Expand The Devil Is a Part-Timer!   (2013) User Score  Play Trailer Overview Foiled by a hero when he’s inches away from conquering the world, the devil finds himself in modern-day Tokyo. With no real-world skills to speak of, the devil is forced to make ends meet flipping burgers at a fast food joint! To stall any further plans of world domination, the hero tracks the devil’s trail and takes on the lowly tasks of a telemarketer. Featured Crew Masahiro Yokotani Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  4 Featurettes  0 Opening Credits  1 Top Billed Cast Youko Hikasa Emi Yusa Yuki Ono Shirou Ashiya Nao Touyama Chiho Sasaki Ryota Ohsaka Sadao Maou Anthony BOWLING Shiro Ashiya (English Dub) Full Cast & Crew Last Season Season 1 2013 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Devil Is a Part-Timer!. Login to be first! Go to Discussions Media Most Popular Videos  6 Backdrops  5 Posters  3 Recommendations   2008-04-07 Soul Eater 7.0    2007-04-13 Stigma of the Wind 8.1    2013-04-07 Gargantia on the Verdurous Planet 6.8    2013-12-24 Turbo FAST 4.7    2015-11-10 My Little Lover 6.3    2008-08-08 Detroit Metal City 7.8    2015-07-06 Snow White with the Red Hair 7.5    2015-09-02 Atelier 7.2  Facts Original Name  はたらく魔王さま！ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://maousama.jp/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords demon fast food based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 36 Elizabeth Jennings 29 sp1ti 29 WillofOwn CM 14 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}