{"link": "https://www.themoviedb.org/tv/33213?language=en", "title": "Shake It Up", "resume": "Shake It Up is an American sitcom airing on Disney Channel in the United States. The series premiered on November 7, 2010. Created by Chris Thompson and starring Bella Thorne and Zendaya, the show follows the adventures of CeCe Jones and Rocky Blue as they star as background dancers on a local show, Shake It Up Chicago. It also chronicles their misadventures on- and off-set, and their troubles and rising social status at school. Davis Cleveland, Roshon Fegan, Adam Irigoyen, Kenton Duty and Caroline Sunshine also are other main cast members in the series.\nThe show's original concept was for Disney to create a female buddy comedy, only with a dance aspect. Shake It Up is Disney's third original series, after The Famous Jett Jackson and Sonny with a Chance, to use a show-within-a-show format. The series is also the first Disney Channel Original Series since So Random! to have more than six primary contracted cast members at one time.\nOn September 29, 2011, Disney Channel announced it had increased Shake It Up's second season order to 26 episodes. A second soundtrack with songs from the series, Shake It Up: Live 2 Dance, was released on March 20, 2012. A 90-minute special episode Made In Japan aired August 17, 2012 as the season two finale. On June 4, 2012, Disney Channel announced that Shake It Up was renewed for a third season and announced that Kenton Duty will not be a regular cast member for season 3, but will make special guest appearances. The third soundtrack Shake It Up: I", "rate": 35, "genre": ["Family", "Kids", "Comedy"], "cast": ["Bella Thorne", "Zendaya", "Caroline Sunshine", "Adam Irigoyen", "Davis Cleveland"], "character": ["CeCe Jones", "Rocky Blue", "Tinka Hessenheffer", "Deuce Martinez", "Flynn Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33213   Expand Shake It Up   (2010) User Score Overview Shake It Up is an American sitcom airing on Disney Channel in the United States. The series premiered on November 7, 2010. Created by Chris Thompson and starring Bella Thorne and Zendaya, the show follows the adventures of CeCe Jones and Rocky Blue as they star as background dancers on a local show, Shake It Up Chicago. It also chronicles their misadventures on- and off-set, and their troubles and rising social status at school. Davis Cleveland, Roshon Fegan, Adam Irigoyen, Kenton Duty and Caroline Sunshine also are other main cast members in the series. The show's original concept was for Disney to create a female buddy comedy, only with a dance aspect. Shake It Up is Disney's third original series, after The Famous Jett Jackson and Sonny with a Chance, to use a show-within-a-show format. The series is also the first Disney Channel Original Series since So Random! to have more than six primary contracted cast members at one time. On September 29, 2011, Disney Channel announced it had increased Shake It Up's second season order to 26 episodes. A second soundtrack with songs from the series, Shake It Up: Live 2 Dance, was released on March 20, 2012. A 90-minute special episode Made In Japan aired August 17, 2012 as the season two finale. On June 4, 2012, Disney Channel announced that Shake It Up was renewed for a third season and announced that Kenton Duty will not be a regular cast member for season 3, but will make special guest appearances. The third soundtrack Shake It Up: I Featured Crew Chris Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bella Thorne CeCe Jones Zendaya Rocky Blue Caroline Sunshine Tinka Hessenheffer Adam Irigoyen Deuce Martinez Davis Cleveland Flynn Jones Full Cast & Crew Last Season Season 3 2012 | 26 Episodes Season 3 of Shake It Up premiered on October 14, 2012. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Tinka: Happy Birthday Kat Graham! Open 0 by wonder2wonder\n      \n     w Rocky Blue: Happy Birthday Zendaya! Open 0 by wonder2wonder\n      \n     w Deuce: Happy Birthday Adam Irigoyen! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2009-02-08 Sonny with a Chance 5.0    2009-06-15 Zeke and Luther 1.6    2011-05-06 A.N.T. Farm 3.7    2012-10-12 Dog With a Blog 5.3    2011-09-30 Jessie 6.3    2010-04-04 Good Luck Charlie 5.8    2008-09-26 The Suite Life on Deck 6.1    2011-06-13 Kickin' It 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 30m Homepage   http://disneychannel.disney.com/shake-it-up Genres Family Kids Comedy Keywords dancing teenager Content Score 93 Almost there... Top Contributors 12 Banana l 11 lexura 6 Atanas z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}