{"link": "https://www.themoviedb.org/tv/61604?language=en", "title": "Divorce", "resume": "The series is about three men aged between 35 and 45 who are in the middle of a divorce. They decide to temporarily live together. They share joys and sorrows, and a deeply rooted friendship grows. The story revolves around everything that a divorce entails: the strong emotions, the quarrels, the mourning, the doubts, the children, finances, rediscovering yourself, starting again, dealing with your ex and dating on your fortieth. But the series is also about a typical male friendship. Men who need but a few words to understand each other, who give each other space to be sad and who back each other up when they are vulnerable. But also men who are not afraid to tell each other the brutal truth.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Jeroen Spitzenberger", "Chantal Janzen", "Waldemar Torenstra", "Katja Herbers", "Dirk Zeelenberg"], "character": ["Boudewijn Schaeffer", "Sophie Schaeffer", "Joris Hulskamp", "Joyce Waanders", "David Mendelbaum"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61604   Expand Divorce   (2012) User Score Overview The series is about three men aged between 35 and 45 who are in the middle of a divorce. They decide to temporarily live together. They share joys and sorrows, and a deeply rooted friendship grows. The story revolves around everything that a divorce entails: the strong emotions, the quarrels, the mourning, the doubts, the children, finances, rediscovering yourself, starting again, dealing with your ex and dating on your fortieth. But the series is also about a typical male friendship. Men who need but a few words to understand each other, who give each other space to be sad and who back each other up when they are vulnerable. But also men who are not afraid to tell each other the brutal truth. Featured Crew Linda de Mol Creator John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeroen Spitzenberger Boudewijn Schaeffer Chantal Janzen Sophie Schaeffer Waldemar Torenstra Joris Hulskamp Katja Herbers Joyce Waanders Dirk Zeelenberg David Mendelbaum Full Cast & Crew Last Season Season 4 2016 | 12 Episodes Season 4 of Divorce premiered on January  3, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Divorce. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Divorce. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  40m Homepage   http://www.rtl.nl/divorce/ Genres Drama Comedy Keywords ex-husband ex-wife relationship buddy comedy Content Score 93 Almost there... Top Contributors g 50 gekkegast 9 Marr 🇳🇱 a 8 andre.meulemans 3 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}