{"link": "https://www.themoviedb.org/tv/60929?language=en", "title": "Black Money Love", "resume": "Ömer is a police officer. After the death of his fiancée, he suffers great pain. The body of Sibel, Ömer's fiancée, was found on the top of a cliff, in a car next to a fairly old, rich business man. After the shock of her sudden death and the accusations of his love cheating on him, Ömer realizes that there is more behind her suspicious murder", "rate": 63, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Ali Yörenc", "Engin Akyurek", "Tuba Büyüküstün", "Erkan Can", "Damla Colbay"], "character": ["Mert", "Ömer", "Elif", "Tayyar", "Demet"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60929   Expand Black Money Love   (2014) User Score  Play Trailer Overview Ömer is a police officer. After the death of his fiancée, he suffers great pain. The body of Sibel, Ömer's fiancée, was found on the top of a cliff, in a car next to a fairly old, rich business man. After the shock of her sudden death and the accusations of his love cheating on him, Ömer realizes that there is more behind her suspicious murder Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ali Yörenc Mert Engin Akyurek Ömer Tuba Büyüküstün Elif Erkan Can Tayyar Damla Colbay Demet Full Cast & Crew Last Season Season 2 2014 | 41 Episodes Season 2 of Black Money Love premiered on September  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Black Money Love. You can help by rating TV shows you've seen. Facts Original Name  Kara Para Aşk Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   http://ayyapim.com/kara-para-ask Genres Action & Adventure Drama Mystery Keywords kidnapping police officer murdered fiancée Content Score 93 Almost there... Top Contributors b 24 bluwy V 19 Vaine RK 12 Ramazan KAYHÜYÜK CM 12 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}