{"link": "https://www.themoviedb.org/tv/6074?language=en", "title": "My Girl", "resume": "Gong Chan is the wealthy, unattached heir to a large company. Having lost both his parents, he is devoted to what remains of his family, particularly his ailing grandfather. After deciding to cut off his only daughter after disapproving of her marriage, the old man is plagued with guilt since the couple was killed soon after he lost touch. By chance, Gong Chan meets a woman who resembles his lost aunt and is inspired to use her to fulfill his grandfather's last wish. The woman, Yoo Rin is the daughter of a compulsive gambler and is constantly on the run, so when Gong Chan offers her this opportunity, she cannot afford to refuse. After Yoo Rin moves in with the family, Gong Chan finds himself drawn to her and a forbidden attraction springs up between them.", "rate": 70, "genre": ["Comedy", "Drama"], "cast": ["Lee Da-hae", "Lee Dong-wook", "Lee Joon-gi", "Park Si-yeon", "Hwang Bo-ra"], "character": ["Joo Yoo Rin", "Seol Gong Chan", "Seo Jung Woo", "Kim Sae Hyun", "Ahn Jin Shim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6074   Expand My Girl   (2005) User Score Overview Gong Chan is the wealthy, unattached heir to a large company. Having lost both his parents, he is devoted to what remains of his family, particularly his ailing grandfather. After deciding to cut off his only daughter after disapproving of her marriage, the old man is plagued with guilt since the couple was killed soon after he lost touch. By chance, Gong Chan meets a woman who resembles his lost aunt and is inspired to use her to fulfill his grandfather's last wish. The woman, Yoo Rin is the daughter of a compulsive gambler and is constantly on the run, so when Gong Chan offers her this opportunity, she cannot afford to refuse. After Yoo Rin moves in with the family, Gong Chan finds himself drawn to her and a forbidden attraction springs up between them. Featured Crew Hong Mi Ran Creator Hong Jeong Eun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Da-hae Joo Yoo Rin Lee Dong-wook Seol Gong Chan Lee Joon-gi Seo Jung Woo Park Si-yeon Kim Sae Hyun Hwang Bo-ra Ahn Jin Shim Full Cast & Crew Last Season Season 1 2005 | 16 Episodes Season 1 of My Girl premiered on December 14, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  3 Recommendations   2004-07-14 Full House 6.5    2009-10-07 You're Beautiful 7.9    2015-01-07 Kill Me, Heal Me 8.7    2007-07-02 Coffee Prince 8.8    2013-12-18 My Love From Another Star 8.2    2016-02-24 Descendants of the Sun 6.5  Facts Original Name  마이걸 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.tv.sbs.co.kr/mygirl/ Genres Comedy Drama Keywords korea Content Score 93 Almost there... Top Contributors M 19 Maria180493 N 7 Nightowl.Kr CM 6 Cherche Moi z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}