{"link": "https://www.themoviedb.org/tv/9865?language=en", "title": "Switch", "resume": "Switch is an American action-adventure, tongue-in-cheek detective series starring Eddie Albert and Robert Wagner, who work as private eyes, for a deceptive sting operation. It was broadcast on the CBS network for three seasons between September 9, 1975 and August 20, 1978, bumping the Hawaii Five-O detective series to Friday nights.", "rate": 73, "genre": ["Action", "Adventure", "Drama"], "cast": ["Robert Wagner", "Sharon Gless", "Eddie Albert", "Charlie Callas", "James Hong"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9865   Expand Switch   (1975) User Score Overview Switch is an American action-adventure, tongue-in-cheek detective series starring Eddie Albert and Robert Wagner, who work as private eyes, for a deceptive sting operation. It was broadcast on the CBS network for three seasons between September 9, 1975 and August 20, 1978, bumping the Hawaii Five-O detective series to Friday nights. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Wagner Sharon Gless Eddie Albert Charlie Callas James Hong Full Cast & Crew Last Season Season 3 1977 | 22 Episodes Season 3 of Switch premiered on September 23, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Switch. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords con man ex-cop private investigator los angeles detective agency Content Score 79 Pump it up! We're close now. Top Contributors 12 Banana 2 lineker S 2 Samara 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}