{"link": "https://www.themoviedb.org/tv/5467?language=en", "title": "MotorWeek", "resume": "MotorWeek is an American automotive television series. The program premiered in January 3, 1981 and is hosted by respected automotive journalist John H. Davis, who is also the series’ creator and executive producer. MotorWeek is produced by Maryland Public Television and is seen nationwide on Public Broadcasting Service, Discovery Network, Velocity, V-me and globally on the American Forces Network.\nThe half-hour program is presented in a magazine-like format, with reviews, comparisons, news, and features. MotorWeek's original slogan was \"Television's automotive magazine\", later changed to \"Television's original automotive magazine\". This only applies to American television, however, as the BBC's Top Gear debuted in 1977. The show went into national syndication beginning September 11, 1993, originally syndicated by ITC Entertainment.", "rate": 0, "genre": ["News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5467   Expand MotorWeek   (1981) User Score Overview MotorWeek is an American automotive television series. The program premiered in January 3, 1981 and is hosted by respected automotive journalist John H. Davis, who is also the series’ creator and executive producer. MotorWeek is produced by Maryland Public Television and is seen nationwide on Public Broadcasting Service, Discovery Network, Velocity, V-me and globally on the American Forces Network. The half-hour program is presented in a magazine-like format, with reviews, comparisons, news, and features. MotorWeek's original slogan was \"Television's automotive magazine\", later changed to \"Television's original automotive magazine\". This only applies to American television, however, as the BBC's Top Gear debuted in 1977. The show went into national syndication beginning September 11, 1993, originally syndicated by ITC Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 35 2015 | 10 Episodes Season 35 of MotorWeek premiered on September 11, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on MotorWeek. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.mpt.org/motorweek/home.shtml Genres News Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 13 Banana TB 9 TMDb Bot a 4 apung21 2 JaseYANG  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}