{"link": "https://www.themoviedb.org/tv/5100?language=en", "title": "Blood Ties", "resume": "Blood Ties is a Canadian television series based on the Blood Books by Tanya Huff; the show was created by Peter Mohan. It is set in Toronto, Canada and has a similar premise to an earlier series also set in Toronto, Forever Knight, in which a vampire assists police in dealing with crime. It premiered in the United States on March 11, 2007 on Lifetime Television, and during fall of 2007 on Citytv and Space in Canada. In May 2008, Lifetime declined to renew the series.", "rate": 73, "genre": ["Drama"], "cast": ["Dylan Neal", "Gina Holden", "Kyle Schmid", "Françoise Yip", "Nimet Kanji"], "character": ["Mike Celluci", "Coreen Fennel", "Henry Fitzroy", "Kate Lam", "Dr. Rajani Mohadevan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5100   Expand Blood Ties   (2007) User Score  Play Trailer Overview Blood Ties is a Canadian television series based on the Blood Books by Tanya Huff; the show was created by Peter Mohan. It is set in Toronto, Canada and has a similar premise to an earlier series also set in Toronto, Forever Knight, in which a vampire assists police in dealing with crime. It premiered in the United States on March 11, 2007 on Lifetime Television, and during fall of 2007 on Citytv and Space in Canada. In May 2008, Lifetime declined to renew the series. Featured Crew Tanya Huff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dylan Neal Mike Celluci Gina Holden Coreen Fennel Kyle Schmid Henry Fitzroy Françoise Yip Kate Lam Nimet Kanji Dr. Rajani Mohadevan Full Cast & Crew Last Season Season 2 2007 | 10 Episodes Season 2 of Blood Ties premiered on October 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations   2007-09-28 Moonlight 7.1    2010-06-20 The Gates 6.8    2013-03-03 Red Widow 4.9    2002-09-20 What I Like About You 5.3    2004-10-24 ReGenesis 7.0    2012-10-29 Primeval: New World 6.1    2009-02-14 Impact 5.1    2015-11-27 South of Hell 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors V 26 VartaniX 7 Rafael Esberard w 4 waterhorse w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}