{"link": "https://www.themoviedb.org/tv/15003?language=en", "title": "Tell Me You Love Me", "resume": "Tell Me You Love Me is an American cable television drama series that premiered on HBO and on The Movie Network on September 9, 2007.\nThe series was created by Cynthia Mort and originally conceived as Sexlife. The pilot episode was produced and directed by Patricia Rozema and shot in Winnipeg, Manitoba. The series was picked up by HBO for a second season in October 2007, but was ultimately canceled in July 2008 when Mort said she and the network \"were unable to find the direction of the show for the second season\".", "rate": 65, "genre": ["Drama"], "cast": ["David Selby", "Tim DeKay", "Adam Scott", "Ally Walker", "Jane Alexander"], "character": ["Arthur Foster", "David", "Palek", "Katie", "Dr. May Foster"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15003   Expand Tell Me You Love Me   (2007) User Score Overview Tell Me You Love Me is an American cable television drama series that premiered on HBO and on The Movie Network on September 9, 2007. The series was created by Cynthia Mort and originally conceived as Sexlife. The pilot episode was produced and directed by Patricia Rozema and shot in Winnipeg, Manitoba. The series was picked up by HBO for a second season in October 2007, but was ultimately canceled in July 2008 when Mort said she and the network \"were unable to find the direction of the show for the second season\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Selby Arthur Foster Tim DeKay David Adam Scott Palek Ally Walker Katie Jane Alexander Dr. May Foster Full Cast & Crew Last Season Season 1 2007 | 10 Episodes Season 1 of Tell Me You Love Me premiered on September  9, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2010-02-14 How to Make It in America 7.6    2012-05-22 Hit & Miss 7.3    2004-01-18 The L Word 6.7    2009-06-08 Nurse Jackie 7.2    2002-09-26 Without a Trace 6.8    1996-09-19 The Pretender 7.3    2015-07-31 Wet Hot American Summer: First Day of Camp 6.4    2008-07-13 Generation Kill 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 62m Homepage   http://www.hbo.com/tellme/ Genres Drama Keywords unsimulated sex complicated relationships Content Score 86 Almost there... Top Contributors 17 lineker R 9 Rebecca b 4 bugfix I 4 I.Ciompo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}