{"link": "https://www.themoviedb.org/tv/67868?language=en", "title": "The Mystic Nine", "resume": "The drama is a prequel to The Lost Tomb in which the story focuses  on the exploits of the nine grave robbing families in the 1940s. With  the help of his friends Fortune Teller Qi Tie Zue and Opera Singer Er  Yue Hong, General Zhang Qi Shan entered into a strange mine to discover a  mysterious ancient tomb. After many untold dangers, he uncovered a  Japanese plot to kill the residents of Changsha city. The men banded  together to stop the Japanese's plot, thereby saving their city.", "rate": 0, "genre": ["Mystery", "Action", "Adventure"], "cast": ["William Chan Wai-Ting", "Yixing Zhang", "Zhao Liying", "Zhang Ming En"], "character": ["Zhang Qi Shan", "Er Yue Tou", "Yi Xin Yue", "Lieutenant Zhang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67868   Expand The Mystic Nine   (2016) User Score Overview The drama is a prequel to The Lost Tomb in which the story focuses  on the exploits of the nine grave robbing families in the 1940s. With  the help of his friends Fortune Teller Qi Tie Zue and Opera Singer Er  Yue Hong, General Zhang Qi Shan entered into a strange mine to discover a  mysterious ancient tomb. After many untold dangers, he uncovered a  Japanese plot to kill the residents of Changsha city. The men banded  together to stop the Japanese's plot, thereby saving their city. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Chan Wai-Ting Zhang Qi Shan Yixing Zhang Er Yue Tou Zhao Liying Yi Xin Yue Zhang Ming En Lieutenant Zhang Full Cast & Crew Last Season Season 1 2016 | 48 Episodes Season 1 of The Mystic Nine premiered on July  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Mystic Nine. You can help by rating TV shows you've seen. Facts Original Name  老九门 Status  Ended Networks Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Mystery Action & Adventure Keywords war china Content Score 86 Almost there... Top Contributors M 26 Maria180493 G 7 Giaten w 1 woogoldsgreat  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}