{"link": "https://www.themoviedb.org/tv/20658?language=en", "title": "Arabian Nights", "resume": "Arabian Nights is a two-part 2000 American/British miniseries, adapted by Peter Barnes from Sir Richard Francis Burton's translation of the medieval epic One Thousand and One Nights. Mili Avital and Dougray Scott star as Scheherazade and Shahryar respectively. Produced by Dyson Lovell and directed by Steve Barron, the serial was a made by Hallmark Entertainment and originally broadcast over two nights on 30 April and 1 May 2000 on BBC One in the United Kingdom and ABC in the United States.\nThe series consists of five stories from One Thousand and One Nights, which are framed within a sixth, maintaining the traditional style of stories within stories that is synonymous with the Nights. The series cast includes Alan Bates, Rufus Sewell, Andy Serkis, James Frain, John Leguizamo, Jason Scott Lee, Vanessa-Mae, Alexei Sayle, Jim Carter, and James Callis.", "rate": 68, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Mili Avital", "Alan Bates", "James Frain", "Tchéky Karyo", "Dougray Scott"], "character": ["Scheherezade", "Storyteller", "Schahzenan / Harun al-Rashid", "Black Coda", "Sultan Shahryar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20658   Expand Arabian Nights   (2000) User Score  Play Trailer Overview Arabian Nights is a two-part 2000 American/British miniseries, adapted by Peter Barnes from Sir Richard Francis Burton's translation of the medieval epic One Thousand and One Nights. Mili Avital and Dougray Scott star as Scheherazade and Shahryar respectively. Produced by Dyson Lovell and directed by Steve Barron, the serial was a made by Hallmark Entertainment and originally broadcast over two nights on 30 April and 1 May 2000 on BBC One in the United Kingdom and ABC in the United States. The series consists of five stories from One Thousand and One Nights, which are framed within a sixth, maintaining the traditional style of stories within stories that is synonymous with the Nights. The series cast includes Alan Bates, Rufus Sewell, Andy Serkis, James Frain, John Leguizamo, Jason Scott Lee, Vanessa-Mae, Alexei Sayle, Jim Carter, and James Callis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mili Avital Scheherezade Alan Bates Storyteller James Frain Schahzenan / Harun al-Rashid Tchéky Karyo Black Coda Dougray Scott Sultan Shahryar Full Cast & Crew Last Season Season 1 2000 | 2 Episodes Season 1 of Arabian Nights premiered on April 30, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  8 Recommendations   2002-01-01 The Lost World 7.4    1997-08-31 Full Circle with Michael Palin 7.3    2013-01-04 Zen 7.7    2000-05-07 Jason and the Argonauts 5.6    2002-10-13 Sahara with Michael Palin 6.9    1988-09-06 Count Duckula 6.9    1998-05-18 Creature 4.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors TB 79 TMDb Bot x 6 xmodder 3 nextlooper42 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}