{"link": "https://www.themoviedb.org/tv/15123?language=en", "title": "Kitchen Confidential", "resume": "Jack Bourdain had it all but messed it up going wild. Four years later, he ends up with a crappy job in Pizza Chain. Then, he gets an offer to get back in the game as the chef of a famous restaurant.", "rate": 74, "genre": ["Comedy"], "cast": ["Nicholas Brendon", "Owain Yeoman", "Bonnie Somerville", "John Francis Daley", "Jaime King"], "character": ["Steven Daedelus", "Mimi", "Jim", "Tanya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15123   Expand Kitchen Confidential   (2005) User Score  Play Trailer Overview Jack Bourdain had it all but messed it up going wild. Four years later, he ends up with a crappy job in Pizza Chain. Then, he gets an offer to get back in the game as the chef of a famous restaurant. Featured Crew David Hemingson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Brendon Owain Yeoman Steven Daedelus Bonnie Somerville Mimi John Francis Daley Jim Jaime King Tanya Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Kitchen Confidential premiered on September 19, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2004-01-18 The L Word 6.7    1990-04-22 Jeeves and Wooster 7.7    2007-09-25 Reaper 7.0    1999-12-24 Happy Tree Friends 6.8    2009-04-09 Harper's Island 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords cook restaurant kitchen comeback chef sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors z 10 zurman1 9 Banana 6 NEOhidra 5 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}