{"link": "https://www.themoviedb.org/tv/15822?language=en", "title": "Zorro", "resume": "Zorro, also known as The New Zorro, New World Zorro, and Zorro 1990, is an American action-adventure drama series featuring Duncan Regehr as the character of Zorro. Regehr portrayed the fearless Latino hero and fencer on The Family Channel from 1990 to 1993. The series was shot entirely in Madrid, Spain and produced by New World Television, The Family Channel, Ellipse Programme of Canal Plus, Beta TV, and RAI. 88 episodes of the series were produced, 10 more than the first Zorro television series, which was produced by Disney in the late 1950s.\nSince 2011, the series is currently airing in the United States on the Retro Television Network as The New Zorro. Peter Rodgers Organization is the distributor for this version of Zorro.", "rate": 61, "genre": ["Action", "Adventure", "Drama"], "cast": ["Michael Gough", "Michael Tylo", "Henry Darrow", "J.G. Hertzler", "Duncan Regehr"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15822   Expand Zorro   (1990) User Score Overview Zorro, also known as The New Zorro, New World Zorro, and Zorro 1990, is an American action-adventure drama series featuring Duncan Regehr as the character of Zorro. Regehr portrayed the fearless Latino hero and fencer on The Family Channel from 1990 to 1993. The series was shot entirely in Madrid, Spain and produced by New World Television, The Family Channel, Ellipse Programme of Canal Plus, Beta TV, and RAI. 88 episodes of the series were produced, 10 more than the first Zorro television series, which was produced by Disney in the late 1950s. Since 2011, the series is currently airing in the United States on the Retro Television Network as The New Zorro. Peter Rodgers Organization is the distributor for this version of Zorro. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Gough Michael Tylo Henry Darrow J.G. Hertzler Duncan Regehr Full Cast & Crew Last Season Season 4 1992 | 13 Episodes Season 4 of Zorro premiered on September  1, 1992. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply DVD set is so annoying Open 0 by Jan El Señor\n      \n     Best seasons? Open 6 by  Jan El Señor Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1989-09-20 The Young Riders 8.2    1996-09-19 The Pretender 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords masked vigilante old california 19th century Content Score 86 Almost there... Top Contributors 13 Banana 3 Jan El Señor i 3 ismax935 d 1 dandy02  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}