{"link": "https://www.themoviedb.org/tv/3809?language=en", "title": "Yin Yang Yo!", "resume": "Yin Yang Yo! is a Canadian-American animated television series created by Bob Boyle II and produced by Jetix Animation Concepts. It is the third Jetix-original show. It premiered on October 2, 2006 on Jetix in the United States with a sneak peek airing on August 26, 2006. The show debuted on Jetix in the United Kingdom on February 5, 2007 after a sneak peek preview on January 27, 2007 while making its Canadian television premiere on Family Channel on March 25, 2006. The series is supplied with writers and animators' staff associated with Fairly OddParents, Family Guy, Kim Possible and Danny Phantom. Head writer Steve Marmel, an anime fan, took an inspiration from various anime and anime-influenced shows such as Teen Titans or FLCL. It stars two anthropomorphic rabbits named Yin and Yang, and their sensei-like panda figure named Yo, a master of fictional mystical martial arts called Woo Foo. The series' second season premiered on December 31, 2007 and ended on April 18, 2009.\nIn 2007, the show was nominated for British Academy Children's Award by the BAFTA in the International category, but lost to Stephen Hillenburg's SpongeBob SquarePants. From its launch in June 1, 2011 to late 2012, Disney XD Canada aired re-runs of the series.", "rate": 63, "genre": ["Family", "Animation", "Action", "Adventure", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Novie Edwards", "Stephanie Morgenstern", "Kathy Najimy", "Megan Fahlenbock", "Linda Ballantyne"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3809   Expand Yin Yang Yo!   (2006) User Score Overview Yin Yang Yo! is a Canadian-American animated television series created by Bob Boyle II and produced by Jetix Animation Concepts. It is the third Jetix-original show. It premiered on October 2, 2006 on Jetix in the United States with a sneak peek airing on August 26, 2006. The show debuted on Jetix in the United Kingdom on February 5, 2007 after a sneak peek preview on January 27, 2007 while making its Canadian television premiere on Family Channel on March 25, 2006. The series is supplied with writers and animators' staff associated with Fairly OddParents, Family Guy, Kim Possible and Danny Phantom. Head writer Steve Marmel, an anime fan, took an inspiration from various anime and anime-influenced shows such as Teen Titans or FLCL. It stars two anthropomorphic rabbits named Yin and Yang, and their sensei-like panda figure named Yo, a master of fictional mystical martial arts called Woo Foo. The series' second season premiered on December 31, 2007 and ended on April 18, 2009. In 2007, the show was nominated for British Academy Children's Award by the BAFTA in the International category, but lost to Stephen Hillenburg's SpongeBob SquarePants. From its launch in June 1, 2011 to late 2012, Disney XD Canada aired re-runs of the series. Featured Crew Bob Boyle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Novie Edwards Stephanie Morgenstern Kathy Najimy Megan Fahlenbock Linda Ballantyne Full Cast & Crew Last Season Season 2 2008 | 10 Episodes Season 2 of Yin Yang Yo! premiered on January  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2000-09-30 George Shrinks 4.3    2005-05-30 The Life and Times of Juniper Lee 4.2    2004-09-18 Super Robot Monkey Team Hyperforce Go! 5.2    2006-02-11 Shuriken School 4.6    2003-08-23 Sonic X 5.5    2008-10-25 Kid vs. Kat 4.5    2004-12-18 W.I.T.C.H. 6.6    2003-11-01 Xiaolin Showdown 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Family Animation Action & Adventure Comedy Sci-Fi & Fantasy Keywords martial arts cartoon rabbit Content Score 93 Almost there... Top Contributors 16 Banana 3 rtentser j 3 jco666 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}