{"link": "https://www.themoviedb.org/tv/64229?language=en", "title": "Jay Leno's Garage", "resume": "Starting as a YouTube series in 2006 and making it's way to television in 2015 on CNBC, former host of \"The Tonight Show\" Jay Leno does car and motorcycle reviews on classic cars, super cars like the McLaren P1, restored cars, vintage and sports cars.\nJay Leno's Big Dog Garage is located in Burbank, California, near Bob Hope Airport. In 2011 the show won a Primetime Emmy Award for \"Outstanding Special Class — Short-Format Nonfiction Program\". It is distributed by NBC Entertainment's digital division.", "rate": 0, "genre": ["Reality", "Documentary"], "cast": ["Jay Leno"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64229   Expand Jay Leno's Garage   (2015) User Score Overview Starting as a YouTube series in 2006 and making it's way to television in 2015 on CNBC, former host of \"The Tonight Show\" Jay Leno does car and motorcycle reviews on classic cars, super cars like the McLaren P1, restored cars, vintage and sports cars. Jay Leno's Big Dog Garage is located in Burbank, California, near Bob Hope Airport. In 2011 the show won a Primetime Emmy Award for \"Outstanding Special Class — Short-Format Nonfiction Program\". It is distributed by NBC Entertainment's digital division. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Leno Himself - Host Full Cast & Crew Current Season Season 4 2018 | 7 Episodes Season 4 of Jay Leno's Garage premiered on April 19, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jay Leno's Garage. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cnbcprime.com/jay-lenos-garage/ Genres Reality Documentary Keywords automobile Content Score 56 We're so close, yet so far. Top Contributors R 18 Rebecca 7 ReggieRocket R 4 Robert C 3 Carulux  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}