{"link": "https://www.themoviedb.org/tv/57780?language=en", "title": "Lego Legends of Chima", "resume": "Laval the Lion and Cragger the Crocodile are best friends who live in the mystical land of Chima. This all changes after an innocent escapade when Cragger gets his first experience with chi, a sacred resource important to Chima's delicate balance which gives its user awesome power.", "rate": 69, "genre": ["Animation"], "cast": ["David Attar", "Bethany Brown", "Bill Courage", "Scott Shantz", "Jeff Evans-Todd"], "character": ["Cragger / Lennox / Rogon / Ripnik / Reegull / Stealthor", "Eris / Crooler / Spinlyn / Rinona / Wonald", "Crominus / Lagravis / Long tooth / Lavertus / Mottrot", "Laval / Worriz / Skinnet / Furtivo / Razcal / Sparratus / Scolder / Scutter / Lundor / Vardy / Firox", "Razar / Bladvic / Crawley / Winzar / Leonidas / Equila / Ewald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57780   Expand Lego Legends of Chima   (2013) User Score Overview Laval the Lion and Cragger the Crocodile are best friends who live in the mystical land of Chima. This all changes after an innocent escapade when Cragger gets his first experience with chi, a sacred resource important to Chima's delicate balance which gives its user awesome power. Featured Crew John Derevlany Creator Peder Pedersen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Attar Cragger / Lennox / Rogon / Ripnik / Reegull / Stealthor Bethany Brown Eris / Crooler / Spinlyn / Rinona / Wonald Bill Courage Crominus / Lagravis / Long tooth / Lavertus / Mottrot Scott Shantz Laval / Worriz / Skinnet / Furtivo / Razcal / Sparratus / Scolder / Scutter / Lundor / Vardy / Firox Jeff Evans-Todd Razar / Bladvic / Crawley / Winzar / Leonidas / Equila / Ewald Full Cast & Crew Last Season Season 3 2014 | 15 Episodes Season 3 of Lego Legends of Chima premiered on September 23, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Lego Legends of Chima. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://lego.com/ Genres Animation Keywords chima Content Score 93 Almost there... Top Contributors 36 Travis Bell 20 Jeromnimo G 20 Grentel 9 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}