{"link": "https://www.themoviedb.org/tv/11829?language=en", "title": "Sykes", "resume": "Sykes is a British sitcom that aired on BBC 1 from 1972 to 1979. Starring Eric Sykes and Hattie Jacques, it was written by Sykes, who had previously starred with Jacques in Sykes and A... and Sykes and a Big, Big Show. Forty-three of the 1970s colour episodes were remakes of scripts for the 1960s black and white series, such as \"Bus\" based on 'Sykes and a Following' from 1964 and the episode \"Stranger\" with guest star Peter Sellers based on 'Sykes and a Stranger' from 1961.\nSykes had the same premise as Sykes and A... with Sykes, Jacques, Richard Wattis and Deryck Guyler reprising their former identical roles. The series was brought to an end by the death of Hattie Jacques of a heart attack on 6 October 1980.", "rate": 80, "genre": ["Comedy"], "cast": ["Richard Wattis", "Eric Sykes", "Deryck Guyler", "Hattie Jacques", "Joan Sims"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11829   Expand Sykes   (1972) User Score Overview Sykes is a British sitcom that aired on BBC 1 from 1972 to 1979. Starring Eric Sykes and Hattie Jacques, it was written by Sykes, who had previously starred with Jacques in Sykes and A... and Sykes and a Big, Big Show. Forty-three of the 1970s colour episodes were remakes of scripts for the 1960s black and white series, such as \"Bus\" based on 'Sykes and a Following' from 1964 and the episode \"Stranger\" with guest star Peter Sellers based on 'Sykes and a Stranger' from 1961. Sykes had the same premise as Sykes and A... with Sykes, Jacques, Richard Wattis and Deryck Guyler reprising their former identical roles. The series was brought to an end by the death of Hattie Jacques of a heart attack on 6 October 1980. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Wattis Eric Sykes Deryck Guyler Hattie Jacques Joan Sims Full Cast & Crew Last Season Season 7 1979 | 7 Episodes Season 7 of Sykes premiered on October  5, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sykes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords brother sister sitcom british humour Content Score 86 Almost there... Top Contributors O 8 Ozbourne T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}