{"link": "https://www.themoviedb.org/tv/65955?language=en", "title": "This Art Club Has a Problem!", "resume": "The anime focuses on an art club in a certain middle school, and its members: Subaru Uchimaki, who is a genius at drawing faces, but only wants to draw the perfect 2D wife; Colette, a rich troublemaker who never stops making mischief; and the club president, who sleeps through sessions and collects sleeping aids. Mizuki Usami is the only person in the club who wants to do art club-like activities, and constantly struggles to do so.", "rate": 75, "genre": ["Animation", "Comedy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65955   Expand This Art Club Has a Problem!   (2016) User Score Overview The anime focuses on an art club in a certain middle school, and its members: Subaru Uchimaki, who is a genius at drawing faces, but only wants to draw the perfect 2D wife; Colette, a rich troublemaker who never stops making mischief; and the club president, who sleeps through sessions and collects sleeping aids. Mizuki Usami is the only person in the club who wants to do art club-like activities, and constantly struggles to do so. Featured Crew Imigi Muru Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of This Art Club Has a Problem! premiered on July  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on This Art Club Has a Problem!. You can help by rating TV shows you've seen. Facts Original Name  この美術部には問題がある！ Status  Ended Network Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/konobi/ Genres Animation Comedy Drama Keywords slice of life based on manga anime dengeki maoh Content Score 64 We're so close, yet so far. Top Contributors 23 deanzel 21 sp1ti J 10 JohnyB0y 10 Deku2k  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}