{"link": "https://www.themoviedb.org/tv/69953?language=en", "title": "Kamen Rider Ghost: Legendary! Riders' Souls!", "resume": "Kamen Rider Ghost: Legendary! Riders' Souls! is a web-exclusive series of Kamen Rider Ghost, which was released on TOEI's official YouTube channel to commemorate the 45th anniversary of the Kamen Rider Series. Installments for each of Ghost's six Heisei Kamen Rider Series Phase 2 predecessors. Episodes were released each Friday every 2 weeks, up to the day before the premiere of the 45th anniversary movie, Kamen Rider 1.", "rate": 0, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Shun Nishime", "Ryosuke Yamamoto", "Hikaru Ohsawa", "Takayuki Yanagi", "Ryo Ogawa"], "character": ["Takeru Tenkuji / Kamen Rider Ghost", "Makoto Fukami / Kamen Rider Specter", "Akari Tsukimura", "Onari", "Frey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69953   Expand Kamen Rider Ghost: Legendary! Riders' Souls!   (2016) User Score Overview Kamen Rider Ghost: Legendary! Riders' Souls! is a web-exclusive series of Kamen Rider Ghost, which was released on TOEI's official YouTube channel to commemorate the 45th anniversary of the Kamen Rider Series. Installments for each of Ghost's six Heisei Kamen Rider Series Phase 2 predecessors. Episodes were released each Friday every 2 weeks, up to the day before the premiere of the 45th anniversary movie, Kamen Rider 1. Featured Crew Shotaro Ishinomori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Shun Nishime Takeru Tenkuji / Kamen Rider Ghost Ryosuke Yamamoto Makoto Fukami / Kamen Rider Specter Hikaru Ohsawa Akari Tsukimura Takayuki Yanagi Onari Ryo Ogawa Frey Full Cast & Crew Last Season Season 1 2016 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kamen Rider Ghost: Legendary! Riders' Souls!. You can help by rating TV shows you've seen. Facts Original Name  仮面ライダーゴースト 伝説! ライダーの魂! Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  6m Homepage   http://rider.b-boys.jp/ghost/tamashii/ Genres Action & Adventure Sci-Fi & Fantasy Keywords tokusatsu kamen rider ghost kamen rider specter Content Score 100 Yes! Looking good! Top Contributors 40 J. TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}