{"link": "https://www.themoviedb.org/tv/65715?language=en", "title": "The Rap Game", "resume": "Set in Atlanta’s hip hop scene, The Rap Game follow five young hip hop artists, ages 12 to 16 years old, as they work with Dupri and special guests such as Usher, Ludacris, Da Brat, T.I. and Silentó, to become the next big, young rap star.", "rate": 55, "genre": ["Reality"], "cast": ["Jermaine Dupri"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65715   Expand The Rap Game   (2016) User Score Overview Set in Atlanta’s hip hop scene, The Rap Game follow five young hip hop artists, ages 12 to 16 years old, as they work with Dupri and special guests such as Usher, Ludacris, Da Brat, T.I. and Silentó, to become the next big, young rap star. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jermaine Dupri Himself - Host Full Cast & Crew Current Season Season 4 2017 | 13 Episodes Season 4 of The Rap Game premiered on November 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on The Rap Game. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://www.mylifetime.com/shows/the-rap-game Genres Reality Keywords rap music hip-hop reality competition Content Score 56 We're so close, yet so far. Top Contributors R 26 Rebecca b 10 bowen4514@gmail.com b 8 basher 4 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}