{"link": "https://www.themoviedb.org/tv/69573?language=en", "title": "Newton's Law", "resume": "With her low-flying Solicitor's practice incinerated by a disgruntled client, her marriage collapsing and motherhood fast losing its charm, Josephine Newton's old uni' friend and not-so secret admirer, Lewis Hughes, persuades her to resume her briefly glorious career at the Bar.\nAs she rises to the challenge, though, trading the benefits of her brilliant mind for a berth in the lofty glamour of Knox Chambers, Josephine realises it's not so easy to leave her entourage behind.", "rate": 5, "genre": ["Drama"], "cast": ["Claudia Karvan", "Toby Schmitz", "Brett Tucker", "Georgina Naidu", "Sean Keenan"], "character": ["Josephine Newton", "Lewis Hughes", "Callum Docker", "Helena Chatterjee", "Johnny Allbright"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69573   Expand Newton's Law   (2017) User Score  Play Trailer Overview With her low-flying Solicitor's practice incinerated by a disgruntled client, her marriage collapsing and motherhood fast losing its charm, Josephine Newton's old uni' friend and not-so secret admirer, Lewis Hughes, persuades her to resume her briefly glorious career at the Bar. As she rises to the challenge, though, trading the benefits of her brilliant mind for a berth in the lofty glamour of Knox Chambers, Josephine realises it's not so easy to leave her entourage behind. Featured Crew Deborah Cox Creator Fiona Eagger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claudia Karvan Josephine Newton Toby Schmitz Lewis Hughes Brett Tucker Callum Docker Georgina Naidu Helena Chatterjee Sean Keenan Johnny Allbright Full Cast & Crew Last Season Series 1 2017 | 8 Episodes Season 1 of Newton's Law premiered on February  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Newton's Law. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  - Homepage   http://www.abc.net.au/tv/programs/newtons-law/ Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 53 United600 9 Elizabeth Jennings TB 4 TMDb Bot 2 denzoid  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}