{"link": "https://www.themoviedb.org/tv/38324?language=en", "title": "Dragon Quest: Dai no Daibōken", "resume": "Dragon Quest: Dai no Daibōken, is an original manga based in the fantasy world of the video game series Dragon Quest. It was originally created as a two-chapter short story titled \"Derupa! Iruiru!\". Its subsequent success led to the three-chapter sequel \"Dai Bakuhatsu!!!\", and later the serialization of Dai no Daibōken in Weekly Shōnen Jump.\nThe manga later spawned an anime series, which would be the second one based on the Dragon Quest franchise, Dragon Quest: Yuusha Abel Densetsu, being the first. Dragon Quest: Dai no Daibōken is one of the Weekly Shōnen Jump's best-selling manga series of all time, with roughly 40 million copies sold.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Toshiko Fujita", "Aya Hisakawa", "Banjou Ginga", "Hideyuki Hori", "Isamu Tanonaka"], "character": ["Dai", "Princess Leona", "Crocodine", "Hyunckel", "Gramps Brass"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38324   Expand Dragon Quest: Dai no Daibōken   (1991) User Score Overview Dragon Quest: Dai no Daibōken, is an original manga based in the fantasy world of the video game series Dragon Quest. It was originally created as a two-chapter short story titled \"Derupa! Iruiru!\". Its subsequent success led to the three-chapter sequel \"Dai Bakuhatsu!!!\", and later the serialization of Dai no Daibōken in Weekly Shōnen Jump. The manga later spawned an anime series, which would be the second one based on the Dragon Quest franchise, Dragon Quest: Yuusha Abel Densetsu, being the first. Dragon Quest: Dai no Daibōken is one of the Weekly Shōnen Jump's best-selling manga series of all time, with roughly 40 million copies sold. Featured Crew Kōji Inada Creator Riku Sanjō Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiko Fujita Dai Aya Hisakawa Princess Leona Banjou Ginga Crocodine Hideyuki Hori Hyunckel Isamu Tanonaka Gramps Brass Full Cast & Crew Last Season Dragon quest: dai no daiboken season 1 1991 | 46 Episodes Season 1 of Dragon Quest: Dai no Daibōken premiered on October 17, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dragon Quest: Dai no Daibōken. You can help by rating TV shows you've seen. Facts Original Name  ドラゴンクエスト・ダイの大冒険 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors F 9 FlavioB 9 vinoulesage 5 TheDerpMan 5 aiman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}