{"link": "https://www.themoviedb.org/tv/75468?language=en", "title": "Neste sommer", "resume": "Norwegians' quest for the perfect holiday in the summer house, the constant experience that the dream never becomes a reality and the belief that it certainly will be better next summer.", "rate": 0, "genre": ["Comedy"], "cast": ["Trond Fausa Aurvåg", "Janne Formoe", "Eivind Sander", "Pia Tjelta", "Kristin Jess Rodin"], "character": ["Per Ivar", "Eva", "Terje", "Anki", "Sigrid / Siggen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75468   Expand Neste sommer   (2014) User Score Overview Norwegians' quest for the perfect holiday in the summer house, the constant experience that the dream never becomes a reality and the belief that it certainly will be better next summer. Featured Crew Lars Gudmestad Creator Simen Alsvik Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Trond Fausa Aurvåg Per Ivar Janne Formoe Eva Eivind Sander Terje Pia Tjelta Anki Kristin Jess Rodin Sigrid / Siggen Full Cast & Crew Current Season Season 5 2018 | 10 Episodes Season 5 of Neste sommer premiered on February 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Neste sommer. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  22m Homepage   http://www.dplay.no/neste-sommer/ Genres Comedy Keywords summer Content Score 100 Yes! Looking good! Top Contributors 41 Bendik M 5 Mr_Democracy TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}