{"link": "https://www.themoviedb.org/tv/70835?language=en", "title": "Cosplay Melee", "resume": "Each week four contestants will compete to create full costumes and character origin stories that will dazzle a panel of judges for a chance to win $10,000.", "rate": 0, "genre": ["Reality"], "cast": ["Yvette Nicole Brown", "Leeanna Vamp", "Christian Beckman"], "character": ["Herself - Host", "Herself - Judge", "Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70835   Expand Cosplay Melee   (2017) User Score Overview Each week four contestants will compete to create full costumes and character origin stories that will dazzle a panel of judges for a chance to win $10,000. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yvette Nicole Brown Herself - Host Leeanna Vamp Herself - Judge Christian Beckman Himself - Judge Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Cosplay Melee premiered on March 21, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Heroes of COSPLAY was much better Open 2 by  Taylorfirst1 Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cosplay Melee. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.syfy.com/cosplaymelee Genres Reality Keywords reality competition Content Score 56 We're so close, yet so far. Top Contributors 28 Elizabeth Jennings 4 natasyalunk 1 szab a 1 acojie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}