{"link": "https://www.themoviedb.org/tv/58951?language=en", "title": "Reckless", "resume": "A gorgeous Yankee litigator and a charming southern attorney must hide their intense mutual attraction as a police sex scandal threatens to tear the city of Charleston, S.C. apart.", "rate": 61, "genre": ["Crime", "Drama"], "cast": ["Anna Wood", "Cam Gigandet", "Adam Rodríguez", "Georgina Haig", "Kim Wayans"], "character": ["Jamie Horn", "Roy Rayder", "Preston Cruz", "Lee Anne Marcus", "Vi Briggs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58951   Expand Reckless   (2014) User Score Overview A gorgeous Yankee litigator and a charming southern attorney must hide their intense mutual attraction as a police sex scandal threatens to tear the city of Charleston, S.C. apart.   Featured Crew Dana Stevens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Wood Jamie Horn Cam Gigandet Roy Rayder Adam Rodríguez Preston Cruz Georgina Haig Lee Anne Marcus Kim Wayans Vi Briggs Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Reckless premiered on June 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2009-10-04 Autumn's Concerto 7.8    2013-05-03 Maron 6.9    2014-09-30 Happyland 3.3    2016-06-02 Hibana: Spark 7.8    2015-09-02 Atelier 7.2    2014-10-02 Bad Judge 6.1    2014-07-17 Rush 6.8    2014-04-22 Faking It 5.3  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/reckless/ Genres Crime Drama Keywords in love with enemy lawyer courtroom legal drama Content Score 100 Yes! Looking good! Top Contributors 24 Banana 12 benf45 R 12 Rebecca 6 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}