{"link": "https://www.themoviedb.org/tv/737?language=en", "title": "The Ben Stiller Show", "resume": "The Ben Stiller Show is the name of two sketch comedy television shows that aired on MTV from 1990 to 1991, and then on Fox from September 1992 to January 1993. The Fox show stars Ben Stiller, Andy Dick, Janeane Garofalo and Bob Odenkirk. Character actor John F. O'Donohue also appeared in every episode. It featured numerous filmed comedy segments, many of which parodied mid-1980s to early 1990s pop-culture. Despite mostly positive reviews, Fox canceled the series after only 12 episodes, due to low ratings.\nUnlike most sketch comedy shows, The Ben Stiller Show did not use a studio audience or a laugh track. This was the only Fox sketch comedy program not to use a laugh track. The semi-spinoff, The Andy Dick Show, used the same format.\nAfter cancellation, the series won the 1993 Emmy Award for Outstanding Writing in a Variety Series.", "rate": 60, "genre": ["Comedy"], "cast": ["Janeane Garofalo", "Bob Odenkirk", "Andy Dick", "Ben Stiller"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 737   Expand The Ben Stiller Show   (1992) User Score Overview The Ben Stiller Show is the name of two sketch comedy television shows that aired on MTV from 1990 to 1991, and then on Fox from September 1992 to January 1993. The Fox show stars Ben Stiller, Andy Dick, Janeane Garofalo and Bob Odenkirk. Character actor John F. O'Donohue also appeared in every episode. It featured numerous filmed comedy segments, many of which parodied mid-1980s to early 1990s pop-culture. Despite mostly positive reviews, Fox canceled the series after only 12 episodes, due to low ratings. Unlike most sketch comedy shows, The Ben Stiller Show did not use a studio audience or a laugh track. This was the only Fox sketch comedy program not to use a laugh track. The semi-spinoff, The Andy Dick Show, used the same format. After cancellation, the series won the 1993 Emmy Award for Outstanding Writing in a Variety Series. Featured Crew Ben Stiller Creator Judd Apatow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Janeane Garofalo Bob Odenkirk Andy Dick Ben Stiller Full Cast & Crew Last Season Season 1 1992 | 13 Episodes Season 1 of The Ben Stiller Show premiered on September 27, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1999-04-07 Strangers with Candy 7.0    1986-09-13 Pee-wee's Playhouse 7.9    1995-11-03 Mr. Show with Bob and David 8.1    2005-03-11 Wonder Showzen 7.4    2001-04-04 That's My Bush! 6.9    2004-11-14 Tom Goes to the Mayor 7.2    2007-02-11 Tim and Eric Awesome Show, Great Job! 7.4    1984-09-30 Tales from the Darkside 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}