{"link": "https://www.themoviedb.org/tv/67395?language=en", "title": "Tokyo Ravens", "resume": "Tsuchimikado Harutora was born into a prestigious Onmyoji family, but he can't see \"spirit energy\". Therefore, he's been enjoying a peaceful daily life with his friends at an Onmyo branch school. One day, his childhood friend Tsuchimikado Natsume, heir to the head family, suddenly appears. Will this cause his destiny spring into motion!?", "rate": 58, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67395   Expand Tokyo Ravens   (2013) User Score  Play Trailer Overview Tsuchimikado Harutora was born into a prestigious Onmyoji family, but he can't see \"spirit energy\". Therefore, he's been enjoying a peaceful daily life with his friends at an Onmyo branch school. One day, his childhood friend Tsuchimikado Natsume, heir to the head family, suddenly appears. Will this cause his destiny spring into motion!? Featured Crew Takaomi Kanasaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 24 Episodes Season 1 of Tokyo Ravens premiered on September  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  3 Posters  3 Recommendations   2015-04-05 Plastic Memories 6.8    2012-10-05 Blast of Tempest 7.7    2012-04-05 Sankarea: Undying Love 7.0    2016-04-05 Hundred 5.2    2012-04-10 Jormungand 7.4    2010-07-09 Shiki 6.7    2015-04-04 Seraph of the End 7.0    2005-10-05 Shakugan no Shana 6.7  Facts Original Name  東京レイヴンズ Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords fantasy magic romance anime Content Score 71 Just a little bit more... Top Contributors 38 Jenazad 13 WillofOwn 11 newlifes02 8 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}