{"link": "https://www.themoviedb.org/tv/34379?language=en", "title": "Rake", "resume": "Rake is an Australian television series, produced by Essential Media and Entertainment, that first aired on the Australian Broadcasting Corporation's ABC1 in 2010. It stars Richard Roxburgh as rake Cleaver Greene, a brilliant but self-destructive Sydney barrister. The show airs in the United States on DirecTV's Audience Network. The second season began on 6 September 2012. The Australian Broadcasting Corporation has also renewed the show for a third season\nEach episode entails Greene defending a different client.\nThe Fox Network in the USA has commissioned an American version of Rake, starring Greg Kinnear as the lead character, renamed Keegan Deane for American audiences.", "rate": 73, "genre": ["Drama", "Comedy"], "cast": ["Richard Roxburgh", "Matt Day", "Adrienne Pickering", "Russell Dykstra", "Danielle Cormack"], "character": ["Cleaver Greene", "David Potter", "Melissa Partridge", "Barney Meagher", "Scarlet Meagher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34379   Expand Rake   (2010) User Score  Play Trailer Overview Rake is an Australian television series, produced by Essential Media and Entertainment, that first aired on the Australian Broadcasting Corporation's ABC1 in 2010. It stars Richard Roxburgh as rake Cleaver Greene, a brilliant but self-destructive Sydney barrister. The show airs in the United States on DirecTV's Audience Network. The second season began on 6 September 2012. The Australian Broadcasting Corporation has also renewed the show for a third season Each episode entails Greene defending a different client. The Fox Network in the USA has commissioned an American version of Rake, starring Greg Kinnear as the lead character, renamed Keegan Deane for American audiences. Featured Crew Richard Roxburgh Creator Peter Duncan Creator Charles Waterstreet Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Roxburgh Cleaver Greene Matt Day David Potter Adrienne Pickering Melissa Partridge Russell Dykstra Barney Meagher Danielle Cormack Scarlet Meagher Full Cast & Crew Last Season Series 4 2016 | 8 Episodes Season 4 of Rake premiered on May 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2016-12-08 Cannabis 6.4    2012-06-26 Line of Duty 8.0    2011-04-03 The Killing 7.5  Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  55m Homepage   http://www.abc.net.au/tv/rake/default.htm Genres Drama Comedy Keywords australia self-destruction lawyer criminal defence lawyer Content Score 100 Yes! Looking good! Top Contributors 23 Banana 16 United600 7 rudely_murray 5 muku555  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}