{"link": "https://www.themoviedb.org/tv/47179?language=en", "title": "Gu Family Book", "resume": "Gu Family Book is a 2013 South Korean television series starring Lee Seung-gi and Suzy. The fusion martial arts action historical drama is about a half man-half monster who is searching for a centuries-old book that according to gumiho legend, contains the secret to becoming human. It aired on MBC from April 8 to June 25, 2013, on Mondays and Tuesdays at 21:55 for 24 episodes.", "rate": 89, "genre": ["Action", "Adventure", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Lee Seung-gi", "Bae Suzy", "Lee Sung-jae", "Sung Joon", "Yoo Yeon-seok"], "character": ["Choi Kang-chi", "Dam Yeo-wool", "Jo Gwan-woong", "Gon", "Park Tae-seo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47179   Expand Gu Family Book   (2013) User Score Overview Gu Family Book is a 2013 South Korean television series starring Lee Seung-gi and Suzy. The fusion martial arts action historical drama is about a half man-half monster who is searching for a centuries-old book that according to gumiho legend, contains the secret to becoming human. It aired on MBC from April 8 to June 25, 2013, on Mondays and Tuesdays at 21:55 for 24 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Seung-gi Choi Kang-chi Bae Suzy Dam Yeo-wool Lee Sung-jae Jo Gwan-woong Sung Joon Gon Yoo Yeon-seok Park Tae-seo Full Cast & Crew Last Season Season 1 2013 | 24 Episodes Season 1 of Gu Family Book premiered on April  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2014-05-05 Doctor Stranger 7.3    2010-08-30 Sungkyunkwan Scandal 7.7    2014-11-12 Pinocchio 7.4    2015-01-07 Kill Me, Heal Me 8.7    2010-11-13 Secret Garden 8.2  Facts Original Name  구가의 서 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/gufamilybook/ Genres Action & Adventure Comedy Sci-Fi & Fantasy Keywords korea Content Score 86 Almost there... Top Contributors M 28 Maria180493 24 Elizabeth Jennings CM 14 Cherche Moi z 12 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}