{"link": "https://www.themoviedb.org/tv/3889?language=en", "title": "Hillside", "resume": "Hillside (known as Fifteen in the United States) is a Canadian-American teen drama that aired on YTV in Canada from 1991 to 1993. Created and produced by John T. Binkley, the series was Nickelodeon's only teenage soap opera. The show was shot on videotape, similar to most daytime dramas.\nThe series was first conceived as Fifteen in an improvised form for The Disney Channel,  where a 13-episode pilot series was produced and tested in the U.S.  After Disney decided not to proceed with the project, Nickelodeon and  Canadian partners joined Binkley in producing the series which was known  in its first and second seasons as Hillside in Canada, and throughout the 65-episode run as Fifteen in the U.S. The show was subsequently syndicated around the world, with runs in Germany and Israel, among others.\nThe series features a large ensemble cast which underwent several changes over the show's four-season run. Notable cast members include Laura Harris, Enuka Okuma, and Ryan Reynolds.", "rate": 100, "genre": ["Drama"], "cast": ["Ryan Reynolds", "Enuka Okuma", "Pepper Binkley", "Chris William Martin", "Laura Harris"], "character": ["Billy Simpson", "Kelly", "Pepper O'Brien", "Dylan Blackwell", "Ashley Frasier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3889   Expand Hillside   (1991) User Score Overview Hillside (known as Fifteen in the United States) is a Canadian-American teen drama that aired on YTV in Canada from 1991 to 1993. Created and produced by John T. Binkley, the series was Nickelodeon's only teenage soap opera. The show was shot on videotape, similar to most daytime dramas. The series was first conceived as Fifteen in an improvised form for The Disney Channel,  where a 13-episode pilot series was produced and tested in the U.S.  After Disney decided not to proceed with the project, Nickelodeon and  Canadian partners joined Binkley in producing the series which was known  in its first and second seasons as Hillside in Canada, and throughout the 65-episode run as Fifteen in the U.S. The show was subsequently syndicated around the world, with runs in Germany and Israel, among others. The series features a large ensemble cast which underwent several changes over the show's four-season run. Notable cast members include Laura Harris, Enuka Okuma, and Ryan Reynolds. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Reynolds Billy Simpson Enuka Okuma Kelly Pepper Binkley Pepper O'Brien Chris William Martin Dylan Blackwell Laura Harris Ashley Frasier Full Cast & Crew Last Season Season 5 2004 | 17 Episodes Season 5 of Hillside premiered on October 13, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply d Greatest show ever... Open 0 by discostu004\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hillside. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.fifteentheseries.com Genres Drama Keywords high school teenager teen drama teen social issues Content Score 71 Just a little bit more... Top Contributors 19 Banana m 4 movieguy1776 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}