{"link": "https://www.themoviedb.org/tv/4422?language=en", "title": "The Big Comfy Couch", "resume": "The Big Comfy Couch is a Canadian children's television series about Loonette the Clown and her dolly Molly, who solve everyday problems on their \"Big Comfy Couch\". It aired from 1992 until early 2006. It was produced by Cheryl Wagner and Robert Mills, directed by Wayne Moss and Mills. It premiered on March 2, 1992 in Canada and in 1995 in the USA on public television stations across the country. There is also a Spanish version of the show titled, \"El Sofa de mi Imaginacion\". It also aired in the United Kingdom on GMTV's kids block.\nThe show's format revolves around Loonette the Clown, who lives with her dolly Molly on the eponymous Big Comfy Couch. Episodes are generally focused on a theme or a lesson. For example, Season 3's episode \"Full of Life\" explored the concepts of \"full\" and \"empty\", while \"Sticks and Stones\" dealt with name-calling and teasing.", "rate": 70, "genre": [], "cast": ["Bob Stutt", "Taborah Johnson", "Ramona Gilmour-Darling", "Alyson Court", "Bob Mills"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4422   Expand The Big Comfy Couch   (1993) User Score Overview The Big Comfy Couch is a Canadian children's television series about Loonette the Clown and her dolly Molly, who solve everyday problems on their \"Big Comfy Couch\". It aired from 1992 until early 2006. It was produced by Cheryl Wagner and Robert Mills, directed by Wayne Moss and Mills. It premiered on March 2, 1992 in Canada and in 1995 in the USA on public television stations across the country. There is also a Spanish version of the show titled, \"El Sofa de mi Imaginacion\". It also aired in the United Kingdom on GMTV's kids block. The show's format revolves around Loonette the Clown, who lives with her dolly Molly on the eponymous Big Comfy Couch. Episodes are generally focused on a theme or a lesson. For example, Season 3's episode \"Full of Life\" explored the concepts of \"full\" and \"empty\", while \"Sticks and Stones\" dealt with name-calling and teasing. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Stutt Taborah Johnson Ramona Gilmour-Darling Alyson Court Bob Mills Full Cast & Crew Last Season Season 6 2003 | 13 Episodes Season 6 of The Big Comfy Couch premiered on May  1, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1996-09-08 Blue's Clues 6.3    1992-08-15 Are You Afraid of the Dark? 7.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m, 26m Homepage   http://www.radsheep.com/couch.html Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}