{"link": "https://www.themoviedb.org/tv/15030?language=en", "title": "Secrets of the Dead", "resume": "Part detective story, part true-life drama, Secrets of the Dead investigators travel the globe unearthing evidence that throws fresh light on mysteries of the past. The PBS series is produced by WNET New York. The earliest programs are versions of shows originally produced in the UK and broadcast on Channel 4 starting in 1999. Those early shows purchased by PBS are indicated in the episode descriptions as (UK/PBS) and were re-edited, re-branded, and re-narrated by Americans. (PBS) indicates original PBS (thirteen/WNET) productions.\nEpisode topics have included the Titanic, D-Day, the Shroud of Turin, the Salem Witch Trials, Blackbeard's lost ship, and the first English translations of the Bible.\nPBS premiered the series in the United States on May 15, 2000, airing four programs in three days. Despite an irregular schedule, new episodes continue to air. Run time varies from episode to episode but are edited to fit into an hour time slot for PBS.", "rate": 73, "genre": ["Documentary", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15030   Expand Secrets of the Dead   (2000) User Score  Play Trailer Overview Part detective story, part true-life drama, Secrets of the Dead investigators travel the globe unearthing evidence that throws fresh light on mysteries of the past. The PBS series is produced by WNET New York. The earliest programs are versions of shows originally produced in the UK and broadcast on Channel 4 starting in 1999. Those early shows purchased by PBS are indicated in the episode descriptions as (UK/PBS) and were re-edited, re-branded, and re-narrated by Americans. (PBS) indicates original PBS (thirteen/WNET) productions. Episode topics have included the Titanic, D-Day, the Shroud of Turin, the Salem Witch Trials, Blackbeard's lost ship, and the first English translations of the Bible. PBS premiered the series in the United States on May 15, 2000, airing four programs in three days. Despite an irregular schedule, new episodes continue to air. Run time varies from episode to episode but are edited to fit into an hour time slot for PBS. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 17 2018 | 1 Episode Season 17 of Secrets of the Dead premiered on January 24, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Interesting ongoing PBS documentary series Open 0 by genplant29\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2005-03-06 Intervention 6.1    1974-03-03 NOVA 6.8  Facts Status  Returning Series Network Certification NR Meaning No rating information Type  Documentary Original Language  English Runtime  56m, 60m Homepage   http://www.pbs.org/wnet/secrets/ Genres Documentary Mystery Keywords research examination history mystery science Content Score 64 We're so close, yet so far. Top Contributors O 30 OldTimerToo 12 genplant29 11 Elizabeth Jennings b 8 bcshelton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}