{"link": "https://www.themoviedb.org/tv/2767?language=en", "title": "The Vicar of Dibley", "resume": "Reverend Granger is assigned as the Vicar of the rural parish of Dibley, but she is not quite what the villagers expected.", "rate": 73, "genre": ["Comedy"], "cast": ["Dawn French", "Emma Chambers", "Gary Waldhorn", "James Fleet", "Roger Lloyd Pack"], "character": ["Revd Geraldine Granger", "Alice Springs Horton (née Tinker)", "David Horton", "Hugo Horton", "Owen Newitt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2767   Expand The Vicar of Dibley   (1994) User Score Overview Reverend Granger is assigned as the Vicar of the rural parish of Dibley, but she is not quite what the villagers expected. Featured Crew Richard Curtis Creator Paul Mayhew-Archer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dawn French Revd Geraldine Granger Emma Chambers Alice Springs Horton (née Tinker) Gary Waldhorn David Horton James Fleet Hugo Horton Roger Lloyd Pack Owen Newitt Full Cast & Crew Last Season Season 4 2004 | 2 Episodes Season 4 of The Vicar of Dibley premiered on December 25, 2004. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Reverend Geraldine Granger: Happy Birthday Dawn French! Open 0 by wonder2wonder\n      \n     h the Vicar of Dibley Open 2 by  bratface Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   1999-01-08 Gimme Gimme Gimme 7.0    1987-03-09 French & Saunders 7.4    1976-02-20 Open All Hours 7.7    1998-11-12 Dinnerladies 6.4    1971-04-10 The Two Ronnies 9.0    1965-07-22 Till Death Us Do Part 7.2    1974-09-02 Rising Damp 7.8    2004-02-16 The Catherine Tate Show 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://bbc.co.uk/programmes/b006qgfj Genres Comedy Keywords village eccentric rural setting religion english countryside vicar sitcom british humour small community Content Score 93 Almost there... Top Contributors O 17 Ozbourne 10 Banana f 8 ftlocation m 3 morrison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}