{"link": "https://www.themoviedb.org/tv/4539?language=en", "title": "Kingpin", "resume": "Kingpin is an American crime drama television series which debuted on the NBC network in the U.S. and CTV in Canada on February 2, 2003 and lasted 6 episodes. NBC's answer to The Sopranos and also influenced by The Godfather, Macbeth and Traffik, the story was about a Mexican drug trafficker named Miguel Cadena and his family life. It was to be followed by a television series, but low ratings canceled those plans. Commercials for the mini-series on NBC featured the song \"Más\" by the Mexican band Kinky.", "rate": 69, "genre": ["Crime", "Drama"], "cast": ["Sheryl Lee", "Yancey Arias", "Bobby Cannavale", "Brian Benben", "Ruben Carbajal"], "character": ["Marlene McDillon Cadena", "Miguel Cadena", "Chato Cadena", "Dr. Heywood Klein"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4539   Expand Kingpin   (2003) User Score Overview Kingpin is an American crime drama television series which debuted on the NBC network in the U.S. and CTV in Canada on February 2, 2003 and lasted 6 episodes. NBC's answer to The Sopranos and also influenced by The Godfather, Macbeth and Traffik, the story was about a Mexican drug trafficker named Miguel Cadena and his family life. It was to be followed by a television series, but low ratings canceled those plans. Commercials for the mini-series on NBC featured the song \"Más\" by the Mexican band Kinky. Featured Crew David Mills Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sheryl Lee Marlene McDillon Cadena Yancey Arias Miguel Cadena Bobby Cannavale Chato Cadena Brian Benben Dr. Heywood Klein Ruben Carbajal Full Cast & Crew Last Season Season 1 2003 | 6 Episodes Season 1 of Kingpin premiered on February  2, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2002-09-29 Boomtown 8.4    2010-09-29 Law & Order: Los Angeles 4.6    2014-02-27 The Red Road 6.0    2005-12-04 Sleeper Cell 7.4    2002-11-14 Wire in the Blood 7.5    2006-03-07 The Unit 7.1    1990-04-19 Wings 6.7    2004-07-21 Rescue Me 7.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 50m Homepage  - Genres Crime Drama Keywords mexico mobster organized crime drug cartel miniseries drugs mexican mob family Content Score 93 Almost there... Top Contributors TB 25 TMDb Bot 14 Banana R 7 Rebecca 3 vadlefou  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}