{"link": "https://www.themoviedb.org/tv/5594?language=en", "title": "Battle B-Daman", "resume": "Battle B-Daman or Battle B'Daman is an anime and manga series by Eiji Inuki that first aired in January 2004 in Japan, replacing Beyblade in its timeslot. It premiered in the United States on April 2005. Like its predecessor, it is themed around an enhanced version of a children's schoolyard game – whereas Beyblade was based around spinning tops, Battle B-Daman is a dramatized version of marbles. It is the first show of the B-Daman series to be dubbed in English.\nIn Japan, it airs on TV Tokyo. In the United States, India it once aired on ABC Family and Toon Disney's JETIX block. At one point, as well as G4 in the USA, but on the latter was replaced by G.I. Joe Sigma 6 soon after. In Canada, it airs on YTV, in which on February 2007, the second season commenced with a completely new voice cast, and what some have called inferior dubbing from the first season; the French dub of the show airs on Télétoon. In the India, it airs on DD National and Zee TV and the first few episodes are currently available through DD Kashir TV on demand service. The toys were originally made by DD India and were released by Hasbro in United States.", "rate": 65, "genre": ["Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5594   Expand Battle B-Daman   (2005) User Score Overview Battle B-Daman or Battle B'Daman is an anime and manga series by Eiji Inuki that first aired in January 2004 in Japan, replacing Beyblade in its timeslot. It premiered in the United States on April 2005. Like its predecessor, it is themed around an enhanced version of a children's schoolyard game – whereas Beyblade was based around spinning tops, Battle B-Daman is a dramatized version of marbles. It is the first show of the B-Daman series to be dubbed in English. In Japan, it airs on TV Tokyo. In the United States, India it once aired on ABC Family and Toon Disney's JETIX block. At one point, as well as G4 in the USA, but on the latter was replaced by G.I. Joe Sigma 6 soon after. In Canada, it airs on YTV, in which on February 2007, the second season commenced with a completely new voice cast, and what some have called inferior dubbing from the first season; the French dub of the show airs on Télétoon. In the India, it airs on DD National and Zee TV and the first few episodes are currently available through DD Kashir TV on demand service. The toys were originally made by DD India and were released by Hasbro in United States. Featured Crew Mitsuo Hashimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 (Fire Spirits!) 2005 | 51 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Battle B-Daman. You can help by rating TV shows you've seen. Facts Original Name  B-伝説! バトルビーダマン Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors w 9 willemdek 4 IonutG b 2 benqen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}