{"link": "https://www.themoviedb.org/tv/66316?language=en", "title": "Feed the Beast", "resume": "For two friends on the brink of losing everything, a dusty pipe dream of opening up an upscale restaurant in their hometown of the Bronx is all they have left to turn their lives around. Together, they take on the insanity of the New York restaurant world, and navigate its underbelly of petty criminals, corrupt officials and violent mobsters.", "rate": 62, "genre": ["Drama"], "cast": ["David Schwimmer", "Jim Sturgess", "Michael Gladis", "Lorenza Izzo", "Elijah Jacob"], "character": ["Tommy Moran", "Dion Patras", "Patrick Woichik", "Pilar Herrera", "TJ Moran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66316   Expand Feed the Beast   (2016) User Score  Play Trailer Overview For two friends on the brink of losing everything, a dusty pipe dream of opening up an upscale restaurant in their hometown of the Bronx is all they have left to turn their lives around. Together, they take on the insanity of the New York restaurant world, and navigate its underbelly of petty criminals, corrupt officials and violent mobsters. Featured Crew Clyde Phillips Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Schwimmer Tommy Moran Jim Sturgess Dion Patras Michael Gladis Patrick Woichik Lorenza Izzo Pilar Herrera Elijah Jacob TJ Moran Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Feed the Beast premiered on June  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2018-03-25 Trust 7.4    2016-04-12 Game of Silence 4.3    2013-04-03 Rogue 7.1    2013-01-22 Banshee: Origins 8.9    2015-10-27 Wicked City 5.4    2017-11-05 SMILF 6.7    2016-03-07 Damien 6.5    2015-01-12 Eye Candy 5.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.amc.com/shows/feed-the-beast Genres Drama Keywords self-destruction restaurant restaurant owner grief mobster chef ex-con bronx, new york city Content Score 100 Yes! Looking good! Top Contributors 36 Elizabeth Jennings 29 Banana i 3 insomh57 ot 3 oding trump  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}