{"link": "https://www.themoviedb.org/tv/2823?language=en", "title": "Empty Nest", "resume": "Empty Nest is an American sitcom that originally aired on NBC from 1988 to 1995. The series was created as a spin-off of The Golden Girls by creator and producer Susan Harris. For its first three seasons, Empty Nest was one of the year's top 10 most-watched programs. It was produced by Witt/Thomas/Harris Productions in association with Touchstone Television.\nThe show concept borrowed some elements from the British comedy series Father, Dear Father, also featuring a father living with his two daughters and large dog. However, unlike that series, the two daughters in Empty Nest are self-supporting adults, and the lead character is a widower.\nEmpty Nest was part of NBC's Saturday night block of programming, and during its first four seasons it aired at 9:30pm ET, directly following The Golden Girls.\nTwo of the cast were alumni from one of Susan Harris' earlier shows, Soap; Mulligan was Manoff's father-in-law in Soap.", "rate": 52, "genre": ["Family", "Comedy"], "cast": ["Richard Mulligan", "Kristy McNichol", "Dinah Manoff", "Park Overall", "David Leisure"], "character": ["Dr. Harry Weston", "Barbara Weston", "Carol Weston", "LaVerne Todd", "Charley Dietz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2823   Expand Empty Nest   (1988) User Score Overview Empty Nest is an American sitcom that originally aired on NBC from 1988 to 1995. The series was created as a spin-off of The Golden Girls by creator and producer Susan Harris. For its first three seasons, Empty Nest was one of the year's top 10 most-watched programs. It was produced by Witt/Thomas/Harris Productions in association with Touchstone Television. The show concept borrowed some elements from the British comedy series Father, Dear Father, also featuring a father living with his two daughters and large dog. However, unlike that series, the two daughters in Empty Nest are self-supporting adults, and the lead character is a widower. Empty Nest was part of NBC's Saturday night block of programming, and during its first four seasons it aired at 9:30pm ET, directly following The Golden Girls. Two of the cast were alumni from one of Susan Harris' earlier shows, Soap; Mulligan was Manoff's father-in-law in Soap. Featured Crew Susan Harris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Mulligan Dr. Harry Weston Kristy McNichol Barbara Weston Dinah Manoff Carol Weston Park Overall LaVerne Todd David Leisure Charley Dietz Full Cast & Crew Last Season Season 7 1994 | 24 Episodes Season 7 of Empty Nest premiered on September 24, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Empty Nest. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1965-09-01 Gidget 5.2    1979-09-13 Benson 7.2    1969-09-17 The Courtship of Eddie's Father 6.2    1970-09-17 The Flip Wilson Show 3.7    1966-09-08 That Girl 6.7    1968-09-28 The Ghost & Mrs. Muir 6.7    1969-09-11 Room 222 5.8    1979-09-30 To the Manor Born 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Family Comedy Keywords nurse hospital doctor family coworker relationship sitcom pediatrician Content Score 93 Almost there... Top Contributors 19 Elizabeth Jennings 8 Banana LC 6 Legit Corporation R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}