{"link": "https://www.themoviedb.org/tv/65672?language=en", "title": "The Break", "resume": "The story is set in a small village in the Ardennes, where a young African footballer is found dead. If all clues lead first to suicide, a police officer just arrived from Brussels does not take long to discover that this is a murder.", "rate": 78, "genre": ["Drama", "Crime"], "cast": ["Guillaume Kerbusch", "Jasmina Douieb", "Sophie Maréchal", "Jean-Henri Compère", "Yoann Blanc"], "character": ["Sébastian Drummer", "Zoé Fisher", "Rudy Geeraerts", "Yoann Peeters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65672   Expand The Break   (2016) User Score  Play Trailer Overview The story is set in a small village in the Ardennes, where a young African footballer is found dead. If all clues lead first to suicide, a police officer just arrived from Brussels does not take long to discover that this is a murder. Featured Crew Matthieu Donck Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guillaume Kerbusch Sébastian Drummer Jasmina Douieb Sophie Maréchal Zoé Fisher Jean-Henri Compère Rudy Geeraerts Yoann Blanc Yoann Peeters Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of The Break premiered on February 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  4 Recommendations   2017-09-20 Tiempos de guerra 7.0    2015-09-08 Apaches 7.3    2015-01-10 My Sunshine 7.4    2016-12-08 The Cuba Libre Story 7.7    2016-07-05 Fangbone! 6.7    2015-09-12 Goldie & Bear 5.4    2016-06-02 El marginal 6.4    2014-02-23 Griselda Blanco: The Black Widow 6.2  Facts Original Name  La Trêve Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  French Runtime  - Homepage  - Genres Drama Crime Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 19 Network 6 inframundo10 v 6 vinil2004c@gmail.com 5 nycos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}