{"link": "https://www.themoviedb.org/tv/41468?language=en", "title": "Art Mann Presents", "resume": "Art Mann Presents is a reality travel show on AXS TV hosted by Art Mann. It features eclectic public party events and festivals in North America. Mann's persona is a straight-shooting \"everyman\" reporter who interviews colorful, often inebriated, characters he meets at the events. Art Mann Presents has aired on HDNet/AXS TV since February 2005.\nEvents visited have included Mardi Gras festivities in New Orleans and various other cities, Bay to Breakers, the Indianapolis 500, and tailgate parties at Jimmy Buffett concerts and other shows and sports events.\nThe network had also aired an uncensored late-night version of the show featuring ample female nudity, Art Mann Presents: Unrated, until HDNet became AXS TV in July, 2012, and in accordance with the network format changing to a more gender-neutral live entertainment focus, the explicit version was dropped from the schedule.\nNotable guest stars on the program have included Carmen Electra, Jesse Jane, Jessica Mathews, and Kimberly Fisher.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41468   Expand Art Mann Presents   (2005) User Score Overview Art Mann Presents is a reality travel show on AXS TV hosted by Art Mann. It features eclectic public party events and festivals in North America. Mann's persona is a straight-shooting \"everyman\" reporter who interviews colorful, often inebriated, characters he meets at the events. Art Mann Presents has aired on HDNet/AXS TV since February 2005. Events visited have included Mardi Gras festivities in New Orleans and various other cities, Bay to Breakers, the Indianapolis 500, and tailgate parties at Jimmy Buffett concerts and other shows and sports events. The network had also aired an uncensored late-night version of the show featuring ample female nudity, Art Mann Presents: Unrated, until HDNet became AXS TV in July, 2012, and in accordance with the network format changing to a more gender-neutral live entertainment focus, the explicit version was dropped from the schedule. Notable guest stars on the program have included Carmen Electra, Jesse Jane, Jessica Mathews, and Kimberly Fisher. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2013 | 24 Episodes Season 9 of Art Mann Presents premiered on January  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Art Mann Presents. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors z 5 zurman1 1 gianpoker TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}