{"link": "https://www.themoviedb.org/tv/57815?language=en", "title": "Ground Floor", "resume": "Brody, a young hot-shot banker at Whitestone Trust, thought he was just having a one-night stand with Jennifer, a beautiful woman he met at a bar. But when he discovers that she works in maintenance for the building where he works, their worlds begin to collide in the most unexpected way. Facing Brody’s critical boss, Mr. Mansfield, as well as annoyed colleagues, the pair must find a way to deal with their growing feelings for each other in this modern take on Romeo & Juliet.", "rate": 68, "genre": ["Comedy"], "cast": ["Skylar Astin", "John C. McGinley", "Briga Heelan", "Rory Scovel", "Rene Gube"], "character": ["Brody Carol Moyer", "Remington Stewart Mansfield", "Jenny Miller", "Mark \"Harvard\" Shrake", "Mike \"Threepeat\" Wen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57815   Expand Ground Floor   (2013) User Score  Play Trailer Overview Brody, a young hot-shot banker at Whitestone Trust, thought he was just having a one-night stand with Jennifer, a beautiful woman he met at a bar. But when he discovers that she works in maintenance for the building where he works, their worlds begin to collide in the most unexpected way. Facing Brody’s critical boss, Mr. Mansfield, as well as annoyed colleagues, the pair must find a way to deal with their growing feelings for each other in this modern take on Romeo & Juliet. Featured Crew Greg Malins Creator Bill Lawrence Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Skylar Astin Brody Carol Moyer John C. McGinley Remington Stewart Mansfield Briga Heelan Jenny Miller Rory Scovel Mark \"Harvard\" Shrake Rene Gube Mike \"Threepeat\" Wen Full Cast & Crew Last Season Season 2 2014 | 10 Episodes Season 2 of Ground Floor premiered on December  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2014-05-29 Undateable 6.2    2015-03-31 Weird Loners 5.8    2015-03-17 One Big Happy 6.0    2015-04-08 Your Family or Mine 4.6    2014-09-30 Manhattan Love Story 6.2    2014-07-17 Married 6.3    2014-06-04 Jennifer Falls 3.2    2011-11-30 The Exes 6.6  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  20m Homepage   http://www.tbs.com/shows/ground-floor.html Genres Comedy Keywords office job employer employee relationship office romance sitcom employment workplace comedy workplace romance Content Score 100 Yes! Looking good! Top Contributors 25 Elizabeth Jennings 8 dbowman 4 isavedtheday 4 du17  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}