{"link": "https://www.themoviedb.org/tv/45835?language=en", "title": "Mobile Suit Gundam AGE", "resume": "Mobile Suit Gundam AGE is a 2011 Japanese science fiction anime television series and the twelfth incarnation of Sunrise's long-running Gundam franchise. The series was first announced in the July issue of Shogakukan's CoroCoro Comic, and has gaming company Level-5's President Akihiro Hino in charge of the story.\nThis installment of the Gundam meta-series is set on a futuristic Earth plagued by an interplanetary war that spans a whole century. Its story revolves around three protagonists from the same family, each piloting his own version of the eponymous mecha, fighting to defend Earth and its space colonies from an enemy race far more advanced in terms of technology.\nThe series was officially unveiled by Bandai on June 13, 2011, during a special event at the 2011 Tokyo Toy Show. Gundam AGE premiered on the MBS and TBS broadcasting stations in Japan on October 9, 2011 and 49 episodes were broadcast, with the last episode on September 23, 2012. A compilation OVA titled Mobile Suit Gundam AGE: Memory of Eden will be released on July 26, 2013, focusing on the second protagonist of the series, Asemu Asuno.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Drama"], "cast": ["Toshiyuki Toyonaga", "Takuya Eguchi", "Kazutomi Yamamoto", "Ayumi Tsunematsu", "Aya Endo"], "character": ["Flit Asuno", "Asemu Asuno", "Kio Asuno", "Marina Asuno", "Emily Asuno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45835   Expand Mobile Suit Gundam AGE   (2011) User Score Overview Mobile Suit Gundam AGE is a 2011 Japanese science fiction anime television series and the twelfth incarnation of Sunrise's long-running Gundam franchise. The series was first announced in the July issue of Shogakukan's CoroCoro Comic, and has gaming company Level-5's President Akihiro Hino in charge of the story. This installment of the Gundam meta-series is set on a futuristic Earth plagued by an interplanetary war that spans a whole century. Its story revolves around three protagonists from the same family, each piloting his own version of the eponymous mecha, fighting to defend Earth and its space colonies from an enemy race far more advanced in terms of technology. The series was officially unveiled by Bandai on June 13, 2011, during a special event at the 2011 Tokyo Toy Show. Gundam AGE premiered on the MBS and TBS broadcasting stations in Japan on October 9, 2011 and 49 episodes were broadcast, with the last episode on September 23, 2012. A compilation OVA titled Mobile Suit Gundam AGE: Memory of Eden will be released on July 26, 2013, focusing on the second protagonist of the series, Asemu Asuno. Featured Crew Akihiro Hino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiyuki Toyonaga Flit Asuno Takuya Eguchi Asemu Asuno Kazutomi Yamamoto Kio Asuno Ayumi Tsunematsu Marina Asuno Aya Endo Emily Asuno Full Cast & Crew Last Season Season 1 2011 | 49 Episodes Season 1 of Mobile Suit Gundam AGE premiered on October  9, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam AGE. You can help by rating TV shows you've seen. Facts Original Name  機動戦士 ガンダム AGE Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.gundam-age.net/ Genres Animation Action & Adventure Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 14 BrerFox m 3 magoozin 3 forumi0721 w 3 wyxslh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}