{"link": "https://www.themoviedb.org/tv/4261?language=en", "title": "Blankety Blank", "resume": "Blankety Blank is a British comedy game show based on the 1977–9 Australian game show Blankety Blanks.\nThe British version ran from 18 January 1979 to 12 March 1990 on BBC One, hosted first by Terry Wogan and later by Les Dawson. Regular members of the celebrity panel on this version included Kenny Everett, Lorraine Chase, Gareth Hunt, Gary Davies, and Cheryl Baker.\nA revival fronted by Lily Savage was produced by the BBC from 26 December 1997 to 28 December 1999, followed by ITV from 7 January 2001 to 10 August 2002. This version was produced by Grundy, then Thames.", "rate": 60, "genre": ["Comedy"], "cast": ["Terry Wogan", "Paul O'Grady", "Les Dawson", "Carol Vorderman", "David Walliams"], "character": ["Lily Savage"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4261   Expand Blankety Blank   (1979) User Score Overview Blankety Blank is a British comedy game show based on the 1977–9 Australian game show Blankety Blanks. The British version ran from 18 January 1979 to 12 March 1990 on BBC One, hosted first by Terry Wogan and later by Les Dawson. Regular members of the celebrity panel on this version included Kenny Everett, Lorraine Chase, Gareth Hunt, Gary Davies, and Cheryl Baker. A revival fronted by Lily Savage was produced by the BBC from 26 December 1997 to 28 December 1999, followed by ITV from 7 January 2001 to 10 August 2002. This version was produced by Grundy, then Thames. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Terry Wogan Paul O'Grady Lily Savage Les Dawson Carol Vorderman David Walliams Full Cast & Crew Last Season Season 14 1999 | 13 Episodes Season 14 of Blankety Blank premiered on June 26, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blankety Blank. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors G 2 Gero  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}