{"link": "https://www.themoviedb.org/tv/62516?language=en", "title": "Flesh and Bone", "resume": "Claire, a talented but emotionally troubled dancer, joins a company in New York City, and soon finds herself immersed in the tough and often cutthroat world of professional ballet. The dark and gritty series will unflinchingly explore the dysfunction and glamour of the ballet world.", "rate": 72, "genre": ["Drama"], "cast": ["Sarah Hay", "Irina Dvorovenko", "Raychel Diane Weiner", "Emily Tyra", "Ben Daniels"], "character": ["Claire Robbins", "Kiira", "Daphne", "Mia Bialy", "Paul"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62516   Expand Flesh and Bone   (2015) User Score Overview Claire, a talented but emotionally troubled dancer, joins a company in New York City, and soon finds herself immersed in the tough and often cutthroat world of professional ballet. The dark and gritty series will unflinchingly explore the dysfunction and glamour of the ballet world. Featured Crew Moira Walley-Beckett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Hay Claire Robbins Irina Dvorovenko Kiira Raychel Diane Weiner Daphne Emily Tyra Mia Bialy Ben Daniels Paul Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Flesh and Bone premiered on November  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2012-06-11 Bunheads 6.4    2015-11-04 Good Girls Revolt 7.8    2015-10-27 Wicked City 5.4    2013-03-17 In the Flesh 7.4    2015-09-27 Blood & Oil 6.4    2016-04-10 The Girlfriend Experience 5.5    2014-04-24 Black Box 6.4    2017-06-04 I'm Dying Up Here 6.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.starz.com/originals/fleshandbone Genres Drama Keywords new york dance dancer ballet new york city Content Score 93 Almost there... Top Contributors 54 Elizabeth Jennings TB 11 TMDb Bot C 9 Cataloguer 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}