{"link": "https://www.themoviedb.org/tv/17385?language=en", "title": "The Unusuals", "resume": "The Unusuals is a comedy-drama television series that aired on ABC from April 8 to June 17, 2009 in the U.S. and Global in Canada. The pilot and first episode were written by Noah Hawley, a former writer and producer for Fox's Bones. An ABC press release described The Unusuals as \"like a modern-day MAS*H\" that \"explores both the grounded drama and comic insanity of the world of New York City police detectives, where every cop has a secret\". Its premise elaborated:\nThe initial series order was for 10 episodes. Show creator Noah Hawley announced via his Twitter account in mid-May 2009 that ABC would not be bringing the show back for a second season.", "rate": 77, "genre": ["Drama", "Comedy"], "cast": ["Amber Tamblyn", "Jeremy Renner", "Harold Perrineau", "Adam Goldberg", "Joshua Close"], "character": ["Detective Casey Shraeger", "Detective Jason Walsh", "Detective Leo Banks", "Detective Eric Delahoy", "Detective Henry Cole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17385   Expand The Unusuals   (2009) User Score  Play Trailer Overview The Unusuals is a comedy-drama television series that aired on ABC from April 8 to June 17, 2009 in the U.S. and Global in Canada. The pilot and first episode were written by Noah Hawley, a former writer and producer for Fox's Bones. An ABC press release described The Unusuals as \"like a modern-day M A S*H\" that \"explores both the grounded drama and comic insanity of the world of New York City police detectives, where every cop has a secret\". Its premise elaborated: The initial series order was for 10 episodes. Show creator Noah Hawley announced via his Twitter account in mid-May 2009 that ABC would not be bringing the show back for a second season. Featured Crew Noah Hawley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amber Tamblyn Detective Casey Shraeger Jeremy Renner Detective Jason Walsh Harold Perrineau Detective Leo Banks Adam Goldberg Detective Eric Delahoy Joshua Close Detective Henry Cole Full Cast & Crew Last Season Season 1 2009 | 10 Episodes Season 1 of The Unusuals premiered on April  8, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2010-09-21 Detroit 1-8-7 7.2    2007-05-10 Traveler 6.9    2010-05-19 The Good Guys 7.9    2011-04-01 CHAOS 6.7    2011-05-05 The Shadow Line 8.1    2007-10-12 Women's Murder Club 6.8    2016-09-25 Nobel 8.5    2011-01-20 Fairly Legal 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage   http://abc.go.com/primetime/theunusuals Genres Drama Comedy Keywords police detective nypd police precinct Content Score 100 Yes! Looking good! Top Contributors 3 9 38956 5 Maurizio Merli M 4 Marc D 3 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}