{"link": "https://www.themoviedb.org/tv/11693?language=en", "title": "Sheena", "resume": "Sheena is an American action-adventure/fantasy television series which was produced for first-run syndication from 2000 to 2002.\nBased upon the comic book character Sheena, Queen of the Jungle, which previously spawned a popular 1950s TV series of the same title, the 2000s series updated the character to the 21st century. There were two seasons, containing 22 and 13 episodes. It starred Gena Lee Nolin and John Allen Nelson and was developed for television by Douglas Schwartz and Steven L. Sears. In this version Sheena was given the mystical ability to transform into almost any jungle animal. Several episodes from the first season are available to view for free in Minisode format on Crackle, as well as on Hulu.\nSheena's parents were archaeologists who died in the jungle when she was about six years old, leaving their daughter Shirley Hamilton. She was taken in by Kali, a local Shamaness of a tribe who brought her up, and five years ago she was taught how to morph into animals and birds, acquiring their abilities, even flight. Further, she became a mythical creature called \"The Darachna\" who relies on people' fear of the unknown. For this she covers herself in a dark liquid mud which allows her to be largely unseen in the low light of the jungle, and with more than normal strength, agility and speed, and armed with a pair of gloves with bone claws, she is a formidable one woman fighting force. She does kill sometimes.", "rate": 50, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Gena Lee Nolin", "John Allen Nelson", "Margo Moorer"], "character": ["Sheena"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11693   Expand Sheena   (2000) User Score Overview Sheena is an American action-adventure/fantasy television series which was produced for first-run syndication from 2000 to 2002. Based upon the comic book character Sheena, Queen of the Jungle, which previously spawned a popular 1950s TV series of the same title, the 2000s series updated the character to the 21st century. There were two seasons, containing 22 and 13 episodes. It starred Gena Lee Nolin and John Allen Nelson and was developed for television by Douglas Schwartz and Steven L. Sears. In this version Sheena was given the mystical ability to transform into almost any jungle animal. Several episodes from the first season are available to view for free in Minisode format on Crackle, as well as on Hulu. Sheena's parents were archaeologists who died in the jungle when she was about six years old, leaving their daughter Shirley Hamilton. She was taken in by Kali, a local Shamaness of a tribe who brought her up, and five years ago she was taught how to morph into animals and birds, acquiring their abilities, even flight. Further, she became a mythical creature called \"The Darachna\" who relies on people' fear of the unknown. For this she covers herself in a dark liquid mud which allows her to be largely unseen in the low light of the jungle, and with more than normal strength, agility and speed, and armed with a pair of gloves with bone claws, she is a formidable one woman fighting force. She does kill sometimes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gena Lee Nolin Sheena John Allen Nelson Margo Moorer Full Cast & Crew Last Season Season 2 2001 | 13 Episodes Season 2 of Sheena premiered on October  6, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Sheena. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords strong woman africa feral child based on comic jungle orphan turns into animal wild Content Score 56 We're so close, yet so far. Top Contributors 36 Banana H 5 Halima k 4 khiladi s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}