{"link": "https://www.themoviedb.org/tv/20169?language=en", "title": "H", "resume": "H is a French sitcom with seventy-one, 22-minute episodes. The series was created by Abd-el-Kader Aoun, Xavier Matthew and Éric Judor, and produced by Phillippe Berthe, Édouard Molinaro, Jean-Luc Moreau and Charles Némès. It ran from 24 October 1998 to 20 April 2002 on Canal+. In Canada, it is shown weekly on TV5.\nThe title \"H\" comes from the three words that characterize the series: Humour, Histoire et Hôpital.", "rate": 76, "genre": ["Comedy"], "cast": ["Eric Judor", "Ramzy Bedia", "Sophie Mounicot", "Jamel Debbouze", "Catherine Benguigui"], "character": ["Aymé Cesaire", "Sabri Said", "Clara Saulnier", "Jamel Dridi", "Béatrice Goldberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20169   Expand H   (1998) User Score Overview H is a French sitcom with seventy-one, 22-minute episodes. The series was created by Abd-el-Kader Aoun, Xavier Matthew and Éric Judor, and produced by Phillippe Berthe, Édouard Molinaro, Jean-Luc Moreau and Charles Némès. It ran from 24 October 1998 to 20 April 2002 on Canal+. In Canada, it is shown weekly on TV5. The title \"H\" comes from the three words that characterize the series: Humour, Histoire et Hôpital. Featured Crew Kader Aoun Creator Eric Judor Creator Xavier Matthieu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Judor Aymé Cesaire Ramzy Bedia Sabri Said Sophie Mounicot Clara Saulnier Jamel Debbouze Jamel Dridi Catherine Benguigui Béatrice Goldberg Full Cast & Crew Last Season Season 4 2002 | 11 Episodes Season 4 of H premiered on January 26, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2008-10-25 Hero Corp 6.8    2005-01-03 Kaamelott 8.0    2003-07-22 Nip/Tuck 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 11 ParaFoxTv 4 fyutins S 3 SHADE02 2 Olivier  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}