{"link": "https://www.themoviedb.org/tv/5283?language=en", "title": "Max Steel", "resume": "Max Steel is a science fiction–action, CGI, animated series which originally aired from February 25, 2000 to January 15, 2002, based on the Mattel action-figure of the same name. Max Steel ran for three seasons, totaling thirty-five episodes with a predicted audience of young males from the ages of eight to twelve. From 2004-2012, direct-to-DVD movies kept the presence of the main character alive. However, the first movie was the only movie to keep the continuity of the series. After Endangered Species, the continuity was altered. \"Endangered Species\" was the only movie to be made available in America, while later releases were in Latin America. The voice-acting cast for the series included such people as Chi McBride and Christian Campbell, the older brother of Neve Campbell, as well as well-known sports stars, such as Tony Hawk.\nAfter the bankruptcy of Netter Digital and Foundation Imaging, Mainframe Entertainment took over the productions of the third season and the movies. The last episode, \"Truth Be Told\", aired January 15, 2002. Max Steel was the first computer-generated series to air on Kids' WB.\nA reboot currently airs on Disney XD. However, characters and storylines have been either altered or taken away entirely.", "rate": 62, "genre": ["Animation"], "cast": ["Chi McBride", "Mae Whitman", "Jacob Vargas", "Keith Szarabajka", "Debi Mae West"], "character": ["Jefferson Smith", "Dr. Roberto Martinez", "Luke DeMarco", "Kat"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5283   Expand Max Steel   (2000) User Score Overview Max Steel is a science fiction–action, CGI, animated series which originally aired from February 25, 2000 to January 15, 2002, based on the Mattel action-figure of the same name. Max Steel ran for three seasons, totaling thirty-five episodes with a predicted audience of young males from the ages of eight to twelve. From 2004-2012, direct-to-DVD movies kept the presence of the main character alive. However, the first movie was the only movie to keep the continuity of the series. After Endangered Species, the continuity was altered. \"Endangered Species\" was the only movie to be made available in America, while later releases were in Latin America. The voice-acting cast for the series included such people as Chi McBride and Christian Campbell, the older brother of Neve Campbell, as well as well-known sports stars, such as Tony Hawk. After the bankruptcy of Netter Digital and Foundation Imaging, Mainframe Entertainment took over the productions of the third season and the movies. The last episode, \"Truth Be Told\", aired January 15, 2002. Max Steel was the first computer-generated series to air on Kids' WB. A reboot currently airs on Disney XD. However, characters and storylines have been either altered or taken away entirely. Featured Crew Greg Weisman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chi McBride Jefferson Smith Mae Whitman Jacob Vargas Dr. Roberto Martinez Keith Szarabajka Luke DeMarco Debi Mae West Kat Full Cast & Crew Last Season Season 3 2001 | 9 Episodes Season 3 of Max Steel premiered on November 12, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Max Steel. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 30m Homepage   http://disneyxd.disney.com/max-steel Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors e 3 error666 TB 2 TMDb Bot 2 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}