{"link": "https://www.themoviedb.org/tv/52698?language=en", "title": "The Very Big Boss", "resume": "The mayor of Al-Mazareeta, earlier in his life, he met an American woman and had twins with her. One child stayed in Egypt while the other went to America . Once he is on his deathbed, his child that grew up in America goes over to Egypt to claim his father's title. The sons battle to see who will take over, but eventually they realize the value of family, and go through challenges together", "rate": 0, "genre": ["Comedy"], "cast": ["Donia Samir Ghanem", "Ahmed Mekky", "Hesham Ismail", "Bayoumi Fouad", "Mohamed Sallam"], "character": ["Hadia", "Al Kabeer", "Fazaa", "Dr. Rabee", "Hagras"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52698   Expand The Very Big Boss   (2010) User Score  Play Trailer Overview The mayor of Al-Mazareeta, earlier in his life, he met an American woman and had twins with her. One child stayed in Egypt while the other went to America . Once he is on his deathbed, his child that grew up in America goes over to Egypt to claim his father's title. The sons battle to see who will take over, but eventually they realize the value of family, and go through challenges together Featured Crew Ahmed Mekky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Donia Samir Ghanem Hadia Ahmed Mekky Al Kabeer Hesham Ismail Fazaa Bayoumi Fouad Dr. Rabee Mohamed Sallam Hagras Full Cast & Crew Last Season Season 5 2015 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Very Big Boss. You can help by rating TV shows you've seen. Facts Original Name  الكبير أوي Status  Ended Network Certification  - Type  Scripted Original Language  Arabic Runtime  30m, 45m, 20m Homepage  - Genres Comedy Keywords brother brotherhood twins family Content Score 100 Yes! Looking good! Top Contributors 81 Mustafa 8 Banana TB 2 TMDb Bot 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}