{"link": "https://www.themoviedb.org/tv/72380?language=en", "title": "Pulse", "resume": "When successful high-flier Frankie Bell is brought crashing to earth by chronic kidney failure she targets an alternate future. Eight years on she is in her second year as a practicing doctor starting her first day in a Renal rotation. Driven to use her second chance to save others, Frankie must confront an ailing health system, and face her toughest challenge - learning to let go.", "rate": 44, "genre": ["Drama"], "cast": ["Claire van der Boom", "Andrea Demetriades", "Owen Teale", "Liam McIntyre", "Arka Das"], "character": ["Frankie Bell", "Lou Tannis", "Chad Berger", "Eli Nader", "Tabb Patel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72380   Expand Pulse   (2017) User Score  Play Trailer Overview When successful high-flier Frankie Bell is brought crashing to earth by chronic kidney failure she targets an alternate future. Eight years on she is in her second year as a practicing doctor starting her first day in a Renal rotation. Driven to use her second chance to save others, Frankie must confront an ailing health system, and face her toughest challenge - learning to let go. Featured Crew Kris Wyld Creator Mel Hill Creator Michael Miller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claire van der Boom Frankie Bell Andrea Demetriades Lou Tannis Owen Teale Chad Berger Liam McIntyre Eli Nader Arka Das Tabb Patel Full Cast & Crew Last Season Series 1 2017 | 8 Episodes Season 1 of Pulse premiered on July 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pulse. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  56m Homepage   http://www.abc.net.au/tv/programs/pulse/ Genres Drama Keywords medical drama Content Score 100 Yes! Looking good! Top Contributors 42 United600 7 Elizabeth Jennings w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}