{"link": "https://www.themoviedb.org/tv/2574?language=en", "title": "Bosom Buddies", "resume": "Bosom Buddies is an American sitcom starring Tom Hanks and Peter Scolari created by Robert L. Boyett, Thomas L. Miller and Chris Thompson. It ran from 1980 to 1982 on ABC and in reruns in the summer of 1984 on NBC. The show features the misadventures of two single men, working in creative advertising, struggling in their industry while disguising themselves as women in order to live in the one apartment they could afford. Gender stereotypes and male/female interpersonal relationships were frequent themes.\nThe show became known for its quirky humor and its frequent use of improvisation, especially between stars Hanks and Scolari. Though the show started out with good ratings, it failed to hold the public's interest and was canceled after two seasons.", "rate": 67, "genre": ["Comedy"], "cast": ["Tom Hanks", "Peter Scolari", "Donna Dixon", "Telma Hopkins", "Wendie Jo Sperber"], "character": ["Buffy Wilson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2574   Expand Bosom Buddies   (1980) User Score Overview Bosom Buddies is an American sitcom starring Tom Hanks and Peter Scolari created by Robert L. Boyett, Thomas L. Miller and Chris Thompson. It ran from 1980 to 1982 on ABC and in reruns in the summer of 1984 on NBC. The show features the misadventures of two single men, working in creative advertising, struggling in their industry while disguising themselves as women in order to live in the one apartment they could afford. Gender stereotypes and male/female interpersonal relationships were frequent themes. The show became known for its quirky humor and its frequent use of improvisation, especially between stars Hanks and Scolari. Though the show started out with good ratings, it failed to hold the public's interest and was canceled after two seasons. Featured Crew Chris Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Hanks Buffy Wilson Peter Scolari Donna Dixon Telma Hopkins Wendie Jo Sperber Full Cast & Crew Last Season Season 2 1981 | 19 Episodes Season 2 of Bosom Buddies premiered on October  8, 1981. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply St How many of you 'Forrest Gump' fans know about THIS? Open 3 by  Patty Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1996-09-16 Cosby 7.3    1986-09-29 Designing Women 7.3    1982-09-25 Silver Spoons 5.1    1995-09-21 Caroline in the City 6.7    1981-10-29 Gimme a Break! 5.7    1967-09-11 The Carol Burnett Show 7.8    1987-09-29 thirtysomething 7.4    1983-09-16 Webster 4.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords cross dressing advertising agency sitcom men disguised as women Content Score 93 Almost there... Top Contributors 8 Banana 3 Zlogorek S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}