{"link": "https://www.themoviedb.org/tv/2650?language=en", "title": "The Centurions", "resume": "Centurions is a syndicated 30 minute American science fiction animated television series produced by Ruby-Spears and animated in Japan by Sunrise. Comic book legends Jack Kirby and Gil Kane contributed to the design and concepts of the show.\nThe series began in 1986 as a five-part miniseries and was followed with a 60 episode series. The series was story edited by Ted Pedersen and written by several authors, including prolific science fiction writers Michael Reaves, Marc Scott Zicree, Larry DiTillio and Gerry Conway. The series theme and soundtrack were composed by Udi Harpaz. There was also a line of tie-in toys by Kenner, and a comic book series by DC Comics.", "rate": 80, "genre": ["Animation", "Kids"], "cast": ["Diane Pershing", "Pat Fraley", "Vince Edwards"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2650   Expand The Centurions   (1986) User Score Overview Centurions is a syndicated 30 minute American science fiction animated television series produced by Ruby-Spears and animated in Japan by Sunrise. Comic book legends Jack Kirby and Gil Kane contributed to the design and concepts of the show. The series began in 1986 as a five-part miniseries and was followed with a 60 episode series. The series was story edited by Ted Pedersen and written by several authors, including prolific science fiction writers Michael Reaves, Marc Scott Zicree, Larry DiTillio and Gerry Conway. The series theme and soundtrack were composed by Udi Harpaz. There was also a line of tie-in toys by Kenner, and a comic book series by DC Comics. Featured Crew Ruby-Spears Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diane Pershing Pat Fraley Vince Edwards Full Cast & Crew Last Season Season 1 1986 | 65 Episodes Season 1 of The Centurions premiered on April  7, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   1986-09-08 SilverHawks 7.1    1966-09-10 Space Ghost and Dino Boy 7.2  Facts Status  Ended Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Kids Keywords centurions Content Score 64 We're so close, yet so far. Top Contributors 34 Robson Guedes Vieira 8 Elizabeth Jennings TB 4 TMDb Bot 1 irkillroy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}