{"link": "https://www.themoviedb.org/tv/7998?language=en", "title": "Hole in the Wall", "resume": "Hole in the Wall was a game show that aired on BBC One in the United Kingdom. This game was an adaptation of the Japanese game Brain Wall in which, players must contort themselves to fit through cutout holes of varying shapes in a large polystyrene wall moving towards them as they stand in front of a swimming pool. Each week, two teams of television personalities compete for £10,000 in prize money to be donated to their chosen charity.\nDale Winton served as the original host while Strictly Come Dancing ballroom dancer Anton du Beke and former international cricketer Darren Gough were the team captains for the first series. Additionally, Jonathan Pearce comments on the replays and Peter Dickson provides the opening voice-over. The wall is activated by the presenter shouting Bring on the wall!.\nOn 3 July 2008, the BBC announced that the show had been commissioned for BBC One. A second series was confirmed, with Anton du Beke giving up his captain role to take over from Dale Winton as host, and new team captains in the shape of former rugby player Austin Healey and actor Joe Swash. Anton du Beke has announced he may be a guest as well as hosting on the last show of the series.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7998   Expand Hole in the Wall   (2008) User Score Overview Hole in the Wall was a game show that aired on BBC One in the United Kingdom. This game was an adaptation of the Japanese game Brain Wall in which, players must contort themselves to fit through cutout holes of varying shapes in a large polystyrene wall moving towards them as they stand in front of a swimming pool. Each week, two teams of television personalities compete for £10,000 in prize money to be donated to their chosen charity. Dale Winton served as the original host while Strictly Come Dancing ballroom dancer Anton du Beke and former international cricketer Darren Gough were the team captains for the first series. Additionally, Jonathan Pearce comments on the replays and Peter Dickson provides the opening voice-over. The wall is activated by the presenter shouting Bring on the wall!. On 3 July 2008, the BBC announced that the show had been commissioned for BBC One. A second series was confirmed, with Anton du Beke giving up his captain role to take over from Dale Winton as host, and new team captains in the shape of former rugby player Austin Healey and actor Joe Swash. Anton du Beke has announced he may be a guest as well as hosting on the last show of the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2011 | 23 Episodes Season 3 of Hole in the Wall premiered on April 18, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hole in the Wall. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00dr78v Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 9 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}