{"link": "https://www.themoviedb.org/tv/63187?language=en", "title": "Monster Musume: Everyday Life with Monster Girls", "resume": "Three years ago, the world learned that harpies, centaurs, catgirls, and all manners of fabulous creatures are not merely fiction; they are flesh and blood - not to mention scale, feather, horn, and fang. Thanks to the \"Cultural Exchange Between Species Act,\" these once-mythical creatures have assimilated into society, or at least, they're trying. When a hapless human teenager named Kurusu Kimihito is inducted as a \"volunteer\" into the government exchange program, his world is turned upside down. A snake-like lamia named Miia comes to live with him, and it is Kurusu's job to take care of her and make sure she integrates into his everyday life.", "rate": 85, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Natsuki Aikawa", "Junji Majima", "Sora Amamiya", "Ari Ozawa", "Yu Kobayashi"], "character": ["Cerea", "Kimihito Kurusu", "Miia", "Papi", "Smith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63187   Expand Monster Musume: Everyday Life with Monster Girls   (2017) User Score  Play Trailer Overview Three years ago, the world learned that harpies, centaurs, catgirls, and all manners of fabulous creatures are not merely fiction; they are flesh and blood - not to mention scale, feather, horn, and fang. Thanks to the \"Cultural Exchange Between Species Act,\" these once-mythical creatures have assimilated into society, or at least, they're trying. When a hapless human teenager named Kurusu Kimihito is inducted as a \"volunteer\" into the government exchange program, his world is turned upside down. A snake-like lamia named Miia comes to live with him, and it is Kurusu's job to take care of her and make sure she integrates into his everyday life. Featured Crew Tatsuya Yoshihara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natsuki Aikawa Cerea Junji Majima Kimihito Kurusu Sora Amamiya Miia Ari Ozawa Papi Yu Kobayashi Smith Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Monster Musume: Everyday Life with Monster Girls premiered on June 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2010-01-05 Ladies versus Butlers! 10.0    2014-07-06 Monthly Girls' Nozaki-kun 7.7    2014-04-09 Chaika - The Coffin Princess 8.2    2017-07-04 AHO-GIRL 9.0    2008-10-04 A Certain Magical Index 7.4    2015-10-03 Chivalry of a Failed Knight 7.9    2005-04-17 Eureka Seven 7.7    2012-07-06 Aesthetica of a Rogue Hero 7.1  Facts Original Name  モンスター娘のいる日常 Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.monmusu.tv/ Genres Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 37 BrerFox G 15 G_90 11 Jenazad 8 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}