{"link": "https://www.themoviedb.org/tv/2401?language=en", "title": "Chain Letters", "resume": "Chain Letters was a British television game show produced by Tyne Tees. The show was filmed at their City Road studios in Newcastle Upon Tyne and first broadcast on ITV in the United Kingdom from 7 September 1987 to 6 July 1990, then again from 2 January 1995 to 25 April 1997.\nThree contestants competed to win money by changing letters in words to form new words. Its original host was the late Jeremy Beadle, followed by Andrew O'Connor, Allan Stewart, Ted Robbins, Vince Henderson and Dave Spikey.", "rate": 0, "genre": [], "cast": ["Ted Robbins", "Andrew O'Connor", "Jeremy Beadle"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2401   Expand Chain Letters   (1987) User Score Overview Chain Letters was a British television game show produced by Tyne Tees. The show was filmed at their City Road studios in Newcastle Upon Tyne and first broadcast on ITV in the United Kingdom from 7 September 1987 to 6 July 1990, then again from 2 January 1995 to 25 April 1997. Three contestants competed to win money by changing letters in words to form new words. Its original host was the late Jeremy Beadle, followed by Andrew O'Connor, Allan Stewart, Ted Robbins, Vince Henderson and Dave Spikey. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ted Robbins Andrew O'Connor Jeremy Beadle Full Cast & Crew Last Season Season 7 1997 | 39 Episodes Season 7 of Chain Letters premiered on March  3, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chain Letters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords game show Content Score 50 Still needs a little work. Top Contributors 5 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}