{"link": "https://www.themoviedb.org/tv/12751?language=en", "title": "Automan", "resume": "Automan is an American science fiction superhero television series produced by Glen A. Larson. It aired for only 12 episodes on ABC between 1983 and 1984.", "rate": 72, "genre": [], "cast": ["Robert Lansing", "Gerald S. O'Loughlin", "Heather McNair", "Chuck Wagner", "Desi Arnaz Jr."], "character": ["Lt. Jack Curtis", "Cpt. E.G. Boyd", "Roxanne Caldwell", "Automan", "Walter Nebicher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12751   Expand Automan   (1983) User Score  Play Trailer Overview Automan is an American science fiction superhero television series produced by Glen A. Larson. It aired for only 12 episodes on ABC between 1983 and 1984. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Lansing Lt. Jack Curtis Gerald S. O'Loughlin Cpt. E.G. Boyd Heather McNair Roxanne Caldwell Chuck Wagner Automan Desi Arnaz Jr. Walter Nebicher Full Cast & Crew Last Season Season 1 1983 | 13 Episodes Season 1 of Automan premiered on December 15, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   1979-09-20 Buck Rogers in the 25th Century 6.9    1985-01-04 Street Hawk 6.0    1998-09-25 The Crow: Stairway to Heaven 6.4    1977-09-15 CHiPs 6.1    1974-01-18 The Six Million Dollar Man 6.6    1978-03-10 The Incredible Hulk 6.4    1976-01-14 The Bionic Woman 6.2    2008-09-24 Knight Rider 5.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors d 16 denis LF 15 Luis Fernandes a 5 adltata t 3 taldeitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}