{"link": "https://www.themoviedb.org/tv/826?language=en", "title": "NBC Nightly News", "resume": "NBC Nightly News is the flagship daily evening television news program for NBC News, the news division of the NBC television network in the United States, and is the #1-rated newscast in America. NBC Nightly News is produced from Studio 3B at NBC Studios at 30 Rockefeller Center in New York City.\nSince 2015, the broadcast has been anchored by Lester Holt on weeknights, José Díaz-Balart on Saturday and Kate Snow on Sunday. On weeknights, it is broadcast live over most NBC stations from 6:30-7:00 p.m. Eastern and occasionally updated for Pacific Time Zone viewers in a \"Western Edition\". Its current theme music was composed by John Williams.", "rate": 64, "genre": ["News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 826   Expand NBC Nightly News   (1970) User Score Overview NBC Nightly News is the flagship daily evening television news program for NBC News, the news division of the NBC television network in the United States, and is the #1-rated newscast in America. NBC Nightly News is produced from Studio 3B at NBC Studios at 30 Rockefeller Center in New York City. Since 2015, the broadcast has been anchored by Lester Holt on weeknights, José Díaz-Balart on Saturday and Kate Snow on Sunday. On weeknights, it is broadcast live over most NBC stations from 6:30-7:00 p.m. Eastern and occasionally updated for Pacific Time Zone viewers in a \"Western Edition\". Its current theme music was composed by John Williams. Featured Crew Reuven Frank Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season 2017 2017 | 47 Episodes Season 2017 of NBC Nightly News premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   60 Minutes 7.5  Facts Status  Returning Series Network Certification  - Type  News Original Language  English Runtime  30m Homepage   http://www.nbcnews.com/nightly-news Genres News Keywords news broadcast Content Score 64 We're so close, yet so far. Top Contributors 20 Banana s 2 samwiseg786 r 2 rina29 D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}