{"link": "https://www.themoviedb.org/tv/71813?language=en", "title": "Project S The Series", "resume": "A story about sports and the lives of athletes full of friendship, love, relationships and transcendence in a rich and diverse perspective.", "rate": 100, "genre": ["Comedy", "Drama"], "cast": ["Narikun Ketprapakorn", "Pibunsonggram Kritsanapoom", "Chanon Santinatornkul", "Kanyawee Songmuang"], "character": ["Bo/Bow", "Shan", "Archwin", "Fame"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71813   Expand Project S The Series   (2017) User Score Overview A story about sports and the lives of athletes full of friendship, love, relationships and transcendence in a rich and diverse perspective. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Narikun Ketprapakorn Bo/Bow Pibunsonggram Kritsanapoom Shan Chanon Santinatornkul Archwin Kanyawee Songmuang Fame Full Cast & Crew Current Season Shoot! I Love You 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Project S The Series. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Project S The Series. You can help by rating TV shows you've seen. Facts Original Name  โปรเจกต์ เอส เดอะซีรีส์ Status  Returning Series Network Certification  - Type  Scripted Original Language  Thai Runtime  45m Homepage   https://tv.line.me/projectstheseries Genres Comedy Drama Keywords friendship sport romance school Content Score 93 Almost there... Top Contributors 66 kbogesz 19 Banana 7 Elizabeth Jennings e 5 eristamelberg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}