{"link": "https://www.themoviedb.org/tv/10663?language=en", "title": "The Flip Wilson Show", "resume": "The Flip Wilson Show is an hour long variety show that aired in the U.S. on NBC from September 17, 1970 to June 27, 1974. The show starred American comedian Flip Wilson; the program was one of the first American television programs starring a black person in the title role to become highly successful with a white audience. Specifically, it was the first successful network variety series starring an African American. During its first two seasons, its Nielsen ratings made it the nation's second most watched show.\nThe show consisted of many skits over an hour. It also broke new ground in American television by using a 'Theatre-in-the-Round' stage format, with the audience seated on all sides of a circular performance area.\nWilson was most famous for creating the role of Geraldine Jones, a sassy, modern woman who had a boyfriend named Killer. Flip also created the role of Reverend Leroy, who was the minister of the Church of What's Happening Now!. New parishioners were wary of coming to the church as it was hinted that Reverend Leroy was a con artist. Wilson popularized such catchphrases as \"What you see is what you get\", and \"The devil made me do it!\".", "rate": 52, "genre": ["Comedy"], "cast": ["Flip Wilson"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10663   Expand The Flip Wilson Show   (1970) User Score Overview The Flip Wilson Show is an hour long variety show that aired in the U.S. on NBC from September 17, 1970 to June 27, 1974. The show starred American comedian Flip Wilson; the program was one of the first American television programs starring a black person in the title role to become highly successful with a white audience. Specifically, it was the first successful network variety series starring an African American. During its first two seasons, its Nielsen ratings made it the nation's second most watched show. The show consisted of many skits over an hour. It also broke new ground in American television by using a 'Theatre-in-the-Round' stage format, with the audience seated on all sides of a circular performance area. Wilson was most famous for creating the role of Geraldine Jones, a sassy, modern woman who had a boyfriend named Killer. Flip also created the role of Reverend Leroy, who was the minister of the Church of What's Happening Now!. New parishioners were wary of coming to the church as it was hinted that Reverend Leroy was a con artist. Wilson popularized such catchphrases as \"What you see is what you get\", and \"The devil made me do it!\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Flip Wilson Host Full Cast & Crew Last Season Season 4 1973 | 17 Episodes Season 4 of The Flip Wilson Show premiered on October 11, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1965-09-01 Gidget 5.2    1965-09-16 The Dean Martin Show 4.2    1971-08-01 The Sonny & Cher Comedy Hour 5.0    1979-09-30 To the Manor Born 7.1    1968-09-23 Here's Lucy 5.8    1968-09-28 The Ghost & Mrs. Muir 6.7    1948-06-20 The Ed Sullivan Show 6.6    1965-09-14 F Troop 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage  - Genres Comedy Keywords variety show Content Score 56 We're so close, yet so far. Top Contributors 11 Banana CM 4 Cherche Moi TB 2 TMDb Bot M 1 MAthePA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}