{"link": "https://www.themoviedb.org/tv/26834?language=en", "title": "TRL", "resume": "Total Request Live was a television series on MTV that featured popular music videos. TRL was MTV's prime outlet for music videos as the network continued to concentrate on reality-based programming. In addition to music videos, TRL featured daily guests. The show was a popular promotion tool used by musicians, actors, and other celebrities to promote their newest works to the show's target teen demographic.\nTRL played the top ten most requested videos of the day, as requested by viewers who voted online for their favorite video. The countdown started with the tenth most requested video and ended with the most requested. As of October 22, 2007, TRL's countdown was based on votes, charts, ringtones, download, radio airplay, and streams, meaning that the most user requested video might not have been the number 1 video. The show generally aired Monday through Thursday for one hour, though the scheduling and length of the show fluctuated over the years. Despite the word \"Live\" in the title of the show, many episodes were actually pre-recorded.\nIt was announced on September 15, 2008 that TRL would be shut down and replaced with FNMTV. The special three-hour finale aired on November 16, 2008, at 8 p.m.", "rate": 75, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26834   Expand TRL   (1998) User Score  Play Trailer Overview Total Request Live was a television series on MTV that featured popular music videos. TRL was MTV's prime outlet for music videos as the network continued to concentrate on reality-based programming. In addition to music videos, TRL featured daily guests. The show was a popular promotion tool used by musicians, actors, and other celebrities to promote their newest works to the show's target teen demographic. TRL played the top ten most requested videos of the day, as requested by viewers who voted online for their favorite video. The countdown started with the tenth most requested video and ended with the most requested. As of October 22, 2007, TRL's countdown was based on votes, charts, ringtones, download, radio airplay, and streams, meaning that the most user requested video might not have been the number 1 video. The show generally aired Monday through Thursday for one hour, though the scheduling and length of the show fluctuated over the years. Despite the word \"Live\" in the title of the show, many episodes were actually pre-recorded. It was announced on September 15, 2008 that TRL would be shut down and replaced with FNMTV. The special three-hour finale aired on November 16, 2008, at 8 p.m. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 20 2017 | 6 Episodes Season 20 of TRL premiered on October  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on TRL. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.mtv.com/ontv/dyn/trl/series.jhtml Genres No genres have been added. Keywords music video music tv program Content Score 56 We're so close, yet so far. Top Contributors 6 Ellin W. Eva 5 Banana 4 rubenjpvieira 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}