{"link": "https://www.themoviedb.org/tv/10021?language=en", "title": "1st & Ten", "resume": "1st & Ten is an American situation comedy that aired between December 1984 and January 1991 on the cable television network HBO. Featuring series regulars Delta Burke and veteran Reid Shelton, it was one of cable's first attempts to lure the lucrative sit-com audience away from the \"Big Three\", by taking advantage of their freedom to include occasional cursing and nudity.", "rate": 60, "genre": ["Comedy"], "cast": ["Delta Burke", "Shannon Tweed", "Prince Hughes", "Reid Shelton", "Donald Gibb"], "character": ["Diane Barrow", "Kristy Fullbright", "Bubba Kincaid", "Ernie Denardo", "Leslie 'Dr. Death' Crunchner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10021   Expand 1st & Ten   (1984) User Score Overview 1st & Ten is an American situation comedy that aired between December 1984 and January 1991 on the cable television network HBO. Featuring series regulars Delta Burke and veteran Reid Shelton, it was one of cable's first attempts to lure the lucrative sit-com audience away from the \"Big Three\", by taking advantage of their freedom to include occasional cursing and nudity. Featured Crew Carl Kleinschmitt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Delta Burke Diane Barrow Shannon Tweed Kristy Fullbright Prince Hughes Bubba Kincaid Reid Shelton Ernie Denardo Donald Gibb Leslie 'Dr. Death' Crunchner Full Cast & Crew Last Season Season 6 1990 | 16 Episodes Season 6 of 1st & Ten premiered on October  3, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 1st & Ten. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords sport american football american football team sitcom Content Score 93 Almost there... Top Contributors 45 Banana 1 Stan Smith  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}