{"link": "https://www.themoviedb.org/tv/46550?language=en", "title": "Flower Boy Next Door", "resume": "Go Dok Mi doesn't spend all day dreaming about her knight in shining armor — she’s too busy spying on her neighbors who all happen to be hot, \"flower-boy\" types, including cartoon artist Oh Jin Rak. But when Enrique Geum, the new pretty boy next door, catches her, Dok Mi is finally forced to face the consequences - without the safety of binoculars and curtains. Will he be able to convince this “urban Rapunzel” to let her hair down? Whether you’re a lover or a fighter, this sensitive man will captivate your sensibilities.", "rate": 72, "genre": ["Comedy", "Drama"], "cast": ["Yoon Shi-Yoon", "Park Shin-hye", "Kim Ji-hun", "Ko Kyoung-pyo", "Park Soo-jin"], "character": ["Enrique Geum", "Go Dok-mi", "Oh Jae Won", "Oh Dong-hoon", "Cha Do-hwi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46550   Expand Flower Boy Next Door   (2013) User Score Overview Go Dok Mi doesn't spend all day dreaming about her knight in shining armor — she’s too busy spying on her neighbors who all happen to be hot, \"flower-boy\" types, including cartoon artist Oh Jin Rak. But when Enrique Geum, the new pretty boy next door, catches her, Dok Mi is finally forced to face the consequences - without the safety of binoculars and curtains. Will he be able to convince this “urban Rapunzel” to let her hair down? Whether you’re a lover or a fighter, this sensitive man will captivate your sensibilities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Shi-Yoon Enrique Geum Park Shin-hye Go Dok-mi Kim Ji-hun Oh Jae Won Ko Kyoung-pyo Oh Dong-hoon Park Soo-jin Cha Do-hwi Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of Flower Boy Next Door premiered on January  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2015-11-16 Oh My Venus 7.8    2015-08-05 Yong Pal 7.2    2013-10-09 The Heirs 7.4    2014-11-12 Pinocchio 7.4    2010-03-31 Personal Taste 7.4    2011-06-29 Heartstrings 7.0    2009-10-07 You're Beautiful 7.9    2010-11-13 Secret Garden 8.2  Facts Original Name  이웃집 꽃미남 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 19 Elizabeth Jennings s 6 sheva_vitali z 5 zurman1 N 4 Nosirus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}