{"link": "https://www.themoviedb.org/tv/61551?language=en", "title": "Happyland", "resume": "Having grown up in a world of manufactured happiness, Lucy, the cynical teenage daughter of a idealistic theme park princess mom, wants to get out and experience something real. When Ian, the new park owner's son, arrives and sweeps her off her feet, Lucy is left wondering if fairy tale endings do exist after all. But when a scandalous secret turns her life upside down, she learns Happyland is far from a walk in the park.", "rate": 33, "genre": ["Drama", "Comedy"], "cast": ["Bianca A. Santos", "Camille Guaty", "Shane Harper", "Katherine McNamara", "Cameron Moulène"], "character": ["Lucy Velez", "Gloria Velez", "Ian Chandler", "Harper Munroe", "Will"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61551   Expand Happyland   (2014) User Score  Play Trailer Overview Having grown up in a world of manufactured happiness, Lucy, the cynical teenage daughter of a idealistic theme park princess mom, wants to get out and experience something real. When Ian, the new park owner's son, arrives and sweeps her off her feet, Lucy is left wondering if fairy tale endings do exist after all. But when a scandalous secret turns her life upside down, she learns Happyland is far from a walk in the park. Featured Crew Ben Epstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bianca A. Santos Lucy Velez Camille Guaty Gloria Velez Shane Harper Ian Chandler Katherine McNamara Harper Munroe Cameron Moulène Will Full Cast & Crew Last Season Season 1 2014 | 8 Episodes Season 1 of Happyland premiered on September 30, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Lucy: Happy Birthday Bianca Santos! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2014-10-02 Bad Judge 6.1    2014-06-29 Reckless 5.5    2013-10-22 Ravenswood 4.5    2016-10-11 Kim's Convenience 7.2    2015-01-22 Backstrom 6.4    2014-09-17 Red Band Society 6.4    2012-08-12 Animal Practice 4.7    2015-01-11 Togetherness 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mtv.com/shows/happyland/ Genres Drama Comedy Keywords family secret teenager amusement park theme park Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 23 Banana j 7 jablay 3 enams90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}