{"link": "https://www.themoviedb.org/tv/43236?language=en", "title": "I Need Romance", "resume": "I Need Romance is a 2011 South Korean romantic comedy series starring Jo Yeo-jeong, Kim Jeong-hoon, Choi Yeo-jin, Choi Song-hyun and Choi Jin-hyuk. It aired on tvN from June 13 to August 2, 2011 on Mondays and Tuesdays at 23:00 for 16 episodes.\nThe cable drama revolves around three thirty-something career women and their complicated love lives. It was popular with female viewers in their 20s and 30s for depicting contemporary women in a realistic way.", "rate": 70, "genre": ["Comedy", "Drama"], "cast": ["Kim So-yeon", "Sung Joon", "Namgoong Min", "Wang Ji-won", "Park Hyo-ju"], "character": ["Shin Joo-yeon", "Joo Wan", "Kang Tae-yoon", "Oh Se-ryung", "Lee Min-jung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43236   Expand I Need Romance   (2011) User Score Overview I Need Romance is a 2011 South Korean romantic comedy series starring Jo Yeo-jeong, Kim Jeong-hoon, Choi Yeo-jin, Choi Song-hyun and Choi Jin-hyuk. It aired on tvN from June 13 to August 2, 2011 on Mondays and Tuesdays at 23:00 for 16 episodes. The cable drama revolves around three thirty-something career women and their complicated love lives. It was popular with female viewers in their 20s and 30s for depicting contemporary women in a realistic way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim So-yeon Shin Joo-yeon Sung Joon Joo Wan Namgoong Min Kang Tae-yoon Wang Ji-won Oh Se-ryung Park Hyo-ju Lee Min-jung Full Cast & Crew Last Season Season 3 2014 | 16 Episodes Season 3 of I Need Romance premiered on January 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on I Need Romance. You can help by rating TV shows you've seen. Facts Original Name  로맨스가 필요해 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Comedy Drama Keywords friendship korea Content Score 86 Almost there... Top Contributors M 30 Maria180493 t 19 tmdb38202327 CM 6 Cherche Moi s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}