{"link": "https://www.themoviedb.org/tv/75086?language=en", "title": "Dokidoki! Precure", "resume": "Aida Mana is a girl who is always eager to do things for the sake of others.\nOne day, when she was visiting the Clover Tower during her school's orientation program, an enemy who called themselves \"Selfish\" appeared suddenly, and tried to manipulate her inner heart! To fight this enemy, she borrowed power from a magical fairy Sharuru to transform into Pretty Cure!\nTo protect the peace of the world, other legendary Pretty Cure soon joined her in battle! A mysterious baby also appears, making each day a \"Heartthrob\" experience! The 4 Cures, always holding \"love\" in their hearts, are battling for the world's fate!", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75086   Expand Dokidoki! Precure   (2013) User Score Overview Aida Mana is a girl who is always eager to do things for the sake of others. One day, when she was visiting the Clover Tower during her school's orientation program, an enemy who called themselves \"Selfish\" appeared suddenly, and tried to manipulate her inner heart! To fight this enemy, she borrowed power from a magical fairy Sharuru to transform into Pretty Cure! To protect the peace of the world, other legendary Pretty Cure soon joined her in battle! A mysterious baby also appears, making each day a \"Heartthrob\" experience! The 4 Cures, always holding \"love\" in their hearts, are battling for the world's fate! Featured Crew Gou Koga Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 49 Episodes Season 1 of Dokidoki! Precure premiered on February  2, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dokidoki! Precure. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dokidoki! Precure. You can help by rating TV shows you've seen. Facts Original Name  ドキドキ!プリキュア Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.toei-anim.co.jp/tv/dokidoki_precure/ Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 15 Banana 10 karaa O 8 Oromar99 4 stickizonline  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}