{"link": "https://www.themoviedb.org/tv/43189?language=en", "title": "Berlin Alexanderplatz", "resume": "Berlin Alexanderplatz originally broadcast in 1980, is a 14-part West German television miniseries, adapted and directed by Rainer Werner Fassbinder from the Alfred Döblin novel of the same name, and stars Günter Lamprecht, Hanna Schygulla, Barbara Sukowa, Elisabeth Trissenaar and Gottfried John. The complete series is 15½ hours long. In 1983, it was released theatrically in the United States, where a theatre would show two or three parts per night. It garnered a cult following in the US and was eventually released on VHS and broadcast on PBS and then Bravo.", "rate": 88, "genre": ["Drama"], "cast": ["Günter Lamprecht", "Gottfried John", "Ivan Desny", "Hanna Schygulla", "Brigitte Mira"], "character": ["Franz Biberkopf", "Reinhold Hoffmann", "Pums", "Eva", "Frau Bast"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43189   Expand Berlin Alexanderplatz   (1980) User Score Overview Berlin Alexanderplatz originally broadcast in 1980, is a 14-part West German television miniseries, adapted and directed by Rainer Werner Fassbinder from the Alfred Döblin novel of the same name, and stars Günter Lamprecht, Hanna Schygulla, Barbara Sukowa, Elisabeth Trissenaar and Gottfried John. The complete series is 15½ hours long. In 1983, it was released theatrically in the United States, where a theatre would show two or three parts per night. It garnered a cult following in the US and was eventually released on VHS and broadcast on PBS and then Bravo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Günter Lamprecht Franz Biberkopf Gottfried John Reinhold Hoffmann Ivan Desny Pums Hanna Schygulla Eva Brigitte Mira Frau Bast Full Cast & Crew Last Season Season 1 1980 | 14 Episodes Season 1 of Berlin Alexanderplatz premiered on October 12, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1984-12-25 Fanny and Alexander 7.9    2010-05-19 Carlos / Le prix du Chacal 7.6    1979-09-10 Tinker Tailor Soldier Spy 7.7    1989-01-08 Agatha Christie's Poirot 7.9    2003-12-08 Battlestar Galactica 8.3    2001-06-03 Six Feet Under 8.2    2010-09-19 Boardwalk Empire 7.7    1990-04-08 Twin Peaks 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 26 Samara e 4 error42 3 derKaetzer w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}