{"link": "https://www.themoviedb.org/tv/13821?language=en", "title": "The Crow: Stairway to Heaven", "resume": "The Crow: Stairway to Heaven was a 1998 Canadian television series created by Bryce Zabel spun off from the The Crow film series starring Mark Dacascos in the lead role as Eric Draven, reprising the role originally played by Brandon Lee in the 1994 film The Crow.", "rate": 64, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Mark Dacascos", "Katie Stuart", "Sabine Karsenti", "Marc Gomes", "Lynda Boyd"], "character": ["Eric Draven", "Sarah Mohr", "Shelly Webster", "Detective Darryl Albrecht", "Darla Mohr"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13821   Expand The Crow: Stairway to Heaven   (1998) User Score  Play Trailer Overview The Crow: Stairway to Heaven was a 1998 Canadian television series created by Bryce Zabel spun off from the The Crow film series starring Mark Dacascos in the lead role as Eric Draven, reprising the role originally played by Brandon Lee in the 1994 film The Crow. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Dacascos Eric Draven Katie Stuart Sarah Mohr Sabine Karsenti Shelly Webster Marc Gomes Detective Darryl Albrecht Lynda Boyd Darla Mohr Full Cast & Crew Last Season Season 1 1998 | 22 Episodes Season 1 of The Crow: Stairway to Heaven premiered on September 25, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations   1985-09-01 Jayce and The Wheeled Warriors 6.8    1997-10-06 Earth: Final Conflict 6.8    1978-03-10 The Incredible Hulk 6.4    1983-12-15 Automan 6.5    1996-09-28 Early Edition 6.7    2000-06-09 The Invisible Man 7.2    1985-09-29 Amazing Stories 7.3    1986-09-08 SilverHawks 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Drama Keywords supernatural powers revenge death return from dead Content Score 93 Almost there... Top Contributors d 12 denis 9 Banana m 8 mm2dylan v 7 veotele  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}