{"link": "https://www.themoviedb.org/tv/76619?language=en", "title": "Children of A Lesser God", "resume": "Cheon Jae-In is a detective and he is extremely smart. He is guided by only facts, logic and numbers. Kim Dan is a detective. She possesses a superhuman ability involving her vision. They are totally different in personality, but they work together to uncover a conspiracy involving a powerful organization.", "rate": 80, "genre": ["Crime", "Mystery"], "cast": ["Kang Ji-hwan", "Kim Ok-Bin", "Sim Hee-seop", "Lee Elijah", "Jang Gwang"], "character": ["Cheon Jae-In", "Kim Dan", "Joo Ha-Min", "Baek A-Hyun", "Pastor Wang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76619   Expand Children of A Lesser God   (2018) User Score Overview Cheon Jae-In is a detective and he is extremely smart. He is guided by only facts, logic and numbers. Kim Dan is a detective. She possesses a superhuman ability involving her vision. They are totally different in personality, but they work together to uncover a conspiracy involving a powerful organization. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Ji-hwan Cheon Jae-In Kim Ok-Bin Kim Dan Sim Hee-seop Joo Ha-Min Lee Elijah Baek A-Hyun Jang Gwang Pastor Wang Full Cast & Crew Current Season Season 1 2018 | 16 Episodes Season 1 of Children of A Lesser God premiered on March  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Children of A Lesser God. You can help by rating TV shows you've seen. Facts Original Name  작은 신의 아이들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/ocn/lessergod/ Genres Crime Mystery Keywords thriller suspense Content Score 86 Almost there... Top Contributors M 32 Maria180493 3 adamsp09 h 3 huestory 2 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}