{"link": "https://www.themoviedb.org/tv/5117?language=en", "title": "Anything but Love", "resume": "Anything But Love is an American television sitcom, which aired on ABC from March 7, 1989 to June 3, 1992, spanning four seasons and 56 episodes. The show starred Richard Lewis as Marty Gold and Jamie Lee Curtis as Hannah Miller, coworkers at a Chicago magazine with a mutual romantic attraction to each other, who struggled to keep their relationship strictly professional. The series, from creator Wendy Kout and developers Dennis Koenig and Peter Noah, was produced by Adam Productions in association with 20th Century Fox Television.", "rate": 0, "genre": ["Comedy"], "cast": ["Jamie Lee Curtis", "Richard Lewis", "Richard Frank", "Ann Magnuson", "Holly Fulger"], "character": ["Marty Gold"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5117   Expand Anything but Love   (1989) User Score Overview Anything But Love is an American television sitcom, which aired on ABC from March 7, 1989 to June 3, 1992, spanning four seasons and 56 episodes. The show starred Richard Lewis as Marty Gold and Jamie Lee Curtis as Hannah Miller, coworkers at a Chicago magazine with a mutual romantic attraction to each other, who struggled to keep their relationship strictly professional. The series, from creator Wendy Kout and developers Dennis Koenig and Peter Noah, was produced by Adam Productions in association with 20th Century Fox Television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Lee Curtis Richard Lewis Marty Gold Richard Frank Ann Magnuson Holly Fulger Full Cast & Crew Last Season Season 4 1991 | 17 Episodes Season 4 of Anything but Love premiered on September 25, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Anything but Love. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Comedy Keywords chicago magazine coworker relationship sitcom Content Score 86 Almost there... Top Contributors 7 Banana r 4 rick555 TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}