{"link": "https://www.themoviedb.org/tv/14575?language=en", "title": "The Steve Allen Show", "resume": "The Steve Allen Show is an American variety show hosted by Steve Allen from June 1956 to June 1960 on NBC, from September 1961 to December 1961 on ABC, and in first-run syndication from 1962 to 1964.\nThe first three seasons aired on Sunday nights at 8:00pm Eastern Time, then on Mondays at 10:00pm Eastern in the 1959-60 season. After a season's absence, the series briefly returned on Wednesdays at 7:30pm Eastern. The syndicated version aired mostly in late nights. The program, between September 1957 and June 1960 became one of the first programs to be telecast in \"compatible color\"\nKinescopes of the NBC version were later rerun on Comedy Central in the early 1990s, with new introductions by Allen.", "rate": 0, "genre": ["Comedy"], "cast": ["Steve Allen"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14575   Expand The Steve Allen Show   (1956) User Score Overview The Steve Allen Show is an American variety show hosted by Steve Allen from June 1956 to June 1960 on NBC, from September 1961 to December 1961 on ABC, and in first-run syndication from 1962 to 1964. The first three seasons aired on Sunday nights at 8:00pm Eastern Time, then on Mondays at 10:00pm Eastern in the 1959-60 season. After a season's absence, the series briefly returned on Wednesdays at 7:30pm Eastern. The syndicated version aired mostly in late nights. The program, between September 1957 and June 1960 became one of the first programs to be telecast in \"compatible color\" Kinescopes of the NBC version were later rerun on Comedy Central in the early 1990s, with new introductions by Allen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Allen Host Full Cast & Crew Last Season Season 1 1956 | 32 Episodes Season 1 of The Steve Allen Show premiered on June 24, 1956. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Steve Allen Show. You can help by rating TV shows you've seen. Facts Status  Ended Networks Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords variety show Content Score 43 There's no 'I' in team... Top Contributors 6 Banana 6 Elizabeth Jennings 4 lineker 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}