{"link": "https://www.themoviedb.org/tv/34356?language=en", "title": "TRON: Uprising", "resume": "TRON: Uprising is an American animated science fiction television series, part of the TRON franchise, that aired on Disney XD in the United States from May 18, 2012 to January 28, 2013. The series is directed by Charlie Bean, who also acts as executive producer. Edward Kitsis, Adam Horowitz, and Justin Springer serve as consulting producers. The series is set between Tron and Tron: Legacy. A total of 19 episodes of the series have been produced and aired. The series has not been renewed.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Mandy Moore", "Elijah Wood", "Emmanuelle Chriqui", "Lance Henriksen", "Nate Corddry"], "character": ["Mara", "Beck", "Page", "Tesler", "Zed"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34356   Expand TRON: Uprising   (2012) User Score  Play Trailer Overview TRON: Uprising is an American animated science fiction television series, part of the TRON franchise, that aired on Disney XD in the United States from May 18, 2012 to January 28, 2013. The series is directed by Charlie Bean, who also acts as executive producer. Edward Kitsis, Adam Horowitz, and Justin Springer serve as consulting producers. The series is set between Tron and Tron: Legacy. A total of 19 episodes of the series have been produced and aired. The series has not been renewed. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mandy Moore Mara Elijah Wood Beck Emmanuelle Chriqui Page Lance Henriksen Tesler Nate Corddry Zed Full Cast & Crew Last Season Season 1 2012 | 18 Episodes Season 1 of TRON: Uprising premiered on June  7, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Is \"Beck's Beginning\" a special? Open 0 by ExTechOp\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  9 Posters  6 Recommendations   2012-02-18 Transformers: Rescue Bots 6.8    2013-03-23 Monsters vs. Aliens 5.0    2015-09-16 Moonbeam City 5.5    2009-11-06 Fanboy and Chum Chum 2.0    2013-07-21 Axe Cop 5.5    2015-04-14 Other Space 7.4    2008-06-16 The Middleman 7.5    2012-05-24 Men at Work 6.6  Facts Status  Ended Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://disneyxd.disney.com/tron-uprising Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords virtual reality technology revolution based on movie tron Content Score 93 Almost there... Top Contributors 33 Jason Patrick 12 Banana 8 Elizabeth Jennings 6 SkullCollector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}