{"link": "https://www.themoviedb.org/tv/11703?language=en", "title": "The Road Runner Show", "resume": "The Road Runner Show was an animated anthology series which compiled theatrical Wile E. Coyote and The Road Runner cartoons from the Looney Tunes and Merrie Melodies, which were produced by Warner Bros. Cartoons between 1948 and 1966. Several of the shorts, especially the ones produced from 1965 onward, were produced specifically for television by Format Films after Warner Bros. closed their animation studio. The Road Runner Show ran for two seasons on CBS, and then on ABC for two seasons. There were two Road Runner/Coyote cartoons during each episode, with another WB animated character in the middle segment.\nCBS combined The Road Runner Show with The Bugs Bunny Show in 1968. The Road Runner and the Coyote more often shared at least an hour with Bugs Bunny on CBS during the late-1960s through the mid-1980s to the early-1990s.\nThe theme song was written and performed by Barbara Cameron, in 1999 was covered by the Mexican band Chicos de Barrio.", "rate": 80, "genre": ["Animation", "Comedy", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11703   Expand The Road Runner Show   (1949) User Score Overview The Road Runner Show was an animated anthology series which compiled theatrical Wile E. Coyote and The Road Runner cartoons from the Looney Tunes and Merrie Melodies, which were produced by Warner Bros. Cartoons between 1948 and 1966. Several of the shorts, especially the ones produced from 1965 onward, were produced specifically for television by Format Films after Warner Bros. closed their animation studio. The Road Runner Show ran for two seasons on CBS, and then on ABC for two seasons. There were two Road Runner/Coyote cartoons during each episode, with another WB animated character in the middle segment. CBS combined The Road Runner Show with The Bugs Bunny Show in 1968. The Road Runner and the Coyote more often shared at least an hour with Bugs Bunny on CBS during the late-1960s through the mid-1980s to the early-1990s. The theme song was written and performed by Barbara Cameron, in 1999 was covered by the Mexican band Chicos de Barrio. Featured Crew Chuck Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1949 | 64 Episodes Season 1 of The Road Runner Show premiered on September 16, 1949. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1985-10-26 David the Gnome 7.3    1995-09-09 Pinky and the Brain 7.7    1990-09-10 The Fresh Prince of Bel-Air 7.3  Facts Status  Ended Networks - Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Family Keywords cartoon rivalry Content Score 64 We're so close, yet so far. Top Contributors M 35 Marco T 17 Tak3r93 z 10 zurman1 8 Robson Guedes Vieira  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}