{"link": "https://www.themoviedb.org/tv/3921?language=en", "title": "Clueless", "resume": "Clueless is a television series spun off from the 1995 teen film of the same name. The series originally premiered on ABC on September 20, 1996 as a part of the TGIF lineup during its first season. The show then spent its last two seasons on UPN ending on May 25, 1999.", "rate": 54, "genre": ["Comedy"], "cast": ["Rachel Blanchard", "Stacey Dash", "Donald Faison", "Elisa Donovan"], "character": ["Cher Horowitz", "Dionne \"Dee\" Davenport", "Murray", "Amber Mariens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3921   Expand Clueless   (1996) User Score Overview Clueless is a television series spun off from the 1995 teen film of the same name. The series originally premiered on ABC on September 20, 1996 as a part of the TGIF lineup during its first season. The show then spent its last two seasons on UPN ending on May 25, 1999. Featured Crew Amy Heckerling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel Blanchard Cher Horowitz Stacey Dash Dionne \"Dee\" Davenport Donald Faison Murray Elisa Donovan Amber Mariens Full Cast & Crew Last Season Season 3 1998 | 22 Episodes Season 3 of Clueless premiered on October  6, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Still clueless Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2004-09-07 Ned's Declassified School Survival Guide 5.7    2011-10-10 Enlightened 7.1    2001-01-12 Lizzie McGuire 5.6    2007-09-08 iCarly 6.3    1994-09-12 Party of Five 6.3    2002-09-17 8 Simple Rules 6.3    2004-01-11 Drake & Josh 7.1    2009-01-18 United States of Tara 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords high school california los angeles beverly hills based on movie wealthy teens Content Score 93 Almost there... Top Contributors c 24 courtneysmith86 8 Banana b 6 bugfix R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}