{"link": "https://www.themoviedb.org/tv/72396?language=en", "title": "Strongest Deliveryman", "resume": "Story depicts love and success of a deliveryman who eventually becomes the CEO of a delivery app company.", "rate": 63, "genre": ["Drama"], "cast": ["Ko Kyoung-pyo", "Chae Soo-bin", "Kim Sun-Ho", "Ko Won-hee", "Son Ji-Hyun"], "character": ["Choi Gang-Soo", "Lee Dan-A", "Oh Jin-Gyu", "Lee Ji-Yoon", "Choi Yeon-Ji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72396   Expand Strongest Deliveryman   (2017) User Score  Play Trailer Overview Story depicts love and success of a deliveryman who eventually becomes the CEO of a delivery app company. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ko Kyoung-pyo Choi Gang-Soo Chae Soo-bin Lee Dan-A Kim Sun-Ho Oh Jin-Gyu Ko Won-hee Lee Ji-Yoon Son Ji-Hyun Choi Yeon-Ji Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Strongest Deliveryman premiered on August  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2017-08-09 Manhole 7.3    2017-07-19 Reunited Worlds 8.3    2017-08-05 Save Me 7.0    2017-07-19 Man Who Dies to Live 8.3    2017-05-10 Ruler: Master of the Mask 6.7    2017-07-24 Falsify 6.1    2017-08-30 Hospital Ship 4.8    2017-05-22 Circle 6.6  Facts Original Name  최강 배달꾼 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/strongestdeliveryman/index.html Genres Drama Keywords romance slice of life korea Content Score 93 Almost there... Top Contributors M 53 Maria180493 V 7 Violsa 5 galactica_j 5 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}