{"link": "https://www.themoviedb.org/tv/74470?language=en", "title": "Snoop Dogg Presents The Joker's Wild", "resume": "Snoop Dogg, who counted The Joker's Wild as his favorite game show growing up, will host TBS's new version, which is set in his casino, complete with a gigantic slot machine, as well as giant dice and playing cards. Streetwise questions and problem solving, not just book smarts, will rule the floor, with all the action controlled by the one and only Snoop D-O Double G.", "rate": 0, "genre": ["Talk"], "cast": ["Snoop Dogg"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74470   Expand Snoop Dogg Presents The Joker's Wild   (2017) User Score  Play Trailer Overview Snoop Dogg, who counted The Joker's Wild as his favorite game show growing up, will host TBS's new version, which is set in his casino, complete with a gigantic slot machine, as well as giant dice and playing cards. Streetwise questions and problem solving, not just book smarts, will rule the floor, with all the action controlled by the one and only Snoop D-O Double G. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Snoop Dogg Himself - Host Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of Snoop Dogg Presents The Joker's Wild premiered on April 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Snoop Dogg Presents The Joker's Wild. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.tbs.com/shows/snoop-dogg-presents-the-jokers-wild Genres Talk Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings 4 tigru89 D 2 Derek.Jo.Lee88 1 oldboy3  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}