{"link": "https://www.themoviedb.org/tv/64378?language=en", "title": "Young & Promising", "resume": "Three ambitious girls in their 20s—Elise, Alex and Nenne—try to make their dreams come true in Oslo. The girls discover that pretty much everyone, including their parents, have no idea what they're doing with their lives. As they try and break into adulthood, they take comfort in the fact that really we are all just a bunch of fuck-ups doing the best we can.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Siri Seljeseth", "Alexandra Gjerpen", "Gine Cornelia Pedersen"], "character": ["Elise", "Alex", "Nenne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64378   Expand Young & Promising   (2015) User Score  Play Trailer Overview Three ambitious girls in their 20s—Elise, Alex and Nenne—try to make their dreams come true in Oslo. The girls discover that pretty much everyone, including their parents, have no idea what they're doing with their lives. As they try and break into adulthood, they take comfort in the fact that really we are all just a bunch of fuck-ups doing the best we can. Featured Crew Siri Seljeseth Creator Mads Loeken Creator Birgitte Rustad Wegener Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Siri Seljeseth Elise Alexandra Gjerpen Alex Gine Cornelia Pedersen Nenne Full Cast & Crew Current Season Season 3 2018 | 6 Episodes Season 3 of Young & Promising premiered on February 23, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Young & Promising. You can help by rating TV shows you've seen. Facts Original Name  Unge lovende Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  30m Homepage   https://tv.nrk.no/serie/unge-lovende Genres Comedy Drama Keywords teenager dramedy Content Score 71 Just a little bit more... Top Contributors 52 Bendik 37 enjikaka 9 Kimme Utsi 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}