{"link": "https://www.themoviedb.org/tv/13296?language=en", "title": "Oliver Twist", "resume": "Oliver Twist is a 2007 British television adaptation of Charles Dickens' novel Oliver Twist, written by Sarah Phelps and directed by Coky Giedroyc. It consists of five episodes, broadcast on BBC One from 18 to 22 December 2007. It aired on PBS' Masterpiece Classic in the United States on 15 and 22 February 2009, in two ninety-minute installments. In Australia, ABC1 also opted to air this series as a two-part special each Sunday at 8:30 pm from 20 December 2009.", "rate": 63, "genre": ["Drama"], "cast": ["Gregor Fisher", "Edward Fox", "Tom Hardy", "Timothy Spall", "Sophie Okonedo"], "character": ["Mr. Bumble", "Mr. Brownlow", "Bill Sikes", "Fagin", "Nancy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13296   Expand Oliver Twist   (2007) User Score Overview Oliver Twist is a 2007 British television adaptation of Charles Dickens' novel Oliver Twist, written by Sarah Phelps and directed by Coky Giedroyc. It consists of five episodes, broadcast on BBC One from 18 to 22 December 2007. It aired on PBS' Masterpiece Classic in the United States on 15 and 22 February 2009, in two ninety-minute installments. In Australia, ABC1 also opted to air this series as a two-part special each Sunday at 8:30 pm from 20 December 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gregor Fisher Mr. Bumble Edward Fox Mr. Brownlow Tom Hardy Bill Sikes Timothy Spall Fagin Sophie Okonedo Nancy Full Cast & Crew Last Season Season 1 2007 | 5 Episodes Season 1 of Oliver Twist premiered on December 18, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1999-11-07 The Magical Legend of the Leprechauns 6.6    1996-02-04 Gulliver's Travels 6.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/drama/oliver/ Genres Drama Keywords based on novel or book victorian england thief miniseries orphan period drama charles dickens woman director costume drama Content Score 86 Almost there... Top Contributors TB 31 TMDb Bot R 7 Rebecca A 4 Ahnologe O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}