{"link": "https://www.themoviedb.org/tv/64011?language=en", "title": "Professor T.", "resume": "Eccentric criminal psychology Professor T is a successful police advisor but his unpredictable nature drives his colleagues crazy. He has a brilliant mind, but also several neurological disorders which make him a complex and often difficult individual. However, aided by the trusty and understanding Annelies and Daan they form a team of high-powered experts that Antwerp Homicide Department rely on.", "rate": 75, "genre": ["Drama"], "cast": ["Koen De Bouw", "Tanja Oostvogels", "Goele Derick"], "character": ["Professor T.", "Christina Flamant", "Ingrid Sneyers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64011   Expand Professor T.   (2015) User Score Overview Eccentric criminal psychology Professor T is a successful police advisor but his unpredictable nature drives his colleagues crazy. He has a brilliant mind, but also several neurological disorders which make him a complex and often difficult individual. However, aided by the trusty and understanding Annelies and Daan they form a team of high-powered experts that Antwerp Homicide Department rely on. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Koen De Bouw Professor T. Tanja Oostvogels Christina Flamant Goele Derick Ingrid Sneyers Full Cast & Crew Last Season Season 2 2016 | 1 Episode Season 2 of Professor T. premiered on September  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Professor T.. You can help by rating TV shows you've seen. Facts Original Name  T. Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  - Homepage  - Genres Drama Keywords police professor Content Score 56 We're so close, yet so far. Top Contributors S 19 Supertinnie 11 Steve 7 Maretoh 4 webmotril  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}