{"link": "https://www.themoviedb.org/tv/4994?language=en", "title": "Biography", "resume": "Biography is a documentary television series. It was originally a half-hour filmed series produced for CBS by David Wolper from 1961 to 1964 and hosted by Mike Wallace. The A&E Network later re-ran it and has produced new episodes since 1987. The older version featured historical figures such as Helen Keller and Mark Twain, or long-dead entertainment figures such as Will Rogers or John Barrymore. The A&E series has placed the emphasis on such people as Marilyn Monroe, Elvis Presley, Plácido Domingo, Freddie Mercury, Jacqueline Kennedy Onassis, Eric Clapton, Pope John Paul II, Gene Tierney, Selena, Diego Rivera, Mao Zedong and Queen Elizabeth II, and fictional characters like The Phantom, Superman, Hamlet, Betty Boop, and Santa Claus. The program ended up profiling enough figures that in 1999, A&E spun it off into an entire network, The Biography Channel.\nInitially, most of the episodes featured the life stories of historical figures or present political or social leaders. People such as William Shakespeare, Charles Dickens, Wolfgang Amadeus Mozart, Enrico Caruso, and Eva Peron were profiled. After a few years, however, the show began producing episodes on figures from pop culture, including Britney Spears, Al Pacino, Johnny Depp and Marilyn Manson. This move away from purely intellectual subject matter has been criticized by some.", "rate": 75, "genre": ["Documentary"], "cast": ["Jack Perkins"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4994   Expand Biography   (1987) User Score  Play Trailer Overview Biography is a documentary television series. It was originally a half-hour filmed series produced for CBS by David Wolper from 1961 to 1964 and hosted by Mike Wallace. The A&E Network later re-ran it and has produced new episodes since 1987. The older version featured historical figures such as Helen Keller and Mark Twain, or long-dead entertainment figures such as Will Rogers or John Barrymore. The A&E series has placed the emphasis on such people as Marilyn Monroe, Elvis Presley, Plácido Domingo, Freddie Mercury, Jacqueline Kennedy Onassis, Eric Clapton, Pope John Paul II, Gene Tierney, Selena, Diego Rivera, Mao Zedong and Queen Elizabeth II, and fictional characters like The Phantom, Superman, Hamlet, Betty Boop, and Santa Claus. The program ended up profiling enough figures that in 1999, A&E spun it off into an entire network, The Biography Channel. Initially, most of the episodes featured the life stories of historical figures or present political or social leaders. People such as William Shakespeare, Charles Dickens, Wolfgang Amadeus Mozart, Enrico Caruso, and Eva Peron were profiled. After a few years, however, the show began producing episodes on figures from pop culture, including Britney Spears, Al Pacino, Johnny Depp and Marilyn Manson. This move away from purely intellectual subject matter has been criticized by some. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Perkins Narrator Full Cast & Crew Last Season Season 24 2011 | 1 Episode Season 24 of Biography premiered on December 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1987-01-20 Unsolved Mysteries 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.aetv.com/blog/tags/biography Genres Documentary Keywords history Content Score 64 We're so close, yet so far. Top Contributors 6 amian123 4 SWFT 3 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}