{"link": "https://www.themoviedb.org/tv/4670?language=en", "title": "Stella", "resume": "Stella was a short-lived television series that originally ran from June 28, 2005 to August 30, 2005 on the American television channel Comedy Central, created by and starring Michael Ian Black, Michael Showalter, and David Wain, the three members of the sketch comedy troupe of the same name and former cast members of MTV's The State. Stella, as a comedy troupe, has existed since 1997. It has a cult following and plays to sold out shows across the USA. The show aired on Tuesdays at 10:30 PM, EST.\nIn September, after 10 episodes, Stella's timeslot was filled by Mind of Mencia. On March 8, 2006, the following message was posted on Stella's official website: \"The STELLA series was on Comedy Central last summer. The network has officially decided not to renew it for a second season,\" thus effectively cancelling the series. The first season DVD was released on September 12, 2006. Episodes have also been available on iTunes and Hulu and some episodes on Joost. Stella premiered in Australia on The Comedy Channel on May 3, 2007.", "rate": 70, "genre": ["Comedy"], "cast": ["Michael Ian Black", "David Wain", "Michael Showalter"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4670   Expand Stella   (2005) User Score Overview Stella was a short-lived television series that originally ran from June 28, 2005 to August 30, 2005 on the American television channel Comedy Central, created by and starring Michael Ian Black, Michael Showalter, and David Wain, the three members of the sketch comedy troupe of the same name and former cast members of MTV's The State. Stella, as a comedy troupe, has existed since 1997. It has a cult following and plays to sold out shows across the USA. The show aired on Tuesdays at 10:30 PM, EST. In September, after 10 episodes, Stella's timeslot was filled by Mind of Mencia. On March 8, 2006, the following message was posted on Stella's official website: \"The STELLA series was on Comedy Central last summer. The network has officially decided not to renew it for a second season,\" thus effectively cancelling the series. The first season DVD was released on September 12, 2006. Episodes have also been available on iTunes and Hulu and some episodes on Joost. Stella premiered in Australia on The Comedy Channel on May 3, 2007. Featured Crew Michael Showalter Creator Michael Ian Black Creator David Wain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Ian Black David Wain Michael Showalter Full Cast & Crew Last Season Season 1 2005 | 10 Episodes Season 1 of Stella premiered on June 28, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1998-08-19 Upright Citizens Brigade 8.0    2005-06-19 12 oz. Mouse 6.4    1995-11-03 Mr. Show with Bob and David 8.1    2005-03-11 Wonder Showzen 7.4    2010-09-21 Running Wilde 6.8    2007-02-11 Tim and Eric Awesome Show, Great Job! 7.4    2006-03-02 Charlie Brooker's Screenwipe 9.2    2004-11-14 Tom Goes to the Mayor 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.stellacomedy.com/ Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}