{"link": "https://www.themoviedb.org/tv/3195?language=en", "title": "Gene Simmons Family Jewels", "resume": "Gene Simmons Family Jewels is an American reality television series that premiered on A&E on August 7, 2006. The show follows the life of KISS bassist and vocalist Gene Simmons, his longtime partner and wife Shannon Tweed, and their two children, Nick and Sophie. Although it is presented as a reality series, it has been noted that some events shown on the show did not actually occur. One of these events was depicted in the finale of Season 3, where the viewer is led to believe that Gene purchased the Australian Football team Carlton Football Club, while in reality there is no record of the team being sold to him. In addition to this, the episode shows Gene convincing Brendan Fevola to join Carlton Football Club, while in reality Fevola had been playing for Carlton since he was drafted in 1998. Other events include casting biker extras, as well as a bit actor in the show.\nPrior to the third season, the series was the second highest rated series on A&E, behind Dog the Bounty Hunter. In Australia, the series is shown on the The Biography Channel every Wednesday at 8:30 pm on Foxtel and Austar. It is also shown on the free to air channel 7mate. The first three seasons were played back to back ending on April 1, 2009. Seasons 1-5 have been released on DVD. Season 6 premiered on June 14, 2011 on A&E with the episode \"Breaking Up Is Hard To Do.\" In addition to relationship troubles between Simmons and Tweed, that culminated in the two marrying, the season shows Simmons' March 2011 visit to Israel. After the show’s most successful season ever, Gene Simmons Family Jewels returned for its seventh season on Monday, May 28, 2012 with a special one-hour premiere. In August 2012, A&E announced the seventh season will be the last, and Simmons added that he will not shop the series to other networks and, instead, will focus on the KISS tour and other business commitments.", "rate": 44, "genre": [], "cast": ["Shannon Tweed", "Gene Simmons", "Sophie Simmons", "Nick Simmons", "Tracy Tweed"], "character": ["Himself", "Himself", "Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3195   Expand Gene Simmons Family Jewels   (2006) User Score Overview Gene Simmons Family Jewels is an American reality television series that premiered on A&E on August 7, 2006. The show follows the life of KISS bassist and vocalist Gene Simmons, his longtime partner and wife Shannon Tweed, and their two children, Nick and Sophie. Although it is presented as a reality series, it has been noted that some events shown on the show did not actually occur. One of these events was depicted in the finale of Season 3, where the viewer is led to believe that Gene purchased the Australian Football team Carlton Football Club, while in reality there is no record of the team being sold to him. In addition to this, the episode shows Gene convincing Brendan Fevola to join Carlton Football Club, while in reality Fevola had been playing for Carlton since he was drafted in 1998. Other events include casting biker extras, as well as a bit actor in the show. Prior to the third season, the series was the second highest rated series on A&E, behind Dog the Bounty Hunter. In Australia, the series is shown on the The Biography Channel every Wednesday at 8:30 pm on Foxtel and Austar. It is also shown on the free to air channel 7mate. The first three seasons were played back to back ending on April 1, 2009. Seasons 1-5 have been released on DVD. Season 6 premiered on June 14, 2011 on A&E with the episode \"Breaking Up Is Hard To Do.\" In addition to relationship troubles between Simmons and Tweed, that culminated in the two marrying, the season shows Simmons' March 2011 visit to Israel. After the show’s most successful season ever, Gene Simmons Family Jewels returned for its seventh season on Monday, May 28, 2012 with a special one-hour premiere. In August 2012, A&E announced the seventh season will be the last, and Simmons added that he will not shop the series to other networks and, instead, will focus on the KISS tour and other business commitments. Featured Crew Gene Simmons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shannon Tweed Himself Gene Simmons Himself Sophie Simmons Herself Nick Simmons Himself Tracy Tweed Himself Full Cast & Crew Last Season Season 7 2012 | 15 Episodes Season 7 of Gene Simmons Family Jewels premiered on May 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2004-08-31 Dog the Bounty Hunter 3.4    2005-07-20 Criss Angel Mindfreak 4.2    2010-02-07 Celebrity Undercover Boss 5.0    1998-11-09 Big Train 7.5    2004-07-01 The Soup 4.9    1986-09-15 L.A. Law 7.2    1993-08-27 The Adventures of Brisco County, Jr. 7.6    2008-12-03 Man v. Food 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.aetv.com/gene-simmons-family-jewels/ Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 9 harry117 2 Rug TB 1 TMDb Bot 1 Jay Webster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}