{"link": "https://www.themoviedb.org/tv/53536?language=en", "title": "Dates", "resume": "Dates is a British television romantic drama series created by Bryan Elsley, who also created Skins, which first aired on Channel 4 on 10 June 2013, at 22:00, as part of its \"Mating Season\" programming, illustrating a series of first dates between online dating service users. The show's target audience is \"ABC1\".", "rate": 70, "genre": ["Drama"], "cast": ["Will Mellor", "Ben Chaplin", "Gemma Chan", "Oona Chaplin"], "character": ["David", "Stephen", "Erica", "Mia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53536   Expand Dates   (2013) User Score Overview Dates is a British television romantic drama series created by Bryan Elsley, who also created Skins, which first aired on Channel 4 on 10 June 2013, at 22:00, as part of its \"Mating Season\" programming, illustrating a series of first dates between online dating service users. The show's target audience is \"ABC1\". Featured Crew Bryan Elsley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Mellor David Ben Chaplin Stephen Gemma Chan Erica Oona Chaplin Mia Full Cast & Crew Last Season Season 1 2013 | 9 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dates. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.channel4.com/programmes/dates Genres Drama Keywords london england blind date romantic comedy dating young love online dating first date internet dating Content Score 93 Almost there... Top Contributors 27 prm96 9 Elizabeth Jennings 6 Banana z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}