{"link": "https://www.themoviedb.org/tv/2165?language=en", "title": "DIY SOS", "resume": "DIY SOS is a British DIY television series made for the BBC, presented by Nick Knowles. The first episode was broadcast on 7 October 1999 and the show is still airing today. As well as being a DIY programme it also features comic relief from the cast.", "rate": 0, "genre": [], "cast": ["Lowri Turner", "Kate McIntyre", "Nick Knowles"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2165   Expand DIY SOS   (1999) User Score  Play Trailer Overview DIY SOS is a British DIY television series made for the BBC, presented by Nick Knowles. The first episode was broadcast on 7 October 1999 and the show is still airing today. As well as being a DIY programme it also features comic relief from the cast. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lowri Turner Kate McIntyre Nick Knowles Full Cast & Crew Last Season Season 23 2012 | 10 Episodes Season 23 of DIY SOS premiered on January 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on DIY SOS. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 2 tigru89 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}