{"link": "https://www.themoviedb.org/tv/65665?language=en", "title": "The Legend of Zu", "resume": "He was the chosen one. Lu Pao is a dangerous swordsman who is out to get his hands on the powerful Red Ghost Stone. The Sushan School, China’s most famous and influential martial arts school, is the guardian of the stone and protector of the world. The school’s headmaster puts the precious Red Ghost Stone into the body of the talented young swordsman Ding Yin in order to keep it from falling into Lu Pao’s hands. Ding Yin enters the Sushan School to train to become the best swordsman in the world and vows to keep the world safe from the evil doings of Lu Pao. But then Ding Yin meets Lu Pao’s daughter, Yu Wu Xing, who looks just like his dead wife. When Ding Yin falls in love with Wu Xing, will he be able to carry out his mission?", "rate": 70, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Zhao Liying", "William Chan Wai-Ting", "Janice Man", "Nicky Wu", "Fan Siu-Wong"], "character": ["Yu Wu Xin", "Ding Yin", "Zhou Qing Yun", "Shangguan Jing Wo", "Gongsun Wu Wo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65665   Expand The Legend of Zu   (2015) User Score Overview He was the chosen one. Lu Pao is a dangerous swordsman who is out to get his hands on the powerful Red Ghost Stone. The Sushan School, China’s most famous and influential martial arts school, is the guardian of the stone and protector of the world. The school’s headmaster puts the precious Red Ghost Stone into the body of the talented young swordsman Ding Yin in order to keep it from falling into Lu Pao’s hands. Ding Yin enters the Sushan School to train to become the best swordsman in the world and vows to keep the world safe from the evil doings of Lu Pao. But then Ding Yin meets Lu Pao’s daughter, Yu Wu Xing, who looks just like his dead wife. When Ding Yin falls in love with Wu Xing, will he be able to carry out his mission? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhao Liying Yu Wu Xin William Chan Wai-Ting Ding Yin Janice Man Zhou Qing Yun Nicky Wu Shangguan Jing Wo Fan Siu-Wong Gongsun Wu Wo Full Cast & Crew Last Season Season 1 2015 | 56 Episodes Season 1 of The Legend of Zu premiered on September 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Zu. You can help by rating TV shows you've seen. Facts Original Name  蜀山战纪之剑侠传奇 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/jsstrawbear Genres Drama Sci-Fi & Fantasy Keywords china xianxia Content Score 86 Almost there... Top Contributors M 44 Maria180493 5 Elizabeth Jennings 3 lemonlyman 1 whm  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}