{"link": "https://www.themoviedb.org/tv/870?language=en", "title": "My 19 Year Old Sister-in-Law", "resume": "My 19 Year Old Sister-in-Law is a 2004 South Korean television series starring Jung Da-bin, Yoon Kye-sang, Kim Jae-won and Kim Min-hee. It aired on SBS from July 28 to September 23, 2004 on Wednesdays and Thursdays at 21:55 for 16 episodes.", "rate": 0, "genre": ["Drama"], "cast": ["Jeong Da-bin", "Yoon Kye-sang", "Lee Bo-hee", "Heo Jung-min"], "character": ["한유민", "Kang Seung-jae", "Park Young-ran", "Han Kang-pyo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 870   Expand My 19 Year Old Sister-in-Law   (2004) User Score Overview My 19 Year Old Sister-in-Law is a 2004 South Korean television series starring Jung Da-bin, Yoon Kye-sang, Kim Jae-won and Kim Min-hee. It aired on SBS from July 28 to September 23, 2004 on Wednesdays and Thursdays at 21:55 for 16 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeong Da-bin 한유민 Yoon Kye-sang Kang Seung-jae Lee Bo-hee Park Young-ran Heo Jung-min Han Kang-pyo Full Cast & Crew Last Season Season 1 2004 | 16 Episodes Season 1 of My 19 Year Old Sister-in-Law premiered on July 28, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My 19 Year Old Sister-in-Law. You can help by rating TV shows you've seen. Facts Original Name  형수님은 열아홉 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://tv.sbs.co.kr/collection/sbs_review_list.jsp?vod_id=V0000280088 Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors N 18 Nightowl.Kr t 3 tmdb38202327 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}