{"link": "https://www.themoviedb.org/tv/62694?language=en", "title": "Peg + Cat", "resume": "Meet Peg, a curious and spunky preschooler, and her feline companion, Cat, who will rely on math \"to tackle social and relationship issues and everyday problems like cleaning up a messy bedroom,\" Rotenberg says. Some of their dilemmas may be zany — like how to get 100 chickens back into their coop or how to feed a horde of hungry pirates with just one banana — but it's all solvable via mathematics and a zippy song.", "rate": 80, "genre": ["Kids", "Animation"], "cast": ["Hayley Faith Negrin", "Dwayne Hill", "Christian Distefano", "Thamela Mpumlwana"], "character": ["Peg", "Cat", "Richard", "Ramone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62694   Expand Peg + Cat   (2013) User Score  Play Trailer Overview Meet Peg, a curious and spunky preschooler, and her feline companion, Cat, who will rely on math \"to tackle social and relationship issues and everyday problems like cleaning up a messy bedroom,\" Rotenberg says. Some of their dilemmas may be zany — like how to get 100 chickens back into their coop or how to feed a horde of hungry pirates with just one banana — but it's all solvable via mathematics and a zippy song. Featured Crew Billy Aronson Creator Jennifer Oxley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hayley Faith Negrin Peg Dwayne Hill Cat Christian Distefano Richard Thamela Mpumlwana Ramone Full Cast & Crew Last Season Season 2 2016 | 23 Episodes Season 2 of Peg + Cat premiered on April  4, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Peg + Cat. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Peg + Cat. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m Homepage   http://pbskids.org/peg/ Genres Kids Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 29 Elizabeth Jennings J 13 James A 8 Angyl n 3 nicbrown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}