{"link": "https://www.themoviedb.org/tv/56425?language=en", "title": "Baki the Grappler", "resume": "Baki Hanma is a young fighter who yearns to follow in the  footsteps of his father, Yujiro, and become the strongest fighter in the  world. Thru that he trains tirelessly and fights constantly to hone his  skills and develop his body to achieve these goals. Many intense  battles lay ahead of Baki as he goes about his quest to be the best and  ultimately take the title of \"King\" from his father.", "rate": 100, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56425   Expand Baki the Grappler   (2001) User Score Overview Baki Hanma is a young fighter who yearns to follow in the  footsteps of his father, Yujiro, and become the strongest fighter in the  world. Thru that he trains tirelessly and fights constantly to hone his  skills and develop his body to achieve these goals. Many intense  battles lay ahead of Baki as he goes about his quest to be the best and  ultimately take the title of \"King\" from his father. Featured Crew Keisuke Itagaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2012 | 24 Episodes Season 2 of Baki the Grappler premiered on July  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Baki the Grappler. You can help by rating TV shows you've seen. Facts Original Name  グラップラー刃牙 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.bakithegrappler.com/ Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors J 9 JohnyB0y S 6 Sokarius t 5 tmdb983464 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}