{"link": "https://www.themoviedb.org/tv/12331?language=en", "title": "Your Show of Shows", "resume": "Your Show of Shows was a live 90-minute variety show that was broadcast weekly in the United States on NBC, from February 25, 1950, until June 5, 1954, featuring Sid Caesar and Imogene Coca.\nOther featured performers were Carl Reiner, Howard Morris, Bill Hayes, Judy Johnson, The Hamilton Trio and the soprano Marguerite Piazza. José Ferrer made several guest appearances on the series. The series was telecast from the now-demolished International Theatre at 5 Columbus Circle and the Century Theater, now demolished, in New York.\nDuring 2002, Your Show of Shows was ranked #30 on TV Guide's 50 Greatest TV Shows of All Time.", "rate": 0, "genre": ["Comedy"], "cast": ["Carl Reiner", "Imogene Coca", "Sid Caesar", "Howard Morris"], "character": ["Himself", "Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12331   Expand Your Show of Shows   (1950) User Score Overview Your Show of Shows was a live 90-minute variety show that was broadcast weekly in the United States on NBC, from February 25, 1950, until June 5, 1954, featuring Sid Caesar and Imogene Coca. Other featured performers were Carl Reiner, Howard Morris, Bill Hayes, Judy Johnson, The Hamilton Trio and the soprano Marguerite Piazza. José Ferrer made several guest appearances on the series. The series was telecast from the now-demolished International Theatre at 5 Columbus Circle and the Century Theater, now demolished, in New York. During 2002, Your Show of Shows was ranked #30 on TV Guide's 50 Greatest TV Shows of All Time. Featured Crew Sylvester Weaver Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carl Reiner Himself Imogene Coca Herself Sid Caesar Himself Howard Morris Himself Full Cast & Crew Last Season Season 5 1953 | 24 Episodes Season 5 of Your Show of Shows premiered on September 12, 1953. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Your Show of Shows. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Comedy Keywords variety show Content Score 93 Almost there... Top Contributors 8 Banana R 3 Rebecca BD 2 Bob Daredevil 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}