{"link": "https://www.themoviedb.org/tv/61059?language=en", "title": "Doll & Em", "resume": "Doll & Em is a British comedy series starring real-life friends Emily Mortimer (Em) and Dolly Wells (Doll), filmed in the style of a reality TV show. After a breakup, Doll heads to Hollywood to be with her childhood best friend Em, who's now a successful actress.", "rate": 66, "genre": ["Comedy"], "cast": ["Emily Mortimer", "Dolly Wells"], "character": ["Em", "Doll"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61059   Expand Doll & Em   (2014) User Score  Play Trailer Overview Doll & Em is a British comedy series starring real-life friends Emily Mortimer (Em) and Dolly Wells (Doll), filmed in the style of a reality TV show. After a breakup, Doll heads to Hollywood to be with her childhood best friend Em, who's now a successful actress. Featured Crew Emily Mortimer Creator Dolly Wells Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emily Mortimer Em Dolly Wells Doll Full Cast & Crew Last Season Season 2 2015 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations   2015-04-26 HAPPYish 6.9    2016-01-21 Baskets 7.2    2014-08-28 Red Oaks 7.6    2015-01-11 Togetherness 6.0    2015-01-14 Man Seeking Woman 6.7  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.sky.com/tv/show/doll-and-em Genres Comedy Keywords female friendship hollywood actress british humour Content Score 71 Just a little bit more... Top Contributors S 25 Sandor 9 Elizabeth Jennings 8 Banana 4 dimqua  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}