{"link": "https://www.themoviedb.org/tv/5398?language=en", "title": "Cleopatra 2525", "resume": "Cleopatra 2525 is an American science fiction television series that aired in syndication for two seasons, from January 2000 to March 2001. It appeared as the first part of the Back2Back Action Hour, followed by Jack of All Trades.", "rate": 57, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Gina Torres", "Victoria Pratt", "Jennifer Sky"], "character": ["Helen Carter", "Rose 'Sarge'"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5398   Expand Cleopatra 2525   (2000) User Score Overview Cleopatra 2525 is an American science fiction television series that aired in syndication for two seasons, from January 2000 to March 2001. It appeared as the first part of the Back2Back Action Hour, followed by Jack of All Trades. Featured Crew Robert Tapert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gina Torres Helen Carter Victoria Pratt Rose 'Sarge' Jennifer Sky Full Cast & Crew Last Season Season 2 2000 | 14 Episodes Season 2 of Cleopatra 2525 premiered on October  2, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1973-09-08 Star Trek: The Animated Series 6.5    1989-09-18 Alien Nation 6.9    1974-01-18 The Six Million Dollar Man 6.6  Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 7 Mitsarinho R 4 Rebecca 3 lineker w 2 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}