{"link": "https://www.themoviedb.org/tv/57389?language=en", "title": "Klondike", "resume": "The lives of two childhood best friends, Bill and Epstein, in the late 1890s as they flock to the gold rush capital in the untamed Yukon Territory. This man-versus-nature tale places our heroes in a land full of undiscovered wealth, but ravaged by harsh conditions, unpredictable weather and desperate, dangerous characters including greedy businessmen, seductive courtesans and native tribes witnessing the destruction of their people and land by opportunistic entrepreneurs.", "rate": 69, "genre": ["Drama", "Western"], "cast": ["Richard Madden", "Abbie Cornish", "Sam Shepard", "Tim Roth", "Tim Blake Nelson"], "character": ["Bill Haskell", "Belinda", "Father Judge", "The Count", "Joe Meeker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57389   Expand Klondike   (2014) User Score  Play Trailer Overview The lives of two childhood best friends, Bill and Epstein, in the late 1890s as they flock to the gold rush capital in the untamed Yukon Territory. This man-versus-nature tale places our heroes in a land full of undiscovered wealth, but ravaged by harsh conditions, unpredictable weather and desperate, dangerous characters including greedy businessmen, seductive courtesans and native tribes witnessing the destruction of their people and land by opportunistic entrepreneurs. Featured Crew Simon Cellan Jones Creator Rachel Abramowitz Creator Paul Scheuring Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Madden Bill Haskell Abbie Cornish Belinda Sam Shepard Father Judge Tim Roth The Count Tim Blake Nelson Joe Meeker Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of Klondike premiered on January 20, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  8 Posters  3 Recommendations   2006-01-01 In Justice 6.8    2011-01-13 Kidnap and Ransom 7.6    2012-08-30 Good Cop 6.6    2016-06-08 Power Monkeys 7.0    2014-09-28 The Brokenwood Mysteries 7.6    2011-06-06 Injustice 7.3    2016-10-12 Rosehaven 6.5    2013-08-25 What Remains 7.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.discovery.com/tv-shows/klondike/ Genres Drama Western Keywords gold rush miniseries yukon klondike gold rush 19th century northern canada Content Score 100 Yes! Looking good! Top Contributors p 25 pablo1974 23 midnightmark TB 19 TMDb Bot 16 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}