{"link": "https://www.themoviedb.org/tv/80477?language=en", "title": "Angels of Death", "resume": "Most girls waking up without any memory and meeting a serial killer would panic, but not Rachel. In fact, far from being her biggest problem, killer Zack might just prove a convenient resource when it comes to finding a way out of the building in which they're both trapped!", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Drama", "Mystery"], "cast": ["Haruka Chisuga", "Nobuhiko Okamoto"], "character": ["Rachel (voice)", "Zack (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80477   Expand Angels of Death   (2018) User Score Overview Most girls waking up without any memory and meeting a serial killer would panic, but not Rachel. In fact, far from being her biggest problem, killer Zack might just prove a convenient resource when it comes to finding a way out of the building in which they're both trapped! Featured Crew Kentarou Suzuki Creator Yoshinobu Fujioka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Chisuga Rachel (voice) Nobuhiko Okamoto Zack (voice) Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Angels of Death is set to premiere on July  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Facts Original Name  殺戮の天使 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://satsuriku.com Genres Animation Action & Adventure Drama Mystery Keywords horror based on video game anime Content Score 71 Just a little bit more... Top Contributors 34 Marr 🇳🇱 M 8 MasterX1027 6 jmf2k 3 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}