{"link": "https://www.themoviedb.org/tv/32997?language=en", "title": "Dual Survival", "resume": "Dual Survival is an American reality cable television series aired on the Discovery Channel. The show features a pair of survival experts in challenging environments.\nFor the first two seasons the show featured the differing outdoor survival philosophies and skills of Cody Lundin, a naturalist and primitive-skills expert who runs the Aboriginal Living Skills School in Arizona and Dave Canterbury, a military-trained survival instructor who runs the Pathfinder Training School in Ohio. Beginning with the third season, Canterbury was replaced with Joseph \"Joe\" Teti.", "rate": 78, "genre": ["Reality", "Action", "Adventure"], "cast": ["Jeff Zausch", "EJ Snyder"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32997   Expand Dual Survival   (2010) User Score  Play Trailer Overview Dual Survival is an American reality cable television series aired on the Discovery Channel. The show features a pair of survival experts in challenging environments. For the first two seasons the show featured the differing outdoor survival philosophies and skills of Cody Lundin, a naturalist and primitive-skills expert who runs the Aboriginal Living Skills School in Arizona and Dave Canterbury, a military-trained survival instructor who runs the Pathfinder Training School in Ohio. Beginning with the third season, Canterbury was replaced with Joseph \"Joe\" Teti. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  5 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Zausch EJ Snyder Full Cast & Crew Last Season Season 9 2016 | 7 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply Any Fans Lurking... Open 3 by  SirTJ Another Season? Open 0 by Rick\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dual Survival. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.dsc.discovery.com/tv/dual-survival/ Genres Reality Action & Adventure Keywords survival nature Content Score 64 We're so close, yet so far. Top Contributors 20 Bearsgoroar 10 Banana TB 9 TMDb Bot 7 jackesdavid  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}