{"link": "https://www.themoviedb.org/tv/61102?language=en", "title": "Ngao Asoke", "resume": "Monthai Mahataweit the a young man of 18 years old is handsome and amazing in every way whether it’s education or his family’s name. He is also the only son of a wealthy official Jao Khun Mahat and Khun Ying (Lady) Tap Tim. He is the lover of Viyada Hiranwat a pretty young lady who is approved by Khun Ying Tap Tim because she is equal in rank and status she also wants to them to get engaged before Monthai goes to school overseas.\nOne day the little girl Bpee climbs the fence while Viyda was imploring and whiny with Monthai; causing Bpee to no longer hold in her laugh; embarrassed Viyada starts to beat and hit Bpee but Monthai helps her and asks her until he finds out that she lives with her grandmother “Yai Tiam” at the broken down hut; and that she climbed the gate because she wanted to pick the “Asoke” (Indian Flowering Plant) for food. Monthai out of pity gives her a small amount of money. Even though it was small to Bpee it was alot of money this had made a mark in her heart and placed Monthai as her benevolent person.\nJao Khun Mahat is a playboy type that has many wives and in those include nuan Nou Cha’s mother. Nou Cha is Monthai’s half brother and someone that Monthai is very close to and loves dearly. Tap Tip is afraid that Monthai is going to be like his father so she harrassed Lukkana an innocent young girl and the mother of the female kitchen maid. She does so because she is afraid that Lukkana will seduce Monthai causing Lukkana to get slapped and beat around often. With no choice Khun Jian which is Tap Tim’s best friend and head housekeeper warns Monthai to stay away and leave Lukkana alone for awhile, but Monthai doesn’t believe her because he thinks of Lukkana only as a little sister.\nOne day Wet Viyada’s father accidentally hits Yai Tiam causing her death. Before her death She had asked Weit to take care of Bpee. Viyda and her mother uses and abuses Bpee as she is a servant .. the only person in the house who cares about Bpee was Wiparwarn Viyada’s little sister. Viyada starts using Bpee as a messenger between her and monthai .. giving Bpee a chance to get to know how sweet and gentle Monthai is causing her to worship him even more. He buys an evening dress for her to join the party sending him off to school. Viyda is very angry and behind Monthai she secretly pinches Bpee out of jealousy and tells her to go home. Bpee goes and cry in a bushes and accidentally falls asleep.Monthai comes by and sees her and carries her home. While going home he accidentally bumps into Lukkana causing her to screeam. Jian and Tap tim comes and see them and thinks that have hid to flirt around. She beats Lukkana and then goes and slap her mother too. Monthai tries to stop his mother but it doesn’t work. Monthai promises to help prove Lukkana’s innocence in the morning, but before the morning Monthai and his mother has to see a gory image Lukkana had hanged herself to death. The relationship between mother and son falls apart once Monthai announces that he will never come home to let his mother see again.\nOn his departure date Bpee follows to send Monthai off and giving him a handkerchief with his name sewn into it Monthai then picks up an asoke flower that had fallen into the ground and gives it to her and tells her that no matter how far he goes he will always give her support.\nAfter that Bpee has to move with Viyada’s family to Chiang Mai 10 years later Viyada is a different person who see’s many different man at the same time. The latest guy that Viyada had set sights on is Por Liang Pong In a rich and very attractive man the owner of a lumber company at the same time that Monthai is still writing love letters to Viyada always without knowing that the entire time it is actually Bpee that he is writing to him.. Bpee is close to Pong in and knows from him that the reason why he still carries himself single is because he has a harsh past with Maen Ward Bpees english language teacher from middle school.\nAfter Monthai goes to continue school his father dies and his mother falls ill because her heart is still mourning. She is sick with a heart disease and also psychologically. Wipahwarn suggests Bpee goes and take care of her in place of Viyada who doesn’t want to go. Once Bpee arives she sees Tap Tim going into a shock seizure so she gives Tap Tim her finger to bite. Jian comes and see and realizes that its Bpee that was sent and not Viyada after mending Bpee’s wounds she takes her up to give respect and greet Tap Tim. Tap Tim doesn’t remember Bpee and calls her Viyada so Jian tells Bpee to pretend to be Viyada for awhile. Guer who is Monthais friend and Tap Tim’s doctor comes and is shocked because Tap Tim has improved alot since Bpee came.. he also starts to mistake Bpee for Viyada Monthai’s lover.\nOn the day that Monthai returns home Guer is the one that picks him up and drop him off. Monthai then asks about his mother condition. Guer tells him that his mother has gotten better because Viyada has been taking close care of her causing her to get better. Monthai quickly goes back to Mahataweit but is upset to find that it’s Bpee and that she had lied and pretended to be Viyada. Tap Tim is very angry that Monthai is back and also tries to get them to marry .. Monthai seeing that Pbee didn’t stop her. He assumes that she is trying to find the chance to marry him. Bpee is very upset so she responds that she already has a lover.\nMonthai pretends to have love scenes towards Bpee by hugging and kissing her even in front of his mother and khun Jian to where Khun Jian has had to openly warn him. But Khun Ying Tap Tim likes it and backs them up to get closer. She even suggests Monthai to take Bpee out. While out they both bump into Maenward and Set Tee a young bankers son who followed Maen ward since Australia. Bpee asks Monthai to take her and send a telegram so she can call Pong In and tell him about Maen Ward. Monthai mistakes that she is calling her lover so he sarcastically sends one also.\nViyda goes to a party hosted by Pong In and sees that Sood Samoun a nurse has already been scoring points with Pong In. So she decides to seduce Pong In. Pong In denies her and then she cuts their relationship off and drinks in anger. That same night Keitchai who had been following her in hopes of getting with her thought that once he has slept with her then he will go and ask for her hand in marriage but she disses him and disrespect him saying he has no proper family name.\nViyada gets Monthai telegraph and goes down to mahataweit to see him and Monthai is afraid that she won’t be able to face his mother so Bpee goes and confesses the truth to Tap Tim instead of getting angry she is still attached to Bpee because of her kindness. Once Viayda gets there she is jealous of Bpee … On Pong In side gets Bpee telegram and quickly comes down to bangkok in hopes of getting back together with Maen ward but no matter what it doesn’t seem to work so he goes and ask Bpee for help. Monthai sees and mistakes him for her lover.\nNou Cha gets back from America after getting his master in interior design. Wiparwarn comes down to bangkok and tells him of what is going on between Monthai and Bpee and the two plan to get them to understand each other Viyada finds out and tries to tear Bpee’s face and embarrass her in front of everyone but it doesn’t work out she gets angry that the two had planned to help Bpee and Monthai so she goes and take revenge by going to see Nang Noun Nou Cha’s mother and convincing her that Nou Chai and Wi Par Warn doesn’t belong together because they are unequal in status. His mother then asks him to break it off with Wiparwarn … Nou Cha loves his mother alot so he sets Wiparwarn up to misunderstand by putting Bpee’s earing in his car for her to misunderstand. Bpee then finds a way for the two to work things out.\nAfter a tireless attempt in order to get back with Maen Ward Pong in gives up and decides to go home so he goes and says goodbye to Bpee at Mahatweit .. Viyada sees and then calls Monthai causing both sides to argue and Khun Jian comes and stop them and takes them to see Khun Ying tap Tim. Tap Tim tells Pong in that if he wants to date Bpeeyachat he should do it correctly and come through the doors properly. Pong In laughs and tell the everyone that they are mistaken and that woman he loves is Maenward. Monthai then decides to help by inviting Pong In and Maeward to the beach for a break along with him and Viyada followed by Bpee and Set Tee. While there Bpee and Monthai gets closer but Viyada interupts. Once back Monthai decides that it’s time for him to get his marriage plans with Viayda on the way. But Khun Ying suddenly fall ill causing Monthai have to push the wedding indefinitely. Nou Cha had finally proven himself to Wiparwarn’s parents and they now allow them to get married since most of it was because of Bpees help. Khun Ying is very fond of this and calls Monthai to tell him that if she gives all of her money and wealth to Bpee will Viayda still marry him? Monthai is certain that Viyada doesn’t care about the wealth and riches and tells her to do as she pleases. Viyada who is eavesdropping outside hears this and then tries to find a way to take revenge.\nViyda starts a psychological war and pretends to be Lukkana causing Khun Ying Tap Tim’s death. Viyada dreams that she will marry Monthai and get Mahatwiet but once they open the will Viyada realizes that Khun Ying gave half and half of her belongings to Monthai and Bpee. Viyada then accuses bpee of pretending to be Lukkana’s ghost to scare her to death. Bpee doesn’t have anyone to support her and she doesn’t even open her mouth to deny. Monthai is very angry so tells her to go away.", "rate": 60, "genre": ["Soap", "Drama"], "cast": ["Nawat Kulrattanarak", "Kanya Leenutapong", "Panwad Hemmanee", "Kalaya Jirachaisakdecha", "Oak Smith"], "character": ["Monthai", "Bpeeyachat", "Vidya", "Wiparwarn", "Anucha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61102   Expand Ngao Asoke   (2008) User Score Overview Monthai Mahataweit the a young man of 18 years old is handsome and amazing in every way whether it’s education or his family’s name. He is also the only son of a wealthy official Jao Khun Mahat and Khun Ying (Lady) Tap Tim. He is the lover of Viyada Hiranwat a pretty young lady who is approved by Khun Ying Tap Tim because she is equal in rank and status she also wants to them to get engaged before Monthai goes to school overseas. One day the little girl Bpee climbs the fence while Viyda was imploring and whiny with Monthai; causing Bpee to no longer hold in her laugh; embarrassed Viyada starts to beat and hit Bpee but Monthai helps her and asks her until he finds out that she lives with her grandmother “Yai Tiam” at the broken down hut; and that she climbed the gate because she wanted to pick the “Asoke” (Indian Flowering Plant) for food. Monthai out of pity gives her a small amount of money. Even though it was small to Bpee it was alot of money this had made a mark in her heart and placed Monthai as her benevolent person. Jao Khun Mahat is a playboy type that has many wives and in those include nuan Nou Cha’s mother. Nou Cha is Monthai’s half brother and someone that Monthai is very close to and loves dearly. Tap Tip is afraid that Monthai is going to be like his father so she harrassed Lukkana an innocent young girl and the mother of the female kitchen maid. She does so because she is afraid that Lukkana will seduce Monthai causing Lukkana to get slapped and beat around often. With no choice Khun Jian which is Tap Tim’s best friend and head housekeeper warns Monthai to stay away and leave Lukkana alone for awhile, but Monthai doesn’t believe her because he thinks of Lukkana only as a little sister. One day Wet Viyada’s father accidentally hits Yai Tiam causing her death. Before her death She had asked Weit to take care of Bpee. Viyda and her mother uses and abuses Bpee as she is a servant .. the only person in the house who cares about Bpee was Wiparwarn Viyada’s little sister. Viyada starts using Bpee as a messenger between her and monthai .. giving Bpee a chance to get to know how sweet and gentle Monthai is causing her to worship him even more. He buys an evening dress for her to join the party sending him off to school. Viyda is very angry and behind Monthai she secretly pinches Bpee out of jealousy and tells her to go home. Bpee goes and cry in a bushes and accidentally falls asleep.Monthai comes by and sees her and carries her home. While going home he accidentally bumps into Lukkana causing her to screeam. Jian and Tap tim comes and see them and thinks that have hid to flirt around. She beats Lukkana and then goes and slap her mother too. Monthai tries to stop his mother but it doesn’t work. Monthai promises to help prove Lukkana’s innocence in the morning, but before the morning Monthai and his mother has to see a gory image Lukkana had hanged herself to death. The relationship between mother and son falls apart once Monthai announces that he will never come home to let his mother see again. On his departure date Bpee follows to send Monthai off and giving him a handkerchief with his name sewn into it Monthai then picks up an asoke flower that had fallen into the ground and gives it to her and tells her that no matter how far he goes he will always give her support. After that Bpee has to move with Viyada’s family to Chiang Mai 10 years later Viyada is a different person who see’s many different man at the same time. The latest guy that Viyada had set sights on is Por Liang Pong In a rich and very attractive man the owner of a lumber company at the same time that Monthai is still writing love letters to Viyada always without knowing that the entire time it is actually Bpee that he is writing to him.. Bpee is close to Pong in and knows from him that the reason why he still carries himself single is because he has a harsh past with Maen Ward Bpees english language teacher from middle school. After Monthai goes to continue school his father dies and his mother falls ill because her heart is still mourning. She is sick with a heart disease and also psychologically. Wipahwarn suggests Bpee goes and take care of her in place of Viyada who doesn’t want to go. Once Bpee arives she sees Tap Tim going into a shock seizure so she gives Tap Tim her finger to bite. Jian comes and see and realizes that its Bpee that was sent and not Viyada after mending Bpee’s wounds she takes her up to give respect and greet Tap Tim. Tap Tim doesn’t remember Bpee and calls her Viyada so Jian tells Bpee to pretend to be Viyada for awhile. Guer who is Monthais friend and Tap Tim’s doctor comes and is shocked because Tap Tim has improved alot since Bpee came.. he also starts to mistake Bpee for Viyada Monthai’s lover. On the day that Monthai returns home Guer is the one that picks him up and drop him off. Monthai then asks about his mother condition. Guer tells him that his mother has gotten better because Viyada has been taking close care of her causing her to get better. Monthai quickly goes back to Mahataweit but is upset to find that it’s Bpee and that she had lied and pretended to be Viyada. Tap Tim is very angry that Monthai is back and also tries to get them to marry .. Monthai seeing that Pbee didn’t stop her. He assumes that she is trying to find the chance to marry him. Bpee is very upset so she responds that she already has a lover. Monthai pretends to have love scenes towards Bpee by hugging and kissing her even in front of his mother and khun Jian to where Khun Jian has had to openly warn him. But Khun Ying Tap Tim likes it and backs them up to get closer. She even suggests Monthai to take Bpee out. While out they both bump into Maenward and Set Tee a young bankers son who followed Maen ward since Australia. Bpee asks Monthai to take her and send a telegram so she can call Pong In and tell him about Maen Ward. Monthai mistakes that she is calling her lover so he sarcastically sends one also. Viyda goes to a party hosted by Pong In and sees that Sood Samoun a nurse has already been scoring points with Pong In. So she decides to seduce Pong In. Pong In denies her and then she cuts their relationship off and drinks in anger. That same night Keitchai who had been following her in hopes of getting with her thought that once he has slept with her then he will go and ask for her hand in marriage but she disses him and disrespect him saying he has no proper family name. Viyada gets Monthai telegraph and goes down to mahataweit to see him and Monthai is afraid that she won’t be able to face his mother so Bpee goes and confesses the truth to Tap Tim instead of getting angry she is still attached to Bpee because of her kindness. Once Viayda gets there she is jealous of Bpee … On Pong In side gets Bpee telegram and quickly comes down to bangkok in hopes of getting back together with Maen ward but no matter what it doesn’t seem to work so he goes and ask Bpee for help. Monthai sees and mistakes him for her lover. Nou Cha gets back from America after getting his master in interior design. Wiparwarn comes down to bangkok and tells him of what is going on between Monthai and Bpee and the two plan to get them to understand each other Viyada finds out and tries to tear Bpee’s face and embarrass her in front of everyone but it doesn’t work out she gets angry that the two had planned to help Bpee and Monthai so she goes and take revenge by going to see Nang Noun Nou Cha’s mother and convincing her that Nou Chai and Wi Par Warn doesn’t belong together because they are unequal in status. His mother then asks him to break it off with Wiparwarn … Nou Cha loves his mother alot so he sets Wiparwarn up to misunderstand by putting Bpee’s earing in his car for her to misunderstand. Bpee then finds a way for the two to work things out. After a tireless attempt in order to get back with Maen Ward Pong in gives up and decides to go home so he goes and says goodbye to Bpee at Mahatweit .. Viyada sees and then calls Monthai causing both sides to argue and Khun Jian comes and stop them and takes them to see Khun Ying tap Tim. Tap Tim tells Pong in that if he wants to date Bpeeyachat he should do it correctly and come through the doors properly. Pong In laughs and tell the everyone that they are mistaken and that woman he loves is Maenward. Monthai then decides to help by inviting Pong In and Maeward to the beach for a break along with him and Viyada followed by Bpee and Set Tee. While there Bpee and Monthai gets closer but Viyada interupts. Once back Monthai decides that it’s time for him to get his marriage plans with Viayda on the way. But Khun Ying suddenly fall ill causing Monthai have to push the wedding indefinitely. Nou Cha had finally proven himself to Wiparwarn’s parents and they now allow them to get married since most of it was because of Bpees help. Khun Ying is very fond of this and calls Monthai to tell him that if she gives all of her money and wealth to Bpee will Viayda still marry him? Monthai is certain that Viyada doesn’t care about the wealth and riches and tells her to do as she pleases. Viyada who is eavesdropping outside hears this and then tries to find a way to take revenge. Viyda starts a psychological war and pretends to be Lukkana causing Khun Ying Tap Tim’s death. Viyada dreams that she will marry Monthai and get Mahatwiet but once they open the will Viyada realizes that Khun Ying gave half and half of her belongings to Monthai and Bpee. Viyada then accuses bpee of pretending to be Lukkana’s ghost to scare her to death. Bpee doesn’t have anyone to support her and she doesn’t even open her mouth to deny. Monthai is very angry so tells her to go away. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nawat Kulrattanarak Monthai Kanya Leenutapong Bpeeyachat Panwad Hemmanee Vidya Kalaya Jirachaisakdecha Wiparwarn Oak Smith Anucha Full Cast & Crew Last Season Season 1 2008 | 39 Episodes Season 1 of Ngao Asoke premiered on June  9, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ngao Asoke. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 86 Almost there... Top Contributors 29 Crip 5 mariilakorn21 4 Elizabeth Jennings z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}