{"link": "https://www.themoviedb.org/tv/35579?language=en", "title": "A Little Princess Sara", "resume": "Princess Sarah, also known as Little Princess Sara, is a 1985 Japanese anime series produced by Nippon Animation and Aniplex, based on Frances Hodgson Burnett's novel, A Little Princess. Spanning 46 episodes, it originally premiered in 1985 across Japan on Fuji Television as the 11th series of Nippon Animation's famous World Masterpiece Theater staple.\nIt was also later aired across Japan by the anime television network, Animax, who also later broadcast the series across its respective networks worldwide, including its English language networks in Southeast Asia and South Asia, dubbing and translating the series into English under the title Princess Sarah. Animax's adaptation was the series' only English translation, and the series has yet to be commercially released in the United States. The series has also been selected as one of the best 100 Japanese anime series of all time by viewers of TV Asahi.\nIt was also aired in numerous countries worldwide and translated into several languages, including French, Italian, German, Arabic, Filipino and Spanish. In the Philippines, it was aired by ABS-CBN in the early 1990s, and was a runaway success, even spawning a live-action film and a TV series. In the Pan-Arab region, it became the most successful anime based on a novel adaptation in the 90s with small variation in which the main character name is Sally instead of Sara.", "rate": 100, "genre": ["Animation", "Drama"], "cast": ["Sumi Shimamoto", "Eiko Hisamura", "Asami Mukaidono", "Atsuko Mine", "Banjou Ginga"], "character": ["Sarah Crewe", "Lavinia Herbert", "Molly", "Maggie", "Ralph"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35579   Expand A Little Princess Sara   (1985) User Score Overview Princess Sarah, also known as Little Princess Sara, is a 1985 Japanese anime series produced by Nippon Animation and Aniplex, based on Frances Hodgson Burnett's novel, A Little Princess. Spanning 46 episodes, it originally premiered in 1985 across Japan on Fuji Television as the 11th series of Nippon Animation's famous World Masterpiece Theater staple. It was also later aired across Japan by the anime television network, Animax, who also later broadcast the series across its respective networks worldwide, including its English language networks in Southeast Asia and South Asia, dubbing and translating the series into English under the title Princess Sarah. Animax's adaptation was the series' only English translation, and the series has yet to be commercially released in the United States. The series has also been selected as one of the best 100 Japanese anime series of all time by viewers of TV Asahi. It was also aired in numerous countries worldwide and translated into several languages, including French, Italian, German, Arabic, Filipino and Spanish. In the Philippines, it was aired by ABS-CBN in the early 1990s, and was a runaway success, even spawning a live-action film and a TV series. In the Pan-Arab region, it became the most successful anime based on a novel adaptation in the 90s with small variation in which the main character name is Sally instead of Sara. Featured Crew Frances Hodgson Burnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sumi Shimamoto Sarah Crewe Eiko Hisamura Lavinia Herbert Asami Mukaidono Molly Atsuko Mine Maggie Banjou Ginga Ralph Full Cast & Crew Last Season Season 1 1985 | 46 Episodes Season 1 of A Little Princess Sara premiered on January  6, 1985. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A Little Princess Sara. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on A Little Princess Sara. You can help by rating TV shows you've seen. Facts Original Name  小公女セーラ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 TheDerpMan 8 amnesys t 7 tmdb983464 A 4 AxelB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}