{"link": "https://www.themoviedb.org/tv/5239?language=en", "title": "Ace of Wands", "resume": "Ace of Wands is a fantasy-based British children's television show broadcast on ITV between 1970 and 1972, created by Trevor Preston and Pamela Lonsdale and produced by Thames Television. The title, taken from the name of a Tarot card describes the principal character, called \"Tarot\" who combined stage magic with supernatural powers. Tarot has a pet Owl named Ozymandias, played by Fred Owl.\nAce of Wands ran for two seasons of thirteen episodes and a third season of twenty. Many, if not all, of the first 26 episodes are believed to have been wiped, although the final season is intact. In the first two series Tarot is assisted by Sam Maxstead, a reformed convict and Lillian Palmer known by her nickname, Lulli, an orphan. Lulli shares a telepathic link with Tarot, which enables them to communicate over great distances. After having to leave the programme because of prior commitments, in the final series this pair were replaced by brother and sister Chas, a photographer, and Mikki, a female journalist, who have very similar roles, she also sharing a telepathic link with Tarot. A character named Mr Sweet who runs an antiquarian bookshop often has the answer to Tarot's questions. Sweet is based in a university for the last series. Mr. Stabs, played by Russell Hunter, is defeated by Ace of Wands's lead Tarot, yet returns, again played by Hunter, in an episode of the anthology series Shadows. The character's final appearance was in Dramarama, this time portrayed by David Jason. However, the Dramarama story was a prequel to the previous ones.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Petra Markham", "Judy Loe", "Tony Selby"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5239   Expand Ace of Wands   (1970) User Score Overview Ace of Wands is a fantasy-based British children's television show broadcast on ITV between 1970 and 1972, created by Trevor Preston and Pamela Lonsdale and produced by Thames Television. The title, taken from the name of a Tarot card describes the principal character, called \"Tarot\" who combined stage magic with supernatural powers. Tarot has a pet Owl named Ozymandias, played by Fred Owl. Ace of Wands ran for two seasons of thirteen episodes and a third season of twenty. Many, if not all, of the first 26 episodes are believed to have been wiped, although the final season is intact. In the first two series Tarot is assisted by Sam Maxstead, a reformed convict and Lillian Palmer known by her nickname, Lulli, an orphan. Lulli shares a telepathic link with Tarot, which enables them to communicate over great distances. After having to leave the programme because of prior commitments, in the final series this pair were replaced by brother and sister Chas, a photographer, and Mikki, a female journalist, who have very similar roles, she also sharing a telepathic link with Tarot. A character named Mr Sweet who runs an antiquarian bookshop often has the answer to Tarot's questions. Sweet is based in a university for the last series. Mr. Stabs, played by Russell Hunter, is defeated by Ace of Wands's lead Tarot, yet returns, again played by Hunter, in an episode of the anthology series Shadows. The character's final appearance was in Dramarama, this time portrayed by David Jason. However, the Dramarama story was a prequel to the previous ones. Featured Crew Trevor Preston Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Petra Markham Judy Loe Tony Selby Full Cast & Crew Last Season Season 3 1972 | 20 Episodes Season 3 of Ace of Wands premiered on July 19, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ace of Wands. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}