{"link": "https://www.themoviedb.org/tv/48561?language=en", "title": "Tamako Market", "resume": "Tamako Market is a Japanese anime television series produced by Kyoto Animation and directed by Naoko Yamada. The series aired in Japan between January 10 and March 28, 2013. The anime has been licensed in North America by Sentai Filmworks.", "rate": 63, "genre": ["Animation", "Comedy"], "cast": ["Aya Suzaki", "Takumi Yamazaki", "Yuki Kaneko", "Juri Nagatsuma", "Yurie Yamashita"], "character": ["Tamako Kitashirakawa", "Dera Mochimazzwi", "Midori Tokiwa", "Kanna Makino", "Shiori Asagiri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48561   Expand Tamako Market   (2013) User Score Overview Tamako Market is a Japanese anime television series produced by Kyoto Animation and directed by Naoko Yamada. The series aired in Japan between January 10 and March 28, 2013. The anime has been licensed in North America by Sentai Filmworks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Suzaki Tamako Kitashirakawa Takumi Yamazaki Dera Mochimazzwi Yuki Kaneko Midori Tokiwa Juri Nagatsuma Kanna Makino Yurie Yamashita Shiori Asagiri Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Tamako Market premiered on January 10, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tamako Market. You can help by rating TV shows you've seen. Facts Original Name  たまこまーけっと Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://tamakomarket.com Genres Animation Comedy Keywords slice of life Content Score 86 Almost there... Top Contributors 15 Axeshizzle S 8 Segeta z 5 zurman1 BA 5 Barbara Ann O'Leary  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}