{"link": "https://www.themoviedb.org/tv/62732?language=en", "title": "Texas Rising", "resume": "A 10-hour event series that details the Texas Revolution and the rise of the Texas Rangers. \nIn 1836, west of the Mississippi was considered the Wild West and the Texas frontier was viewed as hell on earth. Crushed from the outside by Mexican armadas and attacked from within by ferocious Comanche tribes—no one was safe. But this was a time of bravery, a time to die for what you believed in and a time to stand tall against the cruel rule of the Mexican General Santa Anna. The heroic General Sam Houston, the rag tag Rangers and the legendary “Yellow Rose of Texas” lead this story of the human will to win against insurmountable odds. At the end, the Texas flags stood tall and victorious, claiming a piece of history for all eternity.", "rate": 66, "genre": ["Drama", "Western"], "cast": ["Bill Paxton", "Brendan Fraser", "Ray Liotta", "Jeffrey Dean Morgan", "Olivier Martinez"], "character": ["Sam Houston", "Billy Anderson", "Lorca", "Deaf Smith", "Santa Anna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62732   Expand Texas Rising   (2015) User Score  Play Trailer Overview A 10-hour event series that details the Texas Revolution and the rise of the Texas Rangers.  In 1836, west of the Mississippi was considered the Wild West and the Texas frontier was viewed as hell on earth. Crushed from the outside by Mexican armadas and attacked from within by ferocious Comanche tribes—no one was safe. But this was a time of bravery, a time to die for what you believed in and a time to stand tall against the cruel rule of the Mexican General Santa Anna. The heroic General Sam Houston, the rag tag Rangers and the legendary “Yellow Rose of Texas” lead this story of the human will to win against insurmountable odds. At the end, the Texas flags stood tall and victorious, claiming a piece of history for all eternity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Paxton Sam Houston Brendan Fraser Billy Anderson Ray Liotta Lorca Jeffrey Dean Morgan Deaf Smith Olivier Martinez Santa Anna Full Cast & Crew Last Season Season 1 2015 | 5 Episodes Season 1 of Texas Rising premiered on May 25, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Texas Rising. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  8 Recommendations   2015-04-05 American Odyssey 6.7    2014-08-23 Intruders 6.5    2012-03-30 Magic City 6.7    2014-02-27 The Red Road 6.0    2014-07-27 Manhattan 7.3    1994-03-05 Weird Science 6.3    2015-05-21 Between 5.4    2007-09-28 Moonlight 7.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  127m Homepage   http://www.history.com/shows/texas-rising Genres Drama Western Keywords texas texas ranger miniseries docudrama alamo wild west historical drama 19th century Content Score 93 Almost there... Top Contributors 83 Elizabeth Jennings TB 24 TMDb Bot 9 Banana 8 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}