{"link": "https://www.themoviedb.org/tv/78735?language=en", "title": "The Legend of Dugu", "resume": "A prophecy bearing the words, \"The World of Dugu: He who has Dugu, has the world\" reverberates across the lands to imply that the Dugu family was destined to do great things. Because of it, all the attention is turned to Dugu Xin, a court official, and his three daughters, Dugu Ban Ruo , Dugu Man Tuo, and Dugu Jia Luo. Each of the sisters were born blessed with natural beauty andintelligence, and in order to not let the prophecy destroy the sisters' relationship, they all vowed to stick by each other and not let any one of them get hurt.", "rate": 0, "genre": ["Drama"], "cast": ["徐正溪", "胡冰卿", "張丹峰", "Ady An"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78735   Expand The Legend of Dugu   (2018) User Score Overview A prophecy bearing the words, \"The World of Dugu: He who has Dugu, has the world\" reverberates across the lands to imply that the Dugu family was destined to do great things. Because of it, all the attention is turned to Dugu Xin, a court official, and his three daughters, Dugu Ban Ruo , Dugu Man Tuo, and Dugu Jia Luo. Each of the sisters were born blessed with natural beauty andintelligence, and in order to not let the prophecy destroy the sisters' relationship, they all vowed to stick by each other and not let any one of them get hurt. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast 徐正溪 胡冰卿 張丹峰 Ady An Full Cast & Crew Current Season The Legend of Dugu 2018 | 55 Episodes Season 1 of The Legend of Dugu premiered on February 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Dugu. You can help by rating TV shows you've seen. Facts Original Name  独孤天下 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Drama Keywords politics historical Content Score 71 Just a little bit more... Top Contributors j 22 jklmo 橘 14 橘醬男孩 v 3 vking l 3 lwin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}