{"link": "https://www.themoviedb.org/tv/3917?language=en", "title": "Special Rescue Police Winspector", "resume": "Special Rescue Police Winspector is a Japanese tokusatsu TV series, part of the Metal Hero Series and the first piece of the Rescue Hero trilogy. The series follows the adventures and missions of a special \"Rescue Police\" team known as Special Police Winspector, as they stop crimes and respond to dangerous events where regular police force is not sufficient. The team is made up of one human and two robotic assistants.\nThe opening catchphrase of the series is \"Special Rescue Police Winspector: loves peace, have faith in friendship, facing the crime to protect of the life of the person, at the \"Police Headquarters Special Emergency Police Team\"!\"", "rate": 100, "genre": ["Action", "Adventure"], "cast": ["Mami Nakanishi", "Sachiko Oguri", "Masaru Ōbayashi", "Yura Hoshikawa", "Ryo Yamamoto"], "character": ["Junko Fujino", "Hissae Koyama", "Shin'ichi Nonoyama", "Yuki Ogawa", "Minoro Koyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3917   Expand Special Rescue Police Winspector   (1990) User Score Overview Special Rescue Police Winspector is a Japanese tokusatsu TV series, part of the Metal Hero Series and the first piece of the Rescue Hero trilogy. The series follows the adventures and missions of a special \"Rescue Police\" team known as Special Police Winspector, as they stop crimes and respond to dangerous events where regular police force is not sufficient. The team is made up of one human and two robotic assistants. The opening catchphrase of the series is \"Special Rescue Police Winspector: loves peace, have faith in friendship, facing the crime to protect of the life of the person, at the \"Police Headquarters Special Emergency Police Team\"!\" Featured Crew Saburo Yatsude Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mami Nakanishi Junko Fujino Sachiko Oguri Hissae Koyama Masaru Ōbayashi Shin'ichi Nonoyama Yura Hoshikawa Yuki Ogawa Ryo Yamamoto Minoro Koyama Full Cast & Crew Last Season Season 01 1990 | 34 Episodes Season 1 of Special Rescue Police Winspector premiered on February  4, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Special Rescue Police Winspector. You can help by rating TV shows you've seen. Facts Original Name  特警ウインスペクター Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Keywords tokusatsu Content Score 93 Almost there... Top Contributors NS 28 Norte Serra j 6 jorge-palomino 4 MrTimscampi v 1 viniheluan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}