{"link": "https://www.themoviedb.org/tv/67199?language=en", "title": "Saint Seiya: The Hades Chapter", "resume": "OVA series of the Hades Chapter Arc from the manga. It is divided into 3 parts; \"Sanctuary\", \"Inferno\" and \"Elysion\"\nAfter the 12 Gold Saints sacrifice their lives to destroy the Wailing Wall, the Bronze Saints enter the deepest realm of the Underworld, Elysion, where they face off aganist Hades's two most powerful servants, The Twin Gods, Hypnos and Thanatos, before they can reach Hades for the final battle.", "rate": 84, "genre": ["Action", "Adventure", "Animation"], "cast": ["Masakazu Morita", "Takahiro Sakurai", "Hiroaki Miura", "Yûta Kazuya", "Toshio Furukawa"], "character": ["Pegasus Seiya", "Dragon Shiryū", "Cygnus Hyōga", "Andromeda Shun", "Thanatos"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67199   Expand Saint Seiya: The Hades Chapter   (2002) User Score Overview OVA series of the Hades Chapter Arc from the manga. It is divided into 3 parts; \"Sanctuary\", \"Inferno\" and \"Elysion\" After the 12 Gold Saints sacrifice their lives to destroy the Wailing Wall, the Bronze Saints enter the deepest realm of the Underworld, Elysion, where they face off aganist Hades's two most powerful servants, The Twin Gods, Hypnos and Thanatos, before they can reach Hades for the final battle. Featured Crew Masami Kurumada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masakazu Morita Pegasus Seiya Takahiro Sakurai Dragon Shiryū Hiroaki Miura Cygnus Hyōga Yûta Kazuya Andromeda Shun Toshio Furukawa Thanatos Full Cast & Crew Last Season Season 3 2008 | 6 Episodes Season 3 of Saint Seiya: The Hades Chapter premiered on May  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2009-06-24 Saint Seiya The Lost Canvas - The Myth of Hades 9.3    1986-10-11 Saint Seiya 8.0    2006-10-04 Death Note 8.2  Facts Original Name  冥王ハーデス十二宮編 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.toei-anim.co.jp/sp/seiya/ Genres Action & Adventure Animation Keywords saint seiya the hades chapter saint seiya Content Score 93 Almost there... Top Contributors s 61 shoebox94 l 18 lld16 h 11 hunterfilms m 8 malphas59  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}