{"link": "https://www.themoviedb.org/tv/25397?language=en", "title": "The Bourne Identity", "resume": "An unconscious man is washed ashore on the beach of a small French village during a heavy storm. A retired doctor takes care of the unconscious stranger. When the mysterious man recovers, he can't remember a thing...he does not know his name, he does not know where his flashback memories come from, and he does not know why the access code for an anonymous Swiss bank account is implanted in his thigh. As he seeks his own identity, things quickly become dangerous. There are attempts to kill him, he is well known in first class hotels across Europe, and worst of all, there are strange similarities between his memories and reported actions of the notorious terrorist, Carlos the Jackal.", "rate": 63, "genre": ["Drama", "Action", "Adventure"], "cast": ["Anthony Quayle", "Donald Moffat", "Denholm Elliott", "Jaclyn Smith", "Richard Chamberlain"], "character": ["Gen. François Villiers", "David Abbott", "Dr. Geoffrey Washburn", "Marie St. Jacques", "Jason Bourne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25397   Expand The Bourne Identity   (1988) User Score Overview An unconscious man is washed ashore on the beach of a small French village during a heavy storm. A retired doctor takes care of the unconscious stranger. When the mysterious man recovers, he can't remember a thing...he does not know his name, he does not know where his flashback memories come from, and he does not know why the access code for an anonymous Swiss bank account is implanted in his thigh. As he seeks his own identity, things quickly become dangerous. There are attempts to kill him, he is well known in first class hotels across Europe, and worst of all, there are strange similarities between his memories and reported actions of the notorious terrorist, Carlos the Jackal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  10 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Quayle Gen. François Villiers Donald Moffat David Abbott Denholm Elliott Dr. Geoffrey Washburn Jaclyn Smith Marie St. Jacques Richard Chamberlain Jason Bourne Full Cast & Crew Last Season Season 1 1988 | 2 Episodes Season 1 of The Bourne Identity premiered on May  8, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Bourne Identity. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  10 Recommendations   1989-09-19 Doogie Howser, M.D. 5.7    2001-07-22 Space 8.0    1998-04-05 From the Earth to the Moon 8.3    1979-09-10 Tinker Tailor Soldier Spy 7.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  180m Homepage  - Genres Drama Action & Adventure Keywords amnesia based on novel or book ambush hitman identity mission of murder lovers miniseries Content Score 93 Almost there... Top Contributors TB 110 TMDb Bot R 11 Rebecca L 11 LeGardienDuCinema f 3 flimmerix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}