{"link": "https://www.themoviedb.org/tv/60580?language=en", "title": "Jodha Akbar", "resume": "Jodha Akbar is an epic drama about a sixteenth century story of the political marriage of convenience between a Mughal emperor Abu'l-Fath Jalal ud-din Muhammad Akbar and a Rajput princess Jodha Bai. The show focuses on how their political marriage brings love between them to an extent that it changed the fate of India. This period drama also portrays the wars of that time along with the relations between the Mughals and the Rajputs. The drama also focuses on the functioning of the queens, the courts, courtesans, the ministers and their influence on the love story of Jalal ud-din Muhammad Akbar and Jodha Bai. The show also highlights on how Mughal emperor Jalal ud-din Muhammad acquires the title of Akbar from the people.", "rate": 48, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60580   Expand Jodha Akbar   (2013) User Score Overview Jodha Akbar is an epic drama about a sixteenth century story of the political marriage of convenience between a Mughal emperor Abu'l-Fath Jalal ud-din Muhammad Akbar and a Rajput princess Jodha Bai. The show focuses on how their political marriage brings love between them to an extent that it changed the fate of India. This period drama also portrays the wars of that time along with the relations between the Mughals and the Rajputs. The drama also focuses on the functioning of the queens, the courts, courtesans, the ministers and their influence on the love story of Jalal ud-din Muhammad Akbar and Jodha Bai. The show also highlights on how Mughal emperor Jalal ud-din Muhammad acquires the title of Akbar from the people. Featured Crew Ekta Kapoor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 179 Episodes Season 1 of Jodha Akbar premiered on June 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jodha Akbar. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Zee TV Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.zeetv.com/shows/jodha-akbar/ Genres Drama Sci-Fi & Fantasy Keywords war muslim emperor marriage marriage of convenience india battle ruler rajput princess historical drama 16th century Content Score 64 We're so close, yet so far. Top Contributors P 24 PavanSingh 10 Banana CM 6 Cherche Moi e 4 error42  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}