{"link": "https://www.themoviedb.org/tv/2388?language=en", "title": "Queer as Folk", "resume": "Queer as Folk is a 1999 British television series that chronicles the lives of three gay men living in Manchester's gay village around Canal Street. Both Queer as Folk and Queer as Folk 2 were written by Russell T Davies. The first series was re-shown on More 4 between 14 and 18 October 2007, as part of Channel 4's 25th-birthday celebrations.\nQueer as Folk was produced by the Red Production Company for Channel 4. The title of the programme comes from a dialect expression from some parts of Northern England, \"there's nowt so queer as folk\", meaning \"there's nothing as strange as people\"; which is a word play the modern day English synonym of \"queer\", meaning homosexual. Davies had originally titled the series this, although at the suggestion of Channel 4 executives for a period during its development and pre-production it was known as Queer as Fuck, before it reverted to the former name.", "rate": 80, "genre": ["Drama"], "cast": ["Aidan Gillen", "Charlie Hunnam", "Craig Kelly", "Andy Devine", "Denise Black"], "character": ["Stuart Alan Jones", "Nathan Maloney", "Vince Tyler", "Bernard Thomas", "Hazel Tyler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2388   Expand Queer as Folk   (1999) User Score Overview Queer as Folk is a 1999 British television series that chronicles the lives of three gay men living in Manchester's gay village around Canal Street. Both Queer as Folk and Queer as Folk 2 were written by Russell T Davies. The first series was re-shown on More 4 between 14 and 18 October 2007, as part of Channel 4's 25th-birthday celebrations. Queer as Folk was produced by the Red Production Company for Channel 4. The title of the programme comes from a dialect expression from some parts of Northern England, \"there's nowt so queer as folk\", meaning \"there's nothing as strange as people\"; which is a word play the modern day English synonym of \"queer\", meaning homosexual. Davies had originally titled the series this, although at the suggestion of Channel 4 executives for a period during its development and pre-production it was known as Queer as Fuck, before it reverted to the former name. Featured Crew Russell T. Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aidan Gillen Stuart Alan Jones Charlie Hunnam Nathan Maloney Craig Kelly Vince Tyler Andy Devine Bernard Thomas Denise Black Hazel Tyler Full Cast & Crew Last Season Series 2 2000 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  8 Recommendations   2003-06-29 Fortysomething 7.4    2005-02-01 Bromwell High 6.0    2001-03-21 Teachers 7.2    2000-12-03 Queer As Folk 7.6    2004-11-11 Blackpool 7.8    2004-02-16 The Catherine Tate Show 5.5    2003-11-03 Slings and Arrows 7.6    2004-01-13 Shameless 7.5  Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/queer-as-folk Genres Drama Keywords sex northern england age difference gay relationship gay man gritty lgbt gay culture manchester Content Score 93 Almost there... Top Contributors 45 Banana O 4 Ozbourne 4 Elizabeth Jennings O 3 Oakie102  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}