{"link": "https://www.themoviedb.org/tv/4350?language=en", "title": "Mike, Lu & Og", "resume": "Mike, Lu & Og is an American animated television series produced by KINOFILM Animation that ran on Cartoon Network. The show was the seventh Cartoon Cartoon, based on a short for The What a Cartoon! Show. Created by Mikhail Shindel, Mikhail Aldashin and Charles Swenson, the show follows a girl named Mike, a foreign exchange student from Manhattan; a self-appointed island princess named Lu; and a boy-genius named Og. The trio takes part in a variety of adventures as Mike and the island's natives share their customs with each other. Twenty-six half-hour episodes were produced, featuring two stories per episode. The series featured voice actors Nika Frost as Mike, Nancy Cartwright as Lu, and Dee Bradley Baker as Og. It began airing on Boomerang in May 2006 as reruns, though it is often removed from the schedule and put back on it on a frequent basis.", "rate": 44, "genre": ["Animation"], "cast": ["Nancy Cartwright", "Dee Bradley Baker", "S. Scott Bullock", "Nika Futterman", "Corey Burton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4350   Expand Mike, Lu & Og   (1999) User Score Overview Mike, Lu & Og is an American animated television series produced by KINOFILM Animation that ran on Cartoon Network. The show was the seventh Cartoon Cartoon, based on a short for The What a Cartoon! Show. Created by Mikhail Shindel, Mikhail Aldashin and Charles Swenson, the show follows a girl named Mike, a foreign exchange student from Manhattan; a self-appointed island princess named Lu; and a boy-genius named Og. The trio takes part in a variety of adventures as Mike and the island's natives share their customs with each other. Twenty-six half-hour episodes were produced, featuring two stories per episode. The series featured voice actors Nika Frost as Mike, Nancy Cartwright as Lu, and Dee Bradley Baker as Og. It began airing on Boomerang in May 2006 as reruns, though it is often removed from the schedule and put back on it on a frequent basis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nancy Cartwright Dee Bradley Baker S. Scott Bullock Nika Futterman Corey Burton Full Cast & Crew Last Season Mike, lu & og season 2 2000 | 13 Episodes Season 2 of Mike, Lu & Og premiered on March  3, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2000-11-17 Sheep in the Big City 6.8    2001-06-08 Time Squad 6.4    2005-12-26 My Gym Partner's a Monkey 5.0    2005-05-30 The Life and Times of Juniper Lee 4.2    2005-03-25 Krypto the Superdog 1.3    2014-11-08 Sonic Boom 6.0    2009-04-19 Cake Boss 5.7    2000-12-21 The Brak Show 7.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 mrtextortexel 3 Damien Haynes 3 minhus 1 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}