{"link": "https://www.themoviedb.org/tv/70581?language=en", "title": "Circle", "resume": "After Aliens arrive, the story takes place in two time streams: 2017 and 2037. In twenty years, and by 2037, the world has been divided into a “Smart Earth” where artificial intelligence has created a utopian environment in which no diseases or crimes exist, and an “Ordinary Earth” where people still suffer from rampant plague and lawlessness.", "rate": 66, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Yeo Jin-goo", "Kim Kang-woo", "Gong Seung-yeon", "Lee Gi-kwang", "Kwon Hyuk-Soo"], "character": ["Kim Woo-Jin", "Kim Joon-Hyuk", "Han Jung-Yeon", "Lee Ho-Soo", "Detective Oh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70581   Expand Circle   (2017) User Score Overview After Aliens arrive, the story takes place in two time streams: 2017 and 2037. In twenty years, and by 2037, the world has been divided into a “Smart Earth” where artificial intelligence has created a utopian environment in which no diseases or crimes exist, and an “Ordinary Earth” where people still suffer from rampant plague and lawlessness. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeo Jin-goo Kim Woo-Jin Kim Kang-woo Kim Joon-Hyuk Gong Seung-yeon Han Jung-Yeon Lee Gi-kwang Lee Ho-Soo Kwon Hyuk-Soo Detective Oh Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Circle premiered on May 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations   2017-08-09 Manhole 7.3    2017-07-19 Reunited Worlds 8.3    2017-08-05 Save Me 7.0    2017-07-19 Man Who Dies to Live 8.3    2017-05-10 Ruler: Master of the Mask 6.7    2017-07-24 Falsify 6.1    2017-05-22 Fight For My Way 7.3    2017-10-09 Because This Is My First Life 9.3  Facts Original Name  써클: 이어진 두 세계 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/circle Genres Mystery Sci-Fi & Fantasy Keywords korea Content Score 86 Almost there... Top Contributors M 62 Maria180493 3 andermairena 3 lelouchvib 3 shadowfurious  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}