{"link": "https://www.themoviedb.org/tv/3357?language=en", "title": "Law & Order: Trial by Jury", "resume": "Law & Order: Trial by Jury is an American television drama about criminal trials set in New York City. It was the third spin-off from the long-running Law & Order. The show's almost exclusive focus was on the criminal trial of the accused, showing both the prosecution's and defense's preparation for trial, as well as the trial itself. The series premiered on Thursday, March 3, 2005, and ended on January 21, 2006. Its regular time slot was Fridays 10/9 p.m. ET on NBC. The last episode aired on Court TV months after the series' cancellation.", "rate": 80, "genre": ["Drama"], "cast": ["Kirk Acevedo", "Bebe Neuwirth", "Fred Dalton Thompson", "Amy Carlson", "Jerry Orbach"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3357   Expand Law & Order: Trial by Jury   (2005) User Score Overview Law & Order: Trial by Jury is an American television drama about criminal trials set in New York City. It was the third spin-off from the long-running Law & Order. The show's almost exclusive focus was on the criminal trial of the accused, showing both the prosecution's and defense's preparation for trial, as well as the trial itself. The series premiered on Thursday, March 3, 2005, and ended on January 21, 2006. Its regular time slot was Fridays 10/9 p.m. ET on NBC. The last episode aired on Court TV months after the series' cancellation. Featured Crew Dick Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirk Acevedo Bebe Neuwirth Fred Dalton Thompson Amy Carlson Jerry Orbach Full Cast & Crew Last Season Season 1 2005 | 14 Episodes Season 1 of Law & Order: Trial by Jury premiered on March  3, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Law & Order: Trial by Jury. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.nbc.com/law-and-order-trial-by-jury/ Genres Drama Keywords new york trial jury courtroom law and order Content Score 93 Almost there... Top Contributors 8 Banana 5 waaw w 3 webmaster 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}