{"link": "https://www.themoviedb.org/tv/4234?language=en", "title": "Citizen Smith", "resume": "Citizen Smith is a British television sitcom. The show was written by John Sullivan, who later wrote Only Fools and Horses. The pilot was transmitted on 12 April 1977 in the Comedy Special series of one-off plays, and the series proper ran from 3 November 1977 to 31 December 1980. Citizen Smith starred Robert Lindsay as \"Wolfie\" Smith, a young Marxist \"urban guerrilla\" living in Tooting, South London, who is attempting to emulate his hero Che Guevara. 'Wolfie' is a reference to the Irish revolutionary Wolfe Tone who used the pseudonym Citizen Smith in order to evade capture by the English. Wolfie is the self-proclaimed leader of the revolutionary Tooting Popular Front, the goals of which are \"Power to the People\" and \"Freedom for Tooting\". In reality, he is an unemployed dreamer and petty criminal whose plans fall through because of laziness and disorganisation.", "rate": 76, "genre": ["Comedy"], "cast": ["Robert Lindsay", "Mike Grady", "Hilda Braid", "Tony Steedman", "Cheryl Hall"], "character": ["Wolfie Smith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4234   Expand Citizen Smith   (1977) User Score Overview Citizen Smith is a British television sitcom. The show was written by John Sullivan, who later wrote Only Fools and Horses. The pilot was transmitted on 12 April 1977 in the Comedy Special series of one-off plays, and the series proper ran from 3 November 1977 to 31 December 1980. Citizen Smith starred Robert Lindsay as \"Wolfie\" Smith, a young Marxist \"urban guerrilla\" living in Tooting, South London, who is attempting to emulate his hero Che Guevara. 'Wolfie' is a reference to the Irish revolutionary Wolfe Tone who used the pseudonym Citizen Smith in order to evade capture by the English. Wolfie is the self-proclaimed leader of the revolutionary Tooting Popular Front, the goals of which are \"Power to the People\" and \"Freedom for Tooting\". In reality, he is an unemployed dreamer and petty criminal whose plans fall through because of laziness and disorganisation. Featured Crew John Sullivan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Lindsay Wolfie Smith Mike Grady Hilda Braid Tony Steedman Cheryl Hall Full Cast & Crew Last Season Season 4 1980 | 7 Episodes Season 4 of Citizen Smith premiered on May 23, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1993-09-21 The Smell of Reeves and Mortimer 7.7    1964-12-16 The Likely Lads 7.8    A Question of Sport 6.5    1976-01-06 Rentaghost 8.0    1983-09-22 Just Good Friends 6.4    Randall and Hopkirk (Deceased) 7.0    1967-01-03 Trumpton 8.8    1973-01-09 Whatever Happened to the Likely Lads? 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords marxism london england sitcom unemployed political humour british humour Content Score 93 Almost there... Top Contributors O 10 Ozbourne 1 Lars the Alien 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}