{"link": "https://www.themoviedb.org/tv/13210?language=en", "title": "Messiah", "resume": "Messiah is a British television drama series, broadcast on the BBC One network and produced in-house by BBC Northern Ireland, although the series itself is set in England. Made up of a series of occasional serials, the first, with two parts subtitled The First Killings & The Reckoning, was broadcast in 2001. It has been followed by Messiah 2: Vengeance is Mine, Messiah III: The Promise, Messiah IV: The Harrowing and most recently Messiah V: The Rapture. The original production was based on a novel by Boris Starling: the subsequent installments have been written directly for television. Starling has a cameo as a murder victim's corpse in the first serial.\nA crime series, it follows the investigations of DCI Red Metcalfe, who often investigates particularly gruesome murders. Metcalfe is played by Scottish actor Ken Stott, and the other main regulars in the series are Kate Beauchamp, Duncan Warren and Metcalfe's wife Susan. The deafness of Forbes' character necessitated both her and Stott learning British Sign Language for their characters' frequent exchanges.", "rate": 80, "genre": ["Mystery", "Drama", "Crime"], "cast": ["Marc Warren", "Daniel Ryan", "Marsha Thomason"], "character": ["DCI Joseph Walker", "DS Terry Hedges", "DS Mel Palmer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13210   Expand Messiah   (2001) User Score Overview Messiah is a British television drama series, broadcast on the BBC One network and produced in-house by BBC Northern Ireland, although the series itself is set in England. Made up of a series of occasional serials, the first, with two parts subtitled The First Killings & The Reckoning, was broadcast in 2001. It has been followed by Messiah 2: Vengeance is Mine, Messiah III: The Promise, Messiah IV: The Harrowing and most recently Messiah V: The Rapture. The original production was based on a novel by Boris Starling: the subsequent installments have been written directly for television. Starling has a cameo as a murder victim's corpse in the first serial. A crime series, it follows the investigations of DCI Red Metcalfe, who often investigates particularly gruesome murders. Metcalfe is played by Scottish actor Ken Stott, and the other main regulars in the series are Kate Beauchamp, Duncan Warren and Metcalfe's wife Susan. The deafness of Forbes' character necessitated both her and Stott learning British Sign Language for their characters' frequent exchanges. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Warren DCI Joseph Walker Daniel Ryan DS Terry Hedges Marsha Thomason DS Mel Palmer Full Cast & Crew Last Season Season 5 2008 | 2 Episodes Season 5 of Messiah premiered on January 20, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1979-07-10 Sapphire & Steel 8.0    1977-12-30 The Professionals 7.7    1990-01-10 Oranges Are Not the Only Fruit 7.6    1993-11-18 Goodnight Sweetheart 8.2    1996-05-26 Cold Lazarus 7.3    2006-11-02 The State Within 7.8    2011-02-07 Outcasts 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Mystery Drama Crime Keywords england serial killer police detective murder investigation Content Score 56 We're so close, yet so far. Top Contributors 50 Banana TB 7 TMDb Bot R 6 Rebecca s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}