{"link": "https://www.themoviedb.org/tv/62452?language=en", "title": "Safe House", "resume": "Former police officer Robert and his wife Katy left city life behind them after Robert was injured, whilst trying to protect a witness in his care. The witness, Susan Reynolds was fatally shot. Robert has been struggling with the guilt he feels over the death of Susan. In a bid to put the past behind them, Robert and Katy now run a guest house, hidden away in the idyllic Lake District. A surprise visitor turns up, DCI Mark Maxwell, an ex-colleague and old friend. He suggests that the guest house is perfectly positioned to operate as a safe house, Robert is tempted but will Katy agree?", "rate": 64, "genre": ["Drama"], "cast": ["Stephen Moyer", "Zoë Tapper", "Sunetra Sarker", "Ashley Walters", "Sacha Parkinson"], "character": ["Tom Brook", "Sam", "DCI Jane Burr", "John Channing", "Dani Delaney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62452   Expand Safe House   (2015) User Score  Play Trailer Overview Former police officer Robert and his wife Katy left city life behind them after Robert was injured, whilst trying to protect a witness in his care. The witness, Susan Reynolds was fatally shot. Robert has been struggling with the guilt he feels over the death of Susan. In a bid to put the past behind them, Robert and Katy now run a guest house, hidden away in the idyllic Lake District. A surprise visitor turns up, DCI Mark Maxwell, an ex-colleague and old friend. He suggests that the guest house is perfectly positioned to operate as a safe house, Robert is tempted but will Katy agree? Featured Crew Michael Crompton Creator Marc D. Evans Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Moyer Tom Brook Zoë Tapper Sam Sunetra Sarker DCI Jane Burr Ashley Walters John Channing Sacha Parkinson Dani Delaney Full Cast & Crew Last Season The Crow 2017 | 4 Episodes Season 2 of Safe House premiered on September  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   2015-11-24 Capital 7.5    2018-05-12 Patrick Melrose 8.8    2018-02-12 Collateral 6.0    2018-04-08 Killing Eve 8.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   https://www.itv.com/itvplayer/safe-house Genres Drama Keywords ex-cop safe house Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings 14 Steve 5 Banana o 5 orhan_yümücly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}