{"link": "https://www.themoviedb.org/tv/5689?language=en", "title": "Takeshi's Castle", "resume": "Takeshi's Castle was a Japanese game show that aired between 1986 and 1990 on the Tokyo Broadcasting System. It featured the Japanese actor Takeshi Kitano as a count who owns a castle and sets up difficult challenges for players to get to him. The show has become a cult television hit around the world. A special live \"revival\" was broadcast on April 2, 2005, for TBS's 50th anniversary celebrations.", "rate": 83, "genre": ["Comedy"], "cast": ["Mary Scheer", "Joey de Leon", "Craig Charles", "John Cervenka", "Takeshi Kitano"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5689   Expand Takeshi's Castle   (2002) User Score Overview Takeshi's Castle was a Japanese game show that aired between 1986 and 1990 on the Tokyo Broadcasting System. It featured the Japanese actor Takeshi Kitano as a count who owns a castle and sets up difficult challenges for players to get to him. The show has become a cult television hit around the world. A special live \"revival\" was broadcast on April 2, 2005, for TBS's 50th anniversary celebrations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Scheer Joey de Leon Craig Charles John Cervenka Takeshi Kitano Full Cast & Crew Last Season Season 4 2005 | 22 Episodes Season 4 of Takeshi's Castle premiered on May 11, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Takeshi's Castle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 54m Homepage   http://www.ifilm.com/show/21908 Genres Comedy Keywords game show Content Score 86 Almost there... Top Contributors 13 aiman 10 Banana TB 2 TMDb Bot B 1 BestMed  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}