{"link": "https://www.themoviedb.org/tv/63378?language=en", "title": "Apaches", "resume": "A young journalist is forced into a life of crime to save his father and family in this series based on the novel by Miguel Sáez Carral.", "rate": 73, "genre": ["Crime", "Drama"], "cast": ["Alberto Ammann", "Verónica Echegui", "Eloy Azorín", "Paco Tous", "Nerea Barros"], "character": ["Miguel", "Carol", "Sastre", "El chatarrero", "Sílvia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63378   Expand Apaches   (2015) User Score Overview A young journalist is forced into a life of crime to save his father and family in this series based on the novel by Miguel Sáez Carral. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alberto Ammann Miguel Verónica Echegui Carol Eloy Azorín Sastre Paco Tous El chatarrero Nerea Barros Sílvia Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Apaches premiered on September  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2016-01-01 72 Cutest Animals 5.0    2016-12-08 The Cuba Libre Story 7.7    2017-09-20 Tiempos de guerra 7.0    2015-12-13 LEGO Nexo Knights 6.0    2016-07-05 Fangbone! 6.7    2015-10-14 Call My Agent 8.2    2016-07-06 Paquita Salas 7.8    2017-01-30 Bonus Family 8.5  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage   http://www.antena3.com/series/apaches/ Genres Crime Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 17 prm96 12 riverck MP 6 Mr. Peanutbutter 6 joeynotjoe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}