{"link": "https://www.themoviedb.org/tv/63054?language=en", "title": "Lost in Oz", "resume": "When 12-year-old Dorothy Gale discovers her mother's mysterious journal in her Kansas home, she and her dog, Toto, are transported into a bustling, modern Emerald City. Disoriented and determined to get home, Dorothy embarks on an epic journey with West, a young witch, and Ojo, a giant Munchkin, to seek the magic she needs - as Oz faces its greatest magic crisis. Based on L. Frank Baum's books.", "rate": 0, "genre": ["Animation", "Family", "Sci-Fi", "Fantasy"], "cast": ["Landry Bender", "Nika Futterman", "Jorge Diaz", "Chris Cox", "Alexander Polinsky"], "character": ["Dorothy Gale (voice)", "West / Triplets (voice)", "Ojo (voice)", "Toto / Agent Wally Pugmill / Patchwork Doll / Winged Monkeys (voice)", "Fitz (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63054   Expand Lost in Oz   (2015) User Score Overview When 12-year-old Dorothy Gale discovers her mother's mysterious journal in her Kansas home, she and her dog, Toto, are transported into a bustling, modern Emerald City. Disoriented and determined to get home, Dorothy embarks on an epic journey with West, a young witch, and Ojo, a giant Munchkin, to seek the magic she needs - as Oz faces its greatest magic crisis. Based on L. Frank Baum's books. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Landry Bender Dorothy Gale (voice) Nika Futterman West / Triplets (voice) Jorge Diaz Ojo (voice) Chris Cox Toto / Agent Wally Pugmill / Patchwork Doll / Winged Monkeys (voice) Alexander Polinsky Fitz (voice) Full Cast & Crew Last Season Season 1 2015 | 26 Episodes Season 1 of Lost in Oz premiered on June 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Lost in Oz. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  24m Homepage   http://www.amzn.com/B00Z89MYTI Genres Animation Family Sci-Fi & Fantasy Keywords fantasy world Content Score 93 Almost there... Top Contributors 43 Elizabeth Jennings 7 Banana J 7 Jkrilin t 2 theusedversion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}