{"link": "https://www.themoviedb.org/tv/27023?language=en", "title": "The Academy Awards", "resume": "The Academy Awards or The Oscars is an annual American awards ceremony honoring cinematic achievements in the film industry. The various category winners are awarded a copy of a statuette, officially the Academy Award of Merit, that is better known by its nickname Oscar. The awards, first presented in 1929 at the Hollywood Roosevelt Hotel, are overseen by the Academy of Motion Picture Arts and Sciences (AMPAS).\nThe awards ceremony began in 1929 and was first televised in 1953, making it the oldest entertainment awards ceremony.", "rate": 59, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27023   Expand The Academy Awards   (1953) User Score Overview The Academy Awards or The Oscars is an annual American awards ceremony honoring cinematic achievements in the film industry. The various category winners are awarded a copy of a statuette, officially the Academy Award of Merit, that is better known by its nickname Oscar. The awards, first presented in 1929 at the Hollywood Roosevelt Hotel, are overseen by the Academy of Motion Picture Arts and Sciences (AMPAS). The awards ceremony began in 1929 and was first televised in 1953, making it the oldest entertainment awards ceremony. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  14 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 90 2018 | 1 Episode Season 90 of The Academy Awards premiered on March  4, 2018. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Best Picture 2018 Open 0 by lmao7\n      \n     Best Supporting Actor Open 2 by  lmao7 b Jimmy Kimmel Open 2 by  bgirlmagic Go to Discussions Media Most Popular Videos  0 Backdrops  14 Posters  11 Recommendations We don't have enough data to suggest any TV shows based on The Academy Awards. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  240m Homepage   http://www.oscars.org/ Genres Reality Keywords oscar award oscars ceremony awards show Content Score 56 We're so close, yet so far. Top Contributors 2,388 lineker 284 Medianoche 33 Steve 22 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}