{"link": "https://www.themoviedb.org/tv/35154?language=en", "title": "Neo Angelique Abyss", "resume": "Arcadia is plagued with evil, life-draining demons called Thanatos  and a vast lack of Purifiers to exterminate them all. While attending  school, Angelique attracts the eye of a man who intends to turn the  tides to the people's favor. What lies within her is the key to  Arcadia's survival.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Animation", "Drama", "Comedy"], "cast": ["Hiroki Takahashi", "Kappei Yamaguchi", "Daisuke Ono", "Masaya Onosaka", "Aya Endo"], "character": ["Rayne", "Rune", "Hyuuga", "Jade", "Angelique"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35154   Expand Neo Angelique Abyss   (2008) User Score Overview Arcadia is plagued with evil, life-draining demons called Thanatos  and a vast lack of Purifiers to exterminate them all. While attending  school, Angelique attracts the eye of a man who intends to turn the  tides to the people's favor. What lies within her is the key to  Arcadia's survival. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroki Takahashi Rayne Kappei Yamaguchi Rune Daisuke Ono Hyuuga Masaya Onosaka Jade Aya Endo Angelique Full Cast & Crew Last Season Season 2 2008 | 13 Episodes Season 2 of Neo Angelique Abyss premiered on July  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Neo Angelique Abyss. You can help by rating TV shows you've seen. Facts Original Name  ネオアンジェリーク Abyss Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Animation Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 12 tmdb983464 TB 5 TMDb Bot 3 death72 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}