{"link": "https://www.themoviedb.org/tv/44472?language=en", "title": "Hotel Hell", "resume": "Chef Gordon Ramsay, along with a team of hospitality experts, travels the country applying his high standards to struggling hotels, motels, and bed and breakfasts in an effort to get the owners and staff to turn their establishments around. Ramsay's signature no-holds-barred style will make it clear to those he coaches that there is no place for dirty rooms or incompetent staff if one hopes to remain in business.", "rate": 67, "genre": ["Documentary"], "cast": ["Gordon Ramsay"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44472   Expand Hotel Hell   (2012) User Score  Play Trailer Overview Chef Gordon Ramsay, along with a team of hospitality experts, travels the country applying his high standards to struggling hotels, motels, and bed and breakfasts in an effort to get the owners and staff to turn their establishments around. Ramsay's signature no-holds-barred style will make it clear to those he coaches that there is no place for dirty rooms or incompetent staff if one hopes to remain in business. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gordon Ramsay Himself Full Cast & Crew Last Season Season 3 2016 | 8 Episodes Season 3 of Hotel Hell premiered on May 24, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations   2005-07-04 The Jeremy Kyle Show 6.3    1996-09-28 Psi Factor: Chronicles of the Paranormal 6.3    2011-01-19 Restaurant: Impossible 5.7    2008-12-03 Man v. Food 6.7    1985-09-30 M.A.S.K. 5.4    2000-03-20 Titus 6.6    2007-09-19 Kitchen Nightmares 7.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  43m Homepage   http://www.fox.com/hotel-hell Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 19 Elizabeth Jennings 6 Banana 4 Bendik w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}