{"link": "https://www.themoviedb.org/tv/12964?language=en", "title": "The Rivals of Sherlock Holmes", "resume": "The Rivals of Sherlock Holmes is a British television series that was produced by Thames Television and originally broadcast on the ITV Network. There were two series of 13 fifty-minute episodes; the first aired in 1971, the second in 1973.\nThe programme presented adaptations of short mystery, suspense or crime stories featuring, as the title suggests, detectives who were literary contemporaries of Arthur Conan Doyle's Sherlock Holmes.\nThe Rivals of Sherlock Holmes took its inspiration – and title – from a series of published anthologies by Hugh Greene, elder brother of author Graham Greene and the former director-general of the BBC. Hugh Greene is credited on the programme as a creative consultant.\nThe authors and detectives featured on the programme include:\n⁕Robert Barr\n⁕Guy Boothby\n⁕Ernest Bramah\n⁕R. Austin Freeman\n⁕Jacques Futrelle\n⁕Adalbert Goldscheider, a.k.a. \"Balduin Groller\"\n⁕George Griffith", "rate": 80, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12964   Expand The Rivals of Sherlock Holmes   (1971) User Score Overview The Rivals of Sherlock Holmes is a British television series that was produced by Thames Television and originally broadcast on the ITV Network. There were two series of 13 fifty-minute episodes; the first aired in 1971, the second in 1973. The programme presented adaptations of short mystery, suspense or crime stories featuring, as the title suggests, detectives who were literary contemporaries of Arthur Conan Doyle's Sherlock Holmes. The Rivals of Sherlock Holmes took its inspiration – and title – from a series of published anthologies by Hugh Greene, elder brother of author Graham Greene and the former director-general of the BBC. Hugh Greene is credited on the programme as a creative consultant. The authors and detectives featured on the programme include: ⁕Robert Barr ⁕Guy Boothby ⁕Ernest Bramah ⁕R. Austin Freeman ⁕Jacques Futrelle ⁕Adalbert Goldscheider, a.k.a. \"Balduin Groller\" ⁕George Griffith Featured Crew Hugh Greene Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1973 | 21 Episodes Season 2 of The Rivals of Sherlock Holmes premiered on January 29, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Rivals of Sherlock Holmes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors V 5 Vince TB 2 TMDb Bot J 2 JeePeCe 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}