{"link": "https://www.themoviedb.org/tv/68127?language=en", "title": "Black Lake", "resume": "An unsettling chain of events are set into motion when a group of young friends an visit an abandoned ski resort in the far reaches of Sweden. The remote and neglected Black Lake has been closed for years when Johan invites his friends to stay there. He dreams of reopening the isolated hotel and restoring it to a luxury ski resort, but what begins as a fun research trip soon takes a sinister turn as the group is gripped by a series of unexplained and disturbing events. They soon uncover the real reason Black Lake was abandoned all those years before, and solving the mystery rapidly becomes a matter of life and death.", "rate": 46, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Sarah-Sofie Boussnina", "Filip Berg", "Mathilde Norholt", "Aliette Opheim", "Anna Åström"], "character": ["Hanne", "Johan", "Mette", "Jessan", "Elin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68127   Expand Black Lake   (2016) User Score  Play Trailer Overview An unsettling chain of events are set into motion when a group of young friends an visit an abandoned ski resort in the far reaches of Sweden. The remote and neglected Black Lake has been closed for years when Johan invites his friends to stay there. He dreams of reopening the isolated hotel and restoring it to a luxury ski resort, but what begins as a fun research trip soon takes a sinister turn as the group is gripped by a series of unexplained and disturbing events. They soon uncover the real reason Black Lake was abandoned all those years before, and solving the mystery rapidly becomes a matter of life and death. Featured Crew Ulf Kvensler Creator Jonathan Sjöberg Creator David Berron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah-Sofie Boussnina Hanne Filip Berg Johan Mathilde Norholt Mette Aliette Opheim Jessan Anna Åström Elin Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Black Lake premiered on October 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Black Lake. You can help by rating TV shows you've seen. Facts Original Name  Svartsjön Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Swedish Runtime  45m Homepage   https://viaplay.se/svartsjon Genres Crime Drama Mystery Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 67 Bendik 10 Razorback121 7 Elizabeth Jennings 5 luftikus009  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}