{"link": "https://www.themoviedb.org/tv/72800?language=en", "title": "Man Who Dies to Live", "resume": "In the late 1970's, Jang Dal-Goo went to the Middle East and settled down in the small kingdom. He became Count Souad Fahd Ali and found success there, but he returns to South Korea to find his daughter. He appears in front his daughter Lee Ji-Young and his son-in-law Kang Ho-Rim.\nLee Ji-Young has a positive personality and her dream is to have a happy family and become a writer. Kang Ho-Rim has a great looking appearance and works as an ordinary salaryman.", "rate": 83, "genre": ["Comedy", "Drama", "Family"], "cast": ["Choi Min-soo", "Kang Ye-won", "Shin Sung-rok", "Lee So-yeon", "Cho Tae-Kwan"], "character": ["Jang Dal-Goo", "Lee Ji-Young 'A'", "Kang Ho-Rim", "Lee Ji-Young 'B'", "Abdallah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72800   Expand Man Who Dies to Live   (2017) User Score Overview In the late 1970's, Jang Dal-Goo went to the Middle East and settled down in the small kingdom. He became Count Souad Fahd Ali and found success there, but he returns to South Korea to find his daughter. He appears in front his daughter Lee Ji-Young and his son-in-law Kang Ho-Rim. Lee Ji-Young has a positive personality and her dream is to have a happy family and become a writer. Kang Ho-Rim has a great looking appearance and works as an ordinary salaryman. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Min-soo Jang Dal-Goo Kang Ye-won Lee Ji-Young 'A' Shin Sung-rok Kang Ho-Rim Lee So-yeon Lee Ji-Young 'B' Cho Tae-Kwan Abdallah Full Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of Man Who Dies to Live premiered on July 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2017-08-09 Manhole 7.3    2017-07-19 Reunited Worlds 8.3    2017-08-05 Save Me 7.0    2017-05-10 Ruler: Master of the Mask 6.7    2017-07-24 Falsify 6.1    2017-08-04 Strongest Deliveryman 6.3    2017-08-30 Hospital Ship 4.8    2017-05-22 Circle 6.6  Facts Original Name  죽어야 사는 남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  30m Homepage   http://www.imbc.com/broad/tv/drama/mansure/ Genres Comedy Drama Family Keywords korea Content Score 86 Almost there... Top Contributors M 42 Maria180493 10 Elizabeth Jennings 2 John Hutl 2 rus4me  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}