{"link": "https://www.themoviedb.org/tv/43121?language=en", "title": "Political Animals", "resume": "Former first lady and current Secretary of State Elaine Barrish Hammond try to keep her family together while simultaneously dealing with crises of the State Department and fending off the hungry DC journalist who is bent on destroying her career.", "rate": 72, "genre": ["Drama"], "cast": ["Sigourney Weaver", "Carla Gugino", "James Wolk", "Sebastian Stan", "Ellen Burstyn"], "character": ["Elaine Barrish Hammond", "Susan Berg", "Douglas Hammond", "T.J. Hammond", "Margaret Barrish"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43121   Expand Political Animals   (2012) User Score Overview Former first lady and current Secretary of State Elaine Barrish Hammond try to keep her family together while simultaneously dealing with crises of the State Department and fending off the hungry DC journalist who is bent on destroying her career. Featured Crew Greg Berlanti Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sigourney Weaver Elaine Barrish Hammond Carla Gugino Susan Berg James Wolk Douglas Hammond Sebastian Stan T.J. Hammond Ellen Burstyn Margaret Barrish Full Cast & Crew Last Season Season 1 2012 | 6 Episodes Season 1 of Political Animals premiered on July 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2012-11-24 Labyrinth 5.7    2011-01-20 Fairly Legal 5.8    2009-03-15 Kings 7.9    2013-12-18 The Great Train Robbery 6.8    2015-09-30 Con Man 6.6    2016-10-16 Eyewitness 7.4    2006-10-03 Friday Night Lights 7.9    2015-03-06 Unbreakable Kimmy Schmidt 7.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  44m Homepage   http://www2.usanetwork.com/series/politicalanimals/ Genres Drama Keywords politics miniseries Content Score 93 Almost there... Top Contributors R 11 Rebecca 10 Banana 6 United600 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}