{"link": "https://www.themoviedb.org/tv/42329?language=en", "title": "Bunheads", "resume": "Michelle, a Las Vegas showgirl, impulsively marries a man, moves to his sleepy coastal town, and takes an uneasy role at her new mother-in-law's dance school.", "rate": 63, "genre": ["Comedy", "Drama"], "cast": ["Sutton Foster", "Kelly Bishop", "Julia Goldani Telles", "Bailey De Young", "Emma Dumont"], "character": ["Michelle Simms", "Fanny Flowers", "Sasha Torres", "Ginny Thompson", "Melanie Segal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42329   Expand Bunheads   (2012) User Score  Play Trailer Overview Michelle, a Las Vegas showgirl, impulsively marries a man, moves to his sleepy coastal town, and takes an uneasy role at her new mother-in-law's dance school. Featured Crew Amy Sherman-Palladino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sutton Foster Michelle Simms Kelly Bishop Fanny Flowers Julia Goldani Telles Sasha Torres Bailey De Young Ginny Thompson Emma Dumont Melanie Segal Full Cast & Crew Last Season Season 1 2012 | 18 Episodes Season 1 of Bunheads premiered on June 11, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Gilmore Guys (Bunhead Bros) Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2007-10-15 Samantha Who? 6.5    2015-07-26 I Am Cait 5.5    2014-06-24 Botched 5.1    2010-10-12 Lip Service 6.6    2015-10-06 Chewing Gum 7.0    2011-10-10 Enlightened 7.1    2017-06-20 The Bold Type 4.7    2016-11-25 Gilmore Girls: A Year in the Life 7.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://freeform.go.com/shows/bunheads Genres Comedy Drama Keywords dancing small town sport ballet Content Score 100 Yes! Looking good! Top Contributors 35 Banana z 5 zurman1 3 Zlogorek s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}