{"link": "https://www.themoviedb.org/tv/69533?language=en", "title": "Maigret", "resume": "Adaptation of the books by Georges Simenon featuring his fictional French detective Jules Maigret played by Rowan Atkinson.", "rate": 82, "genre": ["Crime", "Drama"], "cast": ["Rowan Atkinson", "Leo Staar", "Shaun Dingwall", "Zsófia Rea", "Alexander Campbell"], "character": ["Chief Inspector Jules Maigret", "Inspector LaPointe", "Inspector Janvier", "Nicole Lecoin", "Dennis Lecoin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69533   Expand Maigret   (2016) User Score Overview Adaptation of the books by Georges Simenon featuring his fictional French detective Jules Maigret played by Rowan Atkinson. Featured Crew Georges Simenon Creator Stewart Harcourt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rowan Atkinson Chief Inspector Jules Maigret Leo Staar Inspector LaPointe Shaun Dingwall Inspector Janvier Zsófia Rea Nicole Lecoin Alexander Campbell Dennis Lecoin Full Cast & Crew Last Season Season 2 2017 | 2 Episodes Season 2 of Maigret premiered on April 16, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Maigret. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2013-08-22 Crossing Lines 6.8    1991-09-07 Taz-Mania 6.3    1984-09-30 Murder, She Wrote 6.5    2008-11-30 Wallander 7.6    1993-04-21 Walker, Texas Ranger 5.0    1982-10-01 Remington Steele 6.9  Facts Status  Returning Series Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Crime Drama Keywords prostitute france police detective investigation europe crime city justice Content Score 93 Almost there... Top Contributors 21 theefallen 17 david8s95 m 7 miro22 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}