{"link": "https://www.themoviedb.org/tv/67806?language=en", "title": "Home from Home", "resume": "Uptight, try-hard dad Neil Hackett's decision to buy a lodge in the Lake District proves disastrous when he discovers he is living next door to the uber successful, effortlessly superior Dillons.", "rate": 50, "genre": ["Comedy"], "cast": ["Johnny Vegas", "Niky Wardley", "Adam James", "Emilia Fox", "Harvey Chaisty"], "character": ["Neil Hackett", "Fiona Hackett", "Robert Dillon", "Penny Dillon", "Little Neil Hackett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67806   Expand Home from Home   (2018) User Score  Play Trailer Overview Uptight, try-hard dad Neil Hackett's decision to buy a lodge in the Lake District proves disastrous when he discovers he is living next door to the uber successful, effortlessly superior Dillons. Featured Crew Chris Fewtrell Creator Simon Crowther Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johnny Vegas Neil Hackett Niky Wardley Fiona Hackett Adam James Robert Dillon Emilia Fox Penny Dillon Harvey Chaisty Little Neil Hackett Full Cast & Crew Current Season Series 1 2018 | 6 Episodes Season 1 of Home from Home premiered on April 19, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Home from Home. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  27m Homepage   https://www.bbc.co.uk/programmes/b0b09jcg Genres Comedy Keywords countryside wife family's daily life family husband sitcom british humour Content Score 100 Yes! Looking good! Top Contributors 47 CouchTater 25 Elizabeth Jennings 17 Markxist w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}