{"link": "https://www.themoviedb.org/tv/4621?language=en", "title": "Galactica 1980", "resume": "Galactica 1980 is a science fiction television series, and a spin-off from the original Battlestar Galactica television series. It was first broadcast on the ABC network in the United States from January 27 to May 4, 1980. It was later shown in reruns on the Sci Fi Channel.", "rate": 58, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Kent McCord", "Barry Van Dyke", "Robyn Douglass", "Lorne Greene", "James Patrick Stuart"], "character": ["Capt. Troy", "Lt. Dillon", "Jamie Hamilton", "Commander Adama", "Dr. Zee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4621   Expand Galactica 1980   (1980) User Score Overview Galactica 1980 is a science fiction television series, and a spin-off from the original Battlestar Galactica television series. It was first broadcast on the ABC network in the United States from January 27 to May 4, 1980. It was later shown in reruns on the Sci Fi Channel. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kent McCord Capt. Troy Barry Van Dyke Lt. Dillon Robyn Douglass Jamie Hamilton Lorne Greene Commander Adama James Patrick Stuart Dr. Zee Full Cast & Crew Last Season Season 1 1980 | 10 Episodes Season 1 of Galactica 1980 premiered on January 27, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply can t believe Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   1978-09-17 Battlestar Galactica 6.9    1979-09-20 Buck Rogers in the 25th Century 6.9    2001-05-26 Messiah 8.0    2000-08-27 Witchblade 5.7    1983-03-08 The Fall Guy 6.4    1975-09-10 Starsky & Hutch 6.5    1977-09-22 Man from Atlantis 5.6    1976-03-21 Charlie's Angels 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 10 zurman1 3 6 38956 F 6 Francky_D K 4 Keks666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}