{"link": "https://www.themoviedb.org/tv/67696?language=en", "title": "Loosely Exactly Nicole", "resume": "Nicole Byer is living the Hollywood dream. Well, Hollywood adjacent – the deep valley to be precise – and it's not so much a dream but a struggle. With the help of her two besties, Veronica and Devin, Nicole will have to navigate the \"real world\" as she endures humiliating auditions, unpaid electric bills and the romantic battlefield that is Tinder, all while slowly, but surely, finding her voice as a comedian.", "rate": 58, "genre": ["Comedy"], "cast": ["Nicole Byer"], "character": ["Nicole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67696   Expand Loosely Exactly Nicole   (2016) User Score Overview Nicole Byer is living the Hollywood dream. Well, Hollywood adjacent – the deep valley to be precise – and it's not so much a dream but a struggle. With the help of her two besties, Veronica and Devin, Nicole will have to navigate the \"real world\" as she endures humiliating auditions, unpaid electric bills and the romantic battlefield that is Tinder, all while slowly, but surely, finding her voice as a comedian. Featured Crew Christine Zander Creator Christian Lander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicole Byer Nicole Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Loosely Exactly Nicole premiered on March  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2015-10-16 Truth Be Told 5.5    2016-06-07 Agatha Raisin 6.3    2016-01-13 Teachers 7.1    2016-10-19 HIM 6.2    2017-05-17 Downward Dog 6.7    2016-09-05 Mary + Jane 6.1    2014-10-10 Cristela 6.1    2015-06-08 Odd Mom Out 6.7  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  20m Homepage   http://mtv.com/shows/loosely-exactly-nicole Genres Comedy Keywords hollywood aspiring actor young adult inspired by celebrity Content Score 64 We're so close, yet so far. Top Contributors 27 Banana MG 5 Melanie Guevara CG 4 Cheryl G. Gaines 4 roimidas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}