{"link": "https://www.themoviedb.org/tv/9867?language=en", "title": "The Sylvester & Tweety Mysteries", "resume": "The Sylvester & Tweety Mysteries, produced by Warner Bros. Animation, is an animated television series which aired from 1995 to 2001 on Kids' WB and was later re-run on Cartoon Network. It follows Looney Tunes characters Sylvester and Tweety Bird, and their owner Granny, along with bulldog Hector, as they solved mysteries, even with Sylvester still trying to eat Tweety in the middle of solving the mysteries, but Hector acted as a bodyguard for Tweety, and would even beat Sylvester up. The first season was dedicated to the memory of Friz Freleng, who had died only months before the series premiere. Also, it contains one case per episode, in contrast to the other seasons, which are all with two cases.\nOther Looney Tunes characters make cameo appearances, including Daffy Duck, Yosemite Sam, Elmer Fudd, Tasmanian Devil, Pepe Le Pew, Beaky Buzzard, Babbit and Catstello, Hubie and Bertie, Witch Hazel, Michigan J. Frog, Rocky and Mugsy, Marvin the Martian, Hippety Hopper, Gossamer, Count Blood Count, Cecil Turtle, Nasty Canasta, The Crusher, Pete Puma, Goofy Gophers, and latter-day Warner cartoon star Cool Cat who appears in some form in most of the episodes.", "rate": 73, "genre": ["Animation", "Comedy"], "cast": ["Frank Welker", "Joe Alaskey", "June Foray"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9867   Expand The Sylvester & Tweety Mysteries   (1995) User Score Overview The Sylvester & Tweety Mysteries, produced by Warner Bros. Animation, is an animated television series which aired from 1995 to 2001 on Kids' WB and was later re-run on Cartoon Network. It follows Looney Tunes characters Sylvester and Tweety Bird, and their owner Granny, along with bulldog Hector, as they solved mysteries, even with Sylvester still trying to eat Tweety in the middle of solving the mysteries, but Hector acted as a bodyguard for Tweety, and would even beat Sylvester up. The first season was dedicated to the memory of Friz Freleng, who had died only months before the series premiere. Also, it contains one case per episode, in contrast to the other seasons, which are all with two cases. Other Looney Tunes characters make cameo appearances, including Daffy Duck, Yosemite Sam, Elmer Fudd, Tasmanian Devil, Pepe Le Pew, Beaky Buzzard, Babbit and Catstello, Hubie and Bertie, Witch Hazel, Michigan J. Frog, Rocky and Mugsy, Marvin the Martian, Hippety Hopper, Gossamer, Count Blood Count, Cecil Turtle, Nasty Canasta, The Crusher, Pete Puma, Goofy Gophers, and latter-day Warner cartoon star Cool Cat who appears in some form in most of the episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Welker Joe Alaskey June Foray Full Cast & Crew Last Season Sylvester & tweety mysteries season 5 1999 | 5 Episodes Season 5 of The Sylvester & Tweety Mysteries premiered on September 18, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1991-09-07 Taz-Mania 6.3    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    1975-09-06 The Tom and Jerry Show 7.6    2002-09-14 What's New, Scooby-Doo? 7.0    1994-09-05 Aladdin 6.2    1998-08-31 Noddy 5.9    Rupert 7.4    Silver Surfer: The Animated Series 7.7  Facts Status  Ended Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 TheOneManBoxOffice 3 WinstonWolf E 3 EightNine s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}