{"link": "https://www.themoviedb.org/tv/48250?language=en", "title": "Waking Love Up", "resume": "“Waking Love Up” is a 2011 Chinese drama directed by Shen Yi. It is a remake of the popular 2005 Taiwanese drama “The Prince Who Turns Into a Frog.”\nWhat happens when you lose your memory on the day of your engagement? Xiang Tian Qi is a hotel heir and CEO of the HaoLi Hotel Group who is about to get engaged to Mu Zhi Qing, the hotel’s PR manager. But on the day of their engagement, a rival within the company deliberately causes an accident to get rid of Tian Qi. He survives the accident but loses his memory. When Liu Xiao Bei, a plucky country girl who dreams of a better life in the big city, finds Tian Qi, she takes him home to live with her family and he begins to go by the name Xiao Yu. After Tian Qi’s disappearance, Zhi Qing is comforted by Ji Ru Feng, the hotel celebrity spokesperson who has always liked her. As Tian Qi is increasingly drawn to the plucky Zhi Qing, will he be able to regain his memory and return to his previous life?", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Roy Chiu", "Tiffany Tang", "Jeremy Xu Zheng-Xi", "Stephy Qi"], "character": ["Xiang Tian Qi", "Liu Xiao Bei", "Eric Li Ru Feng", "Mu Zhi Qing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48250   Expand Waking Love Up   (2011) User Score Overview “Waking Love Up” is a 2011 Chinese drama directed by Shen Yi. It is a remake of the popular 2005 Taiwanese drama “The Prince Who Turns Into a Frog.” What happens when you lose your memory on the day of your engagement? Xiang Tian Qi is a hotel heir and CEO of the HaoLi Hotel Group who is about to get engaged to Mu Zhi Qing, the hotel’s PR manager. But on the day of their engagement, a rival within the company deliberately causes an accident to get rid of Tian Qi. He survives the accident but loses his memory. When Liu Xiao Bei, a plucky country girl who dreams of a better life in the big city, finds Tian Qi, she takes him home to live with her family and he begins to go by the name Xiao Yu. After Tian Qi’s disappearance, Zhi Qing is comforted by Ji Ru Feng, the hotel celebrity spokesperson who has always liked her. As Tian Qi is increasingly drawn to the plucky Zhi Qing, will he be able to regain his memory and return to his previous life? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roy Chiu Xiang Tian Qi Tiffany Tang Liu Xiao Bei Jeremy Xu Zheng-Xi Eric Li Ru Feng Stephy Qi Mu Zhi Qing Full Cast & Crew Last Season Season 1 2011 | 40 Episodes Season 1 of Waking Love Up premiered on September 13, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Waking Love Up. You can help by rating TV shows you've seen. Facts Original Name  爱情睡醒了 Status  Ended Network Anhui Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 28 Maria180493 6 Elizabeth Jennings z 5 zurman1 3 empireyura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}