{"link": "https://www.themoviedb.org/tv/67272?language=en", "title": "Shopping King Louie", "resume": "A romance takes place between Kang Ji-Sung aka Louie and Ko Bok-Sil. Louie is from a rich family, but he has lost his memory. Ko Bok-Sil is a woman with a heart like an angel. Louie learns about true love after meeting Ko Bok-Sil.", "rate": 67, "genre": ["Comedy", "Drama"], "cast": ["Seo In Guk", "Nam Ji-hyeon", "Yoon Sang-hyun", "Im Se-Mi", "Oh Dae-Hwan"], "character": ["Louie", "Ko Bok-Shil", "Cha Joong-Won", "Baek Ma-Ri", "Jo In-Sung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67272   Expand Shopping King Louie   (2016) User Score Overview A romance takes place between Kang Ji-Sung aka Louie and Ko Bok-Sil. Louie is from a rich family, but he has lost his memory. Ko Bok-Sil is a woman with a heart like an angel. Louie learns about true love after meeting Ko Bok-Sil. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo In Guk Louie Nam Ji-hyeon Ko Bok-Shil Yoon Sang-hyun Cha Joong-Won Im Se-Mi Baek Ma-Ri Oh Dae-Hwan Jo In-Sung Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of Shopping King Louie premiered on September 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-09-21 On the Way to the Airport 8.7    2016-06-17 Squad 38 7.7    2016-05-25 Lucky Romance 7.3    2016-11-16 Oh My Geum Bi 8.7    2015-03-18 Angry Mom 8.3    2016-01-11 Moorim School 6.2    2017-07-17 The King in Love 5.4  Facts Original Name  쇼핑왕 루이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/louis/ Genres Comedy Drama Keywords romance korea Content Score 93 Almost there... Top Contributors M 48 Maria180493 z 15 zurman1 13 Imzadi 13 daliasued  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}