{"link": "https://www.themoviedb.org/tv/6208?language=en", "title": "Little Bill", "resume": "Little Bill is a television show for children that is presently on Nick Jr. The stories are based on Bill Cosby's Little Bill book series, set in Philadelphia and feature Bill Jr. learning a lesson or moral. It was developed through research and in consultation with a panel of educational consultants.\nThe show also aired on CBS as part of Nick Jr. on CBS, from September 16, 2000 - September 7, 2002, then as part of Nick on CBS from August 2, 2003 - September 10, 2005. The show returned with the return of Nick Jr. on CBS on September 17, 2005, and seen through September 9, 2006 when the block was replaced with The KOL Secret Slumber Party on CBS. The series went back into production in fall 2006 and a new season of 6 episodes aired on Noggin throughout April and July 2007, ending in the later month. Reruns are played on Nick Jr., on BET, as of January 7, 2008, and on Centric, as of May 1, 2010.\nSonia Manzano, best known for playing Maria Rodriguez on Sesame Street, was a frequent writer for the show.", "rate": 48, "genre": ["Animation"], "cast": ["Phylicia Rashād", "Gregory Hines", "Monique Beasley", "Xavier Pritchett", "Eunice Cho"], "character": ["Big Bill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6208   Expand Little Bill   (1999) User Score Overview Little Bill is a television show for children that is presently on Nick Jr. The stories are based on Bill Cosby's Little Bill book series, set in Philadelphia and feature Bill Jr. learning a lesson or moral. It was developed through research and in consultation with a panel of educational consultants. The show also aired on CBS as part of Nick Jr. on CBS, from September 16, 2000 - September 7, 2002, then as part of Nick on CBS from August 2, 2003 - September 10, 2005. The show returned with the return of Nick Jr. on CBS on September 17, 2005, and seen through September 9, 2006 when the block was replaced with The KOL Secret Slumber Party on CBS. The series went back into production in fall 2006 and a new season of 6 episodes aired on Noggin throughout April and July 2007, ending in the later month. Reruns are played on Nick Jr., on BET, as of January 7, 2008, and on Centric, as of May 1, 2010. Sonia Manzano, best known for playing Maria Rodriguez on Sesame Street, was a frequent writer for the show. Featured Crew Bill Cosby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phylicia Rashād Gregory Hines Big Bill Monique Beasley Xavier Pritchett Eunice Cho Full Cast & Crew Last Season Season 4 2003 | 19 Episodes Season 4 of Little Bill premiered on February 18, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2001-08-11 Cubix 4.3    2004-11-19 Hi Hi Puffy AmiYumi 4.0    1999-09-06 Sabrina: The Animated Series 5.5    1999-10-16 The Amanda Show 5.2    2003-04-12 All Grown Up! 4.7    2002-03-01 Digimon Tamers 5.9    2003-11-01 Xiaolin Showdown 6.9    2005-12-26 My Gym Partner's a Monkey 5.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}