{"link": "https://www.themoviedb.org/tv/1799?language=en", "title": "Outrageous Fortune", "resume": "Outrageous Fortune is a New Zealand comedy-drama television series, which ran from 12 July 2005 to 9 November 2010 on TV3. The series followed the lives of the career criminal West family after the matriarch, Cheryl, decided the family should go straight and abide by the law. The show was created by James Griffin and Rachel Lang and produced by South Pacific Pictures.\nLike the show itself, episodes took their names from Shakespeare quotations. The show concluded after 6 seasons and 107 episodes making it the longest running drama series made in New Zealand. The primary cast for the show's run consisted of Robyn Malcolm, Antony Starr, Siobhan Marshall, Antonia Prebble, Frank Whitten and Kirk Torrance; Grant Bowler appeared in a sporadic role throughout the show's first five seasons.\nThe show premiered on 12 July 2005 and was welcomed by high acclaim. It won many of the major categories in the New Zealand television awards for its first 4 years, with Malcolm's performance warmly recognised by most New Zealand reviewers. Following the show's success, both the United States and England adapted Outrageous Fortune into their own respective series, neither of which were renewed after the debut season.", "rate": 71, "genre": ["Comedy", "Drama"], "cast": ["Antonia Prebble", "Charles Mesure", "Grant Bowler", "Shane Cortese", "Robyn Malcolm"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1799   Expand Outrageous Fortune   (2005) User Score Overview Outrageous Fortune is a New Zealand comedy-drama television series, which ran from 12 July 2005 to 9 November 2010 on TV3. The series followed the lives of the career criminal West family after the matriarch, Cheryl, decided the family should go straight and abide by the law. The show was created by James Griffin and Rachel Lang and produced by South Pacific Pictures. Like the show itself, episodes took their names from Shakespeare quotations. The show concluded after 6 seasons and 107 episodes making it the longest running drama series made in New Zealand. The primary cast for the show's run consisted of Robyn Malcolm, Antony Starr, Siobhan Marshall, Antonia Prebble, Frank Whitten and Kirk Torrance; Grant Bowler appeared in a sporadic role throughout the show's first five seasons. The show premiered on 12 July 2005 and was welcomed by high acclaim. It won many of the major categories in the New Zealand television awards for its first 4 years, with Malcolm's performance warmly recognised by most New Zealand reviewers. Following the show's success, both the United States and England adapted Outrageous Fortune into their own respective series, neither of which were renewed after the debut season. Featured Crew James Griffin Creator Rachel Lang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonia Prebble Charles Mesure Grant Bowler Shane Cortese Robyn Malcolm Full Cast & Crew Last Season Season 6 2010 | 17 Episodes Season 6 of Outrageous Fortune premiered on July 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   1996-09-21 Profiler 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.outrageousfortune.co.nz Genres Comedy Drama Keywords new zealand criminal family 1980s auckland Content Score 93 Almost there... Top Contributors p 26 plumpro s 5 speedycars 5 Elizabeth Jennings 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}