{"link": "https://www.themoviedb.org/tv/45801?language=en", "title": "Glitter Force", "resume": "Glitter Force is a Japanese anime series and the ninth installment in Izumi Todo's Pretty Cure series. Produced by Toei Animation, the series is written by Shōji Yonemura, who is best known as the head writer of Glass Fleet and Kamen Rider Kabuto. The character designs were done by Toshie Kawamura, who previously worked on the character designs for Yes! PreCure 5. The series aired on TV Asahi's ANN network between February 5, 2012 and January 27, 2013, replacing Suite PreCure♪ in its initial timeslot, and is succeeded by Dokidoki! PreCure. A film was released in Japanese theatres on October 27, 2012. The series' main motif is fairy tales.", "rate": 63, "genre": ["Animation"], "cast": ["Misato Fukuen", "Hisako Kanemoto", "Chinami Nishimura", "Asami Tano", "Marina Inoue"], "character": ["Miyuki Hoshizora", "Yayoi Kise", "Reika Aoki", "Akane Hino", "Nao Midorikawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45801   Expand Glitter Force   (2012) User Score Overview Glitter Force is a Japanese anime series and the ninth installment in Izumi Todo's Pretty Cure series. Produced by Toei Animation, the series is written by Shōji Yonemura, who is best known as the head writer of Glass Fleet and Kamen Rider Kabuto. The character designs were done by Toshie Kawamura, who previously worked on the character designs for Yes! PreCure 5. The series aired on TV Asahi's ANN network between February 5, 2012 and January 27, 2013, replacing Suite PreCure♪ in its initial timeslot, and is succeeded by Dokidoki! PreCure. A film was released in Japanese theatres on October 27, 2012. The series' main motif is fairy tales. Featured Crew Izumi Todo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Misato Fukuen Miyuki Hoshizora Hisako Kanemoto Yayoi Kise Chinami Nishimura Reika Aoki Asami Tano Akane Hino Marina Inoue Nao Midorikawa Full Cast & Crew Last Season Season 1 2012 | 48 Episodes Season 1 of Glitter Force premiered on February  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2011-09-05 Zig and Sharko 5.3    2013-03-25 Max Steel 4.8  Facts Original Name  スマイルプリキュア！ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.toei-anim.co.jp/tv/smile_precure/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 10 tmdb983464 6 Banana 5 RubeensVinicius 3 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}