{"link": "https://www.themoviedb.org/tv/52856?language=en", "title": "The Rising Sun: Roy Ruk Hak Liam Tawan", "resume": "\"Roy Rak Hak Liam Tawan,\" the first story of The Rising Sun series, is about a Thai lady name Praedow/Seiko who just got a scholarship from Japan for her master. Praedow's beauty impressed Takeshi, the second son of a very powerful family, Onizuka. He kept follow her but never approached her. Finally, Ryu, Takeshi cousin helped him to talk to her and their relationship started. As soon as Praedao found out that Takashi & Ryu were member of gokudō, she was scare and distances herself from them and told them to leave her alone. Takashi didn’t gave up, every day he’d go near Praedow’s class and watch her from distant. The problem is Takeshi already have fiancé, and complicated start when his dad and brother died from a car bomb, he had to become an Oyabun the head of Onizuka's gang, but he announced he will not marry his fiancé until he revenges his dad & brother’s death. However, Aiko, his fiancé found out that he was in love with Praedow so she order the gangster to kidnap her then Takeshi went to rescue her and problem's begun once he took her in and announced that she is his mistress....As he is becoming the head of the family, people are attacking his weakest point, his love one. She becomes a prey and a mark for all his enemies. What will Praedow do? Will she stay with him? What about Takeshi love for her?", "rate": 80, "genre": ["Soap", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52856   Expand The Rising Sun: Roy Ruk Hak Liam Tawan   (2014) User Score Overview \"Roy Rak Hak Liam Tawan,\" the first story of The Rising Sun series, is about a Thai lady name Praedow/Seiko who just got a scholarship from Japan for her master. Praedow's beauty impressed Takeshi, the second son of a very powerful family, Onizuka. He kept follow her but never approached her. Finally, Ryu, Takeshi cousin helped him to talk to her and their relationship started. As soon as Praedao found out that Takashi & Ryu were member of gokudō, she was scare and distances herself from them and told them to leave her alone. Takashi didn’t gave up, every day he’d go near Praedow’s class and watch her from distant. The problem is Takeshi already have fiancé, and complicated start when his dad and brother died from a car bomb, he had to become an Oyabun the head of Onizuka's gang, but he announced he will not marry his fiancé until he revenges his dad & brother’s death. However, Aiko, his fiancé found out that he was in love with Praedow so she order the gangster to kidnap her then Takeshi went to rescue her and problem's begun once he took her in and announced that she is his mistress....As he is becoming the head of the family, people are attacking his weakest point, his love one. She becomes a prey and a mark for all his enemies. What will Praedow do? Will she stay with him? What about Takeshi love for her? Featured Crew Makers Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2015 | 9 Episodes Season 2 of The Rising Sun: Roy Ruk Hak Liam Tawan premiered on January  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on The Rising Sun: Roy Ruk Hak Liam Tawan. You can help by rating TV shows you've seen. Facts Original Name  The Rising Sun Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 64 We're so close, yet so far. Top Contributors 98 Crip 49 Elizabeth Jennings 8 mariilakorn21 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}