{"link": "https://www.themoviedb.org/tv/71414?language=en", "title": "Little Boy Blue", "resume": "Based on a true story, this four-part drama tells the story of the murder of 11-year-old Rhys Jones in Croxteth, Liverpool, in 2007. It explores Melanie’s and Steve’s ordeal, and tells of how Rhys’ murderer and associates were eventually brought to justice.", "rate": 86, "genre": ["Crime", "Drama"], "cast": ["Stephen Walters", "Sonny Begya", "Matthew Roberts", "Christine Tremarco", "Michael Moran"], "character": ["DCI Mark Guinness", "Rhys Jones", "Owen Jones", "Marie Thompson", "Kevin Moody"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71414   Expand Little Boy Blue   (2017) User Score  Play Trailer Overview Based on a true story, this four-part drama tells the story of the murder of 11-year-old Rhys Jones in Croxteth, Liverpool, in 2007. It explores Melanie’s and Steve’s ordeal, and tells of how Rhys’ murderer and associates were eventually brought to justice. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Walters DCI Mark Guinness Sonny Begya Rhys Jones Matthew Roberts Owen Jones Christine Tremarco Marie Thompson Michael Moran Kevin Moody Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Little Boy Blue premiered on April 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2012-06-26 Line of Duty 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage   https://www.itv.com/hub/little-boy-blue/2a3520a0001 Genres Crime Drama Keywords based on a true story liverpool murder miniseries crime justice Content Score 93 Almost there... Top Contributors TB 49 TMDb Bot 22 Ash p 12 plumpro 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}