{"link": "https://www.themoviedb.org/tv/66992?language=en", "title": "Taboo Tattoo", "resume": "Seigi, a martial arts trained middle schooler, often feels driven to protect the weaker people around him. One day, he defends a homeless man against some punks, and the man gives him a strange tattoo on his palm in return. The tattoo is a secret weapon produced in the arms race between America and the Serinistan Kingdom. Seigi finds himself in over his head when a powerful girl, using the same secret weapon, violently pursues him in order to retrieve it. His skill at martial arts may not be enough to keep him alive, but will he be able to learn how to trigger the power of his tattoo in time?", "rate": 75, "genre": ["Animation", "Comedy", "Mystery", "Action", "Adventure"], "cast": ["Makoto Furukawa", "Mikako Komatsu", "Chika Anzai", "Tomokazu Sugita", "Eri Kitamura"], "character": ["Justice Akatsuka", "Bluesy Fluesy", "Tōko Ichinose", "Tom Shredfield", "Lisa Lovelock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66992   Expand Taboo Tattoo   (2016) User Score  Play Trailer Overview Seigi, a martial arts trained middle schooler, often feels driven to protect the weaker people around him. One day, he defends a homeless man against some punks, and the man gives him a strange tattoo on his palm in return. The tattoo is a secret weapon produced in the arms race between America and the Serinistan Kingdom. Seigi finds himself in over his head when a powerful girl, using the same secret weapon, violently pursues him in order to retrieve it. His skill at martial arts may not be enough to keep him alive, but will he be able to learn how to trigger the power of his tattoo in time? Featured Crew Takashi Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Makoto Furukawa Justice Akatsuka Mikako Komatsu Bluesy Fluesy Chika Anzai Tōko Ichinose Tomokazu Sugita Tom Shredfield Eri Kitamura Lisa Lovelock Full Cast & Crew Last Season Taboo Tattoo 2016 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Taboo Tattoo. You can help by rating TV shows you've seen. Facts Original Name  タブー・タトゥー Status  Ended Network Certification R18+ Meaning Not for children under 18; this is limited to Adult \"Pay Per View\" VC 196 and 197. Content may include graphic violence, sexual situations, coarse language and explicit drug use. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tabootattoo-anime.com Genres Animation Comedy Mystery Action & Adventure Keywords martial arts supernatural super power anime Content Score 100 Yes! Looking good! Top Contributors 17 BobbyL 13 Steinholf 12 karaa 12 Animes Flix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}