{"link": "https://www.themoviedb.org/tv/62445?language=en", "title": "Big Time in Hollywood, Fl", "resume": "Follows two delusional brothers, who are self-proclaimed filmmakers, as they are kicked out of their parent's house and end up on an epic cinematic journey.", "rate": 68, "genre": ["Comedy"], "cast": ["Alex Anfanger", "Lenny Jacobson", "Stephen Tobolowsky", "Kathy Baker", "Jon Bass"], "character": ["Alex Dolfe", "Ben Dolfe", "Alan Dolfe", "Diana Dolfe", "Del Plimpton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62445   Expand Big Time in Hollywood, Fl   (2015) User Score Overview Follows two delusional brothers, who are self-proclaimed filmmakers, as they are kicked out of their parent's house and end up on an epic cinematic journey. Featured Crew Alex Anfanger Creator Dan Schimpf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex Anfanger Alex Dolfe Lenny Jacobson Ben Dolfe Stephen Tobolowsky Alan Dolfe Kathy Baker Diana Dolfe Jon Bass Del Plimpton Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Big Time in Hollywood, Fl premiered on March 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-08-05 Quick Draw 6.3    2007-03-15 Raines 7.3    2010-09-22 The Defenders 7.0    2015-01-19 Catastrophe 7.3    2015-06-16 Clipped 4.1    2013-09-23 Trophy Wife 5.7    2013-04-19 Alpha House 7.3    2014-03-21 Welcome to Sweden 6.3  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/big-time-in-hollywood--fl Genres Comedy Keywords sibling relationship dark comedy filmmaker lying Content Score 93 Almost there... Top Contributors 25 davelandry 11 Abu-Dun 10 Banana 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}