{"link": "https://www.themoviedb.org/tv/1542?language=en", "title": "Frisky Dingo", "resume": "Frisky Dingo is an American animated cartoon series created by Adam Reed and Matt Thompson for Adult Swim. The series revolved around the conflict between a supervillain named Killface and a superhero named Awesome X, alias billionaire Xander Crews, and much of the show's humor focuses on parodying superhero and action movie clichés. It debuted on October 16, 2006 and ended its first season on January 22, 2007; the second season premiered on August 26, 2007 and ended on March 23, 2008. A third season was in development, but in the absence of a renewal contract from Adult Swim, pre-production ceased. The production company itself, 70/30 Productions, subsequently went out of business in January 2009.\nA spin-off show, The Xtacles, premiered on November 9, 2008, but only two episodes were aired prior to the production company's closure.", "rate": 79, "genre": ["Animation", "Comedy"], "cast": ["Adam Reed", "Christian Danley", "Kate Miller", "Michael Bell", "Dave Willis"], "character": ["Killface / Xander Crews", "Simon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1542   Expand Frisky Dingo   (2006) User Score Overview Frisky Dingo is an American animated cartoon series created by Adam Reed and Matt Thompson for Adult Swim. The series revolved around the conflict between a supervillain named Killface and a superhero named Awesome X, alias billionaire Xander Crews, and much of the show's humor focuses on parodying superhero and action movie clichés. It debuted on October 16, 2006 and ended its first season on January 22, 2007; the second season premiered on August 26, 2007 and ended on March 23, 2008. A third season was in development, but in the absence of a renewal contract from Adult Swim, pre-production ceased. The production company itself, 70/30 Productions, subsequently went out of business in January 2009. A spin-off show, The Xtacles, premiered on November 9, 2008, but only two episodes were aired prior to the production company's closure. Featured Crew Matt Thompson Creator Adam Reed Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Reed Killface / Xander Crews Christian Danley Simon Kate Miller Michael Bell Dave Willis Full Cast & Crew Last Season Season 2 2007 | 12 Episodes Season 2 of Frisky Dingo premiered on August 26, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   2000-12-21 Sealab 2021 7.8    1994-04-15 Space Ghost Coast to Coast 8.3    2007-05-13 Superjail! 7.5    2005-06-19 12 oz. Mouse 6.4    1997-07-15 I Am Weasel 7.4    1995-09-09 Freakazoid! 7.3    2005-12-13 Moral Orel 7.5    2004-08-07 The Venture Bros. 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  11m, 15m Homepage   http://www.adultswim.com/shows/friskydingo/index.html Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 Travis Bell A 4 AnthonyAtkins232 3 TheOneManBoxOffice m 3 morrison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}