{"link": "https://www.themoviedb.org/tv/40351?language=en", "title": "Green Lantern: The Animated Series", "resume": "Green Lantern: The Animated Series is an American computer-animated television series based on the DC Comics superhero Green Lantern. The series is currently airing on Cartoon Network, as part of their \"DC Nation\" television block. A one hour sneak peek aired on November 11, 2011 it ran from November 11, 2011 to March 16, 2013, with a new episode airing every week. A special screening of the first episode was shown at New York Comic Con 2011 on October 15, 2011. This is the first Green Lantern television series and the first CGI DC/WB series. The series was cancelled after one season due to poor toy sales from the live-action movie, and because Cartoon Network wanted to emphasize new shows in its \"DC Nation\" block.", "rate": 72, "genre": ["Action", "Adventure", "Animation"], "cast": ["Josh Keaton", "Kevin Michael Richardson", "Jason Spisak", "Grey DeLisle", "Tom Kenny"], "character": ["Hal Jordan (voice)", "Kilowog (voice)", "Razer (voice)", "Aya (voice)", "Salaak (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40351   Expand Green Lantern: The Animated Series   (2011) User Score  Play Trailer Overview Green Lantern: The Animated Series is an American computer-animated television series based on the DC Comics superhero Green Lantern. The series is currently airing on Cartoon Network, as part of their \"DC Nation\" television block. A one hour sneak peek aired on November 11, 2011 it ran from November 11, 2011 to March 16, 2013, with a new episode airing every week. A special screening of the first episode was shown at New York Comic Con 2011 on October 15, 2011. This is the first Green Lantern television series and the first CGI DC/WB series. The series was cancelled after one season due to poor toy sales from the live-action movie, and because Cartoon Network wanted to emphasize new shows in its \"DC Nation\" block. Featured Crew Bruce Timm Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Keaton Hal Jordan (voice) Kevin Michael Richardson Kilowog (voice) Jason Spisak Razer (voice) Grey DeLisle Aya (voice) Tom Kenny Salaak (voice) Full Cast & Crew Last Season Season 1 2011 | 26 Episodes Season 1 of Green Lantern: The Animated Series premiered on November 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  10 Recommendations   2010-11-26 Young Justice 8.2    2013-01-17 King of the Nerds 2.9    2006-09-02 Fantastic Four: World's Greatest Heroes 5.9    1994-10-01 WildC.A.T.s 4.7    1997-09-20 The New Batman Adventures 7.7    2008-03-08 The Spectacular Spider-Man 7.4    2012-04-01 Marvel's Ultimate Spider-Man 6.6    2003-07-11 Spider-Man: The New Animated Series 6.5  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cartoonnetwork.com/tv_shows/green-lantern/index.html Genres Action & Adventure Animation Keywords dc comics Content Score 100 Yes! Looking good! Top Contributors R 20 Rebecca 8 Mikedeth5 5 seawolf 5 Dragonfly17  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}