{"link": "https://www.themoviedb.org/tv/34539?language=en", "title": "Daniel Deronda", "resume": "Daniel Deronda is a British television serial drama adapted by Andrew Davies from the George Eliot novel of the same name. The serial was directed by Tom Hooper, produced by Louis Marks, and was first broadcast in three parts on BBC One from 23 November to 7 December 2002. The serial starred Hugh Dancy as Daniel Deronda, Romola Garai as Gwendolen Harleth, Hugh Bonneville as Henleigh Grandcourt, and Jodhi May as Mirah Lapidoth. Co-production funding came from WGBH Boston.\nLouis Marks originally wanted to make a film adaptation of the novel but abandoned the project after a lengthy and fruitless casting process. The drama took a further five years to make it to television screens. Filming ran for 11 weeks from May to August on locations in England, Scotland and Malta. The serial was Marks' final television production before his death in 2010.", "rate": 72, "genre": ["Drama"], "cast": ["Anna Popplewell", "Romola Garai", "Hugh Dancy", "Jodhi May", "Hugh Bonneville"], "character": ["Fanny Davilow", "Daniel Deronda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34539   Expand Daniel Deronda   (2002) User Score Overview Daniel Deronda is a British television serial drama adapted by Andrew Davies from the George Eliot novel of the same name. The serial was directed by Tom Hooper, produced by Louis Marks, and was first broadcast in three parts on BBC One from 23 November to 7 December 2002. The serial starred Hugh Dancy as Daniel Deronda, Romola Garai as Gwendolen Harleth, Hugh Bonneville as Henleigh Grandcourt, and Jodhi May as Mirah Lapidoth. Co-production funding came from WGBH Boston. Louis Marks originally wanted to make a film adaptation of the novel but abandoned the project after a lengthy and fruitless casting process. The drama took a further five years to make it to television screens. Filming ran for 11 weeks from May to August on locations in England, Scotland and Malta. The serial was Marks' final television production before his death in 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Popplewell Fanny Davilow Romola Garai Hugh Dancy Daniel Deronda Jodhi May Hugh Bonneville Full Cast & Crew Last Season Season 1 2002 | 3 Episodes Season 1 of Daniel Deronda premiered on November 23, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2001-11-11 The Way We Live Now 7.9    1994-04-10 Middlemarch 8.0    2009-09-07 Land Girls 6.7    1999-11-28 Wives and Daughters 7.3    2008-01-13 Lark Rise to Candleford 7.3    2012-09-25 The Paradise 6.8    2013-12-26 Death Comes to Pemberley 6.8    2003-02-09 The Second Coming 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords london england victorian england miniseries 19th century Content Score 86 Almost there... Top Contributors 9 Banana 2 lineker S 2 Samara 1 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}