{"link": "https://www.themoviedb.org/tv/17561?language=en", "title": "FM", "resume": "FM is a British sitcom which aired on ITV2, starring Chris O'Dowd, Kevin Bishop and Nina Sosanya. The series followed the lives of two DJs and their producer on their FM radio programme, \"Skin 86.5 FM\". The show also featured music from real-life artists and guest stars from the music industry.\nThe first episode aired on 25 February 2009 and the series ran for 6 episodes. It broadcast on Wednesdays at 22:30. The series launched with 213,000 viewers. The whole series was re-run on Friday 3 April from 22:00 until 01:00. On 13 April 2009 the series was released on DVD with a BBFC rating of 15.\nITV Studios began searching for funding from record companies and radio stations to produce a second series for the show.", "rate": 65, "genre": ["Comedy"], "cast": ["Kevin Bishop", "Chris O'Dowd", "Nina Sosanya", "Daniel Kaluuya", "Ophelia Lovibond"], "character": ["Lindsay Carol", "Daisy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17561   Expand FM   (2009) User Score Overview FM is a British sitcom which aired on ITV2, starring Chris O'Dowd, Kevin Bishop and Nina Sosanya. The series followed the lives of two DJs and their producer on their FM radio programme, \"Skin 86.5 FM\". The show also featured music from real-life artists and guest stars from the music industry. The first episode aired on 25 February 2009 and the series ran for 6 episodes. It broadcast on Wednesdays at 22:30. The series launched with 213,000 viewers. The whole series was re-run on Friday 3 April from 22:00 until 01:00. On 13 April 2009 the series was released on DVD with a BBFC rating of 15. ITV Studios began searching for funding from record companies and radio stations to produce a second series for the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Bishop Chris O'Dowd Lindsay Carol Nina Sosanya Daniel Kaluuya Ophelia Lovibond Daisy Full Cast & Crew Last Season (uk) season 1 2009 | 6 Episodes Season 1 of FM premiered on February 25, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2015-06-30 Not Safe for Work 7.3    2011-08-04 Trollied 6.4    2015-11-13 W/ Bob & David 7.1    2015-01-11 Togetherness 6.0    2011-02-25 Friday Night Dinner 7.5    2013-07-09 Drunk History 7.2    2010-03-17 Ugly Americans 6.9    2011-09-21 Fresh Meat 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.itv.com/fm Genres Comedy Keywords music producer radio dj british humour Content Score 86 Almost there... Top Contributors O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}