{"link": "https://www.themoviedb.org/tv/1954?language=en", "title": "So Weird", "resume": "So Weird is an American television series that aired on the Disney Channel as a midseason replacement from January 18, 1999 to September 28, 2001. The series was shot in Vancouver, British Columbia. In season one and season two, the series centered on teenage girl Fiona Phillips who toured with her rock star mom, while encountering paranormal activity along the way. The series was compared to the Fox TV series The X-Files since it took a darker tone than other Disney Channel Originals. For the third and final season, Disney replaced Cara DeLizia with actress Alexz Johnson playing Annie Thelen. Production ceased after 65 episodes.", "rate": 73, "genre": ["Mystery", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Cara DeLizia", "Mackenzie Phillips", "Alexz Johnson", "Patrick Levis", "Eric Lively"], "character": ["Fiona \"Fi\" Phillips", "Molly Phillips", "Annie Thelen", "Jack Phillips", "Carey Bell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1954   Expand So Weird   (1999) User Score Overview So Weird is an American television series that aired on the Disney Channel as a midseason replacement from January 18, 1999 to September 28, 2001. The series was shot in Vancouver, British Columbia. In season one and season two, the series centered on teenage girl Fiona Phillips who toured with her rock star mom, while encountering paranormal activity along the way. The series was compared to the Fox TV series The X-Files since it took a darker tone than other Disney Channel Originals. For the third and final season, Disney replaced Cara DeLizia with actress Alexz Johnson playing Annie Thelen. Production ceased after 65 episodes. Featured Crew Tom J. Astle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cara DeLizia Fiona \"Fi\" Phillips Mackenzie Phillips Molly Phillips Alexz Johnson Annie Thelen Patrick Levis Jack Phillips Eric Lively Carey Bell Full Cast & Crew Last Season Season 3 2000 | 26 Episodes Season 3 of So Weird premiered on August 28, 2000. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply S The season 3 that could've been Open 4 by  Strannger18 S Season three original ideas that were scrapped Open 1 by  Strannger18 Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on So Weird. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m Homepage  - Genres Mystery Sci-Fi & Fantasy Drama Keywords paranormal phenomena teenager Content Score 93 Almost there... Top Contributors 17 MirrorMask 5 Banana 4 dgw 2 DaMaN  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}