{"link": "https://www.themoviedb.org/tv/68185?language=en", "title": "Occultic;Nine", "resume": "The \"paranormal science\" story follows nine idiosyncratic individuals, linked by the \"Choujou Kagaku Kirikiri Basara\" occult summary blog run by 17-year-old second-year high school student Yuuta Gamon. Little incongruities that occur around these nine eventually lead to a larger, unimaginable event that may alter what is considered common sense in this world.", "rate": 73, "genre": ["Animation", "Sci-Fi", "Fantasy", "Mystery"], "cast": ["Kishou Taniyama", "Ayane Sakura", "Miyuki Sawashiro", "Yuuki Kaji"], "character": ["Kiryuu Kusakabe (voice)", "Ryouka Narusawa (voice)", "Aria Kureinaino (voice)", "Yuuta Gamon (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68185   Expand Occultic;Nine   (2016) User Score  Play Trailer Overview The \"paranormal science\" story follows nine idiosyncratic individuals, linked by the \"Choujou Kagaku Kirikiri Basara\" occult summary blog run by 17-year-old second-year high school student Yuuta Gamon. Little incongruities that occur around these nine eventually lead to a larger, unimaginable event that may alter what is considered common sense in this world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kishou Taniyama Kiryuu Kusakabe (voice) Ayane Sakura Ryouka Narusawa (voice) Miyuki Sawashiro Aria Kureinaino (voice) Yuuki Kaji Yuuta Gamon (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Occultic;Nine premiered on October  8, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Occultic;Nine. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2016-10-07 Drifters 7.4    2016-04-07 Bungo Stray Dogs 7.3    2016-10-06 Yuri!!! on Ice 8.3  Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://occultic-nine.com/ Genres Animation Sci-Fi & Fantasy Mystery Keywords based on light novel anime Content Score 93 Almost there... Top Contributors 26 iliass guendouz 14 Deku2k 9 sp1ti 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}