{"link": "https://www.themoviedb.org/tv/71493?language=en", "title": "Yuki Yuna is a Hero", "resume": "Yuna Yuki is an ordinary second-year middle school student. She gets up in the morning, gets ready for school, goes to classes, participates in club activities, and has fun with her friends. But there is one extraordinary thing about Yuki -- she belongs to the “Brave Hero Club.” What does the Brave Hero Club do? Who is the mysterious being called “Vertex?” Yuki Yuna and her friends’ story takes place in Year 300, Era of the Gods.", "rate": 90, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71493   Expand Yuki Yuna is a Hero   (2014) User Score Overview Yuna Yuki is an ordinary second-year middle school student. She gets up in the morning, gets ready for school, goes to classes, participates in club activities, and has fun with her friends. But there is one extraordinary thing about Yuki -- she belongs to the “Brave Hero Club.” What does the Brave Hero Club do? Who is the mysterious being called “Vertex?” Yuki Yuna and her friends’ story takes place in Year 300, Era of the Gods. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Original Air Date Original Air Date Chronological Order (Absolute) Yuki Yuna is a Hero: The Washio Sumi & The Hero Chapter 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Yuki Yuna is a Hero. You can help by rating TV shows you've seen. Facts Original Name  結城友奈は勇者である Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://yuyuyu.tv Genres Animation Drama Sci-Fi & Fantasy Keywords magical girl Content Score 56 We're so close, yet so far. Top Contributors 33 MrTimscampi 17 sp1ti 15 Banana 10 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}