{"link": "https://www.themoviedb.org/tv/14759?language=en", "title": "Yo Gabba Gabba!", "resume": "Yo Gabba Gabba! is an American children's television show that airs on the Nick Jr. cable network in the United States and the Nick Jr. networks in the United Kingdom & Ireland, Italy, France and Australia as well as Treehouse TV network in Canada and RTE2 on RTÉjr in Ireland.   The show stars five costumed toys-come-to-life and their friend DJ Lance Rock, who explore a single topic in each episode through songs and short storylines in the half-hour program while teaching children life and social skills.  It also encourages viewers to move along with and dance with the characters in the program. The show is noted for its indie-culture guest stars and bands, and for drawing visual inspiration from 8-bit video games and H. R. Pufnstuff.\nCreated by Christian Jacobs and Scott Schultz, the show is produced by The Magic Store Productions and Wild Brain. The series premiered August 20, 2007 on Nickelodeon as part of its Nick Jr. block, and began broadcasting in reruns on February 23, 2008 on the Nick Jr. TV Channel.  On April 30, 2008 the television show received a Daytime Emmy nomination for Outstanding Achievement in Costume Design/Styling.", "rate": 57, "genre": ["Family", "Animation"], "cast": ["Biz Markie", "Lance Robertson", "Carmen Osbahr", "Cam Clarke", "Rob Paulsen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14759   Expand Yo Gabba Gabba!   (2007) User Score Overview Yo Gabba Gabba! is an American children's television show that airs on the Nick Jr. cable network in the United States and the Nick Jr. networks in the United Kingdom & Ireland, Italy, France and Australia as well as Treehouse TV network in Canada and RTE2 on RTÉjr in Ireland.   The show stars five costumed toys-come-to-life and their friend DJ Lance Rock, who explore a single topic in each episode through songs and short storylines in the half-hour program while teaching children life and social skills.  It also encourages viewers to move along with and dance with the characters in the program. The show is noted for its indie-culture guest stars and bands, and for drawing visual inspiration from 8-bit video games and H. R. Pufnstuff. Created by Christian Jacobs and Scott Schultz, the show is produced by The Magic Store Productions and Wild Brain. The series premiered August 20, 2007 on Nickelodeon as part of its Nick Jr. block, and began broadcasting in reruns on February 23, 2008 on the Nick Jr. TV Channel.  On April 30, 2008 the television show received a Daytime Emmy nomination for Outstanding Achievement in Costume Design/Styling. Featured Crew Christian Jacobs Creator Scott Schultz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Biz Markie Lance Robertson Carmen Osbahr Cam Clarke Rob Paulsen Full Cast & Crew Last Season Season 4 2011 | 14 Episodes Season 4 of Yo Gabba Gabba! premiered on December 18, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Yo Gabba Gabba!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m, 23m Homepage   http://www.yogabbagabba.com/ Genres Family Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 wallyg l 1 livinonchances  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}