{"link": "https://www.themoviedb.org/tv/12599?language=en", "title": "My-HiME", "resume": "My-HiME is an anime series, created by Sunrise. Directed by Masakazu Obara and written by Hiroyuki Yoshino, the series originally premiered in Japan on TV Tokyo from September 2004 to March 2005. The show is a comedy-drama focusing on the lives of HiMEs—girls with the capacity to materialize photons—gathered at Fuka Academy for a secret purpose.\nThe series was licensed for North American distribution by Bandai Entertainment and European distribution by Bandai's European subsidiary, Beez, with the first American DVD released at the end of March 2006. Bandai released the Complete Collection DVD set in America on October 7, 2008. It is also shown on Anime Selects On Demand but only for a limited time. At Otakon 2013, Funimation Entertainment had announced that they have rescued all of the My-Hime Project anime and will be re-released in 2014.", "rate": 53, "genre": ["Animation"], "cast": ["Ai Shimizu", "Mai Nakahara", "Saeko Chiba", "Akiko Kimura", "Akira Ishida"], "character": ["Mikoto Minagi", "Mai Tokiha", "Natsuki Kuga", "Sayuri Ichinose", "Nagi Homura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12599   Expand My-HiME   (2004) User Score Overview My-HiME is an anime series, created by Sunrise. Directed by Masakazu Obara and written by Hiroyuki Yoshino, the series originally premiered in Japan on TV Tokyo from September 2004 to March 2005. The show is a comedy-drama focusing on the lives of HiMEs—girls with the capacity to materialize photons—gathered at Fuka Academy for a secret purpose. The series was licensed for North American distribution by Bandai Entertainment and European distribution by Bandai's European subsidiary, Beez, with the first American DVD released at the end of March 2006. Bandai released the Complete Collection DVD set in America on October 7, 2008. It is also shown on Anime Selects On Demand but only for a limited time. At Otakon 2013, Funimation Entertainment had announced that they have rescued all of the My-Hime Project anime and will be re-released in 2014. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ai Shimizu Mikoto Minagi Mai Nakahara Mai Tokiha Saeko Chiba Natsuki Kuga Akiko Kimura Sayuri Ichinose Akira Ishida Nagi Homura Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of My-HiME premiered on September 30, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on My-HiME. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin f 1 forbius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}