{"link": "https://www.themoviedb.org/tv/2045?language=en", "title": "Birds of a Feather", "resume": "Birds of a Feather is a British sitcom that was broadcast on BBC One from 1989 until 1998 and on ITV from 2013. Starring Pauline Quirke, Linda Robson and Lesley Joseph, it was created by Laurence Marks and Maurice Gran, who also wrote some of the episodes along with many other writers.\nThe first episode sees sisters Tracey Stubbs and Sharon Theodopolopodos brought together when their husbands are sent to prison for armed robbery. Sharon, who lived in an Edmonton council flat, moves into Tracey's expensive house in Chigwell, Essex. Their next-door neighbour, and later friend, Dorien Green is a middle-aged married woman who is constantly having affairs with younger men. In the later series the location is changed to Hainault. The series ended on Christmas Eve 1998 after a 9-year-run.\nOn 3 March 2009, the The Mirror reported that the classic sitcom was set for a return reporting that Lesley Joseph, Pauline Quirke and Linda Robson have all been asked by the team behind the sitcom to make another series. Quirke was reported as saying that they were up for the challenge if the writers came up with good ideas. After this speculation of a return in early 2009 nothing more was said. However, in July 2012 Lesley Joseph hinted that Birds of a Feather could return for another series following a successful stage tour.", "rate": 72, "genre": ["Comedy"], "cast": ["Pauline Quirke", "Linda Robson", "Lesley Joseph"], "character": ["Sharon Theodopolopodos", "Tracey Stubbs", "Dorien Green"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2045   Expand Birds of a Feather   (1989) User Score Overview Birds of a Feather is a British sitcom that was broadcast on BBC One from 1989 until 1998 and on ITV from 2013. Starring Pauline Quirke, Linda Robson and Lesley Joseph, it was created by Laurence Marks and Maurice Gran, who also wrote some of the episodes along with many other writers. The first episode sees sisters Tracey Stubbs and Sharon Theodopolopodos brought together when their husbands are sent to prison for armed robbery. Sharon, who lived in an Edmonton council flat, moves into Tracey's expensive house in Chigwell, Essex. Their next-door neighbour, and later friend, Dorien Green is a middle-aged married woman who is constantly having affairs with younger men. In the later series the location is changed to Hainault. The series ended on Christmas Eve 1998 after a 9-year-run. On 3 March 2009, the The Mirror reported that the classic sitcom was set for a return reporting that Lesley Joseph, Pauline Quirke and Linda Robson have all been asked by the team behind the sitcom to make another series. Quirke was reported as saying that they were up for the challenge if the writers came up with good ideas. After this speculation of a return in early 2009 nothing more was said. However, in July 2012 Lesley Joseph hinted that Birds of a Feather could return for another series following a successful stage tour. Featured Crew Laurence Marks Creator Maurice Gran Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pauline Quirke Sharon Theodopolopodos Linda Robson Tracey Stubbs Lesley Joseph Dorien Green Full Cast & Crew Last Season Season 12 2016 | 8 Episodes Season 12 of Birds of a Feather premiered on January  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   2000-01-12 That Peter Kay Thing 6.4    1994-11-10 The Vicar of Dibley 7.3    1992-12-06 A Touch of Frost 7.9    1997-05-09 Jonathan Creek 7.7  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords prison neighbor husband council estate sitcom armed robbery british humour affair sisters Content Score 64 We're so close, yet so far. Top Contributors O 24 Ozbourne 12 kcdh R 10 Rebecca 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}