{"link": "https://www.themoviedb.org/tv/1023?language=en", "title": "Blackpool", "resume": "Ripley Holden is a small-time entrepreneur desperate to make it big with his new state-of-the-art amusement arcade. The opening extravaganza is overshadowed by the find of a dead body on the premises. DI Carlisle is called in and quickly finds he has more on his mind than murder, when he falls in love with Ripley's long-suffering wife.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["David Tennant", "Georgia Taylor", "David Morrissey", "Sarah Parish", "Joe Armstrong"], "character": ["DI Peter Carlisle", "Shyanne Holden", "Ripley Holden", "Natalie Holden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1023   Expand Blackpool   (2004) User Score Overview Ripley Holden is a small-time entrepreneur desperate to make it big with his new state-of-the-art amusement arcade. The opening extravaganza is overshadowed by the find of a dead body on the premises. DI Carlisle is called in and quickly finds he has more on his mind than murder, when he falls in love with Ripley's long-suffering wife. Featured Crew Peter Bowker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Tennant DI Peter Carlisle Georgia Taylor Shyanne Holden David Morrissey Ripley Holden Sarah Parish Natalie Holden Joe Armstrong Full Cast & Crew Last Season Season 1 2004 | 6 Episodes Season 1 of Blackpool premiered on November 10, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   2005-03-23 Casanova 7.3    2010-10-10 Single Father 7.4    1994-09-27 Takin' Over the Asylum 8.0    2013-04-25 The Politician's Husband 6.6    2013-10-29 The Escape Artist 7.0    2007-03-12 The Riches 7.6    2015-01-19 Catastrophe 7.3    2014-10-02 Gracepoint 6.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/drama/blackpool/ Genres Comedy Drama Keywords northern england music detective surreal song murder arcade woman director british humour Content Score 79 Pump it up! We're close now. Top Contributors 19 Banana O 9 Ozbourne L 7 Lomata 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}