{"link": "https://www.themoviedb.org/tv/4162?language=en", "title": "Jack of All Trades", "resume": "Jack of All Trades is a half-hour long syndicated action-comedy television series which ran for two seasons in 2000. With Cleopatra 2525, it formed the Back2Back Action Hour and both shows were notable for being the first American non-animated action series to be produced in the half-hour format since the 1970s. The show was canceled in the middle of its second season.\nThe program is set at the turn of the 19th century on the fictional French-controlled island of Pulau-Pulau in the East Indies. Jack Stiles is an American secret agent sent there by President Jefferson. While there, he meets his British contact and love interest, English spy Emilia Rothschild. Together, the two work to stop Napoleon and various other threats to the United States. To the public, Jack is seen as Emilia's attaché, but when the need arises, he transforms into a masked hero: The Daring Dragoon.\nThe show contained many on-going gags, such as deliberate historical inaccuracies, Jack being responsible for many important historical events but not receiving credit, Emilia inventing a miraculous invention in an obvious deus ex machina, sexual puns and innuendos, and Jack and Emilia's ongoing romantic tension.", "rate": 80, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Bruce Campbell", "Angela Marie Dotchin", "Stuart Devenie", "Stephen Papps"], "character": ["Daring Dragoon", "Mrs. Emilia Smythe Rothschild"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4162   Expand Jack of All Trades   (2000) User Score Overview Jack of All Trades is a half-hour long syndicated action-comedy television series which ran for two seasons in 2000. With Cleopatra 2525, it formed the Back2Back Action Hour and both shows were notable for being the first American non-animated action series to be produced in the half-hour format since the 1970s. The show was canceled in the middle of its second season. The program is set at the turn of the 19th century on the fictional French-controlled island of Pulau-Pulau in the East Indies. Jack Stiles is an American secret agent sent there by President Jefferson. While there, he meets his British contact and love interest, English spy Emilia Rothschild. Together, the two work to stop Napoleon and various other threats to the United States. To the public, Jack is seen as Emilia's attaché, but when the need arises, he transforms into a masked hero: The Daring Dragoon. The show contained many on-going gags, such as deliberate historical inaccuracies, Jack being responsible for many important historical events but not receiving credit, Emilia inventing a miraculous invention in an obvious deus ex machina, sexual puns and innuendos, and Jack and Emilia's ongoing romantic tension. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce Campbell Daring Dragoon Angela Marie Dotchin Mrs. Emilia Smythe Rothschild Stuart Devenie Stephen Papps Full Cast & Crew Last Season Season 2 2000 | 8 Episodes Season 2 of Jack of All Trades premiered on October  7, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1993-08-27 The Adventures of Brisco County, Jr. 7.6    1999-06-15 The Man Show 5.9    2000-01-17 Cleopatra 2525 5.7    1998-09-09 First Wave 6.6    1983-03-08 The Fall Guy 6.4    1992-09-22 Beavis and Butt-head 6.9    1959-10-02 The Twilight Zone 8.2    2001-06-03 Six Feet Under 8.2  Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Action & Adventure Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 3 speedycars w 3 webmaster R 3 Rebecca 1 Rocketeer Raccoon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}