{"link": "https://www.themoviedb.org/tv/34173?language=en", "title": "Aoki Densetsu Shoot!", "resume": "Toshihiko Tanaka is a boy who entered Kakegawa High School with  his friends Kenji & Kazuhiro, in order to play soccer with Yoshiharu  Kubo, a great soccer player whom they have idolized. While his other  two friends were reluctant to play again, \"Toshi\" eventually convinces  them to play for the team. The team soon find themselves in the midst of  a quest to the All-Japan High School Championship, while overcoming  obstacles along the way.", "rate": 55, "genre": ["Animation"], "cast": ["Nobutoshi Canna", "Toshiyuki Morikawa", "Noriko Hidaka", "Masami Kikuchi", "Hikaru Midorikawa"], "character": ["Kenji Shiraishi", "Atsushi Kamiya", "Kazumi Endo", "Kazuhiro Hiramatsu", "Toshihiko Tanaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34173   Expand Aoki Densetsu Shoot!   (1993) User Score Overview Toshihiko Tanaka is a boy who entered Kakegawa High School with  his friends Kenji & Kazuhiro, in order to play soccer with Yoshiharu  Kubo, a great soccer player whom they have idolized. While his other  two friends were reluctant to play again, \"Toshi\" eventually convinces  them to play for the team. The team soon find themselves in the midst of  a quest to the All-Japan High School Championship, while overcoming  obstacles along the way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nobutoshi Canna Kenji Shiraishi Toshiyuki Morikawa Atsushi Kamiya Noriko Hidaka Kazumi Endo Masami Kikuchi Kazuhiro Hiramatsu Hikaru Midorikawa Toshihiko Tanaka Full Cast & Crew Last Season Season 1 1993 | 26 Episodes Season 1 of Aoki Densetsu Shoot! premiered on November  7, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Aoki Densetsu Shoot!. You can help by rating TV shows you've seen. Facts Original Name  蒼き伝説　シュート！ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.toei-anim.co.jp/lineup/tv/shoot/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 5 tmdb983464 z 4 zurman1 B 4 Bonsai B 3 Belialguinyo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}