{"link": "https://www.themoviedb.org/tv/65329?language=en", "title": "Hyouka", "resume": "Oreki Houtarou is a minimalistic high school boy. One day, he joins the Classic Literature Club at his elder sister's request. There he meets Chitanda Eru, Fukube Satoshi, and Ibara Mayaka. Chitanda is a calm beautiful girl but she turns into an embodiment of curiosity once she says, \"I'm curious.\" Fukube is a smiling boy with a fantastic memory who calls himself a database. Ibara is a short girl and is strict with others and herself. They begin to investigate a case that occurred 45 years ago. Hints of the mystery are buried in an old collection of works of the former members of Classics Club. The collection is titled \"Hyouka.\"", "rate": 78, "genre": ["Animation", "Drama", "Mystery"], "cast": ["Yuichi Nakamura", "Satomi Satou", "Daisuke Sakaguchi", "Kayano Ai", "Mami Koyama"], "character": ["Hōtarō Oreki (voice)", "Chitanda Eru (voice)", "Satoshi Fukube (voice)", "Mayaka Ibara (voice)", "Youko Itoigawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65329   Expand Hyouka   (2012) User Score Overview Oreki Houtarou is a minimalistic high school boy. One day, he joins the Classic Literature Club at his elder sister's request. There he meets Chitanda Eru, Fukube Satoshi, and Ibara Mayaka. Chitanda is a calm beautiful girl but she turns into an embodiment of curiosity once she says, \"I'm curious.\" Fukube is a smiling boy with a fantastic memory who calls himself a database. Ibara is a short girl and is strict with others and herself. They begin to investigate a case that occurred 45 years ago. Hints of the mystery are buried in an old collection of works of the former members of Classics Club. The collection is titled \"Hyouka.\" Featured Crew Yasuhiro Takemoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuichi Nakamura Hōtarō Oreki (voice) Satomi Satou Chitanda Eru (voice) Daisuke Sakaguchi Satoshi Fukube (voice) Kayano Ai Mayaka Ibara (voice) Mami Koyama Youko Itoigawa Full Cast & Crew Last Season Season 1 2012 | 23 Episodes Season 1 of Hyouka premiered on April 22, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2013-10-07 Non Non Biyori 8.0    2014-07-06 Monthly Girls' Nozaki-kun 7.7    2012-10-09 Sakurasou no Pet na Kanojo 6.5    2009-07-03 Monogatari 7.7    2008-10-02 Toradora! 7.5    2010-10-03 Oreimo 7.1    2016-04-10 Flying Witch 6.5    2015-07-12 God Eater 6.4  Facts Original Name  氷菓 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  26m Homepage   http://www.kyotoanimation.co.jp/kotenbu/ Genres Animation Drama Mystery Keywords detective amateur detective mystery slice of life school Content Score 93 Almost there... Top Contributors 29 Axeshizzle 21 Indi G 11 Giaten 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}