{"link": "https://www.themoviedb.org/tv/67761?language=en", "title": "Legends of Chamberlain Heights", "resume": "An urban animated series mixing raucous comedy and social commentary that centers on three high school freshman basketball benchwarmers: Jamal, Grover, and Milk. The three friends tackle life with some wins and some losses, but failure doesn’t faze them since they're legends...even if it’s just in their own minds.", "rate": 0, "genre": ["Comedy", "Animation"], "cast": ["Josiah Johnson", "Tiffany Haddish", "Quinn Hawking", "Michael Starrbury", "Jay Pharoah"], "character": ["Grover", "Cindy", "Jamal", "Malik", "Montrel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67761   Expand Legends of Chamberlain Heights   (2016) User Score  Play Trailer Overview An urban animated series mixing raucous comedy and social commentary that centers on three high school freshman basketball benchwarmers: Jamal, Grover, and Milk. The three friends tackle life with some wins and some losses, but failure doesn’t faze them since they're legends...even if it’s just in their own minds. Featured Crew Brad Ableson Creator Mike Clements Creator Quinn Hawking Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josiah Johnson Grover Tiffany Haddish Cindy Quinn Hawking Jamal Michael Starrbury Malik Jay Pharoah Montrel Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Legends of Chamberlain Heights premiered on June 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Legends of Chamberlain Heights. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/legends-of-chamberlain-heights Genres Comedy Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings JK 12 James Kimani c 6 cfowler m 4 misfit_noel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}