{"link": "https://www.themoviedb.org/tv/32357?language=en", "title": "Asfur", "resume": "Asfur is an Israeli television series, which is broadcast on the channel HOT3. Its title, which literally means \"bird\" in Arabic, is the main protagonist's \"good luck bird\" – his late grandfather believed that its arrival symbolized a positive turn of events.\nHot had already started working on two additional seasons even before the television pilot was aired. Season two began airing on October 17, 2011. Savyon and Amir sold the format to John Wells in October 2011. The adaptation, named \"Hard Up\", will air on FOX.", "rate": 40, "genre": ["Drama", "Comedy"], "cast": ["Shalom Michaelshwilli", "Efrat Dor", "Oz Zehavi", "Guy Amir", "Hanan Savyon"], "character": ["Moti", "Shir Ambar", "Itzik", "Katzar", "Newton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32357   Expand Asfur   (2010) User Score Overview Asfur is an Israeli television series, which is broadcast on the channel HOT3. Its title, which literally means \"bird\" in Arabic, is the main protagonist's \"good luck bird\" – his late grandfather believed that its arrival symbolized a positive turn of events. Hot had already started working on two additional seasons even before the television pilot was aired. Season two began airing on October 17, 2011. Savyon and Amir sold the format to John Wells in October 2011. The adaptation, named \"Hard Up\", will air on FOX. Featured Crew Hanan Savyon Creator Guy Amir Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shalom Michaelshwilli Moti Efrat Dor Shir Ambar Oz Zehavi Itzik Guy Amir Katzar Hanan Savyon Newton Full Cast & Crew Last Season Season 2 2011 | 20 Episodes Season 2 of Asfur premiered on October 24, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Asfur. You can help by rating TV shows you've seen. Facts Original Name  עספור Status  Ended Network Certification  - Type  Scripted Original Language  Hebrew Runtime  30m Homepage   http://hot.ynet.co.il/home/0,7340,L-9603,00.html Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors a 4 adambakir92 4 Banana m 3 mlevi TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}