{"link": "https://www.themoviedb.org/tv/43167?language=en", "title": "Accel World", "resume": "A short, overweight student uses the Neuro Link, an evolution of the Nerve Gear, to escape himself from the reality. But his skills in the virtual world brings him to the attention of Kuroyukihime, a popular student who introduces him to the Brain Burst.", "rate": 73, "genre": ["Action", "Adventure", "Animation"], "cast": ["Yuuki Kaji"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43167   Expand Accel World   (2012) User Score Overview A short, overweight student uses the Neuro Link, an evolution of the Nerve Gear, to escape himself from the reality. But his skills in the virtual world brings him to the attention of Kuroyukihime, a popular student who introduces him to the Brain Burst. Featured Crew Reki Kawahara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuki Kaji Full Cast & Crew Last Season Season 1 2012 | 26 Episodes Season 1 of Accel World premiered on April  6, 2012. View All Seasons Social Reviews  1 Discussions  0 A review by NungMovies-HD Written by  NungMovies-HD  on April 19, 2017 สนุกมากเรื่องนี้ เป็นเรื่องแรกที่ดูอนิเมะเลย Read All Reviews Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations   2012-07-05 Good Luck Girl! 8.0    2014-01-12 Wizard Barristers 7.3    2014-10-06 When Supernatural Battles Became Commonplace 8.3    2011-10-07 Haganai: I Don't Have Many Friends 7.7    2014-10-06 Amagi Brilliant Park 7.8    2011-04-15 [C] The Money of Soul and Possibility Control 6.3    2002-03-01 Digimon Tamers 5.9    2016-07-02 First Love Monster 5.7  Facts Original Name  アクセルワールド Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.accel-world.net/ Genres Action & Adventure Animation Keywords future virtual reality games virtual fight bullying anime Content Score 64 We're so close, yet so far. Top Contributors 18 minusha97 14 CrewMdk Z 7 Zayrus 6 Guilherme.Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}