{"link": "https://www.themoviedb.org/tv/35962?language=en", "title": "Aftershock: Earthquake in New York", "resume": "Aftershock: Earthquake in New York is a 1999 four-hour disaster miniseries that was broadcast in the United States on CBS in two parts, with the first part aired on November 14 and the second on November 16. It was released to VHS in 2000, and on DVD in 2001. It is based on a book written by Chuck Scarborough. Starring Charles S. Dutton, Sharon Lawrence, Tom Skerritt, Lisa Nicole Carson, Jennifer Garner, Rachel Ticotin and Frederick Weller. under the direction of Mikael Salomon, the miniseries follows five groups of people in the aftermath of a large earthquake hitting New York City.\nIt was nominated for an Emmy Award for its special effects. While critics praised the special effects and cast, they heavily panned the film for its implausible scenario, predictability, and lack of realism.", "rate": 59, "genre": ["Action", "Adventure", "Drama"], "cast": ["Tom Skerritt", "Frederick Weller", "Sharon Lawrence", "Erika Eleniak", "Charles S. Dutton"], "character": ["Thomas Ahearn", "Nicholai Karvovsky", "Dori Thorell", "Jillian Parnell", "Mayor Bruce Lincoln"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35962   Expand Aftershock: Earthquake in New York   (1999) User Score  Play Trailer Overview Aftershock: Earthquake in New York is a 1999 four-hour disaster miniseries that was broadcast in the United States on CBS in two parts, with the first part aired on November 14 and the second on November 16. It was released to VHS in 2000, and on DVD in 2001. It is based on a book written by Chuck Scarborough. Starring Charles S. Dutton, Sharon Lawrence, Tom Skerritt, Lisa Nicole Carson, Jennifer Garner, Rachel Ticotin and Frederick Weller. under the direction of Mikael Salomon, the miniseries follows five groups of people in the aftermath of a large earthquake hitting New York City. It was nominated for an Emmy Award for its special effects. While critics praised the special effects and cast, they heavily panned the film for its implausible scenario, predictability, and lack of realism. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Skerritt Thomas Ahearn Frederick Weller Nicholai Karvovsky Sharon Lawrence Dori Thorell Erika Eleniak Jillian Parnell Charles S. Dutton Mayor Bruce Lincoln Full Cast & Crew Last Season Miniseries 1999 | 2 Episodes Season 1 of Aftershock: Earthquake in New York premiered on November 14, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  6 Recommendations   2009-07-26 The Storm 4.0    1998-05-18 Creature 4.2    2004-05-02 10.5 6.0    1999-10-01 BeastMaster 5.9    1981-09-10 The Day of the Triffids 6.7    1997-05-11 20,000 Leagues Under the Sea 4.6    2007-01-10 Killer Wave 5.7    2005-11-23 Life in the Undergrowth 8.4  Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Action & Adventure Drama Keywords new york earthquake tragedy urban disaster Content Score 93 Almost there... Top Contributors TB 56 TMDb Bot 16 thwaller 10 Steve x 5 xmodder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}