{"link": "https://www.themoviedb.org/tv/2059?language=en", "title": "Rosemary & Thyme", "resume": "Rosemary & Thyme is a British television mystery series starring Felicity Kendal and Pam Ferris as gardening detectives Rosemary Boxer and Laura Thyme. The show began on ITV in 2003. The third series ended in August 2007. The theme is murder mysteries in the setting of professional gardening jobs. It was created by Brian Eastman to entertain his wife, Christabel Albery, who is an avid gardener. The show was directed by Brian Farnham, Simon Langton, and Tom Clegg. Clive Exton, who helped create the show, contributed 10 of the 22 scripts.", "rate": 66, "genre": ["Drama"], "cast": ["Pam Ferris", "Felicity Kendal"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2059   Expand Rosemary & Thyme   (2003) User Score Overview Rosemary & Thyme is a British television mystery series starring Felicity Kendal and Pam Ferris as gardening detectives Rosemary Boxer and Laura Thyme. The show began on ITV in 2003. The third series ended in August 2007. The theme is murder mysteries in the setting of professional gardening jobs. It was created by Brian Eastman to entertain his wife, Christabel Albery, who is an avid gardener. The show was directed by Brian Farnham, Simon Langton, and Tom Clegg. Clive Exton, who helped create the show, contributed 10 of the 22 scripts. Featured Crew Tom Clegg Creator Clive Exton Creator Brian Eastman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pam Ferris Felicity Kendal Full Cast & Crew Last Season Rosemary and thyme season 3 2005 | 10 Episodes Season 3 of Rosemary & Thyme premiered on December 23, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1997-04-29 Touching Evil 7.7    1983-09-06 Taggart 7.7    2011-05-29 Scott & Bailey 7.5    2007-02-18 Inspector Lewis 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 8 MAthePA w 3 webmaster S 3 SergeiAK T 1 Ticktock  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}