{"link": "https://www.themoviedb.org/tv/60918?language=en", "title": "My Haunted House", "resume": "The shocking eyewitness accounts of terrified people whose dream homes have become nightmares are brought to life in vivid, blood-curdling style on \"My Haunted House\".  Told via gripping first person interviews and strikingly crafted re-enactments, each episode of this nerve-wracking new series tells two, compelling horror stories of people literally living in terror.", "rate": 56, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60918   Expand My Haunted House   (2013) User Score Overview The shocking eyewitness accounts of terrified people whose dream homes have become nightmares are brought to life in vivid, blood-curdling style on \"My Haunted House\".  Told via gripping first person interviews and strikingly crafted re-enactments, each episode of this nerve-wracking new series tells two, compelling horror stories of people literally living in terror. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2016 | 4 Episodes Season 5 of My Haunted House premiered on March 28, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2012-07-03 Haunted Highway 5.4  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  - Homepage   http://www.mylifetime.com/movies/my-haunted-house Genres No genres have been added. Keywords paranormal show Content Score 50 Still needs a little work. Top Contributors 20 Elizabeth Jennings TB 13 TMDb Bot 4 area 301 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}