{"link": "https://www.themoviedb.org/tv/60930?language=en", "title": "The Magnificent Century: Kösem", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 40, "genre": ["Drama"], "cast": ["Nurgül Yeşilçay", "Farah Zeynep Abdullah", "Metin Akdulger", "Tugay Mercan", "Hande Doğandemir"], "character": ["Kösem Sultan", "Prenses Farya Bethlen/Farya Sultan", "IV. Murad", "I. İbrahim", "Turhan Hatice Sultan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60930   Expand The Magnificent Century: Kösem   (2015) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Timur Savcı Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nurgül Yeşilçay Kösem Sultan Farah Zeynep Abdullah Prenses Farya Bethlen/Farya Sultan Metin Akdulger IV. Murad Tugay Mercan I. İbrahim Hande Doğandemir Turhan Hatice Sultan Full Cast & Crew Last Season Season 2 2016 | 30 Episodes Season 2 of The Magnificent Century: Kösem premiered on November 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2010-07-25 Sherlock 8.3  Facts Original Name  Muhteşem Yüzyıl: Kösem Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Turkish Runtime  130m Homepage  - Genres Drama Keywords royal family historical drama ottoman empire Content Score 86 Almost there... Top Contributors 85 purplelammashta b 44 bluwy RK 13 Ramazan KAYHÜYÜK 7 Farkas Tibor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}