{"link": "https://www.themoviedb.org/tv/62428?language=en", "title": "Saint Seiya: Soul of Gold", "resume": "Transcending eternity, the 12 Gold Saints return to protect love and peace on Earth! They gave their lives to destroy the Wailing Wall to break the way for Seiya and the Saints in their battle against Hades in the Underworld! Though presumed to have perished, Aiolia and the other Gold Saints return to the beautiful earthly world of radiating luminescence! Why have these lost souls been brought back to life? Shrouded in this deep mystery, Aiolia becomes embroiled in a duel. When he burns his Cosmo to its limit…the Cloth of Leo transforms! In 2015, the Golden Cosmo is finally revived!", "rate": 83, "genre": ["Animation"], "cast": ["Hideyuki Tanaka", "Yuusaku Yara", "Takumi Yamazaki", "Toshihiko Seki", "Tesshou Genda"], "character": ["Aiolia de Leão", "Aiolos de Sagitário", "Mu de Áries", "Milo de Escorpião", "Aldebaran de Touro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62428   Expand Saint Seiya: Soul of Gold   (2015) User Score Overview Transcending eternity, the 12 Gold Saints return to protect love and peace on Earth! They gave their lives to destroy the Wailing Wall to break the way for Seiya and the Saints in their battle against Hades in the Underworld! Though presumed to have perished, Aiolia and the other Gold Saints return to the beautiful earthly world of radiating luminescence! Why have these lost souls been brought back to life? Shrouded in this deep mystery, Aiolia becomes embroiled in a duel. When he burns his Cosmo to its limit…the Cloth of Leo transforms! In 2015, the Golden Cosmo is finally revived! Featured Crew Takeshi Furuta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hideyuki Tanaka Aiolia de Leão Yuusaku Yara Aiolos de Sagitário Takumi Yamazaki Mu de Áries Toshihiko Seki Milo de Escorpião Tesshou Genda Aldebaran de Touro Full Cast & Crew Last Season Season 1 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Saint Seiya: Soul of Gold. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Saint Seiya: Soul of Gold. You can help by rating TV shows you've seen. Facts Original Name  聖闘士星矢 黄金魂 Status  Ended Network Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://saintseiya-gold.com/en/ Genres Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors P 17 PC C 13 Cédric wg 12 willian guillermo andrade charcape S 11 Silva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}