{"link": "https://www.themoviedb.org/tv/74395?language=en", "title": "Ink Master: Angels", "resume": "Ink Master competitors travel the country and go head to head with some of America’s most talented tattoo artists. Contestants face a variety of tattoo-based challenges to see who has what it takes to beat the Angels and earn a spot on Ink Master.", "rate": 20, "genre": ["Reality"], "cast": ["Kelly Doty", "Nikki Simpson", "Ryan Ashley Malarkey"], "character": ["Herself - Angel", "Herself - Angel", "Herself - Angel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74395   Expand Ink Master: Angels   (2017) User Score  Play Trailer Overview Ink Master competitors travel the country and go head to head with some of America’s most talented tattoo artists. Contestants face a variety of tattoo-based challenges to see who has what it takes to beat the Angels and earn a spot on Ink Master. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelly Doty Herself - Angel Nikki Simpson Herself - Angel Ryan Ashley Malarkey Herself - Angel Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of Ink Master: Angels premiered on March 27, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ink Master: Angels. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  40m Homepage   http://www.paramountnetwork.com/shows/ink-master-angels Genres Reality Keywords tattoo female tattoo artist Content Score 64 We're so close, yet so far. Top Contributors 24 Elizabeth Jennings 4 21 4thisOnly1 b 8 basher d 6 d00M_L0rDz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}