{"link": "https://www.themoviedb.org/tv/17149?language=en", "title": "Vampire Knight", "resume": "Cross Academy is an elite boarding school with two separate, isolated classes: the Day Class and the Night Class. On the surface, Yuuki Cross and Zero Kiryuu are prefects of the academy, and attempt to keep order between the students as classes rotate in the evenings. As the Night Class is full of utterly gorgeous elites, this can sometimes prove to be a bit difficult. It is completely necessary, however, as those \"elites\" are actually vampires. Yuuki and Zero act as guardians, protecting the secrets of the Night Class and the safety of their ignorant morning counterparts.\nAs the adopted daughter of the academy's chairman, Yuuki takes her job with a serious and energetic attitude. It also allows her to interact with her secret crush and savior, the president of the Night students' dorm, Kaname Kuran. Zero, on the other hand, has a deep-rooted hatred against vampires, and at times, does not hesitate to kill.\nCan vampires and humans co-exist, even in the strict setup of the Cross Academy? Only time will tell.\nVampire Knight is a shōjo manga series written by Matsuri Hino. The series premiered in the January 2005 issue of LaLa magazine and has officially ended. Chapters are collected and published in collected volumes by Hakusensha, with seventeen volumes currently released in Japan. The manga series is licensed in English by Viz Media, who has released fifteen volumes so far. The English adaptation premiered in the July 2006 issue of Viz's Shojo Beat magazine, with the collected volumes being published on a quarterly basis.\nTwo drama CDs were created for the series, as well as a twenty-six episode anime adaptation. Produced by Studio Deen, the anime series' first season aired in Japan on TV Tokyo between April 8, 2008 and July 1, 2008. The second season, aired on the same station from October 7, 2008 and December 30, 2008. The anime uses many of the same voice actors as were used for the drama CDs. The anime adaptations were licensed for release in North America by Viz Media, the DVD released on July 20, 2010.", "rate": 76, "genre": ["Animation", "Drama", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Daisuke Kishio", "Yui Horie", "Mamoru Miyano", "Junichi Suwabe", "Junko Minagawa"], "character": ["Kaname Kuran", "Yuki Cross", "Zero Kiryu", "Akatsuki Kain", "Ruka Souen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17149   Expand Vampire Knight   (2008) User Score Overview Cross Academy is an elite boarding school with two separate, isolated classes: the Day Class and the Night Class. On the surface, Yuuki Cross and Zero Kiryuu are prefects of the academy, and attempt to keep order between the students as classes rotate in the evenings. As the Night Class is full of utterly gorgeous elites, this can sometimes prove to be a bit difficult. It is completely necessary, however, as those \"elites\" are actually vampires. Yuuki and Zero act as guardians, protecting the secrets of the Night Class and the safety of their ignorant morning counterparts. As the adopted daughter of the academy's chairman, Yuuki takes her job with a serious and energetic attitude. It also allows her to interact with her secret crush and savior, the president of the Night students' dorm, Kaname Kuran. Zero, on the other hand, has a deep-rooted hatred against vampires, and at times, does not hesitate to kill. Can vampires and humans co-exist, even in the strict setup of the Cross Academy? Only time will tell. Vampire Knight is a shōjo manga series written by Matsuri Hino. The series premiered in the January 2005 issue of LaLa magazine and has officially ended. Chapters are collected and published in collected volumes by Hakusensha, with seventeen volumes currently released in Japan. The manga series is licensed in English by Viz Media, who has released fifteen volumes so far. The English adaptation premiered in the July 2006 issue of Viz's Shojo Beat magazine, with the collected volumes being published on a quarterly basis. Two drama CDs were created for the series, as well as a twenty-six episode anime adaptation. Produced by Studio Deen, the anime series' first season aired in Japan on TV Tokyo between April 8, 2008 and July 1, 2008. The second season, aired on the same station from October 7, 2008 and December 30, 2008. The anime uses many of the same voice actors as were used for the drama CDs. The anime adaptations were licensed for release in North America by Viz Media, the DVD released on July 20, 2010. Featured Crew Matsuri Hino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Kishio Kaname Kuran Yui Horie Yuki Cross Mamoru Miyano Zero Kiryu Junichi Suwabe Akatsuki Kain Junko Minagawa Ruka Souen Full Cast & Crew Last Season Season 2 2008 | 13 Episodes Season 2 of Vampire Knight premiered on October  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations   1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6    2013-03-29 Mischievous Kiss: Love in Tokyo 7.0  Facts Original Name  ヴァンパイア騎士 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Drama Action & Adventure Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 8 Banana z 5 zurman1 5 jmf2k v 5 velluto93  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}