{"link": "https://www.themoviedb.org/tv/37092?language=en", "title": "Coma", "resume": "A young medical student discovers that something sinister is going on in her hospital after routine procedures send more than a few seemingly healthy patients into comas on the operating table.", "rate": 61, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Lauren Ambrose", "Steven Pasquale", "Geena Davis", "Ellen Burstyn", "James Woods"], "character": ["Susan Wheeler", "Mark Bellows", "Dr. Agnetta Lindquist", "Mrs. Emerson", "Dr. Howard Stark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37092   Expand Coma   (2012) User Score  Play Trailer Overview A young medical student discovers that something sinister is going on in her hospital after routine procedures send more than a few seemingly healthy patients into comas on the operating table. Featured Crew Robin Cook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lauren Ambrose Susan Wheeler Steven Pasquale Mark Bellows Geena Davis Dr. Agnetta Lindquist Ellen Burstyn Mrs. Emerson James Woods Dr. Howard Stark Full Cast & Crew Last Season Season 1 2012 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  10 Recommendations   1984-03-07 Fresh Fields 7.0    1972-09-08 Are You Being Served? 7.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  120m Homepage   http://aetvaws.aetv.com/coma/ Genres Drama Mystery Sci-Fi & Fantasy Keywords miniseries medical student Content Score 100 Yes! Looking good! Top Contributors t 67 tmdb54895295 TB 24 TMDb Bot CM 13 Cherche Moi P 7 PC  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}