{"link": "https://www.themoviedb.org/tv/78941?language=en", "title": "Aggretsuko", "resume": "Frustrated with her thankless office job, Retsuko the Red Panda copes with her daily struggles by belting out death metal karaoke after work.", "rate": 77, "genre": ["Animation", "Comedy"], "cast": ["Kaolip", "Komegumi Koiwasaki", "Maki Tsuruta"], "character": ["Retsuko (voice)", "Washimi (voice)", "Director Gori (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78941   Expand Aggretsuko   (2018) User Score  Play Trailer Overview Frustrated with her thankless office job, Retsuko the Red Panda copes with her daily struggles by belting out death metal karaoke after work. Featured Crew RAREKO Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaolip Retsuko (voice) Komegumi Koiwasaki Washimi (voice) Maki Tsuruta Director Gori (voice) Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Aggretsuko premiered on April 20, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    1998-04-03 Cowboy Bebop 8.2  Facts Original Name  アグレッシブ烈子 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  15m Homepage   https://www.netflix.com/title/80198505 Genres Animation Comedy Keywords anime working life Content Score 71 Just a little bit more... Top Contributors 59 Marr 🇳🇱 5 sp1ti 4 TimeWalker a 2 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}