{"link": "https://www.themoviedb.org/tv/63576?language=en", "title": "Fate/kaleid liner Prisma Illya", "resume": "Illyasviel von Einzbern is an ordinary elementary school student who becomes a magical girl when the magical Kaleidostick Ruby deems her a more suitable master than the sorceress, Rin Tohsaka. Rin, who had been tasked by the wizard Zelretch to collect the seven Class Cards containing the spirits of Heroic Spirits from legend, finds that she is unable to change Ruby's mind and must supervise Illya in completing the task of collecting the Class Cards. During Illya's adventures, she receives a friend and rival in a girl named Miyu, the contracted master of the Kaleidostick Sapphire, which similarly abandoned its original master and Rin's rival, Luvia Edelfelt.", "rate": 75, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Naoko Takano", "Noriaki Sugiyama", "Kaori Nazuka", "Kana Ueda", "Mai Kadowaki"], "character": ["Magical Ruby (voice)", "Shirō Emiya (voice)", "Miyu Edelfelt (voice)", "Rin Tōsaka (voice)", "Illyasviel von Einzbern (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63576   Expand Fate/kaleid liner Prisma Illya   (2013) User Score Overview Illyasviel von Einzbern is an ordinary elementary school student who becomes a magical girl when the magical Kaleidostick Ruby deems her a more suitable master than the sorceress, Rin Tohsaka. Rin, who had been tasked by the wizard Zelretch to collect the seven Class Cards containing the spirits of Heroic Spirits from legend, finds that she is unable to change Ruby's mind and must supervise Illya in completing the task of collecting the Class Cards. During Illya's adventures, she receives a friend and rival in a girl named Miyu, the contracted master of the Kaleidostick Sapphire, which similarly abandoned its original master and Rin's rival, Luvia Edelfelt. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Naoko Takano Magical Ruby (voice) Noriaki Sugiyama Shirō Emiya (voice) Kaori Nazuka Miyu Edelfelt (voice) Kana Ueda Rin Tōsaka (voice) Mai Kadowaki Illyasviel von Einzbern (voice) Full Cast & Crew Last Season Original Air Date Original Air Date Comprehensive Order (Absolute) Fate/kaleid liner Prisma Illya 3rei! 2016 | 12 Episodes Season 4 of Fate/kaleid liner Prisma Illya premiered on July  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Fate/kaleid liner Prisma Illya. You can help by rating TV shows you've seen. Facts Original Name  Fate/kaleid liner プリズマ☆イリヤ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://anime.prisma-illya.jp/ Genres Animation Comedy Drama Keywords supernatural based on manga magical girl anime Content Score 86 Almost there... Top Contributors 119 miryoku 68 Banana 34 RubeensVinicius 14 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}