{"link": "https://www.themoviedb.org/tv/73567?language=en", "title": "Beloved Enemy", "resume": "Right on elite businessman Gu Qing Pei’s first day of work at his new workplace, the chairman throws his vigorous and arrogant son Yuan Yang at him. Yuan Yang sees through Qing Pei’s hypocrite mask, but due to his father pressuring him, he can’t hit him. Therefore, Yuan Yang learns for the first time that there are things that can’t be taken care of by money or fists. He continuously tries to get Qing Pei into trouble, but Qing Pei sees it lightly and calmy resolves every issue. However, things are about to change when Yuan Yang asks his friends to do a background check on Qing Pei and finally finds his achilles heel.", "rate": 0, "genre": ["Drama", "Action", "Adventure"], "cast": ["Shang Bai", "Gao Ming", "Zhao Lei", "Liao Wang", "Sun Qi Heng"], "character": ["Gu Qing Pei", "Yuan Yang", "Zhao Yuan", "Peng Fang", "Wang Jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73567   Expand Beloved Enemy   (2017) User Score  Play Trailer Overview Right on elite businessman Gu Qing Pei’s first day of work at his new workplace, the chairman throws his vigorous and arrogant son Yuan Yang at him. Yuan Yang sees through Qing Pei’s hypocrite mask, but due to his father pressuring him, he can’t hit him. Therefore, Yuan Yang learns for the first time that there are things that can’t be taken care of by money or fists. He continuously tries to get Qing Pei into trouble, but Qing Pei sees it lightly and calmy resolves every issue. However, things are about to change when Yuan Yang asks his friends to do a background check on Qing Pei and finally finds his achilles heel. Featured Crew Sun Cheng Zhi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shang Bai Gu Qing Pei Gao Ming Yuan Yang Zhao Lei Zhao Yuan Liao Wang Peng Fang Sun Qi Heng Wang Jin Full Cast & Crew Last Season Season 1 2017 | 15 Episodes Season 1 of Beloved Enemy premiered on August 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Beloved Enemy. You can help by rating TV shows you've seen. Facts Original Name  决对争锋 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  35m Homepage  - Genres Drama Action & Adventure Keywords gay romance bromance Content Score 100 Yes! Looking good! Top Contributors 20 gayso 18 kbogesz 9 asiangay.eu 4 winnersx265  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}