{"link": "https://www.themoviedb.org/tv/74098?language=en", "title": "Konohana Kitan", "resume": "Konohana Kitan is the heartwarming story of a new apprentice named Yuzu, and the other fox girls who work at a hot spring hotel called Konohatei. The staff at Konohatei live by one belief: no matter who one may truly be, no matter what, anyone who is a guest is a god. Of course, that includes you. Let the hospitality of Yuzu and the Konohatei heal your tired soul.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Yuko Ono", "Risa Kubota", "Manami Numakura", "Ai Kakuma", "Sawako Hata"], "character": ["Yuzu (voice)", "Ren (voice)", "Kiri (voice)", "Sakura (voice)", "Satsuki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74098   Expand Konohana Kitan   (2017) User Score Overview Konohana Kitan is the heartwarming story of a new apprentice named Yuzu, and the other fox girls who work at a hot spring hotel called Konohatei. The staff at Konohatei live by one belief: no matter who one may truly be, no matter what, anyone who is a guest is a god. Of course, that includes you. Let the hospitality of Yuzu and the Konohatei heal your tired soul. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuko Ono Yuzu (voice) Risa Kubota Ren (voice) Manami Numakura Kiri (voice) Ai Kakuma Sakura (voice) Sawako Hata Satsuki (voice) Full Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of Konohana Kitan premiered on October  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Konohana Kitan. You can help by rating TV shows you've seen. Facts Original Name  このはな綺譚 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://konohanatei.jp Genres Animation Sci-Fi & Fantasy Keywords slice of life based on manga anime deity working life Content Score 86 Almost there... Top Contributors 40 Marr 🇳🇱 17 sp1ti D 8 Destr0y 5 sekaidown04  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}