{"link": "https://www.themoviedb.org/tv/62624?language=en", "title": "Dr. Klein", "resume": "\"Dr. Klein\" is a medical and family TV series, which moves between great emotion and humor. Valerie Klein is 1,32 meter tall and the only doctor in the children's hospital, who meets the small patients at eye level. There are many conflicts to solve both at work and at home with her family.", "rate": 37, "genre": ["Drama"], "cast": ["Christine Urspruch", "Simon Licht", "Clelia Sarto", "Michael Klammer", "Martina Eitner-Acheampong"], "character": ["Dr. Valerie Klein", "Dr. Bernd Lang", "Dr. Luna Haller", "Dr. Jonas Müller", "Gundula Pieper"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62624   Expand Dr. Klein   (2014) User Score Overview \"Dr. Klein\" is a medical and family TV series, which moves between great emotion and humor. Valerie Klein is 1,32 meter tall and the only doctor in the children's hospital, who meets the small patients at eye level. There are many conflicts to solve both at work and at home with her family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christine Urspruch Dr. Valerie Klein Simon Licht Dr. Bernd Lang Clelia Sarto Dr. Luna Haller Michael Klammer Dr. Jonas Müller Martina Eitner-Acheampong Gundula Pieper Full Cast & Crew Current Season Season 4 2017 | 12 Episodes Season 4 of Dr. Klein premiered on October  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dr. Klein. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  44m Homepage   http://www.zdf.de/dr.-klein/dr.-klein-34927230.html Genres Drama Keywords doctor Content Score 86 Almost there... Top Contributors S 35 Samara L 23 Lemmy_6 3 Banana 2 Bhojraj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}