{"link": "https://www.themoviedb.org/tv/705?language=en", "title": "SuperTed", "resume": "SuperTed is a Welsh fictional anthropomorphic bear character created by Mike Young. Originally created by Young as a series of stories to help his son overcome his fear of the dark, SuperTed became a popular series of books and led to an animated series produced from 1982 to 1986.", "rate": 72, "genre": ["Animation"], "cast": ["Victor Spinetti", "Roy Kinnear", "Melvyn Hayes", "Sheila Steafel", "Jon Pertwee"], "character": ["Texas Pete", "Bulk", "Skeleton", "Mother Nature/Blotch", "Spotty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 705   Expand SuperTed   (1982) User Score Overview SuperTed is a Welsh fictional anthropomorphic bear character created by Mike Young. Originally created by Young as a series of stories to help his son overcome his fear of the dark, SuperTed became a popular series of books and led to an animated series produced from 1982 to 1986. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victor Spinetti Texas Pete Roy Kinnear Bulk Melvyn Hayes Skeleton Sheila Steafel Mother Nature/Blotch Jon Pertwee Spotty Full Cast & Crew Last Season Season 3 1985 | 12 Episodes Season 3 of SuperTed premiered on November 20, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1972-10-16 Rainbow 7.0    1980-12-08 Button Moon 6.8    1981-12-24 The Kenny Everett Television Show 7.0    1987-09-26 ChuckleVision 6.3    1986-05-01 Bread 7.4    2002-10-04 The Basil Brush Show 8.0    1984-01-29 Ever Decreasing Circles 6.5    1993-09-06 Sooty & Co. 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m, 5m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors c 19 corrk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}