{"link": "https://www.themoviedb.org/tv/36025?language=en", "title": "Kämpfer", "resume": "Kämpfer is a Japanese light novel series by Toshihiko Tsukiji, with illustrations by Senmu. The series contains 15 volumes published by Media Factory under their MF Bunko J imprint between November 2006 and March 2010. The main series covers 12 volumes, while the remaining three are short story collections. A manga adaptation by Yu Tachibana started serialization in the April 2008 issue of Monthly Comic Alive. A 12-episode anime adaptation aired in Japan between October and December 2009 on TBS, concluded in spring 2011 with Kämpfer für die Liebe. The series has extensive use of the German language.", "rate": 60, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Marina Inoue", "Yui Horie", "Nana Mizuki", "Yukari Tamura", "Eri Nakao"], "character": ["Natsuru Senō", "Akane Mishima", "Electrocuted Wildcat", "Black Seppuku Rabbit", "Sayaka Nakao"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36025   Expand Kämpfer   (2009) User Score Overview Kämpfer is a Japanese light novel series by Toshihiko Tsukiji, with illustrations by Senmu. The series contains 15 volumes published by Media Factory under their MF Bunko J imprint between November 2006 and March 2010. The main series covers 12 volumes, while the remaining three are short story collections. A manga adaptation by Yu Tachibana started serialization in the April 2008 issue of Monthly Comic Alive. A 12-episode anime adaptation aired in Japan between October and December 2009 on TBS, concluded in spring 2011 with Kämpfer für die Liebe. The series has extensive use of the German language. Featured Crew Yasuhiro Kuroda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marina Inoue Natsuru Senō Yui Horie Akane Mishima Nana Mizuki Electrocuted Wildcat Yukari Tamura Black Seppuku Rabbit Eri Nakao Sayaka Nakao Full Cast & Crew Last Season Season 1 2009 | 14 Episodes Season 1 of Kämpfer premiered on October  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Kämpfer. You can help by rating TV shows you've seen. Facts Original Name  けんぷファー Status  Ended Networks BS-i Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords ecchi anime fan service Content Score 93 Almost there... Top Contributors 17 tobim91 6 Sergiojamon 5 Wong 4 Dante  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}