{"link": "https://www.themoviedb.org/tv/12444?language=en", "title": "The Patty Duke Show", "resume": "The Patty Duke Show is an American sitcom which ran on ABC from September 18, 1963 to April 27, 1966, with reruns airing through August 31, 1966. The show was created as a vehicle for rising star Patty Duke. A total of 104 episodes were produced, most written by Sidney Sheldon.", "rate": 57, "genre": ["Comedy"], "cast": ["William Schallert", "Patty Duke", "Patty Duke", "Jean Byron", "Paul O'Keefe"], "character": ["Martin Lane", "Cathy Lane", "Patty Lane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12444   Expand The Patty Duke Show   (1963) User Score Overview The Patty Duke Show is an American sitcom which ran on ABC from September 18, 1963 to April 27, 1966, with reruns airing through August 31, 1966. The show was created as a vehicle for rising star Patty Duke. A total of 104 episodes were produced, most written by Sidney Sheldon. Featured Crew Sidney Sheldon Creator William Asher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Schallert Martin Lane Patty Duke Cathy Lane Patty Duke Patty Lane Jean Byron Paul O'Keefe Full Cast & Crew Last Season Season 3 1965 | 32 Episodes Season 3 of The Patty Duke Show premiered on September 15, 1965. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply d I was a Cathy, but wanted to be a Patty Open 0 by diamonddaisy\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1952-10-03 The Adventures of Ozzie and Harriet 5.6    1958-09-24 The Donna Reed Show 6.7    1953-09-29 The Danny Thomas Show 7.3    1951-12-16 Dragnet 7.0    1958-10-10 77 Sunset Strip 7.9    1966-09-08 That Girl 6.7    1961-09-28 Hazel 7.8    1965-09-14 F Troop 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 2 Steve 1 DarkMan 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}