{"link": "https://www.themoviedb.org/tv/65176?language=en", "title": "The Disguiser", "resume": "Set in the Japanese occupation era, the rich yet naive young master Ming Tai is trained to become an agent, and is later sent to become an underground spy for the Communists. Together with his brother and double agent Ming Lou, they try and bring down Wang Wei's Kuomintang Secret Service Headquarters.", "rate": 77, "genre": ["Crime", "Thriller"], "cast": ["Hu Ge", "Jin Dong", "Nick Wang", "Liu Mintao", "Wang Ou"], "character": ["明台", "明樓", "明誠", "Ming Jing", "Wang Man Chun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65176   Expand The Disguiser   (2015) User Score Overview Set in the Japanese occupation era, the rich yet naive young master Ming Tai is trained to become an agent, and is later sent to become an underground spy for the Communists. Together with his brother and double agent Ming Lou, they try and bring down Wang Wei's Kuomintang Secret Service Headquarters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hu Ge 明台 Jin Dong 明樓 Nick Wang 明誠 Liu Mintao Ming Jing Wang Ou Wang Man Chun Full Cast & Crew Last Season Season 1 2015 | 41 Episodes Season 1 of The Disguiser premiered on August 31, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Disguiser. You can help by rating TV shows you've seen. Facts Original Name  偽裝者 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Crime Thriller Keywords china spy communism Content Score 86 Almost there... Top Contributors 33 Wendy k 20 keror0 z 10 zurman1 M 8 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}