{"link": "https://www.themoviedb.org/tv/31325?language=en", "title": "Garrow's Law", "resume": "The true tale of pioneering 18th century barrister William Garrow, who acted as counsel for the accused, introducing the concept of 'innocent until proved guilty' at London's Old Bailey.", "rate": 60, "genre": ["Drama"], "cast": ["Andrew Buchan", "Alun Armstrong", "Lyndsey Marshal", "Rupert Graves", "Aidan McArdle"], "character": ["William Garrow", "John Southouse", "Lady Sarah Hill", "Sir Arthur Hill", "Silvester"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31325   Expand Garrow's Law   (2009) User Score Overview The true tale of pioneering 18th century barrister William Garrow, who acted as counsel for the accused, introducing the concept of 'innocent until proved guilty' at London's Old Bailey. Featured Crew Tony Marchant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Buchan William Garrow Alun Armstrong John Southouse Lyndsey Marshal Lady Sarah Hill Rupert Graves Sir Arthur Hill Aidan McArdle Silvester Full Cast & Crew Last Season Series 3 2011 | 4 Episodes Season 3 of Garrow's Law premiered on November 13, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Garrow's Law. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00w5c2w Genres Drama Keywords london england lawyer period drama barrister 18th century legal drama Content Score 93 Almost there... Top Contributors 21 United600 16 Banana 3 Elizabeth Jennings T 2 Test3197  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}