{"link": "https://www.themoviedb.org/tv/1027?language=en", "title": "The Carol Burnett Show", "resume": "The Carol Burnett Show is an American variety/sketch comedy television show starring Carol Burnett, Harvey Korman, Vicki Lawrence, Lyle Waggoner, and Tim Conway. It originally ran on CBS from September 11, 1967, to March 29, 1978, for 278 episodes and originated from CBS Television City's Studio 33. The series won 25 prime time Emmy Awards, was ranked No. 16 on TV Guide's 50 Greatest TV Shows of All Time in 2002 and in 2007 was listed as one of Time magazine's \"100 Best TV Shows of All Time.\"", "rate": 81, "genre": ["Comedy", "Family"], "cast": ["Carol Burnett"], "character": ["Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1027   Expand The Carol Burnett Show   (1967) User Score Overview The Carol Burnett Show is an American variety/sketch comedy television show starring Carol Burnett, Harvey Korman, Vicki Lawrence, Lyle Waggoner, and Tim Conway. It originally ran on CBS from September 11, 1967, to March 29, 1978, for 278 episodes and originated from CBS Television City's Studio 33. The series won 25 prime time Emmy Awards, was ranked No. 16 on TV Guide's 50 Greatest TV Shows of All Time in 2002 and in 2007 was listed as one of Time magazine's \"100 Best TV Shows of All Time.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carol Burnett Various Characters Full Cast & Crew Last Season Season 1 1967 | 1 Episode Season 1 of The Carol Burnett Show premiered on September 11, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1960-09-29 My Three Sons 6.0    1965-09-14 F Troop 6.4    1954-10-03 Father Knows Best 8.6    1965-09-01 Gidget 5.2    1968-09-21 Adam-12 6.7    1961-09-28 Hazel 7.8    1962-10-11 McHale's Navy 6.1    1968-09-28 The Ghost & Mrs. Muir 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 54m Homepage  - Genres Comedy Family Keywords sketch comedy questions from the audience Content Score 56 We're so close, yet so far. Top Contributors 7 Zlogorek PE 4 Patrick E. Abe 3 Banana n 2 nazwaquenza272  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}