{"link": "https://www.themoviedb.org/tv/34793?language=en", "title": "Girls Bravo", "resume": "Girls Bravo is a Japanese shōnen manga series written and illustrated by Mario Kaneda and serialized from 2000 to 2005 in Shōnen Ace by Kadokawa Shoten. The story focuses on a young high school student who is kicked into a bathtub and transported to a mysterious world with a mostly female population.\nThe anime adaptation of Girls Bravo, directed by Ei Aoki and animated by AIC Spirits, aired in Japan from 2004 to 2005. There are 24 episodes total. The anime series was released in English by Geneon, and the manga was released in English by Tokyopop. A visual novel was also released for the PlayStation 2.\nIn July 2010, Funimation Entertainment released a statement on their Twitter feed confirming that they have licensed Girls Bravo.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Mamiko Noto", "Ayaka Saitou", "Ayako Kawasumi", "Masayo Kurata", "Yuki Matsuoka"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34793   Expand Girls Bravo   (2004) User Score Overview Girls Bravo is a Japanese shōnen manga series written and illustrated by Mario Kaneda and serialized from 2000 to 2005 in Shōnen Ace by Kadokawa Shoten. The story focuses on a young high school student who is kicked into a bathtub and transported to a mysterious world with a mostly female population. The anime adaptation of Girls Bravo, directed by Ei Aoki and animated by AIC Spirits, aired in Japan from 2004 to 2005. There are 24 episodes total. The anime series was released in English by Geneon, and the manga was released in English by Tokyopop. A visual novel was also released for the PlayStation 2. In July 2010, Funimation Entertainment released a statement on their Twitter feed confirming that they have licensed Girls Bravo. Featured Crew Mario Kaneda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamiko Noto Ayaka Saitou Ayako Kawasumi Masayo Kurata Yuki Matsuoka Full Cast & Crew Last Season Season 2 2005 | 13 Episodes Season 2 of Girls Bravo premiered on January 27, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2006-10-03 Ghost Hunt 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 Sergiojamon 4 yoshizuka m 2 magoozin 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}