{"link": "https://www.themoviedb.org/tv/15130?language=en", "title": "Monster Rancher", "resume": "Monster Rancher, known in Japan as Monster Farm, is a 73-episode anime series based on Tecmo's Monster Rancher video game franchise. It originally aired on Japanese television on TBS from April 17, 1999 to September 30, 2001. An English-language version by Bohbot Entertainment aired in North America on Fox Kids. In Japan, the program existed as two separate series; Enbanseki no Himitsu for episodes 1-48 and Densetsu e no Michi for episodes 49-73.", "rate": 70, "genre": ["Animation", "Comedy", "Action", "Adventure", "Action", "Adventure"], "cast": ["Chisa Yokoyama", "Mariko Kōda", "Yuri Shiratori", "Wataru Takagi", "Naoya Uchida"], "character": ["Genki", "Holly", "Mocchi", "Suezo", "Golem"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15130   Expand Monster Rancher   (1999) User Score Overview Monster Rancher, known in Japan as Monster Farm, is a 73-episode anime series based on Tecmo's Monster Rancher video game franchise. It originally aired on Japanese television on TBS from April 17, 1999 to September 30, 2001. An English-language version by Bohbot Entertainment aired in North America on Fox Kids. In Japan, the program existed as two separate series; Enbanseki no Himitsu for episodes 1-48 and Densetsu e no Michi for episodes 49-73. Featured Crew Nanako Shimazaki Creator Sachio Okazaki Creator Tomio Yamauchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chisa Yokoyama Genki Mariko Kōda Holly Yuri Shiratori Mocchi Wataru Takagi Suezo Naoya Uchida Golem Full Cast & Crew Last Season Season 3 2001 | 25 Episodes Season 3 of Monster Rancher premiered on September 13, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   Digimon Adventure 02 5.6    2000-04-18 Yu-Gi-Oh! Duel Monsters 7.1    1998-04-04 Yu-Gi-Oh! 6.4    1997-09-13 Recess 6.8    1999-03-07 Digimon 6.8  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Action & Adventure Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors V 8 Vergil365 6 Sergiojamon z 4 zurman1 1 Dosedd  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}