{"link": "https://www.themoviedb.org/tv/5953?language=en", "title": "The Legend of Bruce Lee", "resume": "The story of the legendary martial arts icon Bruce Lee following him from Hong Kong to America and back again, leading up to his tragic death at the age of 32.", "rate": 53, "genre": ["Action", "Adventure"], "cast": ["Danny Chan Kwok-Kwan"], "character": ["Bruce Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5953   Expand The Legend of Bruce Lee   (2008) User Score Overview The story of the legendary martial arts icon Bruce Lee following him from Hong Kong to America and back again, leading up to his tragic death at the age of 32. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danny Chan Kwok-Kwan Bruce Lee Full Cast & Crew Last Season Season 1 2008 | 50 Episodes Season 1 of The Legend of Bruce Lee premiered on October  4, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Bruce Lee. You can help by rating TV shows you've seen. Facts Original Name  李小龍傳奇 Status  Ended Network CCTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Keywords kung fu biography bruce lee Content Score 56 We're so close, yet so far. Top Contributors 14 Jaime Neto 13 Banana r 7 rakrak123 6 DaRKeN58  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}