{"link": "https://www.themoviedb.org/tv/37807?language=en", "title": "Beyblade: Metal Fusion", "resume": "Metal Fight Beyblade is a Japanese manga created by Takafumi Adachi. It is also an anime production based on the original. It is currently being serialized by the monthly CoroCoro Comic.", "rate": 50, "genre": ["Animation"], "cast": ["Kaori Nazuka", "Miyu Irino", "Yuuko Sanpei", "Akeno Watanabe", "Hiro Yuuki"], "character": ["Yu Tendo", "Tsubasa Ootori", "Masamune Kadoya", "Mizuchi Reiji", "Ryuutarou Fukami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37807   Expand Beyblade: Metal Fusion   (2009) User Score Overview Metal Fight Beyblade is a Japanese manga created by Takafumi Adachi. It is also an anime production based on the original. It is currently being serialized by the monthly CoroCoro Comic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaori Nazuka Yu Tendo Miyu Irino Tsubasa Ootori Yuuko Sanpei Masamune Kadoya Akeno Watanabe Mizuchi Reiji Hiro Yuuki Ryuutarou Fukami Full Cast & Crew Last Season Season 1 2009 | 51 Episodes Season 1 of Beyblade: Metal Fusion premiered on April  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-12-24 Turbo FAST 4.7  Facts Original Name  メタルファイト ベイブレード Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  21m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 Banana z 5 zurman1 w 3 weestewatt 3 enams90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}