{"link": "https://www.themoviedb.org/tv/67180?language=en", "title": "Second To Last Love", "resume": "Ko Sang-Sik is in his 40's and still single. He works as the environmental facility section chief at city hall. Ko Sang-Sik becomes involved with Kang Min-Joo. She is also in her 40's and still single. She works as a PD at a broadcasting station.", "rate": 83, "genre": ["Comedy"], "cast": ["Ji Jin-hee", "Kim Hee-ae", "Kwak Si-yang", "Kim Seul-Gi", "Lee Soo-Min"], "character": ["Ko Sang-Sik", "Kang Min-Joo", "Park Joon-Woo", "Ko Mi-Ryeo", "Ko Ye-Ji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67180   Expand Second To Last Love   (2016) User Score Overview Ko Sang-Sik is in his 40's and still single. He works as the environmental facility section chief at city hall. Ko Sang-Sik becomes involved with Kang Min-Joo. She is also in her 40's and still single. She works as a PD at a broadcasting station. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Jin-hee Ko Sang-Sik Kim Hee-ae Kang Min-Joo Kwak Si-yang Park Joon-Woo Kim Seul-Gi Ko Mi-Ryeo Lee Soo-Min Ko Ye-Ji Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of Second To Last Love premiered on July 30, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-08-27 The Gentlemen of Wolgyesu Tailor Shop 5.8    2016-08-27 Blow Breeze 6.6    2016-09-21 On the Way to the Airport 8.7    2016-03-05 Marriage Contract 8.2    2016-04-27 Master: God of Noodles 7.3    2016-07-08 The Good Wife 4.2    2016-09-26 Woman with a Suitcase 7.1  Facts Original Name  끝에서 두번째 사랑 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000009619 Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 38 Maria180493 4 andermairena k 4 kayl4 s 3 sm207  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}