{"link": "https://www.themoviedb.org/tv/12845?language=en", "title": "Mr. Merlin", "resume": "Mr. Merlin is an American sitcom that ran for one season, from 1981 to 1982, about Merlin the wizard, who is immortal, living in modern-day San Francisco, and disguised as Max Merlin, a mechanic. Mr. Merlin was produced by Larry Rosen and Larry Tucker, working as the Larry Larry Company, in association with Columbia Pictures Television.", "rate": 50, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Jonathan Prince", "Barnard Hughes", "Elaine Joyce", "Clark Brandon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12845   Expand Mr. Merlin   (1981) User Score Overview Mr. Merlin is an American sitcom that ran for one season, from 1981 to 1982, about Merlin the wizard, who is immortal, living in modern-day San Francisco, and disguised as Max Merlin, a mechanic. Mr. Merlin was produced by Larry Rosen and Larry Tucker, working as the Larry Larry Company, in association with Columbia Pictures Television. Featured Crew Larry Tucker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Prince Barnard Hughes Elaine Joyce Clark Brandon Full Cast & Crew Last Season Season 1 1981 | 22 Episodes Season 1 of Mr. Merlin premiered on October  7, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mr. Merlin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords immortality san francisco car garage merlin wizard sitcom Content Score 93 Almost there... Top Contributors 13 Banana T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}