{"link": "https://www.themoviedb.org/tv/17625?language=en", "title": "The Witcher", "resume": "Wiedźmin is a 2002 fantasy television series. 13 episodes were made. The series received relatively poor reviews, particularly in the light of the failure of the preceding movie.\nThe story is based on the stories of The Witcher, by Polish author Andrzej Sapkowski.", "rate": 59, "genre": ["Drama", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Michal Zebrowski", "Wieslaw Chmielinski", "Magdalena Warzecha", "Wojciech Duryasz", "Maciej Kozłowski"], "character": ["Geralt", "Nohorn", "Visenna", "Old Witcher", "Falwick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17625   Expand The Witcher   (2002) User Score Overview Wiedźmin is a 2002 fantasy television series. 13 episodes were made. The series received relatively poor reviews, particularly in the light of the failure of the preceding movie. The story is based on the stories of The Witcher, by Polish author Andrzej Sapkowski. Featured Crew Marek Brodzki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michal Zebrowski Geralt Wieslaw Chmielinski Nohorn Magdalena Warzecha Visenna Wojciech Duryasz Old Witcher Maciej Kozłowski Falwick Full Cast & Crew Last Season Season 1 2002 | 13 Episodes Season 1 of The Witcher premiered on September 22, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2003-03-16 Frank Herbert's Children of Dune 6.8    2006-07-18 Eureka 7.4    2010-01-22 Spartacus 7.8    2016-09-30 Marvel's Luke Cage 6.9    2004-11-16 House 8.1    2015-04-10 Marvel's Daredevil 7.7  Facts Original Name  Wiedźmin Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  Polish Runtime  50m Homepage  - Genres Drama Action & Adventure Sci-Fi & Fantasy Keywords the witcher Content Score 93 Almost there... Top Contributors 59 Apollo W 6 Wiruss 5 Elizabeth Jennings 3 sergiop08  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}