{"link": "https://www.themoviedb.org/tv/8757?language=en", "title": "Chinese Paladin", "resume": "Chinese Paladin is a Chinese television series produced by Chinese Entertainment Shanghai Ltd. It was first broadcast on CTV and CBG in Taiwan and mainland China respectively in January 2005. The series is based on the original version of the RPG The Legend of Sword and Fairy. It was followed by Chinese Paladin 3 in 2009. The series brings together cast members from China, Hong Kong and Singapore.", "rate": 100, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Liu Yifei", "Ady An", "Hu Ge", "Elvis Tsui", "Esther Liu"], "character": ["Zhao Ling'er", "Lin Yueru", "Li Xiaoyao", "Moon Worshipping Cult's leader", "A'nu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8757   Expand Chinese Paladin   (2005) User Score Overview Chinese Paladin is a Chinese television series produced by Chinese Entertainment Shanghai Ltd. It was first broadcast on CTV and CBG in Taiwan and mainland China respectively in January 2005. The series is based on the original version of the RPG The Legend of Sword and Fairy. It was followed by Chinese Paladin 3 in 2009. The series brings together cast members from China, Hong Kong and Singapore. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Yifei Zhao Ling'er Ady An Lin Yueru Hu Ge Li Xiaoyao Elvis Tsui Moon Worshipping Cult's leader Esther Liu A'nu Full Cast & Crew Last Season Season 1 — | 34 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chinese Paladin. You can help by rating TV shows you've seen. Facts Original Name  仙剑奇侠传 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage   http://www.tangrendianying.com/works-tv-detail.php?id Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 Elizabeth Jennings 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}