{"link": "https://www.themoviedb.org/tv/72104?language=en", "title": "Planet of the Apps", "resume": "App creators are given the opportunity of a lifetime. If their concepts are chosen by the entrepreneur advisors, these developers will be mentored on how to pitch their app to Lightspeed Venture Partners for a chance at real funding.", "rate": 40, "genre": ["Reality"], "cast": ["Zane Lowe", "Jessica Alba", "Gwyneth Paltrow", "Gary Vaynerchuk", "Will.i.am"], "character": ["Himself", "Herself", "Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72104   Expand Planet of the Apps   (2017) User Score  Play Trailer Overview App creators are given the opportunity of a lifetime. If their concepts are chosen by the entrepreneur advisors, these developers will be mentored on how to pitch their app to Lightspeed Venture Partners for a chance at real funding. Featured Crew Will.i.am Creator Benjamin Silverman Creator Howard T. Owens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zane Lowe Himself Jessica Alba Herself Gwyneth Paltrow Herself Gary Vaynerchuk Himself Will.i.am Himself Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Planet of the Apps premiered on June  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Planet of the Apps. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  50m Homepage   https://itunes.apple.com/us/show/planet-of-the-apps/id1235839922 Genres Reality Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors I 23 Iscoh 17 jpsqq 11 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}