{"link": "https://www.themoviedb.org/tv/67489?language=en", "title": "The Airport Diary", "resume": "Small plane Winky dreams of seeing the world while meeting friends at the airport, including the transport plane Gugu and the private jet Force King.", "rate": 100, "genre": ["Animation", "Kids"], "cast": ["Seung-Hui Yun", "Yu Dong Gyun", "Hyeon-Wu Byeon", "Jeong-mi Bae", "Jeon Soo-kyeong"], "character": ["Emily (voice)", "Forceking (voice)", "Gugu (voice)", "Illy (voice)", "Winky (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67489   Expand The Airport Diary   (2012) User Score Overview Small plane Winky dreams of seeing the world while meeting friends at the airport, including the transport plane Gugu and the private jet Force King. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seung-Hui Yun Emily (voice) Yu Dong Gyun Forceking (voice) Hyeon-Wu Byeon Gugu (voice) Jeong-mi Bae Illy (voice) Jeon Soo-kyeong Winky (voice) Full Cast & Crew Last Season Season 1 2012 | 26 Episodes Season 1 of The Airport Diary premiered on March 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Airport Diary. You can help by rating TV shows you've seen. Facts Original Name  두리둥실 뭉게공항 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  10m Homepage   http://www.kbs.co.kr/2tv/enter/airportdiary/ Genres Animation Kids Keywords airplane airport 3d the airport diary airport diary Content Score 71 Just a little bit more... Top Contributors 48 Marr 🇳🇱 r 7 randyh66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}