{"link": "https://www.themoviedb.org/tv/14208?language=en", "title": "Anna Pihl", "resume": "Anna Pihl is a Danish police drama produced by TV2. The series stars Charlotte Munck as the title character Anna Pihl, Peter Mygind, and Iben Hjejle as Mikala. Three seasons have been produced, each having 10 episodes.\nThe show follows the work and personal life of Anna Pihl, a policewoman at the Bellahøj police station in Copenhagen. She is divorced, and lives with her son, Mikkel, in a flat shared with Jan, her gay male friend. The show focuses on personal stories and realism: although it has action and suspense, it comes second to more realistic material.\nBesides Denmark, the series has been broadcast in Iceland, Sweden, Norway and Finland. In Germany, the show was cancelled due to low ratings after the first nine episodes of season 1. A late night re-run started in September 2008. Season one aired in Estonia and in Australia on SBS One. In USA, Latin America and Portugal, Anna Pihl airs on Eurochannel.\nThe theme song for season 1 was \"Crosshair\" by Blue Foundation, while the theme song for seasons 2 and 3 was \"In the End I Started\" by Swedish singer Maria Marcus and Dane Niels Brinck.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Charlotte Munck", "Peter Mygind", "Ola Rapace", "Kurt Ravn", "Tammi Øst"], "character": ["Anna Pihl", "Jan Bøttger", "Daniel Nordström", "Henning Pihl", "Eva Fabricius"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14208   Expand Anna Pihl   (2006) User Score Overview Anna Pihl is a Danish police drama produced by TV2. The series stars Charlotte Munck as the title character Anna Pihl, Peter Mygind, and Iben Hjejle as Mikala. Three seasons have been produced, each having 10 episodes. The show follows the work and personal life of Anna Pihl, a policewoman at the Bellahøj police station in Copenhagen. She is divorced, and lives with her son, Mikkel, in a flat shared with Jan, her gay male friend. The show focuses on personal stories and realism: although it has action and suspense, it comes second to more realistic material. Besides Denmark, the series has been broadcast in Iceland, Sweden, Norway and Finland. In Germany, the show was cancelled due to low ratings after the first nine episodes of season 1. A late night re-run started in September 2008. Season one aired in Estonia and in Australia on SBS One. In USA, Latin America and Portugal, Anna Pihl airs on Eurochannel. The theme song for season 1 was \"Crosshair\" by Blue Foundation, while the theme song for seasons 2 and 3 was \"In the End I Started\" by Swedish singer Maria Marcus and Dane Niels Brinck. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlotte Munck Anna Pihl Peter Mygind Jan Bøttger Ola Rapace Daniel Nordström Kurt Ravn Henning Pihl Tammi Øst Eva Fabricius Full Cast & Crew Last Season Season 3 2008 | 10 Episodes Season 3 of Anna Pihl premiered on January  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Anna Pihl. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Danish Runtime  50m Homepage  - Genres Crime Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 16 Kirsten J Nielsen 12 vacdk p 3 pernygaard 3 nazgul5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}