{"link": "https://www.themoviedb.org/tv/33823?language=en", "title": "Chinese Paladin 3", "resume": "Chinese Paladin 3 is a Chinese television series adapted from the video game of the same title, and, because of an added time travel concept allowing the main protagonist from Chinese Paladin to appear in the setting decades before the events of the first, serves as an interquel to both. It was first released on television stations in mainland China, Taiwan, Malaysia and Singapore in 2009. Chinese Paladin 2 was not filmed because the producers felt that the third game had a much stronger story than the second.", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Yang Mi", "Hu Ge", "Liu Shishi", "Wallace Huo", "Gordon Liu Chia-Hui"], "character": ["Tang Xuejian / Xiyao", "Jingtian / Feipeng / Long Yang / Li Xiaoyao", "Long Kui", "Xu Changqing / Lin Yeping / Gu Liufang", "Evil Sword Immortal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33823   Expand Chinese Paladin 3   (2009) User Score Overview Chinese Paladin 3 is a Chinese television series adapted from the video game of the same title, and, because of an added time travel concept allowing the main protagonist from Chinese Paladin to appear in the setting decades before the events of the first, serves as an interquel to both. It was first released on television stations in mainland China, Taiwan, Malaysia and Singapore in 2009. Chinese Paladin 2 was not filmed because the producers felt that the third game had a much stronger story than the second. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yang Mi Tang Xuejian / Xiyao Hu Ge Jingtian / Feipeng / Long Yang / Li Xiaoyao Liu Shishi Long Kui Wallace Huo Xu Changqing / Lin Yeping / Gu Liufang Gordon Liu Chia-Hui Evil Sword Immortal Full Cast & Crew Last Season Season 1 2009 | 37 Episodes Season 1 of Chinese Paladin 3 premiered on June 28, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chinese Paladin 3. You can help by rating TV shows you've seen. Facts Original Name  仙剑奇侠传三 Status  Ended Network JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors S 13 Sakya0608 13 Wendy 3 Elizabeth Jennings 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}