{"link": "https://www.themoviedb.org/tv/31721?language=en", "title": "Corpse Princess", "resume": "Corpse Princess is a Japanese manga series written and illustrated by Yoshiichi Akahito. Premiering in Monthly Shōnen Gangan on April 12, 2005, the series centers around the \"Corpse Princess\" Makina Hoshimura, an undead girl who is hunting down 108 undead corpses in order to gain entry into heaven with the help of a secret society of anti-corpse Buddhist monks.\nFeel and Gainax partnered together to adapt the series into a thirteen episode anime series. The first season, Aka, premiered on AT-X on October 2, 2008. A second season, Kuro, aired between January and March 2009. The anime is licensed for North American distribution and release by Funimation Entertainment, which has already started releasing the episodes in subtitled form as Shikabane Hime through various online distribution companies and through its own website.\nThe series made its North American television debut on the FUNimation Channel on November 15, 2010.", "rate": 82, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": ["Chise Nakamura", "Keiji Fujiwara", "Nana Akiyama", "Tatsuya Hasome", "Chika Fujimura"], "character": ["Itsuki Yamagami", "Keisei Tagami", "Makina Hoshimura", "Ouri Kagami", "Hokuto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31721   Expand Corpse Princess   (2008) User Score Overview Corpse Princess is a Japanese manga series written and illustrated by Yoshiichi Akahito. Premiering in Monthly Shōnen Gangan on April 12, 2005, the series centers around the \"Corpse Princess\" Makina Hoshimura, an undead girl who is hunting down 108 undead corpses in order to gain entry into heaven with the help of a secret society of anti-corpse Buddhist monks. Feel and Gainax partnered together to adapt the series into a thirteen episode anime series. The first season, Aka, premiered on AT-X on October 2, 2008. A second season, Kuro, aired between January and March 2009. The anime is licensed for North American distribution and release by Funimation Entertainment, which has already started releasing the episodes in subtitled form as Shikabane Hime through various online distribution companies and through its own website. The series made its North American television debut on the FUNimation Channel on November 15, 2010. Featured Crew Yoshiichi Akahito Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chise Nakamura Itsuki Yamagami Keiji Fujiwara Keisei Tagami Nana Akiyama Makina Hoshimura Tatsuya Hasome Ouri Kagami Chika Fujimura Hokuto Full Cast & Crew Last Season BLACK 2009 | 12 Episodes Season 2 of Corpse Princess premiered on January  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  4 Recommendations   2008-01-03 Rosario + Vampire 9.1  Facts Original Name  屍姫 Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Spanish; Castilian Runtime  24m Homepage  - Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords anime Content Score 93 Almost there... Top Contributors 10 BrerFox K 7 Kuroneko45 6 Marr 🇳🇱 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}