{"link": "https://www.themoviedb.org/tv/3824?language=en", "title": "The Return of the Condor Heroes", "resume": "The Return of the Condor Heroes is a Chinese television series adapted from Louis Cha's novel of the same title. It is the second installment of a trilogy produced by Zhang Jizhong, preceded by The Legend of the Condor Heroes and followed by The Heaven Sword and Dragon Saber. It was first broadcast on 17 March 2006 in China and subsequently broadcast in other Asian countries such as South Korea, Taiwan and Singapore.", "rate": 68, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Huang Xiaoming", "Liu Yifei", "Yang Mi", "Luoyong Wang", "Jessey Meng"], "character": ["Yang Guo", "Xiaolongnü", "Guo Xiang", "Guo Jing", "Li Mochou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3824   Expand The Return of the Condor Heroes   (2006) User Score Overview The Return of the Condor Heroes is a Chinese television series adapted from Louis Cha's novel of the same title. It is the second installment of a trilogy produced by Zhang Jizhong, preceded by The Legend of the Condor Heroes and followed by The Heaven Sword and Dragon Saber. It was first broadcast on 17 March 2006 in China and subsequently broadcast in other Asian countries such as South Korea, Taiwan and Singapore. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Huang Xiaoming Yang Guo Liu Yifei Xiaolongnü Yang Mi Guo Xiang Luoyong Wang Guo Jing Jessey Meng Li Mochou Full Cast & Crew Last Season Season 1 — | 42 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on The Return of the Condor Heroes. You can help by rating TV shows you've seen. Facts Original Name  神雕侠侣 Status  Ended Network CCTV Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Drama Sci-Fi & Fantasy Keywords based on novel or book wuxia Content Score 86 Almost there... Top Contributors c 20 chaiyut 12 thirstyhippo k 3 khyungil h 3 huangfeng  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}