{"link": "https://www.themoviedb.org/tv/60586?language=en", "title": "The Penal Battalion", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 73, "genre": ["Drama"], "cast": ["Aleksey Serebryakov", "Yuri Stepanov", "Aleksandr Bashirov", "Iliya Kovrizhnykh", "Aleksei Zharkov"], "character": ["Vasilii Tverdokhlebov", "Antip \"Kulak\" Glymov", "Stirah", "Tzukerman", "Lykov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60586   Expand The Penal Battalion   (2004) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Eduard Volodarskiy Creator Nicolay Dostal Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aleksey Serebryakov Vasilii Tverdokhlebov Yuri Stepanov Antip \"Kulak\" Glymov Aleksandr Bashirov Stirah Iliya Kovrizhnykh Tzukerman Aleksei Zharkov Lykov Full Cast & Crew Last Season Season 1 2004 | 11 Episodes Season 1 of The Penal Battalion premiered on September 20, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Penal Battalion. You can help by rating TV shows you've seen. Facts Original Name  Штрафбат Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Russian Runtime  50m Homepage   http://russia.tv/brand/show/brand_id/22625/ Genres Drama Keywords great patriotic war Content Score 86 Almost there... Top Contributors p 76 ptholemaios 75 Apollo 20 Elizabeth Jennings TB 13 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}