{"link": "https://www.themoviedb.org/tv/62763?language=en", "title": "It's Okay, That's Love", "resume": "Jang Jae-yeol is a writer of bestselling mystery novels and a radio DJ. Playful and a bit arrogant, he also suffers from obsessive–compulsive disorder. Ji Hae-soo is a psychiatrist on her first year of fellowship. Driven and ambitious with her career yet compassionate towards her patients, Hae-soo has a negative attitude towards love and relationships in her personal life. Once Jae-yeol and Hae-soo meet, there is much contention between them caused by their strong personalities and refusal to give in to each other. But slowly their bickering turns into love and they begin to learn how compatible they are. Jae-yeol and Hae-soo attempt to heal each other's deep-seated wounds, but their fledgling relationship takes a blow when they learn that Jae-yeol's mental health issues are more serious than they initially suspected.", "rate": 93, "genre": ["Comedy", "Romance", "Drama"], "cast": ["Gong Hyo-jin", "Jo In-sung", "Doh Kyung-soo", "Lee Sung-kyung", "Yang Ik-june"], "character": ["Ji Hae-soo", "Jang Jae-yeol", "Han Kang-woo", "Oh So-nyeo", "Jang Jae-beom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62763   Expand It's Okay, That's Love   (2014) User Score Overview Jang Jae-yeol is a writer of bestselling mystery novels and a radio DJ. Playful and a bit arrogant, he also suffers from obsessive–compulsive disorder. Ji Hae-soo is a psychiatrist on her first year of fellowship. Driven and ambitious with her career yet compassionate towards her patients, Hae-soo has a negative attitude towards love and relationships in her personal life. Once Jae-yeol and Hae-soo meet, there is much contention between them caused by their strong personalities and refusal to give in to each other. But slowly their bickering turns into love and they begin to learn how compatible they are. Jae-yeol and Hae-soo attempt to heal each other's deep-seated wounds, but their fledgling relationship takes a blow when they learn that Jae-yeol's mental health issues are more serious than they initially suspected. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  4 Videos Trailers  0 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gong Hyo-jin Ji Hae-soo Jo In-sung Jang Jae-yeol Doh Kyung-soo Han Kang-woo Lee Sung-kyung Oh So-nyeo Yang Ik-june Jang Jae-beom Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of It's Okay, That's Love premiered on July 23, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  11 Posters  4 Recommendations   2014-05-07 You Are All Surrounded 8.0    2010-08-11 My Girlfriend is a Nine-Tailed Fox 7.6    2012-05-30 Bridal Mask 9.5    2013-12-09 The Prime Minister and I 7.1    2014-09-10 Blade Man 6.4    2012-12-03 School 2013 8.5    2012-07-24 Reply 1997 8.5    2015-05-15 The Producers 7.3  Facts Original Name  괜찮아, 사랑이야 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/oklove Genres Comedy Romance Drama Keywords korea medical drama Content Score 93 Almost there... Top Contributors t 58 tmdb38202327 z 10 zurman1 M 9 Maria180493 5 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}