{"link": "https://www.themoviedb.org/tv/15520?language=en", "title": "The All-New Popeye Hour", "resume": "The All-New Popeye Hour is an animated television series produced by Hanna-Barbera Productions and King Features Syndicate. Starring the popular comic strip character Popeye, the series aired from 1978 to 1983 on CBS.", "rate": 72, "genre": ["Animation"], "cast": ["Daws Butler", "Allan Melvin", "Marilyn Schreffler", "Jack Mercer", "Frank Welker"], "character": ["Wimpy", "Bluto", "Olive Oyl / Sea Hag / Swee'Pea", "Popeye / Poopdeck Pappy", "Dinky"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15520   Expand The All-New Popeye Hour   (1978) User Score Overview The All-New Popeye Hour is an animated television series produced by Hanna-Barbera Productions and King Features Syndicate. Starring the popular comic strip character Popeye, the series aired from 1978 to 1983 on CBS. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daws Butler Wimpy Allan Melvin Bluto Marilyn Schreffler Olive Oyl / Sea Hag / Swee'Pea Jack Mercer Popeye / Poopdeck Pappy Frank Welker Dinky Full Cast & Crew Last Season Season 3 1980 | 9 Episodes Season 3 of The All-New Popeye Hour premiered on September  8, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1980-10-04 Heathcliff 5.0    1977-09-10 Captain Caveman and the Teen Angels 6.1    1995-09-09 The Sylvester & Tweety Mysteries 7.3    1986-09-22 Dennis the Menace 5.6    1988-04-01 Denver, the Last Dinosaur 6.5    1975-09-06 The Tom and Jerry Show 7.6    1991-09-07 Taz-Mania 6.3    1960-11-14 Popeye the Sailor 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 14 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}