{"link": "https://www.themoviedb.org/tv/12612?language=en", "title": "Roary the Racing Car", "resume": "Roary the Racing Car is a South Korean animated children's television show that currently airs on Disney Junior in South Korea, Milkshake! on Channel 5 and Nick Jr. in the United Kingdom, Treehouse TV in Canada, Discovery Kids in Latin America, Nick Jr. and ABC2 in Australia and PBS Sprout in the US. Produced by Chapman Entertainment and HiT Entertainment, the producers of Fifi and the Flowertots and Bob the Builder, Also produced by Iconix Entertainment, Educational Broadcasting System and Seoul, the producers of Tayo the Little Bus, Also produced by Contender Entertainment Group and Hibbert Ralph TV, the producers of Tractor Tom, It follows the adventures of Roary and his race car friends at Silver Hatch race track. Roary is a red racing car shaped similarly to a grand prix car. He lives at the Silver Hatch racing circuit.", "rate": 0, "genre": ["Animation", "Kids"], "cast": ["Peter Kay", "Kerry Shale", "Tim Whitnall"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12612   Expand Roary the Racing Car   (2007) User Score Overview Roary the Racing Car is a South Korean animated children's television show that currently airs on Disney Junior in South Korea, Milkshake! on Channel 5 and Nick Jr. in the United Kingdom, Treehouse TV in Canada, Discovery Kids in Latin America, Nick Jr. and ABC2 in Australia and PBS Sprout in the US. Produced by Chapman Entertainment and HiT Entertainment, the producers of Fifi and the Flowertots and Bob the Builder, Also produced by Iconix Entertainment, Educational Broadcasting System and Seoul, the producers of Tayo the Little Bus, Also produced by Contender Entertainment Group and Hibbert Ralph TV, the producers of Tractor Tom, It follows the adventures of Roary and his race car friends at Silver Hatch race track. Roary is a red racing car shaped similarly to a grand prix car. He lives at the Silver Hatch racing circuit. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Kay Kerry Shale Tim Whitnall Full Cast & Crew Last Season Season 2 2010 | 52 Episodes Season 2 of Roary the Racing Car premiered on May 11, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Roary the Racing Car. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification AL Meaning Not harmful / All Ages. Type  Scripted Original Language  English Runtime  10m Homepage  - Genres Animation Kids Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 valurth t 1 tatooinestar 1 forkbeard 1 DUNDERTRiX  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}