{"link": "https://www.themoviedb.org/tv/62811?language=en", "title": "The Seventies", "resume": "A documentary series focusing on the ongoing Vietnam War, the Watergate scandal, evolving music industry, the Iran Hostage Crisis, the sexual revolution, and the rise of foreign and domestic terrorism.", "rate": 82, "genre": ["Documentary"], "cast": ["Walter Cronkite", "Dan Rather", "Tom Hanks", "David Brinkley", "Chris Connelly"], "character": ["Himself", "himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62811   Expand The Seventies   (2015) User Score Overview A documentary series focusing on the ongoing Vietnam War, the Watergate scandal, evolving music industry, the Iran Hostage Crisis, the sexual revolution, and the rise of foreign and domestic terrorism. Featured Crew Tom Hanks Creator Gary Goetzman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Walter Cronkite Himself Dan Rather himself Tom Hanks Himself David Brinkley Himself Chris Connelly Himself Full Cast & Crew Last Season Miniseries 2015 | 8 Episodes Season 1 of The Seventies premiered on June 11, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2014-05-29 The Sixties 7.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.cnn.com/shows/the-seventies Genres Documentary Keywords vietnam war 1970s nostalgia miniseries Content Score 93 Almost there... Top Contributors 31 Elizabeth Jennings TB 11 TMDb Bot R 8 Rebecca 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}