{"link": "https://www.themoviedb.org/tv/62475?language=en", "title": "Heidi", "resume": "Knee-high to a grasshopper, Heidi, a young orphan brunette with curly hair and the face of an angel, is brought by her aunt to the Swiss Alps to live with her grand-father, a silent and solitary old man. Taking up the challenges of her new existence, she will display all her strength and natural resources to find her rightful place in a sometimes harsh and unfriendly environment. Whether in the magnificent mountain settings with Peter, the goatherd or shut away in a big mansion in Frankfurt with Clara, a disabled girl confined to a wheelchair, Heidi will learn the priceless value of friendship and mutual help. Like a ray of sunshine, Heidi lights up and soothes the hearts of people and animals around her, inspiring them with her enthusiastic, generous and wonderful zest for life. The essence of a positive heroine, Heidi goes through life in the present without ever losing her innocence and her free-spirited manners.", "rate": 68, "genre": ["Animation", "Family", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62475   Expand Heidi   (2015) User Score  Play Trailer Overview Knee-high to a grasshopper, Heidi, a young orphan brunette with curly hair and the face of an angel, is brought by her aunt to the Swiss Alps to live with her grand-father, a silent and solitary old man. Taking up the challenges of her new existence, she will display all her strength and natural resources to find her rightful place in a sometimes harsh and unfriendly environment. Whether in the magnificent mountain settings with Peter, the goatherd or shut away in a big mansion in Frankfurt with Clara, a disabled girl confined to a wheelchair, Heidi will learn the priceless value of friendship and mutual help. Like a ray of sunshine, Heidi lights up and soothes the hearts of people and animals around her, inspiring them with her enthusiastic, generous and wonderful zest for life. The essence of a positive heroine, Heidi goes through life in the present without ever losing her innocence and her free-spirited manners. Featured Crew Christel Gonnard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 39 Episodes Season 1 of Heidi premiered on April  6, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Heidi. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.studio100animation.net/series/heidi/ Genres Animation Family Kids Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 16 Elizabeth Jennings m 8 mcxpert S 7 SalocinFree w 7 waRhawK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}