{"link": "https://www.themoviedb.org/tv/67666?language=en", "title": "Three Times Manon", "resume": "After going before the judge for the third time, 15-year old Manon is placed in a reform centre for six months. Challenged by her own uncontrollable temper, and the bureaucracy of the institution, will this be Manon’s last chance at redemption?", "rate": 0, "genre": ["Drama"], "cast": ["Alba Gaïa Bellugi", "Marina Foïs", "Théo Cholbi", "Déborah François"], "character": ["Manon Vidal", "Monique", "Buno", "Jennifer Bressan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67666   Expand Three Times Manon   (2014) User Score Overview After going before the judge for the third time, 15-year old Manon is placed in a reform centre for six months. Challenged by her own uncontrollable temper, and the bureaucracy of the institution, will this be Manon’s last chance at redemption? Featured Crew Jean-Xavier de Lestrade Creator Antoine Lacomblez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alba Gaïa Bellugi Manon Vidal Marina Foïs Monique Théo Cholbi Buno Déborah François Jennifer Bressan Full Cast & Crew Last Season Manon 20 ans 2017 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Three Times Manon. You can help by rating TV shows you've seen. Facts Original Name  Manon Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  52m Homepage   http://arte.tv/fr/videos/RC-011193/3-x-manon-et-manon-20-ans/ Genres Drama Keywords parent child relationship violence troubled teen Content Score 93 Almost there... Top Contributors 38 Banana 28 Jazzmind 11 Super.Synock r 5 r0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}