{"link": "https://www.themoviedb.org/tv/616?language=en", "title": "A Question of Sport", "resume": "A Question of Sport is a long-running BBC quiz show which started on 2 December 1968 and continues to this day. It is currently recorded at MediaCityUK in Salford Quays. It has been recorded in Manchester since the programme's inception at various studios including Dickenson Road Studios, then New Broadcasting House and was more recently shared between Granada Studios and BBC Television Centre, until moving full-time to MediaCityUK.\nIt involves two teams of sports stars answering questions on their own and other sports. Each team has a resident captain, each of whom is joined by two stars of the sports world. Having run almost uninterrupted since 1970, the show is now Britain's longest continuously-running game show with 1000 episodes. On 8 January 2010 episode No. 885 was a celebration episode of A QoS's 40th birthday.\nThe teams in the 1,000th episode which aired on 4 March 2013 which was won by Phil Tufnell were made up of current and former captains and comprised Bill Beaumont, Ally McCoist on Phil Tufnell's team and John Parrott and Willie Carson on Matt Dawson's team.", "rate": 65, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 616   Expand A Question of Sport User Score Overview A Question of Sport is a long-running BBC quiz show which started on 2 December 1968 and continues to this day. It is currently recorded at MediaCityUK in Salford Quays. It has been recorded in Manchester since the programme's inception at various studios including Dickenson Road Studios, then New Broadcasting House and was more recently shared between Granada Studios and BBC Television Centre, until moving full-time to MediaCityUK. It involves two teams of sports stars answering questions on their own and other sports. Each team has a resident captain, each of whom is joined by two stars of the sports world. Having run almost uninterrupted since 1970, the show is now Britain's longest continuously-running game show with 1000 episodes. On 8 January 2010 episode No. 885 was a celebration episode of A QoS's 40th birthday. The teams in the 1,000th episode which aired on 4 March 2013 which was won by Phil Tufnell were made up of current and former captains and comprised Bill Beaumont, Ally McCoist on Phil Tufnell's team and John Parrott and Willie Carson on Matt Dawson's team. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season season 45 2015 | 2 Episodes Season 45 of A Question of Sport premiered on August 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/questionofsport Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 2 Banana 2 ubed EF 1 Ellin F. Samanta 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}