{"link": "https://www.themoviedb.org/tv/62178?language=en", "title": "Billy & Billie", "resume": "Billy & Billie centers on two young adults as they fall in love. They face the usual barrage of attention from their friends and family, and the normal anxieties that come at the start of a new relationship-all further complicated by the fact that they're stepbrother and sister.", "rate": 79, "genre": ["Comedy", "Drama"], "cast": ["Adam Brody", "Lisa Joyce", "Gia Crovatin", "Jake Lacy", "Victor Slezak"], "character": ["Billy Jones", "Billie Smith", "Drew", "Keith", "James Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62178   Expand Billy & Billie   (2015) User Score Overview Billy & Billie centers on two young adults as they fall in love. They face the usual barrage of attention from their friends and family, and the normal anxieties that come at the start of a new relationship-all further complicated by the fact that they're stepbrother and sister. Featured Crew Neil LaBute Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Brody Billy Jones Lisa Joyce Billie Smith Gia Crovatin Drew Jake Lacy Keith Victor Slezak James Jones Full Cast & Crew Last Season Season 1 2015 | 11 Episodes Season 1 of Billy & Billie premiered on March  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2016-10-31 Stan Against Evil 6.7    2015-01-14 Man Seeking Woman 6.7    2015-10-07 Casual 6.5    2015-04-26 HAPPYish 6.9    2014-04-22 Faking It 5.3    2015-09-29 The Grinder 6.6    2016-10-27 The Great Indoors 5.3    2016-02-19 Love 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://billyandbillie.directv.com/ Genres Comedy Drama Keywords relationship step siblings family affairs love drama Content Score 93 Almost there... Top Contributors 33 Nero Kosonen 11 Elizabeth Jennings R 7 Rebecca 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}