{"link": "https://www.themoviedb.org/tv/77059?language=en", "title": "Trauma", "resume": "A three-part drama set in the trauma unit of a London hospital, a grieving father blames a high-achieving trauma consultant for the death of his teenage son.", "rate": 70, "genre": ["Drama"], "cast": ["Adrian Lester", "John Simm", "Lyndsey Marshal", "Rowena King", "Jade Anouka"], "character": ["Jon Allerton", "Dan Bowker", "Susie Bowker", "Lisa Allerton", "Alana Allerton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77059   Expand Trauma   (2018) User Score  Play Trailer Overview A three-part drama set in the trauma unit of a London hospital, a grieving father blames a high-achieving trauma consultant for the death of his teenage son. Featured Crew Mike Bartlett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrian Lester Jon Allerton John Simm Dan Bowker Lyndsey Marshal Susie Bowker Rowena King Lisa Allerton Jade Anouka Alana Allerton Full Cast & Crew Current Season Season 1 2018 | 3 Episodes Season 1 of Trauma premiered on February 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Trauma. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage   http://www.itv.com/hub/trauma Genres Drama Keywords obsession stalker revenge murder bereavement stalking psychological thriller class differences medical drama corporate negligence Content Score 100 Yes! Looking good! Top Contributors 26 Markxist 21 Elizabeth Jennings 7 Ash c 5 crkvice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}