{"link": "https://www.themoviedb.org/tv/17519?language=en", "title": "Zeke and Luther", "resume": "Zeke and Luther is an American Disney XD animated sitcom about two best friends setting their sights on becoming the world's greatest skateboarders. The show stars Hutch Dano, Adam Hicks, Daniel Curtis Lee and Ryan Newman. Zeke and Luther is set in the northern part of Gilroy, California, specifically in the fictional area of Pacific Terrace, which is stated frequently throughout the series. Gilroy was also mentioned occasionally in the Disney Channel series Even Stevens, which was also created by Zeke and Luther co-creator Matt Dearborn. The episode \"Bros Go Pro\" was made available to download for free on iTunes in the beginning of June, two weeks before the show's television premiere. The series premiered on June 15, 2009 in the U.S.\nOn August 2, 2010, it was announced that Zeke and Luther had been renewed for a third season which premiered on February 28, 2011. On June 18, 2011, in an interview with Deadline.com, Matt Dearborn confirmed that the show's third season would be its last. The show is currently Disney XD's longest running original series and first to make it to a third season. The one-hour series finale aired on April 2, 2012.", "rate": 15, "genre": ["Comedy"], "cast": ["Ryan Newman", "Adam Hicks", "Nate Hartley", "Juliet Holland-Rose", "Hutch Dano"], "character": ["Ginger Falcone", "Luther Jerome Waffles", "Oswald \"Ozzie\" Kepphart", "Olivia Masterson", "Ezekiel \"Zeke\" Falcone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17519   Expand Zeke and Luther   (2009) User Score  Play Trailer Overview Zeke and Luther is an American Disney XD animated sitcom about two best friends setting their sights on becoming the world's greatest skateboarders. The show stars Hutch Dano, Adam Hicks, Daniel Curtis Lee and Ryan Newman. Zeke and Luther is set in the northern part of Gilroy, California, specifically in the fictional area of Pacific Terrace, which is stated frequently throughout the series. Gilroy was also mentioned occasionally in the Disney Channel series Even Stevens, which was also created by Zeke and Luther co-creator Matt Dearborn. The episode \"Bros Go Pro\" was made available to download for free on iTunes in the beginning of June, two weeks before the show's television premiere. The series premiered on June 15, 2009 in the U.S. On August 2, 2010, it was announced that Zeke and Luther had been renewed for a third season which premiered on February 28, 2011. On June 18, 2011, in an interview with Deadline.com, Matt Dearborn confirmed that the show's third season would be its last. The show is currently Disney XD's longest running original series and first to make it to a third season. The one-hour series finale aired on April 2, 2012. Featured Crew Matt Dearborn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Newman Ginger Falcone Adam Hicks Luther Jerome Waffles Nate Hartley Oswald \"Ozzie\" Kepphart Juliet Holland-Rose Olivia Masterson Hutch Dano Ezekiel \"Zeke\" Falcone Full Cast & Crew Last Season Season 3 2011 | 26 Episodes Season 3 of Zeke and Luther premiered on February 27, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Zeke: Happy Birthday Hutch Dano! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2010-11-07 Shake It Up 2.8    2012-10-12 Dog With a Blog 5.3    2011-09-30 Jessie 6.3    2011-12-02 Austin & Ally 5.8    2010-04-04 Good Luck Charlie 5.8    2008-04-18 Ben 10: Alien Force 6.1    2013-07-19 Liv and Maddie 6.1    2005-01-09 Zoey 101 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://disneyxd.disney.com/zeke-and-luther Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors w 11 wonder2wonder 6 Victor 5 lineker 4 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}