{"link": "https://www.themoviedb.org/tv/3607?language=en", "title": "You Can't Do That on Television", "resume": "You Can't Do That on Television is a Canadian television program that first aired locally in 1979 before airing internationally in 1981. It featured pre-teen and teenaged actors in a sketch comedy format. Each episode had a theme. The show was notable for launching the careers of many performers, including Alanis Morissette, and writer Bill Prady, who would write and produce shows like The Big Bang Theory, Gilmore Girls and Dharma and Greg.\nThe show was produced by and aired on Ottawa's CTV station CJOH-TV. After production ended in 1990, the show continued in reruns on Nickelodeon through 1994, when it was replaced with the similar All That. The show is synonymous with Nick, and was at that time extremely popular, with the highest ratings overall on the channel. The show is also well known for introducing the network's iconic slime.\nThe program is the subject of the 2004 feature-length documentary, You Can't Do That on Film, directed by David Dillehunt.", "rate": 78, "genre": ["Comedy"], "cast": ["Christine McGlade", "Les Lye", "Adam Greydon Reid", "Lisa Ruddy", "Alasdair Gillis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3607   Expand You Can't Do That on Television   (1979) User Score Overview You Can't Do That on Television is a Canadian television program that first aired locally in 1979 before airing internationally in 1981. It featured pre-teen and teenaged actors in a sketch comedy format. Each episode had a theme. The show was notable for launching the careers of many performers, including Alanis Morissette, and writer Bill Prady, who would write and produce shows like The Big Bang Theory, Gilmore Girls and Dharma and Greg. The show was produced by and aired on Ottawa's CTV station CJOH-TV. After production ended in 1990, the show continued in reruns on Nickelodeon through 1994, when it was replaced with the similar All That. The show is synonymous with Nick, and was at that time extremely popular, with the highest ratings overall on the channel. The show is also well known for introducing the network's iconic slime. The program is the subject of the 2004 feature-length documentary, You Can't Do That on Film, directed by David Dillehunt. Featured Crew Roger Price Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christine McGlade Les Lye Adam Greydon Reid Lisa Ruddy Alasdair Gillis Full Cast & Crew Last Season Season 11 2004 | 1 Episode Season 11 of You Can't Do That on Television premiered on July 21, 2004. View All Seasons Social Reviews  1 Discussions  0 T A review by Thomaxz  8.0 Written by  Thomaxz  on March 12, 2017 This old commedey series, is pretty fun, when you get to know some gags, like the slime when the \"actor\" \"says\" -''I don't know' It has been the kickstarter on Nickeleodeon, and problay also where the slime part, which you still can see in Kids Choice Award. If you do not know, this old series, give it a try. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1985-09-07 Small Wonder 7.0    1963-09-24 Petticoat Junction 5.7    1986-09-17 Head of the Class 6.3    1975-12-16 One Day at a Time 6.6    1959-10-04 Dennis, The Menace 6.9    1999-09-19 Judging Amy 7.1    1975-01-18 The Jeffersons 6.7    1970-09-24 The Odd Couple 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.ycdtotv.com/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 1 Banana 1 Wesley Rome  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}