{"link": "https://www.themoviedb.org/tv/63929?language=en", "title": "The Village: Achiara's Secret", "resume": "Achiara is a quiet, peaceful village with hardly any crime. But on her first day of school there, English language instructor Kim So-yoon discovers a buried corpse. As the townspeople speculate on the identity of the dead person and the reason she was killed, So-yoon and policeman Park Woo-jae become determined to solve the mystery.", "rate": 76, "genre": ["Mystery"], "cast": ["Moon Geun-Young", "Yook Sung-jae", "Shin Eun-kyung", "On Ju-wan", "Jang Hee-jin"], "character": ["Kim So-yoon", "Park Woo-jae", "Yoon Ji-sook", "Seo Ki-hyun", "Kim Hye-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63929   Expand The Village: Achiara's Secret   (2015) User Score Overview Achiara is a quiet, peaceful village with hardly any crime. But on her first day of school there, English language instructor Kim So-yoon discovers a buried corpse. As the townspeople speculate on the identity of the dead person and the reason she was killed, So-yoon and policeman Park Woo-jae become determined to solve the mystery. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Moon Geun-Young Kim So-yoon Yook Sung-jae Park Woo-jae Shin Eun-kyung Yoon Ji-sook On Ju-wan Seo Ki-hyun Jang Hee-jin Kim Hye-jin Full Cast & Crew Last Season Season 1 2015 | 16 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  5 Posters  6 Recommendations   2015-01-19 Shine or Go Crazy 7.0    2014-05-05 Doctor Stranger 7.3    2013-12-09 The Prime Minister and I 7.1    2015-10-05 Six Flying Dragons 7.8    2016-06-17 Squad 38 7.7    2016-01-11 Moorim School 6.2    2016-01-04 Cheese in the Trap 7.0    2016-05-02 Another Miss Oh 7.8  Facts Original Name  마을 - 아치아라의 비밀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000008599 Genres Mystery Keywords police korea school teacher murder investigation murder mystery Content Score 93 Almost there... Top Contributors t 53 tmdb38202327 M 17 Maria180493 12 Elizabeth Jennings 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}