{"link": "https://www.themoviedb.org/tv/12733?language=en", "title": "Born and Bred", "resume": "Born and Bred is a light-hearted British drama series that aired on BBC One from 2002 to 2005. Created by Chris Chibnall and Nigel McCrery, Born and Bred's cast was led by James Bolam and Michael French, who play a father and son who run a cottage hospital in Ormston, a fictional Lancashire village in the 1950s. Bolam and French's characters are later replaced by characters played by Richard Wilson and Oliver Milburn.", "rate": 70, "genre": ["Comedy", "Drama"], "cast": ["Jenna Russell", "Ross Little", "Clive Swift", "Tracey Childs", "Maggie Steed"], "character": ["Deborah Gilder", "Michael Gilder", "Reverend Brewer", "Linda Cosgrove", "Phyllis Woolf"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12733   Expand Born and Bred   (2002) User Score Overview Born and Bred is a light-hearted British drama series that aired on BBC One from 2002 to 2005. Created by Chris Chibnall and Nigel McCrery, Born and Bred's cast was led by James Bolam and Michael French, who play a father and son who run a cottage hospital in Ormston, a fictional Lancashire village in the 1950s. Bolam and French's characters are later replaced by characters played by Richard Wilson and Oliver Milburn. Featured Crew Nigel McCrery Creator Chris Chibnall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jenna Russell Deborah Gilder Ross Little Michael Gilder Clive Swift Reverend Brewer Tracey Childs Linda Cosgrove Maggie Steed Phyllis Woolf Full Cast & Crew Last Season (2002) season 4 2005 | 10 Episodes Season 4 of Born and Bred premiered on June  1, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Born and Bred. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 55m Homepage   http://www.bbc.co.uk/drama/bornandbred/ Genres Comedy Drama Keywords northern england rural setting hospital doctor english countryside 1950s Content Score 93 Almost there... Top Contributors 15 Banana 6 kcdh O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}