{"link": "https://www.themoviedb.org/tv/10048?language=en", "title": "Reading Rainbow", "resume": "Reading Rainbow was an American children's television series that aired on PBS from June 6, 1983, until November 10, 2006, that encouraged reading by children.\nThe public television series garnered over 200 broadcast awards, including a Peabody Award and 26 Emmy Awards, 11 of which were in the \"Outstanding Children's Series\" category. The series was created under the leadership of Cecily Truett Lancit and Larry Lancit, at Lancit Media Productions in New York. The concept of a reading series for children originated with Twila Liggett, Ph.D., and Paul Schupbach, of the Great Plains National Instructional Television Library at the University of Nebraska–Lincoln; and Tony Buttino, of WNED-TV Buffalo, New York. The original team included Lynne Brenner Ganek, Ellen Schecter, and host LeVar Burton.\nEach episode centered on a theme from a book, or other children's literature, which was explored through a number of segments or stories. The show also recommended books for kids to look for when they went to the library. It is the third-longest running children's series in PBS history, after Mister Rogers' Neighborhood and Sesame Street. It was also one of the first PBS shows to be broadcast in stereo.", "rate": 91, "genre": ["Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10048   Expand Reading Rainbow   (1983) User Score Overview Reading Rainbow was an American children's television series that aired on PBS from June 6, 1983, until November 10, 2006, that encouraged reading by children. The public television series garnered over 200 broadcast awards, including a Peabody Award and 26 Emmy Awards, 11 of which were in the \"Outstanding Children's Series\" category. The series was created under the leadership of Cecily Truett Lancit and Larry Lancit, at Lancit Media Productions in New York. The concept of a reading series for children originated with Twila Liggett, Ph.D., and Paul Schupbach, of the Great Plains National Instructional Television Library at the University of Nebraska–Lincoln; and Tony Buttino, of WNED-TV Buffalo, New York. The original team included Lynne Brenner Ganek, Ellen Schecter, and host LeVar Burton. Each episode centered on a theme from a book, or other children's literature, which was explored through a number of segments or stories. The show also recommended books for kids to look for when they went to the library. It is the third-longest running children's series in PBS history, after Mister Rogers' Neighborhood and Sesame Street. It was also one of the first PBS shows to be broadcast in stereo. Featured Crew Cecily Truett Lancit Creator Larry Lancit Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 1988 | 2 Episodes Season 5 of Reading Rainbow premiered on August 15, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   Mister Rogers' Neighborhood 8.1    1984-11-05 Muppet Babies 7.2    1986-09-13 Pee-wee's Playhouse 7.9    1983-09-19 Wheel of Fortune 7.3    1992-07-25 TaleSpin 7.3    1990-09-10 Captain Planet and the Planeteers 5.9    1986-09-17 Head of the Class 6.3    1990-09-14 Tiny Toon Adventures 7.3  Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Kids Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors D 8 Doramius 6 TheOneManBoxOffice L 2 Lucas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}