{"link": "https://www.themoviedb.org/tv/31713?language=en", "title": "Street Fighter II: V", "resume": "Street Fighter II: V, is an anime series based on the fighting game Street Fighter II. Directed by Gisaburo Sugii, the series first aired in Japan in 1995, from April 10 to November 27, on YTV. An English adaptation of the series was produced by the dubbing group Animaze and Manga Entertainment in 1996, and was released in Australia and the USA on VHS in 1997 - 1998. In 1997, ADV Films produced an English dub exclusively for the UK market and was released on VHS. The Animaze/Manga dub had a DVD release on April 29, 2003 in a four disc set in North America.", "rate": 70, "genre": ["Animation"], "cast": ["Chisa Yokoyama", "Kenji Utsumi", "Kōji Tsujitani", "Kenji Haga", "Tesshou Genda"], "character": ["Chun-Li", "M. Bison", "Ryu", "Ken Masters", "Guile"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31713   Expand Street Fighter II: V   (1995) User Score Overview Street Fighter II: V, is an anime series based on the fighting game Street Fighter II. Directed by Gisaburo Sugii, the series first aired in Japan in 1995, from April 10 to November 27, on YTV. An English adaptation of the series was produced by the dubbing group Animaze and Manga Entertainment in 1996, and was released in Australia and the USA on VHS in 1997 - 1998. In 1997, ADV Films produced an English dub exclusively for the UK market and was released on VHS. The Animaze/Manga dub had a DVD release on April 29, 2003 in a four disc set in North America. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chisa Yokoyama Chun-Li Kenji Utsumi M. Bison Kōji Tsujitani Ryu Kenji Haga Ken Masters Tesshou Genda Guile Full Cast & Crew Last Season Street fighter ii: v season 1 1995 | 29 Episodes Season 1 of Street Fighter II: V premiered on April 10, 1995. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Street Fighter II: V. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   1992-10-10 Yu Yu Hakusho 7.7    1986-10-11 Saint Seiya 8.0  Facts Original Name  ストリートファイターII V Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 Elizabeth Jennings 5 nass600 5 BlackDelivery z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}