{"link": "https://www.themoviedb.org/tv/7714?language=en", "title": "True Jackson, VP", "resume": "True Jackson, VP is an American television sitcom that aired on Nickelodeon from November 8, 2008 to August 20, 2011. The series starred Keke Palmer, Ashley Argota, Matt Shively, Danielle Bisutti, Greg Proops, Robbie Amell and Ron Butler. The theme song was written by Toby Gad and Keke Palmer and is performed by Palmer. The series was shot in front of a live studio audience, which is mentioned at the start of each episode.\nThe pilot episode garnered 4.8 million viewers on its first airing and set network records among kids 6-11, adolescents 9-14 and several other demos, airing after the iCarly three-part episode \"iGo to Japan\" The show premiered on Nickelodeon UK on May 25, 2009 and on Nickelodeon Latin America on August 3, 2009.\nThe one-hour episode entitled \"Mystery in Peru\" completed the 34 ordered episodes for season 2, after it aired on August 20, 2011. Keke Palmer posted a video on her YouTube account and posted on her blog confirming that \"Mystery in Peru\" is the series finale.", "rate": 64, "genre": [], "cast": ["Keke Palmer", "Robbie Amell", "Danielle Bisutti", "Matt Shively", "Ashley Argota"], "character": ["True Jackson", "Jimmy Madigan", "Amanda Cantwell", "Ryan Leslie Laserbeam", "Lulu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7714   Expand True Jackson, VP   (2008) User Score Overview True Jackson, VP is an American television sitcom that aired on Nickelodeon from November 8, 2008 to August 20, 2011. The series starred Keke Palmer, Ashley Argota, Matt Shively, Danielle Bisutti, Greg Proops, Robbie Amell and Ron Butler. The theme song was written by Toby Gad and Keke Palmer and is performed by Palmer. The series was shot in front of a live studio audience, which is mentioned at the start of each episode. The pilot episode garnered 4.8 million viewers on its first airing and set network records among kids 6-11, adolescents 9-14 and several other demos, airing after the iCarly three-part episode \"iGo to Japan\" The show premiered on Nickelodeon UK on May 25, 2009 and on Nickelodeon Latin America on August 3, 2009. The one-hour episode entitled \"Mystery in Peru\" completed the 34 ordered episodes for season 2, after it aired on August 20, 2011. Keke Palmer posted a video on her YouTube account and posted on her blog confirming that \"Mystery in Peru\" is the series finale. Featured Crew Andy Gordon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keke Palmer True Jackson Robbie Amell Jimmy Madigan Danielle Bisutti Amanda Cantwell Matt Shively Ryan Leslie Laserbeam Ashley Argota Lulu Full Cast & Crew Last Season Season 2 2009 | 34 Episodes Season 2 of True Jackson, VP premiered on November 14, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Ryan: Happy Birthday Matt Shively! Open 0 by wonder2wonder\n      \n     w True Jackson: Happy Birthday Keke Palmer! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2009-09-12 The Troop 8.0    2009-11-06 Fanboy and Chum Chum 2.0    2009-11-28 Big Time Rush 4.9    2012-10-12 Dog With a Blog 5.3    2004-09-07 Ned's Declassified School Survival Guide 5.7    2008-09-26 The Suite Life on Deck 6.1    2001-01-12 Lizzie McGuire 5.6    1996-07-15 Kenan & Kel 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.nick.com/shows/truejacksonvp/index.jhtml Genres No genres have been added. Keywords teenager fashion Content Score 86 Almost there... Top Contributors w 6 wonder2wonder 3 Elizabeth Jennings s 3 speedycars 2 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}