{"link": "https://www.themoviedb.org/tv/8863?language=en", "title": "Vandread", "resume": "Vandread is a Japanese anime series directed by Takeshi Mori and created by Gonzo and Media Factory animation studios.\nThe series is composed of two seasons, each composed of thirteen episodes of twenty-five minutes. The first series is summarized in the Vandread Taidouhen OVA in 2001, and the second in the Vandread Gekitouhen OVA, released in 2002. There is a Vandread Extra Stage Novel, that explains the events after Vandread: The Second Stage. Along with acquiring the two original series from Geneon, Funimation also licensed the two OVAs.", "rate": 60, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Michiko Neya", "Hideki Tasaka", "Yuu Asakawa", "Tomokazu Seki", "Megumi Toyoguchi"], "character": ["Barnette Orangello", "Duelo McFile", "Jura Basil Elden", "Bart Garsus", "Parfet Balblair"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8863   Expand Vandread   (2000) User Score Overview Vandread is a Japanese anime series directed by Takeshi Mori and created by Gonzo and Media Factory animation studios. The series is composed of two seasons, each composed of thirteen episodes of twenty-five minutes. The first series is summarized in the Vandread Taidouhen OVA in 2001, and the second in the Vandread Gekitouhen OVA, released in 2002. There is a Vandread Extra Stage Novel, that explains the events after Vandread: The Second Stage. Along with acquiring the two original series from Geneon, Funimation also licensed the two OVAs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michiko Neya Barnette Orangello Hideki Tasaka Duelo McFile Yuu Asakawa Jura Basil Elden Tomokazu Seki Bart Garsus Megumi Toyoguchi Parfet Balblair Full Cast & Crew Last Season (jp) season 2 2001 | 13 Episodes Season 2 of Vandread premiered on October  5, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Vandread. You can help by rating TV shows you've seen. Facts Original Name  ヴァンドレッド Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Comedy Keywords anime Content Score 86 Almost there... Top Contributors M 12 Migi m 3 magoozin f 2 franfac A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}