{"link": "https://www.themoviedb.org/tv/3925?language=en", "title": "Ghostwriter", "resume": "Ghostwriter is an American television program created by Liz Nealon and produced by the Children's Television Workshop and BBC One. It began airing on PBS on October 4, 1992, and the final episode aired on February 13, 1995. The series revolves around a close knit circle of friends from Brooklyn who solve neighborhood crimes and mysteries as a team of young detectives with the help of an invisible ghost named Ghostwriter. Ghostwriter can communicate with the kids only by manipulating whatever text and letters he can find and using them to form words and sentences. The series was filmed on location in Fort Greene, Brooklyn.", "rate": 70, "genre": ["Mystery"], "cast": ["Marcella Lowery", "William Hernandez", "Blaze Berdahl", "Todd Alexander Cohen", "Melissa Gonzalez"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3925   Expand Ghostwriter   (1992) User Score Overview Ghostwriter is an American television program created by Liz Nealon and produced by the Children's Television Workshop and BBC One. It began airing on PBS on October 4, 1992, and the final episode aired on February 13, 1995. The series revolves around a close knit circle of friends from Brooklyn who solve neighborhood crimes and mysteries as a team of young detectives with the help of an invisible ghost named Ghostwriter. Ghostwriter can communicate with the kids only by manipulating whatever text and letters he can find and using them to form words and sentences. The series was filmed on location in Fort Greene, Brooklyn. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marcella Lowery William Hernandez Blaze Berdahl Todd Alexander Cohen Melissa Gonzalez Full Cast & Crew Last Season Season 3 1994 | 13 Episodes Season 3 of Ghostwriter premiered on October  2, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ghostwriter. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Mystery Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 2 TMDb Bot 1 Harrison-Callifrax n 1 nostalgia90kids  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}