{"link": "https://www.themoviedb.org/tv/73000?language=en", "title": "The Miniaturist", "resume": "A woman moves to live with her new husband in 17th century Amsterdam, but soon discovers that not everything is what it seems. Based on the adaptation by Jessie Burton.", "rate": 78, "genre": ["Drama", "Mystery"], "cast": ["Anya Taylor-Joy", "Romola Garai", "Hayley Squires", "Paapa Essiedu", "Ziggy Heath"], "character": ["Petronella Brandt", "Marin Brandt", "Cornelia", "Otto", "Jack Philips"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73000   Expand The Miniaturist   (2017) User Score Overview A woman moves to live with her new husband in 17th century Amsterdam, but soon discovers that not everything is what it seems. Based on the adaptation by Jessie Burton. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anya Taylor-Joy Petronella Brandt Romola Garai Marin Brandt Hayley Squires Cornelia Paapa Essiedu Otto Ziggy Heath Jack Philips Full Cast & Crew Current Season Season 1 2017 | 2 Episodes Season 1 of The Miniaturist premiered on December 25, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Miniaturist. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b09lgqs7 Genres Drama Mystery Keywords based on novel or book amsterdam miniseries 17th century Content Score 86 Almost there... Top Contributors 25 Elizabeth Jennings 13 Sergiojamon t 11 tmdb63030631 7 EveDemocracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}