{"link": "https://www.themoviedb.org/tv/61527?language=en", "title": "Gatchaman Crowds", "resume": "Tachikawa, Japan, is a \"second metropolis\" of Tokyo, protected by the Gatchaman, warriors who fight in special reinforced suits powered by the manifestation of their spiritual powers called NOTE. When the energetic and cheerful Hajime Ichinose becomes their newest member, the Gatchaman must deal with Berg Katze, an enigmatic alien creature bent on destroying Earth just like it did with several other planets in the past.", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Maaya Uchida", "Ryota Ohsaka", "Daisuke Hosomi", "Namikawa Daisuke", "Kotori Koiwai"], "character": ["Hajime Ichinose (voice)", "Sugane Tachibana (voice)", "O.D. (voice)", "Jou Hibiki (voice)", "Utsu-tsu Miya (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61527   Expand Gatchaman Crowds   (2013) User Score Overview Tachikawa, Japan, is a \"second metropolis\" of Tokyo, protected by the Gatchaman, warriors who fight in special reinforced suits powered by the manifestation of their spiritual powers called NOTE. When the energetic and cheerful Hajime Ichinose becomes their newest member, the Gatchaman must deal with Berg Katze, an enigmatic alien creature bent on destroying Earth just like it did with several other planets in the past. Featured Crew Kenji Nakamura Creator Toshiya Ôno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maaya Uchida Hajime Ichinose (voice) Ryota Ohsaka Sugane Tachibana (voice) Daisuke Hosomi O.D. (voice) Namikawa Daisuke Jou Hibiki (voice) Kotori Koiwai Utsu-tsu Miya (voice) Full Cast & Crew Last Season Gatchaman Crowds insight 2015 | 13 Episodes Season 2 of Gatchaman Crowds premiered on July  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gatchaman Crowds. You can help by rating TV shows you've seen. Facts Original Name  ガッチャマン クラウズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.ntv.co.jp/GATCHAMAN_Crowds/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords secret organization anarchy social media Content Score 100 Yes! Looking good! Top Contributors 69 Indi S 16 SuperTouch z 5 zurman1 5 kazuza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}