{"link": "https://www.themoviedb.org/tv/17784?language=en", "title": "Arabela", "resume": "Arabela was a children's television series produced in Czechoslovakia which aired from 1979 to 1981. The series has 13 episodes and is in the Czech language.", "rate": 83, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Jana Nagyová", "Vladimír Dlouhý", "Vladimír Menšík", "Jiří Lábus", "Stella Zázvorková"], "character": ["Prinzessin Arabella", "Peter Maier", "Karl Majer", "Rumburak", "Vera Maier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17784   Expand Arabela   (1980) User Score Overview Arabela was a children's television series produced in Czechoslovakia which aired from 1979 to 1981. The series has 13 episodes and is in the Czech language. Featured Crew Václav Vorlíček Creator Miloš Macourek Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  13 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jana Nagyová Prinzessin Arabella Vladimír Dlouhý Peter Maier Vladimír Menšík Karl Majer Jiří Lábus Rumburak Stella Zázvorková Vera Maier Full Cast & Crew Last Season Season 1 1980 | 13 Episodes Season 1 of Arabela premiered on December 25, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Arabela. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  8 Recommendations   2005-01-01 Hercules 5.3    1993-01-20 Time Trax 6.6    2007-01-21 The Dresden Files 6.7  Facts Status  Ended Networks Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  Czech Runtime  30m Homepage   http://www.ceskatelevize.cz/porady/898281-arabela/ Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors x 45 xPR j 27 jzvc 22 triks h 10 hubalda68  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}