{"link": "https://www.themoviedb.org/tv/44457?language=en", "title": "Vegas", "resume": "Ralph Lamb wants to be left in peace to run his ranch, but Las Vegas is now swelling with outsiders and corruption which are intruding on his simple life. Recalling Lamb's command as a military police officer during World War II, the Mayor appeals to his sense of duty to look into a murder of a casino worker – and so begins Lamb’s clash with Vincent Savino, a ruthless Chicago gangster who plans to make Vegas his own.", "rate": 74, "genre": ["Western", "Drama"], "cast": ["Dennis Quaid", "Michael Chiklis", "Carrie-Anne Moss", "Jason O'Mara", "Taylor Handley"], "character": ["Sheriff Ralph Lamb", "Vincent Savino", "Katherine O'Connell", "Deputy Jack Lamb", "Deputy Dixon Lamb"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44457   Expand Vegas   (2012) User Score Overview Ralph Lamb wants to be left in peace to run his ranch, but Las Vegas is now swelling with outsiders and corruption which are intruding on his simple life. Recalling Lamb's command as a military police officer during World War II, the Mayor appeals to his sense of duty to look into a murder of a casino worker – and so begins Lamb’s clash with Vincent Savino, a ruthless Chicago gangster who plans to make Vegas his own. Featured Crew Nicholas Pileggi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dennis Quaid Sheriff Ralph Lamb Michael Chiklis Vincent Savino Carrie-Anne Moss Katherine O'Connell Jason O'Mara Deputy Jack Lamb Taylor Handley Deputy Dixon Lamb Full Cast & Crew Last Season Season 1 2012 | 21 Episodes Season 1 of Vegas premiered on September 25, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1999-01-10 The PJs 7.4    2007-03-15 Raines 7.3    2010-09-22 The Defenders 7.0    2008-06-01 In Plain Sight 7.0    2015-02-18 X Company 7.4    2014-02-06 The After 8.2    2012-03-30 Magic City 6.7    2013-02-19 Cult 4.2  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://cbs.com/shows/vegas Genres Western Drama Keywords sheriff gangster las vegas period drama 1960s Content Score 93 Almost there... Top Contributors 34 Banana 4 Zlogorek 4 rantamplan w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}