{"link": "https://www.themoviedb.org/tv/4480?language=en", "title": "Eyes", "resume": "Eyes is an ABC television series starring Tim Daly as Harlan Judd. Eyes follows the firm of Judd Risk Management which uses marginally legal means to investigate individuals and crimes where law enforcement would fall short. With the help of high-tech gadgets, Harlan Judd and his employees recover money for victims as well as investigate individuals for clients but still manage to keep plenty of secrets from one another.\nIn May 2005, having rescheduled the sixth episode twice, ABC announced that they would not be airing the remaining episodes until June at the earliest. They later announced that it would not be picked up for a second season and that the remaining episodes would remain unaired.\nNew Zealand television station TV2 picked up this show and aired the complete series, all twelve episodes, in the second half of 2005. These episodes appeared online via BitTorrent soon after. The show was also partially aired on Singapore television station Mediacorp Channel 5, with the pilot episode and episodes #106 to #112 being skipped. Episode #111 was an exception, and was aired as the fifth episode. The show was also aired in full on France cable television station Canal Jimmy in 2006. In the beginning of 2008 the show was aired in full on Polish television station TVN 7. The series was shown on the Nine Network in Australia in 2007.", "rate": 78, "genre": ["Drama"], "cast": ["Eric Mabius", "Laura Leighton", "A. J. Langer", "Tim Daly", "Rick Worthy"], "character": ["Jeff McCann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4480   Expand Eyes   (2005) User Score Overview Eyes is an ABC television series starring Tim Daly as Harlan Judd. Eyes follows the firm of Judd Risk Management which uses marginally legal means to investigate individuals and crimes where law enforcement would fall short. With the help of high-tech gadgets, Harlan Judd and his employees recover money for victims as well as investigate individuals for clients but still manage to keep plenty of secrets from one another. In May 2005, having rescheduled the sixth episode twice, ABC announced that they would not be airing the remaining episodes until June at the earliest. They later announced that it would not be picked up for a second season and that the remaining episodes would remain unaired. New Zealand television station TV2 picked up this show and aired the complete series, all twelve episodes, in the second half of 2005. These episodes appeared online via BitTorrent soon after. The show was also partially aired on Singapore television station Mediacorp Channel 5, with the pilot episode and episodes #106 to #112 being skipped. Episode #111 was an exception, and was aired as the fifth episode. The show was also aired in full on France cable television station Canal Jimmy in 2006. In the beginning of 2008 the show was aired in full on Polish television station TVN 7. The series was shown on the Nine Network in Australia in 2007. Featured Crew John McNamara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Mabius Jeff McCann Laura Leighton A. J. Langer Tim Daly Rick Worthy Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Eyes premiered on March 30, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Eyes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords stolen money crime investigation Content Score 93 Almost there... Top Contributors 3 Banana D 2 Daniel i 2 ismax935 T 1 Thuresson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}