{"link": "https://www.themoviedb.org/tv/43967?language=en", "title": "Girls und Panzer", "resume": "In this world, Sensha-do (戦車道), the art of tank-combat, is a traditional Japanese martial art for girls. Miho, a girl who just transferred into the Ōrai Girls' Academy in Ibaraki Prefecture, has been ordered by the academy's student council chairperson to join the school team and compete in the national Sensha-do championships.", "rate": 64, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Mai Fuchigami", "Yuka Iguchi", "Kayano Ai", "Ikumi Nakagami", "Mami Ozaki"], "character": ["Miho Nishizumi", "Mako Reizei", "Saori Takebe", "Yukari Akiyama", "Hana Isuzu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43967   Expand  Girls und Panzer   (2012) User Score Overview In this world, Sensha-do (戦車道), the art of tank-combat, is a traditional Japanese martial art for girls. Miho, a girl who just transferred into the Ōrai Girls' Academy in Ibaraki Prefecture, has been ordered by the academy's student council chairperson to join the school team and compete in the national Sensha-do championships. Featured Crew Actas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mai Fuchigami Miho Nishizumi Yuka Iguchi Mako Reizei Kayano Ai Saori Takebe Ikumi Nakagami Yukari Akiyama Mami Ozaki Hana Isuzu Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of  Girls und Panzer premiered on October  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2012-07-08 Kokoro Connect 7.0    2007-04-08 Lucky Star 5.0    2009-07-03 Monogatari 7.7    2009-04-03 K-ON! 7.5    2010-10-03 Oreimo 7.1    2011-04-15 Anohana: The Flower We Saw That Day 7.6    2007-07-05 Higurashi When They Cry 7.6    2013-10-04 Kill la Kill 7.7  Facts Original Name  ガールズ&パンツァー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://girls-und-panzer.jp/ Genres Action & Adventure Animation Comedy Keywords tank slice of life school anime Content Score 93 Almost there... Top Contributors c 16 cijah F 9 Fireworks 7 Yodev 6 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}