{"link": "https://www.themoviedb.org/tv/45039?language=en", "title": "Tayo the Little Bus", "resume": "Tayo the Little Bus is a South Korean computer-generated animated television series created by Educational Broadcasting System, Iconix Entertainment, Seoul and Hot Animation which is owned by HiT Entertainment. The Korean-dubbed series began airing on EBS in 2010 and the English-dubbed series aired on Disney Junior in 2012. The latter is also scheduled to air on Disney Channel and Cartoonito in 2013. The narrator of the UK series is Michael Angelis who also narrates the UK series of Thomas & Friends.", "rate": 10, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45039   Expand Tayo the Little Bus User Score Overview Tayo the Little Bus is a South Korean computer-generated animated television series created by Educational Broadcasting System, Iconix Entertainment, Seoul and Hot Animation which is owned by HiT Entertainment. The Korean-dubbed series began airing on EBS in 2010 and the English-dubbed series aired on Disney Junior in 2012. The latter is also scheduled to air on Disney Channel and Cartoonito in 2013. The narrator of the UK series is Michael Angelis who also narrates the UK series of Thomas & Friends. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2017 | 26 Episodes Season 4 of Tayo the Little Bus premiered on April 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Original Name  꼬마 버스 타요 Status  Returning Series Network EBS 1 Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 28 Rome wasn't built in a day... Top Contributors a 7 asura766 4 Banana s 4 sheva_vitali c 2 camplus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}