{"link": "https://www.themoviedb.org/tv/72820?language=en", "title": "I'm Sorry", "resume": "Andrea is a seemingly confident comedy writer, wife and mom, who comically exposes her inner immaturity and neuroses through unexpected life situations.", "rate": 77, "genre": ["Comedy"], "cast": ["Andrea Savage", "Tom Everett Scott", "Jason Mantzoukas", "Kathy Baker", "Olive Petrucci"], "character": ["Andrea", "Mike", "Kyle", "Sharon", "Amelia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72820   Expand I'm Sorry   (2017) User Score  Play Trailer Overview Andrea is a seemingly confident comedy writer, wife and mom, who comically exposes her inner immaturity and neuroses through unexpected life situations. Featured Crew Andrea Savage Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrea Savage Andrea Tom Everett Scott Mike Jason Mantzoukas Kyle Kathy Baker Sharon Olive Petrucci Amelia Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of I'm Sorry premiered on July 12, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Anyone watching? Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I'm Sorry. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.trutv.com/shows/im-sorry/index.html Genres Comedy Keywords writer Content Score 100 Yes! Looking good! Top Contributors k 25 kyz03 7 Elizabeth Jennings b 6 bugfix 3 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}