{"link": "https://www.themoviedb.org/tv/11745?language=en", "title": "The Magician", "resume": "The Magician is an American television series that ran during the 1973–1974 season. It starred Bill Bixby as stage illusionist Anthony \"Tony\" Blake, a playboy philanthropist who used his skills to solve difficult crimes as needed. In the series pilot, the character was instead named Anthony Dorian. The name change was due to a conflict with the name of a real life stage magician.", "rate": 71, "genre": ["Drama"], "cast": ["Bill Bixby", "Joseph Sirola", "Keene Curtis", "Mark Hamill", "William Shatner"], "character": ["Anthony Dorian", "Dominick", "Max Pomeroy", "Ian Keefer", "Ed Cassidy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11745   Expand The Magician   (1973) User Score Overview The Magician is an American television series that ran during the 1973–1974 season. It starred Bill Bixby as stage illusionist Anthony \"Tony\" Blake, a playboy philanthropist who used his skills to solve difficult crimes as needed. In the series pilot, the character was instead named Anthony Dorian. The name change was due to a conflict with the name of a real life stage magician. Featured Crew Bruce Lansbury Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Bixby Anthony Dorian Joseph Sirola Dominick Keene Curtis Max Pomeroy Mark Hamill Ian Keefer William Shatner Ed Cassidy Full Cast & Crew Last Season Season 1 1973 | 21 Episodes Season 1 of The Magician premiered on October  2, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1975-01-17 Baretta 6.9    1967-03-28 Ironside 6.8    1976-10-03 Quincy, M.E. 7.0    1973-10-24 Kojak 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords magic crime investigation Content Score 79 Pump it up! We're close now. Top Contributors 12 Banana S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}