{"link": "https://www.themoviedb.org/tv/14408?language=en", "title": "Popples", "resume": "Popples was a Saturday morning cartoon, based on the Popples toys, that aired in the United States from 1986 to 1987. The pilot was a live-action Shelley Duvall special, in which they were puppets and marionettes; after this was well-received, it was decided to make a cartoon series with the same characters. The cartoon was produced by DIC Entertainment and LBS Communications in association with The Maltese Companies.\nLike the toys they're based on, the Popples resemble colorful teddy bears or rabbits with long, pompom-tipped tails, and they have pouches on their backs that can be everted so they resemble fuzzy balls. The name \"Popple\" is a reference to the popping sound they make when unfolding themselves from such a ball, or pulling objects from their pouches. In the cartoon Popples commonly pull large items from their pouches that couldn't possibly fit inside, which come from hammerspace; in \"Popples Alley\", one of the Popples' human friends looks inside one of their pouches and sees numerous objects floating in a void.\nNine of the Popples live with a human brother and sister, Billy and Bonnie Wagner. Billy and Bonnie think they are the only kids who have Popples until a neighbor family moves in and they have their own Popples — the Rock Stars, Pufflings, and Babies. The Popples tend to come around and mess up whatever the kids are trying to do; e.g., if the kids are trying to brush their teeth, the Popples end up spilling water, toothpaste and soap all over the bathroom. If the kids are trying to clean their rooms, the Popples come along, mess up the room even worse and then help them get everything back to normal just in the nick of time. The plot revolved around the children's efforts to hide the existence of the Popples from the adults around them.", "rate": 50, "genre": ["Animation"], "cast": ["Louise Vallance", "Danny Mann", "Maurice LaMarche", "Valri Bromfield", "Jeannie Elias"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14408   Expand Popples   (1986) User Score Overview Popples was a Saturday morning cartoon, based on the Popples toys, that aired in the United States from 1986 to 1987. The pilot was a live-action Shelley Duvall special, in which they were puppets and marionettes; after this was well-received, it was decided to make a cartoon series with the same characters. The cartoon was produced by DIC Entertainment and LBS Communications in association with The Maltese Companies. Like the toys they're based on, the Popples resemble colorful teddy bears or rabbits with long, pompom-tipped tails, and they have pouches on their backs that can be everted so they resemble fuzzy balls. The name \"Popple\" is a reference to the popping sound they make when unfolding themselves from such a ball, or pulling objects from their pouches. In the cartoon Popples commonly pull large items from their pouches that couldn't possibly fit inside, which come from hammerspace; in \"Popples Alley\", one of the Popples' human friends looks inside one of their pouches and sees numerous objects floating in a void. Nine of the Popples live with a human brother and sister, Billy and Bonnie Wagner. Billy and Bonnie think they are the only kids who have Popples until a neighbor family moves in and they have their own Popples — the Rock Stars, Pufflings, and Babies. The Popples tend to come around and mess up whatever the kids are trying to do; e.g., if the kids are trying to brush their teeth, the Popples end up spilling water, toothpaste and soap all over the bathroom. If the kids are trying to clean their rooms, the Popples come along, mess up the room even worse and then help them get everything back to normal just in the nick of time. The plot revolved around the children's efforts to hide the existence of the Popples from the adults around them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louise Vallance Danny Mann Maurice LaMarche Valri Bromfield Jeannie Elias Full Cast & Crew Last Season Season 1 1986 | 42 Episodes Season 1 of Popples premiered on September 13, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Popples. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors c 5 chloris77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}