{"link": "https://www.themoviedb.org/tv/19780?language=en", "title": "Please Teacher!", "resume": "Kusanagi Kei, a high-school student living with his aunt and uncle, has an encounter with a female alien. This alien is revealed to be a new teacher at his school. Later, he is forced to marry this alien to preserve her secrets. From there, various romantically-inclined problems crop up repeatedly.", "rate": 48, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Rei Sakuma", "Ayako Kawasumi", "Tomoko Kaneda", "Kikuko Inoue", "Satomi Kōrogi"], "character": ["Konoha Edajima", "Koishi Herikawa", "Marie", "Mizuho Kazami", "Maho Kazami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19780   Expand Please Teacher!   (2002) User Score Overview Kusanagi Kei, a high-school student living with his aunt and uncle, has an encounter with a female alien. This alien is revealed to be a new teacher at his school. Later, he is forced to marry this alien to preserve her secrets. From there, various romantically-inclined problems crop up repeatedly. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rei Sakuma Konoha Edajima Ayako Kawasumi Koishi Herikawa Tomoko Kaneda Marie Kikuko Inoue Mizuho Kazami Satomi Kōrogi Maho Kazami Full Cast & Crew Last Season Season 1 2002 | 12 Episodes Season 1 of Please Teacher! premiered on January 10, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Please Teacher!. You can help by rating TV shows you've seen. Facts Original Name  おねがい ティーチャー Status  Ended Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  Japanese Runtime  22m Homepage  - Genres Animation Comedy Drama Keywords high school love triangle alien anime Content Score 86 Almost there... Top Contributors 24 Ailurus Fulgens W 6 Wiruss s 3 sheva_vitali m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}