{"link": "https://www.themoviedb.org/tv/3554?language=en", "title": "The Parkers", "resume": "The Parkers is an American sitcom that aired on UPN from August 30, 1999, to May 10, 2004. A spin-off of UPN's Moesha, The Parkers features the mother-daughter team of Nikki and Kim Parker. The Parkers' signature \"Heeyyy\" greeting became very popular in the early 2000s.", "rate": 53, "genre": ["Comedy"], "cast": ["Mo'Nique", "Countess Vaughn", "Jenna von Oy", "Ken Lawson", "Yvette Wilson"], "character": ["Nicole Ann \"Nikki\" Oglevee", "Kimberly Ann \"Kim\" Parker", "Stevie Alison Van Lowe", "Tyrell Thadeus Radcliff", "Andell Wilkerson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3554   Expand The Parkers   (1999) User Score Overview The Parkers is an American sitcom that aired on UPN from August 30, 1999, to May 10, 2004. A spin-off of UPN's Moesha, The Parkers features the mother-daughter team of Nikki and Kim Parker. The Parkers' signature \"Heeyyy\" greeting became very popular in the early 2000s. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mo'Nique Nicole Ann \"Nikki\" Oglevee Countess Vaughn Kimberly Ann \"Kim\" Parker Jenna von Oy Stevie Alison Van Lowe Ken Lawson Tyrell Thadeus Radcliff Yvette Wilson Andell Wilkerson Full Cast & Crew Last Season Season 5 2003 | 19 Episodes Season 5 of The Parkers premiered on September 15, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Kimberly: Happy Birthday Countess Vaughn! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2001-09-03 One on One 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords parent child relationship college black family sitcom black sitcom adult in college Content Score 71 Just a little bit more... Top Contributors 12 Banana w 4 wonder2wonder t 3 tmdb98495582 1 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}