{"link": "https://www.themoviedb.org/tv/70910?language=en", "title": "Youn's Kitchen", "resume": "Follow the cast in their journey to Gili Trawangan, a tropical island in Indonesia, where they open a pop-up restaurant for 10 days. Viewers can see the heartwarming struggles the actors go through to start their business, enjoy the gorgeous island backdrop, and laugh at the humorous situations that arise throughout the show.", "rate": 93, "genre": ["Reality"], "cast": ["Youn Yuh-jung", "Lee Seo-jin", "Jung Yu-mi", "Park Seo-jun"], "character": ["Herself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70910   Expand Youn's Kitchen   (2017) User Score Overview Follow the cast in their journey to Gili Trawangan, a tropical island in Indonesia, where they open a pop-up restaurant for 10 days. Viewers can see the heartwarming struggles the actors go through to start their business, enjoy the gorgeous island backdrop, and laugh at the humorous situations that arise throughout the show. Featured Crew Na Young-seok Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Youn Yuh-jung Herself Lee Seo-jin Himself Jung Yu-mi Herself Park Seo-jun Himself Full Cast & Crew Current Season Season 2 2018 | 11 Episodes Season 2 of Youn's Kitchen premiered on January  5, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   2009-12-18 The Qin Empire 8.2  Facts Original Name  윤식당 Status  Returning Series Network Certification  - Type  Reality Original Language  Korean Runtime  80m Homepage   http://program.tving.com/tvn/younskitchen2 Genres Reality Keywords restaurant Content Score 100 Yes! Looking good! Top Contributors 48 Kyuhwan Kim c 19 ctchim M 8 Maria180493 6 korcad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}