{"link": "https://www.themoviedb.org/tv/2121?language=en", "title": "ReBoot", "resume": "ReBoot is a Canadian CGI-animated action-adventure cartoon series that originally aired from 1994 to 2001. It was produced by Vancouver-based production company Mainframe Entertainment, Alliance Communications, BLT Productions and created by Gavin Blair, Ian Pearson, Phil Mitchell and John Grace, with the visuals designed by Brendan McCarthy after an initial attempt by Ian Gibson.\nIt was the first half-hour, completely computer-animated TV series.", "rate": 82, "genre": ["Animation", "Action", "Adventure"], "cast": ["Sharon Alexander", "Paul Dobson", "Andrea Libman", "Christopher Gray", "Matthew Sinclair"], "character": ["Bob (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2121   Expand ReBoot   (1994) User Score Overview ReBoot is a Canadian CGI-animated action-adventure cartoon series that originally aired from 1994 to 2001. It was produced by Vancouver-based production company Mainframe Entertainment, Alliance Communications, BLT Productions and created by Gavin Blair, Ian Pearson, Phil Mitchell and John Grace, with the visuals designed by Brendan McCarthy after an initial attempt by Ian Gibson. It was the first half-hour, completely computer-animated TV series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sharon Alexander Paul Dobson Bob (Voice) Andrea Libman Christopher Gray Matthew Sinclair Full Cast & Crew Last Season Season 4 2001 | 11 Episodes Season 4 of ReBoot premiered on October 19, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   1996-09-16 Beast Wars: Transformers 7.7    1983-09-12 G.I. Joe 8.0    1992-09-11 Eek! The Cat 6.8    1989-09-09 Captain N: The Game Master 5.6    1987-03-31 Max Headroom 6.6    2000-09-09 Jackie Chan Adventures 7.1    1983-09-17 Dungeons & Dragons 7.6    1994-09-10 The Tick 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.reboot.com/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 11 Norrin_Radd_Of_Zenn_La 6 Travis Bell m 3 mrastarot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}