{"link": "https://www.themoviedb.org/tv/62128?language=en", "title": "The Kitchen", "resume": "The lives of different families and how they cook different meals for each other.", "rate": 35, "genre": [], "cast": ["Sunny Anderson", "Katie Lee", "Jeff Mauro", "Marcela Valladolid", "Geoffrey Zakarian"], "character": ["Herself - Co-Hostess", "Herself - Co-Hostess", "Himself - Co-Host", "Herself - Co-Hostess", "Himself - Co-Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62128   Expand The Kitchen   (2014) User Score Overview The lives of different families and how they cook different meals for each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sunny Anderson Herself - Co-Hostess Katie Lee Herself - Co-Hostess Jeff Mauro Himself - Co-Host Marcela Valladolid Herself - Co-Hostess Geoffrey Zakarian Himself - Co-Host Full Cast & Crew Last Season Season 6 2015 | 13 Episodes Season 6 of The Kitchen premiered on May  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Kitchen. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.foodnetwork.com/shows/the-kitchen.html Genres No genres have been added. Keywords cooking food Content Score 79 Pump it up! We're close now. Top Contributors 36 Elizabeth Jennings TB 12 TMDb Bot LC 5 Legit Corporation 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}