{"link": "https://www.themoviedb.org/tv/67583?language=en", "title": "Black Market: Dispatches", "resume": "In this global series presented by Michael K. Williams, we embed ourselves inside criminal enterprises to see how contraband moves across borders, and explore the politics behind a hidden economy nearly as big as the one you know.", "rate": 0, "genre": ["Documentary"], "cast": ["Michael Kenneth Williams"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67583   Expand Black Market: Dispatches   (2016) User Score Overview In this global series presented by Michael K. Williams, we embed ourselves inside criminal enterprises to see how contraband moves across borders, and explore the politics behind a hidden economy nearly as big as the one you know. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Kenneth Williams Himself - Host Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Black Market: Dispatches premiered on August 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Black Market: Dispatches. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  30m, 24m Homepage   https://www.viceland.com/en_us/show/black-market-dispatches Genres Documentary Keywords black market contraband Content Score 56 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings A 1 Aukland BH 1 Budi Hideung s 1 suka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}