{"link": "https://www.themoviedb.org/tv/12504?language=en", "title": "SilverHawks", "resume": "SilverHawks is an American animated television series developed by Rankin/Bass Productions and distributed by Lorimar-Telepictures in 1986. The animation was provided by Japanese studio Pacific Animation Corporation. In total, 65 episodes were made. It was created as a space-bound equivalent of their previous series, ThunderCats.\nAs was the case with ThunderCats, there was also a SilverHawks comic book series published by then-Marvel Comics imprint Star Comics.\nCurrently, Warner Bros. owns the rights to the series.", "rate": 71, "genre": ["Animation", "Action", "Adventure"], "cast": ["Bob McFadden", "Earl Hammond", "Maggie Wheeler", "Peter Newman", "Adolph Caesar"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12504   Expand SilverHawks   (1986) User Score Overview SilverHawks is an American animated television series developed by Rankin/Bass Productions and distributed by Lorimar-Telepictures in 1986. The animation was provided by Japanese studio Pacific Animation Corporation. In total, 65 episodes were made. It was created as a space-bound equivalent of their previous series, ThunderCats. As was the case with ThunderCats, there was also a SilverHawks comic book series published by then-Marvel Comics imprint Star Comics. Currently, Warner Bros. owns the rights to the series. Featured Crew Ted Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Bob McFadden Earl Hammond Maggie Wheeler Peter Newman Adolph Caesar Full Cast & Crew Last Season Season 1 1986 | 65 Episodes Season 1 of SilverHawks premiered on September  8, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   1986-09-08 Defenders of the Earth 7.2    1976-04-27 The Bugs Bunny/Road Runner Show 8.3    1986-04-07 The Centurions 8.0    1980-10-04 Thundarr the Barbarian 6.3    1986-09-15 Rambo 5.7    1989-09-19 Doogie Howser, M.D. 5.7    1985-09-09 She-Ra: Princess of Power 6.2    1985-09-01 Jayce and The Wheeled Warriors 6.8  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors J 5 JohnyB0y 5 Rafaelasauani 4 Robson Guedes Vieira 3 theramyz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}