{"link": "https://www.themoviedb.org/tv/57391?language=en", "title": "HAPPYish", "resume": "Thom Payne is a 44 year-old man whose world is thrown into disarray when his 25 year-old \"wunderkind\" boss arrives, saying things like \"digital,\" \"social\" and \"viral.\" Is he in need of a \"rebranding,\" or does he just have a \"low joy ceiling?\" Maybe pursuing happiness is a fool's errand? Happiness after all is pretty high bar. In a world as absurd as ours, maybe the best anyone can hope for is happyish.", "rate": 69, "genre": ["Drama", "Comedy"], "cast": ["Steve Coogan", "Kathryn Hahn", "Bradley Whitford", "Ellen Barkin", "Carrie Preston"], "character": ["Thom Payne", "Lee Payne", "Jonathan Cooke", "Dani Kirschenbloom", "Debbie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57391   Expand HAPPYish   (2015) User Score  Play Trailer Overview Thom Payne is a 44 year-old man whose world is thrown into disarray when his 25 year-old \"wunderkind\" boss arrives, saying things like \"digital,\" \"social\" and \"viral.\" Is he in need of a \"rebranding,\" or does he just have a \"low joy ceiling?\" Maybe pursuing happiness is a fool's errand? Happiness after all is pretty high bar. In a world as absurd as ours, maybe the best anyone can hope for is happyish. Featured Crew Shalom Auslander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Coogan Thom Payne Kathryn Hahn Lee Payne Bradley Whitford Jonathan Cooke Ellen Barkin Dani Kirschenbloom Carrie Preston Debbie Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of HAPPYish premiered on April 26, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply r Coogan has to be 60ish. Open 0 by rolanddoobie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2013-08-05 Quick Draw 6.3    2015-12-24 Dawn of the Croods 6.6    2011-02-08 Traffic Light 7.2    2015-08-25 Fried 6.0    2014-04-28 Heartless 5.9    2016-08-02 Borderline 7.1    2015-01-11 Togetherness 6.0    2016-06-02 Hibana: Spark 7.8  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.sho.com/sho/happyish/home Genres Drama Comedy Keywords depression dark comedy Content Score 100 Yes! Looking good! Top Contributors 49 Elizabeth Jennings 8 Banana 5 lineker z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}