{"link": "https://www.themoviedb.org/tv/7547?language=en", "title": "The Cleaner", "resume": "After hitting rock-bottom from his own addictions during the birth of his twins, William Banks strikes a tentative deal with God. In exchange for a second chance, he vows to kick his addictions and dedicate his life to helping others. Now, along with his unconventional team, he helps people get clean from their own addictions of sex, drugs, alcohol and gambling by any means necessary.", "rate": 69, "genre": ["Drama"], "cast": ["Benjamin Bratt", "Grace Park", "Esteban Powell", "Amy Price-Francis"], "character": ["William Banks", "Akani Cuesta", "Arnie Swenton", "Melissa Banks"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7547   Expand The Cleaner   (2008) User Score Overview After hitting rock-bottom from his own addictions during the birth of his twins, William Banks strikes a tentative deal with God. In exchange for a second chance, he vows to kick his addictions and dedicate his life to helping others. Now, along with his unconventional team, he helps people get clean from their own addictions of sex, drugs, alcohol and gambling by any means necessary. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benjamin Bratt William Banks Grace Park Akani Cuesta Esteban Powell Arnie Swenton Amy Price-Francis Melissa Banks Full Cast & Crew Last Season Season 2 2009 | 13 Episodes Season 2 of The Cleaner premiered on June 23, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Cleaner. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.aetv.com/the-cleaner/ Genres Drama Keywords addiction drug rehab los angeles recovering drug addict recovery Content Score 86 Almost there... Top Contributors 67 Banana 3 Tifar T 3 Ticktock s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}