{"link": "https://www.themoviedb.org/tv/72504?language=en", "title": "Battle Girl High School: Battle Girl Project", "resume": "Based on COLOPL's school action role-playing game. Set in the year 2045. The world has been contaminated by Irousu (mysterious invaders who suddenly appeared), and humans find themselves restricted and contained. Standing boldly against these invaders are ordinary girls everywhere, without a powerful army or even weapons.", "rate": 100, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72504   Expand Battle Girl High School: Battle Girl Project   (2017) User Score Overview Based on COLOPL's school action role-playing game. Set in the year 2045. The world has been contaminated by Irousu (mysterious invaders who suddenly appeared), and humans find themselves restricted and contained. Standing boldly against these invaders are ordinary girls everywhere, without a powerful army or even weapons. Featured Crew Noriaki Akitaya Creator Kazuo Miyake Creator COLOPL Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Battle Girl High School: Battle Girl Project premiered on July  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Battle Girl High School: Battle Girl Project. You can help by rating TV shows you've seen. Facts Original Name  バトルガールハイスクール Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://colopl.co.jp/battlegirl-hs/anime/ Genres Animation Comedy Sci-Fi & Fantasy Keywords monster school life Content Score 64 We're so close, yet so far. Top Contributors D 16 Destr0y 11 sp1ti 7 Despair-Paradise f 4 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}