{"link": "https://www.themoviedb.org/tv/73581?language=en", "title": "Wormwood", "resume": "In this genre-bending tale, Errol Morris explores the mysterious death of a U.S. scientist entangled in a secret Cold War program known as MK-Ultra.", "rate": 58, "genre": ["Crime", "Documentary"], "cast": ["Peter Sarsgaard", "Tim Blake Nelson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73581   Expand Wormwood   (2017) User Score  Play Trailer Overview In this genre-bending tale, Errol Morris explores the mysterious death of a U.S. scientist entangled in a secret Cold War program known as MK-Ultra. Featured Crew Errol Morris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Sarsgaard Tim Blake Nelson Full Cast & Crew Current Season Season 1 2017 | 6 Episodes Season 1 of Wormwood premiered on December 15, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Boring Open 3 by  Benedict A deeply layered and thoughtful docuseries! Open 0 by Daddie0\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  4 Recommendations   2016-10-14 Goliath 7.8    2017-08-02 The Sinner 7.3    2017-07-21 Ozark 8.0    2015-08-28 Narcos 8.0    2011-12-04 Black Mirror 8.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  - Homepage   https://www.netflix.com/title/80059446 Genres Crime Documentary Keywords mind control cia docudrama human experiment Content Score 71 Just a little bit more... Top Contributors 37 Elizabeth Jennings s 11 sPOiDar Y 6 YJ 6 luftikus009  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}