{"link": "https://www.themoviedb.org/tv/63565?language=en", "title": "Casanova", "resume": "Exiled from his beloved Venice, Giacomo Casanova flees to Paris at the dawn of the Enlightenment in hopes of putting his reputation as a playboy behind him. But old habits die hard, and temptation is everywhere as Casanova finds a wealth of new opportunity... and trouble.  \nPart of Amazon's fall 2015 pilot season.  Currently only the pilot has been made.", "rate": 75, "genre": ["Drama"], "cast": ["Diego Luna", "Ben Daniels", "Laure Marsac", "Bojana Novaković", "Amelia Clarkson"], "character": ["Giacomo Casanova", "Francois-Joachim de Bernis", "Sylvia Balleti", "Madame Pompadour", "Manon Balletti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63565   Expand Casanova   (2015) User Score  Play Trailer Overview Exiled from his beloved Venice, Giacomo Casanova flees to Paris at the dawn of the Enlightenment in hopes of putting his reputation as a playboy behind him. But old habits die hard, and temptation is everywhere as Casanova finds a wealth of new opportunity... and trouble.   Part of Amazon's fall 2015 pilot season.  Currently only the pilot has been made. Featured Crew Stu Zicherman Creator Benjamin Silverman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diego Luna Giacomo Casanova Ben Daniels Francois-Joachim de Bernis Laure Marsac Sylvia Balleti Bojana Novaković Madame Pompadour Amelia Clarkson Manon Balletti Full Cast & Crew Last Season Season 1 2015 | 1 Episode Season 1 of Casanova premiered on August  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Casanova. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m Homepage   http://www.amazon.com/Casanova/dp/B01347VO0K Genres Drama Keywords paris casanova 18th century historical drama Content Score 100 Yes! Looking good! Top Contributors 21 Elizabeth Jennings 8 death72 6 senckyz 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}