{"link": "https://www.themoviedb.org/tv/3781?language=en", "title": "Too Close for Comfort", "resume": "Too Close for Comfort is an American television sitcom which ran on the ABC network from November 11, 1980 until May 5, 1983, and in first-run syndication from April 7, 1984 until September 27, 1986. It was modeled after the British series Keep It in the Family, which premiered nine months before Too Close for Comfort debuted in the U.S. Its name was changed to The Ted Knight Show when the show was retooled for its final season.", "rate": 64, "genre": ["Comedy"], "cast": ["Ted Knight", "Nancy Dussault", "Jim J. Bullock", "Deborah Van Valkenburgh", "Lydia Cornell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3781   Expand Too Close for Comfort   (1980) User Score Overview Too Close for Comfort is an American television sitcom which ran on the ABC network from November 11, 1980 until May 5, 1983, and in first-run syndication from April 7, 1984 until September 27, 1986. It was modeled after the British series Keep It in the Family, which premiered nine months before Too Close for Comfort debuted in the U.S. Its name was changed to The Ted Knight Show when the show was retooled for its final season. Featured Crew Brian Cooke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ted Knight Nancy Dussault Jim J. Bullock Deborah Van Valkenburgh Lydia Cornell Full Cast & Crew Last Season Season 6 1986 | 21 Episodes Season 6 of Too Close for Comfort premiered on April  5, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1996-09-16 Cosby 7.3    1978-09-18 WKRP in Cincinnati 8.1    1967-09-11 The Carol Burnett Show 7.8    1977-01-14 Fantasy Island 6.5    1976-01-27 Laverne & Shirley 6.7    2011-01-09 The Cape 4.3    1988-11-14 Murphy Brown 6.5    1995-03-21 NewsRadio 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords cartoonist Content Score 93 Almost there... Top Contributors 2 Steve TB 1 TMDb Bot 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}