{"link": "https://www.themoviedb.org/tv/34750?language=en", "title": "Xam'd: Lost Memories", "resume": "Set on a peaceful island during a violent terrorist attack, a young boy is suddenly transformed into a metal-cased mercenary. But with this great power comes even greater danger. Aiyuki must discover how to master this remarkable new power-or risk having this mysterious fusion of rock, metal and magic destroy him!", "rate": 60, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Michiko Neya", "Ayumi Fujimura", "Atsushi Abe", "Shinnosuke Tachibana", "Fumiko Orikasa"], "character": ["Sukakki Prois", "Midori Nishimura", "Akiyuki Takehara", "Furuichi Teraoka", "Haru Nishimura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34750   Expand Xam'd: Lost Memories   (2008) User Score Overview Set on a peaceful island during a violent terrorist attack, a young boy is suddenly transformed into a metal-cased mercenary. But with this great power comes even greater danger. Aiyuki must discover how to master this remarkable new power-or risk having this mysterious fusion of rock, metal and magic destroy him! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michiko Neya Sukakki Prois Ayumi Fujimura Midori Nishimura Atsushi Abe Akiyuki Takehara Shinnosuke Tachibana Furuichi Teraoka Fumiko Orikasa Haru Nishimura Full Cast & Crew Last Season Season 1 2008 | 26 Episodes Season 1 of Xam'd: Lost Memories premiered on September 23, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Xam'd: Lost Memories. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Xam'd: Lost Memories. You can help by rating TV shows you've seen. Facts Original Name  亡念のザムド Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.xamd.jp/ Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 35 kappa-papa TB 8 TMDb Bot 5 Marr 🇳🇱 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}