{"link": "https://www.themoviedb.org/tv/45213?language=en", "title": "Usagi Drop", "resume": "By force of circumstances, a 30-year-old single man with a full-time job suddenly starts raising a 6-year-old girl. While running each other ragged, the two of them gradually grow into a \"family\".", "rate": 83, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Hiroshi Tsuchida", "Ayu Matsuura"], "character": ["Daikichi Kawachi", "Rin Kaga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45213   Expand Usagi Drop   (2011) User Score Overview By force of circumstances, a 30-year-old single man with a full-time job suddenly starts raising a 6-year-old girl. While running each other ragged, the two of them gradually grow into a \"family\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Tsuchida Daikichi Kawachi Ayu Matsuura Rin Kaga Full Cast & Crew Last Season Season 1 2011 | 11 Episodes Season 1 of Usagi Drop premiered on July  8, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Usagi Drop. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations   2016-04-09 Tanaka-kun is Always Listless 8.0    2015-10-07 Beautiful Bones: Sakurako’s Investigation 6.3    2015-04-03 Food Wars!: Shokugeki no Soma 7.9    2014-07-11 Terror in Resonance 6.7    2016-06-30 Sweetness & Lightning 7.3    2014-01-05 Noragami 7.4    2016-01-08 ERASED 7.8    2013-04-04 The Devil Is a Part-Timer! 7.1  Facts Original Name  うさぎドロップ Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.usagi-drop.tv Genres Animation Comedy Drama Keywords adoptive father kindergarten coming of age slice of life aftercreditsstinger heart warming anime watercolour style josei Content Score 56 We're so close, yet so far. Top Contributors 108 Marr 🇳🇱 65 minusha97 33 Elizabeth Jennings 10 kappa-papa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}