{"link": "https://www.themoviedb.org/tv/61985?language=en", "title": "Hiding", "resume": "In order to survive, Lincoln Swift must take his family into witness protection and give evidence against his former employer, vicious crime boss Nils Vandenberg. With new names and fresh identities, the Swifts are ripped from their Gold Coast home and dumped in Western Sydney. But dislocation puts immense pressure on everyone in the family.", "rate": 43, "genre": ["Drama"], "cast": ["James Stewart", "Kate Jenkinson", "Lincoln Younes", "Olivia DeJonge", "Stephen Curry"], "character": ["Troy Quigg / Lincoln Swift", "Maree Quigg / Bec Swift", "Mitchell Quigg / Mitchell Swift", "Shaneen Quigg / Tara Swift", "John Pinder"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61985   Expand Hiding   (2015) User Score  Play Trailer Overview In order to survive, Lincoln Swift must take his family into witness protection and give evidence against his former employer, vicious crime boss Nils Vandenberg. With new names and fresh identities, the Swifts are ripped from their Gold Coast home and dumped in Western Sydney. But dislocation puts immense pressure on everyone in the family. Featured Crew Matt Ford Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Stewart Troy Quigg / Lincoln Swift Kate Jenkinson Maree Quigg / Bec Swift Lincoln Younes Mitchell Quigg / Mitchell Swift Olivia DeJonge Shaneen Quigg / Tara Swift Stephen Curry John Pinder Full Cast & Crew Last Season Series 1 2015 | 8 Episodes Season 1 of Hiding premiered on February  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hiding. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  55m Homepage   http://www.abc.net.au/tv/programs/hiding Genres Drama Keywords australia witness protection dysfunctional family crime drugs Content Score 100 Yes! Looking good! Top Contributors D 19 Dee 13 Elizabeth Jennings z 5 zurman1 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}