{"link": "https://www.themoviedb.org/tv/3746?language=en", "title": "Maya & Miguel", "resume": "Maya & Miguel is a children's television animated series for children aged 6–12 produced by Scholastic Studios. It appears on PBS as part of the PBS Kids Go! lineup and on the CBBC channel in the UK. On September 10, 2011, it started airing on Univision every Saturdays mornings on the block Planeta U. However, as of September 28, 2013, it was removed from the Univision block, Planeta U's Saturday morning lineup for a timeshot replacement for The Jungle Book. The Spanish version is \"Maya y Miguel\". The show ran from October 11, 2004 to October 10, 2007.\nCentering around the lives of pre-teen Hispanic twins named Maya and Miguel Santos and their friends, the program is aimed at promoting multiculturalism and education in general. It is geared to the 5-9 age range. Part of the dialogue in each episode in the English version is in Spanish but only individual words or phrases which are explained in English.\nThe program features well-known voice talent, including Candi Milo, Nika Frost, Erik Estrada, Lucy Liu, Carlos Ponce and Elizabeth Peña.\nThe TV show is close captioned by the National Captioning Institute when seen on PBS Kids in the USA like Sesame Street, Dragon Tales and Clifford the Big Red Dog.", "rate": 55, "genre": ["Animation"], "cast": ["Lucy Liu", "Carlos Alazraqui", "Carlos Ponce", "Elizabeth Peña", "Erik Estrada"], "character": ["Maggie Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3746   Expand Maya & Miguel   (2004) User Score Overview Maya & Miguel is a children's television animated series for children aged 6–12 produced by Scholastic Studios. It appears on PBS as part of the PBS Kids Go! lineup and on the CBBC channel in the UK. On September 10, 2011, it started airing on Univision every Saturdays mornings on the block Planeta U. However, as of September 28, 2013, it was removed from the Univision block, Planeta U's Saturday morning lineup for a timeshot replacement for The Jungle Book. The Spanish version is \"Maya y Miguel\". The show ran from October 11, 2004 to October 10, 2007. Centering around the lives of pre-teen Hispanic twins named Maya and Miguel Santos and their friends, the program is aimed at promoting multiculturalism and education in general. It is geared to the 5-9 age range. Part of the dialogue in each episode in the English version is in Spanish but only individual words or phrases which are explained in English. The program features well-known voice talent, including Candi Milo, Nika Frost, Erik Estrada, Lucy Liu, Carlos Ponce and Elizabeth Peña. The TV show is close captioned by the National Captioning Institute when seen on PBS Kids in the USA like Sesame Street, Dragon Tales and Clifford the Big Red Dog. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucy Liu Maggie Lee Carlos Alazraqui Carlos Ponce Elizabeth Peña Erik Estrada Full Cast & Crew Last Season Season 2 — | 5 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Maya & Miguel. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 IonutG  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}