{"link": "https://www.themoviedb.org/tv/66111?language=en", "title": "Macross Delta", "resume": "Macross Delta is set in the year 2067, 8 years after the events of  the latest Macross TV series, Macross Frontier. The story focuses on  Walküre, a team of talented idols and the Delta Squadron, a team of  experienced Valkyrie pilots as they battle against the Var Syndrome, a  mysterious phenomena that is consuming the galaxy and there is also the  mysterious Aerial Knights Valkyrie fighter team of the Kingdom of Wind.", "rate": 50, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Minori Suzuki", "Nozomi Nishida", "Kei Minegishi", "Yuuma Uchida", "Asami Seto"], "character": ["Freyja Wion", "Makina Nakajima", "Theo Jussila", "Hayate Immelman", "Mirage Farina Jenius"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66111   Expand Macross Delta   (2016) User Score Overview Macross Delta is set in the year 2067, 8 years after the events of  the latest Macross TV series, Macross Frontier. The story focuses on  Walküre, a team of talented idols and the Delta Squadron, a team of  experienced Valkyrie pilots as they battle against the Var Syndrome, a  mysterious phenomena that is consuming the galaxy and there is also the  mysterious Aerial Knights Valkyrie fighter team of the Kingdom of Wind. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minori Suzuki Freyja Wion Nozomi Nishida Makina Nakajima Kei Minegishi Theo Jussila Yuuma Uchida Hayate Immelman Asami Seto Mirage Farina Jenius Full Cast & Crew Last Season Season 1 2016 | 26 Episodes Season 1 of Macross Delta premiered on April  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Macross Delta. You can help by rating TV shows you've seen. Facts Original Name  マクロスΔ（デルタ） Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.macross.jp/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords music idol mecha anime Content Score 93 Almost there... Top Contributors d 32 donp971 20 sp1ti 4 Oriknox z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}