{"link": "https://www.themoviedb.org/tv/32609?language=en", "title": "Into the Universe with Stephen Hawking", "resume": "Hawking gives us the ultimate guide to the universe, a ripping yarn based on real science, spanning the whole of space and time -- from the nature of the universe itself, to the chances of alien life, and the real possibility of time travel.", "rate": 78, "genre": ["Documentary"], "cast": ["Stephen Hawking", "Benedict Cumberbatch", "Melissa Ricci"], "character": ["Himself", "Stephen Hawking", "Laura Jesson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32609   Expand Into the Universe with Stephen Hawking   (2010) User Score Overview Hawking gives us the ultimate guide to the universe, a ripping yarn based on real science, spanning the whole of space and time -- from the nature of the universe itself, to the chances of alien life, and the real possibility of time travel. Featured Crew Stephen Hawking Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Hawking Himself Benedict Cumberbatch Stephen Hawking Melissa Ricci Laura Jesson Full Cast & Crew Last Season Season 1 2010 | 3 Episodes Season 1 of Into the Universe with Stephen Hawking premiered on April 25, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  8 Recommendations   2001-07-22 Space 8.0    2010-04-25 How the Universe Works 8.0    2011-03-06 Wonders of the Universe 8.2    2007-05-29 The Universe 8.4    2010-03-07 Wonders of the Solar System 7.6    2010-06-09 Through the Wormhole 7.6    2011-08-07 Curiosity 7.2    2012-09-13 Stephen Hawking's Grand Design 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.discovery.com/tv-shows/other-shows/about-this-show/stephen-hawking-about/ Genres Documentary Keywords universe Content Score 64 We're so close, yet so far. Top Contributors TB 23 TMDb Bot H 14 Hard E 13 EightNine AS 10 Alexandre Simões de Carvalho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}