{"link": "https://www.themoviedb.org/tv/35358?language=en", "title": "Restaurant: Impossible", "resume": "Restaurant: Impossible is an American reality television program aired by the Food Network. It is jointly produced by Marc Summers and Shooters TV and stars British chef and restaurateur Robert Irvine, and premiered on January 19, 2011.\nIn each episode, Chef Robert Irvine is given the \"mission\" of making the impossible possible by renovating a failing restaurant in two days on a $10,000 budget. Irvine is assisted by HGTV designers Taniya Nayak, Vanessa De Leon, Krista Watterworth, Cheryl Torrenueva, Yvette Irene, Nicole Faccuito, or Lynn Keagan along with general contractor Tom Bury. After assessing the problems with the restaurant, Robert Irvine typically creates a plan for the new decor, oversees the cleaning of the restaurant, reduces the size of the menu and improves the food, develops a promotional activity, educates the restaurant's owners, or trains the staff as needed by each restaurant.\nCurrently, each episode opens with:\nPreviously, each episode opened with:\nThe series' sixth season began airing in April 2013.", "rate": 64, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35358   Expand Restaurant: Impossible   (2011) User Score Overview Restaurant: Impossible is an American reality television program aired by the Food Network. It is jointly produced by Marc Summers and Shooters TV and stars British chef and restaurateur Robert Irvine, and premiered on January 19, 2011. In each episode, Chef Robert Irvine is given the \"mission\" of making the impossible possible by renovating a failing restaurant in two days on a $10,000 budget. Irvine is assisted by HGTV designers Taniya Nayak, Vanessa De Leon, Krista Watterworth, Cheryl Torrenueva, Yvette Irene, Nicole Faccuito, or Lynn Keagan along with general contractor Tom Bury. After assessing the problems with the restaurant, Robert Irvine typically creates a plan for the new decor, oversees the cleaning of the restaurant, reduces the size of the menu and improves the food, develops a promotional activity, educates the restaurant's owners, or trains the staff as needed by each restaurant. Currently, each episode opens with: Previously, each episode opened with: The series' sixth season began airing in April 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 13 2016 | 6 Episodes Season 13 of Restaurant: Impossible premiered on March  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2009-01-13 Chopped 4.8    2005-01-16 Iron Chef America 4.6    2007-04-23 Diners, Drive-Ins and Dives 6.0    2008-12-03 Man v. Food 6.7    2011-11-21 The Layover 7.8    1999-10-01 BeastMaster 5.9    2003-11-07 Dirty Jobs 7.6    2006-03-08 Top Chef 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.foodnetwork.com/restaurant-impossible/index.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors b 2 bowen4514@gmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}