{"link": "https://www.themoviedb.org/tv/1976?language=en", "title": "Pimp My Ride", "resume": "Pimp My Ride is a TV show produced by MTV. Each episode consists of taking one car in poor condition and restoring it, as well as customizing it. The original American version was hosted by rapper Xzibit. Recently, MTV2 has begun airing episodes from Pimp My Ride UK hosted by DJ Tim Westwood, which features cars being customised in the UK, and Pimp My Ride International, featuring cars in central Europe, hosted by hip hop artists Fat Joe and Lil' Jon, as well as the related CMT series Trick My Truck.", "rate": 54, "genre": [], "cast": ["Xzibit", "Buck"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1976   Expand Pimp My Ride   (2004) User Score Overview Pimp My Ride is a TV show produced by MTV. Each episode consists of taking one car in poor condition and restoring it, as well as customizing it. The original American version was hosted by rapper Xzibit. Recently, MTV2 has begun airing episodes from Pimp My Ride UK hosted by DJ Tim Westwood, which features cars being customised in the UK, and Pimp My Ride International, featuring cars in central Europe, hosted by hip hop artists Fat Joe and Lil' Jon, as well as the related CMT series Trick My Truck. Featured Crew Bruce Beresford-Redman Creator Rick Hurvitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Xzibit Buck Full Cast & Crew Last Season Season 6 2007 | 18 Episodes Season 6 of Pimp My Ride premiered on April  5, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2005-01-18 My Super Sweet 16 1.0    2002-03-05 The Osbournes 6.4    2005-07-19 Miami Ink 6.0    MTV Cribs 4.7    2008-03-18 Time Warp 6.0    1998-08-31 Noddy 5.9    2003-02-08 Teenage Mutant Ninja Turtles 6.6    2000-04-12 Jackass 6.0  Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  30m, 47m, 27m Homepage   http://www.pimpmyride.com/ Genres No genres have been added. Keywords automobile car restoration Content Score 56 We're so close, yet so far. Top Contributors 5 Banana s 3 speedycars E 3 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}