{"link": "https://www.themoviedb.org/tv/64448?language=en", "title": "Madame Antoine", "resume": "A famous fortune teller who claims to be spiritually linked to Marie Antoinette and calls herself 'Madame Antoine' goes head-to-head with a cold psychotherapist who runs a clinic also by the name 'Madame Antoine' and aims to prove that true love doesn't exist.", "rate": 60, "genre": ["Comedy", "Romance"], "cast": ["Han Ye-seul", "Sung Joon", "Jung Jin-woon", "Hwang Seung-Eon", "Lee Joo-hyung"], "character": ["Ko Hye-Rim", "Choi Soo-Hyun", "Choi Seung-Chan", "Ko Yoo-Rim", "Won Ji-Ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64448   Expand Madame Antoine   (2016) User Score Overview A famous fortune teller who claims to be spiritually linked to Marie Antoinette and calls herself 'Madame Antoine' goes head-to-head with a cold psychotherapist who runs a clinic also by the name 'Madame Antoine' and aims to prove that true love doesn't exist. Featured Crew Kim Yun-Cheol Creator Hong Jin-Ah Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Ye-seul Ko Hye-Rim Sung Joon Choi Soo-Hyun Jung Jin-woon Choi Seung-Chan Hwang Seung-Eon Ko Yoo-Rim Lee Joo-hyung Won Ji-Ho Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of Madame Antoine premiered on January 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   2016-11-16 Oh My Geum Bi 8.7    2016-01-20 One More Happy Ending 5.4    2016-09-21 On the Way to the Airport 8.7    2016-03-05 Marriage Contract 8.2    2016-09-26 Woman with a Suitcase 7.1    2016-04-20 Entertainer 6.0    2016-03-27 Vampire Detective 6.1    2016-09-05 Drinking Solo 8.1  Facts Original Name  마담 앙트완 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.joins.com/madam/ Genres Comedy Romance Keywords korea Content Score 93 Almost there... Top Contributors M 40 Maria180493 z 10 zurman1 6 Imzadi l 5 lws0406  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}