{"link": "https://www.themoviedb.org/tv/38239?language=en", "title": "True Justice", "resume": "Elijah Kane leads a hardcore undercover team of Seattle based cops who take on the local criminal element with a high-octane style of enforcement.", "rate": 55, "genre": ["Action", "Adventure", "Drama"], "cast": ["Steven Seagal", "Adrian Holmes", "Sarah Lind", "Lochlyn Munro", "Jesse Hutch"], "character": ["Elijah Kane", "Marcus Mitchell", "Sarah Montgomery", "Mark Simms", "Johnny Garcia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38239   Expand True Justice   (2011) User Score Overview Elijah Kane leads a hardcore undercover team of Seattle based cops who take on the local criminal element with a high-octane style of enforcement. Featured Crew Steven Seagal Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Seagal Elijah Kane Adrian Holmes Marcus Mitchell Sarah Lind Sarah Montgomery Lochlyn Munro Mark Simms Jesse Hutch Johnny Garcia Full Cast & Crew Last Season Season 2 2012 | 13 Episodes Season 2 of True Justice premiered on July  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on True Justice. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Action & Adventure Drama Keywords police undercover seattle Content Score 93 Almost there... Top Contributors 40 Banana 17 Reb_Brown 11 Евгений d 7 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}