{"link": "https://www.themoviedb.org/tv/37517?language=en", "title": "The Tower of Druaga: The Aegis of Uruk", "resume": "The Summer of \"Anu\": In a summer once every five years, demons in  the mysterious Tower of Druaga lose their powers due to the magic spell  cast by a god named \"Anu\". King Gilgamesh, ruler of the kingdom Uruk,  uses the appearance of demons as an excuse to invade the tower and find  out the construct's secrets. As 80 years passed, the Uruk army managed  to fight back the demons and built a fortress city and safe haven on the  very first floor of Druaga—Metz Kier. Thus begins the story of a  warrior named Jil, who, finding companions along the way, embarks on a  quest for the fabled Blue Crystal Rod, a powerful artifact rumored to be  in the highest floor of Druaga. However, other competitors, including  the kingdom of Uruk itself, want the treasure, all for their own  reasons.", "rate": 50, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37517   Expand The Tower of Druaga: The Aegis of Uruk   (2008) User Score Overview The Summer of \"Anu\": In a summer once every five years, demons in  the mysterious Tower of Druaga lose their powers due to the magic spell  cast by a god named \"Anu\". King Gilgamesh, ruler of the kingdom Uruk,  uses the appearance of demons as an excuse to invade the tower and find  out the construct's secrets. As 80 years passed, the Uruk army managed  to fight back the demons and built a fortress city and safe haven on the  very first floor of Druaga—Metz Kier. Thus begins the story of a  warrior named Jil, who, finding companions along the way, embarks on a  quest for the fabled Blue Crystal Rod, a powerful artifact rumored to be  in the highest floor of Druaga. However, other competitors, including  the kingdom of Uruk itself, want the treasure, all for their own  reasons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2009 | 12 Episodes Season 2 of The Tower of Druaga: The Aegis of Uruk premiered on January  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Tower of Druaga: The Aegis of Uruk. You can help by rating TV shows you've seen. Facts Original Name  ドルアーガの塔 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.druaga-anime.com/english/ Genres Animation Sci-Fi & Fantasy Comedy Keywords anime Content Score 56 We're so close, yet so far. Top Contributors 11 kazuza t 7 tmdb983464 m 3 magoozin 3 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}