{"link": "https://www.themoviedb.org/tv/71131?language=en", "title": "Confess", "resume": "Auburn Reed is determined to put her challenging past behind her and get her future on track. Now in her mid-twenties and struggling to fund her custody battle for her only son, she stumbles upon the art studio of the talented and charming artist, Owen Gentry. The two wrestle with their developing romance and the secrets they're both keeping until they realize they may risk their future if they don't reveal their pasts to each other.", "rate": 90, "genre": [], "cast": ["Amy Pham", "Katie Leclerc", "Ryan Cooper", "Sherilyn Fenn", "Rocky Myers"], "character": ["Emory Le", "Auburn Reed", "Owen Gentry", "Lydia", "Trey Taylor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71131   Expand Confess   (2017) User Score Overview Auburn Reed is determined to put her challenging past behind her and get her future on track. Now in her mid-twenties and struggling to fund her custody battle for her only son, she stumbles upon the art studio of the talented and charming artist, Owen Gentry. The two wrestle with their developing romance and the secrets they're both keeping until they realize they may risk their future if they don't reveal their pasts to each other. Featured Crew Elissa Down Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amy Pham Emory Le Katie Leclerc Auburn Reed Ryan Cooper Owen Gentry Sherilyn Fenn Lydia Rocky Myers Trey Taylor Full Cast & Crew Last Season Season 1 2017 | 7 Episodes Season 1 of Confess premiered on April  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Confess. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  23m Homepage  - Genres No genres have been added. Keywords romance Content Score 86 Almost there... Top Contributors 21 ryangosling 6 marxc88 2 seboseboss TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}