{"link": "https://www.themoviedb.org/tv/11110?language=en", "title": "Liberty's Kids", "resume": "Liberty's Kids is an animated educational historical fiction television series produced by DIC Entertainment, originally broadcast on PBS Kids from September 2, 2002 to April 4, 2003, although PBS continued to air reruns until August 2004. The show has since been syndicated by DiC to affiliates of smaller television networks such as The CW and MyNetworkTV and some independent stations so that those stations can fulfill FCC educational and informational requirements. Since September 16, 2006, the series aired on CBS's new block called KOL Secret Slumber Party on CBS, then it was aired on KEWLopolis, which taking September 12, 2009. In 2008 it ran on The History Channel. The series is currently on the Cookie Jar Toons block on This TV and CBS's Cookie Jar TV. In 2012, Qubo announced the channel will air Liberty's Kids in fall 2012. The series was based on an idea by Kevin O'Donnell and developed for television by Kevin O'Donnell, Robby London, Mike Maliani, and Andy Heyward.\nIts purpose is to teach its audience of 7 to 14 year olds about the origins of the United States of America. Much like the CBS cartoon mini-series based on Peanuts; This is America, Charlie Brown years before, Liberty's Kids tells of young people in dramas surrounding the major events in the Revolutionary War days. Celebrity voices such as Walter Cronkite, Sylvester Stallone, Ben Stiller, Billy Crystal, Dustin Hoffman, Arnold Schwarzenegger, and Don Francisco lend credence to characters critical to the forming of a free country, from the Boston Tea Party to the Constitutional Convention.", "rate": 60, "genre": ["Animation"], "cast": ["Whoopi Goldberg", "Andrew Rannells", "Ben Beck", "Billy Crystal", "Charles Shaughnessy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11110   Expand Liberty's Kids   (2002) User Score Overview Liberty's Kids is an animated educational historical fiction television series produced by DIC Entertainment, originally broadcast on PBS Kids from September 2, 2002 to April 4, 2003, although PBS continued to air reruns until August 2004. The show has since been syndicated by DiC to affiliates of smaller television networks such as The CW and MyNetworkTV and some independent stations so that those stations can fulfill FCC educational and informational requirements. Since September 16, 2006, the series aired on CBS's new block called KOL Secret Slumber Party on CBS, then it was aired on KEWLopolis, which taking September 12, 2009. In 2008 it ran on The History Channel. The series is currently on the Cookie Jar Toons block on This TV and CBS's Cookie Jar TV. In 2012, Qubo announced the channel will air Liberty's Kids in fall 2012. The series was based on an idea by Kevin O'Donnell and developed for television by Kevin O'Donnell, Robby London, Mike Maliani, and Andy Heyward. Its purpose is to teach its audience of 7 to 14 year olds about the origins of the United States of America. Much like the CBS cartoon mini-series based on Peanuts; This is America, Charlie Brown years before, Liberty's Kids tells of young people in dramas surrounding the major events in the Revolutionary War days. Celebrity voices such as Walter Cronkite, Sylvester Stallone, Ben Stiller, Billy Crystal, Dustin Hoffman, Arnold Schwarzenegger, and Don Francisco lend credence to characters critical to the forming of a free country, from the Boston Tea Party to the Constitutional Convention. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Whoopi Goldberg Andrew Rannells Ben Beck Billy Crystal Charles Shaughnessy Full Cast & Crew Last Season Season 1 2002 | 40 Episodes Season 1 of Liberty's Kids premiered on September  2, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Liberty's Kids. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords educational american revolution american history Content Score 86 Almost there... Top Contributors 9 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}