{"link": "https://www.themoviedb.org/tv/31319?language=en", "title": "The Prisoner", "resume": "The Prisoner is a 2009 television miniseries based on the 1960s TV series The Prisoner about a man who awakens in a mysterious, picturesque village from which there is no escape and wonders who made the village and why. It was co-produced by American cable network AMC with the British channel ITV.", "rate": 58, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Ian McKellen", "Jim Caviezel", "Ruth Wilson", "Hayley Atwell", "Rachael Blake"], "character": ["2 / Curtis", "6 / Michael", "313", "4-15 / Lucy", "M2"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31319   Expand The Prisoner   (2009) User Score  Play Trailer Overview The Prisoner is a 2009 television miniseries based on the 1960s TV series The Prisoner about a man who awakens in a mysterious, picturesque village from which there is no escape and wonders who made the village and why. It was co-produced by American cable network AMC with the British channel ITV. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian McKellen 2 / Curtis Jim Caviezel 6 / Michael Ruth Wilson 313 Hayley Atwell 4-15 / Lucy Rachael Blake M2 Full Cast & Crew Last Season Season 1 2009 | 6 Episodes Season 1 of The Prisoner premiered on November 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2010-10-26 Riese: Kingdom Falling 6.1    1997-07-20 The Hunger 5.7    1998-09-09 First Wave 6.6    2007-10-12 Women's Murder Club 6.8    1996-09-28 Early Edition 6.7    2005-03-27 Colditz 6.3    1995-09-22 Space: Above and Beyond 6.8    1966-09-09 The Time Tunnel 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.amctv.com/originals/the-prisoner/ Genres Drama Sci-Fi & Fantasy Keywords memory loss miniseries trapped desert strange event Content Score 93 Almost there... Top Contributors 8 Banana E 6 Edytor s 3 speedycars w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}