{"link": "https://www.themoviedb.org/tv/4226?language=en", "title": "London's Burning", "resume": "London's Burning is a British television drama programme produced by London Weekend Television for the ITV network that focused on the lives of members of the London Fire Brigade, principally those of the Blue Watch at a fictional fire station called Blackwall.\nIt was broadcast between 1988 and 2002 in the United Kingdom and was shown in Canada on digital television station CBC Country Canada. In the UK, Discovery's entertainment channel, DMAX have also shown repeats of the later series, mainly 11 through 14.", "rate": 0, "genre": ["Drama"], "cast": ["Glen Murphy", "Richard Walsh", "Ben Onwukwe", "Heather Peace", "James Bourne"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4226   Expand London's Burning   (1986) User Score Overview London's Burning is a British television drama programme produced by London Weekend Television for the ITV network that focused on the lives of members of the London Fire Brigade, principally those of the Blue Watch at a fictional fire station called Blackwall. It was broadcast between 1988 and 2002 in the United Kingdom and was shown in Canada on digital television station CBC Country Canada. In the UK, Discovery's entertainment channel, DMAX have also shown repeats of the later series, mainly 11 through 14. Featured Crew Jack Rosenthal Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Glen Murphy Richard Walsh Ben Onwukwe Heather Peace James Bourne Full Cast & Crew Last Season Season 1 1988 | 8 Episodes Season 1 of London's Burning premiered on February 20, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on London's Burning. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Keywords london england firemen Content Score 93 Almost there... Top Contributors 4 Banana 4 rudely_murray 1 Ash T 1 Ticktock  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}