{"link": "https://www.themoviedb.org/tv/64291?language=en", "title": "Cuffs", "resume": "Cuffs is a fresh, authentic and visceral drama that will take the audience on an exhilarating ride through the challenges of front-line policing. Adrenalized and vibrant, the show is packed full of dramatic incidents and colourful characters. From a booby trapped cannabis farm in a suburban semi to an elderly farmer's wife with a shotgun, the stories are surprising and exciting. There will be more absurd altercations - such as a middle-class dog-napping or fisticuffs between pensioners - as well as the daily grind of speeding drivers, city-centre shoplifters and Saturday night drinkers.", "rate": 66, "genre": ["Drama", "Crime"], "cast": ["Ashley Walters", "Jacob Ifan", "Amanda Abbington", "Peter Sullivan", "Shaun Dooley"], "character": ["PC Ryan Draper", "PC Jake Vickers", "DS Jo Moffat", "Chief Super Robert Vickers", "DC Carl Hawkins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64291   Expand Cuffs   (2015) User Score  Play Trailer Overview Cuffs is a fresh, authentic and visceral drama that will take the audience on an exhilarating ride through the challenges of front-line policing. Adrenalized and vibrant, the show is packed full of dramatic incidents and colourful characters. From a booby trapped cannabis farm in a suburban semi to an elderly farmer's wife with a shotgun, the stories are surprising and exciting. There will be more absurd altercations - such as a middle-class dog-napping or fisticuffs between pensioners - as well as the daily grind of speeding drivers, city-centre shoplifters and Saturday night drinkers. Featured Crew Julie Gearey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Walters PC Ryan Draper Jacob Ifan PC Jake Vickers Amanda Abbington DS Jo Moffat Peter Sullivan Chief Super Robert Vickers Shaun Dooley DC Carl Hawkins Full Cast & Crew Last Season Series 1 2015 | 8 Episodes Season 1 of Cuffs premiered on October 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2013-09-05 The Guilty 7.0    2012-08-30 Good Cop 6.6    2015-05-05 No Offence 7.8    2011-06-05 Case Histories 8.2    2006-01-01 In Justice 6.8    2011-09-14 Free Agents 4.8    2012-02-02 Inside Men 6.4    2011-02-07 Bedlam 5.8  Facts Status  Cancelled Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b06ncgm7 Genres Drama Crime Keywords police england brighton rookie cop cop drama police procedural Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 27 senckyz 10 Banana z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}