{"link": "https://www.themoviedb.org/tv/9573?language=en", "title": "Lieutenant Ninzaburo Furuhata", "resume": "Furuhata Ninzaburō is a Japanese television series that ran periodically on Fuji Television from 1994 until its final episodes in 2006. It was written by Japanese playwright Kōki Mitani and is often referred to as the Japanese version of Columbo.\nThe series is a police detective drama starring actor Masakazu Tamura as Furuhata Ninzaburo and Masahiko Nishimura as his stereotypically bumbling sidekick, Shintaro Imaizumi. The program aired weekly and featured a guest villain each time, usually a famous talent in Japan. Pop-stars like SMAP, television hosts like Sanma Akashiya and even sports figures like Ichiro Suzuki have been featured on this program. It was one of the most popular television dramas in the history of Japanese television, having spawned several seasons and TV specials.", "rate": 80, "genre": ["Drama"], "cast": ["Masakazu Tamura", "Masahiko Nishimura", "Naho Toda"], "character": ["Ninzaburo Furuhata", "Shintaro Imaizumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9573   Expand Lieutenant Ninzaburo Furuhata   (1994) User Score Overview Furuhata Ninzaburō is a Japanese television series that ran periodically on Fuji Television from 1994 until its final episodes in 2006. It was written by Japanese playwright Kōki Mitani and is often referred to as the Japanese version of Columbo. The series is a police detective drama starring actor Masakazu Tamura as Furuhata Ninzaburo and Masahiko Nishimura as his stereotypically bumbling sidekick, Shintaro Imaizumi. The program aired weekly and featured a guest villain each time, usually a famous talent in Japan. Pop-stars like SMAP, television hosts like Sanma Akashiya and even sports figures like Ichiro Suzuki have been featured on this program. It was one of the most popular television dramas in the history of Japanese television, having spawned several seasons and TV specials. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masakazu Tamura Ninzaburo Furuhata Masahiko Nishimura Shintaro Imaizumi Naho Toda Full Cast & Crew Last Season Furuhata ninzaburo season 3 1999 | 12 Episodes Season 3 of Lieutenant Ninzaburo Furuhata premiered on April 13, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lieutenant Ninzaburo Furuhata. You can help by rating TV shows you've seen. Facts Original Name  古畑任三郎 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.fujitv.co.jp/furuhata/index2.html Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors t 12 taxigps A 6 Aka75 _ 3 _mce_  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}