{"link": "https://www.themoviedb.org/tv/14105?language=en", "title": "Riverboat", "resume": "Riverboat is a 44-episode western television series starring Darren McGavin and Burt Reynolds broadcast on the NBC television network from September 13, 1959 until January 2, 1961. It was produced by Revue Studios.", "rate": 90, "genre": ["Western"], "cast": ["Darren McGavin", "Dick Wessel", "Jack Lambert", "William D. Gordon", "Michael McGreevey"], "character": ["Captain Grey Holden", "Carney Kohler", "Joshua Walcek", "Joe Travis", "Chip Kessler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14105   Expand Riverboat   (1959) User Score Overview Riverboat is a 44-episode western television series starring Darren McGavin and Burt Reynolds broadcast on the NBC television network from September 13, 1959 until January 2, 1961. It was produced by Revue Studios. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Darren McGavin Captain Grey Holden Dick Wessel Carney Kohler Jack Lambert Joshua Walcek William D. Gordon Joe Travis Michael McGreevey Chip Kessler Full Cast & Crew Last Season Season 2 1960 | 13 Episodes Season 2 of Riverboat premiered on September 19, 1960. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Riverboat. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords ship 19th century Content Score 86 Almost there... Top Contributors 15 Banana 2 rtentser 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}