{"link": "https://www.themoviedb.org/tv/1418?language=en", "title": "The Big Bang Theory", "resume": "The Big Bang Theory is centered on five characters living in Pasadena, California: roommates Leonard Hofstadter and Sheldon Cooper; Penny, a waitress and aspiring actress who lives across the hall; and Leonard and Sheldon's equally geeky and socially awkward friends and co-workers, mechanical engineer Howard Wolowitz and astrophysicist Raj Koothrappali. The geekiness and intellect of the four guys is contrasted for comic effect with Penny's social skills and common sense.", "rate": 68, "genre": ["Comedy"], "cast": ["Jim Parsons", "Johnny Galecki", "Kaley Cuoco", "Simon Helberg", "Kunal Nayyar"], "character": ["Sheldon Cooper", "Leonard Hofstadter", "Penny", "Howard Wolowitz", "Rajesh Koothrappali"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1418   Expand The Big Bang Theory   (2007) User Score  Play Trailer Overview The Big Bang Theory is centered on five characters living in Pasadena, California: roommates Leonard Hofstadter and Sheldon Cooper; Penny, a waitress and aspiring actress who lives across the hall; and Leonard and Sheldon's equally geeky and socially awkward friends and co-workers, mechanical engineer Howard Wolowitz and astrophysicist Raj Koothrappali. The geekiness and intellect of the four guys is contrasted for comic effect with Penny's social skills and common sense. Featured Crew Chuck Lorre Creator Bill Prady Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  328 Content Issues  25 Images Backdrops  48 Posters  63 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  10 Opening Credits  1 Top Billed Cast Jim Parsons Sheldon Cooper Johnny Galecki Leonard Hofstadter Kaley Cuoco Penny Simon Helberg Howard Wolowitz Kunal Nayyar Rajesh Koothrappali Full Cast & Crew Last Season Season 11 2017 | 24 Episodes Season 11 of The Big Bang Theory premiered on September 25, 2017. View All Seasons Social Reviews  1 Discussions  353 A review by ComputerBlue  6.0 Written by  ComputerBlue  on April 14, 2017 What this review might have sounded like had I written it 7 years ago. The first few seasons are, for the most part, extremely fantastic, focused, funny, fresh, intelligent and even at times, brilliant. Most importantly, it offers something that separates it from the pack...Must see TV! What this review sounds like now nearing the end of the shows run. A once great show which slowly starts to diminish around season 4, unfortunately. By the 9th season it seems as though the pen and paper have been handed over to teenage fans of the show...Decent background noise. **To conclud...  read the rest. Read All Reviews Media Most Popular Videos  12 Backdrops  48 Posters  63 Recommendations   2005-09-19 How I Met Your Mother 7.4    1994-09-22 Friends 7.8    2003-09-22 Two and a Half Men 6.2    2004-11-16 House 8.1    2001-10-02 Scrubs 7.7    2006-10-01 Dexter 8.0    2009-09-23 Modern Family 7.3    2006-09-25 Heroes 6.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cbs.com/shows/big_bang_theory/ Genres Comedy Keywords nerd geek friends scientist science sitcom Content Score 100 Yes! Looking good! Top Contributors 519 Marr 🇳🇱 M 224 Mec!as 115 Elizabeth Jennings 95 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}