{"link": "https://www.themoviedb.org/tv/61739?language=en", "title": "Blade Man", "resume": "Despite his wealth, Joo Hong Bin (Lee Dong Wook) is a prickly man harboring a broken heart. But when his emotional pain physically manifests itself as a gruesome ability to sprout knives from his body, Hong Bin quickly realizes that he’s got to start wearing his heart on his sleeve — with all of his newfound scars to prove it. Meanwhile, Son Se Dong (Shin Se Kyung) tries to heal Hong Bin's wounds inside and out, but is this supernatural love damaged beyond repair?", "rate": 64, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Lee Dong-wook", "Shin Se-kyung", "Kim Kap-soo", "Han Eun-jung", "Lee Mi-sook"], "character": ["Joo Hong-bin", "Son Se-dong", "Joo Jang-won", "Kim Tae-hee", "Madam Yoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61739   Expand Blade Man   (2014) User Score  Play Trailer Overview Despite his wealth, Joo Hong Bin (Lee Dong Wook) is a prickly man harboring a broken heart. But when his emotional pain physically manifests itself as a gruesome ability to sprout knives from his body, Hong Bin quickly realizes that he’s got to start wearing his heart on his sleeve — with all of his newfound scars to prove it. Meanwhile, Son Se Dong (Shin Se Kyung) tries to heal Hong Bin's wounds inside and out, but is this supernatural love damaged beyond repair? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Dong-wook Joo Hong-bin Shin Se-kyung Son Se-dong Kim Kap-soo Joo Jang-won Han Eun-jung Kim Tae-hee Lee Mi-sook Madam Yoon Full Cast & Crew Last Season Season 1 2014 | 18 Episodes Season 1 of Blade Man premiered on September 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  5 Posters  2 Recommendations   2014-05-07 You Are All Surrounded 8.0    2015-06-22 I Remember You 7.1    2014-07-23 It's Okay, That's Love 9.3    2011-05-25 City Hunter 7.5    2013-06-05 I Hear Your Voice 8.2    2014-12-08 Healer 8.7    2013-12-18 My Love From Another Star 8.2    2015-01-07 Kill Me, Heal Me 8.7  Facts Original Name  아이언맨 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/ironman/ Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 48 Maria180493 10 Elizabeth Jennings CM 8 Cherche Moi z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}