{"link": "https://www.themoviedb.org/tv/2852?language=en", "title": "That Mitchell and Webb Look", "resume": "That Mitchell and Webb Look is a British television sketch show starring David Mitchell and Robert Webb. Shown on BBC Two since 2006, its first two series were directed by David Kerr, who also directed Mitchell and Webb's previous television sketch show The Mitchell and Webb Situation, whereas series 3 and 4 are directed by Ben Gosling Fuller. As well as Mitchell and Webb themselves, the writers include Jesse Armstrong, James Bachman, Sam Bain, Mark Evans, Olivia Colman, Toby Davies, Chris Pell, Jonathan Dryden Taylor, Joel Morris, Jason Hazeley, Simon Kane, John Finnemore and others. It is produced by Gareth Edwards. Colman, Bachman, and Evans were also members of the cast alongside Abigail Burdess, Gus Brown, Sarah Hadland and Paterson Joseph.\nMany of its characters and sketches are first featured in the duo's radio show That Mitchell and Webb Sound. First aired on 14 September 2006, a second series was commissioned later that same year and shown between 21 February 2008 and 27 March 2008. The third series began on 11 June 2009. Since series two, the production has also been broadcast on BBC HD. The first series won a BAFTA award in 2007. The third series started airing on BBC America on 14 April 2010. The fourth series premiered on BBC Two and BBC HD on 13 July 2010 with a total of 6 episodes commissioned by the BBC. In a November 2011 interview, Webb stated that there are \"no plans, sadly, for another series of sketches\" continuing to say that \"you'd have to ask the BBC\" about further series.", "rate": 80, "genre": ["Comedy"], "cast": ["Robert Webb", "Olivia Colman", "Paterson Joseph", "James Bachman", "Mark Evans"], "character": ["Julie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2852   Expand That Mitchell and Webb Look   (2006) User Score Overview That Mitchell and Webb Look is a British television sketch show starring David Mitchell and Robert Webb. Shown on BBC Two since 2006, its first two series were directed by David Kerr, who also directed Mitchell and Webb's previous television sketch show The Mitchell and Webb Situation, whereas series 3 and 4 are directed by Ben Gosling Fuller. As well as Mitchell and Webb themselves, the writers include Jesse Armstrong, James Bachman, Sam Bain, Mark Evans, Olivia Colman, Toby Davies, Chris Pell, Jonathan Dryden Taylor, Joel Morris, Jason Hazeley, Simon Kane, John Finnemore and others. It is produced by Gareth Edwards. Colman, Bachman, and Evans were also members of the cast alongside Abigail Burdess, Gus Brown, Sarah Hadland and Paterson Joseph. Many of its characters and sketches are first featured in the duo's radio show That Mitchell and Webb Sound. First aired on 14 September 2006, a second series was commissioned later that same year and shown between 21 February 2008 and 27 March 2008. The third series began on 11 June 2009. Since series two, the production has also been broadcast on BBC HD. The first series won a BAFTA award in 2007. The third series started airing on BBC America on 14 April 2010. The fourth series premiered on BBC Two and BBC HD on 13 July 2010 with a total of 6 episodes commissioned by the BBC. In a November 2011 interview, Webb stated that there are \"no plans, sadly, for another series of sketches\" continuing to say that \"you'd have to ask the BBC\" about further series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Webb Olivia Colman Julie Paterson Joseph James Bachman Mark Evans Full Cast & Crew Last Season Season 4 2010 | 6 Episodes Season 4 of That Mitchell and Webb Look premiered on July 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2001-10-06 The Mitchell and Webb Situation 8.0    1998-11-09 Big Train 7.5    1994-09-16 Knowing Me Knowing You with Alan Partridge 7.5    2003-09-19 Peep Show 8.2    2006-02-27 Snuff Box 8.2    1990-09-28 Have I Got News for You 7.6    1999-01-11 The League of Gentlemen 7.4    2004-09-03 Green Wing 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b0092s71 Genres Comedy Keywords satire sketch comedy self-referential hobo british humour Content Score 86 Almost there... Top Contributors 6 Stephen 4 Banana s 3 speedycars R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}