{"link": "https://www.themoviedb.org/tv/2509?language=en", "title": "Knightmare", "resume": "Knightmare is a British television programme for children and was broadcast on CITV from 7 September 1987 to 11 November 1994. An adventure game show, Knightmare involves a team of four children – one taking the role of the sightless dungeoneer, and the remaining three acting as their guide – traversing a medieval environment as they attempt to complete a quest and exit the dungeon, using their wits to overcome puzzles, obstacles and the unusual characters they meet along the journey.\nThe show is most noted for its use of blue screen chroma key and use of 'virtual reality' interactive gameplay on television. Broadcast to high viewing figures throughout its original run, it has garnered a cult status amongst its fans since its final television episode in 1994. It was revived for a one off special by YouTube in August 2013.", "rate": 85, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Hugo Myatt", "Jackie Sawiris", "Joanne Heywood", "David Learner", "Bill Cashmore"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2509   Expand Knightmare   (1987) User Score Overview Knightmare is a British television programme for children and was broadcast on CITV from 7 September 1987 to 11 November 1994. An adventure game show, Knightmare involves a team of four children – one taking the role of the sightless dungeoneer, and the remaining three acting as their guide – traversing a medieval environment as they attempt to complete a quest and exit the dungeon, using their wits to overcome puzzles, obstacles and the unusual characters they meet along the journey. The show is most noted for its use of blue screen chroma key and use of 'virtual reality' interactive gameplay on television. Broadcast to high viewing figures throughout its original run, it has garnered a cult status amongst its fans since its final television episode in 1994. It was revived for a one off special by YouTube in August 2013. Featured Crew Tim Child Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugo Myatt Jackie Sawiris Joanne Heywood David Learner Bill Cashmore Full Cast & Crew Last Season Season 8 1994 | 10 Episodes Season 8 of Knightmare premiered on September  9, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1992-01-07 GamesMaster 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.knightmare.com/ Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors TB 2 TMDb Bot D 2 Dan_Tebasco  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}