{"link": "https://www.themoviedb.org/tv/66094?language=en", "title": "Dice", "resume": "Hickory, dickory, dock — the Dice Man's back and he's ready to rock. The semi-true stories of Andrew Dice Clay, whose unique brand of humor often gets him in trouble. Once on top, the comedian now must work to resurrect his career, pay his gambling debts, manage his sons’ rock band, fend off old fans and keep his family afloat.", "rate": 74, "genre": ["Comedy"], "cast": ["Andrew Dice Clay", "Kevin Corrigan", "Natasha Leggero", "Kurt Koehler", "Eugene Kim"], "character": ["Dice", "Milkshake", "Carmen", "Liza", "David"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66094   Expand Dice   (2016) User Score  Play Trailer Overview Hickory, dickory, dock — the Dice Man's back and he's ready to rock. The semi-true stories of Andrew Dice Clay, whose unique brand of humor often gets him in trouble. Once on top, the comedian now must work to resurrect his career, pay his gambling debts, manage his sons’ rock band, fend off old fans and keep his family afloat. Featured Crew Scot Armstrong Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  12 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Dice Clay Dice Kevin Corrigan Milkshake Natasha Leggero Carmen Kurt Koehler Liza Eugene Kim David Full Cast & Crew Last Season Season 2 2017 | 7 Episodes Season 2 of Dice premiered on August 20, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Canceled, thank goodness! Open 0 by PT 100\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Dice. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.sho.com/sho/dice/home Genres Comedy Keywords comedian gambling debt career resurrection Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings z 24 zyck 6 Banana l 4 lexura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}