{"link": "https://www.themoviedb.org/tv/550?language=en", "title": "Till Death Us Do Part", "resume": "Till Death Us Do Part is a ground-breaking British sitcom that aired on BBC1 from 1965 to 1975. First airing as a Comedy Playhouse pilot, the show aired in seven series until 1975. Six years later, ITV continued the sitcom, calling it Till Death.... From 1985 to 1992, the BBC produced a sequel In Sickness and in Health.\nCreated by Johnny Speight, Till Death Us Do Part centred on the East End Garnett family, led by patriarch Alf Garnett, a reactionary white working-class man who holds racist and anti-socialist views. His gentle and long-suffering wife Else was played by Dandy Nichols, and his daughter Rita by Una Stubbs. Rita's bright but layabout husband Mike Rawlins is a socialist. The character Alf Garnett became a well known character in British culture, and Mitchell played him on stage and television up until 1998, when Speight died.\nIn addition to the spin-off In Sickness and in Health, Till Death Us Do Part was re-made in many countries including Brazil, Germany and the United States.\nMany episodes from the first three series are thought to no longer exist, having been wiped in the late 1960s and early '70s as was the policy at the time.", "rate": 74, "genre": ["Comedy"], "cast": ["Dandy Nichols", "Una Stubbs", "Warren Mitchell", "Tony Booth"], "character": ["Else Garnett", "Rita Rawlins", "Alf Garnett", "Mike Rawlins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 550   Expand Till Death Us Do Part   (1965) User Score Overview Till Death Us Do Part is a ground-breaking British sitcom that aired on BBC1 from 1965 to 1975. First airing as a Comedy Playhouse pilot, the show aired in seven series until 1975. Six years later, ITV continued the sitcom, calling it Till Death.... From 1985 to 1992, the BBC produced a sequel In Sickness and in Health. Created by Johnny Speight, Till Death Us Do Part centred on the East End Garnett family, led by patriarch Alf Garnett, a reactionary white working-class man who holds racist and anti-socialist views. His gentle and long-suffering wife Else was played by Dandy Nichols, and his daughter Rita by Una Stubbs. Rita's bright but layabout husband Mike Rawlins is a socialist. The character Alf Garnett became a well known character in British culture, and Mitchell played him on stage and television up until 1998, when Speight died. In addition to the spin-off In Sickness and in Health, Till Death Us Do Part was re-made in many countries including Brazil, Germany and the United States. Many episodes from the first three series are thought to no longer exist, having been wiped in the late 1960s and early '70s as was the policy at the time. Featured Crew Johnny Speight Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dandy Nichols Else Garnett Una Stubbs Rita Rawlins Warren Mitchell Alf Garnett Tony Booth Mike Rawlins Full Cast & Crew Last Season (uk) season 7 1975 | 6 Episodes Season 7 of Till Death Us Do Part premiered on November  5, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1995-09-14 They Think It's All Over 7.3    1976-02-20 Open All Hours 7.7    1985-09-01 In Sickness and in Health 7.9    1962-01-04 Steptoe and Son 8.2    1983-09-22 Just Good Friends 6.4    1991-01-03 The Brittas Empire 7.1    1974-09-02 Rising Damp 7.8    1990-11-08 Harry Enfield's Television Programme 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords daughter london england baby wife pub satire son-in-law working class conservative racism family husband sitcom sexist unemployed rant family argument british humour bigot Content Score 79 Pump it up! We're close now. Top Contributors O 28 Ozbourne T 2 Tim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}