{"link": "https://www.themoviedb.org/tv/5270?language=en", "title": "Cane", "resume": "Cane is an American television drama created by Cynthia Cidre, who also served as executive producer alongside Jonathan Prince, Jimmy Iovine and Polly Anthony. The pilot was directed by Christian Duguay. The show chronicled the lives and internal power struggles of a powerful and wealthy Cuban-American family running an immensely successful rum and sugar cane business in South Florida.\nProduced by ABC Studios, CBS Paramount Network Television, El Sendero Productions, Interscope Records and Once A Frog Productions, the series premiered on September 25, 2007 airing on Tuesday nights at 10:00/9:00c on CBS, following The Unit. The series premiere of the show brought in 11 million viewers, the best in its time slot since 1999's Judging Amy.", "rate": 65, "genre": ["Drama"], "cast": ["Alona Tal", "Polly Walker", "Jimmy Smits", "Rita Moreno", "Nestor Carbonell"], "character": ["Rebecca King Vega", "Ellis Samuels", "Alex Vega", "Amalia Duque"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5270   Expand Cane   (2007) User Score Overview Cane is an American television drama created by Cynthia Cidre, who also served as executive producer alongside Jonathan Prince, Jimmy Iovine and Polly Anthony. The pilot was directed by Christian Duguay. The show chronicled the lives and internal power struggles of a powerful and wealthy Cuban-American family running an immensely successful rum and sugar cane business in South Florida. Produced by ABC Studios, CBS Paramount Network Television, El Sendero Productions, Interscope Records and Once A Frog Productions, the series premiered on September 25, 2007 airing on Tuesday nights at 10:00/9:00c on CBS, following The Unit. The series premiere of the show brought in 11 million viewers, the best in its time slot since 1999's Judging Amy. Featured Crew Cynthia Cidre Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alona Tal Rebecca King Vega Polly Walker Ellis Samuels Jimmy Smits Alex Vega Rita Moreno Amalia Duque Nestor Carbonell Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of Cane premiered on September 25, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cane. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.cbs.com/primetime/cane Genres Drama Keywords florida family business  cuban american family of color Content Score 93 Almost there... Top Contributors 9 Banana 5 galani z 5 zurman1 i 4 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}