{"link": "https://www.themoviedb.org/tv/64781?language=en", "title": "Tessa", "resume": "Dutch remake of the Danish show Rita. Tessa is a single mom and high school teacher. Her students love having her as a teacher, but the adults think she's a piece of work.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Thekla Reuten", "Niels Gomperts", "Stephanie van Leersum", "Joes Brouwers", "Bo Maerten"], "character": ["Tessa", "Rico", "Daan", "Jasper", "Barbara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64781   Expand Tessa   (2015) User Score Overview Dutch remake of the Danish show Rita. Tessa is a single mom and high school teacher. Her students love having her as a teacher, but the adults think she's a piece of work. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thekla Reuten Tessa Niels Gomperts Rico Stephanie van Leersum Daan Joes Brouwers Jasper Bo Maerten Barbara Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Tessa premiered on November 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tessa. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Dutch; Flemish Runtime  45m Homepage   http://tessa.bnn.nl Genres Comedy Drama Keywords high school single parent homosexuality single mother high school teacher Content Score 93 Almost there... Top Contributors 61 Marr 🇳🇱 7 mennoj1 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}