{"link": "https://www.themoviedb.org/tv/3882?language=en", "title": "My Favorite Martian", "resume": "My Favorite Martian is an American television sitcom that aired on CBS from September 29, 1963, to May 1, 1966, for 107 episodes. The show starred Ray Walston as Uncle Martin and Bill Bixby as Tim O'Hara.\nJohn L. Greene created the central characters and developed the core format of this series, which was produced by Jack Chertok.", "rate": 59, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Bill Bixby", "Ray Walston", "Alan Hewitt", "Pamela Britton"], "character": ["Tim O'Hara", "Uncle Martin", "Det. Bill Brennan", "Mrs. Lorelei Brown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3882   Expand My Favorite Martian   (1963) User Score Overview My Favorite Martian is an American television sitcom that aired on CBS from September 29, 1963, to May 1, 1966, for 107 episodes. The show starred Ray Walston as Uncle Martin and Bill Bixby as Tim O'Hara. John L. Greene created the central characters and developed the core format of this series, which was produced by Jack Chertok. Featured Crew John L. Greene Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Bixby Tim O'Hara Ray Walston Uncle Martin Alan Hewitt Det. Bill Brennan Pamela Britton Mrs. Lorelei Brown Full Cast & Crew Last Season Season 4 1973 | 2 Episodes Season 4 of My Favorite Martian premiered on September  8, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1965-01-24 Branded 8.3    1957-09-18 Wagon Train 6.3    1963-09-24 Petticoat Junction 5.7    1968-01-09 It Takes a Thief 7.4    1968-09-24 The Mod Squad 6.3    1964-09-24 Daniel Boone 5.9    1966-09-12 Family Affair 5.4    1957-09-14 Have Gun – Will Travel 8.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Keywords alien reporter los angeles sitcom Content Score 93 Almost there... Top Contributors 14 Steve 12 Banana 2 Zlogorek S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}