{"link": "https://www.themoviedb.org/tv/69478?language=en", "title": "The Handmaid's Tale", "resume": "Set in a dystopian future, a woman is forced to live as a concubine under a fundamentalist theocratic dictatorship. A TV adaptation of Margaret Atwood's novel.", "rate": 79, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Elisabeth Moss", "Yvonne Strahovski", "Joseph Fiennes", "Max Minghella", "Samira Wiley"], "character": ["Offred", "Serena Joy Waterford", "Commander Fred Waterford", "Nick Blaine", "Moira"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69478   Expand The Handmaid's Tale   (2017) User Score  Play Trailer Overview Set in a dystopian future, a woman is forced to live as a concubine under a fundamentalist theocratic dictatorship. A TV adaptation of Margaret Atwood's novel. Featured Crew Bruce Miller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  0 Images Backdrops  18 Posters  24 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elisabeth Moss Offred Yvonne Strahovski Serena Joy Waterford Joseph Fiennes Commander Fred Waterford Max Minghella Nick Blaine Samira Wiley Moira Full Cast & Crew Current Season Season 2 2018 | 12 Episodes View All Seasons Social Reviews  1 Discussions  11 Featured Review A review by Reno Written by  Reno  on September 16, 2017 * **From June to Offred: A 21st century slave tale! * SEASON 01: ** I was not sure to give it a try, in the end I just went on. The reason was, another dystopian theme. It was a short season with the 10 episodes, and I've got a mixed feeling. It was based on the 30 year old novel of the same name. I mean 3 decades old source is very old in the present trend. Since that book there were plenty of films, series were made similar to that theme, including one feature film adaptation. I don't know the screenplay was highly borrowed from its original source, but all I expected was alterable....  read the rest. Read All Reviews Media Most Popular Videos  3 Backdrops  18 Posters  24 Recommendations   2017-02-19 Big Little Lies 7.9    2017-08-02 The Sinner 7.3    2017-07-21 Ozark 8.0    2016-05-22 Preacher 7.4    2017-01-07 Taboo 8.0    2017-04-30 American Gods 6.9    2014-06-29 The Leftovers 7.7    2011-12-04 Black Mirror 8.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   https://www.hulu.com/the-handmaids-tale Genres Drama Sci-Fi & Fantasy Keywords future based on novel or book society dystopia surrogate mother teacher religion infertility soldier alternate world belief Content Score 100 Yes! Looking good! Top Contributors 84 Elizabeth Jennings e 31 elsie_hughes 28 david8s95 17 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}