{"link": "https://www.themoviedb.org/tv/25406?language=en", "title": "Jason and the Argonauts", "resume": "Jason and the Argonauts is based on the classic myth of Jason and the Golden Fleece. At a young age, Jason witnesses the brutal deposement and murder of his father at the hands of his uncle Pelias. Twenty years later, Jason returns home to claim his rightful place as king, but Pelias orders him to be executed, and in order to save himself Jason is forced to go on a dangerous quest to find the legendary Golden Fleece. So Jason gathers a motley crew of men and sets sail on the Argos. This Hallmark Production was created as a two part mini-series event, starring Jason London as Jason and Jolene Blalock as Medea.", "rate": 56, "genre": ["Family"], "cast": ["Ciarán Hinds", "Jason London", "Brian Thompson", "David Calder", "Jolene Blalock"], "character": ["King Aeson", "Jason", "Hercules", "Argos", "Medea"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25406   Expand Jason and the Argonauts   (2000) User Score  Play Trailer Overview Jason and the Argonauts is based on the classic myth of Jason and the Golden Fleece. At a young age, Jason witnesses the brutal deposement and murder of his father at the hands of his uncle Pelias. Twenty years later, Jason returns home to claim his rightful place as king, but Pelias orders him to be executed, and in order to save himself Jason is forced to go on a dangerous quest to find the legendary Golden Fleece. So Jason gathers a motley crew of men and sets sail on the Argos. This Hallmark Production was created as a two part mini-series event, starring Jason London as Jason and Jolene Blalock as Medea. Featured Crew Nick Willing Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ciarán Hinds King Aeson Jason London Jason Brian Thompson Hercules David Calder Argos Jolene Blalock Medea Full Cast & Crew Last Season Miniseries 2000 | 2 Episodes Season 1 of Jason and the Argonauts premiered on May  7, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2001-12-02 Jack and the Beanstalk: The Real Story 6.3    2000-04-30 Arabian Nights 6.8    1989-09-19 Doogie Howser, M.D. 5.7    2007-08-03 Masters of Science Fiction 6.2    2005-09-17 Mysterious Island 5.0    1997-05-17 The Odyssey 6.3    1999-04-03 The Lost World 7.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Family Keywords greek mythology miniseries gods ancient greece sailing ship golden fleece argonaut greek god sword and sorcery Content Score 100 Yes! Looking good! Top Contributors c 45 chispy TB 42 TMDb Bot R 19 Rebecca 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}