{"link": "https://www.themoviedb.org/tv/32715?language=en", "title": "The Cape", "resume": "\"The Cape\" is a drama series following Vince Faraday, an honest cop on a corrupt police force, who finds himself framed for a series of murders and presumed dead. He is forced into hiding, leaving behind his wife Dana and son, Trip. Fueled by a desire to reunite with his family and to battle the criminal forces that have overtaken Palm City, Vince Faraday becomes \"The Cape\" - his son's favorite comic book superhero - and takes the law into his own hands.", "rate": 45, "genre": ["Action", "Adventure", "Drama"], "cast": ["David Lyons", "Keith David", "Summer Glau", "James Frain", "Jennifer Ferrin"], "character": ["The Cape", "Max Malini", "Orwell", "Peter Fleming", "Dana Faraday"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32715   Expand The Cape   (2011) User Score  Play Trailer Overview \"The Cape\" is a drama series following Vince Faraday, an honest cop on a corrupt police force, who finds himself framed for a series of murders and presumed dead. He is forced into hiding, leaving behind his wife Dana and son, Trip. Fueled by a desire to reunite with his family and to battle the criminal forces that have overtaken Palm City, Vince Faraday becomes \"The Cape\" - his son's favorite comic book superhero - and takes the law into his own hands. Featured Crew Tom Wheeler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  9 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Lyons The Cape Keith David Max Malini Summer Glau Orwell James Frain Peter Fleming Jennifer Ferrin Dana Faraday Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of The Cape premiered on January  9, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Cape. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  8 Recommendations   1980-11-11 Too Close for Comfort 7.1    2003-09-02 The Joe Schmo Show 8.0    1991-09-08 Herman's Head 5.9    2011-01-20 Fairly Legal 5.8    2010-01-17 Human Target 7.1    2007-05-10 Traveler 6.9    2003-11-07 Dirty Jobs 7.6    2011-02-07 Outcasts 6.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.nbc.com/the-cape/ Genres Action & Adventure Drama Keywords superhero Content Score 100 Yes! Looking good! Top Contributors 19 Banana 11 Elizabeth Jennings 6 lineker 6 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}