{"link": "https://www.themoviedb.org/tv/69997?language=en", "title": "The Quad", "resume": "Dr. Eva Fletcher is the newly-elected President of the fictional Georgia A&M University. Upon arriving, Eva is charged with saving the prestigious HBCU from bankruptcy and her twenty-year marriage from crumbling while managing a tumultuous relationship with her rebellious only daughter. A diverse group of freshman also promises to keep Eva's hands full.", "rate": 67, "genre": ["Drama"], "cast": ["Anika Noni Rose", "Zoe Renee", "Ruben Santiago-Hudson", "Michelle DeFraites", "Jake Allyn"], "character": ["Dr. Eva Fletcher", "Noni Williams", "Cecil Diamond", "Madison Kelly", "BoJohn Folsom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69997   Expand The Quad   (2017) User Score  Play Trailer Overview Dr. Eva Fletcher is the newly-elected President of the fictional Georgia A&M University. Upon arriving, Eva is charged with saving the prestigious HBCU from bankruptcy and her twenty-year marriage from crumbling while managing a tumultuous relationship with her rebellious only daughter. A diverse group of freshman also promises to keep Eva's hands full. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anika Noni Rose Dr. Eva Fletcher Zoe Renee Noni Williams Ruben Santiago-Hudson Cecil Diamond Michelle DeFraites Madison Kelly Jake Allyn BoJohn Folsom Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of The Quad premiered on January 23, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Quad. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  41m Homepage   http://bet.com/shows/the-quad Genres Drama Keywords college Content Score 93 Almost there... Top Contributors 23 Banana d 11 dio980 7 Elizabeth Jennings 4 marxc88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}