{"link": "https://www.themoviedb.org/tv/38854?language=en", "title": "9 End 2 Outs", "resume": "9 End 2 Outs is a heartfelt and hilarious romantic comedy with a twist. Hong Nan Hee and Byun Hyung Tae have been best friends for 30 years. They cook for each other, call each other daily, bicker like siblings, and support each other when things go wrong. But everything is about to change. On her 30th birthday, Nan Hee realizes that she needs to shake things up. Tired of living with her mother, she rents Hyung Tae's house while he is on vacation, but complications arise and soon the two friends are living in the house together. As the old friends navigate new territory, they begin to discover things they never knew about each other—he's neurotic, she snores—but more importantly, they begin to discover what their friends and family have always suspected—that, without realizing it, they've been the most important people to each other all along.", "rate": 100, "genre": ["Comedy", "Romance"], "cast": ["Soo-Ae", "Lee Jung-Jin", "Lee Tae-sung", "Hwang Ji-hyeon", "Lee Sang-woo"], "character": ["Hong Nan-hee", "Byun Hyung-tae", "Kim Jung-joo", "Yoon Sung-ah", "Lee Joon-mo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38854   Expand 9 End 2 Outs   (2007) User Score Overview 9 End 2 Outs is a heartfelt and hilarious romantic comedy with a twist. Hong Nan Hee and Byun Hyung Tae have been best friends for 30 years. They cook for each other, call each other daily, bicker like siblings, and support each other when things go wrong. But everything is about to change. On her 30th birthday, Nan Hee realizes that she needs to shake things up. Tired of living with her mother, she rents Hyung Tae's house while he is on vacation, but complications arise and soon the two friends are living in the house together. As the old friends navigate new territory, they begin to discover things they never knew about each other—he's neurotic, she snores—but more importantly, they begin to discover what their friends and family have always suspected—that, without realizing it, they've been the most important people to each other all along. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soo-Ae Hong Nan-hee Lee Jung-Jin Byun Hyung-tae Lee Tae-sung Kim Jung-joo  Hwang Ji-hyeon Yoon Sung-ah Lee Sang-woo Lee Joon-mo Full Cast & Crew Last Season Season 1 2007 | 16 Episodes Season 1 of 9 End 2 Outs premiered on July 14, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on 9 End 2 Outs. You can help by rating TV shows you've seen. Facts Original Name  9회말 2아웃 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/2out/ Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 25 Maria180493 t 9 tmdb38202327 N 6 Nightowl.Kr P 3 Proteus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}