{"link": "https://www.themoviedb.org/tv/1905?language=en", "title": "The Situation Room", "resume": "The Situation Room with Wolf Blitzer is an afternoon, early evening newscast on CNN and CNN International hosted by Wolf Blitzer that first aired on August 8, 2005.\nThe broadcast currently airs weekdays live from 5:00PM to 6:30PM ET from Washington D.C.\nThe show begins with the following open: \"Happening Now ..... We want to welcome our viewers in the United States and around the world. I'm Wolf Blitzer, and You're in the Situation Room\", which includes highlights of what the show will discuss. Current events, breaking news, and political headlines all with discussions happen during the lively program.\nWhile the show has its own correspondents such as Brian Todd and Mary Snow, the show also makes use of top CNN journalists from across the network and political analysts such as Gloria Borger, John King, David Gergen, and Candy Crowley.\nThe show features segments such as American Solutions or Strategy Session which are lively discussions on the days most pressing issue, as well as Top Stories that showcases headlines of the day. Wolf Blitzer also presents Hot Shots which are pictures coming in from around the world.\nNormally at the end of the program, a report by Jeanne Moos is shown that talks about unusual, off-beat soft news stories that focus on subjects related to popular culture. The report makes use of street style interviews, shots of tabloid magazine headlines, and clips garnered from videos on YouTube.", "rate": 80, "genre": ["War", "Politics"], "cast": ["Wolf Blitzer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1905   Expand The Situation Room   (2005) User Score Overview The Situation Room with Wolf Blitzer is an afternoon, early evening newscast on CNN and CNN International hosted by Wolf Blitzer that first aired on August 8, 2005. The broadcast currently airs weekdays live from 5:00PM to 6:30PM ET from Washington D.C. The show begins with the following open: \"Happening Now ..... We want to welcome our viewers in the United States and around the world. I'm Wolf Blitzer, and You're in the Situation Room\", which includes highlights of what the show will discuss. Current events, breaking news, and political headlines all with discussions happen during the lively program. While the show has its own correspondents such as Brian Todd and Mary Snow, the show also makes use of top CNN journalists from across the network and political analysts such as Gloria Borger, John King, David Gergen, and Candy Crowley. The show features segments such as American Solutions or Strategy Session which are lively discussions on the days most pressing issue, as well as Top Stories that showcases headlines of the day. Wolf Blitzer also presents Hot Shots which are pictures coming in from around the world. Normally at the end of the program, a report by Jeanne Moos is shown that talks about unusual, off-beat soft news stories that focus on subjects related to popular culture. The report makes use of street style interviews, shots of tabloid magazine headlines, and clips garnered from videos on YouTube. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wolf Blitzer Full Cast & Crew Last Season Season 5 2009 | 208 Episodes Season 5 of The Situation Room premiered on January  1, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Situation Room. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Situation Room. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  180m, 120m Homepage   http://www.edition.cnn.com/CNN/Programs/situation.room/ Genres War & Politics Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors c 1 cfowler 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}