{"link": "https://www.themoviedb.org/tv/63639?language=en", "title": "The Expanse", "resume": "A thriller set two hundred years in the future following the case of a missing young woman who brings a hardened detective and a rogue ship's captain together in a race across the solar system to expose the greatest conspiracy in human history.", "rate": 75, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Steven Strait", "Cas Anvar", "Dominique Tipper", "Wes Chatham", "Shohreh Aghdashloo"], "character": ["Jim Holden", "Alex Kamal", "Naomi Nagata", "Amos Burton", "Chrisjen Avasarala"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63639   Expand The Expanse   (2015) User Score  Play Trailer Overview A thriller set two hundred years in the future following the case of a missing young woman who brings a hardened detective and a rogue ship's captain together in a race across the solar system to expose the greatest conspiracy in human history. Featured Crew James S. A. Corey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  53 Content Issues  0 Images Backdrops  36 Posters  12 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Steven Strait Jim Holden Cas Anvar Alex Kamal Dominique Tipper Naomi Nagata Wes Chatham Amos Burton Shohreh Aghdashloo Chrisjen Avasarala Full Cast & Crew Current Season Season 3 2018 | 13 Episodes Season 3 of The Expanse premiered on April 11, 2018. View All Seasons Social Reviews  0 Discussions  53 Subject Status Replies Last Reply F Well Played. Open 3 by  FormerlyKnownAs D Rushed (AKA Syfy knew they weren't going for a season 4 ?) Open 1 by  DarthZorG F Anna Needs To Stay Out Of Amos' Head! Open 0 by FormerlyKnownAs\n      \n     Go to Discussions Media Most Popular Videos  4 Backdrops  36 Posters  12 Recommendations   2015-06-12 Dark Matter 6.3    2015-11-20 Marvel's Jessica Jones 7.6    2015-06-19 Killjoys 6.7    2016-01-14 Colony 6.8    2004-10-18 Battlestar Galactica 8.1    2016-01-05 The Shannara Chronicles 6.4    2017-02-08 Legion 7.6    2015-06-05 Sense8 7.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.syfy.com/theexpanse Genres Drama Mystery Sci-Fi & Fantasy Keywords future space travel spaceship space conspiracy space station space opera Content Score 100 Yes! Looking good! Top Contributors 177 Elizabeth Jennings 11 tldev s 10 sheva_vitali w 10 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}