{"link": "https://www.themoviedb.org/tv/69604?language=en", "title": "Revenge Body With Khloe Kardashian", "resume": "Revenge Body with Khloé Kardashian is an upcoming American reality television series starring Khloé Kardashian that is scheduled to premiere on E!. Announced on December 16, 2015, the six-episode series will feature two people in each episode who will be getting a makeover using assistance of personal trainers and stylists leading to a \"major transformation inside and out\". Six one-hour episodes have been ordered. It will premiere on January 12, 2017. A special preview episode will air on November 23, 2016. \"We are so excited to partner with Khloé Kardashian to help these deserving people seek the ultimate revenge,\" said Jeff Olde, an executive producer of the network. \"By tapping her unlimited resources, Khloé offers transformations of true Hollywood proportions,\" he also added", "rate": 23, "genre": ["Reality"], "cast": ["Khloé Kardashian"], "character": ["Host - Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69604   Expand Revenge Body With Khloe Kardashian   (2017) User Score  Play Trailer Overview Revenge Body with Khloé Kardashian is an upcoming American reality television series starring Khloé Kardashian that is scheduled to premiere on E!. Announced on December 16, 2015, the six-episode series will feature two people in each episode who will be getting a makeover using assistance of personal trainers and stylists leading to a \"major transformation inside and out\". Six one-hour episodes have been ordered. It will premiere on January 12, 2017. A special preview episode will air on November 23, 2016. \"We are so excited to partner with Khloé Kardashian to help these deserving people seek the ultimate revenge,\" said Jeff Olde, an executive producer of the network. \"By tapping her unlimited resources, Khloé offers transformations of true Hollywood proportions,\" he also added Featured Crew Khloé Kardashian Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  2 Opening Credits  0 Top Billed Cast Khloé Kardashian Host - Herself Full Cast & Crew Current Season Season 2 2018 | 8 Episodes Season 2 of Revenge Body With Khloe Kardashian premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Revenge Body With Khloe Kardashian. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.eonline.com/shows/revenge_body_with_khloe_kardashian Genres Reality Keywords fitness-training transformation cheesy gym instructor personal trainers Content Score 71 Just a little bit more... Top Contributors Ø 33 Øcims 12 Emily Stross b 6 basher TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}