{"link": "https://www.themoviedb.org/tv/3406?language=en", "title": "ReGenesis", "resume": "ReGenesis is a Canadian television program produced by The Movie Network and Movie Central in conjunction with Shaftesbury Films. The series, which ran for four seasons, revolves around the scientists of NorBAC, a fictional organization with a lab based in Toronto. The organization investigates problems of a scientific nature, such as bio-terrorism, mysterious diseases or radical changes in environment throughout Canada, the United States, and Mexico. NorBAC is headed by David Sandström, the chief scientist and molecular biologist. Through this character the show often addresses topical social, political and ethical issues related to the science at hand.\nThe series was originally seen on The Movie Network and Movie Central with rebroadcasts on Global and Showcase in Canada. Internationally it can be seen on FX in the United Kingdom, The Science Channel, Halogen TV and in syndication and CW Plus in the United States, and FX Latin America in Mexico; as well as numerous broadcasters in Europe and Asia. International distribution is handled by Oasis International. As of April 2012 the show can also be seen on Hulu.com.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Peter Outerbridge", "Conrad Pla", "Mayko Nguyen", "Dmitry Chepovetsky", "Greg Bryk"], "character": ["David Sandström", "Carlos Serrano", "Mayko Tran", "Bob Melnikov", "Weston Field"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3406   Expand ReGenesis   (2004) User Score  Play Trailer Overview ReGenesis is a Canadian television program produced by The Movie Network and Movie Central in conjunction with Shaftesbury Films. The series, which ran for four seasons, revolves around the scientists of NorBAC, a fictional organization with a lab based in Toronto. The organization investigates problems of a scientific nature, such as bio-terrorism, mysterious diseases or radical changes in environment throughout Canada, the United States, and Mexico. NorBAC is headed by David Sandström, the chief scientist and molecular biologist. Through this character the show often addresses topical social, political and ethical issues related to the science at hand. The series was originally seen on The Movie Network and Movie Central with rebroadcasts on Global and Showcase in Canada. Internationally it can be seen on FX in the United Kingdom, The Science Channel, Halogen TV and in syndication and CW Plus in the United States, and FX Latin America in Mexico; as well as numerous broadcasters in Europe and Asia. International distribution is handled by Oasis International. As of April 2012 the show can also be seen on Hulu.com. Featured Crew Christina Jennings Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Outerbridge David Sandström Conrad Pla Carlos Serrano Mayko Nguyen Mayko Tran Dmitry Chepovetsky Bob Melnikov Greg Bryk Weston Field Full Cast & Crew Last Season Season 4 2008 | 13 Episodes Season 4 of ReGenesis premiered on March  2, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  2 Recommendations   2004-07-19 The Grid 7.0    2015-04-15 The Delivery Man 6.5    2010-07-12 The Silence 6.8    2003-01-27 Veritas: The Quest 6.3    30 Days of Night: Blood Trails 5.0    2002-06-16 The Dead Zone 6.5    2005-09-19 Surface 6.6    2005-12-10 Painkiller Jane 6.0  Facts Status  Ended Networks Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  50m Homepage   http://www.regenesistv.com/indexframeset.html Genres Sci-Fi & Fantasy Drama Keywords canada disease scientist virus Content Score 100 Yes! Looking good! Top Contributors 43 Banana 9 Julien Lefebvre S 8 Shady12 7 galani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}