{"link": "https://www.themoviedb.org/tv/63247?language=en", "title": "Westworld", "resume": "A dark odyssey about the dawn of artificial consciousness and the evolution of sin. Set at the intersection of the near future and the reimagined past, it explores a world in which every human appetite, no matter how noble or depraved, can be indulged.", "rate": 81, "genre": ["Western", "Science", "Fiction"], "cast": ["Evan Rachel Wood", "Thandie Newton", "Jeffrey Wright", "James Marsden", "Tessa Thompson"], "character": ["Dolores Abernathy", "Maeve Millay", "Bernard Lowe", "Theodore \"Teddy\" Flood", "Charlotte Hale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63247   Expand Westworld   (2016) User Score  Play Trailer Overview A dark odyssey about the dawn of artificial consciousness and the evolution of sin. Set at the intersection of the near future and the reimagined past, it explores a world in which every human appetite, no matter how noble or depraved, can be indulged. Featured Crew Jonathan Nolan Creator Lisa Joy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  63 Content Issues  3 Images Backdrops  30 Posters  31 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Evan Rachel Wood Dolores Abernathy Thandie Newton Maeve Millay Jeffrey Wright Bernard Lowe James Marsden Theodore \"Teddy\" Flood Tessa Thompson Charlotte Hale Full Cast & Crew Current Season Season Two: The Door 2018 | 10 Episodes View All Seasons Social Reviews  2 Discussions  66 A review by Charles Dance  3.0 Written by  Charles Dance  on February 13, 2017 It's a shame that this series isn't working out so far The makers really should have followed the cheap and cheerful vibe of the 1973 movie. At least that was fun! This series suffers the post millennial habit of taking itself far too seriously ( think of the Daniel Craig Bond films) to the point that it becomes a chore to watch. The 1973 movie starring Yul Brynner and Richard Benjamin got everything right. Keep it simple, keep it fun. That way lies a far more rewarding viewing experience. Read All Reviews Media Most Popular Videos  1 Backdrops  30 Posters  31 Recommendations   2016-07-15 Stranger Things 8.4    2011-12-04 Black Mirror 8.2    2015-05-27 Mr. Robot 7.8    2014-04-15 Fargo 8.2    2014-01-12 True Detective 8.1    2015-04-10 Marvel's Daredevil 7.7    2010-07-25 Sherlock 8.3    2013-02-01 House of Cards 8.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hbo.com/westworld Genres Western Science Fiction Keywords android artificial intelligence remake role playing second life robot wild west theme park based on movie ethical dilemma moral dilemma Content Score 100 Yes! Looking good! Top Contributors 508 janar 97 Elizabeth Jennings PA 30 Paulo Almeida 20 Logan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}