{"link": "https://www.themoviedb.org/tv/33507?language=en", "title": "Total Drama: Revenge of the Island", "resume": "Total Drama: Revenge of the Island is the fourth season of the Total Drama franchise. The series' extension was commissioned by Teletoon from the producers, Fresh TV Inc. It is a sequel to Total Drama Island, Total Drama Action, and Total Drama World Tour and is a parody of reality TV shows, with this series taking the contestants back to Camp Wawanakwa, only this time the island is radioactive. Previous contestants from past seasons no longer compete in Total Drama: Revenge of the Island since this season features an entire new cast. The thirteen new contestants who are introduced in here are Anne Maria, B, Brick, Cameron, Dakota, Dawn, Jo, Lightning, Mike, Sam, Scott, Staci, and Zoey. This new season has new friendships, new rivalries, new relationships, and the biggest drama to date. However, the season is only half the length of any previous seasons, with just 13 episodes. The purpose for this season is not just to start all over again, but to introduce the new cast to what the older contestants have gone through before and to get them ready for Total Drama All-Stars. Such a change will occur again in Total Drama: Pahkitew Island.", "rate": 80, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33507   Expand Total Drama: Revenge of the Island   (2012) User Score Overview Total Drama: Revenge of the Island is the fourth season of the Total Drama franchise. The series' extension was commissioned by Teletoon from the producers, Fresh TV Inc. It is a sequel to Total Drama Island, Total Drama Action, and Total Drama World Tour and is a parody of reality TV shows, with this series taking the contestants back to Camp Wawanakwa, only this time the island is radioactive. Previous contestants from past seasons no longer compete in Total Drama: Revenge of the Island since this season features an entire new cast. The thirteen new contestants who are introduced in here are Anne Maria, B, Brick, Cameron, Dakota, Dawn, Jo, Lightning, Mike, Sam, Scott, Staci, and Zoey. This new season has new friendships, new rivalries, new relationships, and the biggest drama to date. However, the season is only half the length of any previous seasons, with just 13 episodes. The purpose for this season is not just to start all over again, but to introduce the new cast to what the older contestants have gone through before and to get them ready for Total Drama All-Stars. Such a change will occur again in Total Drama: Pahkitew Island. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Total Drama: Revenge of the Island premiered on January  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2007-07-08 Total Drama Island 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Animation Keywords island competition sequel Content Score 56 We're so close, yet so far. Top Contributors 7 Banana 2 danimados 1 Elizabeth Jennings w 1 whitetigerx8  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}