{"link": "https://www.themoviedb.org/tv/15571?language=en", "title": "Holocaust", "resume": "Holocaust is an American television miniseries broadcast in four parts in 1978 on the NBC television network. The series tells the story of the Holocaust from the perspective of the Weiss family of German Jews and that of a rising member of the SS, who gradually becomes a merciless war criminal. Holocaust highlighted numerous important events which occurred up to and during World War II, such as Kristallnacht, the creation of Jewish ghettos and later, the use of gas chambers. Although the miniseries won several awards and received critical acclaim, it was criticized by some, including noted Holocaust survivor and author Elie Wiesel, who described it as \"untrue and offensive.\"", "rate": 76, "genre": ["Drama"], "cast": ["Meryl Streep", "Rosemary Harris", "Tovah Feldshuh", "Michael Moriarty", "Joseph Bottoms"], "character": ["Inga Helms Weiss", "Berta Palitz-Weiss", "Helena Weiss-Slomová", "Erik Dorf", "Rudi Weiss"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15571   Expand Holocaust   (1978) User Score Overview Holocaust is an American television miniseries broadcast in four parts in 1978 on the NBC television network. The series tells the story of the Holocaust from the perspective of the Weiss family of German Jews and that of a rising member of the SS, who gradually becomes a merciless war criminal. Holocaust highlighted numerous important events which occurred up to and during World War II, such as Kristallnacht, the creation of Jewish ghettos and later, the use of gas chambers. Although the miniseries won several awards and received critical acclaim, it was criticized by some, including noted Holocaust survivor and author Elie Wiesel, who described it as \"untrue and offensive.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Meryl Streep Inga Helms Weiss Rosemary Harris Berta Palitz-Weiss Tovah Feldshuh Helena Weiss-Slomová Michael Moriarty Erik Dorf Joseph Bottoms Rudi Weiss Full Cast & Crew Last Season Season 1 1978 | 5 Episodes Season 1 of Holocaust premiered on April 16, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations   1978-10-01 Centennial 7.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  540m, 475m Homepage  - Genres Drama Keywords jew holocaust world war ii miniseries historical drama 1940s Content Score 86 Almost there... Top Contributors TB 26 TMDb Bot S 15 Samara 12 Banana z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}