{"link": "https://www.themoviedb.org/tv/32694?language=en", "title": "Outsourced", "resume": "Outsourced is an American television sitcom set in an Indian workplace. It is based on the John Jeffcoat film of the same name and adapted by Robert Borden of George Lopez and Universal Media Studios for NBC. The series originally ran from September 23, 2010 to May 12, 2011. The show was officially picked up by NBC on May 7, 2010 and on October 18, 2010, the show received a full season order. Outsourced was filmed at Radford Studios in Studio City, Los Angeles, California.\nWhen the renewal of the show was not announced with renewal of other NBC shows, the cast and crew started a campaign for fans of the show to request its renewal. On May 13, 2011, NBC announced that Outsourced was cancelled.\nOutsourced is set in a call center in Bombay, India, where an American novelties company has recently outsourced its order processing. A lone American manages the call center and must explain American popular culture to his employees as he tries to understand Indian culture.", "rate": 67, "genre": ["Comedy"], "cast": ["Rebecca Hazlewood", "Sacha Dhawan", "Diedrich Bader", "Jessica Gower", "Pippa Black"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32694   Expand Outsourced   (2010) User Score Overview Outsourced is an American television sitcom set in an Indian workplace. It is based on the John Jeffcoat film of the same name and adapted by Robert Borden of George Lopez and Universal Media Studios for NBC. The series originally ran from September 23, 2010 to May 12, 2011. The show was officially picked up by NBC on May 7, 2010 and on October 18, 2010, the show received a full season order. Outsourced was filmed at Radford Studios in Studio City, Los Angeles, California. When the renewal of the show was not announced with renewal of other NBC shows, the cast and crew started a campaign for fans of the show to request its renewal. On May 13, 2011, NBC announced that Outsourced was cancelled. Outsourced is set in a call center in Bombay, India, where an American novelties company has recently outsourced its order processing. A lone American manages the call center and must explain American popular culture to his employees as he tries to understand Indian culture. Featured Crew Robert Borden Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rebecca Hazlewood Sacha Dhawan Diedrich Bader Jessica Gower Pippa Black Full Cast & Crew Last Season Season 1 2010 | 22 Episodes Season 1 of Outsourced premiered on September 23, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Outsourced. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2011-09-22 Whitney 3.8    2013-05-23 Save Me 7.4    2011-09-14 Up All Night 6.2    2013-09-26 The Michael J. Fox Show 5.6    2010-09-28 No Ordinary Family 6.1    2010-09-22 Better With You 6.0    2011-02-09 Mr. Sunshine 6.4    2009-09-28 Trauma 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 21m Homepage   http://www.nbc.com/outsourced/ Genres Comedy Keywords indian lead call center india sitcom living abroad workplace comedy Content Score 93 Almost there... Top Contributors j 9 josetto 8 Banana 5 nazgul5 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}