{"link": "https://www.themoviedb.org/tv/12208?language=en", "title": "One Night Stand", "resume": "One Night Stand is an HBO stand-up series that first aired on February 15, 1989. The half-hour series aired weekly and featured stand-up comedy specials from some of the top performing comedians. The series originally comprised 55 specials over the course of its four years on HBO. Comedians who performed One Night Stand's include Bill Hicks, Bill Maher, Colin Quinn, Dom Irrera, Gilbert Gottfried, Norm Macdonald, Eddie Griffin, Martin Lawrence, D.L. Hughley, Damon Wayans, Larry Miller, Ellen DeGeneres, Louis C.K., Charles Fleischer, and George Wallace. This first-run of the series ended in 1992, with repeats edited for language and time continuing for years over Comedy Central, a former sister network to HBO.\nOne Night Stand returned on August 19, 2005. The series aired each Friday at midnight through October 21, 2005, showing a total of ten half-hour stand-up specials. Some of the comedians included are star of the HBO series Lucky Louie, Louis C.K., Jim Norton, Patrice O'Neal, Bill Burr, Bonnie McFarlane, Kevin Brennan, Omid Djalili, Flight of the Conchords, and more. The 2005 version was directed by Linda Mendoza.", "rate": 100, "genre": ["Comedy"], "cast": ["Jerry Seinfeld"], "character": ["Charles' brother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12208   Expand One Night Stand   (1989) User Score Overview One Night Stand is an HBO stand-up series that first aired on February 15, 1989. The half-hour series aired weekly and featured stand-up comedy specials from some of the top performing comedians. The series originally comprised 55 specials over the course of its four years on HBO. Comedians who performed One Night Stand's include Bill Hicks, Bill Maher, Colin Quinn, Dom Irrera, Gilbert Gottfried, Norm Macdonald, Eddie Griffin, Martin Lawrence, D.L. Hughley, Damon Wayans, Larry Miller, Ellen DeGeneres, Louis C.K., Charles Fleischer, and George Wallace. This first-run of the series ended in 1992, with repeats edited for language and time continuing for years over Comedy Central, a former sister network to HBO. One Night Stand returned on August 19, 2005. The series aired each Friday at midnight through October 21, 2005, showing a total of ten half-hour stand-up specials. Some of the comedians included are star of the HBO series Lucky Louie, Louis C.K., Jim Norton, Patrice O'Neal, Bill Burr, Bonnie McFarlane, Kevin Brennan, Omid Djalili, Flight of the Conchords, and more. The 2005 version was directed by Linda Mendoza. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Seinfeld Charles' brother Full Cast & Crew Last Season Season 5 2005 | 10 Episodes Season 5 of One Night Stand premiered on August 19, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on One Night Stand. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords stand-up comedy stand-up comedian Content Score 56 We're so close, yet so far. Top Contributors 6 Banana a 1 alexmate 1 t0by r 1 rollotamasi13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}