{"link": "https://www.themoviedb.org/tv/10275?language=en", "title": "Ancient Mysteries", "resume": "Ancient Mysteries is a television series that was produced by FilmRoos and originally broadcast on A&E between 7 January 1994 and 3 May 1998 with reruns airing until 2000. Reruns were also re-broadcast on The Biography Channel during the 2000s. The series deals with historical mysteries and is mostly hosted by Leonard Nimoy, which recalls the late-1970s TV Series In Search Of.... As of June 2013, some episodes of this series were available on Netflix instant streaming.", "rate": 80, "genre": ["Documentary", "Mystery"], "cast": ["Leonard Nimoy"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10275   Expand Ancient Mysteries   (1994) User Score  Play Trailer Overview Ancient Mysteries is a television series that was produced by FilmRoos and originally broadcast on A&E between 7 January 1994 and 3 May 1998 with reruns airing until 2000. Reruns were also re-broadcast on The Biography Channel during the 2000s. The series deals with historical mysteries and is mostly hosted by Leonard Nimoy, which recalls the late-1970s TV Series In Search Of.... As of June 2013, some episodes of this series were available on Netflix instant streaming. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leonard Nimoy Narrator Full Cast & Crew Last Season Season 5 1997 | 9 Episodes Season 5 of Ancient Mysteries premiered on August  7, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1998-10-20 The FBI Files 8.3    1983-01-17 Frontline 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Documentary Mystery Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 amian123 w 3 webmaster p 2 peechyking D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}