{"link": "https://www.themoviedb.org/tv/61931?language=en", "title": "Banana", "resume": "Witty, heartfelt and unique interlinked stories covering different aspects of LGBT life, featuring the most exciting emerging talent.", "rate": 77, "genre": ["Drama"], "cast": ["Freddie Fox", "Letitia Wright", "Fisayo Akinade", "Hannah John-Kamen", "Bethany Black"], "character": ["Freddie Baxter", "Vivienne Scott", "Dean Monroe", "Violet", "Helen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61931   Expand Banana   (2015) User Score Overview Witty, heartfelt and unique interlinked stories covering different aspects of LGBT life, featuring the most exciting emerging talent. Featured Crew Russell T. Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Freddie Fox Freddie Baxter Letitia Wright Vivienne Scott Fisayo Akinade Dean Monroe Hannah John-Kamen Violet Bethany Black Helen Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Banana premiered on January 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2015-04-08 Your Family or Mine 4.6    2015-01-22 Cucumber 7.9    2015-01-22 Backstrom 6.4    2014-05-29 Undateable 6.2    2016-03-15 Crowded 6.4    2016-03-02 The Real O'Neals 7.7    2014-03-06 Sirens 7.3    2015-02-19 The Odd Couple 5.4  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.channel4.com/programmes/banana Genres Drama Keywords gay self-discovery lgbt young adult manchester Content Score 100 Yes! Looking good! Top Contributors 25 Elizabeth Jennings 6 Simon 6 Nero Kosonen O 4 OblateSphereDroid  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}