{"link": "https://www.themoviedb.org/tv/60948?language=en", "title": "12 Monkeys", "resume": "The provocative story of Cole, a time traveler from a decimated future in a high-stakes race against the clock. Utilizing a dangerous and untested method of time travel, he journeys from 2043 to the present day on a mission to locate and eradicate the source of a deadly plague that will all but annihilate the human race.", "rate": 66, "genre": ["Drama", "Science", "Fiction"], "cast": ["Aaron Stanford", "Amanda Schull", "Barbara Sukowa", "Emily Hampshire", "Demore Barnes"], "character": ["James Cole", "Cassandra Railly", "Katarina Jones", "Jennifer Goines", "Marcus Whitley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60948   Expand 12 Monkeys   (2015) User Score  Play Trailer Overview The provocative story of Cole, a time traveler from a decimated future in a high-stakes race against the clock. Utilizing a dangerous and untested method of time travel, he journeys from 2043 to the present day on a mission to locate and eradicate the source of a deadly plague that will all but annihilate the human race. Featured Crew Terry Matalas Creator Travis Fickett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  2 Images Backdrops  45 Posters  27 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Aaron Stanford James Cole Amanda Schull Cassandra Railly Barbara Sukowa Katarina Jones Emily Hampshire Jennifer Goines Demore Barnes Marcus Whitley Full Cast & Crew Current Season Season 4 2018 | 11 Episodes View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Two Episode Series Finale coming up soon Open 4 by  ScorpionQ2 D I think they should cast Alisen Down in a Star Wars movie Open 1 by  write2topcat OK Cole let's go save the wo.... Open 1 by  Zack37 Go to Discussions Media Most Popular Videos  2 Backdrops  45 Posters  27 Recommendations   2012-05-27 Continuum 7.1    2013-04-15 Defiance 6.2    2014-01-10 Helix 6.4    2015-06-01 The Whispers 5.7    2014-06-19 Dominion 5.9    2015-05-14 Wayward Pines 6.5    2013-09-16 Sleepy Hollow 6.4    2015-06-19 Killjoys 6.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.syfy.com/12monkeys Genres Drama Science Fiction Keywords post-apocalyptic time travel based on movie plague Content Score 100 Yes! Looking good! Top Contributors 115 Elizabeth Jennings 27 Marso 27 Imzadi M 16 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}