{"link": "https://www.themoviedb.org/tv/23557?language=en", "title": "The Secret of Cerulean Sand", "resume": "Secret of Cerulean Sand is a 26-episode anime TV series. It is about Jane Buxton, a 15-year-old English girl, a visionary ahead of her time who dreams of building a flying machine. The series documents her journey through the Near East to find her brother. It is set in the late 19th century where impossible technologies such as landships and \"floating liquid\" exist side by side in this exciting steampunk world.\nThe series is loosely based on two works by Jules Verne; his posthumous 1919 novel The Barsac Mission as well as his 1896 novel Facing the Flag.", "rate": 60, "genre": ["Action", "Adventure", "Animation"], "cast": ["Naomi Kusumi", "Masaaki Tsukada", "Ema Kogure", "Rokuro Naya"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23557   Expand The Secret of Cerulean Sand   (2002) User Score Overview Secret of Cerulean Sand is a 26-episode anime TV series. It is about Jane Buxton, a 15-year-old English girl, a visionary ahead of her time who dreams of building a flying machine. The series documents her journey through the Near East to find her brother. It is set in the late 19th century where impossible technologies such as landships and \"floating liquid\" exist side by side in this exciting steampunk world. The series is loosely based on two works by Jules Verne; his posthumous 1919 novel The Barsac Mission as well as his 1896 novel Facing the Flag. Featured Crew Jules Verne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Naomi Kusumi Masaaki Tsukada Ema Kogure Rokuro Naya Full Cast & Crew Last Season Season 1 2002 | 26 Episodes Season 1 of The Secret of Cerulean Sand premiered on January  5, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Secret of Cerulean Sand. You can help by rating TV shows you've seen. Facts Original Name  パタパタ飛行船の冒険 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Keywords anime Content Score 79 Pump it up! We're close now. Top Contributors M 12 Migi 6 renegita 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}