{"link": "https://www.themoviedb.org/tv/7744?language=en", "title": "Sid the Science Kid", "resume": "Sid the Science Kid is a half-hour PBS Kids series that debuted on September 1, 2008. The computer generated show is produced by The Jim Henson Company and then-PBS member KCET in Los Angeles, California using the Henson Digital Puppetry Studio. The show is produced by motion capture which allows puppeteers to voice digitally animated characters in real time. Production began in the fall of 2008 with 42 half-hour episodes of Sid the Science Kid having been ordered. The series debuted on PBS Kids on September 1, 2008, with a two-year on-air commitment. The original working title for the series was \"What's the Big Idea?\" and the central character, Sid, was originally named Josh.\nKOCE, the current primary PBS member for the Los Angeles area, began co-producing the show after KCET disaffiliated with PBS on December 31, 2010.\n24-hour preschool channel PBS Kids Sprout acquired Sid the Science Kid on March 25, 2013. It airs daily at 3:30pm ET.", "rate": 61, "genre": ["Animation"], "cast": ["Victor Yerrid", "Drew Massey", "Julianne Buescher", "Alice Dinnean", "Stephanie D'Abruzzo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7744   Expand Sid the Science Kid   (2008) User Score Overview Sid the Science Kid is a half-hour PBS Kids series that debuted on September 1, 2008. The computer generated show is produced by The Jim Henson Company and then-PBS member KCET in Los Angeles, California using the Henson Digital Puppetry Studio. The show is produced by motion capture which allows puppeteers to voice digitally animated characters in real time. Production began in the fall of 2008 with 42 half-hour episodes of Sid the Science Kid having been ordered. The series debuted on PBS Kids on September 1, 2008, with a two-year on-air commitment. The original working title for the series was \"What's the Big Idea?\" and the central character, Sid, was originally named Josh. KOCE, the current primary PBS member for the Los Angeles area, began co-producing the show after KCET disaffiliated with PBS on December 31, 2010. 24-hour preschool channel PBS Kids Sprout acquired Sid the Science Kid on March 25, 2013. It airs daily at 3:30pm ET. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victor Yerrid Drew Massey Julianne Buescher Alice Dinnean Stephanie D'Abruzzo Full Cast & Crew Last Season Season 2 2010 | 26 Episodes Season 2 of Sid the Science Kid premiered on June 21, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2007-09-03 Super Why! 5.7    2010-10-15 The Adventures of Chuck and Friends 6.0    2012-02-18 Transformers: Rescue Bots 6.8    2017-03-17 Julie's Greenroom 7.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.henson.com/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 7 ngsmonteiro 3 Maikkoum A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}