{"link": "https://www.themoviedb.org/tv/376?language=en", "title": "The Amanda Show", "resume": "The Amanda Show is an American live action sketch comedy and variety show that aired on Nickelodeon from October 16, 1999 to September 21, 2002. It starred Amanda Bynes, Drake Bell, and Nancy Sullivan, along with several performing artists who came and left at different points, such as John Kassir, Raquel Lee, and Josh Peck. The show was a spin-off from All That, in which Bynes had co-starred for several years. The show was unexpectedly cancelled at the end of 2002, according to creator Dan Schneider's blog. Writers for the show included John Hoberg, Steven Molaro, Andrew Hill Newman, and Dan Schneider.\nTwo years after the end of The Amanda Show, Dan Schneider created a new series, called Drake & Josh, featuring Drake Bell, Josh Peck and Nancy Sullivan.", "rate": 63, "genre": [], "cast": ["Camryn Walling", "Drake Bell", "John Kassir", "Josh Peck", "Nancy Sullivan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 376   Expand The Amanda Show   (1999) User Score Overview The Amanda Show is an American live action sketch comedy and variety show that aired on Nickelodeon from October 16, 1999 to September 21, 2002. It starred Amanda Bynes, Drake Bell, and Nancy Sullivan, along with several performing artists who came and left at different points, such as John Kassir, Raquel Lee, and Josh Peck. The show was a spin-off from All That, in which Bynes had co-starred for several years. The show was unexpectedly cancelled at the end of 2002, according to creator Dan Schneider's blog. Writers for the show included John Hoberg, Steven Molaro, Andrew Hill Newman, and Dan Schneider. Two years after the end of The Amanda Show, Dan Schneider created a new series, called Drake & Josh, featuring Drake Bell, Josh Peck and Nancy Sullivan. Featured Crew Dan Schneider Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Camryn Walling Drake Bell John Kassir Josh Peck Nancy Sullivan Full Cast & Crew Last Season Season 3 2002 | 10 Episodes Season 3 of The Amanda Show premiered on January 19, 2002. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply S Moody's point Open 0 by Strannger18\n      \n     S Penelope Tate Open 0 by Strannger18\n      \n     S Judge Judy and the dancing lobsters Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1999-11-28 Little Bill 3.6    2001-08-11 Cubix 4.3    1996-07-15 Kenan & Kel 7.4    2007-11-16 Chowder 6.5    1999-11-12 Mike, Lu & Og 3.3    2001-02-03 Lloyd in Space 4.8    1993-09-06 Adventures of Sonic the Hedgehog 4.9    1998-01-01 ChalkZone 5.6  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m, 30m, 23m Homepage   http://www.amandaplease.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Jaime Neto s 3 speedycars c 2 cornbean 1 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}