{"link": "https://www.themoviedb.org/tv/4554?language=en", "title": "Raines", "resume": "Raines is a crime drama television series that ran from March 15, 2007 to April 27, 2007 on NBC in the United States. The show premiered as a mid-season replacement, as well as airing on CH in Canada, TV3 in Ireland, ITV3 in the UK, and on Network Ten in Australia.\nThe series focused on Michael Raines, a 'mentally haunted' LAPD detective, who interacts with imaginary manifestations of dead crime victims in order to solve criminal cases. Raines must deal with his unique, unintentional method, as it causes problems with his co-workers and in his personal life.\nThe first two episodes aired on Thursday nights at 10:00 PM Eastern Time during the time slot normally occupied by ER. The third episode aired eight days later, taking up its regular Friday at 9:00 PM time slot.\nOn May 14, 2007, NBC announced its schedule for the 2007-2008 television season. Raines was left off this list, and was officially cancelled.", "rate": 73, "genre": ["Crime", "Drama"], "cast": ["Jeff Goldblum", "Matt Craven", "Nicole Sullivan", "Linda Park", "Dov Davidoff"], "character": ["Michael Raines"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4554   Expand Raines   (2007) User Score Overview Raines is a crime drama television series that ran from March 15, 2007 to April 27, 2007 on NBC in the United States. The show premiered as a mid-season replacement, as well as airing on CH in Canada, TV3 in Ireland, ITV3 in the UK, and on Network Ten in Australia. The series focused on Michael Raines, a 'mentally haunted' LAPD detective, who interacts with imaginary manifestations of dead crime victims in order to solve criminal cases. Raines must deal with his unique, unintentional method, as it causes problems with his co-workers and in his personal life. The first two episodes aired on Thursday nights at 10:00 PM Eastern Time during the time slot normally occupied by ER. The third episode aired eight days later, taking up its regular Friday at 9:00 PM time slot. On May 14, 2007, NBC announced its schedule for the 2007-2008 television season. Raines was left off this list, and was officially cancelled. Featured Crew Graham Yost Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Goldblum Michael Raines Matt Craven Nicole Sullivan Linda Park Dov Davidoff Full Cast & Crew Last Season Season 1 2007 | 7 Episodes Season 1 of Raines premiered on March 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2010-09-21 Detroit 1-8-7 7.2    2015-03-25 Big Time in Hollywood, Fl 5.7    2014-01-07 Killer Women 4.8    2014-09-28 The Brokenwood Mysteries 7.6    2010-05-19 The Good Guys 7.9    2014-07-27 Manhattan 7.3    2015-01-04 The Saboteurs 7.5    2012-09-25 Vegas 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/Raines/ Genres Crime Drama Keywords hallucination police detective lapd Content Score 93 Almost there... Top Contributors 9 Banana w 3 webmaster M 1 MAthePA R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}