{"link": "https://www.themoviedb.org/tv/60874?language=en", "title": "Space Dandy", "resume": "Space Dandy is a dandy in space! This dreamy adventurer with a to-die-for pompadour travels across the galaxy in search of aliens no one has ever laid eyes on. Each new species he discovers earns him a hefty reward, but this dandy has to be quick on his feet because it’s first come – first served! Accompanied by his sidekicks, a rundown robot named QT and Meow the cat-looking space alien, Dandy bravely explores unknown worlds inhabited by a variety aliens. Join the best dressed alien hunter in all of space and time as he embarks on an adventure that ends at the edge of the universe!", "rate": 80, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60874   Expand Space Dandy   (2014) User Score Overview Space Dandy is a dandy in space! This dreamy adventurer with a to-die-for pompadour travels across the galaxy in search of aliens no one has ever laid eyes on. Each new species he discovers earns him a hefty reward, but this dandy has to be quick on his feet because it’s first come – first served! Accompanied by his sidekicks, a rundown robot named QT and Meow the cat-looking space alien, Dandy bravely explores unknown worlds inhabited by a variety aliens. Join the best dressed alien hunter in all of space and time as he embarks on an adventure that ends at the edge of the universe! Featured Crew Masahiko Minami Creator Shinichiro Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2014 | 13 Episodes Season 2 of Space Dandy premiered on July  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   2014-11-08 Sonic Boom 6.0    2007-07-08 Total Drama Island 6.2    2013-07-13 The Haunted Hathaways 2.3    2016-04-04 The Powerpuff Girls 3.5    2000-12-21 The Brak Show 7.0    2005-09-17 Johnny Test 4.2    2008-06-05 The Marvelous Misadventures of Flapjack 5.9    2014-07-11 Terror in Resonance 6.7  Facts Original Name  スペース☆ダンディ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://space-dandy.com Genres Animation Comedy Sci-Fi & Fantasy Keywords space travel anime alien hunters Content Score 64 We're so close, yet so far. Top Contributors 31 benf45 16 Elizabeth Jennings 8 sp1ti PE 8 Patrick E. Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}