{"link": "https://www.themoviedb.org/tv/61132?language=en", "title": "The World Wars", "resume": "The World Wars tells the story of three decades of war told through the eyes of various men who were its key players: Roosevelt, Hitler, Patton, Mussolini, Churchill, Tojo, DeGaulle and MacArthur. The series examines the two wars as one contiguous timeline starting in 1914 and concluding in 1945 with these unique individuals coming of age in World War I before ultimately calling the shots in World War II.", "rate": 74, "genre": ["Documentary", "War", "Politics"], "cast": ["Ian Beyts", "David Mitchum Brown", "C. Conrad Cady", "Dean Gosdin", "Don Hartman"], "character": ["Winston Churchill", "Harry S. Truman", "Vladimir Ilyich Lenin", "Franklin Delano Roosevelt", "General George Patton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61132   Expand The World Wars   (2014) User Score  Play Trailer Overview The World Wars tells the story of three decades of war told through the eyes of various men who were its key players: Roosevelt, Hitler, Patton, Mussolini, Churchill, Tojo, DeGaulle and MacArthur. The series examines the two wars as one contiguous timeline starting in 1914 and concluding in 1945 with these unique individuals coming of age in World War I before ultimately calling the shots in World War II. Featured Crew John Ealer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Beyts Winston Churchill David Mitchum Brown Harry S. Truman C. Conrad Cady Vladimir Ilyich Lenin Dean Gosdin Franklin Delano Roosevelt Don Hartman General George Patton Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of The World Wars premiered on May 26, 2014. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply M Episodes missing...!!!!! Open 1 by  Prejdickty Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The World Wars. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.history.com/shows/the-world-wars Genres Documentary War & Politics Keywords war nazi world war i world war ii joseph stalin franklin delano roosevelt benito mussolini miniseries british politics Content Score 100 Yes! Looking good! Top Contributors TB 53 TMDb Bot 27 Banana 20 Elizabeth Jennings R 10 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}