{"link": "https://www.themoviedb.org/tv/76510?language=en", "title": "My Dear Boy", "resume": "Ruby is a woman who wants to be loved but can't seem to find the right man. She loses faith in love but then meets Derek. With him, she learns to appreciate herself and those people that are important to her and begins to have faith in love again.", "rate": 60, "genre": ["Comedy"], "cast": ["Jessie Chang", "Ruby Lin", "Derek Chang", "Li Li-Ren", "Archie Kao"], "character": ["Luo Xiao Shan", "Luo Xiao Fei", "An Qing Hui", "Xiao Lai", "Xiao Ye Shi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76510   Expand My Dear Boy   (2017) User Score Overview Ruby is a woman who wants to be loved but can't seem to find the right man. She loses faith in love but then meets Derek. With him, she learns to appreciate herself and those people that are important to her and begins to have faith in love again. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessie Chang Luo Xiao Shan Ruby Lin Luo Xiao Fei Derek Chang An Qing Hui Li Li-Ren Xiao Lai Archie Kao Xiao Ye Shi Full Cast & Crew Current Season Season 1 2017 | 20 Episodes Season 1 of My Dear Boy premiered on December 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Dear Boy. You can help by rating TV shows you've seen. Facts Original Name  我的男孩 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage   https://www.gtv.com.tw/Program/P2017120101 Genres Comedy Keywords romance Content Score 86 Almost there... Top Contributors 20 galactica_j 11 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}