{"link": "https://www.themoviedb.org/tv/61555?language=en", "title": "The Missing", "resume": "A gripping anthological relationship thriller series exploring the emotional fallout of a child's abduction not only on the family but on the wider community, told over two time frames.", "rate": 69, "genre": ["Drama", "Mystery"], "cast": ["David Morrissey", "James Nesbitt", "Keeley Hawes", "Abigail Hardingham", "Tchéky Karyo"], "character": ["Sam Webster", "Tony Hughes", "Gemma Webster", "Alice Webster", "Julien Baptiste"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61555   Expand The Missing   (2014) User Score  Play Trailer Overview A gripping anthological relationship thriller series exploring the emotional fallout of a child's abduction not only on the family but on the wider community, told over two time frames. Featured Crew Jack Williams Creator Harry Williams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  2 Images Backdrops  10 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Morrissey Sam Webster James Nesbitt Tony Hughes Keeley Hawes Gemma Webster Abigail Hardingham Alice Webster Tchéky Karyo Julien Baptiste Full Cast & Crew Last Season Season 2 2016 | 8 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Alice - Spoilers Open 6 by  Satai Delenn r Best show on tv Open 5 by  rainbowfeverish64 (some SPOILERS) Would 've been awesome as a 3 episode series Open 6 by  Satai Delenn Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  8 Recommendations   2015-10-08 Unforgotten 7.7    2012-06-26 Line of Duty 8.0    2013-03-04 Broadchurch 8.1    2013-08-25 What Remains 7.1    2014-04-29 Happy Valley 7.7    2012-01-02 Endeavour 8.1    2014-10-02 Gracepoint 6.5    2016-04-04 Marcella 7.3  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Mystery Keywords missing child child kidnapping Content Score 100 Yes! Looking good! Top Contributors 97 Elizabeth Jennings a 12 afogutu AK 11 Avshalom Kor 6 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}