{"link": "https://www.themoviedb.org/tv/25891?language=en", "title": "Fafner in the Azure: Exodus", "resume": "2150 A.D. The battle with the Festum, the silicon life-forms from  distant outer space, had reached a new dimension. The North Polar Meir  that was crushed during the First Azure Operation had dispersed its  fragments all over the world. They all started activity on their own as  independent Meirs. Most of the Meirs harbored hatred towards humanity  and challenged a fight, however, a portion of the Festum chose  coexistence with mankind. Amongst the crossfire, the Ryugujima island  alone disappeared from the forefront of battle and continued its  silence. The island had gained a means to converse with the Meir since  their encounter with Misao Kurusu two years ago. The children of ALVISS  had been searching for a way to understand the enemy as they prepared  for battle. And now, once again, further evolution was about to befall  the island. A girl that understands the language of the Festum, and a  girl protected by a Festum. When the two meet, the doors to a new  universe opens.", "rate": 40, "genre": ["Animation"], "cast": ["Kohei Kiyasu", "Makoto Ishii", "Azumi Asakura", "Marika Matsumoto", "Ryoko Shiraishi"], "character": ["Sōshi Minashiro (voice)", "Kazuki Makabe (voice)", "Saki Masaoka (voice)", "Maya Tōmi (voice)", "Rina Nishio (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25891   Expand Fafner in the Azure: Exodus   (2015) User Score Overview 2150 A.D. The battle with the Festum, the silicon life-forms from  distant outer space, had reached a new dimension. The North Polar Meir  that was crushed during the First Azure Operation had dispersed its  fragments all over the world. They all started activity on their own as  independent Meirs. Most of the Meirs harbored hatred towards humanity  and challenged a fight, however, a portion of the Festum chose  coexistence with mankind. Amongst the crossfire, the Ryugujima island  alone disappeared from the forefront of battle and continued its  silence. The island had gained a means to converse with the Meir since  their encounter with Misao Kurusu two years ago. The children of ALVISS  had been searching for a way to understand the enemy as they prepared  for battle. And now, once again, further evolution was about to befall  the island. A girl that understands the language of the Festum, and a  girl protected by a Festum. When the two meet, the doors to a new  universe opens. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kohei Kiyasu Sōshi Minashiro (voice) Makoto Ishii Kazuki Makabe (voice) Azumi Asakura Saki Masaoka (voice) Marika Matsumoto Maya Tōmi (voice) Ryoko Shiraishi Rina Nishio (voice) Full Cast & Crew Last Season Season 2 2015 | 13 Episodes Season 2 of Fafner in the Azure: Exodus premiered on October  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fafner in the Azure: Exodus. You can help by rating TV shows you've seen. Facts Original Name  蒼穹のファフナー EXODUS Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords mecha Content Score 71 Just a little bit more... Top Contributors t 68 tmdb983464 6 Banana 4 BrerFox s 4 sinano  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}