{"link": "https://www.themoviedb.org/tv/6395?language=en", "title": "The Master and Margarita", "resume": "The Master and Margarita is a Russian television production of Telekanal Rossiya, based on the novel The Master and Margarita, written by Soviet writer Mikhail Bulgakov between 1928 and 1940. Vladimir Bortko directed this adaptation and was also its screenwriter.", "rate": 61, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Oleg Basilashvili", "Aleksandr Abdulov", "Aleksandr Galibin", "Anna Kovalchuk", "Kirill Lavrov"], "character": ["Воланд", "Коровин", "Мастер", "Маргарита", "Понтий Пилат"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6395   Expand The Master and Margarita   (2005) User Score Overview The Master and Margarita is a Russian television production of Telekanal Rossiya, based on the novel The Master and Margarita, written by Soviet writer Mikhail Bulgakov between 1928 and 1940. Vladimir Bortko directed this adaptation and was also its screenwriter. Featured Crew Vladimir Bortko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  14 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oleg Basilashvili Воланд Aleksandr Abdulov Коровин Aleksandr Galibin Мастер Anna Kovalchuk Маргарита Kirill Lavrov Понтий Пилат Full Cast & Crew Last Season Season 1 2005 | 12 Episodes Season 1 of The Master and Margarita premiered on December 19, 2005. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply The music was underwhelming Open 2 by  ahrabows Go to Discussions Media Most Popular Videos  0 Backdrops  14 Posters  5 Recommendations   1976-06-04 Twelve Chairs 7.5    2006-03-08 Happy Together 4.0    2010-03-29 Interny 5.7    1973-08-11 Seventeen Moments of Spring 7.5    1998-09-12 Young Hercules 6.5    1969-01-01 Nu, pogodi! 6.8    1998-10-19 The New Addams Family 6.6    1990-04-22 Jeeves and Wooster 7.7  Facts Original Name  Мастер и Маргарита Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Miniseries Original Language  Russian Runtime  53m, 44m Homepage   http://www.masterimargarita.ru Genres Drama Mystery Sci-Fi & Fantasy Keywords based on novel or book communist black magic miniseries writer devil moscow Content Score 93 Almost there... Top Contributors 52 West@ N 12 NikolaiKras I 11 ILiviu R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}