{"link": "https://www.themoviedb.org/tv/16148?language=en", "title": "F.C. De Kampioenen", "resume": "F.C. De Kampioenen, was a long-running Flemish sitcom chronicling the adventures of a fictional local football team. It aired on the Belgian-Flemish channel één between 1990 and 2011, for 21 seasons with 273 half-hour long episodes, making it one of the most successful comedy programs ever on Belgian television. In 2009 a film had been planned, but has since been cancelled following complaints by the actors about the script. In 2012 the crew announced a new script was written and a movie will be produced. The movie is to be released in December 2013.\nThe series relies heavily on stereotypical characters and farce for its humour. The story is mainly set around a few members of the football club who regularly visit the club canteen before or after a soccer training or match. The canteen is run by Pascale, who is in a relationship with Maurice. The football club is sponsored by the owner of a sausage factory, Balthazar Boma. Next to the field is an antiques shop, owned by the fraudulent Fernand. Most of the episodes are based on misunderstandings or dirty tricks from Fernand.", "rate": 65, "genre": ["Comedy"], "cast": ["Danni Heylen", "Marijn De Valck", "An Swartenbroekx", "Loes van den Heuvel", "Ann Tuts"], "character": ["Pascale De Backer", "Balthazar Boma", "Bieke Crucke", "Carmen Waterslaeghers-Vandormael", "Doortje Van Hoeck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16148   Expand F.C. De Kampioenen   (1990) User Score Overview F.C. De Kampioenen, was a long-running Flemish sitcom chronicling the adventures of a fictional local football team. It aired on the Belgian-Flemish channel één between 1990 and 2011, for 21 seasons with 273 half-hour long episodes, making it one of the most successful comedy programs ever on Belgian television. In 2009 a film had been planned, but has since been cancelled following complaints by the actors about the script. In 2012 the crew announced a new script was written and a movie will be produced. The movie is to be released in December 2013. The series relies heavily on stereotypical characters and farce for its humour. The story is mainly set around a few members of the football club who regularly visit the club canteen before or after a soccer training or match. The canteen is run by Pascale, who is in a relationship with Maurice. The football club is sponsored by the owner of a sausage factory, Balthazar Boma. Next to the field is an antiques shop, owned by the fraudulent Fernand. Most of the episodes are based on misunderstandings or dirty tricks from Fernand. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  24 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danni Heylen Pascale De Backer Marijn De Valck Balthazar Boma An Swartenbroekx Bieke Crucke Loes van den Heuvel Carmen Waterslaeghers-Vandormael Ann Tuts Doortje Van Hoeck Full Cast & Crew Last Season Reeks 21 2010 | 13 Episodes Season 21 of F.C. De Kampioenen premiered on December  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  24 Recommendations We don't have enough data to suggest any TV shows based on F.C. De Kampioenen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.een.be/programmas/f.c.-de-kampioenen/ Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors P 42 Pmaestro 3 Mathias Van Der Bruggen 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}