{"link": "https://www.themoviedb.org/tv/48462?language=en", "title": "The Heirs", "resume": "Heirs follows a group of privileged, elite high school students as they are groomed to take over their families' business empires. These wealthy students seem to have everything under control–except their love lives. Kim Tan is heir to the Empire Group sent to study abroad in the U.S. In reality it's a form of exile, as his elder half-brother back home schemes to takes over the family business. While in the States, Kim Tan bumps into Cha Eun Sung, who's arrived from Korea in search of her older sister. He feels himself falling for her, never realizing that she's the daughter of his family's housekeeper. When his fiancée Rachel Yoo arrives to bring him back to Korea, his heart is torn between love and duty. Meanwhile, Rachel's half-brother Choi Young Do develops his own crush on Eun Sung. Who said being a rich, beautiful high school student was easy?", "rate": 74, "genre": ["Comedy", "Drama"], "cast": ["Lee Min-ho", "Park Shin-hye", "Kim Woo-bin", "Choi Jin-hyuk", "Kim Ji-Won"], "character": ["Kim Tan", "Cha Eun-sang", "Choi Young-do", "Kim Won", "Rachel Yoo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48462   Expand The Heirs   (2013) User Score Overview Heirs follows a group of privileged, elite high school students as they are groomed to take over their families' business empires. These wealthy students seem to have everything under control–except their love lives. Kim Tan is heir to the Empire Group sent to study abroad in the U.S. In reality it's a form of exile, as his elder half-brother back home schemes to takes over the family business. While in the States, Kim Tan bumps into Cha Eun Sung, who's arrived from Korea in search of her older sister. He feels himself falling for her, never realizing that she's the daughter of his family's housekeeper. When his fiancée Rachel Yoo arrives to bring him back to Korea, his heart is torn between love and duty. Meanwhile, Rachel's half-brother Choi Young Do develops his own crush on Eun Sung. Who said being a rich, beautiful high school student was easy? Featured Crew Kim Eun-sook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Min-ho Kim Tan Park Shin-hye Cha Eun-sang Kim Woo-bin Choi Young-do Choi Jin-hyuk Kim Won Kim Ji-Won Rachel Yoo Full Cast & Crew Last Season Season 1 2013 | 20 Episodes Season 1 of The Heirs premiered on October  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  7 Recommendations   2010-03-31 Personal Taste 7.4    2011-05-09 Lie To Me 7.6    2014-01-24 Emergency Couple 8.8    2012-03-26 Love Rain 7.3    2013-08-05 Good Doctor 8.6    2014-12-08 Healer 8.7    2013-01-07 Flower Boy Next Door 7.2    2013-06-05 I Hear Your Voice 8.2  Facts Original Name  상속자들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://tv.sbs.co.kr/theheirs/ Genres Comedy Drama Keywords korea Content Score 93 Almost there... Top Contributors M 28 Maria180493 NS 28 Norte Serra 14 Elizabeth Jennings K 13 Kevin.Wood  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}