{"link": "https://www.themoviedb.org/tv/69205?language=en", "title": "Introverted Boss", "resume": "Can you actually not show what your true colors are while working with a lot of people? Eun Hwan Ki, the director of the top public relations agency, is a mysterious man known as “The Silent Monster.” No one knows much about him because he always avoids eye contact and appears coldly aloof and arrogant, but in truth he’s an extreme introvert — a PR executive who hates attention and is too shy to be around people. Chae Ro Woon begins to work at Eun Hwan Ki’s company. She is very energetic, the extroverted type and receives recognition for her work, but her only interest is in CEO Eun Hwan Ki. She plans to reveal who Eun Hwan-Ki really is.", "rate": 90, "genre": ["Comedy"], "cast": ["Yeon Woo-jin", "Park Hye-Soo", "Yoon Park", "Gong Seung-yeon", "Ye Ji-won"], "character": ["Eun Hwan-Ki", "Chae Ro-Woon", "Kang Woo-Il", "Eun Yi-Soo", "Dang Yoo-Hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69205   Expand Introverted Boss   (2017) User Score Overview Can you actually not show what your true colors are while working with a lot of people? Eun Hwan Ki, the director of the top public relations agency, is a mysterious man known as “The Silent Monster.” No one knows much about him because he always avoids eye contact and appears coldly aloof and arrogant, but in truth he’s an extreme introvert — a PR executive who hates attention and is too shy to be around people. Chae Ro Woon begins to work at Eun Hwan Ki’s company. She is very energetic, the extroverted type and receives recognition for her work, but her only interest is in CEO Eun Hwan Ki. She plans to reveal who Eun Hwan-Ki really is. Featured Crew Joo Hwa-Mi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeon Woo-jin Eun Hwan-Ki Park Hye-Soo Chae Ro-Woon Yoon Park Kang Woo-Il Gong Seung-yeon Eun Yi-Soo Ye Ji-won Dang Yoo-Hee Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Introverted Boss premiered on January 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2017-01-25 Chief Kim 7.5    2017-11-11 Money Flower 8.0    2017-10-11 Mad Dog 8.0    2017-10-09 Witch's Court 9.3    2017-03-27 Whisper 6.8    2017-04-07 Chicago Typewriter 7.0    2017-09-27 While You Were Sleeping 9.0    2017-03-15 Radiant Office 6.9  Facts Original Name  내성적인 보스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/introvertedboss/ Genres Comedy Keywords romance korea Content Score 93 Almost there... Top Contributors M 43 Maria180493 13 Imzadi z 10 zurman1 l 4 llluqiang  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}