{"link": "https://www.themoviedb.org/tv/456?language=en", "title": "The Simpsons", "resume": "Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.", "rate": 71, "genre": ["Animation", "Comedy"], "cast": ["Nancy Cartwright", "Dan Castellaneta", "Julie Kavner", "Yeardley Smith", "Harry Shearer"], "character": ["Bart Simpson / Nelson Muntz / Ralph Wiggum / Todd Flanders / Kearney / Various (voice)", "Homer Simpson / Abraham Simpson / Krusty the Klown / Barney / Willy / Sideshow Mel / Mayor Quimby / Hans Moleman / Gil / Itchy / Various (voice)", "Marge Simpson / Patty Bouvier / Selma Bouvier / Jacqueline Ingrid Bouvier / Various (voice)", "Lisa Simpson / Various (voice)", "Mr. Burns / Mr. Smithers / Principal Skinner / Ned Flanders / Reverend Lovejoy / Dr. Hibbert / Various (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 456   Expand The Simpsons   (1989) User Score Overview Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general. Featured Crew Matt Groening Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  10 Images Backdrops  55 Posters  37 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Nancy Cartwright Bart Simpson / Nelson Muntz / Ralph Wiggum / Todd Flanders / Kearney / Various (voice) Dan Castellaneta Homer Simpson / Abraham Simpson / Krusty the Klown / Barney / Willy / Sideshow Mel / Mayor Quimby / Hans Moleman / Gil / Itchy / Various (voice) Julie Kavner Marge Simpson / Patty Bouvier / Selma Bouvier / Jacqueline Ingrid Bouvier / Various (voice) Yeardley Smith Lisa Simpson / Various (voice) Harry Shearer Mr. Burns / Mr. Smithers / Principal Skinner / Ned Flanders / Reverend Lovejoy / Dr. Hibbert / Various (voice) Full Cast & Crew Last Season Season 29 2017 | 21 Episodes Season 29 of The Simpsons premiered on October  1, 2017. View All Seasons Social Reviews  2 Discussions  22 T A review by Thomaxz  10.0 Written by  Thomaxz  on March 11, 2017 The awkward of Homer, and his family, and the endless stories. Is fun, and of course Homer legendary expression \"Do'h\" with has been taking into the dictionary. If you one of the few, who has been living under a rock, go see an episode. Read All Reviews Media Most Popular Videos  1 Backdrops  55 Posters  37 Recommendations   1999-03-28 Futurama 8.2    1997-08-13 South Park 7.8    1999-01-31 Family Guy 6.5    2005-02-06 American Dad! 6.2    2000-01-09 Malcolm in the Middle 7.5    2003-09-22 Two and a Half Men 6.2    1994-09-22 Friends 7.8    2001-10-02 Scrubs 7.7  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.thesimpsons.com/ Genres Animation Comedy Keywords mother baby alcohol cat brother clown house housewife beer satire father parody middle class sister dysfunctional family nuclear power plant teacher social satire neighbor school dummy dog donuts grandparent Content Score 100 Yes! Looking good! Top Contributors 984 lineker 193 d00ziie A 104 AnthonyAtkins232 68 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}