{"link": "https://www.themoviedb.org/tv/2331?language=en", "title": "Phoenix Nights", "resume": "Peter Kay's Phoenix Nights is a British sitcom about The Phoenix Club, a working men's club in the northern English town of Farnworth, Greater Manchester. The show was written by Neil Fitzmaurice, Peter Kay and Dave Spikey, produced by Goodnight Vienna Productions and Ovation Entertainments, and was broadcast on Channel 4 in the UK. All the music was written by Toni Baker and Peter Kay. Additional material was provided by Paddy McGuinness. Two series have been produced, which were first transmitted in 2001 and 2002.\nThe show is a spin-off from the spoof documentary series That Peter Kay Thing, and in turn gave rise to the spin-off Max and Paddy's Road to Nowhere. It won the People's Choice Award at the British Comedy Awards 2002, and was nominated for several others. Kay is also its star, in multiple roles, and directed the second series. In September 2006, Kay revealed on BBC Radio 1 that a third series of Phoenix Nights has been written, but it is unknown when the series will be filmed. On 8 May 2007, another announcement by Kay was made promising another series will be made.\nHowever Dave Spikey, in interviews with The Sentinel and the Croydon Guardian in late-2009, claimed that neither he nor fellow co-writer Neil Fitzmaurice were aware of any plans to bring back the series.", "rate": 83, "genre": ["Comedy"], "cast": ["Peter Kay", "Dave Spikey", "Neil Fitzmaurice", "Paddy McGuinness", "Justin Moorhouse"], "character": ["Brian Potter/Max", "Jerry St Clair", "Ray Von", "Paddy", "Young Kenny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2331   Expand Phoenix Nights   (2001) User Score Overview Peter Kay's Phoenix Nights is a British sitcom about The Phoenix Club, a working men's club in the northern English town of Farnworth, Greater Manchester. The show was written by Neil Fitzmaurice, Peter Kay and Dave Spikey, produced by Goodnight Vienna Productions and Ovation Entertainments, and was broadcast on Channel 4 in the UK. All the music was written by Toni Baker and Peter Kay. Additional material was provided by Paddy McGuinness. Two series have been produced, which were first transmitted in 2001 and 2002. The show is a spin-off from the spoof documentary series That Peter Kay Thing, and in turn gave rise to the spin-off Max and Paddy's Road to Nowhere. It won the People's Choice Award at the British Comedy Awards 2002, and was nominated for several others. Kay is also its star, in multiple roles, and directed the second series. In September 2006, Kay revealed on BBC Radio 1 that a third series of Phoenix Nights has been written, but it is unknown when the series will be filmed. On 8 May 2007, another announcement by Kay was made promising another series will be made. However Dave Spikey, in interviews with The Sentinel and the Croydon Guardian in late-2009, claimed that neither he nor fellow co-writer Neil Fitzmaurice were aware of any plans to bring back the series. Featured Crew Peter Kay Creator Dave Spikey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Kay Brian Potter/Max Dave Spikey Jerry St Clair Neil Fitzmaurice Ray Von Paddy McGuinness Paddy Justin Moorhouse Young Kenny Full Cast & Crew Last Season Season 2 2002 | 6 Episodes Season 2 of Phoenix Nights premiered on August  8, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2004-11-12 Max and Paddy's Road to Nowhere 8.1    2015-04-29 Peter Kay's Car Share 7.5    2000-01-12 That Peter Kay Thing 6.4    2002-09-06 Bo' Selecta! 7.0    1962-01-04 Steptoe and Son 8.2    2006-10-06 Not Going Out 7.8    1973-01-09 Whatever Happened to the Likely Lads? 7.8    1993-11-18 Goodnight Sweetheart 8.2  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  25m, 24m Homepage   http://www.channel4.com/programmes/peter-kays-phoenix-nights Genres Comedy Keywords northern england nightclub sitcom british humour Content Score 93 Almost there... Top Contributors H 16 HelloCharlie 11 Banana 6 MadMacs06 a 5 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}