{"link": "https://www.themoviedb.org/tv/45544?language=en", "title": "Scrapped Princess", "resume": "Pacifica Casull is the most feared and hated person by the followers of the God Mauser. Known as the Scrapped Princess, she is the poison that will destroy the world. To avoid being killed by the zealots of Mauser, Pacifica and her adoptive brother and sister leave the village of Manhurin. Her brother, Shannon, is an expert with the sword while Racquel is proficient with magic. At every step of the way, however, someone is constantly trying to kill Pacifica, hoping to somehow avert the catastrophe that is supposed to befall the world on her 16th birthday.", "rate": 0, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kaori Mizuhashi", "Ruri Asano", "Megumi Toyoguchi", "Risa Hayamizu", "Masafumi Kimura"], "character": ["Zeferis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45544   Expand Scrapped Princess   (2003) User Score Overview Pacifica Casull is the most feared and hated person by the followers of the God Mauser. Known as the Scrapped Princess, she is the poison that will destroy the world. To avoid being killed by the zealots of Mauser, Pacifica and her adoptive brother and sister leave the village of Manhurin. Her brother, Shannon, is an expert with the sword while Racquel is proficient with magic. At every step of the way, however, someone is constantly trying to kill Pacifica, hoping to somehow avert the catastrophe that is supposed to befall the world on her 16th birthday. Featured Crew Ichiro Sakaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaori Mizuhashi Zeferis Ruri Asano Megumi Toyoguchi Risa Hayamizu Masafumi Kimura Full Cast & Crew Last Season Season 1 2003 | 24 Episodes Season 1 of Scrapped Princess premiered on April 11, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Scrapped Princess. You can help by rating TV shows you've seen. Facts Original Name  スクラップド・プリンセス Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords mecha based on light novel anime Content Score 93 Almost there... Top Contributors 28 BrerFox 14 sp1ti 11 Ailurus Fulgens 9 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}