{"link": "https://www.themoviedb.org/tv/65809?language=en", "title": "Spring Tide", "resume": "A late summer night in 1990 a young pregnant woman is brutally murdered by being buried in the sand, to slowly become submerged by the tide. 25 years later, the sadistic murder remains unsolved. Olivia Rönning receives the task of studying the case as a cold case exercise at the Police Academy. Olivia becomes almost obsessed with the murder when she discovers that her father previously worked with the investigation. She quickly realizes that she must get a hold of the principal investigator, detective Tom Stilton, but he seems to have disappeared from the face of the Earth.", "rate": 85, "genre": ["Drama"], "cast": ["Dakota Trancher Williams", "Julia Ragnarsson", "Stefan Gödicke", "Kjell Bergqvist", "Johan Widerberg"], "character": ["Adam", "Olivia Rönning", "Klinga", "Tom Stilton", "Minken"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65809   Expand Spring Tide   (2016) User Score Overview A late summer night in 1990 a young pregnant woman is brutally murdered by being buried in the sand, to slowly become submerged by the tide. 25 years later, the sadistic murder remains unsolved. Olivia Rönning receives the task of studying the case as a cold case exercise at the Police Academy. Olivia becomes almost obsessed with the murder when she discovers that her father previously worked with the investigation. She quickly realizes that she must get a hold of the principal investigator, detective Tom Stilton, but he seems to have disappeared from the face of the Earth. Featured Crew Cecilia Börjlind Creator Rolf Börjlind Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dakota Trancher Williams Adam Julia Ragnarsson Olivia Rönning Stefan Gödicke Klinga Kjell Bergqvist Tom Stilton Johan Widerberg Minken Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Spring Tide premiered on March  6, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Spring Tide. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2012-10-14 Jack Irish 7.4    2016-11-28 Midnattssol 7.4    2014-04-21 Jamaica Inn 5.5    2016-04-15 The Five 7.4    2014-01-09 Spies of Warsaw 7.2    2012-12-27 Restless 6.4    2012-05-22 Hit & Miss 7.3    2015-12-27 Trapped 7.6  Facts Original Name  Springfloden Status  Returning Series Network Certification 12 Meaning Take care with children under 12. Type  Scripted Original Language  Swedish Runtime  44m Homepage  - Genres Drama Keywords thriller crime Content Score 93 Almost there... Top Contributors n 25 nezhac z 15 zurman1 L 8 Lemmy_6 7 Eramik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}