{"link": "https://www.themoviedb.org/tv/65166?language=en", "title": "José de Egipto", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 70, "genre": ["Documentary", "Drama", "Family"], "cast": ["Ângelo Paes Leme", "Ricky Tavares", "Marcela Barrozo", "Andréa Avancini", "Binho Beltrão"], "character": ["José", "Young José", "Young Diná", "Zilpa", "Er"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65166   Expand José de Egipto   (2013) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Vivian de Oliveira Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ângelo Paes Leme José Ricky Tavares Young José Marcela Barrozo Young Diná Andréa Avancini Zilpa Binho Beltrão Er Full Cast & Crew Last Season Season 1 2013 | 38 Episodes Season 1 of José de Egipto premiered on January 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on José de Egipto. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  Portuguese Runtime  60m Homepage   http://entretenimento.r7.com/jose-do-egito/ Genres Documentary Drama Family Keywords egypt angel bible god joseph Content Score 93 Almost there... Top Contributors 154 JuninhoZ 31 Banana 12 REDHARD 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}