{"link": "https://www.themoviedb.org/tv/60624?language=en", "title": "Softly from Paris", "resume": "An anthology of erotic stories by famous writers like Guy de Maupassant, Nicolas Edme Restif de La Bretonne, Marquis de Sade, Giovanni Boccaccio, Marquis de Foudras, Daniel Defoe, Anton Tchekov, Jin Ping Mei, and Aristophanes.", "rate": 80, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60624   Expand Softly from Paris   (1986) User Score Overview An anthology of erotic stories by famous writers like Guy de Maupassant, Nicolas Edme Restif de La Bretonne, Marquis de Sade, Giovanni Boccaccio, Marquis de Foudras, Daniel Defoe, Anton Tchekov, Jin Ping Mei, and Aristophanes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1986 | 26 Episodes Season 1 of Softly from Paris premiered on November  8, 1986. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Softly from Paris. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Softly from Paris. You can help by rating TV shows you've seen. Facts Original Name  Série Rose Status  Ended Networks - Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  French Runtime  - Homepage  - Genres Drama Keywords literature sexual attraction Content Score 56 We're so close, yet so far. Top Contributors t 43 thyron f 26 fralindner S 7 Samara CM 2 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}