{"link": "https://www.themoviedb.org/tv/33965?language=en", "title": "Littlest Pet Shop", "resume": "Forced to move out from her suburban hometown because of her father's promotion, Blythe Baxter moves into an apartment located in a crowded city. Her apartment is located above the eponymous Littlest Pet Shop, a pet store containing a day camp for various pets. Her adventure begins when she discovers that she alone can miraculously understand and talk to all of the pets as well as other animals other than themselves. She and the pets go on several adventures together, only to find their day camp is being driven out of business due to a larger pet store managed by twins Whittany and Brittany Biskit, along with their father Fisher Biskit. Having no other options, the pets turn to Blythe to help them save it from closing down.", "rate": 60, "genre": ["Animation", "Comedy", "Family"], "cast": ["Ashleigh Ball", "Sam Vincent", "Tabitha St. Germain", "Kira Tozer", "Nicole Oliver"], "character": ["Blythe Baxter", "Russell Ferguson", "Pepper Clark", "Minka Mark", "Zoe Trent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33965   Expand Littlest Pet Shop   (2012) User Score Overview Forced to move out from her suburban hometown because of her father's promotion, Blythe Baxter moves into an apartment located in a crowded city. Her apartment is located above the eponymous Littlest Pet Shop, a pet store containing a day camp for various pets. Her adventure begins when she discovers that she alone can miraculously understand and talk to all of the pets as well as other animals other than themselves. She and the pets go on several adventures together, only to find their day camp is being driven out of business due to a larger pet store managed by twins Whittany and Brittany Biskit, along with their father Fisher Biskit. Having no other options, the pets turn to Blythe to help them save it from closing down. Featured Crew Julie McNally Cahill Creator Tim Cahill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashleigh Ball Blythe Baxter Sam Vincent Russell Ferguson Tabitha St. Germain Pepper Clark Kira Tozer Minka Mark Nicole Oliver Zoe Trent Full Cast & Crew Last Season Season 4 2015 | 26 Episodes Season 4 of Littlest Pet Shop premiered on November  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Littlest Pet Shop. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.hasbro.com/littlestpetshop/en_US/ Genres Animation Comedy Family Keywords pet shop talking animal fashion talking to animals Content Score 93 Almost there... Top Contributors 20 kuzronk s 18 sora_sey 12 david8s95 M 8 Mariusz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}