{"link": "https://www.themoviedb.org/tv/10050?language=en", "title": "The White Shadow", "resume": "The White Shadow is an American drama television series that ran on the CBS network from November 27 1978, to March 16 1981.", "rate": 75, "genre": ["Drama"], "cast": ["Ken Howard", "Kevin Hooks", "Byron Stewart", "Timothy Van Patten", "Stoney Jackson"], "character": ["Mario 'Salami' Pettrino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10050   Expand The White Shadow   (1978) User Score  Play Trailer Overview The White Shadow is an American drama television series that ran on the CBS network from November 27 1978, to March 16 1981. Featured Crew Bruce Paltrow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Howard Kevin Hooks Byron Stewart Timothy Van Patten Mario 'Salami' Pettrino Stoney Jackson Full Cast & Crew Last Season Season 3 1980 | 15 Episodes Season 3 of The White Shadow premiered on October 16, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply remmeber this? Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The White Shadow. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords high school sport basketball los angeles Content Score 100 Yes! Looking good! Top Contributors 8 Banana 5 Steve 2 Daemon TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}