{"link": "https://www.themoviedb.org/tv/17310?language=en", "title": "Dangerfield", "resume": "Dangerfield is a British drama series about a small town doctor / police surgeon, which ran for 6 series, between 1995 and 1999. Originally Nigel Le Vaillant played the central role, but this character later left the series, the focus switching to his replacement, played by Nigel Havers.\nThe BBC decided to end the series in November 1999 when Nigel Havers announced his decision to quit. The BBC felt viewers would not find the series credible if the main character was changed for a second time.\nThe show like a number of other BBC dramas of the 1980s and 1990s also featured a number of borderline fantasy episodes. These included \"Tricks\", \"Angel\" and \"Haunted\".\nThe TV trailers for Dangerfield were heavily parodied by The Fast Show in which the character was called Monkfish and would appear as a tough uncompromising Doctor, Policeman, vet and even as an interior designer with titles mixed in with other BBC shows of the time.", "rate": 60, "genre": ["Crime", "Drama"], "cast": ["Lisa Faulkner", "Michael Melia", "Nicola Cowper", "Nigel Havers", "Kim Vithana"], "character": ["Alison Dangerfield"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17310   Expand Dangerfield   (1995) User Score Overview Dangerfield is a British drama series about a small town doctor / police surgeon, which ran for 6 series, between 1995 and 1999. Originally Nigel Le Vaillant played the central role, but this character later left the series, the focus switching to his replacement, played by Nigel Havers. The BBC decided to end the series in November 1999 when Nigel Havers announced his decision to quit. The BBC felt viewers would not find the series credible if the main character was changed for a second time. The show like a number of other BBC dramas of the 1980s and 1990s also featured a number of borderline fantasy episodes. These included \"Tricks\", \"Angel\" and \"Haunted\". The TV trailers for Dangerfield were heavily parodied by The Fast Show in which the character was called Monkfish and would appear as a tough uncompromising Doctor, Policeman, vet and even as an interior designer with titles mixed in with other BBC shows of the time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Faulkner Alison Dangerfield Michael Melia Nicola Cowper Nigel Havers Kim Vithana Full Cast & Crew Last Season Season 6 1999 | 12 Episodes Season 6 of Dangerfield premiered on September  3, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dangerfield. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords england single father forensic science general practitioner (gp) Content Score 71 Just a little bit more... Top Contributors S 10 Shady12 7 Banana R 7 Rebecca c 1 castacasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}