{"link": "https://www.themoviedb.org/tv/1772?language=en", "title": "Kath & Kim", "resume": "Kath & Kim is a character-driven Australian television situation comedy series. The series was created by, and is written by Jane Turner and Gina Riley who play the title characters: a suburban mother and daughter with a dysfunctional relationship. The series main characters consist of Kath Day-Knight, a cheerful 50-year-old woman, her self-indulgent daughter Kim Craig, Kath's boyfriend and second husband, the metrosexual Kel Knight, as well as Kim's estranged husband Brett Craig and her lonely, overweight \"second best friend\" Sharon Strzelecki. The series is set in the fictional suburb of Fountain Lakes in Melbourne. It is primarily filmed in Patterson Lakes.\nThe series was conceived by Turner and Riley in the early 1990s as a weekly segment of the Australian comedy series Fast Forward. The skit was then developed into a full-series. The first series of Kath & Kim premiered on ABC TV on 16 May 2002, with three further series following, while a television movie, entitled Da Kath and Kim Code, was broadcast nationally on 25 November 2005. Kath & Kim has garnered much critical acclaim since its debut, winning two Logie Awards, for \"Outstanding Comedy Programme\" and the \"Best Television Drama Series\" award at the Australian Film Institute Awards. In Australia, it has become a pop culture phenomenon, and is a success with audiences nationwide. Internationally, the series has spawned a cult fanbase, and in 2006 it was announced an American version of the series would be produced, to air on NBC. Riley and Turner served as executive producers on the US version. The American version was also picked up by Seven, which debuted the program on 12 October 2008, just three days after its debut in the United States.", "rate": 80, "genre": ["Comedy"], "cast": ["Magda Szubanski", "Glenn Robbins", "Jane Turner", "Peter Rowsthorn", "Gina Riley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1772   Expand Kath & Kim   (2002) User Score Overview Kath & Kim is a character-driven Australian television situation comedy series. The series was created by, and is written by Jane Turner and Gina Riley who play the title characters: a suburban mother and daughter with a dysfunctional relationship. The series main characters consist of Kath Day-Knight, a cheerful 50-year-old woman, her self-indulgent daughter Kim Craig, Kath's boyfriend and second husband, the metrosexual Kel Knight, as well as Kim's estranged husband Brett Craig and her lonely, overweight \"second best friend\" Sharon Strzelecki. The series is set in the fictional suburb of Fountain Lakes in Melbourne. It is primarily filmed in Patterson Lakes. The series was conceived by Turner and Riley in the early 1990s as a weekly segment of the Australian comedy series Fast Forward. The skit was then developed into a full-series. The first series of Kath & Kim premiered on ABC TV on 16 May 2002, with three further series following, while a television movie, entitled Da Kath and Kim Code, was broadcast nationally on 25 November 2005. Kath & Kim has garnered much critical acclaim since its debut, winning two Logie Awards, for \"Outstanding Comedy Programme\" and the \"Best Television Drama Series\" award at the Australian Film Institute Awards. In Australia, it has become a pop culture phenomenon, and is a success with audiences nationwide. Internationally, the series has spawned a cult fanbase, and in 2006 it was announced an American version of the series would be produced, to air on NBC. Riley and Turner served as executive producers on the US version. The American version was also picked up by Seven, which debuted the program on 12 October 2008, just three days after its debut in the United States. Featured Crew Gina Riley Creator Jane Turner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Magda Szubanski Glenn Robbins Jane Turner Peter Rowsthorn Gina Riley Full Cast & Crew Last Season Season 4 2007 | 8 Episodes Season 4 of Kath & Kim premiered on August 19, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kath & Kim. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.kathandkim.com/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}