{"link": "https://www.themoviedb.org/tv/74785?language=en", "title": "Two Cops", "resume": "Cha Dong-Tak is a detective in pursuit of justice. A swindler's spirit takes possession of his body. The detective and swindler's spirit cooperate to solve cases. The detective falls in love with a reporter.", "rate": 58, "genre": ["Comedy", "Mystery"], "cast": ["Jo Jung-suk", "Lee Hye-ri", "Kim Sun-Ho", "Hoya", "Lee Si-eon"], "character": ["Cha Dong-Tak / Gong Su-Chang", "Song Ji-An", "Kong Soo-Chang", "Dokgo Sung-Hyeok", "Yong-Pal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74785   Expand Two Cops   (2017) User Score Overview Cha Dong-Tak is a detective in pursuit of justice. A swindler's spirit takes possession of his body. The detective and swindler's spirit cooperate to solve cases. The detective falls in love with a reporter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Jung-suk Cha Dong-Tak / Gong Su-Chang Lee Hye-ri Song Ji-An Kim Sun-Ho Kong Soo-Chang Hoya Dokgo Sung-Hyeok Lee Si-eon Yong-Pal Full Cast & Crew Current Season Season 1 2017 | 32 Episodes Season 1 of Two Cops premiered on November 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Two Cops. You can help by rating TV shows you've seen. Facts Original Name  투깝스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.imbc.com/broad/tv/drama/twoccaps/ Genres Comedy Mystery Keywords fantasy romance Content Score 93 Almost there... Top Contributors M 51 Maria180493 10 Elizabeth Jennings d 6 divyanka b 4 boudhum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}