{"link": "https://www.themoviedb.org/tv/48866?language=en", "title": "The 100", "resume": "Based on the books by Kass Morgan, this show takes place 100 years in the future, when the Earth has been abandoned due to radioactivity. The last surviving humans live on an ark orbiting the planet — but the ark won't last forever. So the repressive regime picks 100 expendable juvenile delinquents to send down to Earth to see if the planet is still habitable.", "rate": 64, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Eliza Taylor", "Bob Morley", "Marie Avgeropoulos", "Lindsey Morgan", "Richard Harmon"], "character": ["Clarke Griffin", "Bellamy Blake", "Octavia Blake", "Raven Reyes", "John Murphy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48866   Expand The 100   (2014) User Score  Play Trailer Overview Based on the books by Kass Morgan, this show takes place 100 years in the future, when the Earth has been abandoned due to radioactivity. The last surviving humans live on an ark orbiting the planet — but the ark won't last forever. So the repressive regime picks 100 expendable juvenile delinquents to send down to Earth to see if the planet is still habitable. Featured Crew Jason Rothenberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  19 Content Issues  2 Images Backdrops  13 Posters  29 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eliza Taylor Clarke Griffin Bob Morley Bellamy Blake Marie Avgeropoulos Octavia Blake Lindsey Morgan Raven Reyes Richard Harmon John Murphy Full Cast & Crew Current Season Season 5 2018 | 13 Episodes Season 5 of The 100 premiered on April 24, 2018. View All Seasons Social Reviews  0 Discussions  21 Subject Status Replies Last Reply Okay I know Open 3 by  SkyPowers Renewed for season 6! Open 1 by  Je_suis_le_vampire_Lestat w Clarke: Happy Birthday Eliza Taylor! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  13 Posters  29 Recommendations   2013-06-24 Under the Dome 6.2    2013-09-16 Sleepy Hollow 6.4    2012-05-27 Continuum 7.1    2011-06-19 Falling Skies 6.4    2016-01-05 The Shannara Chronicles 6.4    2016-01-14 Colony 6.8    2015-04-10 Marvel's Daredevil 7.7    2013-10-03 The Originals 7.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cwtv.com/shows/the-100/ Genres Drama Sci-Fi & Fantasy Keywords future self-discovery survivor mystery survival space lost nuclear catastrophe young adult based on young adult novel uncharted apocalyptic Content Score 100 Yes! Looking good! Top Contributors 79 Elizabeth Jennings 44 Banana 39 niqo19 27 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}