{"link": "https://www.themoviedb.org/tv/1013?language=en", "title": "Voltron: Defender of the Universe", "resume": "Voltron is the name of a giant robot in an anime television series that features a team of space explorers known as the Voltron Force. The space explorers pilot robot lions who join together to form the giant robot with which they defend their galaxy from evil. Initially produced as a joint venture between World Events Productions and Toei Animation, the original television series aired in syndication from September 10, 1984 to November 18, 1985. The program was entitled Voltron: Defender of the Universe.", "rate": 80, "genre": ["Animation"], "cast": ["Lennie Weinrib", "Neil Ross", "Michael Bell", "B. J. Ward", "Kevin Michael Richardson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1013   Expand Voltron: Defender of the Universe   (1984) User Score Overview Voltron is the name of a giant robot in an anime television series that features a team of space explorers known as the Voltron Force. The space explorers pilot robot lions who join together to form the giant robot with which they defend their galaxy from evil. Initially produced as a joint venture between World Events Productions and Toei Animation, the original television series aired in syndication from September 10, 1984 to November 18, 1985. The program was entitled Voltron: Defender of the Universe. Featured Crew Saburo Yatsude Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lennie Weinrib Neil Ross Michael Bell B. J. Ward Kevin Michael Richardson Full Cast & Crew Last Season Season 3 1985 | 20 Episodes Season 3 of Voltron: Defender of the Universe premiered on January  1, 1985. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Vehicle Voltron Open 0 by GForce59\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   1984-10-06 The Transformers 7.4    1983-09-10 Inspector Gadget 6.6    1987-09-10 Teenage Mutant Ninja Turtles 7.3    2007-03-05 Shaun the Sheep 7.6    1960-10-11 The Bugs Bunny Show 7.8    1981-09-12 The Smurfs 6.2    1991-09-07 Taz-Mania 6.3    1976-09-18 The Muppet Show 7.8  Facts Status  Ended Network DZKB-TV Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.voltron.com/ Genres Animation Keywords robot Content Score 100 Yes! Looking good! Top Contributors D 10 Doramius 6 BlackDelivery 5 Maikkoum c 3 crimcr79  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}