{"link": "https://www.themoviedb.org/tv/9859?language=en", "title": "Modern Men", "resume": "Modern Men was an American situation comedy television series which premiered March 17, 2006, on The WB. The series stars Eric Lively, Josh Braaten, and Max Greenfield as three single men, and lifelong friends, who hire a life coach to help them with their love lives. Wendie Malick played the life coach in the pilot episode, but when her series Jake in Progress was renewed, the role was recast with Jane Seymour. Marla Sokoloff and George Wendt are also part of the cast.\nThe series was created by writers Ross McCall and Aaron Peters. It is the first situation comedy by executive producer Jerry Bruckheimer. The show was canceled on May 18, 2006, due to a lack of time slots from the merger of The WB and UPN that created the new network The CW.", "rate": 0, "genre": ["Comedy"], "cast": ["Max Greenfield", "Eric Lively", "Josh Braaten", "Jane Seymour", "Marla Sokoloff"], "character": ["Kyle Brewster", "Doug Reynolds", "Tim Clark", "Dr. Victoria Stangel", "Molly Clark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9859   Expand Modern Men   (2006) User Score Overview Modern Men was an American situation comedy television series which premiered March 17, 2006, on The WB. The series stars Eric Lively, Josh Braaten, and Max Greenfield as three single men, and lifelong friends, who hire a life coach to help them with their love lives. Wendie Malick played the life coach in the pilot episode, but when her series Jake in Progress was renewed, the role was recast with Jane Seymour. Marla Sokoloff and George Wendt are also part of the cast. The series was created by writers Ross McCall and Aaron Peters. It is the first situation comedy by executive producer Jerry Bruckheimer. The show was canceled on May 18, 2006, due to a lack of time slots from the merger of The WB and UPN that created the new network The CW. Featured Crew Jerry Bruckheimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Max Greenfield Kyle Brewster Eric Lively Doug Reynolds Josh Braaten Tim Clark Jane Seymour Dr. Victoria Stangel Marla Sokoloff Molly Clark Full Cast & Crew Last Season Season 1 2006 | 7 Episodes Season 1 of Modern Men premiered on March 17, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Modern Men. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords dating sitcom life coach Content Score 93 Almost there... Top Contributors 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}