{"link": "https://www.themoviedb.org/tv/65420?language=en", "title": "The Promise", "resume": "Na-Yeon is a bright woman. She supports her boyfriend Tae-Joon, who is from a poor background, and has even given up entering a university. But Tae-Joon dumps her for his success and goes with Se-Jin, who is a granddaughter of Baekdoo Company president. Do-Hee is Na-Yeon’s twin sister. She is arrogant and tough. Do-Hee works as a reporter at a weekly magazine. After Na-Yeon’s death, Do-Hee decides to take revenge. She takes on the identity of her sister Na-Yeon. Do-Hee then meets Hwi-Kyung, who is successor of Baekdoo Company.", "rate": 37, "genre": ["Crime", "Drama", "Family", "Mystery"], "cast": ["Lee Yoo-ri", "Song Jong-ho", "Park Ha-na", "Seo Jun-young", "Lee Jong-won"], "character": ["Lee Na-Yeon / Baek Do-Hee", "Park Hwi-Kyung", "Jang Se-Jin", "Kang Tae-Joon", "Jang Kyung-Wan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65420   Expand The Promise   (2016) User Score Overview Na-Yeon is a bright woman. She supports her boyfriend Tae-Joon, who is from a poor background, and has even given up entering a university. But Tae-Joon dumps her for his success and goes with Se-Jin, who is a granddaughter of Baekdoo Company president. Do-Hee is Na-Yeon’s twin sister. She is arrogant and tough. Do-Hee works as a reporter at a weekly magazine. After Na-Yeon’s death, Do-Hee decides to take revenge. She takes on the identity of her sister Na-Yeon. Do-Hee then meets Hwi-Kyung, who is successor of Baekdoo Company. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yoo-ri Lee Na-Yeon / Baek Do-Hee Song Jong-ho Park Hwi-Kyung Park Ha-na Jang Se-Jin Seo Jun-young Kang Tae-Joon Lee Jong-won Jang Kyung-Wan Full Cast & Crew Last Season Season 1 2016 | 102 Episodes Season 1 of The Promise premiered on February  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Promise. You can help by rating TV shows you've seen. Facts Original Name  천상의 약속 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/promise/ Genres Crime Drama Family Mystery Keywords revenge Content Score 93 Almost there... Top Contributors M 36 Maria180493 28 Elizabeth Jennings 14 daliasued t 3 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}