{"link": "https://www.themoviedb.org/tv/42982?language=en", "title": "Infinite Ryvius", "resume": "Infinite RYVIUS is a 26 episode drama/sci-fi series produced by Sunrise. The series also refers to a manga.\nThe character and mecha designs in RYVIUS were created by Hisashi Hirai, who later went on to act as character designer for Gundam SEED.\nThe series is also noted for its music, a blend of western R&B/hip-hop music with J-pop vocals. This is evident in the opening song, \"dis–\", performed by bilingual Japanese-American singer Mika Arisaka. Most of the vocal songs were composed by M.I.D, and the thematic background instrumentals by Katsuhisa Hattori.", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Tetsu Shiratori", "Houko Kuwashima", "Soichiro Hoshi", "Tomokazu Seki", "Sakura Tange"], "character": ["Kouji Aiba", "Aoi Housen", "Yuki Aiba", "Ikumi Oze", "Kozue Izumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42982   Expand Infinite Ryvius   (1999) User Score Overview Infinite RYVIUS is a 26 episode drama/sci-fi series produced by Sunrise. The series also refers to a manga. The character and mecha designs in RYVIUS were created by Hisashi Hirai, who later went on to act as character designer for Gundam SEED. The series is also noted for its music, a blend of western R&B/hip-hop music with J-pop vocals. This is evident in the opening song, \"dis–\", performed by bilingual Japanese-American singer Mika Arisaka. Most of the vocal songs were composed by M.I.D, and the thematic background instrumentals by Katsuhisa Hattori. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tetsu Shiratori Kouji Aiba Houko Kuwashima Aoi Housen Soichiro Hoshi Yuki Aiba Tomokazu Seki Ikumi Oze Sakura Tange Kozue Izumi Full Cast & Crew Last Season (us) season 1 1999 | 26 Episodes Season 1 of Infinite Ryvius premiered on October 10, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Infinite Ryvius. You can help by rating TV shows you've seen. Facts Original Name  無限のリヴァイアス Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords anime Content Score 86 Almost there... Top Contributors M 12 Migi 12 BrerFox m 3 magoozin s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}