{"link": "https://www.themoviedb.org/tv/31153?language=en", "title": "The Forsyte Saga", "resume": "The Forsyte Saga is a 1967 BBC television adaptation of John Galsworthy's series of The Forsyte Saga novels, and its sequel trilogy A Modern Comedy. The series follows the fortunes of the upper middle class Forsyte family, and stars Eric Porter as Soames, Kenneth More as Young Jolyon and Nyree Dawn Porter as Irene.\nIt was adapted for television and produced by Donald Wilson and was originally shown in twenty-six episodes on Saturday evenings between 7 January and 1 July 1967 on BBC2, at a time when only a small proportion of the population had television sets able to receive this channel. It was therefore the repeat on Sunday evenings on BBC1 starting on 8 September 1968 that secured the programme's success with 18 million tuning in for the final episode in 1969.\nIt was shown in the United States on public television and broadcast all over the world, and became the first BBC television series to be sold to the Soviet Union.", "rate": 85, "genre": ["Drama"], "cast": ["Susan Hampshire", "Nyree Dawn Porter", "Eric Porter", "Kenneth More", "Michael York"], "character": ["Soames Forsyte"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31153   Expand The Forsyte Saga   (1967) User Score Overview The Forsyte Saga is a 1967 BBC television adaptation of John Galsworthy's series of The Forsyte Saga novels, and its sequel trilogy A Modern Comedy. The series follows the fortunes of the upper middle class Forsyte family, and stars Eric Porter as Soames, Kenneth More as Young Jolyon and Nyree Dawn Porter as Irene. It was adapted for television and produced by Donald Wilson and was originally shown in twenty-six episodes on Saturday evenings between 7 January and 1 July 1967 on BBC2, at a time when only a small proportion of the population had television sets able to receive this channel. It was therefore the repeat on Sunday evenings on BBC1 starting on 8 September 1968 that secured the programme's success with 18 million tuning in for the final episode in 1969. It was shown in the United States on public television and broadcast all over the world, and became the first BBC television series to be sold to the Soviet Union. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susan Hampshire Nyree Dawn Porter Eric Porter Soames Forsyte Kenneth More Michael York Full Cast & Crew Last Season Season 1 1967 | 26 Episodes Season 1 of The Forsyte Saga premiered on January  7, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Forsyte Saga. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/p00t62yc Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors D 3 Deepcode w 3 webmaster R 3 Rebecca D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}