{"link": "https://www.themoviedb.org/tv/36836?language=en", "title": "Maiden Spirit Zakuro", "resume": "Otome Yōkai Zakuro is a Japanese manga series written and illustrated by Lily Hoshino. It began serialization in November 2006 in the monthly seinen manga magazine Comic Birz. The first tankōbon volume was released by Gentosha in January 2008; as of January 2013, seven volumes have been released. An anime adaptation produced by J.C. Staff and directed by Chiaki Kon began airing in Japan in October 2010.\nThe series is set during the Westernization of an alternate Japan, where humans and spirits coexist. To solve the problems that arise between the two, human lieutenants Kei Agemaki, Riken Yoshinokazura, and Ganryu Hanakiri are partnered with half-spirit girls Zakuro, Susukihotaru, and twins Bonbori and Hozuki to form the Ministry of Spirit Affairs. However, Zakuro cannot stand humans who accept the Jesuit customs and Agemaki has a severe fear of spirits.", "rate": 0, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Kana Hanazawa", "Aki Toyosaki", "Takahiro Sakurai", "Satoshi Hino", "Yui Horie"], "character": ["Susukihotaru", "Bonbori", "Kei Agemaki", "Riken Yoshinokazura", "Hōzuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36836   Expand Maiden Spirit Zakuro   (2010) User Score Overview Otome Yōkai Zakuro is a Japanese manga series written and illustrated by Lily Hoshino. It began serialization in November 2006 in the monthly seinen manga magazine Comic Birz. The first tankōbon volume was released by Gentosha in January 2008; as of January 2013, seven volumes have been released. An anime adaptation produced by J.C. Staff and directed by Chiaki Kon began airing in Japan in October 2010. The series is set during the Westernization of an alternate Japan, where humans and spirits coexist. To solve the problems that arise between the two, human lieutenants Kei Agemaki, Riken Yoshinokazura, and Ganryu Hanakiri are partnered with half-spirit girls Zakuro, Susukihotaru, and twins Bonbori and Hozuki to form the Ministry of Spirit Affairs. However, Zakuro cannot stand humans who accept the Jesuit customs and Agemaki has a severe fear of spirits. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Susukihotaru Aki Toyosaki Bonbori Takahiro Sakurai Kei Agemaki Satoshi Hino Riken Yoshinokazura Yui Horie Hōzuki Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Maiden Spirit Zakuro premiered on October  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Maiden Spirit Zakuro. You can help by rating TV shows you've seen. Facts Original Name  おとめ妖怪 ざくろ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 20 BrerFox M 5 MGB89 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}