{"link": "https://www.themoviedb.org/tv/80294?language=en", "title": "Momoland Saipan Land", "resume": "The members of Momoland take a trip to Saipan and are given 48 hours to do whatever they want.", "rate": 0, "genre": ["Comedy"], "cast": ["Yoo Jung Ahn", "Lee Hye-bin", "Lee Da-bin", "Sung Ji-yeon", "Kim Tae-ha"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80294   Expand Momoland Saipan Land   (2018) User Score Overview The members of Momoland take a trip to Saipan and are given 48 hours to do whatever they want. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Jung Ahn Lee Hye-bin Lee Da-bin Sung Ji-yeon Kim Tae-ha Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Momoland Saipan Land premiered on June 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Momoland Saipan Land. You can help by rating TV shows you've seen. Facts Original Name  모모랜드의 사이판랜드 Status  Returning Series Networks MBC Music Certification  - Type  Reality Original Language  Korean Runtime  50m Homepage  - Genres Comedy Keywords variety Content Score 71 Just a little bit more... Top Contributors 32 Lumina_B  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}