{"link": "https://www.themoviedb.org/tv/1403?language=en", "title": "Marvel's Agents of S.H.I.E.L.D.", "resume": "Agent Phil Coulson of S.H.I.E.L.D. (Strategic Homeland Intervention, Enforcement and Logistics Division) puts together a team of agents to investigate the new, the strange and the unknown around the globe, protecting the ordinary from the extraordinary.", "rate": 67, "genre": ["Drama", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Clark Gregg", "Chloe Bennet", "Iain De Caestecker", "Ming-Na Wen", "Elizabeth Henstridge"], "character": ["Phil Coulson", "Daisy \"Skye\"Johnson / Quake", "Leo Fitz", "Melinda May / The Cavalry", "Jemma Simmons"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1403   Expand Marvel's Agents of S.H.I.E.L.D.   (2013) User Score  Play Trailer Overview Agent Phil Coulson of S.H.I.E.L.D. (Strategic Homeland Intervention, Enforcement and Logistics Division) puts together a team of agents to investigate the new, the strange and the unknown around the globe, protecting the ordinary from the extraordinary. Featured Crew Joss Whedon Creator Jed Whedon Creator Maurissa Tancharoen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  77 Content Issues  6 Images Backdrops  40 Posters  52 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clark Gregg Phil Coulson Chloe Bennet Daisy \"Skye\"Johnson / Quake Iain De Caestecker Leo Fitz Ming-Na Wen Melinda May / The Cavalry Elizabeth Henstridge Jemma Simmons Full Cast & Crew Current Season Season 5 2017 | 22 Episodes View All Seasons Social Reviews  0 Discussions  83 Subject Status Replies Last Reply s Fitz acting like \"The Doctor\" Open 1 by  DonaldTrump D Will this series tie into the events of Infinity War? Open 16 by  spreerod1538 D So who is Shaw's Father? Open 1 by  Innovator Go to Discussions Media Most Popular Videos  2 Backdrops  40 Posters  52 Recommendations   2015-01-06 Marvel's Agent Carter 7.5    2015-04-10 Marvel's Daredevil 7.7    2015-11-20 Marvel's Jessica Jones 7.6    2014-09-22 Gotham 6.9    2016-01-21 DC's Legends of Tomorrow 6.1    2006-09-25 Heroes 6.9    2012-10-10 Arrow 6.0    2016-09-30 Marvel's Luke Cage 6.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.agentsofshield.com/ Genres Drama Sci-Fi & Fantasy Action & Adventure Keywords based on comic marvel cinematic universe Content Score 100 Yes! Looking good! Top Contributors 157 seawolf 100 Elizabeth Jennings 65 niqo19 53 TopKek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}