{"link": "https://www.themoviedb.org/tv/65699?language=en", "title": "Star Trek: Renegades", "resume": "Set a decade after the U.S.S Voyager's return to Earth, a rag-tag crew of renegades and outcasts must covertly work with Admiral Chekov and Tuvok to stop forces threatening the Federation from outside, and within.", "rate": 53, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Adrienne Wilkinson", "Walter Koenig", "Sean Young", "Manu Intiraymi", "Corin Nemec"], "character": ["Lexxa Singh", "Admiral Chekov", "Lucien", "Icheb", "Alvarez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65699   Expand Star Trek: Renegades   (2015) User Score  Play Trailer Overview Set a decade after the U.S.S Voyager's return to Earth, a rag-tag crew of renegades and outcasts must covertly work with Admiral Chekov and Tuvok to stop forces threatening the Federation from outside, and within. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrienne Wilkinson Lexxa Singh Walter Koenig Admiral Chekov Sean Young Lucien Manu Intiraymi Icheb Corin Nemec Alvarez Full Cast & Crew Last Season Season 1 2015 | 1 Episode Season 1 of Star Trek: Renegades premiered on August  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations   2008-06-16 The Middleman 7.5    1975-09-04 Space: 1999 7.3    2015-04-14 Other Space 7.4    2014-08-04 Partners 5.1    1984-09-18 Hunter 7.1    1981-01-15 Hill Street Blues 7.4    1993-09-21 NYPD Blue 6.5    2012-10-27 Metal Hurlant Chronicles 5.5  Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors o 14 onlinemoviestar z 9 zurman1 D 3 Daniel t 3 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}