{"link": "https://www.themoviedb.org/tv/57577?language=en", "title": "Blood Lad", "resume": "Staz is a vampire from the surreal \"Demon World\", and Fuyumi, an ordinary girl, accidentally wanders into the Demon World through a portal. Subsequently after meeting each other, Fuyumi is killed by a carnivorous plant and turned into a ghost, causing Staz to take responsibility and pledge to help bring her back to life.", "rate": 65, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Ryota Ohsaka", "Sarah Emi Bridcutt", "Iori Nomizu"], "character": ["Staz Charlie Blood (voice)", "Bell Hydra", "Fuyumi Yanaga (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57577   Expand Blood Lad   (2013) User Score Overview Staz is a vampire from the surreal \"Demon World\", and Fuyumi, an ordinary girl, accidentally wanders into the Demon World through a portal. Subsequently after meeting each other, Fuyumi is killed by a carnivorous plant and turned into a ghost, causing Staz to take responsibility and pledge to help bring her back to life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  12 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryota Ohsaka Staz Charlie Blood (voice) Sarah Emi Bridcutt Bell Hydra Iori Nomizu Fuyumi Yanaga (voice) Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of Blood Lad premiered on July  8, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Blood Lad. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  6 Recommendations   2012-10-04 BTOOOM! 6.3    2014-04-04 The Kawai Complex Guide to Manors and Hostel Behavior 5.9    2017-07-04 AHO-GIRL 9.0    2014-09-26 Terra Formars 5.4    2014-10-05 Cross Ange: Rondo of Angels and Dragons 8.5    2014-10-05 The Fruit of Grisaia 5.8    2010-01-05 Ladies versus Butlers! 10.0    2014-01-11 No-Rin 6.0  Facts Original Name  ブラッドラッド Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords vampire dark comedy based on manga demon ghost fantasy world anime human vampire relationship Content Score 64 We're so close, yet so far. Top Contributors 56 Marr 🇳🇱 22 sp1ti 13 Levi Seguel 12 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}