{"link": "https://www.themoviedb.org/tv/42877?language=en", "title": "Akagi", "resume": "Akagi is a mahjong centric Japanese manga, written by Nobuyuki Fukumoto and first published in 1992. It is featured in the weekly magazine Modern Mahjong, and is a prequel to the author's previous work Ten, in which Akagi's titular character also appears. Due to its popularity, the manga has been adopted into two live action movies, and a 26 episode anime series which aired in Japan in the fall of 2005.", "rate": 90, "genre": ["Animation", "Drama", "Drama"], "cast": ["Masato Hagiwara", "Tesshou Genda", "Wataru Takagi", "Hideyuki Tanaka", "Ginpei Sato"], "character": ["Shigeru Akagi", "Yasuoka", "Yagi", "Ichikawa", "Yukio Hirayama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42877   Expand Akagi   (2005) User Score Overview Akagi is a mahjong centric Japanese manga, written by Nobuyuki Fukumoto and first published in 1992. It is featured in the weekly magazine Modern Mahjong, and is a prequel to the author's previous work Ten, in which Akagi's titular character also appears. Due to its popularity, the manga has been adopted into two live action movies, and a 26 episode anime series which aired in Japan in the fall of 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masato Hagiwara Shigeru Akagi Tesshou Genda Yasuoka Wataru Takagi Yagi Hideyuki Tanaka Ichikawa Ginpei Sato Yukio Hirayama Full Cast & Crew Last Season Season 1 2005 | 27 Episodes Season 1 of Akagi premiered on October  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Akagi. You can help by rating TV shows you've seen. Facts Original Name  闘牌伝説アカギ～闇に舞い降りた天才～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 6 asura766 5 enams90 m 3 matrixgx31 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}