{"link": "https://www.themoviedb.org/tv/13605?language=en", "title": "Jakers! The Adventures of Piggley Winks", "resume": "Jakers! The Adventures of Piggley Winks is an animated children's television series. The show is animated using computer-generated imagery and broadcast in the United States on PBS Kids from 2003 to 2008.\nThe show chronicles the boyhood adventures of Piggley Winks, an anthropomorphic pig from Ireland and how he relates these stories to his grandchildren as a grandfather in the present day.\nThe word \"jakers\" was originally a euphemism for \"Jesus\" in Ireland during the 1950s and 1960s and was an exclamation of surprise, delight, dismay, or alarm. Piggley and his father use it to express their delight when they discover something on their adventures.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Mel Brooks", "Tara Strong", "Pamela Adlon", "Russi Taylor", "Nika Futterman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13605   Expand Jakers! The Adventures of Piggley Winks   (2003) User Score Overview Jakers! The Adventures of Piggley Winks is an animated children's television series. The show is animated using computer-generated imagery and broadcast in the United States on PBS Kids from 2003 to 2008. The show chronicles the boyhood adventures of Piggley Winks, an anthropomorphic pig from Ireland and how he relates these stories to his grandchildren as a grandfather in the present day. The word \"jakers\" was originally a euphemism for \"Jesus\" in Ireland during the 1950s and 1960s and was an exclamation of surprise, delight, dismay, or alarm. Piggley and his father use it to express their delight when they discover something on their adventures. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mel Brooks Tara Strong Pamela Adlon Russi Taylor Nika Futterman Full Cast & Crew Last Season Season 2 2006 | 12 Episodes Season 2 of Jakers! The Adventures of Piggley Winks premiered on September 18, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Jakers! The Adventures of Piggley Winks. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jakers! The Adventures of Piggley Winks. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://pbskids.org/jakers/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors b 8 baux A 4 Aranyfiam 4 mojodo S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}