{"link": "https://www.themoviedb.org/tv/8838?language=en", "title": "Texhnolyze", "resume": "Texhnolyze is a Japanese anime television series directed by Hiroshi Hamasaki, from a screenplay by Chiaki Konaka, and produced by Yasuyuki Ueda, with original character design by Yoshitoshi ABe.\nThe events take place in the vibrant yet dilapidated underground city of Lux. Denizens of Lux have come to call it \"The City\" and treat it as a sentient force. Three factions vie for control of the city: the Organo, a strictly professional conglomerate with ties to the criminal underworld in the prosthetics business; the Union, a fanatical populist group interfering with Organo's affairs; and Racan, a marauding group of Texhnolyzed youths. The series has an ensemble cast, but events particularly focus on Ichise, a stoic prize fighter who loses a leg and an arm to satisfy an enraged promoter; Onishi, a young but level-headed executive of the Organo who has many enemies; and Ran, a little girl who has a very important gift that affects the entire city. As they struggle to accept the challenges that they are dealt, the characters bear witness to major events that determine whether the city continues to exist.\nTexhnolyze aired on Fuji Television from April 16, 2003 to September 24 of the same year, totaling twenty episodes. Two \"secret\" episodes were included in the DVD release.", "rate": 68, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Hiroshi Tsuchida", "Jouji Nakata", "Jonas Ball", "Patrick Seitz", "Masahiko Tanaka"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8838   Expand Texhnolyze   (2003) User Score Overview Texhnolyze is a Japanese anime television series directed by Hiroshi Hamasaki, from a screenplay by Chiaki Konaka, and produced by Yasuyuki Ueda, with original character design by Yoshitoshi ABe. The events take place in the vibrant yet dilapidated underground city of Lux. Denizens of Lux have come to call it \"The City\" and treat it as a sentient force. Three factions vie for control of the city: the Organo, a strictly professional conglomerate with ties to the criminal underworld in the prosthetics business; the Union, a fanatical populist group interfering with Organo's affairs; and Racan, a marauding group of Texhnolyzed youths. The series has an ensemble cast, but events particularly focus on Ichise, a stoic prize fighter who loses a leg and an arm to satisfy an enraged promoter; Onishi, a young but level-headed executive of the Organo who has many enemies; and Ran, a little girl who has a very important gift that affects the entire city. As they struggle to accept the challenges that they are dealt, the characters bear witness to major events that determine whether the city continues to exist. Texhnolyze aired on Fuji Television from April 16, 2003 to September 24 of the same year, totaling twenty episodes. Two \"secret\" episodes were included in the DVD release. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Tsuchida Jouji Nakata Jonas Ball Patrick Seitz Masahiko Tanaka Full Cast & Crew Last Season Season 1 2003 | 22 Episodes Season 1 of Texhnolyze premiered on April 19, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply D Good show Open 0 by DunkirkSurvive\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2008-04-10 Kaiba 8.3    2014-04-11 Ping Pong the Animation 8.4    2004-10-06 Beck: Mongolian Chop Squad 7.9    2002-10-09 Haibane Renmei 7.9    1998-07-06 Serial Experiments Lain 8.2    2006-02-10 Hellsing Ultimate 7.7    2012-10-12 Psycho-Pass 7.7    2004-02-03 Paranoia Agent 7.8  Facts Original Name  テクノライズ Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Sci-Fi & Fantasy Keywords desperation dystopia cyberpunk robot psychic tech noir existentialism neo-noir very little dialogue silent protagonist Content Score 86 Almost there... Top Contributors d 30 disturbD c 16 coffinbearer 6 qw0aszx m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}