{"link": "https://www.themoviedb.org/tv/37774?language=en", "title": "Marchlands", "resume": "The gripping story of three different families living in the same house in the 1960’s, 1980’s and present day. The families are linked by the spirit of a young girl – the 1960’s family’s daughter who died in mysterious circumstances.", "rate": 74, "genre": ["Drama"], "cast": ["Alex Kingston", "Denis Lawson", "Anne Reid", "Elliot Cowan", "Shelley Conn"], "character": ["Helen Maynard", "Robert Bowen", "Ruth Bowen", "Mark Ashburn", "Nisha Parekh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37774   Expand Marchlands   (2011) User Score Overview The gripping story of three different families living in the same house in the 1960’s, 1980’s and present day. The families are linked by the spirit of a young girl – the 1960’s family’s daughter who died in mysterious circumstances. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex Kingston Helen Maynard Denis Lawson Robert Bowen Anne Reid Ruth Bowen Elliot Cowan Mark Ashburn Shelley Conn Nisha Parekh Full Cast & Crew Last Season Season 1 2011 | 5 Episodes Season 1 of Marchlands premiered on February  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2009-01-12 Unforgiven 7.4    2004-07-19 The Grid 7.0    2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8    2013-02-27 Lightfields 7.5    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2011-09-14 Free Agents 4.8  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords loss of loved one haunted house miniseries ghost Content Score 93 Almost there... Top Contributors 37 Banana TB 5 TMDb Bot o 3 onlinetenies-club s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}