{"link": "https://www.themoviedb.org/tv/1668?language=en", "title": "Friends", "resume": "The misadventures of a group of friends as they navigate the pitfalls of work, life and love in Manhattan.", "rate": 79, "genre": ["Comedy"], "cast": ["David Schwimmer", "Courteney Cox", "Matthew Perry", "Jennifer Aniston", "Matt LeBlanc"], "character": ["Ross Geller", "Monica Geller", "Chandler Muriel Bing", "Rachel Green", "Joey Tribbiani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1668   Expand Friends   (1994) User Score  Play Trailer Overview The misadventures of a group of friends as they navigate the pitfalls of work, life and love in Manhattan. Featured Crew Marta Kauffman Creator David Crane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  20 Content Issues  1 Images Backdrops  38 Posters  35 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  2 Top Billed Cast David Schwimmer Ross Geller Courteney Cox Monica Geller Matthew Perry Chandler Muriel Bing Jennifer Aniston Rachel Green Matt LeBlanc Joey Tribbiani Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 10 2003 | 18 Episodes Season 10 of Friends premiered on September 25, 2003. View All Seasons Social Reviews  0 Discussions  21 Subject Status Replies Last Reply g Which 3 characters could have a successful spin-off Open 2 by  Dsnake1 Favourite and Least Favourite Character Open 12 by  gspgreases Monica wasn't THAT much of a clean freak... Open 6 by  gspgreases Go to Discussions Media Most Popular Videos  3 Backdrops  38 Posters  35 Recommendations   2005-09-19 How I Met Your Mother 7.4    2003-09-22 Two and a Half Men 6.2    1989-07-05 Seinfeld 8.2    2004-11-16 House 8.1    2004-09-22 Lost 7.8    2001-10-02 Scrubs 7.7    1999-03-28 Futurama 8.2    1998-08-23 That '70s Show 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords new york friendship roommate cafe apartment group of friends sitcom searching for love Content Score 100 Yes! Looking good! Top Contributors 73 d00ziie s 69 steelman1991 r 52 rrattani 47 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}