{"link": "https://www.themoviedb.org/tv/64149?language=en", "title": "This Life", "resume": "Set in contemporary Montreal, “This Life” is a family saga focusing on Natalie Lawson, an accomplished columnist and single mother in her early forties whose terminal cancer diagnosis sends her on a quest to prepare her teenage children for life without her. Her tight-knit family – sister, two brothers and parents – do the best they can to help her, while coping with their own responses to this revelation.", "rate": 43, "genre": ["Drama"], "cast": ["Torri Higginson", "Lauren Lee Smith", "Rick Roberts", "Kristopher Turner", "James Wotherspoon"], "character": ["Natalie Lawson", "Maggie Lawson", "Matthew Lawson", "Oliver Lawson", "Caleb Lawson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64149   Expand This Life   (2015) User Score  Play Trailer Overview Set in contemporary Montreal, “This Life” is a family saga focusing on Natalie Lawson, an accomplished columnist and single mother in her early forties whose terminal cancer diagnosis sends her on a quest to prepare her teenage children for life without her. Her tight-knit family – sister, two brothers and parents – do the best they can to help her, while coping with their own responses to this revelation. Featured Crew Joseph Kay Creator Virginia Rankin Creator Richard Blaimert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Torri Higginson Natalie Lawson Lauren Lee Smith Maggie Lawson Rick Roberts Matthew Lawson Kristopher Turner Oliver Lawson James Wotherspoon Caleb Lawson Full Cast & Crew Last Season Season 2 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on This Life. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbc.ca/thislife Genres Drama Keywords journalist cancer single mother hospitalization Content Score 100 Yes! Looking good! Top Contributors 52 Elizabeth Jennings 2 Banana z 2 zyck b 2 bobo33  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}