{"link": "https://www.themoviedb.org/tv/62301?language=en", "title": "The Girl Who Sees Smells", "resume": "Three years ago, Choi Moo Gak was mysteriously entangled in the \"Barcode\" murder case, resulting in not only the death of his sister, but also in the loss of most of his senses. While unearthing the cold case, Moo Gak crosses paths with Oh Cho Rim, a fellow victim who gained the synesthetic ability to see smells, but lost all of her memories prior to the incident. Moo Gak and Cho Rim combine their strange powers to track down the culprit, but are they ready to confront the truth?", "rate": 65, "genre": ["Comedy", "Fantasy", "Romance"], "cast": ["Park Yoo-chun", "Shin Se-kyung", "Namgoong Min", "Yoon Jin-seo", "Kim So-hyun"], "character": ["Choi Mu-gak", "Oh Cho-rim", "Kwon Jae-hee", "Yeom Mi", "Choi Eun-seol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62301   Expand The Girl Who Sees Smells   (2015) User Score Overview Three years ago, Choi Moo Gak was mysteriously entangled in the \"Barcode\" murder case, resulting in not only the death of his sister, but also in the loss of most of his senses. While unearthing the cold case, Moo Gak crosses paths with Oh Cho Rim, a fellow victim who gained the synesthetic ability to see smells, but lost all of her memories prior to the incident. Moo Gak and Cho Rim combine their strange powers to track down the culprit, but are they ready to confront the truth? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Yoo-chun Choi Mu-gak Shin Se-kyung Oh Cho-rim Namgoong Min Kwon Jae-hee Yoon Jin-seo Yeom Mi Kim So-hyun Choi Eun-seol Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of The Girl Who Sees Smells premiered on April  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  8 Recommendations   2013-06-05 I Hear Your Voice 8.2  Facts Original Name  냄새를 보는 소녀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000007174 Genres Comedy Fantasy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 55 Maria180493 5 Imzadi z 4 zurman1 c 3 creativo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}