{"link": "https://www.themoviedb.org/tv/1416?language=en", "title": "Grey's Anatomy", "resume": "Follows the personal and professional lives of a group of doctors at Seattle’s Grey Sloan Memorial Hospital.", "rate": 62, "genre": ["Drama"], "cast": ["Ellen Pompeo", "Justin Chambers", "Chandra Wilson", "James Pickens Jr."], "character": ["Dr. Meredith Grey", "Dr. Alex Karev", "Dr. Miranda Bailey", "Dr. Richard Webber"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1416   Expand Grey's Anatomy   (2005) User Score  Play Trailer Overview Follows the personal and professional lives of a group of doctors at Seattle’s Grey Sloan Memorial Hospital. Featured Crew Shonda Rhimes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  3 Images Backdrops  27 Posters  39 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ellen Pompeo Dr. Meredith Grey Justin Chambers Dr. Alex Karev Chandra Wilson Dr. Miranda Bailey James Pickens Jr. Dr. Richard Webber Full Cast & Crew Last Season Season 14 2017 | 24 Episodes Season 14 of Grey's Anatomy premiered on September 28, 2017. View All Seasons Social Reviews  0 Discussions  19 Subject Status Replies Last Reply t Can Bailey's husband just make up his mind? Open 0 by tonyismad\n      \n     w Dr. Meredith Grey: Happy Birthday Ellen Pompeo! Open 0 by wonder2wonder\n      \n     I Can Maggie get any more..... Open 2 by  RodimusConvoy Go to Discussions Media Most Popular Videos  1 Backdrops  27 Posters  39 Recommendations   1994-09-19 ER 6.9    2004-11-16 House 8.1    2004-10-03 Desperate Housewives 6.6    2005-09-12 Bones 7.0    2011-09-21 Revenge 6.9    2005-09-22 Criminal Minds 7.0    2008-09-23 The Mentalist 7.3    2007-09-19 Gossip Girl 6.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/greys-anatomy Genres Drama Keywords seattle trauma workplace hospital doctor medical student surgical interns medical drama Content Score 100 Yes! Looking good! Top Contributors 132 prm96 101 niqo19 84 Banana 77 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}