{"link": "https://www.themoviedb.org/tv/77286?language=en", "title": "My Husband, Mr. Oh!", "resume": "Han Seung-Joo is a single woman in her mid 30's and she works as a PD at a broadcasting station. She does well at her job, but she is not nearly as good when it comes to housework. Han Seung-Joo has a hard time dealing with social prejudices about single women. To get the position of a \"married woman,\" Han Seung-Joo marries Oh Jak-Doo who lives in the mountain. Their marriage is not based on love, but their relationship develops romantically.", "rate": 60, "genre": ["Drama"], "cast": ["Kim Kang-woo", "Uee", "Jung Sang-hoon", "Han Sun-hwa", "Park Jung-soo"], "character": ["Oh Jak-Doo", "Han Seung-Joo", "Eric Jo", "Jang Eun-Jo", "Park Jung-Ok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77286   Expand My Husband, Mr. Oh!   (2018) User Score Overview Han Seung-Joo is a single woman in her mid 30's and she works as a PD at a broadcasting station. She does well at her job, but she is not nearly as good when it comes to housework. Han Seung-Joo has a hard time dealing with social prejudices about single women. To get the position of a \"married woman,\" Han Seung-Joo marries Oh Jak-Doo who lives in the mountain. Their marriage is not based on love, but their relationship develops romantically. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Kang-woo Oh Jak-Doo Uee Han Seung-Joo Jung Sang-hoon Eric Jo Han Sun-hwa Jang Eun-Jo Park Jung-soo Park Jung-Ok Full Cast & Crew Current Season Season 1 2018 | 24 Episodes Season 1 of My Husband, Mr. Oh! premiered on March  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Husband, Mr. Oh!. You can help by rating TV shows you've seen. Facts Original Name  데릴남편 오작두 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/ojakdu/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 41 Maria180493 3 andermairena h 3 huestory k 2 kunamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}