{"link": "https://www.themoviedb.org/tv/1434?language=en", "title": "Family Guy", "resume": "Sick, twisted, politically incorrect and Freakin' Sweet animated series featuring the adventures of the dysfunctional Griffin family. Bumbling Peter and long-suffering Lois have three kids. Stewie (a brilliant but sadistic baby bent on killing his mother and taking over the world), Meg (the oldest, and is the most unpopular girl in town) and Chris (the middle kid, he's not very bright but has a passion for movies). The final member of the family is Brian - a talking dog and much more than a pet, he keeps Stewie in check whilst sipping Martinis and sorting through his own life issues.", "rate": 65, "genre": ["Animation", "Comedy"], "cast": ["Seth MacFarlane", "Alex Borstein", "Mila Kunis", "Seth Green"], "character": ["Peter Griffin / Brian Griffin / Stewie Griffin / Glenn Quagmire / Tom Tucker / God / Kool-Aid Guy (voice)", "Lois Griffin (voice)", "Meg Griffin (voice)", "Chris Griffin (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1434   Expand Family Guy   (1999) User Score  Play Trailer Overview Sick, twisted, politically incorrect and Freakin' Sweet animated series featuring the adventures of the dysfunctional Griffin family. Bumbling Peter and long-suffering Lois have three kids. Stewie (a brilliant but sadistic baby bent on killing his mother and taking over the world), Meg (the oldest, and is the most unpopular girl in town) and Chris (the middle kid, he's not very bright but has a passion for movies). The final member of the family is Brian - a talking dog and much more than a pet, he keeps Stewie in check whilst sipping Martinis and sorting through his own life issues. Featured Crew Seth MacFarlane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  8 Images Backdrops  41 Posters  28 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seth MacFarlane Peter Griffin / Brian Griffin / Stewie Griffin / Glenn Quagmire / Tom Tucker / God / Kool-Aid Guy (voice) Alex Borstein Lois Griffin (voice) Mila Kunis Meg Griffin (voice) Seth Green Chris Griffin (voice) Full Cast & Crew Last Season Original Air Date Original Air Date DVD Order (DVD) Amazon Order (Digital) Production Order (Production) Season 16 2017 | 20 Episodes Season 16 of Family Guy premiered on September 30, 2017. View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply Now i remember why i stopped watching Family Guy. Open 1 by  rooprect They should kill off Peter. Open 0 by Mario Limbouris\n      \n     Anyone else from IMDb? Open 8 by  Harry Skywalker Go to Discussions Media Most Popular Videos  1 Backdrops  41 Posters  28 Recommendations   1997-08-13 South Park 7.8    1999-03-28 Futurama 8.2    2005-02-06 American Dad! 6.2    1989-12-17 The Simpsons 7.1    2000-01-09 Malcolm in the Middle 7.5    2003-09-22 Two and a Half Men 6.2    1989-07-05 Seinfeld 8.2    2001-10-02 Scrubs 7.7  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.fox.com/familyguy/ Genres Animation Comedy Keywords high school sex alcohol adult humor satire parody middle class dysfunctional family alcoholism anthropomorphism social satire dating boy genius adult animation evil baby talking baby Content Score 100 Yes! Looking good! Top Contributors 453 lineker 268 Goffred0 196 Banana 61 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}