{"link": "https://www.themoviedb.org/tv/32625?language=en", "title": "Todd and the Book of Pure Evil", "resume": "Todd and the Book of Pure Evil is a Canadian comedy/horror television series that follows a group of high school students who confront the effects of a demonic book. The series premiered on Space Channel on September 29, 2010 with two back-to-back episodes. The show was created for television by Craig David Wallace, Charles Picco, and Anthony Leo.\nTodd and the Book of Pure Evil is based on the short film of the same title written by Craig David Wallace and Max Reid, and directed by Wallace. The short film was produced through the Canadian Film Centre’s Short Dramatic Film Programme, and kicked off an international festival tour by premiering at the Toronto International Film Festival in 2003. The series was developed for television through the National Screen Institute's Totally TV Program. A pilot for Todd and the Book of Pure Evil was shot for Space in 2009 in Winnipeg, Manitoba. Like the low-budget short film, the series uses supernatural elements, profanity, graphic violence and non-sequitur lines. Sci-fi veteran David Winning directed four episodes.\nEach episode was produced with two variations of the audio track: a pre-watershed version with \"clean\" replacement dialogue dubbed in by the actors, and the original uncensored version with profanity.", "rate": 76, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Melanie Leishman", "Alex House", "Chris Leavins", "Jason Mewes", "Maggie Castle"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32625   Expand Todd and the Book of Pure Evil   (2010) User Score  Play Trailer Overview Todd and the Book of Pure Evil is a Canadian comedy/horror television series that follows a group of high school students who confront the effects of a demonic book. The series premiered on Space Channel on September 29, 2010 with two back-to-back episodes. The show was created for television by Craig David Wallace, Charles Picco, and Anthony Leo. Todd and the Book of Pure Evil is based on the short film of the same title written by Craig David Wallace and Max Reid, and directed by Wallace. The short film was produced through the Canadian Film Centre’s Short Dramatic Film Programme, and kicked off an international festival tour by premiering at the Toronto International Film Festival in 2003. The series was developed for television through the National Screen Institute's Totally TV Program. A pilot for Todd and the Book of Pure Evil was shot for Space in 2009 in Winnipeg, Manitoba. Like the low-budget short film, the series uses supernatural elements, profanity, graphic violence and non-sequitur lines. Sci-fi veteran David Winning directed four episodes. Each episode was produced with two variations of the audio track: a pre-watershed version with \"clean\" replacement dialogue dubbed in by the actors, and the original uncensored version with profanity. Featured Crew Craig David Wallace Creator Charles Picco Creator Anthony Leo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melanie Leishman Alex House Chris Leavins Jason Mewes Maggie Castle Full Cast & Crew Last Season Season 2 2011 | 13 Episodes Season 2 of Todd and the Book of Pure Evil premiered on October 30, 2011. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply N Atticus' voice? Open 2 by  Nanook S Netflix or Hula needs to pick this up again. Open 0 by SirTJ\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   2010-06-06 The Hard Times of RJ Berger 7.0    Holliston 7.2    2012-01-19 Unsupervised 6.6    2016-01-07 Angel from Hell 6.1    2017-01-11 Jeff & Some Aliens 8.4    2013-09-17 Dads 4.8    2016-12-07 Shut Eye 6.3    2018-02-26 Final Space 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.toddandthebookofpureevil.com Genres Comedy Sci-Fi & Fantasy Keywords high school magic wish satanic fighting supernatural Content Score 100 Yes! Looking good! Top Contributors 20 Banana CM 6 Cherche Moi s 4 speedycars w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}