{"link": "https://www.themoviedb.org/tv/57857?language=en", "title": "What Remains", "resume": "When the decomposed body of Melissa Young is found by a couple in their new flat, Detective Len Harper is determined to discover what happened to her and why nobody noticed she was missing.", "rate": 71, "genre": ["Drama", "Mystery"], "cast": ["David Threlfall", "Denise Gough", "Lisa Millett", "Alex Arnold", "David Bamber"], "character": ["Len Harper", "Liz Fletcher", "DCI Alice Yapp", "Adam", "Joe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57857   Expand What Remains   (2013) User Score  Play Trailer Overview When the decomposed body of Melissa Young is found by a couple in their new flat, Detective Len Harper is determined to discover what happened to her and why nobody noticed she was missing. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Threlfall Len Harper Denise Gough Liz Fletcher Lisa Millett DCI Alice Yapp Alex Arnold Adam David Bamber Joe Full Cast & Crew Last Season Miniseries 2013 | 4 Episodes Season 1 of What Remains premiered on August 25, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for What Remains. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2006-01-01 In Justice 6.8    2013-09-05 The Guilty 7.0    2014-09-23 The Driver 7.3    2011-01-13 Kidnap and Ransom 7.6    2011-05-02 Case Sensitive 5.4    2012-08-30 Good Cop 6.6    2012-03-05 Dirk Gently 8.1    2011-06-06 Injustice 7.3  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b039ft8x Genres Drama Mystery Keywords murder miniseries police detective old house woman director murder mystery Content Score 93 Almost there... Top Contributors 22 Steve 14 Elizabeth Jennings TB 9 TMDb Bot t 5 tmdb12607239  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}