{"link": "https://www.themoviedb.org/tv/9103?language=en", "title": "Kimagure Orange Road", "resume": "Kyosuke Kasuga, fifteen, moves to a new city and falls for Madoka  Ayukawa. She's friendly when they're alone, but acts like a delinquent  when in front of others. Kyosuke meanwhile struggles not to break the  heart of Hikaru Hiyama, who fell in love after seeing him make an  impossible basketball shot. To add the cherry to this particular sundae,  Kyosuke and his family (sisters, grandfather, and cousins) all have  various powers. And while Kyosuke's desperate to keep those powers a  secret, his younger sisters (among others) aren't quite as concerned  about it.", "rate": 85, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Eriko Hara", "Hiromi Tsuru", "Chieko Honda", "Tōru Furuya", "Michie Tomizawa"], "character": ["Hikaru Hiyama", "Madoka Ayukawa", "Kurumi Kasuga", "Kyosuke Kasuga", "Manami Kasuga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9103   Expand Kimagure Orange Road   (1987) User Score Overview Kyosuke Kasuga, fifteen, moves to a new city and falls for Madoka  Ayukawa. She's friendly when they're alone, but acts like a delinquent  when in front of others. Kyosuke meanwhile struggles not to break the  heart of Hikaru Hiyama, who fell in love after seeing him make an  impossible basketball shot. To add the cherry to this particular sundae,  Kyosuke and his family (sisters, grandfather, and cousins) all have  various powers. And while Kyosuke's desperate to keep those powers a  secret, his younger sisters (among others) aren't quite as concerned  about it. Featured Crew Izumi Matsumoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eriko Hara Hikaru Hiyama Hiromi Tsuru Madoka Ayukawa Chieko Honda Kurumi Kasuga Tōru Furuya Kyosuke Kasuga Michie Tomizawa Manami Kasuga Full Cast & Crew Last Season Season 1 1987 | 48 Episodes Season 1 of Kimagure Orange Road premiered on April  6, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations   2011-12-04 Black Mirror 8.2  Facts Original Name  きまぐれオレンジ☆ロード Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors p 8 pepico t 8 tmdb983464 c 5 chloris77 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}