{"link": "https://www.themoviedb.org/tv/4388?language=en", "title": "The Royle Family", "resume": "British comedy series focusing on the lives of a working-class family in Manchester who love the TV.", "rate": 79, "genre": ["Comedy"], "cast": ["Ricky Tomlinson", "Craig Cash", "Sue Johnston", "Liz Smith", "Ralf Little"], "character": ["Jim Royle", "Dave Best", "Barbara Royle", "Norma 'Nana' Speakman", "Antony Royle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4388   Expand The Royle Family   (1998) User Score Overview British comedy series focusing on the lives of a working-class family in Manchester who love the TV. Featured Crew Caroline Aherne Creator Craig Cash Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricky Tomlinson Jim Royle Craig Cash Dave Best Sue Johnston Barbara Royle Liz Smith Norma 'Nana' Speakman Ralf Little Antony Royle Full Cast & Crew Last Season Season 3 2000 | 7 Episodes Season 3 of The Royle Family premiered on October 16, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1998-11-12 Dinnerladies 6.4    1976-09-06 George and Mildred 6.6    1979-10-24 Terry and June 5.0    2009-08-24 Pointless 6.9    1990-01-04 One Foot in the Grave 7.5    1994-11-04 Harry Enfield and Chums 7.8    Horrid Henry 5.3    2002-10-14 Escape to the Country 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://bbc.co.uk/programmes/b006mbfy Genres Comedy Keywords northern england social commentary working class family sitcom couch potato manchester british humour Content Score 93 Almost there... Top Contributors O 10 Ozbourne 7 rudely_murray 5 Banana 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}