{"link": "https://www.themoviedb.org/tv/60735?language=en", "title": "The Flash", "resume": "After a particle accelerator causes a freak storm, CSI Investigator Barry Allen is struck by lightning and falls into a coma. Months later he awakens with the power of super speed, granting him the ability to move through Central City like an unseen guardian angel. Though initially excited by his newfound powers, Barry is shocked to discover he is not the only \"meta-human\" who was created in the wake of the accelerator explosion -- and not everyone is using their new powers for good. Barry partners with S.T.A.R. Labs and dedicates his life to protect the innocent. For now, only a few close friends and associates know that Barry is literally the fastest man alive, but it won't be long before the world learns what Barry Allen has become...The Flash.", "rate": 67, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Grant Gustin", "Candice Patton", "Jesse L. Martin", "Tom Cavanagh", "Danielle Panabaker"], "character": ["Barry Allen / The Flash", "Iris West", "Joe West", "Harrison Wells / HR", "Caitlin Snow / Killer Frost"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60735   Expand The Flash   (2014) User Score  Play Trailer Overview After a particle accelerator causes a freak storm, CSI Investigator Barry Allen is struck by lightning and falls into a coma. Months later he awakens with the power of super speed, granting him the ability to move through Central City like an unseen guardian angel. Though initially excited by his newfound powers, Barry is shocked to discover he is not the only \"meta-human\" who was created in the wake of the accelerator explosion -- and not everyone is using their new powers for good. Barry partners with S.T.A.R. Labs and dedicates his life to protect the innocent. For now, only a few close friends and associates know that Barry is literally the fastest man alive, but it won't be long before the world learns what Barry Allen has become...The Flash. Featured Crew Andrew Kreisberg Creator Geoff Johns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  89 Content Issues  2 Images Backdrops  21 Posters  35 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Grant Gustin Barry Allen / The Flash Candice Patton Iris West Jesse L. Martin Joe West Tom Cavanagh Harrison Wells / HR Danielle Panabaker Caitlin Snow / Killer Frost Full Cast & Crew Current Season Season 4 2017 | 23 Episodes Season 4 of The Flash premiered on October 10, 2017. View All Seasons Social Reviews  0 Discussions  91 Subject Status Replies Last Reply m that can't be my jacket, mine is one of a kind..... Open 0 by madmehr\n      \n     g The writers making Caityln and killer frost easily changeable Open 5 by  komrad m They suck at writing iris! God! Open 1 by  julianwelton Go to Discussions Media Most Popular Videos  2 Backdrops  21 Posters  35 Recommendations   2012-10-10 Arrow 6.0    2016-01-21 DC's Legends of Tomorrow 6.1    2015-10-26 Supergirl 5.7    2015-04-10 Marvel's Daredevil 7.7    2013-09-24 Marvel's Agents of S.H.I.E.L.D. 6.7    2014-09-22 Gotham 6.9    2015-11-20 Marvel's Jessica Jones 7.6    2015-01-06 Marvel's Agent Carter 7.5  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.cwtv.com/shows/the-flash/ Genres Drama Sci-Fi & Fantasy Keywords dc comics superhero speed based on comic super power masked superhero supervillain Content Score 100 Yes! Looking good! Top Contributors R 165 Rebecca 101 Elizabeth Jennings 61 niqo19 43 Ander33x  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}