{"link": "https://www.themoviedb.org/tv/43529?language=en", "title": "Labyrinth", "resume": "Jumping back and forth between modern and medieval France, the lives of two women separated by centuries, are united in their search for an ancient artifact.", "rate": 59, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Jessica Brown Findlay", "Vanessa Kirby", "Emun Elliott", "John Hurt", "Katie McGrath"], "character": ["Alais Pelletier Du Mas", "Alice Tanner", "Guilhem du Mas", "Audric Baillard", "Oriane Congost"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43529   Expand Labyrinth   (2012) User Score Overview Jumping back and forth between modern and medieval France, the lives of two women separated by centuries, are united in their search for an ancient artifact. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Brown Findlay Alais Pelletier Du Mas Vanessa Kirby Alice Tanner Emun Elliott Guilhem du Mas John Hurt Audric Baillard Katie McGrath Oriane Congost Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of Labyrinth premiered on November 24, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  11 Recommendations   2011-06-14 The Nine Lives of Chloe King 6.5    2012-09-25 The Paradise 6.8    2008-10-09 Eleventh Hour 6.5    2012-07-15 Political Animals 7.3    2009-03-15 Kings 7.9    2012-11-07 Secret State 7.3    2014-10-02 A to Z 5.7    2011-02-25 Camelot 5.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.labyrinth-tv.com/ Genres Sci-Fi & Fantasy Keywords holy grail miniseries historical fiction archaeologist medieval times Content Score 86 Almost there... Top Contributors TB 33 TMDb Bot 20 Banana 7 Mitsarinho T 6 Tigrecito  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}