{"link": "https://www.themoviedb.org/tv/42699?language=en", "title": "The Decalogue", "resume": "The Decalogue is a 1989 Polish television drama series directed by Krzysztof Kieślowski and co-written by Kieślowski with Krzysztof Piesiewicz, with music by Zbigniew Preisner. It consists of ten one-hour films, inspired by the Ten Commandments. Each short film explores one or several moral or ethical issues faced by characters living in modern Poland.\nThe series is Kieślowski's most acclaimed work, has been said to be \"the best dramatic work ever done specifically for television\" and has won numerous international awards, though it was not widely released outside Europe until the late 1990s. Film-maker Stanley Kubrick wrote an admiring foreword to the published screen-play in 1991.", "rate": 91, "genre": ["Drama"], "cast": ["Henryk Baranowski", "Krystyna Janda", "Aleksander Bardini", "Stanisław Gawlik", "Krzysztof Kumor"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42699   Expand The Decalogue   (1989) User Score Overview The Decalogue is a 1989 Polish television drama series directed by Krzysztof Kieślowski and co-written by Kieślowski with Krzysztof Piesiewicz, with music by Zbigniew Preisner. It consists of ten one-hour films, inspired by the Ten Commandments. Each short film explores one or several moral or ethical issues faced by characters living in modern Poland. The series is Kieślowski's most acclaimed work, has been said to be \"the best dramatic work ever done specifically for television\" and has won numerous international awards, though it was not widely released outside Europe until the late 1990s. Film-maker Stanley Kubrick wrote an admiring foreword to the published screen-play in 1991. Featured Crew Krzysztof Kieślowski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  8 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Henryk Baranowski Krystyna Janda Aleksander Bardini Stanisław Gawlik Krzysztof Kumor Full Cast & Crew Last Season Dekalog 1989 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Decalogue. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  8 Recommendations   1995-05-14 The Langoliers 5.9    1989-07-05 Seinfeld 8.2    2003-11-02 Arrested Development 8.2    2003-09-22 Two and a Half Men 6.2    1990-04-08 Twin Peaks 8.1    1990-11-18 It 6.4    1999-01-10 The Sopranos 8.3    2002-06-02 The Wire 8.4  Facts Original Name  Dekalog Status  Ended Network Certification  - Type  Miniseries Original Language  Polish Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors TB 69 TMDb Bot p 26 paunovak s 13 saylent3 D 12 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}