{"link": "https://www.themoviedb.org/tv/1415?language=en", "title": "Elementary", "resume": "A modern-day drama about a crime-solving duo that cracks the NYPD's most impossible cases. Following his fall from grace in London and a stint in rehab, eccentric Sherlock escapes to Manhattan where his wealthy father forces him to live with his worst nightmare - a sober companion, Dr. Watson.", "rate": 70, "genre": ["Drama", "Mystery", "Crime"], "cast": ["Jonny Lee Miller", "Lucy Liu", "Jon Michael Hill", "Aidan Quinn", "Desmond Harrington"], "character": ["Sherlock Holmes", "Dr. Joan Watson", "Det. Marcus Bell", "Cpt. Thomas Gregson", "Michael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1415   Expand Elementary   (2012) User Score  Play Trailer Overview A modern-day drama about a crime-solving duo that cracks the NYPD's most impossible cases. Following his fall from grace in London and a stint in rehab, eccentric Sherlock escapes to Manhattan where his wealthy father forces him to live with his worst nightmare - a sober companion, Dr. Watson. Featured Crew Robert Doherty Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  3 Images Backdrops  23 Posters  25 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jonny Lee Miller Sherlock Holmes Lucy Liu Dr. Joan Watson Jon Michael Hill Det. Marcus Bell Aidan Quinn Cpt. Thomas Gregson Desmond Harrington Michael Full Cast & Crew Current Season Season 6 2018 | 12 Episodes Season 6 of Elementary premiered on April 30, 2018. View All Seasons Social Reviews  0 Discussions  13 Subject Status Replies Last Reply Is it REALLY that hard to just write interesting episodes without getting into the health of the protagonists? Open 0 by MongoLloyd\n      \n     F Shinwell Open 2 by  FormerlyKnownAs f Kitty Open 7 by  lennonforever Go to Discussions Media Most Popular Videos  2 Backdrops  23 Posters  25 Recommendations   2008-09-23 The Mentalist 7.3    2011-09-22 Person of Interest 7.8    2009-01-21 Lie to Me 7.4    2009-10-23 White Collar 7.7    2009-03-08 Castle 7.3    2009-07-07 Warehouse 13 7.2    2014-09-22 Scorpion 6.7    2005-09-12 Bones 7.0  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/elementary/ Genres Drama Mystery Crime Keywords new york detective investigation sherlock holmes crime recovering drug addict police investigation Content Score 100 Yes! Looking good! Top Contributors 388 seawolf 86 Elizabeth Jennings 32 niqo19 25 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}