{"link": "https://www.themoviedb.org/tv/34015?language=en", "title": "American Restoration", "resume": "American Restoration is an American reality television series airing on the History channel. Produced by Leftfield Pictures, the series is recorded in Las Vegas, Nevada, where it chronicles the daily activities at Rick's Restorations, an antique restoration shop, with its owner Rick Dale, his staff, and teenage son, as they restore various vintage items to their original condition.\nThe show is the first spin-off of Pawn Stars, in which Dale has appeared several times as an on-camera expert and restored various items. The series has featured cameo appearances by the cast of Pawn Stars, American Pickers, magician Lance Burton, NASCAR driver Greg Biffle, and musicians Sammy Hagar, Billy Joel, and Jason Mraz.", "rate": 62, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34015   Expand American Restoration   (2010) User Score Overview American Restoration is an American reality television series airing on the History channel. Produced by Leftfield Pictures, the series is recorded in Las Vegas, Nevada, where it chronicles the daily activities at Rick's Restorations, an antique restoration shop, with its owner Rick Dale, his staff, and teenage son, as they restore various vintage items to their original condition. The show is the first spin-off of Pawn Stars, in which Dale has appeared several times as an on-camera expert and restored various items. The series has featured cameo appearances by the cast of Pawn Stars, American Pickers, magician Lance Burton, NASCAR driver Greg Biffle, and musicians Sammy Hagar, Billy Joel, and Jason Mraz. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2016 | 12 Episodes Season 7 of American Restoration premiered on January  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2012-01-08 Cajun Pawn Stars 5.7    2009-07-19 Pawn Stars 6.5    2010-12-01 Storage Wars 5.3    1986-09-17 Head of the Class 6.3    1959-10-05 Adventures in Paradise 7.5    1958-10-02 The Huckleberry Hound Show 7.0    2010-01-18 American Pickers 7.4    2006-05-06 How Do They Do It? 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m, 24m, 30m Homepage   http://www.history.com/shows/american-restoration Genres Reality Keywords disguised history lesson memories restored Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 H 4 HBO PE 4 Patrick E. Abe 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}