{"link": "https://www.themoviedb.org/tv/11122?language=en", "title": "Revelations", "resume": "Set just before the start of Armageddon, the series will follow two central characters, a physicist and a nun, who are racing against the clock to see if the end of the world apocalypse can be averted. Bill Pullman plays Dr. Richard Massey, a Harvard professor whose daughter is murdered by satanists while McElhone stars as a nun who recruits Massey to help investigate whether what's told in the Book of Revelations is starting to come true. Seltzer and Polone with executive produce the project along with Pariah Television's Vivian Cannon and Jessika Borsiczky.", "rate": 57, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Alexa Nikolas", "Bill Pullman", "Natascha McElhone", "Fred Durst", "Martin Starr"], "character": ["Lucy Massey", "Dr. Richard Massey", "Sister Josepha Montafiore", "Ogden", "Mark Rubio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11122   Expand Revelations   (2005) User Score Overview Set just before the start of Armageddon, the series will follow two central characters, a physicist and a nun, who are racing against the clock to see if the end of the world apocalypse can be averted. Bill Pullman plays Dr. Richard Massey, a Harvard professor whose daughter is murdered by satanists while McElhone stars as a nun who recruits Massey to help investigate whether what's told in the Book of Revelations is starting to come true. Seltzer and Polone with executive produce the project along with Pariah Television's Vivian Cannon and Jessika Borsiczky. Featured Crew David Seltzer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexa Nikolas Lucy Massey Bill Pullman Dr. Richard Massey Natascha McElhone Sister Josepha Montafiore Fred Durst Ogden Martin Starr Mark Rubio Full Cast & Crew Last Season Season 1 2005 | 6 Episodes Season 1 of Revelations premiered on April 13, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2004-07-19 The Grid 7.0    2010-07-12 The Silence 6.8    2013-09-05 The Guilty 7.0    2011-02-03 Marchlands 7.4    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2008-11-13 Apparitions 7.9    2006-01-01 In Justice 6.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  45m Homepage  - Genres Drama Mystery Sci-Fi & Fantasy Keywords nun end of the world religion miniseries mother superior woman director Content Score 93 Almost there... Top Contributors SK 34 Scott K 15 Banana TB 11 TMDb Bot 11 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}