{"link": "https://www.themoviedb.org/tv/65930?language=en", "title": "My Hero Academia", "resume": "People are not born equal, a realization that 4-year-old Midoriya Izuku faced when bullied by his classmates who had unique special powers. Izuku was one of the rare cases where he was born with absolutely no unique powers. This did not stop Izuku from pursuing his dream, a dream of becoming a great hero like the legendary All-Might. To become the great hero he hopelessly wants to become, he now will join the ranks of one of the highest rated \"Hero Academies\" in the country: UA. With the help of his idol All-Might, will he be able to claim the ranks and become a true hero?", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Kenta Miyake", "Nobuhiko Okamoto", "Daiki Yamashita", "Ayane Sakura", "Kaito Ishikawa"], "character": ["All Might (voice)", "Katsuki Bakugou (voice)", "Izuku Midoriya (voice)", "Ochako Uraraka (voice)", "Tenya Iida (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65930   Expand My Hero Academia   (2016) User Score  Play Trailer Overview People are not born equal, a realization that 4-year-old Midoriya Izuku faced when bullied by his classmates who had unique special powers. Izuku was one of the rare cases where he was born with absolutely no unique powers. This did not stop Izuku from pursuing his dream, a dream of becoming a great hero like the legendary All-Might. To become the great hero he hopelessly wants to become, he now will join the ranks of one of the highest rated \"Hero Academies\" in the country: UA. With the help of his idol All-Might, will he be able to claim the ranks and become a true hero? Featured Crew Yousuke Kuroda Creator Kenji Nagasaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  21 Posters  14 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Kenta Miyake All Might (voice) Nobuhiko Okamoto Katsuki Bakugou (voice) Daiki Yamashita Izuku Midoriya (voice) Ayane Sakura Ochako Uraraka (voice) Kaito Ishikawa Tenya Iida (voice) Full Cast & Crew Current Season Original Air Date Original Air Date All episodes (Absolute) Season 3 2018 | 14 Episodes Season 3 of My Hero Academia premiered on April  7, 2018. View All Seasons Social Reviews  1 Discussions  1 i A review by ischleep  10.0 Written by  ischleep  on June  2, 2018 This show has touched my heart unlike any other show. I highly reccomend it. It delivers on all fronts, action, humor, amd heart. Read All Reviews Media Most Popular Videos  3 Backdrops  21 Posters  14 Recommendations   2014-01-05 Noragami 7.4    2014-07-03 Tokyo Ghoul 7.2    2016-07-12 Mob Psycho 100 8.1    2016-04-07 Bungo Stray Dogs 7.3    2015-01-10 Death Parade 7.3    2016-01-08 Dagashi Kashi 6.3    2015-10-04 One-Punch Man 8.2    2014-10-05 The Seven Deadly Sins 7.9  Facts Original Name  僕のヒーローアカデミア Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.heroaca.com/ Genres Action & Adventure Animation Comedy Keywords hero superhero heroism school based on manga super power super villain shounen anime Content Score 100 Yes! Looking good! Top Contributors 92 sp1ti 36 RubeensVinicius 22 FelipeFusion 18 Cold_Chicken  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}