{"link": "https://www.themoviedb.org/tv/7918?language=en", "title": "Ensign O'Toole", "resume": "Ensign O'Toole is a military comedy that aired on NBC from September 23, 1962, to May 5, 1963, with 31-year-old Dean Jones in the title role of a nonchalant United States Navy ensign during the early 1960s. Jones, born in 1931 in Alabama and a Navy veteran of the Korean War, played an officer aboard the fictional U.S. Navy destroyer USS Appleby, which roamed the Pacific Ocean.", "rate": 60, "genre": ["War", "Politics", "Comedy"], "cast": ["Dean Jones", "Jack Albertson", "Harvey Lembeck", "Jay C. Flippen", "Beau Bridges"], "character": ["Ensign O'Toole", "Lieutenant Commander Virgil Stoner", "Seaman Gabby Di Julio", "Chief Petty Officer Homer Nelson", "Seaman Howard Spicer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7918   Expand Ensign O'Toole   (1962) User Score Overview Ensign O'Toole is a military comedy that aired on NBC from September 23, 1962, to May 5, 1963, with 31-year-old Dean Jones in the title role of a nonchalant United States Navy ensign during the early 1960s. Jones, born in 1931 in Alabama and a Navy veteran of the Korean War, played an officer aboard the fictional U.S. Navy destroyer USS Appleby, which roamed the Pacific Ocean. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dean Jones Ensign O'Toole Jack Albertson Lieutenant Commander Virgil Stoner Harvey Lembeck Seaman Gabby Di Julio Jay C. Flippen Chief Petty Officer Homer Nelson Beau Bridges Seaman Howard Spicer Full Cast & Crew Last Season Season 1 1962 | 32 Episodes Season 1 of Ensign O'Toole premiered on September 23, 1962. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ensign O'Toole. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres War & Politics Comedy Keywords boat u.s. navy military sitcom Content Score 71 Just a little bit more... Top Contributors 18 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}