{"link": "https://www.themoviedb.org/tv/78317?language=en", "title": "The City and the City", "resume": "When the body of a foreign student is discovered in the streets of the down-at-heel city of Besźel, it’s just another day’s work for Inspector Tyador Borlú of the Extreme Crime Squad. But he uncovers evidence that the murdered girl came from Ul Qoma, a city that shares a dangerous and volatile relationship with Besźel, and this case will challenge everything Borlú holds dear.", "rate": 68, "genre": ["Drama", "Sci-Fi", "Fantasy", "Crime"], "cast": ["David Morrissey", "Lara Pulver", "Mandeep Dhillon", "Maria Schrader", "Ron Cook"], "character": ["Tyador Borlú", "Katrynia Borlú", "Constable Corwi", "Senior Detective Dhatt", "Commissar Gadlem"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78317   Expand The City and the City   (2018) User Score  Play Trailer Overview When the body of a foreign student is discovered in the streets of the down-at-heel city of Besźel, it’s just another day’s work for Inspector Tyador Borlú of the Extreme Crime Squad. But he uncovers evidence that the murdered girl came from Ul Qoma, a city that shares a dangerous and volatile relationship with Besźel, and this case will challenge everything Borlú holds dear. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Morrissey Tyador Borlú Lara Pulver Katrynia Borlú Mandeep Dhillon Constable Corwi Maria Schrader Senior Detective Dhatt Ron Cook Commissar Gadlem Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of The City and the City premiered on April  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The City and the City. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p061bd5l Genres Drama Sci-Fi & Fantasy Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 53 Elizabeth Jennings 8 midnightmark 3 express P 3 PlexRowe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}