{"link": "https://www.themoviedb.org/tv/35448?language=en", "title": "Kim Soo Ro", "resume": "This drama charts the life of Kim Soo Ro, legendary founder of Geumgwan Gaya, the ruling city-state of the Gaya confederacy, which dominated sea trade and iron working during the Three Kingdoms Period. Kim Soo Ro's fiery temperament, charisma and intelligence are his only defense in the extended political struggle, with competition for the throne from his half-brother and lifelong rival, Ijinashi, his former friend Suk Tal Hae, and the dangerous ambitions of Shin Kwi Gan.", "rate": 70, "genre": ["Drama"], "cast": ["Ji Sung", "Park Gun-tae", "Bae Jong-ok", "Yu Oh-seong", "Seo Ji-hye"], "character": ["Kim Su-ro", "Su-ro (young)", "Jeong Kyeon-bi", "Shingwi Ghan / Tae-gang", "Heo Hwang-ok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35448   Expand Kim Soo Ro   (2010) User Score Overview This drama charts the life of Kim Soo Ro, legendary founder of Geumgwan Gaya, the ruling city-state of the Gaya confederacy, which dominated sea trade and iron working during the Three Kingdoms Period. Kim Soo Ro's fiery temperament, charisma and intelligence are his only defense in the extended political struggle, with competition for the throne from his half-brother and lifelong rival, Ijinashi, his former friend Suk Tal Hae, and the dangerous ambitions of Shin Kwi Gan. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Sung Kim Su-ro Park Gun-tae Su-ro (young) Bae Jong-ok Jeong Kyeon-bi Yu Oh-seong Shingwi Ghan / Tae-gang Seo Ji-hye Heo Hwang-ok Full Cast & Crew Last Season Season 1 2010 | 32 Episodes Season 1 of Kim Soo Ro premiered on May 29, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Kim Soo Ro. You can help by rating TV shows you've seen. Facts Original Name  김수로 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/suro/ Genres Drama Keywords korea period drama Content Score 86 Almost there... Top Contributors M 44 Maria180493 z 10 zurman1 CM 7 Cherche Moi t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}