{"link": "https://www.themoviedb.org/tv/66543?language=en", "title": "Story Hunters", "resume": "A video journalist project, showcasing original stories and powered by the audience.", "rate": 85, "genre": ["News"], "cast": ["Ashlynne McGee", "Auskar Surbakti", "Mike Clay"], "character": ["Video Journalist", "Video Journalist", "Video Journalist"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66543   Expand Story Hunters   (2016) User Score  Play Trailer Overview A video journalist project, showcasing original stories and powered by the audience. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashlynne McGee Video Journalist Auskar Surbakti Video Journalist Mike Clay Video Journalist Full Cast & Crew Last Season Season 1 2016 | 56 Episodes Season 1 of Story Hunters premiered on May 16, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Story Hunters. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Story Hunters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  News Original Language  English Runtime  5m Homepage   http://iview.abc.net.au/collection/story-hunters-finding-the-stories-you-want-told Genres News Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 43 United600 3 Elizabeth Jennings TB 1 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}