{"link": "https://www.themoviedb.org/tv/3576?language=en", "title": "Kindred: The Embraced", "resume": "Kindred: The Embraced is an American television series produced by John Leekley Productions and Spelling Television. Loosely based on the role-playing game Vampire: The Masquerade, the series premiered on Fox on April 2, 1996, and ran for eight episodes before it was canceled on May 9, 1996.\nThe series focused on San Francisco Police Detective Frank Kohanek who discovers his city is home to numerous vampires while investigating alleged mobster, Julian Luna. Julian is the \"prince\" of the city, ruler of five groups of vampires in the city, collectively called \"The Kindred\". The vampires survive through the \"masquerade\", disguising themselves as humans, and Julian strictly enforces the laws that govern them to protect their anonymity. Julian and Frank form an uneasy bond as they work together to try to prevent a vampire war and Julian struggles with his romantic feelings for human reporter Caitlin Byrne.\nThe eight episodes of the series have been released on VHS and DVD.", "rate": 67, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Erik King", "Stacy Haiduk", "Patrick Bauchau", "C. Thomas Howell", "Brigid Brannagh"], "character": ["Sonny Toussaint", "Lillie Langtry", "Archon Raine", "Det. Frank Kohanek", "Sasha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3576   Expand Kindred: The Embraced   (1996) User Score Overview Kindred: The Embraced is an American television series produced by John Leekley Productions and Spelling Television. Loosely based on the role-playing game Vampire: The Masquerade, the series premiered on Fox on April 2, 1996, and ran for eight episodes before it was canceled on May 9, 1996. The series focused on San Francisco Police Detective Frank Kohanek who discovers his city is home to numerous vampires while investigating alleged mobster, Julian Luna. Julian is the \"prince\" of the city, ruler of five groups of vampires in the city, collectively called \"The Kindred\". The vampires survive through the \"masquerade\", disguising themselves as humans, and Julian strictly enforces the laws that govern them to protect their anonymity. Julian and Frank form an uneasy bond as they work together to try to prevent a vampire war and Julian struggles with his romantic feelings for human reporter Caitlin Byrne. The eight episodes of the series have been released on VHS and DVD. Featured Crew Mark Rein·Hagen Creator John Leekley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erik King Sonny Toussaint Stacy Haiduk Lillie Langtry Patrick Bauchau Archon Raine C. Thomas Howell Det. Frank Kohanek Brigid Brannagh Sasha Full Cast & Crew Last Season Season 1 1996 | 8 Episodes Season 1 of Kindred: The Embraced premiered on April  2, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2001-03-30 Invader Zim 7.6    1967-09-29 The Prisoner 7.6    1980-09-15 Shogun 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors C 11 CherryJones z 10 zurman1 3 Banana p 3 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}