{"link": "https://www.themoviedb.org/tv/27213?language=en", "title": "The Late Late Show with Craig Kilborn", "resume": "Craig Kilborn hosted this zany talk show, which followed David Letterman's show, from 1999 until 2004. Kilborn left The Daily Show in 1999 to be this show's host after Tom Synder retired. The segment \"5 Questions\" was carried over from when he was on The Daily Show. Kilborn was frequently beaten in the ratings by his NBC timeslot rival, Conan O'Brien. Kilborn left The Late Late Show to pursue new opportunities.", "rate": 51, "genre": ["Talk"], "cast": ["Craig Kilborn", "Mike Birbiglia"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27213   Expand The Late Late Show with Craig Kilborn   (1999) User Score Overview Craig Kilborn hosted this zany talk show, which followed David Letterman's show, from 1999 until 2004. Kilborn left The Daily Show in 1999 to be this show's host after Tom Synder retired. The segment \"5 Questions\" was carried over from when he was on The Daily Show. Kilborn was frequently beaten in the ratings by his NBC timeslot rival, Conan O'Brien. Kilborn left The Late Late Show to pursue new opportunities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Kilborn Mike Birbiglia Full Cast & Crew Last Season Season 5 — | 35 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Late Late Show with Craig Kilborn. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Talk Keywords talk show Content Score 43 There's no 'I' in team... Top Contributors 5 Banana PS 4 P. Snoopy 2 lineker D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}