{"link": "https://www.themoviedb.org/tv/2489?language=en", "title": "Bleak House", "resume": "Bleak House is a fifteen-part BBC television drama serial adaptation of Charles Dickens' novel Bleak House, which was originally published in 1852–53. Produced with an all-star cast, the serial was shown on BBC One from October to December 2005, and drew much critical and popular praise. It has been reported that the total cost of the production was in the region of £8 million.", "rate": 81, "genre": ["Drama"], "cast": ["Anna Maxwell Martin", "Denis Lawson", "Carey Mulligan", "Gillian Anderson", "Charles Dance"], "character": ["Esther Summerson", "Ada Clare", "Lady Dedlock", "Mr. Tulkinghorn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2489   Expand Bleak House   (2005) User Score  Play Trailer Overview Bleak House is a fifteen-part BBC television drama serial adaptation of Charles Dickens' novel Bleak House, which was originally published in 1852–53. Produced with an all-star cast, the serial was shown on BBC One from October to December 2005, and drew much critical and popular praise. It has been reported that the total cost of the production was in the region of £8 million. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Maxwell Martin Esther Summerson Denis Lawson Carey Mulligan Ada Clare Gillian Anderson Lady Dedlock Charles Dance Mr. Tulkinghorn Full Cast & Crew Last Season Season 1 2005 | 15 Episodes Season 1 of Bleak House premiered on October 27, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bleak House. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  55m, 30m Homepage   http://www.bbc.co.uk/drama/bleakhouse/welcome.shtml Genres Drama Keywords inheritance period drama charles dickens Content Score 93 Almost there... Top Contributors 7 Banana w 4 webmaster R 3 Rebecca o 3 olgenia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}