{"link": "https://www.themoviedb.org/tv/12832?language=en", "title": "The Hunger", "resume": "The Hunger is a British/Canadian television horror anthology series, co-produced by Scott Free Productions, Telescene Film Group Productions and the Canadian pay-TV channel The Movie Network. Though it shares a title with the feature film The Hunger the series has no direct plot or character connection to the film, and was created by Jeff Fazio.\nOriginally shown on the Sci Fi Channel in the UK, The Movie Network in Canada and Showtime in the US, the series was broadcast from 1997 to 2000, and is internally organized into two seasons. Each episode was based around an independent story introduced by the host; Terence Stamp hosted each episode for the first season, and was replaced in the second season by David Bowie. Stories tended to focus on themes of self-destructive desire and obsession, with a strong component of soft-core erotica; popular tropes for the stories included cannibalism, vampires, sex, and poison.", "rate": 57, "genre": ["Drama"], "cast": ["Terence Stamp", "David Bowie"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12832   Expand The Hunger   (1997) User Score Overview The Hunger is a British/Canadian television horror anthology series, co-produced by Scott Free Productions, Telescene Film Group Productions and the Canadian pay-TV channel The Movie Network. Though it shares a title with the feature film The Hunger the series has no direct plot or character connection to the film, and was created by Jeff Fazio. Originally shown on the Sci Fi Channel in the UK, The Movie Network in Canada and Showtime in the US, the series was broadcast from 1997 to 2000, and is internally organized into two seasons. Each episode was based around an independent story introduced by the host; Terence Stamp hosted each episode for the first season, and was replaced in the second season by David Bowie. Stories tended to focus on themes of self-destructive desire and obsession, with a strong component of soft-core erotica; popular tropes for the stories included cannibalism, vampires, sex, and poison. Featured Crew Jeff Fazio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Terence Stamp David Bowie Full Cast & Crew Last Season Season 2 1999 | 22 Episodes Season 2 of The Hunger premiered on September 10, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2007-10-12 Women's Murder Club 6.8    1966-09-09 The Time Tunnel 7.0    2009-11-15 The Prisoner 5.8    1987-09-25 Beauty and the Beast 7.4    1965-09-15 Lost in Space 6.8    1996-09-28 Early Edition 6.7    1968-09-20 Hawaii Five-O 6.7    2000-10-02 Andromeda 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Drama Keywords horror anthology Content Score 64 We're so close, yet so far. Top Contributors 13 krom33 8 hpcodecraft z 5 zurman1 CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}