{"link": "https://www.themoviedb.org/tv/21296?language=en", "title": "Sherlock Hound", "resume": "Loosely based on the \"Sherlock Holmes\" series by Sir Arthur Conan Doyle, Sherlock Hound turns all the classic characters into dogs. The canine Sherlock Holmes, his assistant Watson, and housemaid Mrs. Hudson work together to solve mysteries. The culprit is usually Professor Moriarty and his gang, who use all kinds of wacky contraptions to steal what they want.", "rate": 78, "genre": ["Action", "Adventure", "Animation"], "cast": ["Taichirō Hirokawa", "Chikao Ohtsuka", "Yôko Asagami", "Kousei Tomita", "Shozo Iizuka"], "character": ["Sherlock Hound", "Professor Moriarty", "Mrs. Hudson", "Doctor Watson", "Inspector Lestrade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21296   Expand Sherlock Hound   (1984) User Score Overview Loosely based on the \"Sherlock Holmes\" series by Sir Arthur Conan Doyle, Sherlock Hound turns all the classic characters into dogs. The canine Sherlock Holmes, his assistant Watson, and housemaid Mrs. Hudson work together to solve mysteries. The culprit is usually Professor Moriarty and his gang, who use all kinds of wacky contraptions to steal what they want. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Taichirō Hirokawa Sherlock Hound Chikao Ohtsuka Professor Moriarty Yôko Asagami Mrs. Hudson Kousei Tomita Doctor Watson Shozo Iizuka Inspector Lestrade Full Cast & Crew Last Season Season 1 1984 | 26 Episodes Season 1 of Sherlock Hound premiered on November 26, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations   2000-01-09 Malcolm in the Middle 7.5    1997-08-13 South Park 7.8    2011-12-04 Black Mirror 8.2  Facts Original Name  名探偵ホームズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords investigation Content Score 86 Almost there... Top Contributors 8 Banana 8 sp1ti A 6 Anlothen z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}