{"link": "https://www.themoviedb.org/tv/123?language=en", "title": "Starting Over", "resume": "Starting Over is an American reality TV show that follows the lives of women who are experiencing difficulty in their lives and want to make changes, with the help of life coaches. It was the first reality TV show to be nominated for a Daytime Emmy Award. Six women at a time work to overcome obstacles and meet personal goals. When it is determined that a woman has met all her goals, she \"graduates\" from the house and is replaced by a new roommate. On the other hand, if it's determined that she's not met her goals, she could be put on probation, or even asked to leave.", "rate": 0, "genre": [], "cast": ["Rana Walker", "Iyanla Vanzant", "Rhonda Britten", "Lou Marini", "Vanessa Atler"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 123   Expand Starting Over   (2003) User Score Overview Starting Over is an American reality TV show that follows the lives of women who are experiencing difficulty in their lives and want to make changes, with the help of life coaches. It was the first reality TV show to be nominated for a Daytime Emmy Award. Six women at a time work to overcome obstacles and meet personal goals. When it is determined that a woman has met all her goals, she \"graduates\" from the house and is replaced by a new roommate. On the other hand, if it's determined that she's not met her goals, she could be put on probation, or even asked to leave. Featured Crew Jonathan Murray Creator Mary-Ellis Bunim Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rana Walker Iyanla Vanzant Rhonda Britten Lou Marini Vanessa Atler Full Cast & Crew Last Season Season 2 2004 | 40 Episodes Season 2 of Starting Over premiered on September 13, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Starting Over. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors C 1 Conspirance  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}