{"link": "https://www.themoviedb.org/tv/58823?language=en", "title": "Friends with Better Lives", "resume": "A comedy about six friends at different stages in their lives – married, divorced, newly engaged and single – who are outwardly happy, but secretly questioning if their friends have it better. Andi and Bobby are happily married with two kids but at times long for the days they had less responsibility and more fun; Will is newly single and preaching the bachelor lifestyle, but still pining for his ex-wife; Jules and Lowell are high on their passionate new relationship; and Kate has a successful career but may take a swan dive into the L.A. River when she finds out her last remaining single friend, Jules, just got engaged. When it comes to relationships, these six friends are finding it a challenge to look at each other without wondering… who really has the better life?", "rate": 61, "genre": ["Comedy"], "cast": ["Kevin Connolly", "James Van Der Beek", "Majandra Delfino", "Rick Donald", "Zoe Lister-Jones"], "character": ["Bobby Lutz", "Will Stokes", "Andi", "Lowell", "Kate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58823   Expand Friends with Better Lives   (2014) User Score  Play Trailer Overview A comedy about six friends at different stages in their lives – married, divorced, newly engaged and single – who are outwardly happy, but secretly questioning if their friends have it better. Andi and Bobby are happily married with two kids but at times long for the days they had less responsibility and more fun; Will is newly single and preaching the bachelor lifestyle, but still pining for his ex-wife; Jules and Lowell are high on their passionate new relationship; and Kate has a successful career but may take a swan dive into the L.A. River when she finds out her last remaining single friend, Jules, just got engaged. When it comes to relationships, these six friends are finding it a challenge to look at each other without wondering… who really has the better life? Featured Crew Dana Klein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Connolly Bobby Lutz James Van Der Beek Will Stokes Majandra Delfino Andi Rick Donald Lowell Zoe Lister-Jones Kate Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Friends with Better Lives premiered on March 31, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2015-03-31 Weird Loners 5.8    2015-03-25 Big Time in Hollywood, Fl 5.7    2014-10-10 Cristela 6.1    2012-09-26 The Neighbors 6.3    2011-11-30 The Exes 6.6    2013-08-05 Quick Draw 6.3    2014-05-29 Undateable 6.2    2013-11-14 Ground Floor 6.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   www.cbs.com/shows/friends-with-better-lives/ Genres Comedy Keywords friendship romance group of friends sitcom Content Score 100 Yes! Looking good! Top Contributors 16 Ryan McCloskey AK 6 Avshalom Kor M 5 Manu b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}