{"link": "https://www.themoviedb.org/tv/16906?language=en", "title": "The Beatles Anthology", "resume": "A documentary series on the career of The Beatles.", "rate": 83, "genre": ["Documentary"], "cast": ["Paul McCartney", "George Harrison", "Ringo Starr", "Neil Aspinall", "George Martin"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16906   Expand The Beatles Anthology   (1995) User Score  Play Trailer Overview A documentary series on the career of The Beatles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul McCartney Himself George Harrison Himself Ringo Starr Himself Neil Aspinall Himself George Martin Himself Full Cast & Crew Last Season Miniseries 1995 | 3 Episodes Season 1 of The Beatles Anthology premiered on November 19, 1995. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Beatles Anthology. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  10 Recommendations   1999-01-08 Gimme Gimme Gimme 7.0    2011-11-10 Life's Too Short 7.1    1999-01-11 The League of Gentlemen 7.4    1994-09-27 The Fast Show 7.6    2006-03-12 Big Love 7.6    1993-05-09 The Tommyknockers 5.1    2010-09-28 No Ordinary Family 6.1    1980-09-15 Shogun 7.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  75m Homepage   http://www.thebeatles.com/film/beatles-anthology Genres Documentary Keywords biography miniseries the beatles Content Score 93 Almost there... Top Contributors d 19 duteri78 TB 17 TMDb Bot 10 weisheng 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}