{"link": "https://www.themoviedb.org/tv/41283?language=en", "title": "Primeval: New World", "resume": "A North American spin-off of the hit U.K. television series, Primeval: New World follows a specialized team of animal experts and scientists that investigates the appearance of temporal anomalies and battles both prehistoric and futuristic creatures.", "rate": 65, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Niall Matter", "Sara Canning", "Danny Rahim", "Crystal Lowe", "Miranda Frigon"], "character": ["Evan Cross", "Dylan Weir", "Mac Rendell", "Toby Nance", "Ange Finch"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41283   Expand Primeval: New World   (2012) User Score  Play Trailer Overview A North American spin-off of the hit U.K. television series, Primeval: New World follows a specialized team of animal experts and scientists that investigates the appearance of temporal anomalies and battles both prehistoric and futuristic creatures. Featured Crew Martin Wood Creator Amanda Tapping Creator Mike Rohl Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Niall Matter Evan Cross Sara Canning Dylan Weir Danny Rahim Mac Rendell Crystal Lowe Toby Nance Miranda Frigon Ange Finch Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Primeval: New World premiered on October 29, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2007-02-10 Primeval 6.6    2013-09-26 The Crazy Ones 5.8    1982-09-26 Matt Houston 6.6    1954-09-12 Lassie 5.3    2011-07-11 Alphas 6.5    2010-01-17 Human Target 7.1    1966-09-12 The Monkees 6.3    1996-09-28 Psi Factor: Chronicles of the Paranormal 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords dinosaur jurassic park raptor time portal Content Score 100 Yes! Looking good! Top Contributors 23 Atanas CM 11 Cherche Moi d 9 denis 8 Philippe LeMarchand  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}