{"link": "https://www.themoviedb.org/tv/9543?language=en", "title": "Gankutsuou", "resume": "In an elegant future Paris, a Count returns to wreak havoc on those that betrayed him.", "rate": 89, "genre": ["Drama", "Animation"], "cast": ["Jun Fukuyama", "Jouji Nakata"], "character": ["Albert de Morcerf (voice)", "The Count (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9543   Expand Gankutsuou   (2004) User Score Overview In an elegant future Paris, a Count returns to wreak havoc on those that betrayed him. Featured Crew Mahiro Maeda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Albert de Morcerf (voice) Jouji Nakata The Count (voice) Full Cast & Crew Last Season Season 1 2004 | 24 Episodes Season 1 of Gankutsuou premiered on October  6, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2004-04-24 Wolf's Rain 6.6    1999-03-07 Digimon 6.8    2004-05-20 Samurai Champloo 8.0    1998-04-03 Cowboy Bebop 8.2  Facts Original Name  巌窟王 Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Drama Animation Keywords france based on novel or book conspiracy cgi anime Content Score 64 We're so close, yet so far. Top Contributors 104 Marr 🇳🇱 m 3 morrison m 3 magoozin TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}