{"link": "https://www.themoviedb.org/tv/3086?language=en", "title": "De Lama's", "resume": "De Lama's is a Dutch television show made by BNN and first aired on 26 June 2004. It is an adaptation of the Channel 4 show Whose Line is it Anyway?.\nPatrick Lodiers hosts the show, which contains both well-known and more obscure elements of theatresports. The most important of these is improvisation.\nDe Lama's consist of the following comedians: Ruben Nicolai, Tijl Beckand, Ruben van der Meer and Jeroen van Koningsbrugge. Jandino Asporaat, Ad-Just Bouwman, Sara Kroos, Arie Koomen, Kristel Zweers and Martijn Oosterhuis are ex-Lama's. Other than in the British and American series, every episode of De Lama's features a Guest Llama, a well-known Dutch person who offers suggestions for games and always joins the regulars for one or two games at the end.\nAt the end of 2006, regulars Sara Kroos and Arie Koomen left the show, leaving it with only three regular performers. To help alleviate this problem, broadcaster BNN organised a televised competition, Lama Gezocht, in order to find a new performer to round out the team. Ad-Just Bouwman eventually won this competition, and joined the Llamas. He, however, is no longer part of the troupe, reportedly because his artistic style didn't fit in with the other Llamas. Another recently 'llamafied' performer, Jandino Asporaat, left at around the same time to focus on his own theatre production, although rumour has it that his style clashed with the remaining three members as well. Jeroen van Koningsbrugge is the only new member to remain with the Llamas until the end.", "rate": 0, "genre": ["Comedy"], "cast": ["Patrick Lodiers", "Jeroen van Koningsbrugge", "Arie Koomen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3086   Expand De Lama's   (2004) User Score Overview De Lama's is a Dutch television show made by BNN and first aired on 26 June 2004. It is an adaptation of the Channel 4 show Whose Line is it Anyway?. Patrick Lodiers hosts the show, which contains both well-known and more obscure elements of theatresports. The most important of these is improvisation. De Lama's consist of the following comedians: Ruben Nicolai, Tijl Beckand, Ruben van der Meer and Jeroen van Koningsbrugge. Jandino Asporaat, Ad-Just Bouwman, Sara Kroos, Arie Koomen, Kristel Zweers and Martijn Oosterhuis are ex-Lama's. Other than in the British and American series, every episode of De Lama's features a Guest Llama, a well-known Dutch person who offers suggestions for games and always joins the regulars for one or two games at the end. At the end of 2006, regulars Sara Kroos and Arie Koomen left the show, leaving it with only three regular performers. To help alleviate this problem, broadcaster BNN organised a televised competition, Lama Gezocht, in order to find a new performer to round out the team. Ad-Just Bouwman eventually won this competition, and joined the Llamas. He, however, is no longer part of the troupe, reportedly because his artistic style didn't fit in with the other Llamas. Another recently 'llamafied' performer, Jandino Asporaat, left at around the same time to focus on his own theatre production, although rumour has it that his style clashed with the remaining three members as well. Jeroen van Koningsbrugge is the only new member to remain with the Llamas until the end. Featured Crew Dan Patterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Lodiers Jeroen van Koningsbrugge Arie Koomen Full Cast & Crew Last Season Season 9 2008 | 12 Episodes Season 9 of De Lama's premiered on September  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on De Lama's. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  35m, 40m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 2 BudsieBuds  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}