{"link": "https://www.themoviedb.org/tv/10424?language=en", "title": "Werewolf", "resume": "Werewolf is an American horror series, and one of the original shows in the Fox network's broadcast line-up during its inaugural season of 1987–1988.\nThe show follows the adventures of Eric Cord, a college student transformed into a werewolf who undergoes a quest to rid himself of his curse by killing the apparent originator of his 'bloodline,' a drifter named Janos Skorzeny. While pursuing Skorzeny, Cord himself is pursued by the persistent bounty hunter \"Alamo\" Joe Rogan. However, Cord then begins to hunt down Nicholas Remy, the real originator of the bloodline.\nThe show aired a two-hour pilot and 28 half-hour episodes before being cancelled in 1988. In the United Kingdom the series aired on Sky One c. 1989-1990.", "rate": 60, "genre": ["Drama"], "cast": ["Lance LeGault", "John J. York", "Brian Thompson", "Chuck Connors"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10424   Expand Werewolf   (1987) User Score Overview Werewolf is an American horror series, and one of the original shows in the Fox network's broadcast line-up during its inaugural season of 1987–1988. The show follows the adventures of Eric Cord, a college student transformed into a werewolf who undergoes a quest to rid himself of his curse by killing the apparent originator of his 'bloodline,' a drifter named Janos Skorzeny. While pursuing Skorzeny, Cord himself is pursued by the persistent bounty hunter \"Alamo\" Joe Rogan. However, Cord then begins to hunt down Nicholas Remy, the real originator of the bloodline. The show aired a two-hour pilot and 28 half-hour episodes before being cancelled in 1988. In the United Kingdom the series aired on Sky One c. 1989-1990. Featured Crew Frank Lupo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lance LeGault John J. York Brian Thompson Chuck Connors Full Cast & Crew Last Season Season 1 1987 | 32 Episodes Season 1 of Werewolf premiered on July 11, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Werewolf. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 Thxneo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}