{"link": "https://www.themoviedb.org/tv/63089?language=en", "title": "Chaos Dragon: Sekiryuu Sen'eki", "resume": "The story takes place in Huanli (the Year of Dazzling) 3015. Donatia and Kouran, two countries fighting for supremacy, are causing the world to be torn apart due to the constant war. Amidst the strife is the island country Nil Kamui, which has lost its independence. Red Dragon, the guardian god of Nil Kamui, goes out of control. Will the island country be able to regain its independence?", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Ayaka Imamura", "Haruka Terui", "Haruka  Watanabe", "Marina Inoue", "Miyuki Sawashiro"], "character": ["Misuka", "Meryll", "Kai", "Ibuki", "Eiha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63089   Expand Chaos Dragon: Sekiryuu Sen'eki   (2015) User Score Overview The story takes place in Huanli (the Year of Dazzling) 3015. Donatia and Kouran, two countries fighting for supremacy, are causing the world to be torn apart due to the constant war. Amidst the strife is the island country Nil Kamui, which has lost its independence. Red Dragon, the guardian god of Nil Kamui, goes out of control. Will the island country be able to regain its independence? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayaka Imamura Misuka Haruka Terui Meryll Haruka  Watanabe Kai Marina Inoue Ibuki Miyuki Sawashiro Eiha Full Cast & Crew Last Season Season 1 2015 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chaos Dragon: Sekiryuu Sen'eki. You can help by rating TV shows you've seen. Facts Original Name  ケイオスドラゴン 赤竜戦役 Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://chaosdragon.red/ Genres Action & Adventure Animation Keywords based on video game anime Content Score 86 Almost there... Top Contributors 31 miryoku j 24 jnylen 12 sp1ti 7 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}