{"link": "https://www.themoviedb.org/tv/13905?language=en", "title": "Twelve O'Clock High", "resume": "This series chronicles the adventures--in the air and on the ground--of the men of the 918th Bombardment Group of the U.S. Eighth Air Force. First commanded by irascible General Frank Savage--and later by Colonel Joe Gallagher, the son of a Pentagon General--the Group is stationed in England, and flies long-range bombing missions into German-held Europe.", "rate": 82, "genre": ["Drama"], "cast": ["Frank Overton", "Paul Burke", "Chris Robinson", "Robert Lansing", "Barney Phillips"], "character": ["Major Harvey Stovall", "Colonel Joseph Anson Gallagher", "Sergeant Alexander \"Sandy\" Komansky", "Brigadier General Frank Savage"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13905   Expand Twelve O'Clock High   (1964) User Score Overview This series chronicles the adventures--in the air and on the ground--of the men of the 918th Bombardment Group of the U.S. Eighth Air Force. First commanded by irascible General Frank Savage--and later by Colonel Joe Gallagher, the son of a Pentagon General--the Group is stationed in England, and flies long-range bombing missions into German-held Europe. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Overton Major Harvey Stovall Paul Burke Colonel Joseph Anson Gallagher Chris Robinson Sergeant Alexander \"Sandy\" Komansky Robert Lansing Brigadier General Frank Savage Barney Phillips Full Cast & Crew Last Season Season 3 1966 | 17 Episodes Season 3 of Twelve O'Clock High premiered on September  9, 1966. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply MK The Twelve O'Clock High Drinking Game Open 2 by  Maria Kelly MK twelve o'clock high the tv series Open 9 by  Maria Kelly MK Robert Lansing Open 5 by  Maria Kelly Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1965-01-24 Branded 8.3    1959-11-19 The Rocky and Bullwinkle Show 8.7    1957-09-18 Wagon Train 6.3    1954-10-27 Walt Disney's Wonderful World of Color 6.8    1964-09-24 Daniel Boone 5.9    1968-01-09 It Takes a Thief 7.4    1987-09-26 Jake and the Fatman 4.9    1971-09-14 Cannon 5.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 51m Homepage  - Genres Drama Keywords sacrifice bomber pilot maximum effort Content Score 86 Almost there... Top Contributors PE 20 Patrick E. Abe 6 Elizabeth Jennings T 3 Thelvcz 3 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}