{"link": "https://www.themoviedb.org/tv/43221?language=en", "title": "Finding Your Roots", "resume": "Noted Harvard scholar Henry Louis Gates, Jr.  has been helping people discover long-lost relatives hidden for generations within the branches of their family trees.  Professor Gates utilizes a team of genealogists to reconstruct the paper trail left behind by our ancestors and the world’s leading geneticists to decode our DNA and help us travel thousands of years into the past to discover the origins of our earliest forebears.", "rate": 80, "genre": ["Documentary"], "cast": ["Henry Louis Gates, Jr."], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43221   Expand Finding Your Roots   (2012) User Score  Play Trailer Overview Noted Harvard scholar Henry Louis Gates, Jr.  has been helping people discover long-lost relatives hidden for generations within the branches of their family trees.  Professor Gates utilizes a team of genealogists to reconstruct the paper trail left behind by our ancestors and the world’s leading geneticists to decode our DNA and help us travel thousands of years into the past to discover the origins of our earliest forebears. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Henry Louis Gates, Jr. Himself - Host Full Cast & Crew Last Season Seasons 4 2017 | 1 Episode Season 4 of Finding Your Roots premiered on October  2, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Henry Louis Gates, Jr. celebrity genealogies series Open 0 by genplant29\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Finding Your Roots. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.pbs.org/wnet/finding-your-roots/ Genres Documentary Keywords dna celebrity ancestry genealogy Content Score 64 We're so close, yet so far. Top Contributors 24 Elizabeth Jennings O 4 OldTimerToo n 3 ntiadit9 3 genplant29  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}