{"link": "https://www.themoviedb.org/tv/3870?language=en", "title": "Donny & Marie", "resume": "Donny & Marie is an American variety show which aired on ABC from January 1976 to January 1979. The show stars brother and sister pop duo Donny Osmond and Marie Osmond. Donny had first become popular singing in a music group with his brothers, The Osmonds, and Marie was one of the youngest singers to reach #1 on the Billboard Country Music charts.\nThe siblings were offered a weekly show by ABC-TV President Fred Silverman after he saw the duo co-host a week on The Mike Douglas Show which followed their series of popular remakes of oldies, such as \"I'm Leaving It Up To You\", \"Morning Side Of The Mountain\", \"Deep Purple\" and \"Make The World Go Away\". Donny and Marie were the youngest entertainers in TV history to host their own variety show. A year later, The Keane Brothers would break this record.", "rate": 65, "genre": [], "cast": ["Alan Osmond", "Donny Osmond", "Jay Osmond", "Marie Osmond", "Merrill Osmond"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3870   Expand Donny & Marie   (1976) User Score Overview Donny & Marie is an American variety show which aired on ABC from January 1976 to January 1979. The show stars brother and sister pop duo Donny Osmond and Marie Osmond. Donny had first become popular singing in a music group with his brothers, The Osmonds, and Marie was one of the youngest singers to reach #1 on the Billboard Country Music charts. The siblings were offered a weekly show by ABC-TV President Fred Silverman after he saw the duo co-host a week on The Mike Douglas Show which followed their series of popular remakes of oldies, such as \"I'm Leaving It Up To You\", \"Morning Side Of The Mountain\", \"Deep Purple\" and \"Make The World Go Away\". Donny and Marie were the youngest entertainers in TV history to host their own variety show. A year later, The Keane Brothers would break this record. Featured Crew Marty Krofft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Osmond Donny Osmond Jay Osmond Marie Osmond Merrill Osmond Full Cast & Crew Last Season Donny and marie season 4 1978 | 8 Episodes Season 4 of Donny & Marie premiered on September 22, 1978. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Marie: Happy Birthday Marie Osmond! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Donny & Marie. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  46m, 60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}