{"link": "https://www.themoviedb.org/tv/17420?language=en", "title": "Psychoville", "resume": "Psychoville is a British dark comedy television serial written by and starring The League of Gentlemen members Reece Shearsmith and Steve Pemberton. It debuted on BBC Two on 18 June 2009. Pemberton and Shearsmith each play numerous characters, with Dawn French and Jason Tompkins in additional starring roles. The first series was followed by a Halloween special, broadcast on 31 October 2010, which saw Imelda Staunton added to the main cast along with previously supporting actors Eileen Atkins and Daniel Kaluuya. The second series started broadcasting on 5 May 2011 and ended on 6 June. Reece Shearsmith has officially announced that there will not be a third series.", "rate": 72, "genre": ["Comedy", "Mystery"], "cast": ["Dawn French", "Reece Shearsmith", "Christopher Biggins", "Debbie Chazen", "Eileen Atkins"], "character": ["Maureen Sowerbutts"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17420   Expand Psychoville   (2009) User Score Overview Psychoville is a British dark comedy television serial written by and starring The League of Gentlemen members Reece Shearsmith and Steve Pemberton. It debuted on BBC Two on 18 June 2009. Pemberton and Shearsmith each play numerous characters, with Dawn French and Jason Tompkins in additional starring roles. The first series was followed by a Halloween special, broadcast on 31 October 2010, which saw Imelda Staunton added to the main cast along with previously supporting actors Eileen Atkins and Daniel Kaluuya. The second series started broadcasting on 5 May 2011 and ended on 6 June. Reece Shearsmith has officially announced that there will not be a third series. Featured Crew Reece Shearsmith Creator Steve Pemberton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dawn French Reece Shearsmith Maureen Sowerbutts Christopher Biggins Debbie Chazen Eileen Atkins Full Cast & Crew Last Season Season 2 2011 | 6 Episodes Season 2 of Psychoville premiered on May  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2007-09-27 How Not to Live Your Life 7.2    2009-09-10 Off the Hook 7.3    1999-01-11 The League of Gentlemen 7.4    2011-09-04 Appropriate Adult 6.9    2013-03-25 Plebs 7.6    2014-08-07 Siblings 5.3    2016-05-09 Upstart Crow 7.4    2014-02-05 Inside No. 9 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/psychoville Genres Comedy Mystery Keywords dark comedy surreal horror british humour Content Score 93 Almost there... Top Contributors 16 kcdh O 8 Ozbourne 5 Mitsarinho 2 4 251643711  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}