{"link": "https://www.themoviedb.org/tv/11884?language=en", "title": "Battle of the Network Stars", "resume": "Battle of the Network Stars was a series of competitions where television stars from ABC, CBS, and NBC would compete in various sporting events. A total of nineteen of these competitions were held, all of which were aired by ABC.\nIn 2013, the show appeared in TV Guide's list of the 60 greatest game shows ever.", "rate": 100, "genre": ["Comedy"], "cast": ["Howard Cosell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11884   Expand Battle of the Network Stars   (1976) User Score Overview Battle of the Network Stars was a series of competitions where television stars from ABC, CBS, and NBC would compete in various sporting events. A total of nineteen of these competitions were held, all of which were aired by ABC. In 2013, the show appeared in TV Guide's list of the 60 greatest game shows ever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Howard Cosell Full Cast & Crew Last Season Season 1 1976 | 19 Episodes Season 1 of Battle of the Network Stars premiered on November 13, 1976. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply reboot Open 6 by  bratface Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Battle of the Network Stars. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 120m Homepage  - Genres Comedy Keywords celebrity Content Score 43 There's no 'I' in team... Top Contributors 4 Banana 3 Elizabeth Jennings 2 lineker 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}