{"link": "https://www.themoviedb.org/tv/8082?language=en", "title": "Meteor Garden", "resume": "Meteor Garden is a 2001 Taiwanese drama starring Barbie Hsu, Jerry Yan, Vic Zhou, Vanness Wu and Ken Chu. It is based on Japanese shōjo manga series, Boys Over Flowers, written by Yoko Kamio. It was produced by Comic Ritz International Production with Angie Chai as producer and directed by Cai Yuexun.\nThe series was first broadcast in Taiwan on free-to-air Chinese Television System from 12 April 2001 to 16 August 2001. A supplementary mini-series, Meteor Rain was produced in April 2001 and the sequel Meteor Garden II was broadcast from 11 November 2002 to 25 December 2002. The series is the first live-action television adaptation of the manga, followed by its sequel Meteor Garden II and Japanese Hana Yori Dango, its sequel Hana Yori Dango Returns and South Korean Boys Over Flowers.\nAt the conclusion of the series, F4 Jerry Yan, Vic Zhou, Vanness Wu and Ken Chu continued to perform together and released three studio albums as quartet boy band F4. They ceased the use of the name \"F4\" in 2007 at the objection of Japanese publisher Shueisha, who owns the copyright to Hana Yori Dango, to avoid any confusion with the Japanese and South Korean version of the live-action adaptations of the manga. The group has since been renamed \"JVKV\", from the first initial of the quartet in order of descending age.", "rate": 90, "genre": ["Drama", "Comedy"], "cast": ["Jerry Yan", "Barbie Hsu", "Rainie Yang", "Vic Chou", "Ken Chu"], "character": ["Dao Ming Si", "Shan Cai", "Xiao You", "Hua Ze Lei", "Xi Men"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8082   Expand Meteor Garden   (2001) User Score Overview Meteor Garden is a 2001 Taiwanese drama starring Barbie Hsu, Jerry Yan, Vic Zhou, Vanness Wu and Ken Chu. It is based on Japanese shōjo manga series, Boys Over Flowers, written by Yoko Kamio. It was produced by Comic Ritz International Production with Angie Chai as producer and directed by Cai Yuexun. The series was first broadcast in Taiwan on free-to-air Chinese Television System from 12 April 2001 to 16 August 2001. A supplementary mini-series, Meteor Rain was produced in April 2001 and the sequel Meteor Garden II was broadcast from 11 November 2002 to 25 December 2002. The series is the first live-action television adaptation of the manga, followed by its sequel Meteor Garden II and Japanese Hana Yori Dango, its sequel Hana Yori Dango Returns and South Korean Boys Over Flowers. At the conclusion of the series, F4 Jerry Yan, Vic Zhou, Vanness Wu and Ken Chu continued to perform together and released three studio albums as quartet boy band F4. They ceased the use of the name \"F4\" in 2007 at the objection of Japanese publisher Shueisha, who owns the copyright to Hana Yori Dango, to avoid any confusion with the Japanese and South Korean version of the live-action adaptations of the manga. The group has since been renamed \"JVKV\", from the first initial of the quartet in order of descending age. Featured Crew Yoko Kamio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Yan Dao Ming Si Barbie Hsu Shan Cai Rainie Yang Xiao You Vic Chou Hua Ze Lei Ken Chu Xi Men Full Cast & Crew Last Season Season 2 2002 | 31 Episodes Season 2 of Meteor Garden premiered on November 11, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Meteor Garden. You can help by rating TV shows you've seen. Facts Original Name  流星花園 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage   http://www.cts.com.tw/prog/drama/meteorgarden/ Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 8 tmdb983464 t 7 taxigps M 2 Maria180493 c 1 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}