{"link": "https://www.themoviedb.org/tv/4614?language=en", "title": "NCIS", "resume": "From murder and espionage to terrorism and stolen submarines, a team of special agents investigates any crime that has a shred of evidence connected to Navy and Marine Corps personnel, regardless of rank or position.", "rate": 67, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Mark Harmon", "Pauley Perrette", "Sean Murray", "David McCallum", "Wilmer Valderrama"], "character": ["Leroy Jethro Gibbs", "Abby Sciuto", "Timothy McGee", "Donald \"Ducky\" Mallard", "Nick Torres"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4614   Expand NCIS   (2005) User Score Overview From murder and espionage to terrorism and stolen submarines, a team of special agents investigates any crime that has a shred of evidence connected to Navy and Marine Corps personnel, regardless of rank or position. Featured Crew Don McGill Creator Donald P. Bellisario Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  6 Images Backdrops  31 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Mark Harmon Leroy Jethro Gibbs Pauley Perrette Abby Sciuto Sean Murray Timothy McGee David McCallum Donald \"Ducky\" Mallard Wilmer Valderrama Nick Torres Full Cast & Crew Last Season Season 15 2017 | 24 Episodes Season 15 of NCIS premiered on September 26, 2017. View All Seasons Social Reviews  0 Discussions  22 Subject Status Replies Last Reply w Abby: Happy Birthday Pauley Perrette! Open 1 by  Col_Hessler S15, serial killer Hicks reminds me of DiNozzo Open 0 by WalkGood\n      \n     w Timothy McGee: Happy Birthday Sean Murray! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  31 Posters  13 Recommendations   2009-09-22 NCIS: Los Angeles 6.4    2014-09-23 NCIS: New Orleans 6.3    2005-09-22 Criminal Minds 7.0    2000-10-06 CSI: Crime Scene Investigation 6.7    2002-09-23 CSI: Miami 5.8    2005-09-12 Bones 7.0    2010-09-20 Hawaii Five-0 6.2    2008-09-23 The Mentalist 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbs.com/shows/ncis/ Genres Action & Adventure Crime Drama Keywords navy crime lab u.s. marine corps crime investigation ncis Content Score 100 Yes! Looking good! Top Contributors 231 seawolf 57 niqo19 48 Elizabeth Jennings S 35 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}