{"link": "https://www.themoviedb.org/tv/37681?language=en", "title": "Scarlet Heart", "resume": "Scarlet Heart, also known as Bubu Jingxin, is a Chinese television series based on the novel of the same Chinese title by Tong Hua. Filming for the series started on 6 December 2010 in Shanghai and ended on 22 March 2011. It first aired in China on the Hunan Broadcasting System on 10 September 2011.\nA sequel, Bubu Jingqing, officially began filming in Tianjin, China, on March 2013.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Liu Shishi", "Nicky Wu", "Sun Yizhou", "Damian Lau", "Jiang Jinfu"], "character": ["Zhang Xiao", "Yin Zheng", "Kang Si Han", "Kang Zhen Tian", "Kang Si Yu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37681   Expand Scarlet Heart   (2011) User Score Overview Scarlet Heart, also known as Bubu Jingxin, is a Chinese television series based on the novel of the same Chinese title by Tong Hua. Filming for the series started on 6 December 2010 in Shanghai and ended on 22 March 2011. It first aired in China on the Hunan Broadcasting System on 10 September 2011. A sequel, Bubu Jingqing, officially began filming in Tianjin, China, on March 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Shishi Zhang Xiao Nicky Wu Yin Zheng Sun Yizhou Kang Si Han Damian Lau Kang Zhen Tian Jiang Jinfu Kang Si Yu Full Cast & Crew Last Season Season 2 2014 | 41 Episodes Season 2 of Scarlet Heart premiered on April 22, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Scarlet Heart. You can help by rating TV shows you've seen. Facts Original Name  步步惊心 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  49m Homepage   http://bubujingxin.net/ Genres Action & Adventure Drama Keywords fantasy china time travel romance Content Score 86 Almost there... Top Contributors M 51 Maria180493 t 8 taxigps L 7 Leah 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}