{"link": "https://www.themoviedb.org/tv/2551?language=en", "title": "The Jeremy Kyle Show", "resume": "The Jeremy Kyle Show is a British daytime television tabloid talk show presented by Jeremy Kyle. It has been broadcast on ITV since 4 July 2005. The show is produced by ITV Studios and is broadcast each weekday. The show first appeared as a replacement for Trisha Goddard's chat show, which was moved to Five.\nThe show is based on confrontations in which guests attempt to resolve issues with others that are significant in their lives, these issues include: family, relationship, sex, drug, alcohol and other issues. Frequently, guests display strong emotions such as anger and distress on the show, and Kyle is often harsh towards those that he feels have acted in morally dubious or irresponsible ways, whilst strongly emphasising the importance of traditional family values. This has led to both criticism and parody of the show in newspapers and on television, and even led to the show being described as \"human bear-baiting\" by a Manchester District Judge, during a prosecution after guests had been involved in a violent incident on the show.\nThe show's 1,000th episode was aired on Thursday 18 March 2010. In 2012, the show returned from their Christmas break with a new set.", "rate": 52, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2551   Expand The Jeremy Kyle Show   (2005) User Score Overview The Jeremy Kyle Show is a British daytime television tabloid talk show presented by Jeremy Kyle. It has been broadcast on ITV since 4 July 2005. The show is produced by ITV Studios and is broadcast each weekday. The show first appeared as a replacement for Trisha Goddard's chat show, which was moved to Five. The show is based on confrontations in which guests attempt to resolve issues with others that are significant in their lives, these issues include: family, relationship, sex, drug, alcohol and other issues. Frequently, guests display strong emotions such as anger and distress on the show, and Kyle is often harsh towards those that he feels have acted in morally dubious or irresponsible ways, whilst strongly emphasising the importance of traditional family values. This has led to both criticism and parody of the show in newspapers and on television, and even led to the show being described as \"human bear-baiting\" by a Manchester District Judge, during a prosecution after guests had been involved in a violent incident on the show. The show's 1,000th episode was aired on Thursday 18 March 2010. In 2012, the show returned from their Christmas break with a new set. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2011 | 12 Episodes Season 7 of The Jeremy Kyle Show premiered on September 27, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2005-02-16 The Apprentice 5.2    2012-08-13 Hotel Hell 6.7    1973-02-15 Some Mothers Do 'Ave 'Em 7.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage   http://www.itv.com/jeremykyle Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}