{"link": "https://www.themoviedb.org/tv/78647?language=en", "title": "Sjölyckan", "resume": "A family is going to spend the summer together in the archipelago. Because it is the first summer since the mother of the family passed away, the children wants to support their father. The question is how three generations will be able to stand each other under the same roof.", "rate": 0, "genre": ["Comedy"], "cast": ["Henrik Schyffert", "Shima Niavarani", "Hans Mosesson", "Malin Cederblad", "Gustaf Hammarsten"], "character": ["Tomas", "Lily", "Berndt", "Klara", "Rille"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78647   Expand Sjölyckan   (2018) User Score Overview A family is going to spend the summer together in the archipelago. Because it is the first summer since the mother of the family passed away, the children wants to support their father. The question is how three generations will be able to stand each other under the same roof. Featured Crew Jacob Seth Fransson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Henrik Schyffert Tomas Shima Niavarani Lily Hans Mosesson Berndt Malin Cederblad Klara Gustaf Hammarsten Rille Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Sjölyckan premiered on April  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Sjölyckan. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  20m, 21m, 22m Homepage   https://www.tv4.se/sj%C3%B6lyckan Genres Comedy Keywords stockholm archipelago Content Score 100 Yes! Looking good! Top Contributors 15 BagronkeN a 14 advall 9 zoulnix F 3 FCIK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}