{"link": "https://www.themoviedb.org/tv/68006?language=en", "title": "Taken", "resume": "The origin story of younger, hungrier, former Green Beret Bryan Mills as he deals with a personal tragedy that shakes his world. As he fights to overcome the incident and exact revenge, Mills is pulled into a career as a deadly CIA operative, a job that awakens his very particular, and very dangerous, set of skills.", "rate": 60, "genre": ["Action", "Adventure", "Crime"], "cast": ["Clive Standen", "Jennifer Beals", "Adam Goldberg", "Jessica Camacho"], "character": ["Bryan Mills", "Christina Hart", "Kilroy", "Santana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68006   Expand Taken   (2017) User Score  Play Trailer Overview The origin story of younger, hungrier, former Green Beret Bryan Mills as he deals with a personal tragedy that shakes his world. As he fights to overcome the incident and exact revenge, Mills is pulled into a career as a deadly CIA operative, a job that awakens his very particular, and very dangerous, set of skills. Featured Crew Alexander Cary Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  4 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clive Standen Bryan Mills Jennifer Beals Christina Hart Adam Goldberg Kilroy Jessica Camacho Santana Full Cast & Crew Current Season Season 2 2018 | 16 Episodes Season 2 of Taken premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply That was kind of dumb Open 0 by write2topcat\n      \n     Season 2? Open 1 by  cursethedarkness Please no! Open 3 by  SrEd8r Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  10 Recommendations   2017-02-02 Training Day 6.2    2017-01-03 Heavy Rescue: 401 7.5    2016-11-15 Shooter 6.7    2017-10-01 Ten Days in the Valley 6.0    2008-10-12 Stephen Fry in America 8.0    2014-01-07 Being Mary Jane 7.7    2016-01-07 Shades of Blue 6.2    2016-01-07 Deep 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://nbc.com/taken Genres Action & Adventure Crime Keywords prequel based on movie cia agent Content Score 100 Yes! Looking good! Top Contributors G 33 Gustave2001 p 25 paf69 m 19 misfit_noel 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}