{"link": "https://www.themoviedb.org/tv/62183?language=en", "title": "The Team", "resume": "After a number of murders of prostitutes at a motorway stop near Berlin, in a rear courtyard in Antwerp, and in a brothel in Copenhagen, Europol decides to form a taskforce to tackle the case. Harald, a Dane, Jackie, a German, and Alice from Belgium embark on the hunt for the killer. As the case unfolds, the killings prove to be just the tip of the iceberg, the iceberg itself being a large, pan-European criminal organization involved in everything from drugs and financial crime to corruption, hired killings and not least people trafficking , illegal labor and prostitution.", "rate": 70, "genre": ["Crime"], "cast": ["Lars Mikkelsen", "Jasmin Gerat", "Andreas Pietschmann", "Filip Peeters", "Sunnyi Melles"], "character": ["Harald Bjorn", "Jackie Mueller", "Elias Mueller", "Bruno Kopmann", "Iris Gabler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62183   Expand The Team   (2015) User Score  Play Trailer Overview After a number of murders of prostitutes at a motorway stop near Berlin, in a rear courtyard in Antwerp, and in a brothel in Copenhagen, Europol decides to form a taskforce to tackle the case. Harald, a Dane, Jackie, a German, and Alice from Belgium embark on the hunt for the killer. As the case unfolds, the killings prove to be just the tip of the iceberg, the iceberg itself being a large, pan-European criminal organization involved in everything from drugs and financial crime to corruption, hired killings and not least people trafficking , illegal labor and prostitution. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lars Mikkelsen Harald Bjorn Jasmin Gerat Jackie Mueller Andreas Pietschmann Elias Mueller Filip Peeters Bruno Kopmann Sunnyi Melles Iris Gabler Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of The Team premiered on February 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Team. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  60m Homepage  - Genres Crime Keywords nordic noir Content Score 93 Almost there... Top Contributors S 33 Samara 14 vacdk 10 EveDemocracy G 9 Gonçalo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}