{"link": "https://www.themoviedb.org/tv/62266?language=en", "title": "Kill Me, Heal Me", "resume": "Cha Do Hyun is a rich heir to a family company with one major problem. Due to suppressed childhood trauma, he suffers from dissociative identity disorder manifested in 7 unique personalities who are out of his control. In order to overcome this disorder in secret, he hires a first year medical resident to help him heal by killing off each personality one by one.", "rate": 87, "genre": ["Comedy", "Drama"], "cast": ["Ji Sung", "Hwang Jung-eum", "Park Seo-jun", "Kim Yoo-ri", "Kim Young-ae"], "character": ["Cha Do-hyun", "Oh Ri-jin", "Oh Ri-on", "Han Chae-yeon", "Seo Tae-im"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62266   Expand Kill Me, Heal Me   (2015) User Score Overview Cha Do Hyun is a rich heir to a family company with one major problem. Due to suppressed childhood trauma, he suffers from dissociative identity disorder manifested in 7 unique personalities who are out of his control. In order to overcome this disorder in secret, he hires a first year medical resident to help him heal by killing off each personality one by one. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Sung Cha Do-hyun Hwang Jung-eum Oh Ri-jin Park Seo-jun Oh Ri-on Kim Yoo-ri Han Chae-yeon Kim Young-ae Seo Tae-im Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Kill Me, Heal Me premiered on January  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2013-08-05 Good Doctor 8.6    2014-12-08 Healer 8.7    2014-05-05 Doctor Stranger 7.3    2010-03-31 Personal Taste 7.4    2010-08-30 Sungkyunkwan Scandal 7.7    2013-06-05 I Hear Your Voice 8.2    2013-12-18 My Love From Another Star 8.2    2015-08-05 Yong Pal 7.2  Facts Original Name  킬미, 힐미 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/kmhm/ Genres Comedy Drama Keywords mental illness dissociative identity disorder Content Score 86 Almost there... Top Contributors M 47 Maria180493 8 Elizabeth Jennings 7 RainingBullets z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}