{"link": "https://www.themoviedb.org/tv/76230?language=en", "title": "The Fourth Estate", "resume": "Explore the process and progress of The New York Times and its journalists in covering the Trump administration. Through extraordinary access, on-the-scene filmmaking, and exclusive sit-down interviews, this documentary series illuminates critical issues facing journalism today – including the challenge to the bedrock concept of truth, the changing role of the media, and the Times’ response to President Trump’s war of words.", "rate": 0, "genre": ["Documentary"], "cast": ["Maggie Haberman", "Arthur Gregg Sulzberger", "Elisabeth Bumiller", "Dean Baquet"], "character": ["Herself - Ny Times White House Correspondent", "Himself - NY Times Publisher", "Herself - NY Times Washington Bureau Chief", "Himself - NY Times Executive Editor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76230   Expand The Fourth Estate   (2018) User Score  Play Trailer Overview Explore the process and progress of The New York Times and its journalists in covering the Trump administration. Through extraordinary access, on-the-scene filmmaking, and exclusive sit-down interviews, this documentary series illuminates critical issues facing journalism today – including the challenge to the bedrock concept of truth, the changing role of the media, and the Times’ response to President Trump’s war of words. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maggie Haberman Herself - Ny Times White House Correspondent Arthur Gregg Sulzberger Himself - NY Times Publisher Elisabeth Bumiller Herself - NY Times Washington Bureau Chief Dean Baquet Himself - NY Times Executive Editor Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of The Fourth Estate premiered on May 27, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Fourth Estate. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.sho.com/the-fourth-estate Genres Documentary Keywords journalism freedom of the press new york times Content Score 93 Almost there... Top Contributors 36 Elizabeth Jennings 12 Banana r 7 r.janov 2 Pierreism  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}