{"link": "https://www.themoviedb.org/tv/72734?language=en", "title": "The Indian Detective", "resume": "A Toronto police officer gets involved in a homicide investigation while visiting his father in Mumbai.", "rate": 67, "genre": ["Crime", "Comedy", "Drama"], "cast": ["Russell Peters", "Mishqah Parthiephal", "Christina Cole", "Anupam Kher", "William Shatner"], "character": ["Constable Doug D'Mello", "Priya Sehgal", "Constable Robyn Gerner", "Stanley D'Mello", "David Marlowe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72734   Expand The Indian Detective   (2017) User Score  Play Trailer Overview A Toronto police officer gets involved in a homicide investigation while visiting his father in Mumbai. Featured Crew Frank Spotnitz Creator Smita Bhide Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russell Peters Constable Doug D'Mello Mishqah Parthiephal Priya Sehgal Christina Cole Constable Robyn Gerner Anupam Kher Stanley D'Mello William Shatner David Marlowe Full Cast & Crew Current Season Season 1 2017 | 4 Episodes Season 1 of The Indian Detective premiered on November 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2013-10-08 Russell Peters vs. the World 6.5    2016-05-11 Killer Women with Piers Morgan 7.5    2015-11-06 Master of None 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  40m Homepage   https://www.ctv.ca/The-Indian-Detective Genres Crime Comedy Drama Keywords canada indian lead police detective Content Score 100 Yes! Looking good! Top Contributors 53 Banana t 17 tmdb21435511 t 12 tmdb42368388 S 3 ShareRapid  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}