{"link": "https://www.themoviedb.org/tv/63072?language=en", "title": "Significant Mother", "resume": "Budding Portland restaurateur Nate's world is turned upside-down when he returns home from a business trip to find his lothario best friend and roommate, Jimmy, dating his recently separated mother, Lydia. To make matters worse, Nate's previously disinterested dad, Harrison is now determined to win Lydia back.", "rate": 59, "genre": ["Comedy"], "cast": ["Josh Zuckerman", "Krista Allen", "Erin Cardillo", "Emma Fitzpatrick", "Nathaniel Buzolic"], "character": ["Nate Marlowe", "Lydia Marlowe", "Parker", "Sam Dillinger", "Jimmy Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63072   Expand Significant Mother   (2015) User Score Overview Budding Portland restaurateur Nate's world is turned upside-down when he returns home from a business trip to find his lothario best friend and roommate, Jimmy, dating his recently separated mother, Lydia. To make matters worse, Nate's previously disinterested dad, Harrison is now determined to win Lydia back. Featured Crew Erin Cardillo Creator Richard Keith Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Zuckerman Nate Marlowe Krista Allen Lydia Marlowe Erin Cardillo Parker Emma Fitzpatrick Sam Dillinger Nathaniel Buzolic Jimmy Barnes Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of Significant Mother premiered on August  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-10-22 Ravenswood 4.5    2013-05-01 Family Tools 3.4    2014-10-02 A to Z 5.7    2015-06-16 Clipped 4.1    2012-12-17 1600 Penn 4.4    2015-08-12 Kevin from Work 5.2    2013-09-23 Hostages 6.1    2015-06-23 Another Period 6.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.cwtv.com/shows/significant-mother Genres Comedy Keywords roommate cougar Content Score 93 Almost there... Top Contributors 41 Elizabeth Jennings N 13 NoemiTalavera z 4 zurman1 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}