{"link": "https://www.themoviedb.org/tv/65383?language=en", "title": "Love Live! Sunshine!!", "resume": "Uranohoshi Girls’ High School, a private school in the seaside neighborhood of Uchiura at Numazu city, Shizuoka prefecture. A small high school in a corner of Suruga Bay, it is home to nine teens, led by second-year student Chika Takami, driven by one seriously big dream: To become the next generation of bright, sparkling “school idols”! As long as we don’t give up, any dream can come true... All we have to do now is keep pushing hard for fame and glory! Now their “School Idol Project” begins to make their dreams come true!", "rate": 37, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65383   Expand Love Live! Sunshine!!   (2016) User Score Overview Uranohoshi Girls’ High School, a private school in the seaside neighborhood of Uchiura at Numazu city, Shizuoka prefecture. A small high school in a corner of Suruga Bay, it is home to nine teens, led by second-year student Chika Takami, driven by one seriously big dream: To become the next generation of bright, sparkling “school idols”! As long as we don’t give up, any dream can come true... All we have to do now is keep pushing hard for fame and glory! Now their “School Idol Project” begins to make their dreams come true! Featured Crew Sakurako Kimino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2017 | 13 Episodes Season 2 of Love Live! Sunshine!! premiered on October  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love Live! Sunshine!!. You can help by rating TV shows you've seen. Facts Original Name  ラブライブ！サンシャイン!! Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.lovelive-anime.jp/uranohoshi/ Genres Animation Comedy Keywords music idol slice of life anime Content Score 64 We're so close, yet so far. Top Contributors 39 sp1ti 8 sekaidown04 5 enkpowerranger 4 dgw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}