{"link": "https://www.themoviedb.org/tv/13912?language=en", "title": "The Guns of Will Sonnett", "resume": "The Guns of Will Sonnett is a Western television series set in the 1870s which ran on the ABC television network from 1967 to 1969. The series was the first production collaboration between Aaron Spelling and Danny Thomas, who would later go on to produce one of ABC's most-memorable hits, The Mod Squad. Today, the series is distributed by King World, and, when telecast, is usually seen in tandem with Branded.", "rate": 90, "genre": ["Western"], "cast": ["Dack Rambo", "Walter Brennan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13912   Expand The Guns of Will Sonnett   (1967) User Score Overview The Guns of Will Sonnett is a Western television series set in the 1870s which ran on the ABC television network from 1967 to 1969. The series was the first production collaboration between Aaron Spelling and Danny Thomas, who would later go on to produce one of ABC's most-memorable hits, The Mod Squad. Today, the series is distributed by King World, and, when telecast, is usually seen in tandem with Branded. Featured Crew Aaron Spelling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dack Rambo Walter Brennan Full Cast & Crew Last Season Season 3 1969 | 1 Episode Season 3 of The Guns of Will Sonnett premiered on September 16, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Guns of Will Sonnett. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}