{"link": "https://www.themoviedb.org/tv/2046?language=en", "title": "Alias", "resume": "Sydney Bristow, an agent who has been tricked to believe she is working for the U.S. government, is actually working for a criminal organization named the Alliance of Twelve. Upon learning this, Sydney becomes a double agent for the real CIA.", "rate": 61, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jennifer Garner", "Michael Vartan", "Ron Rifkin", "Carl Lumbly", "Victor Garber"], "character": ["Sydney Bristow", "Michael Vaughn", "Arvin Sloane", "Marcus Dixon", "Jack Bristow"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2046   Expand Alias   (2001) User Score Overview Sydney Bristow, an agent who has been tricked to believe she is working for the U.S. government, is actually working for a criminal organization named the Alliance of Twelve. Upon learning this, Sydney becomes a double agent for the real CIA. Featured Crew J.J. Abrams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  24 Posters  22 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Garner Sydney Bristow Michael Vartan Michael Vaughn Ron Rifkin Arvin Sloane Carl Lumbly Marcus Dixon Victor Garber Jack Bristow Full Cast & Crew Last Season Season 5 2005 | 17 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Alias. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  24 Posters  22 Recommendations   2000-10-03 Dark Angel 7.2    1999-10-05 Angel 7.6    2006-09-25 Heroes 6.9    1995-09-04 Xena: Warrior Princess 6.7    2001-11-06 24 7.6    1997-03-10 Buffy the Vampire Slayer 8.0    2012-05-27 Continuum 7.1    2001-10-16 Smallville 6.9  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 41m Homepage  - Genres Action & Adventure Drama Keywords cia supernatural double agent revenge female spy Content Score 93 Almost there... Top Contributors 11 Travis Bell C 10 Cataloguer 9 Elizabeth Jennings AK 9 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}