{"link": "https://www.themoviedb.org/tv/67856?language=en", "title": "The Man Living In Our House", "resume": "Hong Na-Ri works as a flight attendant. Her mother passed away 3 years ago and she doesn't have any other immediate family members. Hong Na-Ri returns to her hometown to visit her mother's grave during her death anniversary. There, she sees a young man at her mother's grave. The man, Go Nan-Gil, introduces himself as her father. Before Hong Na-Ri's mother died, she married Go Nan-Gil. He now lives at her mother's house and runs the small dumpling restaurant that her mother ran.", "rate": 41, "genre": ["Crime", "Drama"], "cast": ["Soo-Ae", "Kim Young-kwang", "Lee Soo-Hyuk", "Jo Bo-Ah", "Kim Ji-hun"], "character": ["Hong Na-Ri", "Go Nan-Gil", "Kwon Duk-Bong", "Do Yeo-Joo", "Jo Dong-Jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67856   Expand The Man Living In Our House   (2016) User Score Overview Hong Na-Ri works as a flight attendant. Her mother passed away 3 years ago and she doesn't have any other immediate family members. Hong Na-Ri returns to her hometown to visit her mother's grave during her death anniversary. There, she sees a young man at her mother's grave. The man, Go Nan-Gil, introduces himself as her father. Before Hong Na-Ri's mother died, she married Go Nan-Gil. He now lives at her mother's house and runs the small dumpling restaurant that her mother ran. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soo-Ae Hong Na-Ri Kim Young-kwang Go Nan-Gil Lee Soo-Hyuk Kwon Duk-Bong Jo Bo-Ah Do Yeo-Joo Kim Ji-hun Jo Dong-Jin Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of The Man Living In Our House premiered on October 24, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Man Living In Our House. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2017-01-14 Voice 6.9  Facts Original Name  우리집에 사는 남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/usanam/ Genres Crime Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 53 Maria180493 z 10 zurman1 s 5 sheva_vitali V 3 Violsa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}