{"link": "https://www.themoviedb.org/tv/11100?language=en", "title": "Godzilla: The Series", "resume": "Godzilla: The Series is an American animated television series which originally aired on Fox in the United States. The show premiered on September 12, 1998, and is a direct follow-up to the American Godzilla re-imagining.", "rate": 68, "genre": ["Animation", "Action", "Adventure"], "cast": ["Tom Kenny", "Brigitte Bako", "Rino Romano", "Ian Ziering", "Paget Brewster"], "character": ["Nick Tatopoulos", "Audrey Timmonds"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11100   Expand Godzilla: The Series   (1998) User Score  Play Trailer Overview Godzilla: The Series is an American animated television series which originally aired on Fox in the United States. The show premiered on September 12, 1998, and is a direct follow-up to the American Godzilla re-imagining. Featured Crew David Hartman Creator Frank Squillace Creator Sam Liu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Kenny Brigitte Bako Rino Romano Ian Ziering Nick Tatopoulos Paget Brewster Audrey Timmonds Full Cast & Crew Last Season Season 2 1999 | 19 Episodes Season 2 of Godzilla: The Series premiered on September 18, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1997-09-12 Ninja Turtles: The Next Mutation 3.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 4 Sergiojamon A 3 AnthonyAtkins232 TB 2 TMDb Bot 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}