{"link": "https://www.themoviedb.org/tv/62127?language=en", "title": "Marvel's Iron Fist", "resume": "Danny Rand resurfaces 15 years after being presumed dead. Now, with the power of the Iron Fist, he seeks to reclaim his past and fulfill his destiny.", "rate": 61, "genre": ["Action", "Adventure", "Crime", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Finn Jones", "Jessica Henwick", "David Wenham", "Jessica Stroup", "Tom Pelphrey"], "character": ["Danny Rand", "Colleen Wing", "Harold Meachum", "Joy Meachum", "Ward Meachum"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62127   Expand Marvel's Iron Fist   (2017) User Score  Play Trailer Overview Danny Rand resurfaces 15 years after being presumed dead. Now, with the power of the Iron Fist, he seeks to reclaim his past and fulfill his destiny. Featured Crew Scott Buck Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  42 Content Issues  0 Images Backdrops  11 Posters  16 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Finn Jones Danny Rand Jessica Henwick Colleen Wing David Wenham Harold Meachum Jessica Stroup Joy Meachum Tom Pelphrey Ward Meachum Full Cast & Crew Last Season Season 1 2017 | 13 Episodes View All Seasons Social Reviews  2 Discussions  42 a A review by abaddonhades  6.0 Written by  abaddonhades  on March 25, 2017 The show does have some good sides to it. The cast functions well for the most part. Pelphrey and Stroup does a good job of portraying corporate sharks, with some depth. And Wai Ching Ho as per usual displays an impressive ability to communicate quiet menace.  Unfortunately for Finn Jones, his Danny Rand has been given some supremely unconvincing lines to perform. He comes off as more of a pouty and rebellious teen, than a grown man with a serious responsibility. Add to that fact that his martial arts scenes are terrible,and you've got some serious flaws here.  I've not read the comics bu...  read the rest. Read All Reviews Media Most Popular Videos  3 Backdrops  11 Posters  16 Recommendations   2016-09-30 Marvel's Luke Cage 6.9    2017-08-18 Marvel's The Defenders 7.1    2015-11-20 Marvel's Jessica Jones 7.6    2015-04-10 Marvel's Daredevil 7.7    2017-11-17 Marvel's The Punisher 8.0    2017-02-08 Legion 7.6    2016-01-21 DC's Legends of Tomorrow 6.1    2016-07-15 Stranger Things 8.4  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m Homepage   https://www.netflix.com/title/80002612 Genres Action & Adventure Crime Drama Sci-Fi & Fantasy Keywords martial arts superhero based on comic super power marvel cinematic universe Content Score 100 Yes! Looking good! Top Contributors 74 Jessica Drew 63 Elizabeth Jennings 21 Martin 15 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}