{"link": "https://www.themoviedb.org/tv/63485?language=en", "title": "The Time in Between", "resume": "Sira Quiroga is a young Spanish dressmaker engaged to a solid suitor when a suave typewriter salesman upends her life. Spain is being upended by a civil war and the new regime's growing alliances with Nazi Germany. Sira, smart, gutsy and resourceful with a Scarlett O'Hara-like ability to whip up designer duds on a moment's notice, Sira has spunk. Sira gains and loses a small fortune, is dumped by her cad of a lover in Morocco, runs guns to get the cash to start her life anew and becomes couturier to the Nazi wives stationed in Madrid. Urged on by her friend, the real-life British spy Rosalinda Fox, Sira, too, aids the British cause.", "rate": 85, "genre": ["Action", "Adventure", "Drama"], "cast": ["Adriana Ugarte", "Peter Vives", "Hannah New", "Tristán Ulloa", "Elvira Mínguez"], "character": ["Sira Quiroga/Aris Agoriuq", "Marcus Logan", "Rosalinda Fox", "Juan Luis Beigbeder", "Dolores Quiroga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63485   Expand The Time in Between   (2013) User Score  Play Trailer Overview Sira Quiroga is a young Spanish dressmaker engaged to a solid suitor when a suave typewriter salesman upends her life. Spain is being upended by a civil war and the new regime's growing alliances with Nazi Germany. Sira, smart, gutsy and resourceful with a Scarlett O'Hara-like ability to whip up designer duds on a moment's notice, Sira has spunk. Sira gains and loses a small fortune, is dumped by her cad of a lover in Morocco, runs guns to get the cash to start her life anew and becomes couturier to the Nazi wives stationed in Madrid. Urged on by her friend, the real-life British spy Rosalinda Fox, Sira, too, aids the British cause. Featured Crew María Dueñas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adriana Ugarte Sira Quiroga/Aris Agoriuq Peter Vives Marcus Logan Hannah New Rosalinda Fox Tristán Ulloa Juan Luis Beigbeder Elvira Mínguez Dolores Quiroga Full Cast & Crew Last Season Season 1 2013 | 17 Episodes Season 1 of The Time in Between premiered on October 21, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Time in Between. You can help by rating TV shows you've seen. Facts Original Name  El tiempo entre costuras Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  80m Homepage   http://www.atresplayer.com/television/series/el-tiempo-entre-costuras/ Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 26 prm96 20 Elizabeth Jennings CM 8 Cherche Moi 5 ibaca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}