{"link": "https://www.themoviedb.org/tv/65764?language=en", "title": "Absolute Duo", "resume": "This is the story of Tooru Kokonoe who has enrolled at Kouryou Academy, a school which trains students in wielding Blaze, soul powered weapons to prepare them for the Dorn Agency's special peacekeeping corps. When Tooru is partnered with a mysterious girl: Julie Sigtuna, he finds he has to overcome many hurdles to ensure their teamwork and fighting skills are up to par for the duration of their training.", "rate": 76, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65764   Expand Absolute Duo   (2015) User Score Overview This is the story of Tooru Kokonoe who has enrolled at Kouryou Academy, a school which trains students in wielding Blaze, soul powered weapons to prepare them for the Dorn Agency's special peacekeeping corps. When Tooru is partnered with a mysterious girl: Julie Sigtuna, he finds he has to overcome many hurdles to ensure their teamwork and fighting skills are up to par for the duration of their training. Featured Crew Atsushi Nakayama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Absolute Duo premiered on January  3, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Absolute Duo. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2017-04-06 Clockwork Planet 6.1    2011-07-08 No. 6 7.5    2016-01-09 Luck & Logic 7.0    2016-01-08 Divine Gate 5.3    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2016-07-08 Alderamin on the Sky 7.4    2015-10-03 Chivalry of a Failed Knight 7.9    2017-07-12 My First Girlfriend is a Gal 7.4  Facts Original Name  アブソリュート・デュオ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 20 Jenazad 19 kazuza TB 8 TMDb Bot 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}