{"link": "https://www.themoviedb.org/tv/75143?language=en", "title": "Do You Want to See a Dead Body?", "resume": "Follow comedian Rob Huebel as he takes a different celebrity friend on a hilarious adventure to find a dead body...and then maybe get tacos or something.", "rate": 0, "genre": ["Comedy"], "cast": ["Rob Huebel"], "character": ["Rob Huebel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75143   Expand Do You Want to See a Dead Body?   (2017) User Score  Play Trailer Overview Follow comedian Rob Huebel as he takes a different celebrity friend on a hilarious adventure to find a dead body...and then maybe get tacos or something. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Huebel Rob Huebel Full Cast & Crew Current Season Season 1 2017 | 15 Episodes Season 1 of Do You Want to See a Dead Body? premiered on November 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Do You Want to See a Dead Body?. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  15m Homepage   https://www.youtube.com/channel/UCFGGYi2aZoXzdeOeeNAD1sw/ Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 20 joeynotjoe 4 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}