{"link": "https://www.themoviedb.org/tv/41211?language=en", "title": "The Fades", "resume": "Seventeen-year old Paul can see the spirits of the dead. When one of these restless spirits crosses back into the living world, he is forced into a fight to prevent the apocalypse.", "rate": 75, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Iain De Caestecker", "Daniel Kaluuya", "Johnny Harris", "Natalie Dormer", "Tom Ellis"], "character": ["Paul Roberts", "Mac Armstrong", "Neil Valentine", "Sarah Etches", "Mark Etches"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41211   Expand The Fades   (2011) User Score Overview Seventeen-year old Paul can see the spirits of the dead. When one of these restless spirits crosses back into the living world, he is forced into a fight to prevent the apocalypse. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Iain De Caestecker Paul Roberts Daniel Kaluuya Mac Armstrong Johnny Harris Neil Valentine Natalie Dormer Sarah Etches Tom Ellis Mark Etches Full Cast & Crew Last Season Miniseries 2011 | 6 Episodes Season 1 of The Fades premiered on September 21, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations   2015-09-30 You, Me and the Apocalypse 7.2    2012-11-18 The Secret of Crickley Hall 6.9    2008-11-13 Apparitions 7.9    2011-08-29 Death Valley 7.4    2014-01-09 Spies of Warsaw 7.2    2016-01-07 Angel from Hell 6.1    2015-10-25 Jekyll and Hyde 4.6    2014-09-21 The Code 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/fades/ Genres Drama Sci-Fi & Fantasy Keywords psychic power miniseries apocalypse spirit ghost Content Score 86 Almost there... Top Contributors TB 27 TMDb Bot 13 Banana R 9 Rebecca 9 maikamonroe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}