{"link": "https://www.themoviedb.org/tv/75865?language=en", "title": "Teasing Master Takagi-san", "resume": "\"If you blush, you lose.\"\nLiving by this principle, the middle schooler Nishikata gets constantly made fun of by his seat neighbor Takagi-san. With his pride shattered to pieces, he vows to turn the tables and get back at her some day. And so, he attempts to tease her day after day, only to find himself victim to Takagi-san's ridicule again sooner than later. Will he be able to make Takagi-san blush from embarrassment even once in the end?", "rate": 58, "genre": ["Animation", "Comedy"], "cast": ["Rie Takahashi", "Yuuki Kaji"], "character": ["Tagaki-san", "Nishikata"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75865   Expand Teasing Master Takagi-san   (2018) User Score  Play Trailer Overview \"If you blush, you lose.\" Living by this principle, the middle schooler Nishikata gets constantly made fun of by his seat neighbor Takagi-san. With his pride shattered to pieces, he vows to turn the tables and get back at her some day. And so, he attempts to tease her day after day, only to find himself victim to Takagi-san's ridicule again sooner than later. Will he be able to make Takagi-san blush from embarrassment even once in the end? Featured Crew Hiroaki Akagi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Takahashi Tagaki-san Yuuki Kaji Nishikata Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Teasing Master Takagi-san premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2018-01-11 Death March to the Parallel World Rhapsody 8.3    2018-01-06 Citrus 7.2  Facts Original Name  からかい上手の高木さん Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://takagi3.me/ Genres Animation Comedy Keywords romance slice of life based on manga school life Content Score 71 Just a little bit more... Top Contributors 26 sp1ti C 10 Chintaran D 10 Destr0y J 5 JeremyRogers  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}