{"link": "https://www.themoviedb.org/tv/2841?language=en", "title": "The State", "resume": "The State is a half-hour sketch-comedy television show, originally broadcast in the USA on MTV between December 17, 1993, and July 1, 1995. The show combined bizarre characters and scenarios to present sketches that won the favor of its target teenaged audience. The cast consisted of 11 twenty-something comedians who created, acted, wrote, directed and edited the show.\nSeveral memorable characters were created for the show, and for a short time their catchphrases entered into the vernacular. Often, the cast would appear as themselves and address the audience to promote fake contests or to deliver mock public service announcements. Much like Monty Python, The State's sketches were sometimes linked to each other in some way: a punchline or image that ended one sketch often provided a lead-in to the next.\nAfter years of legal issues related to the soundtrack to many of the episodes, the series was released on DVD on July 14, 2009. A State film featuring all of the original troupe members is in the works, but was delayed by the 2007-2008 screenwriters strike, and no release date for the project has been announced.", "rate": 60, "genre": ["Comedy"], "cast": ["David Wain", "Michael Showalter", "Ken Marino", "Joe Lo Truglio", "Kerri Kenney-Silver"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2841   Expand The State   (1993) User Score Overview The State is a half-hour sketch-comedy television show, originally broadcast in the USA on MTV between December 17, 1993, and July 1, 1995. The show combined bizarre characters and scenarios to present sketches that won the favor of its target teenaged audience. The cast consisted of 11 twenty-something comedians who created, acted, wrote, directed and edited the show. Several memorable characters were created for the show, and for a short time their catchphrases entered into the vernacular. Often, the cast would appear as themselves and address the audience to promote fake contests or to deliver mock public service announcements. Much like Monty Python, The State's sketches were sometimes linked to each other in some way: a punchline or image that ended one sketch often provided a lead-in to the next. After years of legal issues related to the soundtrack to many of the episodes, the series was released on DVD on July 14, 2009. A State film featuring all of the original troupe members is in the works, but was delayed by the 2007-2008 screenwriters strike, and no release date for the project has been announced. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Wain Michael Showalter Ken Marino Joe Lo Truglio Kerri Kenney-Silver Full Cast & Crew Last Season Season 3 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2001-04-04 That's My Bush! 6.9    2005-07-20 Criss Angel Mindfreak 4.2    2004-11-14 Tom Goes to the Mayor 7.2    2013-07-09 Drunk History 7.2    1988-09-23 Whose Line Is It Anyway? 7.8    2004-03-04 Pimp My Ride 5.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  21m, 30m Homepage   http://www.mtv.com/shows/the_state/series.jhtml Genres Comedy Keywords sketch comedy skit Content Score 86 Almost there... Top Contributors 5 Banana 4 Elizabeth Jennings 1 AbdulwahabAA 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}