{"link": "https://www.themoviedb.org/tv/2190?language=en", "title": "South Park", "resume": "Follows the misadventures of four irreverent grade-schoolers in the quiet, dysfunctional town of South Park, Colorado.", "rate": 78, "genre": ["Comedy", "Animation"], "cast": ["Trey Parker", "Matt Stone", "April Stewart", "Mona Marshall"], "character": ["Eric Cartman / Stan Marsh (voice)", "Kyle Broflovski / Kenny McCormick (voice)", "Sharon Marsh (voice)", "Sheila Broflovski (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2190   Expand South Park   (1997) User Score Overview Follows the misadventures of four irreverent grade-schoolers in the quiet, dysfunctional town of South Park, Colorado. Featured Crew Trey Parker Creator Matt Stone Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  8 Images Backdrops  15 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Trey Parker Eric Cartman / Stan Marsh (voice) Matt Stone Kyle Broflovski / Kenny McCormick (voice) April Stewart Sharon Marsh (voice) Mona Marshall Sheila Broflovski (voice) Full Cast & Crew Last Season Season 21 2017 | 10 Episodes Season 21 of South Park premiered on September 13, 2017. View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply Butters Open 1 by  Satch the Man a Not funny anymore. Open 5 by  The Midi-chlorian Count a Halloween episode Open 2 by  Moonglum9 Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  10 Recommendations   1999-03-28 Futurama 8.2    1999-01-31 Family Guy 6.5    1989-12-17 The Simpsons 7.1    2001-10-02 Scrubs 7.7    2005-02-06 American Dad! 6.2    2000-01-09 Malcolm in the Middle 7.5    1989-07-05 Seinfeld 8.2    2005-03-24 The Office 8.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://southpark.cc.com/ Genres Comedy Animation Keywords sex adult humor colorado satire parody elementary school child swearing social satire best friend group of friends adult animation censorship Content Score 100 Yes! Looking good! Top Contributors 74 BudsieBuds 70 CouchTater 51 niqo19 49 Goffred0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}