{"link": "https://www.themoviedb.org/tv/45856?language=en", "title": "Polar Bear Cafe", "resume": "Pushed by his mother to stop lazing around the house, a Panda searches for a part-time job but has troubling finding one to accommodate his laziness. He soon stumbles upon the Shirokuma Cafe, run by a Polar Bear who is holding interviews for a part-time position with his faithful customer Penguin. Panda applies for the job but fails the interview, with the job instead going to a human girl named Sasako. However, the others soon point Panda towards a part-time job at a nearby zoo.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Jun Fukuyama", "Takahiro Sakurai", "Hiroshi Kamiya", "Yuichi Nakamura", "Daisuke Ono"], "character": ["Panda", "Polar Bear", "Penguin", "Grizzly", "Llama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45856   Expand Polar Bear Cafe   (2012) User Score Overview Pushed by his mother to stop lazing around the house, a Panda searches for a part-time job but has troubling finding one to accommodate his laziness. He soon stumbles upon the Shirokuma Cafe, run by a Polar Bear who is holding interviews for a part-time position with his faithful customer Penguin. Panda applies for the job but fails the interview, with the job instead going to a human girl named Sasako. However, the others soon point Panda towards a part-time job at a nearby zoo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Panda Takahiro Sakurai Polar Bear Hiroshi Kamiya Penguin Yuichi Nakamura Grizzly Daisuke Ono Llama Full Cast & Crew Last Season Season 1 2012 | 82 Episodes Season 1 of Polar Bear Cafe premiered on April  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Polar Bear Cafe. You can help by rating TV shows you've seen. Facts Original Name  しろくまカフェ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords based on manga anime flowers monthly Content Score 86 Almost there... Top Contributors 7 sp1ti n 6 naka 5 Banana 4 majordrake  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}