{"link": "https://www.themoviedb.org/tv/71973?language=en", "title": "Daytime Divas", "resume": "Every weekday at noon, Maxine, Mo, Heather, Kibby, and Nina—hosts of The Lunch Hour, the long-running women’s talk show—gather around the table to discuss life, love, politics, and juicy gossip. But behind the scenes, it’s even juicier — a backstage world filled with power struggles, diva fits, and steamy affairs. Inspired by the book “Satan’s Sisters” by Star Jones, television personality, lawyer and journalist.", "rate": 50, "genre": ["Soap", "Comedy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71973   Expand Daytime Divas   (2017) User Score  Play Trailer Overview Every weekday at noon, Maxine, Mo, Heather, Kibby, and Nina—hosts of The Lunch Hour, the long-running women’s talk show—gather around the table to discuss life, love, politics, and juicy gossip. But behind the scenes, it’s even juicier — a backstage world filled with power struggles, diva fits, and steamy affairs. Inspired by the book “Satan’s Sisters” by Star Jones, television personality, lawyer and journalist. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Daytime Divas premiered on June  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Daytime Divas. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  60m Homepage   http://www.vh1.com/shows/daytime-divas Genres Soap Comedy Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings D 5 Derek.Jo.Lee88 - 5 -Alexander- 4 Sall  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}