{"link": "https://www.themoviedb.org/tv/4343?language=en", "title": "Solitary", "resume": "Solitary is a reality show on the Fox Reality Channel whose contestants were kept in round-the-clock solitary confinement for a number of weeks with the goal of being the last contestant remaining in solitary, for a $50,000 prize. It was the channel's first original series commission with its debut on May 29, 2006. Solitary 4.0 premiered on January 30, 2010 and ended on March 20, 2010. Due to the demise of Fox Reality, fans of the show are currently attempting to petition other networks to take up the show for further seasons. A German version is broadcast on German TV channel ProSieben. Solitary 3.0 also broadcast in Singapore, showing every Friday during midnight to 1 A.M. The first episode of the third season was broadcast on 4 March and the last two episodes were broadcast on 8 April, which was a two-episode back-to-back cast from midnight to 2 A.M.", "rate": 90, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4343   Expand Solitary   (2006) User Score Overview Solitary is a reality show on the Fox Reality Channel whose contestants were kept in round-the-clock solitary confinement for a number of weeks with the goal of being the last contestant remaining in solitary, for a $50,000 prize. It was the channel's first original series commission with its debut on May 29, 2006. Solitary 4.0 premiered on January 30, 2010 and ended on March 20, 2010. Due to the demise of Fox Reality, fans of the show are currently attempting to petition other networks to take up the show for further seasons. A German version is broadcast on German TV channel ProSieben. Solitary 3.0 also broadcast in Singapore, showing every Friday during midnight to 1 A.M. The first episode of the third season was broadcast on 4 March and the last two episodes were broadcast on 8 April, which was a two-episode back-to-back cast from midnight to 2 A.M. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2010 | 8 Episodes Season 4 of Solitary premiered on January 30, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Solitary. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.foxreality.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 2 biosystemics  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}