{"link": "https://www.themoviedb.org/tv/60708?language=en", "title": "Gotham", "resume": "Before there was Batman, there was GOTHAM. \nEveryone knows the name Commissioner Gordon. He is one of the crime world's greatest foes, a man whose reputation is synonymous with law and order. But what is known of Gordon's story and his rise from rookie detective to Police Commissioner? What did it take to navigate the multiple layers of corruption that secretly ruled Gotham City, the spawning ground of the world's most iconic villains? And what circumstances created them – the larger-than-life personas who would become Catwoman, The Penguin, The Riddler, Two-Face and The Joker?", "rate": 69, "genre": ["Drama", "Fantasy", "Crime"], "cast": ["Ben McKenzie", "Donal Logue", "David Mazouz", "Sean Pertwee", "Robin Lord Taylor"], "character": ["James Gordon", "Harvey Bullock", "Bruce Wayne / 514A", "Alfred Pennyworth", "Oswald Cobblepot / Penguin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60708   Expand Gotham   (2014) User Score  Play Trailer Overview Before there was Batman, there was GOTHAM.  Everyone knows the name Commissioner Gordon. He is one of the crime world's greatest foes, a man whose reputation is synonymous with law and order. But what is known of Gordon's story and his rise from rookie detective to Police Commissioner? What did it take to navigate the multiple layers of corruption that secretly ruled Gotham City, the spawning ground of the world's most iconic villains? And what circumstances created them – the larger-than-life personas who would become Catwoman, The Penguin, The Riddler, Two-Face and The Joker?  Featured Crew Bruno Heller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  35 Content Issues  3 Images Backdrops  19 Posters  40 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben McKenzie James Gordon Donal Logue Harvey Bullock David Mazouz Bruce Wayne / 514A Sean Pertwee Alfred Pennyworth Robin Lord Taylor Oswald Cobblepot / Penguin Full Cast & Crew Last Season Season 4 2017 | 22 Episodes View All Seasons Social Reviews  0 Discussions  38 Subject Status Replies Last Reply Gordan sometimes tough, other times Open 1 by  mechajutaro Sophia Open 3 by  A-Dubya Keeps getting better... Open 1 by  Taylorfirst1 Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  40 Recommendations   2015-04-10 Marvel's Daredevil 7.7    2015-11-20 Marvel's Jessica Jones 7.6    2013-09-24 Marvel's Agents of S.H.I.E.L.D. 6.7    2015-01-06 Marvel's Agent Carter 7.5    2016-01-21 DC's Legends of Tomorrow 6.1    2012-10-10 Arrow 6.0    2015-10-26 Supergirl 5.7    2013-09-16 Sleepy Hollow 6.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://www.fox.com/gotham/ Genres Drama Fantasy Crime Keywords gotham city dc comics insane asylum based on comic crime super power super villain Content Score 100 Yes! Looking good! Top Contributors 97 Elizabeth Jennings 64 Travis Bell 45 niqo19 R 31 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}