{"link": "https://www.themoviedb.org/tv/63?language=en", "title": "Brass Eye", "resume": "Brass Eye is a UK television series of satirical news magazines. A series of six episodes aired on Channel 4 in 1997, and a further episode in 2001.\nThe series was created by Chris Morris, and written by Morris, David Quantick, Peter Baynham, Jane Bussmann, Arthur Mathews and Graham Linehan. The series was directed by Michael Cumming. It was a sequel to Morris's earlier spoof news programmes On the Hour and The Day Today. It satirised media portrayal of social ills, in particular sensationalism and creation of moral panics. The series starred Morris's The Day Today colleague Doon MacKichan and Gina McKee, Mark Heap, Simon Pegg, Julia Davis and Kevin Eldon.", "rate": 80, "genre": ["Comedy"], "cast": ["Christopher Morris", "Hugh Dennis", "Alexander Armstrong"], "character": ["Christopher Morris", "Dr. Balb Kubrox", "American Vox Pop"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63   Expand Brass Eye   (1997) User Score Overview Brass Eye is a UK television series of satirical news magazines. A series of six episodes aired on Channel 4 in 1997, and a further episode in 2001. The series was created by Chris Morris, and written by Morris, David Quantick, Peter Baynham, Jane Bussmann, Arthur Mathews and Graham Linehan. The series was directed by Michael Cumming. It was a sequel to Morris's earlier spoof news programmes On the Hour and The Day Today. It satirised media portrayal of social ills, in particular sensationalism and creation of moral panics. The series starred Morris's The Day Today colleague Doon MacKichan and Gina McKee, Mark Heap, Simon Pegg, Julia Davis and Kevin Eldon. Featured Crew Christopher Morris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Morris Christopher Morris Hugh Dennis Dr. Balb Kubrox Alexander Armstrong American Vox Pop Full Cast & Crew Last Season Season 1 1997 | 7 Episodes Season 1 of Brass Eye premiered on January 29, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1994-01-19 The Day Today 8.3    2005-02-11 Nathan Barley 7.9    2002-11-07 15 Storeys High 8.0    1997-11-03 I'm Alan Partridge 6.9    2009-02-25 Burnistoun 7.8    2006-08-03 Time Trumpet 7.3    1999-01-11 The League of Gentlemen 7.4    2010-11-01 The Trip 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords dark comedy surreal satire political humour british humour Content Score 64 We're so close, yet so far. Top Contributors O 7 Ozbourne 2 kcdh c 1 cburton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}