{"link": "https://www.themoviedb.org/tv/61209?language=en", "title": "The Night Watchman", "resume": "Being able to see ghosts and other supernatural spirits is a heavy responsibility. Prince Lee Rin (Jung Il Woo), like his father before him, discovers that he has the ability to see ghosts and other supernatural beings. Armed with his newfound abilities, Lee Rin becomes the leader of a group of night watchmen who patrol the streets from dusk to dawn to protect the people of the Chosun Dynasty against evil spirits. Moo Seok (Jung Yun Ho) is the best swordsman in the land who is the prince’s trusty bodyguard. But their loyalties will be tested when they both fall in love with the same woman – Do Ha (Go Sung Hee), the successor of the Ma Go tribe who seeks their help to protect the Baek Do mountain’s spirits. But Park Soo Ryun (Seo Ye Ji), the daughter of a court officer, will stop at nothing to marry Prince Lee Rin. “The Night Watchman,” also known as \"Diary of a Night Watchman,\"", "rate": 50, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Jung Il-woo", "Ko Sung-hee", "U-Know Yunho", "Seo Ye-ji", "Kim Seong-oh"], "character": ["Lee Rin", "Do-ha", "Moo-seok", "Park Soo-ryeon", "Sadam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61209   Expand The Night Watchman   (2014) User Score  Play Trailer Overview Being able to see ghosts and other supernatural spirits is a heavy responsibility. Prince Lee Rin (Jung Il Woo), like his father before him, discovers that he has the ability to see ghosts and other supernatural beings. Armed with his newfound abilities, Lee Rin becomes the leader of a group of night watchmen who patrol the streets from dusk to dawn to protect the people of the Chosun Dynasty against evil spirits. Moo Seok (Jung Yun Ho) is the best swordsman in the land who is the prince’s trusty bodyguard. But their loyalties will be tested when they both fall in love with the same woman – Do Ha (Go Sung Hee), the successor of the Ma Go tribe who seeks their help to protect the Baek Do mountain’s spirits. But Park Soo Ryun (Seo Ye Ji), the daughter of a court officer, will stop at nothing to marry Prince Lee Rin. “The Night Watchman,” also known as \"Diary of a Night Watchman,\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Il-woo Lee Rin Ko Sung-hee Do-ha U-Know Yunho Moo-seok Seo Ye-ji Park Soo-ryeon Kim Seong-oh Sadam Full Cast & Crew Last Season Season 1 2014 | 24 Episodes Season 1 of The Night Watchman premiered on August  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Night Watchman. You can help by rating TV shows you've seen. Facts Original Name  야경꾼일지 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/night/ Genres Action & Adventure Sci-Fi & Fantasy Keywords korea historical fiction Content Score 93 Almost there... Top Contributors M 52 Maria180493 CM 9 Cherche Moi t 5 tmdb38202327 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}