{"link": "https://www.themoviedb.org/tv/68681?language=en", "title": "Black Widows", "resume": "Three women are gathered at a cabin with their three colleague husbands when they watch the men blow up in the boat just going out fishing. A police man investigates the widows, who will have to try to explain what happened.", "rate": 55, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Cecilia Forss", "Beate Bille", "Synnøve Macody Lund"], "character": ["Rebeka Axelsson", "Kira Just Bergman", "Johanne Rønningen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68681   Expand Black Widows   (2016) User Score  Play Trailer Overview Three women are gathered at a cabin with their three colleague husbands when they watch the men blow up in the boat just going out fishing. A police man investigates the widows, who will have to try to explain what happened. Featured Crew Mikko Pöllä Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cecilia Forss Rebeka Axelsson Beate Bille Kira Just Bergman Synnøve Macody Lund Johanne Rønningen Full Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Black Widows premiered on April 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Black Widows. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Swedish Runtime  42m Homepage   https://viaplay.se/serier/black-widows Genres Crime Drama Mystery Keywords remake swedish Content Score 71 Just a little bit more... Top Contributors 30 necuucj 28 Bendik VA 7 Viktor Andersson M 3 Mr_Democracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}