{"link": "https://www.themoviedb.org/tv/31679?language=en", "title": "Last Exile", "resume": "A richly romantic action-adventure fantasy, set in a world where retro-futuristic vehicles permeate the skies. Against this lavish background are the lives of young and heroic van ship sky porters - Claus and Lavie - who are forced to take on the mission to deliver a mysterious girl, Alvis, to the battle ship Silvana. Before they know it, they become entangled in an aerial adventure between two countries gripped in an eternal war of magnificent air battleships.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Bob Papenbrook", "Crispin Freeman", "Joshua Seth", "Johnny Yong Bosch", "Kari Wahlgren"], "character": ["Alex Row"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31679   Expand Last Exile   (2003) User Score Overview A richly romantic action-adventure fantasy, set in a world where retro-futuristic vehicles permeate the skies. Against this lavish background are the lives of young and heroic van ship sky porters - Claus and Lavie - who are forced to take on the mission to deliver a mysterious girl, Alvis, to the battle ship Silvana. Before they know it, they become entangled in an aerial adventure between two countries gripped in an eternal war of magnificent air battleships. Featured Crew Daisuke Chiba Creator Asumi Matsumura Creator Kôichi Chigira Creator KristieAnne Reed Creator Eric P. Sherman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Papenbrook Crispin Freeman Alex Row Joshua Seth Johnny Yong Bosch Kari Wahlgren Full Cast & Crew Last Season Season 2 2011 | 21 Episodes Season 2 of Last Exile premiered on October 15, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2004-06-12 Samurai 7 6.6    2003-10-06 Gungrave 7.8    2005-10-23 Mushi-Shi 7.8    2002-10-01 Ghost in the Shell: Stand Alone Complex 8.0    1998-04-02 TRIGUN 7.7    2006-09-20 Jericho 7.5    2004-04-24 Wolf's Rain 6.6    1995-10-04 Neon Genesis Evangelion 8.0  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords airplane airship anime retrofuturism Content Score 93 Almost there... Top Contributors W 37 Wingman 14 Ailurus Fulgens 7 Sergiojamon c 4 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}