{"link": "https://www.themoviedb.org/tv/66561?language=en", "title": "Legend of Nine Tails Fox", "resume": "Legend of Nine Tails Fox consists of 6 supernatural  stories and folktales about fox spirits and ghosts taken from Strange  Tales from Liao Zhai written by Pu Song Ling.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Jiang Jinfu", "Guli Nazha", "Gina Jin", "Zhang Ruoyun", "Nick Wang"], "character": ["Liu Chang Yan", "Tao Heng", "Weng Chang Ting", "Liu Zi Gu", "Si Tai Pu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66561   Expand Legend of Nine Tails Fox   (2016) User Score Overview Legend of Nine Tails Fox consists of 6 supernatural  stories and folktales about fox spirits and ghosts taken from Strange  Tales from Liao Zhai written by Pu Song Ling. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jiang Jinfu Liu Chang Yan Guli Nazha Tao Heng Gina Jin Weng Chang Ting Zhang Ruoyun Liu Zi Gu Nick Wang Si Tai Pu Full Cast & Crew Last Season Season 1 2016 | 32 Episodes Season 1 of Legend of Nine Tails Fox premiered on February  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Legend of Nine Tails Fox. You can help by rating TV shows you've seen. Facts Original Name  青丘狐传说 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords fantasy romance nine tailed fox wuxia Content Score 86 Almost there... Top Contributors M 36 Maria180493 i 5 idlikewlm s 3 sheva_vitali k 3 khyungil  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}