{"link": "https://www.themoviedb.org/tv/11398?language=en", "title": "Search", "resume": "Search is an American science fiction series that aired on Wednesday nights on NBC at 10 pm ET, from September 1972 to August 1973. It ran for 23 episodes, not including the two-hour pilot film originally titled Probe. When picked up for series production, the title had to be changed because Probe was the name of an existing PBS series. In the UK the series aired on BBC 1 under the title Search Control.\nThe show was created by Leslie Stevens, and produced by Leslie Stevens, Robert Justman, John Strong and Tony Spinner. The high concept was described as \"science fiction in today's world\" and the episodes featured many high-tech elements which are considered common in current science fiction shows.", "rate": 89, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Anthony Franciosa", "Burgess Meredith", "Doug McClure", "Hugh O'Brian", "Byron Chung"], "character": ["Nick Bianco", "V.C.R. Cameron", "C.R. Grover", "Hugh Lockwood", "Kuroda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11398   Expand Search   (1972) User Score Overview Search is an American science fiction series that aired on Wednesday nights on NBC at 10 pm ET, from September 1972 to August 1973. It ran for 23 episodes, not including the two-hour pilot film originally titled Probe. When picked up for series production, the title had to be changed because Probe was the name of an existing PBS series. In the UK the series aired on BBC 1 under the title Search Control. The show was created by Leslie Stevens, and produced by Leslie Stevens, Robert Justman, John Strong and Tony Spinner. The high concept was described as \"science fiction in today's world\" and the episodes featured many high-tech elements which are considered common in current science fiction shows. Featured Crew Leslie Stevens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Anthony Franciosa Nick Bianco Burgess Meredith V.C.R. Cameron Doug McClure C.R. Grover Hugh O'Brian Hugh Lockwood Byron Chung Kuroda Full Cast & Crew Last Season Season 1 1972 | 23 Episodes Season 1 of Search premiered on September 13, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   1984-09-19 Highway to Heaven 6.1    1974-03-27 The Rockford Files 7.2    1965-09-15 Lost in Space 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords spy private investigator Content Score 100 Yes! Looking good! Top Contributors 15 Banana 4 Steve TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}