{"link": "https://www.themoviedb.org/tv/69295?language=en", "title": "Masamune-kun's Revenge", "resume": "As a child, Masamune Makabe once suffered greatly at the hands of a wealthy and beautiful girl named Aki Adagaki, who nicknamed him \"Piggy\" due to his chubby appearance. Seeking revenge against his tormentor, Masamune works hard to improve himself and returns as an incredibly handsome, albeit narcissistic, high school student. When he encounters Aki once again, he is prepared to exact vengeance.\nWith the aid of the rich girl's maid, Yoshino Koiwai, Masamune slowly begins to build his relationship with Aki, intending to break her heart when the time is right. However, as his friendship with Aki begins to grow, Masamune starts to question the objectives of his devious plans, and if bringing them to fruition is what his heart truly desires.", "rate": 67, "genre": ["Animation", "Comedy"], "cast": ["Natsuki Hanae", "Ayaka Ohashi", "Inori Minase", "Suzuko Mimori", "Saori Hayami"], "character": ["Masamune Makabe", "Aki Adagaki", "Yoshino Koiwai", "Neko Fujinomiya", "Kojuro Shuri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69295   Expand Masamune-kun's Revenge   (2017) User Score Overview As a child, Masamune Makabe once suffered greatly at the hands of a wealthy and beautiful girl named Aki Adagaki, who nicknamed him \"Piggy\" due to his chubby appearance. Seeking revenge against his tormentor, Masamune works hard to improve himself and returns as an incredibly handsome, albeit narcissistic, high school student. When he encounters Aki once again, he is prepared to exact vengeance. With the aid of the rich girl's maid, Yoshino Koiwai, Masamune slowly begins to build his relationship with Aki, intending to break her heart when the time is right. However, as his friendship with Aki begins to grow, Masamune starts to question the objectives of his devious plans, and if bringing them to fruition is what his heart truly desires. Featured Crew Mirai Minato Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natsuki Hanae Masamune Makabe Ayaka Ohashi Aki Adagaki Inori Minase Yoshino Koiwai Suzuko Mimori Neko Fujinomiya Saori Hayami Kojuro Shuri Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Masamune-kun's Revenge premiered on January  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2017-07-04 Tsuredure Children 8.0    2017-01-06 Fuuka 7.3    2014-09-26 Terra Formars 5.4    2014-10-05 Wolf Girl & Black Prince 7.0    2012-10-07 Say \"I love you.\" 7.6    2017-07-03 Restaurant to Another World 8.8    2017-07-12 My First Girlfriend is a Gal 7.4    2016-07-08 Handa-kun 6.7  Facts Original Name  政宗くんのリベンジ Status  Returning Series Networks BS Fuji Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.masamune-tv.com/ Genres Animation Comedy Keywords harem romance school shounen anime Content Score 93 Almost there... Top Contributors z 20 zurman1 17 sp1ti C 15 Chintaran P 13 PeaceMirai  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}