{"link": "https://www.themoviedb.org/tv/2027?language=en", "title": "Mysterious Ways", "resume": "Declan Dunn has a fascination with mystical phenomena that began when he was buried under an avalanche and given up for dead. After he miraculously survived, he committed his life to investigating miracles and the absolute proof of their existence. Now a professor of Anthropology at a leading Oregon university, Declan has the training, support staff and the opportunity to study the uncanny, inexplicable phenomena people call \"miracles\". With the help of Peggy, a skeptical psychiatrist, and Miranda, a research student, the three embark on a quest to explain what science cannot.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Alisen Down", "Adrian Pasdar", "Rae Dawn Chong"], "character": ["Dr. Peggy Fowler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2027   Expand Mysterious Ways   (2000) User Score Overview Declan Dunn has a fascination with mystical phenomena that began when he was buried under an avalanche and given up for dead. After he miraculously survived, he committed his life to investigating miracles and the absolute proof of their existence. Now a professor of Anthropology at a leading Oregon university, Declan has the training, support staff and the opportunity to study the uncanny, inexplicable phenomena people call \"miracles\". With the help of Peggy, a skeptical psychiatrist, and Miranda, a research student, the three embark on a quest to explain what science cannot. Featured Crew Peter O'Fallon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alisen Down Adrian Pasdar Rae Dawn Chong Dr. Peggy Fowler Full Cast & Crew Last Season Season 2 2001 | 22 Episodes Season 2 of Mysterious Ways premiered on July 13, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1997-04-18 Lexx 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords miracle religion scientist science vs religion college professor Content Score 64 We're so close, yet so far. Top Contributors 17 Banana d 7 denis w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}