{"link": "https://www.themoviedb.org/tv/30180?language=en", "title": "DearS", "resume": "One year ago, a UFO containing 150 aliens crash-landed off the shores of Kasai. Because no one could fix their ship, the Japanese Government decided to bestow upon them the designation \"DearS\" and make them into Japanese citizens, teaching them the language, customs, and culture of Japan. However, in order for them to become more familiar with human society, a home-stay program has been enacted to allow them to mingle with other humans.  One misty morning, a truck carrying a capsule that housed one of these aliens ends up dropping it into the riverbank, releasing her from her confinement. She is eventually found by a high school student named Takeya Ikuhara, who saves her from being hit by a truck and takes pity on her, despite being extremely distrustful of their race and wanting nothing to do with them. Upon being named Ren, she imprints upon him as her \"Master\" and serves as his personal \"Slave,\" leaving him with a \"DearS\" who wants to remain with him no matter what and bringing his ordinary, alien-free days to an end.", "rate": 63, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Megumi Toyoguchi", "Kikuko Inoue", "Kappei Yamaguchi", "Miyuki Sawashiro", "Kishou Taniyama"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30180   Expand DearS   (2004) User Score Overview One year ago, a UFO containing 150 aliens crash-landed off the shores of Kasai. Because no one could fix their ship, the Japanese Government decided to bestow upon them the designation \"DearS\" and make them into Japanese citizens, teaching them the language, customs, and culture of Japan. However, in order for them to become more familiar with human society, a home-stay program has been enacted to allow them to mingle with other humans.  One misty morning, a truck carrying a capsule that housed one of these aliens ends up dropping it into the riverbank, releasing her from her confinement. She is eventually found by a high school student named Takeya Ikuhara, who saves her from being hit by a truck and takes pity on her, despite being extremely distrustful of their race and wanting nothing to do with them. Upon being named Ren, she imprints upon him as her \"Master\" and serves as his personal \"Slave,\" leaving him with a \"DearS\" who wants to remain with him no matter what and bringing his ordinary, alien-free days to an end. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Toyoguchi Kikuko Inoue Kappei Yamaguchi Miyuki Sawashiro Kishou Taniyama Full Cast & Crew Last Season Season 1 2004 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2013-07-04 Danganronpa: The Animation 7.0    Digimon Frontier 6.3    Digimon Adventure 02 5.6    2006-09-08 Black Blood Brothers 7.4    2014-04-05 Dragonar Academy 7.0    2002-03-01 Digimon Tamers 5.9    2017-07-09 A Centaur's Life 8.7    2011-10-08 Ben-To 7.2  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Comedy Drama Keywords nudity alien love Content Score 86 Almost there... Top Contributors p 19 psy4trik 9 minusha97 B 7 Burnd33 x 5 xoINARIox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}