{"link": "https://www.themoviedb.org/tv/7422?language=en", "title": "Bonekickers", "resume": "Bonekickers was a BBC drama about a team of archaeologists, set at the fictional Wessex University. It made its début on 8 July 2008 and ran for one series.\nIt was written by Life on Mars and Ashes to Ashes creators Matthew Graham and Ashley Pharoah. It was produced by Michele Buck and Damien Timmer of Mammoth Screen Ltd and co-produced with Monastic Productions. Archaeologist and Bristol University academic Mark Horton acted as the series' archaeological consultant. Adrian Lester has described the programme as \"CSI meets Indiana Jones [...] There's an element of the crime procedural show, there's science, conspiracy theories – and there's a big underlying mystery that goes through the whole six-episode series.\"\nMuch of the series was filmed in the City of Bath, Somerset, with locations including the University of Bath campus. Additional locations included Brean Down Fort and Kings Weston House, Chavenage House for episodes 5 & 6 and Sheldon Manor.\nOn 21 November 2008 Broadcast magazine revealed the show would not be returning for a second series.", "rate": 38, "genre": ["Drama"], "cast": ["Hugh Bonneville", "Adrian Lester", "Michael Maloney", "Gugu Mbatha-Raw", "Julie Graham"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7422   Expand Bonekickers   (2008) User Score  Play Trailer Overview Bonekickers was a BBC drama about a team of archaeologists, set at the fictional Wessex University. It made its début on 8 July 2008 and ran for one series. It was written by Life on Mars and Ashes to Ashes creators Matthew Graham and Ashley Pharoah. It was produced by Michele Buck and Damien Timmer of Mammoth Screen Ltd and co-produced with Monastic Productions. Archaeologist and Bristol University academic Mark Horton acted as the series' archaeological consultant. Adrian Lester has described the programme as \"CSI meets Indiana Jones [...] There's an element of the crime procedural show, there's science, conspiracy theories – and there's a big underlying mystery that goes through the whole six-episode series.\" Much of the series was filmed in the City of Bath, Somerset, with locations including the University of Bath campus. Additional locations included Brean Down Fort and Kings Weston House, Chavenage House for episodes 5 & 6 and Sheldon Manor. On 21 November 2008 Broadcast magazine revealed the show would not be returning for a second series. Featured Crew Ashley Pharoah Creator Matthew Graham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Bonneville Adrian Lester Michael Maloney Gugu Mbatha-Raw Julie Graham Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of Bonekickers premiered on July  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1997-05-09 Jonathan Creek 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/bonekickers/ Genres Drama Keywords england archaeologist relic Content Score 100 Yes! Looking good! Top Contributors 11 Banana z 10 zurman1 w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}