{"link": "https://www.themoviedb.org/tv/3254?language=en", "title": "Watch Over Me", "resume": "Watch Over Me is an American Television series that debuted on December 6, 2006 on the television network MyNetworkTV. Twentieth Television produced 66 episodes to air weekdays. The limited-run serial is an adaptation of Argentine series Resistiré.\nTorres, a former Miss Universe, played a woman torn between her bioterrorist fiance and her bodyguard, played by Todd Cahoon. Catherine Oxenberg and Casper Van Dien also appeared as villains. 20th Century Fox Home Entertainment has not announced plans to release this series on DVD and/or Blu-ray.\nTelefe, which produced the original version, syndicates a 64-episode run of the series in Europe, the Middle East and Asia. It promotes the show as mixing a classic Latin genre with Hollywood aesthetics. From July 2009 it was aired in Slovakia on TV Markíza taking the slot of Latin American telenovelas, but the show was not very successful.", "rate": 0, "genre": [], "cast": ["Catalina Rodriguez", "Dan Wells", "Alexandra Wescourt", "Catherine Oxenberg", "Lisa Ann Walter"], "character": ["Mabel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3254   Expand Watch Over Me   (2006) User Score Overview Watch Over Me is an American Television series that debuted on December 6, 2006 on the television network MyNetworkTV. Twentieth Television produced 66 episodes to air weekdays. The limited-run serial is an adaptation of Argentine series Resistiré. Torres, a former Miss Universe, played a woman torn between her bioterrorist fiance and her bodyguard, played by Todd Cahoon. Catherine Oxenberg and Casper Van Dien also appeared as villains. 20th Century Fox Home Entertainment has not announced plans to release this series on DVD and/or Blu-ray. Telefe, which produced the original version, syndicates a 64-episode run of the series in Europe, the Middle East and Asia. It promotes the show as mixing a classic Latin genre with Hollywood aesthetics. From July 2009 it was aired in Slovakia on TV Markíza taking the slot of Latin American telenovelas, but the show was not very successful. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catalina Rodriguez Dan Wells Alexandra Wescourt Catherine Oxenberg Lisa Ann Walter Mabel Full Cast & Crew Last Season Season 1 2006 | 63 Episodes Season 1 of Watch Over Me premiered on December  6, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Watch Over Me. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors c 3 coho s 3 speedycars 2 lineker 1 Wiccio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}