{"link": "https://www.themoviedb.org/tv/62084?language=en", "title": "Poldark", "resume": "Britain is in the grip of a chilling recession... falling wages, rising prices, civil unrest - only the bankers are smiling. It's 1783 and Ross Poldark returns from the American War of Independence to his beloved Cornwall to find his world in ruins: his father dead, the family mine long since closed, his house wrecked and his sweetheart pledged to marry his cousin. But Ross finds that hope and love can be found when you are least expecting it in the wild but beautiful Cornish landscape.", "rate": 78, "genre": ["Drama"], "cast": ["Aidan Turner", "Eleanor Tomlinson", "Heida Reed", "Kyle Soller", "Ruby Bentall"], "character": ["Ross Poldark", "Demelza", "Elizabeth Chenoweth", "Francis Poldark", "Verity Poldark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62084   Expand Poldark   (2015) User Score  Play Trailer Overview Britain is in the grip of a chilling recession... falling wages, rising prices, civil unrest - only the bankers are smiling. It's 1783 and Ross Poldark returns from the American War of Independence to his beloved Cornwall to find his world in ruins: his father dead, the family mine long since closed, his house wrecked and his sweetheart pledged to marry his cousin. But Ross finds that hope and love can be found when you are least expecting it in the wild but beautiful Cornish landscape. Featured Crew Debbie Horsfield Creator Winston Graham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  23 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aidan Turner Ross Poldark Eleanor Tomlinson Demelza Heida Reed Elizabeth Chenoweth Kyle Soller Francis Poldark Ruby Bentall Verity Poldark Full Cast & Crew Current Season Series 4 2018 | 4 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Elizabeth Open 3 by  NotoriousRio A different Jack Farthing ... Open 0 by cursethedarkness\n      \n     ‘tint right, ‘tint fair, ‘tint proper' Open 1 by  merryapril Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  7 Recommendations   2015-01-21 Wolf Hall 7.8    2014-10-06 Grantchester 7.3    2016-08-28 Victoria 6.5    2015-10-10 The Last Kingdom 7.7    2016-11-04 The Crown 8.1    2012-01-15 Call the Midwife 6.8    2010-09-26 Downton Abbey 8.0    2015-03-16 Spotless 7.3  Facts Status  Returning Series Networks Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b07pn8mz Genres Drama Keywords love triangle england arranged marriage romance period drama 18th century costume drama Content Score 100 Yes! Looking good! Top Contributors 100 Elizabeth Jennings a 37 additup 15 Banana J 15 JohnyB0y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}