{"link": "https://www.themoviedb.org/tv/63011?language=en", "title": "The Journey of Flower", "resume": "She is the last god of the world and a Lone Star (an unlucky star). On the day of her birth, flowers wilted and the sky turned dark as her mother passed away during childbirth. Therefore, she was named Hua Qian Gu, meaning a thousand flower bones. Her body has a strange scent that attracts and provokes demons. Taking the advice of her dying father, Hua Qian Gu sets out on the journey to seek for a teacher to teach her martial art skills so that she could protect herself. On her journey she met friends such as Dongfang Yu Qing, Meng Xuan Lang, and Sha Qian Mo.", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Ma Ke"], "character": ["Sha Qian Mo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63011   Expand The Journey of Flower   (2015) User Score Overview She is the last god of the world and a Lone Star (an unlucky star). On the day of her birth, flowers wilted and the sky turned dark as her mother passed away during childbirth. Therefore, she was named Hua Qian Gu, meaning a thousand flower bones. Her body has a strange scent that attracts and provokes demons. Taking the advice of her dying father, Hua Qian Gu sets out on the journey to seek for a teacher to teach her martial art skills so that she could protect herself. On her journey she met friends such as Dongfang Yu Qing, Meng Xuan Lang, and Sha Qian Mo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ma Ke Sha Qian Mo Full Cast & Crew Last Season Season 2 2015 | 32 Episodes Season 2 of The Journey of Flower premiered on September 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Journey of Flower. You can help by rating TV shows you've seen. Facts Original Name  花千骨 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors M 70 Maria180493 9 54 987321lxy 24 Elizabeth Jennings 5 empireyura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}