{"link": "https://www.themoviedb.org/tv/68985?language=en", "title": "The Deleted", "resume": "When escapees from a mysterious cult start disappearing, the survivors are driven to find each other for protection. Damaged by their dark pasts and hunted by the cult leaders who followed them to Los Angeles, they'll do anything to be free.", "rate": 63, "genre": ["Mystery"], "cast": ["Nash Grier", "Spencer Neville", "Alissa Violet", "Madeline Brewer", "Amanda Cerny"], "character": ["Ryder", "Garrett", "Kylie", "Agatha", "Breeda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68985   Expand The Deleted   (2016) User Score Overview When escapees from a mysterious cult start disappearing, the survivors are driven to find each other for protection. Damaged by their dark pasts and hunted by the cult leaders who followed them to Los Angeles, they'll do anything to be free. Featured Crew Bret Easton Ellis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nash Grier Ryder Spencer Neville Garrett Alissa Violet Kylie Madeline Brewer Agatha Amanda Cerny Breeda Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of The Deleted premiered on December  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Deleted. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  14m Homepage   https://www.fullscreen.com/series/the-deleted Genres Mystery Keywords cult Content Score 93 Almost there... Top Contributors 34 joeynotjoe 4 Mitsarinho 3 Elizabeth Jennings w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}