{"link": "https://www.themoviedb.org/tv/64685?language=en", "title": "Close to the Enemy", "resume": "A British intelligence officer has to ensure that a captured German scientist helps the British develop jet aircraft.", "rate": 53, "genre": ["Drama", "War", "Politics"], "cast": ["Jim Sturgess", "Charlotte Riley", "Angela Bassett", "Alfred Molina", "Alfie Allen"], "character": ["Callum Ferguson", "Rachel Lombard", "Eva", "Harold Lindsay-Jones", "Ringwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64685   Expand Close to the Enemy   (2016) User Score  Play Trailer Overview A British intelligence officer has to ensure that a captured German scientist helps the British develop jet aircraft. Featured Crew Stephen Poliakoff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Sturgess Callum Ferguson Charlotte Riley Rachel Lombard Angela Bassett Eva Alfred Molina Harold Lindsay-Jones Alfie Allen Ringwood Full Cast & Crew Last Season Season 1 2016 | 7 Episodes Season 1 of Close to the Enemy premiered on November 10, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply b a really bad series! Open 0 by billr1953\n      \n     Disappointing Open 0 by DanDare\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Close to the Enemy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b082sy3q Genres Drama War & Politics Keywords cold war thriller miniseries scientist Content Score 100 Yes! Looking good! Top Contributors 22 Elizabeth Jennings 18 EveDemocracy 16 Steve 13 inframundo10  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}