{"link": "https://www.themoviedb.org/tv/268?language=en", "title": "Untold Stories of the E.R.", "resume": "Untold Stories of the E.R. is a docudrama television series which airs on TLC and Discovery Fit & Health.\nIn this program real-life emergency room doctors tell about their most bizarre and puzzling cases. Typically these involve medical sabotage, violently or strangely acting patients, life-threatening injuries, or even situations in which the E.R. physician is too overwhelmed to handle the caseload and can't transfer responsibility for the patient to someone else.\nOften the doctors play themselves, and whenever possible the patients themselves take part in the reenactment as well. If they don't appear as themselves during their medical emergency, they are often shown in brief interviews to show the public how they turned out. Occasionally, patients' names are changed and actors play their roles. All cases are based on actual events, but are highly dramatized and not necessarily accurate from a clinical or technical standpoint.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 268   Expand Untold Stories of the E.R.   (2004) User Score  Play Trailer Overview Untold Stories of the E.R. is a docudrama television series which airs on TLC and Discovery Fit & Health. In this program real-life emergency room doctors tell about their most bizarre and puzzling cases. Typically these involve medical sabotage, violently or strangely acting patients, life-threatening injuries, or even situations in which the E.R. physician is too overwhelmed to handle the caseload and can't transfer responsibility for the patient to someone else. Often the doctors play themselves, and whenever possible the patients themselves take part in the reenactment as well. If they don't appear as themselves during their medical emergency, they are often shown in brief interviews to show the public how they turned out. Occasionally, patients' names are changed and actors play their roles. All cases are based on actual events, but are highly dramatized and not necessarily accurate from a clinical or technical standpoint. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2014 | 25 Episodes Season 9 of Untold Stories of the E.R. premiered on July 12, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Untold Stories of the E.R.. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m, 50m Homepage   http://health.discovery.com/tv-shows/untold-stories-of-the-er/videos/untold-stories-of-the-er-videos.htm Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 13 TMDb Bot 9 Elizabeth Jennings a 1 atfeldman - 1 -Alexander-  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}