{"link": "https://www.themoviedb.org/tv/17627?language=en", "title": "The Take", "resume": "Freddie Jackson is released from prison in 1984 having served a four-year sentence for armed robbery. His wife Jackie, who has been waiting for him on the outside in the mistaken belief that that he wants to go straight, soon finds herself disappointed: Freddie is in fact raring to get back into the game and has set his sights on becoming top dog in the East End underworld.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["Shaun Evans", "Tom Hardy", "Charlotte Riley", "Kierston Wareing", "Margot Leicester"], "character": ["Jimmy", "Freddie", "Maggie", "Jackie", "Lena"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17627   Expand The Take   (2009) User Score  Play Trailer Overview Freddie Jackson is released from prison in 1984 having served a four-year sentence for armed robbery. His wife Jackie, who has been waiting for him on the outside in the mistaken belief that that he wants to go straight, soon finds herself disappointed: Freddie is in fact raring to get back into the game and has set his sights on becoming top dog in the East End underworld. Featured Crew Martina Cole Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  6 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shaun Evans Jimmy Tom Hardy Freddie Charlotte Riley Maggie Kierston Wareing Jackie Margot Leicester Lena Full Cast & Crew Last Season Season 1 2009 | 4 Episodes Season 1 of The Take premiered on June 17, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Take. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  7 Recommendations   2008-02-13 Underbelly 7.2    2010-07-05 Identity 7.0    2009-07-21 The Colony 7.9    2013-05-10 Life of Crime 6.0    2011-09-04 Appropriate Adult 6.9    2006-11-15 Day Break 7.5    2005-06-07 Sugar Rush 7.8    1997-05-09 Jonathan Creek 7.7  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://sky1.sky.com/the-take-about-the-show Genres Action & Adventure Drama Keywords miniseries Content Score 100 Yes! Looking good! Top Contributors TB 24 TMDb Bot m 15 mercman 10 Elizabeth Jennings S 9 Sancho1985  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}