{"link": "https://www.themoviedb.org/tv/3386?language=en", "title": "Durham County", "resume": "Detective Mike Sweeney has just moved with his wife and daughters from Toronto to his hometown of Durham County after the death of his partner. Hoping to escape the violent world of big city police work, Mike falls into a suburban world besieged by crime, abuse and murder.", "rate": 55, "genre": ["Drama"], "cast": ["Hugh Dillon", "Louis Ferreira", "Helene Joy", "Sonya Salomaa", "Laurence Leboeuf"], "character": ["Mike Sweeney", "Ray Prager", "Audrey Sweeney", "Traci Prager", "Sadie Sweeney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3386   Expand Durham County   (2007) User Score  Play Trailer Overview Detective Mike Sweeney has just moved with his wife and daughters from Toronto to his hometown of Durham County after the death of his partner. Hoping to escape the violent world of big city police work, Mike falls into a suburban world besieged by crime, abuse and murder. Featured Crew Laurie Finstad-Knizhnik Creator Janis Lundman Creator Adrienne Mitchell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Dillon Mike Sweeney Louis Ferreira Ray Prager Helene Joy Audrey Sweeney Sonya Salomaa Traci Prager Laurence Leboeuf Sadie Sweeney Full Cast & Crew Last Season Season 3 2010 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Durham County. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.durhamcounty.ca Genres Drama Keywords canada serial killer hometown homicide detective Content Score 100 Yes! Looking good! Top Contributors 28 United600 10 Banana z 5 zurman1 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}