{"link": "https://www.themoviedb.org/tv/13265?language=en", "title": "Dennou Coil", "resume": "Dennō Coil, Coil — A Circle of Children, is a Japanese science fiction anime television series depicting a near future where semi-immersive augmented reality technology has just begun to enter the mainstream. The series takes place in the fictional city of Daikoku, a hotbed of AR development with an emerging city-wide virtual infrastructure. It follows a group of children as they use AR glasses to unravel the mysteries of the half real, half Internet city, using a variety of illegal software tools, techniques, and virtual pets to manipulate the digital landscape.\nDennō Coil, in development for over a decade, is the series director debut of Japanese animator Mitsuo Iso. It premiered on NHK Educational TV on May 12, 2007. Due to the animators involved in its production and its unusually high-profile television broadcast time slot, Dennō Coil was highly anticipated.", "rate": 73, "genre": ["Animation"], "cast": ["Junko Noda", "Sachiko Kojima", "Yumiko Kobayashi", "Houko Kuwashima", "Akiko Yajima"], "character": ["Tamako Harakawa", "Fumie Hashimoto", "Akira Hashimoto", "Yūko Amasawa", "Kyōko Okonogi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13265   Expand Dennou Coil   (2007) User Score Overview Dennō Coil, Coil — A Circle of Children, is a Japanese science fiction anime television series depicting a near future where semi-immersive augmented reality technology has just begun to enter the mainstream. The series takes place in the fictional city of Daikoku, a hotbed of AR development with an emerging city-wide virtual infrastructure. It follows a group of children as they use AR glasses to unravel the mysteries of the half real, half Internet city, using a variety of illegal software tools, techniques, and virtual pets to manipulate the digital landscape. Dennō Coil, in development for over a decade, is the series director debut of Japanese animator Mitsuo Iso. It premiered on NHK Educational TV on May 12, 2007. Due to the animators involved in its production and its unusually high-profile television broadcast time slot, Dennō Coil was highly anticipated. Featured Crew Mitsuo Iso Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Noda Tamako Harakawa Sachiko Kojima Fumie Hashimoto Yumiko Kobayashi Akira Hashimoto Houko Kuwashima Yūko Amasawa Akiko Yajima Kyōko Okonogi Full Cast & Crew Last Season Dennou coil season 1 2007 | 26 Episodes Season 1 of Dennou Coil premiered on May 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Dennou Coil. You can help by rating TV shows you've seen. Facts Original Name  電脳コイル Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tokuma.co.jp/coil/ Genres Animation Keywords watercolour style Content Score 93 Almost there... Top Contributors 9 qw0aszx d 7 dankzel J 5 JeremyRogers b 5 beachsounddog  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}