{"link": "https://www.themoviedb.org/tv/5863?language=en", "title": "Samurai 7", "resume": "Samurai 7 is a 2004 anime TV series, produced by Gonzo and based on Akira Kurosawa's highly regarded 1954 movie Seven Samurai. The series was directed by Toshifumi Takizawa and its music was composed by Kaoru Wada and Eitetsu Hayashi. There are 26 episodes, each costing around ¥32,500,000 to produce.\nThe series premiered across Japan on the anime satellite television network, Animax, as an exclusive high definition CS-PPV broadcast, and was also later aired by the network across its other respective networks worldwide, including Southeast Asia, South Asia, Latin America and other regions. Funimation Entertainment acquired the dubbing rights for the North American release. It previously aired in America through the Independent Film Channel in April 2006 and in high definition on Dish Networks Animania HD channel. It has also been broadcast across Canada by specialty channel Razer and across Hong Kong by TVB Jade. The Funimation Channel aired the series on September 6, 2010. It began airing on Adult Swim's revived Toonami block on August 19, 2012. and ended its run on February 10, 2013.", "rate": 72, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Kong Kuwata", "Masaki Terasoma", "Romi Park", "Shin'ichirou Miki", "Toru Kusano"], "character": ["Kikuchiyo (voice)", "Kambei Shimada (voice)", "Katsushiro Okamoto (voice)", "Kyuzo (voice)", "Shichiroji (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5863   Expand Samurai 7   (2004) User Score Overview Samurai 7 is a 2004 anime TV series, produced by Gonzo and based on Akira Kurosawa's highly regarded 1954 movie Seven Samurai. The series was directed by Toshifumi Takizawa and its music was composed by Kaoru Wada and Eitetsu Hayashi. There are 26 episodes, each costing around ¥32,500,000 to produce. The series premiered across Japan on the anime satellite television network, Animax, as an exclusive high definition CS-PPV broadcast, and was also later aired by the network across its other respective networks worldwide, including Southeast Asia, South Asia, Latin America and other regions. Funimation Entertainment acquired the dubbing rights for the North American release. It previously aired in America through the Independent Film Channel in April 2006 and in high definition on Dish Networks Animania HD channel. It has also been broadcast across Canada by specialty channel Razer and across Hong Kong by TVB Jade. The Funimation Channel aired the series on September 6, 2010. It began airing on Adult Swim's revived Toonami block on August 19, 2012. and ended its run on February 10, 2013. Featured Crew Akira Kurosawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kong Kuwata Kikuchiyo (voice) Masaki Terasoma Kambei Shimada (voice) Romi Park Katsushiro Okamoto (voice) Shin'ichirou Miki Kyuzo (voice) Toru Kusano Shichiroji (voice) Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Samurai 7 premiered on June 12, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2004-04-12 GANTZ 6.7    1995-10-27 Golden Boy 7.3    2006-04-08 Black Lagoon 7.9    2002-01-08 Full Metal Panic! 6.6    1998-04-02 TRIGUN 7.7    1996-01-10 Rurouni Kenshin 7.6    2007-04-01 Gurren Lagann 7.9    2012-10-12 Psycho-Pass 7.7  Facts Original Name  SAMURAI 7 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Drama Keywords japan samurai historical kurosawa Content Score 93 Almost there... Top Contributors t 48 tmdb983464 R 3 Rebecca 3 Sergiojamon 2 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}