{"link": "https://www.themoviedb.org/tv/64304?language=en", "title": "Save the Family", "resume": "Jung Woo Jin is an ambitious doctor. After he failed in love, he no longer believes in true love. He views marriage as just a business. Meanwhile, Lee Hae Soo works as an assistant chef. She dreams of getting married to the right man and having a family. Then, Woo Jin falls in love with Hae Soo and He comes into conflict with love and ambition.", "rate": 0, "genre": ["Drama", "Family", "Romance"], "cast": ["Jae Hee", "Kang Byul", "Jung Hye-in", "Choi Il-hwa", "Byun Hee-bong"], "character": ["Jung Woo-jin", "Lee Hae-soo", "Go Ye-won", "Jung Man-jae", "Jung Soo-bong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64304   Expand Save the Family   (2015) User Score Overview Jung Woo Jin is an ambitious doctor. After he failed in love, he no longer believes in true love. He views marriage as just a business. Meanwhile, Lee Hae Soo works as an assistant chef. She dreams of getting married to the right man and having a family. Then, Woo Jin falls in love with Hae Soo and He comes into conflict with love and ambition. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jae Hee Jung Woo-jin Kang Byul Lee Hae-soo Jung Hye-in Go Ye-won Choi Il-hwa Jung Man-jae Byun Hee-bong Jung Soo-bong Full Cast & Crew Last Season Season 1 2015 | 123 Episodes Season 1 of Save the Family premiered on May 11, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Save the Family. You can help by rating TV shows you've seen. Facts Original Name  가족을 지켜라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/savethefamily/index.html Genres Drama Family Romance Keywords korea Content Score 86 Almost there... Top Contributors t 40 tmdb38202327 t 2 tmdb983464 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}