{"link": "https://www.themoviedb.org/tv/37842?language=en", "title": "MegaMan NT Warrior", "resume": "The year is 200X, and everything electronic is connected by internet. In this world, there is no one, rich or poor, who does not own a PET (Personal Terminal), and there is not one PET that does not house a NetNavi, an AI Unit that has the power to delete Viruses and the like. Net Battles (where Operators battle their NetNavis) are popular in this era. That is where Lan Hikari and his NetNavi and best friend, Megaman come in. Striving to become the best NetBattlers, they fight Net Crime and protect the net and real world alike from the likes of the evil terrorist organization the World 3.", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37842   Expand MegaMan NT Warrior   (2003) User Score Overview The year is 200X, and everything electronic is connected by internet. In this world, there is no one, rich or poor, who does not own a PET (Personal Terminal), and there is not one PET that does not house a NetNavi, an AI Unit that has the power to delete Viruses and the like. Net Battles (where Operators battle their NetNavis) are popular in this era. That is where Lan Hikari and his NetNavi and best friend, Megaman come in. Striving to become the best NetBattlers, they fight Net Crime and protect the net and real world alike from the likes of the evil terrorist organization the World 3. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Megaman nt warrior (us) season 3 2004 | 41 Episodes Season 3 of MegaMan NT Warrior premiered on November 22, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on MegaMan NT Warrior. You can help by rating TV shows you've seen. Facts Original Name  Rockman.EXE Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords anime Content Score 56 We're so close, yet so far. Top Contributors B 11 Blinker V 2 Vivienb  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}