{"link": "https://www.themoviedb.org/tv/46004?language=en", "title": "Date a Live", "resume": "Thirty years ago a strange phenomenon called a \"spacequake\" devastated the center of Eurasia, claiming the lives of at least 150 million people. Since then, smaller spacequakes plague the world on an irregular basis. Shido Itsuka, a seemingly ordinary high schooler comes across a mysterious girl at the ground zero of a spacequake and learns she is one of the \"Spirits\" who are the real cause of the spacequakes that occur when they manifest themselves in the world. He is recruited to make use of his mysterious ability to seal the Spirits' powers thus stopping them from being a threat to mankind. However, there is a catch: to seal a Spirit's power, he must make her fall in love with him and kiss him.", "rate": 71, "genre": ["Animation", "Sci-Fi", "Fantasy", "Romance", "Comedy"], "cast": ["Nobunaga Shimazaki", "Marina Inoue", "Ayana Taketatsu", "Misuzu Togashi", "Iori Nomizu"], "character": ["Shido Itsuka (voice)", "Tohka Yatogami (voice)", "Kotori Itsuka (voice)", "Origami Tobiichi (voice)", "Yoshino (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46004   Expand Date a Live   (2013) User Score Overview Thirty years ago a strange phenomenon called a \"spacequake\" devastated the center of Eurasia, claiming the lives of at least 150 million people. Since then, smaller spacequakes plague the world on an irregular basis. Shido Itsuka, a seemingly ordinary high schooler comes across a mysterious girl at the ground zero of a spacequake and learns she is one of the \"Spirits\" who are the real cause of the spacequakes that occur when they manifest themselves in the world. He is recruited to make use of his mysterious ability to seal the Spirits' powers thus stopping them from being a threat to mankind. However, there is a catch: to seal a Spirit's power, he must make her fall in love with him and kiss him. Featured Crew Kōshi Tachibana Creator Hideki Shirane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nobunaga Shimazaki Shido Itsuka (voice) Marina Inoue Tohka Yatogami (voice) Ayana Taketatsu Kotori Itsuka (voice) Misuzu Togashi Origami Tobiichi (voice) Iori Nomizu Yoshino (voice) Full Cast & Crew Last Season Season 2 2014 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2011-04-14 Aria the Scarlet Ammo 6.4    2012-04-05 Sankarea: Undying Love 7.0    2010-01-05 Ladies versus Butlers! 10.0    2015-10-03 Chivalry of a Failed Knight 7.9    2008-10-04 A Certain Magical Index 7.4    Sekirei Pure Engagement 8.2    2012-07-06 Aesthetica of a Rogue Hero 7.1    2009-10-05 Heaven's Lost Property 5.3  Facts Original Name  デート・ア・ライブ (Dēto A Raibu) Status  Ended Networks Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Romance Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors d 29 desert188 18 benf45 M 18 Morfow 6 yukoff  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}