{"link": "https://www.themoviedb.org/tv/407?language=en", "title": "Sugar Rush", "resume": "Sugar Rush is an Emmy Award–winning British television comedy drama series developed by Shine Limited and broadcast by Channel 4, based on the Julie Burchill novel of the same name. It is centred around the life of a 15 year old lesbian Kim Daniels who at the beginning of series one moves from London to Brighton on the south coast of England.", "rate": 78, "genre": ["Drama", "Comedy"], "cast": ["Olivia Hallinan", "Lenora Crichlow", "Sarah-Jane Potts", "Richard Lumsden", "Sara Stewart"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 407   Expand Sugar Rush   (2005) User Score Overview Sugar Rush is an Emmy Award–winning British television comedy drama series developed by Shine Limited and broadcast by Channel 4, based on the Julie Burchill novel of the same name. It is centred around the life of a 15 year old lesbian Kim Daniels who at the beginning of series one moves from London to Brighton on the south coast of England. Featured Crew Katie Baxendale Creator Julie Burchill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olivia Hallinan Lenora Crichlow Sarah-Jane Potts Richard Lumsden Sara Stewart Full Cast & Crew Last Season Season 2 2006 | 10 Episodes Season 2 of Sugar Rush premiered on June 15, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2007-10-01 Aliens in America 7.0    2008-01-08 Mistresses 6.0    2010-10-12 Lip Service 6.6    2004-01-18 The L Word 6.7    2008-01-13 Lark Rise to Candleford 7.3    2012-06-17 True Love 6.3    2005-03-27 Fingersmith 7.6    1998-09-29 Felicity 6.5  Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  24m Homepage   http://www.channel4.com/sugar Genres Drama Comedy Keywords sex england dark comedy lesbian teenage crush lgbt teen drama british humour Content Score 100 Yes! Looking good! Top Contributors 8 Banana 7 lineker 6 Christian 4 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}