{"link": "https://www.themoviedb.org/tv/71404?language=en", "title": "Q10", "resume": "High school senior Heita Fukai doesn't know what to do with his life. Having been seriously ill until recently, he never had the opportunity to think about his future. He leads a mundane existence among his classmates, all of whom are struggling with their own issues. There's the popular guy with secret hang-ups, the boy who can't afford the tuition, the girl with bulimia and the pathologically shy kid. The teachers don't fare much better. The high school is a microcosm of our troubled modern society.\nOne day Fukai stumbles across a mysterious and attractive new girl in school, Q10, whom he soon finds out is actually a robot. Assigned by the principal to be her mentor and told to keep her true identity a secret, Fukai tries to teach Q10 about human feelings. In the process, he becomes aware of his own complex, emotional makeup. Fukai realizes that he is learning about life from an android, and that he may be falling in love with her.", "rate": 50, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Takeru Satoh", "Atsuko Maeda", "Misako Renbutsu", "Kento Kaku", "Mayuko Fukuda"], "character": ["Heita Fukai", "Q10/Kuto", "Tamiko Yamamoto", "Satoshi Kageyama", "Tsukiko Fujino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71404   Expand Q10   (2010) User Score Overview High school senior Heita Fukai doesn't know what to do with his life. Having been seriously ill until recently, he never had the opportunity to think about his future. He leads a mundane existence among his classmates, all of whom are struggling with their own issues. There's the popular guy with secret hang-ups, the boy who can't afford the tuition, the girl with bulimia and the pathologically shy kid. The teachers don't fare much better. The high school is a microcosm of our troubled modern society. One day Fukai stumbles across a mysterious and attractive new girl in school, Q10, whom he soon finds out is actually a robot. Assigned by the principal to be her mentor and told to keep her true identity a secret, Fukai tries to teach Q10 about human feelings. In the process, he becomes aware of his own complex, emotional makeup. Fukai realizes that he is learning about life from an android, and that he may be falling in love with her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takeru Satoh Heita Fukai Atsuko Maeda Q10/Kuto Misako Renbutsu Tamiko Yamamoto Kento Kaku Satoshi Kageyama Mayuko Fukuda Tsukiko Fujino Full Cast & Crew Last Season Season 1 2010 | 9 Episodes Season 1 of Q10 premiered on October 16, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Q10. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.ntv.co.jp/english/pc/2011/02/q10-cute.html Genres Drama Sci-Fi & Fantasy Keywords school robot troubled teen Content Score 86 Almost there... Top Contributors 33 thirstyhippo R 2 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}