{"link": "https://www.themoviedb.org/tv/46878?language=en", "title": "The Village", "resume": "The Village is a BBC TV series written by Peter Moffat. The drama is set in a Derbyshire village in the 20th century. The first series of what Moffat hopes will become a 42-hour TV drama was broadcast in spring 2013 and covered the years 1914 to 1920. A second series has been confirmed for 2014 which will continue the story into the 1920s. Future series would be set in the Second World War, post-war Austerity Britain, and so on.\nThe Village tells the story of life in a Derbyshire village through the eyes of a central character, Bert Middleton. Bert has been portrayed as a boy by Bill Jones, as a teen by Alfie Stewart, and as an old man by David Ryall. John Simm plays Bert's father John Middleton, an alcoholic Peak District farmer, and Maxine Peake plays Bert's mother, Grace. Peake is a preferred actress of the writer, who has called her \"the best actress of her generation\", and she has featured in two previous Moffat series, Criminal Justice and Silk.\nWriter Peter Moffat has spoken of wanting to create 'a British Heimat', alluding to Edgar Reitz's epic German saga Heimat, which followed one extended family in a region of Rhineland from 1919 to 1982. Unlike Downton Abbey, this version of history is a working-class history—\"domestics are expected to face the walls when the master walks by\".", "rate": 80, "genre": ["Drama"], "cast": ["Maxine Peake", "John Simm", "Emily Beecham", "Augustus Prew", "Annabelle Apsion"], "character": ["Grace Middleton", "John Middleton", "Caro Allingham", "George Allingham", "Margaret"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46878   Expand The Village   (2013) User Score  Play Trailer Overview The Village is a BBC TV series written by Peter Moffat. The drama is set in a Derbyshire village in the 20th century. The first series of what Moffat hopes will become a 42-hour TV drama was broadcast in spring 2013 and covered the years 1914 to 1920. A second series has been confirmed for 2014 which will continue the story into the 1920s. Future series would be set in the Second World War, post-war Austerity Britain, and so on. The Village tells the story of life in a Derbyshire village through the eyes of a central character, Bert Middleton. Bert has been portrayed as a boy by Bill Jones, as a teen by Alfie Stewart, and as an old man by David Ryall. John Simm plays Bert's father John Middleton, an alcoholic Peak District farmer, and Maxine Peake plays Bert's mother, Grace. Peake is a preferred actress of the writer, who has called her \"the best actress of her generation\", and she has featured in two previous Moffat series, Criminal Justice and Silk. Writer Peter Moffat has spoken of wanting to create 'a British Heimat', alluding to Edgar Reitz's epic German saga Heimat, which followed one extended family in a region of Rhineland from 1919 to 1982. Unlike Downton Abbey, this version of history is a working-class history—\"domestics are expected to face the walls when the master walks by\". Featured Crew Peter Moffat Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maxine Peake Grace Middleton John Simm John Middleton Emily Beecham Caro Allingham Augustus Prew George Allingham Annabelle Apsion Margaret Full Cast & Crew Last Season Season 2 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Village. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Village. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b04dybc1 Genres Drama Keywords england period drama family english village 1910s Content Score 100 Yes! Looking good! Top Contributors 32 Steve 16 Elizabeth Jennings TB 7 TMDb Bot 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}