{"link": "https://www.themoviedb.org/tv/61456?language=en", "title": "Free!", "resume": "The story revolves around Haruka Nanase, a boy who has always loved to be immersed in water, and to swim in it. Before graduating from elementary school, he participated in a swimming tournament along with his fellow swimming club members, Makoto Tachibana, Nagisa Hazuki, and Rin Matsuoka. After achieving victory, each of the boys went their separate ways. Time passed, and in the middle of their uneventful high school lives Rin appears and challenges Haruka to a match, showing Haruka his overwhelming power. Not wanting it to end like this, Haruka, gathers together Makoto and Nagisa once again and brings a new member named Rei Ryugazaki to create the Iwatobi High School Swimming Club in order to defeat Rin.", "rate": 64, "genre": ["Animation"], "cast": ["Nobunaga Shimazaki", "Mamoru Miyano", "Tatsuhisa Suzuki", "Daisuke Hirakawa", "Akeno Watanabe"], "character": ["Haruka Nanase (voice)", "Rin Matsuoka (voice)", "Makoto Tachibana (voice)", "Rei Ryuugazaki (voice)", "Gou Matsuoka (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61456   Expand Free!   (2013) User Score Overview The story revolves around Haruka Nanase, a boy who has always loved to be immersed in water, and to swim in it. Before graduating from elementary school, he participated in a swimming tournament along with his fellow swimming club members, Makoto Tachibana, Nagisa Hazuki, and Rin Matsuoka. After achieving victory, each of the boys went their separate ways. Time passed, and in the middle of their uneventful high school lives Rin appears and challenges Haruka to a match, showing Haruka his overwhelming power. Not wanting it to end like this, Haruka, gathers together Makoto and Nagisa once again and brings a new member named Rei Ryugazaki to create the Iwatobi High School Swimming Club in order to defeat Rin. Featured Crew Utsumi Hiroko Creator Kouji Ooji Creator Masahiro Yokotani Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nobunaga Shimazaki Haruka Nanase (voice) Mamoru Miyano Rin Matsuoka (voice) Tatsuhisa Suzuki Makoto Tachibana (voice) Daisuke Hirakawa Rei Ryuugazaki (voice) Akeno Watanabe Gou Matsuoka (voice) Full Cast & Crew Next Season Free! Dive to the Future 2018 | 1 Episode Season 3 of Free! is set to premiere on July 12, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Free!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations   2013-04-06 Attack on Titan 7.6    2006-10-04 Death Note 8.2  Facts Original Name  フリー! Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://df.iwatobi-sc.com/ Genres Animation Keywords anime Content Score 86 Almost there... Top Contributors S 22 SuperTouch 14 sp1ti J 14 JessicaBeatriz 13 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}