{"link": "https://www.themoviedb.org/tv/31050?language=en", "title": "The Last Don", "resume": "In this world power isn't everything, it's the only thing. Best selling author of Mario 'The Godfather' Puzo's blockbuster new novel comes to life in this epic saga of America's most powerful crime family.", "rate": 61, "genre": ["Drama"], "cast": ["Danny Aiello", "Rory Cochrane", "Kirstie Alley", "Rashida Jones", "David Marciano"], "character": ["Don Domenico Clericuzio", "Dante Clericuzio", "Rose Marie Clericuzio", "Johanna", "Giorgio Clericuzio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31050   Expand The Last Don   (1997) User Score  Play Trailer Overview In this world power isn't everything, it's the only thing. Best selling author of Mario 'The Godfather' Puzo's blockbuster new novel comes to life in this epic saga of America's most powerful crime family. Featured Crew Mario Puzo Creator Joyce Eliason Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danny Aiello Don Domenico Clericuzio Rory Cochrane Dante Clericuzio Kirstie Alley Rose Marie Clericuzio Rashida Jones Johanna David Marciano Giorgio Clericuzio Full Cast & Crew Last Season Miniseries 1997 | 3 Episodes Season 1 of The Last Don premiered on May 11, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Last Don. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations   1998-05-03 The Last Don II 6.2    2007-08-05 The Company 7.0    2005-11-23 Life in the Undergrowth 8.4    2003-04-20 Helen of Troy 6.4    1979-09-10 Tinker Tailor Soldier Spy 7.7    1989-04-15 Around the World in 80 Days 6.4    2012-10-05 Halo 4 Forward Unto Dawn 6.3    2008-09-07 True Blood 7.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords daughter gangster family relationships rivalry organized crime mafia miniseries grandson Content Score 100 Yes! Looking good! Top Contributors TB 31 TMDb Bot 15 Steve 10 Banana s 9 styop.b@hotmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}