{"link": "https://www.themoviedb.org/tv/2627?language=en", "title": "Surfside 6", "resume": "Surfside 6 was an ABC television series which aired from 1960 to 1962. The show centered on a Miami Beach detective agency set on a houseboat and featured Troy Donahue as Sandy Winfield II; Van Williams as Kenny Madison; and Lee Patterson as Dave Thorne. Diane McBain co-starred as socialite Daphne Dutton, whose yacht was berthed next to their houseboat. Margarita Sierra also had a supporting role as Cha Cha O'Brien, an entertainer who worked at The Boom Boom Room, a popular Miami Beach hangout at the Fontainebleau Hotel, directly across the street from Surfside 6. Surfside 6 was in fact a real address in Miami Beach, where an unrelated houseboat was moored at the time; it can also be seen in the sweeping aerial establishing shot of the Fontainebleu in 1964's Goldfinger.", "rate": 0, "genre": ["Drama"], "cast": ["Lee Patterson", "Troy Donahue", "Van Williams", "Margarita Sierra", "Diane McBain"], "character": ["Dave Thorne", "Sandy Winfield II", "Ken Madison", "Cha Cha O'Brien", "Daphne Dutton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2627   Expand Surfside 6   (1960) User Score Overview Surfside 6 was an ABC television series which aired from 1960 to 1962. The show centered on a Miami Beach detective agency set on a houseboat and featured Troy Donahue as Sandy Winfield II; Van Williams as Kenny Madison; and Lee Patterson as Dave Thorne. Diane McBain co-starred as socialite Daphne Dutton, whose yacht was berthed next to their houseboat. Margarita Sierra also had a supporting role as Cha Cha O'Brien, an entertainer who worked at The Boom Boom Room, a popular Miami Beach hangout at the Fontainebleau Hotel, directly across the street from Surfside 6. Surfside 6 was in fact a real address in Miami Beach, where an unrelated houseboat was moored at the time; it can also be seen in the sweeping aerial establishing shot of the Fontainebleu in 1964's Goldfinger. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Patterson Dave Thorne Troy Donahue Sandy Winfield II Van Williams Ken Madison Margarita Sierra Cha Cha O'Brien Diane McBain Daphne Dutton Full Cast & Crew Last Season Season 2 1961 | 39 Episodes Season 2 of Surfside 6 premiered on September 18, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Surfside 6. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 7 Daemon 4 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}