{"link": "https://www.themoviedb.org/tv/3557?language=en", "title": "Walking with Dinosaurs", "resume": "Combining fact and informed speculation with cutting-edge computer graphics and animatronics effects, the series set out to create the most accurate portrayal of prehistoric animals ever seen on the screen.", "rate": 80, "genre": ["Documentary"], "cast": ["Kenneth Branagh"], "character": ["Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3557   Expand Walking with Dinosaurs   (1999) User Score Overview Combining fact and informed speculation with cutting-edge computer graphics and animatronics effects, the series set out to create the most accurate portrayal of prehistoric animals ever seen on the screen. Featured Crew Tim Haines Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenneth Branagh Narrator (voice) Full Cast & Crew Last Season Season 1 1999 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  12 Recommendations   2001-11-15 Walking with Beasts 7.7    2003-09-09 Sea Monsters 7.0    2005-01-07 Walking with Monsters 7.6    1997-11-23 Liberty! 7.3    2003-04-01 Walking with Cavemen 7.7    1993-01-06 The Animals of Farthing Wood 8.7    1998-10-21 The Life of Birds 9.3    1987-06-17 Once Upon a Time... Life 8.0  Facts Status  Ended Network Certification 6+ Meaning Only kids the age of 6 or older can watch. Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00sy534 Genres Documentary Keywords dinosaur Content Score 64 We're so close, yet so far. Top Contributors TB 44 TMDb Bot 21 Apollo 12 Banana 5 MacFly 🇫🇷  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}