{"link": "https://www.themoviedb.org/tv/64433?language=en", "title": "Shades of Blue", "resume": "Sexy New York detective and single mother Harlee Santos fell in with a tight-knit group of dirty cops, taking bribes and protection money that she uses to provide the best life for her honest, talented daughter. But when she's trapped by the FBI and forced to inform on her own \"brothers,\" she'll have to walk the fine line between love, loyalty, honor and betrayal, and try to keep it together for her daughter's future.", "rate": 64, "genre": ["Drama", "Crime"], "cast": ["Jennifer Lopez", "Ray Liotta", "Drea de Matteo", "Warren Kole", "Gino Anthony Pesi"], "character": ["Harlee Santos", "Bill Wozniak", "Tess Nazario", "Robert Staal", "James Nava"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64433   Expand Shades of Blue   (2016) User Score  Play Trailer Overview Sexy New York detective and single mother Harlee Santos fell in with a tight-knit group of dirty cops, taking bribes and protection money that she uses to provide the best life for her honest, talented daughter. But when she's trapped by the FBI and forced to inform on her own \"brothers,\" she'll have to walk the fine line between love, loyalty, honor and betrayal, and try to keep it together for her daughter's future. Featured Crew Adi Hasak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  1 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Lopez Harlee Santos Ray Liotta Bill Wozniak Drea de Matteo Tess Nazario Warren Kole Robert Staal Gino Anthony Pesi James Nava Full Cast & Crew Current Season Season 3 2018 | 4 Episodes Season 3 of Shades of Blue premiered on June 17, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Well season 2 has wrapped Open 3 by  JAYJAY1234 S What did Harlee do? Open 1 by  Daijahv Renewed for season 3 Open 1 by  RobPatelli Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2016-03-24 The Catch 6.4    2017-10-01 Ten Days in the Valley 6.0    2017-03-01 Chicago Justice 4.8    2017-01-18 SIX 7.1    2014-01-08 Chicago P.D. 6.9    2015-03-01 Secrets and Lies 7.1    2017-09-27 SEAL Team 6.6    2013-04-03 Rogue 7.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/shades-of-blue Genres Drama Crime Keywords dirty cop police detective nypd female detective Content Score 100 Yes! Looking good! Top Contributors 21 Imzadi 21 Elizabeth Jennings 20 Banana t 14 tmdb48730457  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}