{"link": "https://www.themoviedb.org/tv/16673?language=en", "title": "Little Princess", "resume": "Little Princess is a children's animated television series. Directed by Edward Foster, it debuted in the United Kingdom in 2006 and is currently shown there as part of Channel 5's Milkshake! and – as Y Dywysoges Fach – in the children's programming strand Cyw on the Welsh language channel S4C.\nIn English, the stories are narrated by Julian Clary, who also provides the voice of the cat Puss. Jane Horrocks provides the voice of the Little Princess. The series is based on the original books by Tony Ross and follows the success of Ross's 1986 book 'I Want My Potty', which was also turned into a 5 minute short film.\nGreat Uncle Walter is voiced by Brian Blessed and General, Prime Minister, Gardener and Chef are all voiced by Colin McFarlane.", "rate": 60, "genre": ["Animation", "Kids"], "cast": ["Julian Clary", "Jane Horrocks"], "character": ["Narrator (voice)", "Little Princess (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16673   Expand Little Princess   (2007) User Score Overview Little Princess is a children's animated television series. Directed by Edward Foster, it debuted in the United Kingdom in 2006 and is currently shown there as part of Channel 5's Milkshake! and – as Y Dywysoges Fach – in the children's programming strand Cyw on the Welsh language channel S4C. In English, the stories are narrated by Julian Clary, who also provides the voice of the cat Puss. Jane Horrocks provides the voice of the Little Princess. The series is based on the original books by Tony Ross and follows the success of Ross's 1986 book 'I Want My Potty', which was also turned into a 5 minute short film. Great Uncle Walter is voiced by Brian Blessed and General, Prime Minister, Gardener and Chef are all voiced by Colin McFarlane. Featured Crew Tony Ross Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julian Clary Narrator (voice) Jane Horrocks Little Princess (voice) Full Cast & Crew Last Season Season 3 2012 | 35 Episodes Season 3 of Little Princess premiered on August  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Little Princess. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.littleprincesskingdom.com/ Genres Animation Kids Keywords princess spoiled child little girl based on children's book Content Score 64 We're so close, yet so far. Top Contributors 40 Marr 🇳🇱 10 Kris Ekman T 4 TheMovieFreak1976 f 3 finalomen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}