{"link": "https://www.themoviedb.org/tv/34744?language=en", "title": "Hatsukoi Limited.", "resume": "Ayumi and her friends are all just entering the eighth grade, as, one by one, they discover that love is infectious and you can catch it from anyone! Now Ayumi's torn between two brothers, Koyoi has an altogether different kind of brother issue and budding theatrical impresario Sumire seems ready to do anything to land her leading man. Then there's tom-boy Rika, aspiring artist Nao, Kei, who's very 'mature' for her age and older girl Misaki who really IS more mature.", "rate": 0, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Mariya Ise", "Ayumi Fujimura", "Aki Toyosaki", "Minako Kotobuki", "Shizuka Itou"], "character": ["Ayumi Arihara (voice)", "Nao Chikura (voice)", "Koyoi Bessho (voice)", "Rika Dobashi (voice)", "Kei Enomoto (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34744   Expand Hatsukoi Limited.   (2009) User Score Overview Ayumi and her friends are all just entering the eighth grade, as, one by one, they discover that love is infectious and you can catch it from anyone! Now Ayumi's torn between two brothers, Koyoi has an altogether different kind of brother issue and budding theatrical impresario Sumire seems ready to do anything to land her leading man. Then there's tom-boy Rika, aspiring artist Nao, Kei, who's very 'mature' for her age and older girl Misaki who really IS more mature. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariya Ise Ayumi Arihara (voice) Ayumi Fujimura Nao Chikura (voice) Aki Toyosaki Koyoi Bessho (voice) Minako Kotobuki Rika Dobashi (voice) Shizuka Itou Kei Enomoto (voice) Full Cast & Crew Last Season Season 1 2009 | 12 Episodes Season 1 of Hatsukoi Limited. premiered on April 11, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Hatsukoi Limited.. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hatsukoi Limited.. You can help by rating TV shows you've seen. Facts Original Name  初恋限定。 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://jcstaff.co.jp/sakuhin/nenpyo/2009/04_hatsukoi/hatsukoi.htm Genres Animation Comedy Drama Keywords romance based on manga school life anime watercolour style love polygon Content Score 86 Almost there... Top Contributors 121 Marr 🇳🇱 15 BrerFox J 12 JeremyRogers 8 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}