{"link": "https://www.themoviedb.org/tv/1433?language=en", "title": "American Dad!", "resume": "The series focuses on an eccentric motley crew that is the Smith family and their three housemates: Father, husband, and breadwinner Stan Smith; his better half housewife, Francine Smith; their college-aged daughter, Hayley Smith; and their high-school-aged son, Steve Smith. Outside of the Smith family, there are three additional main characters, including Hayley's boyfriend turned husband, Jeff Fischer; the family's man-in-a-goldfish-body pet, Klaus; and most notably the family's zany alien, Roger, who is \"full of masquerades, brazenness, and shocking antics.\"", "rate": 62, "genre": ["Animation", "Comedy"], "cast": ["Seth MacFarlane", "Wendy Schaal", "Rachael MacFarlane", "Scott Grimes", "Dee Bradley Baker"], "character": ["Stan Smith (voice)", "Francine Smith (voice)", "Hayley Smith (voice)", "Steve Smith (voice)", "Klaus (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1433   Expand American Dad!   (2005) User Score  Play Trailer Overview The series focuses on an eccentric motley crew that is the Smith family and their three housemates: Father, husband, and breadwinner Stan Smith; his better half housewife, Francine Smith; their college-aged daughter, Hayley Smith; and their high-school-aged son, Steve Smith. Outside of the Smith family, there are three additional main characters, including Hayley's boyfriend turned husband, Jeff Fischer; the family's man-in-a-goldfish-body pet, Klaus; and most notably the family's zany alien, Roger, who is \"full of masquerades, brazenness, and shocking antics.\" Featured Crew Mike Barker Creator Matt Weitzman Creator Seth MacFarlane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  23 Images Backdrops  31 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seth MacFarlane Stan Smith (voice) Wendy Schaal Francine Smith (voice) Rachael MacFarlane Hayley Smith (voice) Scott Grimes Steve Smith (voice) Dee Bradley Baker Klaus (voice) Full Cast & Crew Current Season Original Air Date Original Air Date DVD Order (DVD) Digital Order (Digital) Production Order (Production) Season 15 2018 | 12 Episodes Season 15 of American Dad! premiered on February 12, 2018. View All Seasons Social Reviews  0 Discussions  26 Subject Status Replies Last Reply Make it stop Open 0 by DRDMovieMusings\n      \n     T New Episodes Return April 10th Open 1 by  StonerWithaBoner \"You boys want to see a 400lb man rise out of his overalls like a phoenix?\" Aka favorite american dad quotes... Go! Open 0 by StonerWithaBoner\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  31 Posters  11 Recommendations   1999-03-28 Futurama 8.2    1999-01-31 Family Guy 6.5    2009-09-27 The Cleveland Show 5.2    1997-08-13 South Park 7.8    2000-01-09 Malcolm in the Middle 7.5    1997-01-12 King of the Hill 7.1    2003-09-22 Two and a Half Men 6.2    2005-02-20 Robot Chicken 7.1  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.tbs.com/shows/american-dad.html Genres Animation Comedy Keywords cia adult animation Content Score 100 Yes! Looking good! Top Contributors 134 Banana r 46 risto.ott 46 Elizabeth Jennings 42 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}