{"link": "https://www.themoviedb.org/tv/26992?language=en", "title": "Inspector Maigret", "resume": "BBC series based on the novels by Georges Simenon which starred Rupert Davies as Inspector Maigret, a French police detective who preferred to watch and listen in order to solve crimes. The series ran from 1960-63 on British television.", "rate": 80, "genre": ["Crime", "Mystery", "Drama"], "cast": ["Rupert Davies", "Ewen Solon", "Henry Oscar", "Victor Lucas", "Helen Shingler"], "character": ["Chief Inspector Maigret", "Lucas", "Inspector Lognon", "Torrance", "Madame Maigret"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26992   Expand Inspector Maigret   (1960) User Score Overview BBC series based on the novels by Georges Simenon which starred Rupert Davies as Inspector Maigret, a French police detective who preferred to watch and listen in order to solve crimes. The series ran from 1960-63 on British television. Featured Crew Georges Simenon Creator Giles Cooper Creator Roger East Creator Margot Bennett Creator Donald Bull Creator Elaine Morgan Creator Vincent Tilsley Creator John Elliot Creator Anthony Coburn Creator Anthony Steven Creator Rex Tucker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rupert Davies Chief Inspector Maigret Ewen Solon Lucas Henry Oscar Inspector Lognon Victor Lucas Torrance Helen Shingler Madame Maigret Full Cast & Crew Last Season Season 5 1969 | 1 Episode Season 5 of Inspector Maigret premiered on September  9, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Inspector Maigret. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Crime Mystery Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors n 54 navarro2018 6 rpeters 3 Elizabeth Jennings z 2 zoroman1975  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}