{"link": "https://www.themoviedb.org/tv/69345?language=en", "title": "Urara Meirocho", "resume": "This is Meiro-machi (Labyrinth Town), the town of fortune-telling. In town, there is a fortune-telling shop called Urara, where girls aspiring to be fortune-tellers come from all over the country. Chiya, who was raised in the mountains, comes to the town with a purpose, but what is it exactly? There, she meets Kon who is always serious, Koume who loves all things western, and the shy Nono. Their fun days of living together as apprentice fortune-tellers are about to begin.", "rate": 46, "genre": ["Animation", "Comedy"], "cast": ["Sayaka Harada", "Kaede Hondo", "Yurika Kubo", "Haruka Yoshimura", "Kayano Ai"], "character": ["Chiya (voice)", "Kon Tatsumi (voice)", "Koume Yukimi (voice)", "Nono Natsume (voice)", "Nina Natsume (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69345   Expand Urara Meirocho   (2017) User Score Overview This is Meiro-machi (Labyrinth Town), the town of fortune-telling. In town, there is a fortune-telling shop called Urara, where girls aspiring to be fortune-tellers come from all over the country. Chiya, who was raised in the mountains, comes to the town with a purpose, but what is it exactly? There, she meets Kon who is always serious, Koume who loves all things western, and the shy Nono. Their fun days of living together as apprentice fortune-tellers are about to begin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sayaka Harada Chiya (voice) Kaede Hondo Kon Tatsumi (voice) Yurika Kubo Koume Yukimi (voice) Haruka Yoshimura Nono Natsume (voice) Kayano Ai Nina Natsume (voice) Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Urara Meirocho premiered on January  6, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Urara Meirocho. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Urara Meirocho. You can help by rating TV shows you've seen. Facts Original Name  うらら迷路帖 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/urara/ Genres Animation Comedy Keywords magic supernatural slice of life seinen anime based on 4-koma Content Score 93 Almost there... Top Contributors 61 Marr 🇳🇱 42 NekoMeowww S 36 Starfinder 23 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}