{"link": "https://www.themoviedb.org/tv/64257?language=en", "title": "The Great Train Robbery", "resume": "8 August 1963: Britain wakes up to news of the biggest robbery in the country’s history. A train has been hijacked and robbed, 35 miles from its arrival in central London. The country is stunned. Who could be behind it? How did they pull off such an audacious raid?", "rate": 68, "genre": ["Drama"], "cast": ["Jim Broadbent", "Luke Evans", "Jack Roth", "Robert Glenister", "Paul Anderson"], "character": ["DCS Tommy Butler", "Bruce Reynolds", "Charlie Wilson", "DI Frank Williams", "Gordon Goody"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64257   Expand The Great Train Robbery   (2013) User Score Overview 8 August 1963: Britain wakes up to news of the biggest robbery in the country’s history. A train has been hijacked and robbed, 35 miles from its arrival in central London. The country is stunned. Who could be behind it? How did they pull off such an audacious raid? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Broadbent DCS Tommy Butler Luke Evans Bruce Reynolds Jack Roth Charlie Wilson Robert Glenister DI Frank Williams Paul Anderson Gordon Goody Full Cast & Crew Last Season Season 1 2013 | 2 Episodes Season 1 of The Great Train Robbery premiered on December 18, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The historic British heist told from two perspectives Open 0 by PT 100\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  9 Recommendations   2015-01-04 The Saboteurs 7.5    1995-09-22 Space: Above and Beyond 6.8  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/programmes/b03mk394 Genres Drama Keywords miniseries britain train robbery Content Score 86 Almost there... Top Contributors TB 44 TMDb Bot 30 Elizabeth Jennings S 6 Sebastian m 5 mario  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}