{"link": "https://www.themoviedb.org/tv/13885?language=en", "title": "Conan the Adventurer", "resume": "Conan the Adventurer is an American-French-Canadian animated television series adaptation of Conan the Barbarian, the literary character created by Robert E. Howard in the 1930s. Produced by Jetlag Productions and Sunbow Productions, the series debuted on September 12, 1992, ran for 65 episodes and concluded on November 22, 1993. The series was developed by Christy Marx who served as the sole story editor. The episode \"A Needle in a Haystack\", written by Jean Chalopin, is considered a lost episode, as it was never released on the complete DVD set for Australia which only included 64 episodes. \" A Needle in a Haystack\" was the show's 33rd episode when it originally aired. It is unclear why this episode was left out of the collection or why this episode is not even listed in most online sources at this time.\nThe series was produced in association with Graz Entertainment for the first 13-episode season; AB Productions and Jean Chalopin's Créativité et Développement for the remaining episodes. The series also spawned a small toyline in 1992 created by Hasbro. This first incarnation of Conan in cartoon form performed much better than its follow-up cartoon, Conan and the Young Warriors, which lasted only 13 episodes.", "rate": 77, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13885   Expand Conan the Adventurer   (1992) User Score Overview Conan the Adventurer is an American-French-Canadian animated television series adaptation of Conan the Barbarian, the literary character created by Robert E. Howard in the 1930s. Produced by Jetlag Productions and Sunbow Productions, the series debuted on September 12, 1992, ran for 65 episodes and concluded on November 22, 1993. The series was developed by Christy Marx who served as the sole story editor. The episode \"A Needle in a Haystack\", written by Jean Chalopin, is considered a lost episode, as it was never released on the complete DVD set for Australia which only included 64 episodes. \" A Needle in a Haystack\" was the show's 33rd episode when it originally aired. It is unclear why this episode was left out of the collection or why this episode is not even listed in most online sources at this time. The series was produced in association with Graz Entertainment for the first 13-episode season; AB Productions and Jean Chalopin's Créativité et Développement for the remaining episodes. The series also spawned a small toyline in 1992 created by Hasbro. This first incarnation of Conan in cartoon form performed much better than its follow-up cartoon, Conan and the Young Warriors, which lasted only 13 episodes. Featured Crew Robert E. Howard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1993 | 52 Episodes Season 2 of Conan the Adventurer premiered on September 13, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2003-02-08 Teenage Mutant Ninja Turtles 6.6    1995-01-29 Hercules: The Legendary Journeys 6.3    1993-09-13 Animaniacs 7.6    1983-09-10 Inspector Gadget 6.6    2002-10-01 Ghost in the Shell: Stand Alone Complex 8.0    1995-09-09 Pinky and the Brain 7.7    1998-11-18 The Powerpuff Girls 7.0    1987-09-10 Teenage Mutant Ninja Turtles 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords conan Content Score 64 We're so close, yet so far. Top Contributors 11 bazoozoo 10 Banana 5 Julien Lefebvre k 1 kedoz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}