{"link": "https://www.themoviedb.org/tv/10141?language=en", "title": "Misfits of Science", "resume": "Misfits of Science is an American superhero fantasy television series that aired on NBC from October 1985 to February 1986. It features super-powered humans and their madcap adventures. A double-length pilot and 15 additional episodes were created; however one episode did not air before the show was cancelled due to low ratings.\nIn France, the series was known as Superminds, and in Germany as Die Spezialisten unterwegs.\nThe name 'Misfits of Science' was the brainchild of the then president of NBC Entertainment, Brandon Tartikoff. Notably, episode 9 was the first paid writing job for Tim Kring who later originated and produced the thematically similar Heroes in 2006.", "rate": 64, "genre": ["Action", "Adventure", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kevin Peter Hall", "Courteney Cox", "Max Wright", "Dean Paul Martin", "Mark Thomas Miller"], "character": ["Dr. Elvin 'El' Lincoln", "Gloria Dinallo", "Dick Stetmeyer", "Dr. Billy Hayes", "John 'Johnny B' Bukowski"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10141   Expand Misfits of Science   (1985) User Score Overview Misfits of Science is an American superhero fantasy television series that aired on NBC from October 1985 to February 1986. It features super-powered humans and their madcap adventures. A double-length pilot and 15 additional episodes were created; however one episode did not air before the show was cancelled due to low ratings. In France, the series was known as Superminds, and in Germany as Die Spezialisten unterwegs. The name 'Misfits of Science' was the brainchild of the then president of NBC Entertainment, Brandon Tartikoff. Notably, episode 9 was the first paid writing job for Tim Kring who later originated and produced the thematically similar Heroes in 2006. Featured Crew Tim Kring Creator James D. Parriott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Peter Hall Dr. Elvin 'El' Lincoln Courteney Cox Gloria Dinallo Max Wright Dick Stetmeyer Dean Paul Martin Dr. Billy Hayes Mark Thomas Miller John 'Johnny B' Bukowski Full Cast & Crew Last Season Season 1 1985 | 17 Episodes Season 1 of Misfits of Science premiered on October  4, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  7 Recommendations   1987-09-26 Jake and the Fatman 4.9    1971-09-14 Cannon 5.6    1974-09-07 Hong Kong Phooey 6.1  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://misfits.jandenauer.com Genres Action & Adventure Comedy Drama Sci-Fi & Fantasy Keywords superhero misfit superhuman Content Score 100 Yes! Looking good! Top Contributors 26 Banana S 13 SunHomeMovie d 10 denis CM 8 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}