{"link": "https://www.themoviedb.org/tv/70028?language=en", "title": "109 Strange Things", "resume": "KDI-109, a male robot from the future, comes to live with Shin Ki Won's family. She is a girl who is studying in the philosophy department.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Choi Tae-joon", "Jung Chae-yeon", "Kim Yong-jin", "Kim Tae-yun"], "character": ["KDI-109 / Baek Ku", "Shin Ki Won", "Kim Yong Jin", "Jang Hyeong Beom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70028   Expand 109 Strange Things   (2017) User Score Overview KDI-109, a male robot from the future, comes to live with Shin Ki Won's family. She is a girl who is studying in the philosophy department. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Tae-joon KDI-109 / Baek Ku Jung Chae-yeon Shin Ki Won Kim Yong-jin Kim Yong Jin Kim Tae-yun Jang Hyeong Beom Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of 109 Strange Things premiered on February  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 109 Strange Things. You can help by rating TV shows you've seen. Facts Original Name  109 별일 다 있네 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  13m Homepage   http://tv.naver.com/kdi109/home Genres Sci-Fi & Fantasy Keywords web series Content Score 71 Just a little bit more... Top Contributors 19 barto 4 empireyura TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}