{"link": "https://www.themoviedb.org/tv/32419?language=en", "title": "Horrible Histories", "resume": "Based on the best-selling children's books and liberally splattered with guts, blood and poo, a group of British comedians offer an anarchic and unconventional take on some of history's most gruesome and funny moments, with topics including the Stone Age, the Middle Ages, the Egyptians and the Romans, among others.", "rate": 87, "genre": ["Comedy"], "cast": ["Ben Willbond", "Mathew Baynton", "Simon Farnaby", "Martha Howe-Douglas", "Jim Howick"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32419   Expand Horrible Histories   (2009) User Score  Play Trailer Overview Based on the best-selling children's books and liberally splattered with guts, blood and poo, a group of British comedians offer an anarchic and unconventional take on some of history's most gruesome and funny moments, with topics including the Stone Age, the Middle Ages, the Egyptians and the Romans, among others. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Willbond Mathew Baynton Simon Farnaby Martha Howe-Douglas Jim Howick Full Cast & Crew Last Season Series 6 2015 | 15 Episodes Season 6 of Horrible Histories premiered on February 13, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations   2012-02-23 Pramface 7.5    1998-01-15 Louis Theroux's Weird Weekends 8.5    2007-08-27 Outnumbered 7.2    2010-12-25 Come Fly With Me 6.6    1999-01-11 The League of Gentlemen 7.4  Facts Status  Returning Series Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/cbbc/horriblehistories/ Genres Comedy Keywords history based on children's book sketch comedy british history british humour anarchic comedy Content Score 93 Almost there... Top Contributors 25 Elizabeth Jennings e 10 erinnny 9 Banana t 6 taxigps  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}