{"link": "https://www.themoviedb.org/tv/1454?language=en", "title": "Hero", "resume": "Kohei Kuryu is a former juvenile delinquent who drops out of junior high and goes on to earn a high school equivalency diploma. After passing the law board exams, Kuryu becomes a prosecutor. Not your typical prosecutor, which is quickly seen through the clothes that he wears, Kuryu possesses quick instincts and a kind of cleverness that only someone raised on the streets could have. \nMaiko Amamiya is a shrewd public prosecutor who has her eyes set on passing the exam to become a deputy prosecutor and tries her best to be noticed by her boss. Kuryu, on the other hand, after earning a reputation for doing top-notch work, is transferred to Amamiya's division, and finally opens his eyes to the possibility of promotion. Unfortunately, his unprecedented work behavior abruptly brings things to a halt. \nAlthough earning a reputation as a bad apple, the influence from Kuryu's strong pursuit of justice slowly begins to change things around him.", "rate": 84, "genre": ["Drama"], "cast": ["Takuya Kimura", "Takako Matsu", "Nene Otsuka", "Bokuzō Masana", "Hajime Okayama"], "character": ["Kuryu Kohei", "Maiko Amamiya", "Misuzu Nakamura", "Suji Ito", "Otsuka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1454   Expand Hero   (2001) User Score Overview Kohei Kuryu is a former juvenile delinquent who drops out of junior high and goes on to earn a high school equivalency diploma. After passing the law board exams, Kuryu becomes a prosecutor. Not your typical prosecutor, which is quickly seen through the clothes that he wears, Kuryu possesses quick instincts and a kind of cleverness that only someone raised on the streets could have.  Maiko Amamiya is a shrewd public prosecutor who has her eyes set on passing the exam to become a deputy prosecutor and tries her best to be noticed by her boss. Kuryu, on the other hand, after earning a reputation for doing top-notch work, is transferred to Amamiya's division, and finally opens his eyes to the possibility of promotion. Unfortunately, his unprecedented work behavior abruptly brings things to a halt.  Although earning a reputation as a bad apple, the influence from Kuryu's strong pursuit of justice slowly begins to change things around him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Kimura Kuryu Kohei Takako Matsu Maiko Amamiya Nene Otsuka Misuzu Nakamura Bokuzō Masana Suji Ito Hajime Okayama Otsuka Full Cast & Crew Last Season Season 2 2014 | 11 Episodes Season 2 of Hero premiered on July 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2013-04-06 Attack on Titan 7.6    2011-04-17 Game of Thrones 8.2  Facts Original Name  ヒーロー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 87 Aka75 31 Elizabeth Jennings c 8 ctchim s 6 sblunico  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}