{"link": "https://www.themoviedb.org/tv/61508?language=en", "title": "Benched", "resume": "Nina is a dedicated, career driven corporate attorney who has a very public nervous breakdown after getting passed up for an expected promotion and now finds herself working as a public defender. Her personal and professional worlds are turned upside down when she joins the ranks of the legal world’s underdogs and very quickly realizes that the law isn't quite as fair as she once thought.", "rate": 64, "genre": ["Comedy"], "cast": ["Eliza Coupe", "Jay Harrington", "Carter MacIntyre", "Oscar Nunez", "Jolene Purdy"], "character": ["Nina", "Phil", "Trent", "Carlos", "Micah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61508   Expand Benched   (2014) User Score  Play Trailer Overview Nina is a dedicated, career driven corporate attorney who has a very public nervous breakdown after getting passed up for an expected promotion and now finds herself working as a public defender. Her personal and professional worlds are turned upside down when she joins the ranks of the legal world’s underdogs and very quickly realizes that the law isn't quite as fair as she once thought. Featured Crew Michaela Watkins Creator Damon Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eliza Coupe Nina Jay Harrington Phil Carter MacIntyre Trent Oscar Nunez Carlos Jolene Purdy Micah Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Benched premiered on October 28, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2016-06-08 Power Monkeys 7.0    2006-01-01 In Justice 6.8    2004-07-19 The Grid 7.0    2015-04-15 The Delivery Man 6.5    2011-01-13 Kidnap and Ransom 7.6    2011-05-02 Case Sensitive 5.4    2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.usanetwork.com/benched Genres Comedy Keywords lawyer Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings c 10 crkvice 6 United600 5 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}