{"link": "https://www.themoviedb.org/tv/40058?language=en", "title": "Dynamo: Magician Impossible", "resume": "Dynamo: Magician Impossible is a fly on the wall documentary series which follows the life of English magician/illusionist Steven Frayne, better known as Dynamo. The show is produced by Phil McIntyre Productions and Inner Circle Films for UKTV channel Watch and Universal Networks International. In 2012, the show was shortlisted at the 17th National Television Awards for Best Entertainment Programme but lost to Michael McIntyre's Comedy Roadshow.\nThe four-episode first series aired from 7 July 2011 until 28 July 2011, with a fifth episode on 28 December 2011. On 1 February 2012, Watch renewed Dynamo: Magician Impossible for a second and third series. The second series premiered on 5 July 2012 and lasted another four episodes, ending on 26 July 2012. The third series aired on 11 July 2013 and concluded on 1 August 2013.", "rate": 67, "genre": ["Documentary"], "cast": ["Dynamo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40058   Expand Dynamo: Magician Impossible   (2011) User Score  Play Trailer Overview Dynamo: Magician Impossible is a fly on the wall documentary series which follows the life of English magician/illusionist Steven Frayne, better known as Dynamo. The show is produced by Phil McIntyre Productions and Inner Circle Films for UKTV channel Watch and Universal Networks International. In 2012, the show was shortlisted at the 17th National Television Awards for Best Entertainment Programme but lost to Michael McIntyre's Comedy Roadshow. The four-episode first series aired from 7 July 2011 until 28 July 2011, with a fifth episode on 28 December 2011. On 1 February 2012, Watch renewed Dynamo: Magician Impossible for a second and third series. The second series premiered on 5 July 2012 and lasted another four episodes, ending on 26 July 2012. The third series aired on 11 July 2013 and concluded on 1 August 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dynamo Full Cast & Crew Last Season Season 4 2014 | 4 Episodes Season 4 of Dynamo: Magician Impossible premiered on September  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dynamo: Magician Impossible. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m, 40m Homepage   http://www.uktv.co.uk/watch/homepage/sid/8829 Genres Documentary Keywords magic card trick magic show tricks illusion mentalism illusionist card manipulation conjuring illusionism Content Score 64 We're so close, yet so far. Top Contributors C 39 Cataloguer a 9 alexcel d 9 denis 6 Atanas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}