{"link": "https://www.themoviedb.org/tv/31578?language=en", "title": "Samurai Banners", "resume": "Fūrin Kazan was the 46th NHK Taiga drama beginning on January 7, 2007. It was aired throughout 2007.\nThe four characters from left to right are wind, woods, fire, and mountain. The title is a reference to the war banner used by Takeda Shingen, which in turn was taken from Sun Tzu's The Art of War. It means \"Swift as the Wind, Silent as a Forest, Fierce as Fire and Immovable as a Mountain.\"", "rate": 0, "genre": ["Drama"], "cast": ["Tatsuya Nakadai", "Sukekiyo Kameyama", "Gackt Camui", "Misa Shimizu", "Miyoko Asada"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31578   Expand Samurai Banners   (2007) User Score Overview Fūrin Kazan was the 46th NHK Taiga drama beginning on January 7, 2007. It was aired throughout 2007. The four characters from left to right are wind, woods, fire, and mountain. The title is a reference to the war banner used by Takeda Shingen, which in turn was taken from Sun Tzu's The Art of War. It means \"Swift as the Wind, Silent as a Forest, Fierce as Fire and Immovable as a Mountain.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tatsuya Nakadai Sukekiyo Kameyama Gackt Camui Misa Shimizu Miyoko Asada Full Cast & Crew Last Season Season 2 2007 | 4 Episodes Season 2 of Samurai Banners premiered on December 31, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Samurai Banners. You can help by rating TV shows you've seen. Facts Original Name  風林火山 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Keywords taiga drama Content Score 86 Almost there... Top Contributors A 5 Aka75 3 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}