{"link": "https://www.themoviedb.org/tv/71446?language=en", "title": "Money Heist", "resume": "To carry out the biggest heist in history, a mysterious man called The Professor recruits a band of eight robbers who have a single characteristic: none of them has anything to lose. Five months of seclusion - memorizing every step, every detail, every probability - culminate in eleven days locked up in the National Coinage and Stamp Factory of Spain, surrounded by police forces and with dozens of hostages in their power, to find out whether their suicide wager will lead to everything or nothing.", "rate": 81, "genre": ["Crime", "Drama"], "cast": ["Úrsula Corberó", "Itziar Ituño", "Álvaro Morte", "Paco Tous", "Pedro Alonso"], "character": ["Tokyo (Silene Oliviera)", "Raquel Murillo", "The Professor / Salvador \"Salva\" Martin (Sergio Marquina)", "Moscow (Agustin Ramos)", "Berlin (Andres de Fonollosa)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71446   Expand Money Heist   (2017) User Score  Play Trailer Overview To carry out the biggest heist in history, a mysterious man called The Professor recruits a band of eight robbers who have a single characteristic: none of them has anything to lose. Five months of seclusion - memorizing every step, every detail, every probability - culminate in eleven days locked up in the National Coinage and Stamp Factory of Spain, surrounded by police forces and with dozens of hostages in their power, to find out whether their suicide wager will lead to everything or nothing. Featured Crew Álex Pina Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  27 Images Backdrops  30 Posters  7 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Úrsula Corberó Tokyo (Silene Oliviera) Itziar Ituño Raquel Murillo Álvaro Morte The Professor / Salvador \"Salva\" Martin (Sergio Marquina) Paco Tous Moscow (Agustin Ramos) Pedro Alonso Berlin (Andres de Fonollosa) Full Cast & Crew Last Season Original Air Date Original Air Date Netflix (Digital) Season 1 2017 | 15 Episodes View All Seasons Social Reviews  0 Discussions  31 Subject Status Replies Last Reply I'm three episodes in...should I keep going? Open 0 by Daddie0\n      \n     Does Anyone Know These 2 Actors And This Actress? [Spoilers] Open 4 by  janar [Spoilers]  How come last 6 episodes are just cliche factory? [Spoilers] Open 2 by  janar Go to Discussions Media Most Popular Videos  2 Backdrops  30 Posters  7 Recommendations   2017-09-04 The Mantis 6.4    2014-01-14 Friday Night Tykes 6.8    2006-03-13 Canada's Worst Handyman 5.0    2016-08-19 Fearless 7.0    2017-11-17 Shot in the Dark 7.4    2017-12-01 Dark 7.9    2014-01-02 The Assets 7.2    2017-08-01 Manhunt: Unabomber 7.8  Facts Original Name  La casa de papel Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Spanish; Castilian Runtime  70m Homepage   http://www.antena3.com/series/casa-de-papel Genres Crime Drama Keywords stockholm syndrome perfect crime heist flashback sequence sexual tension bank robbery hostage situation digging a tunnel Content Score 100 Yes! Looking good! Top Contributors 387 janar 76 leosonic256 22 Remon Kamel A 21 AntonGhost  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}