{"link": "https://www.themoviedb.org/tv/41132?language=en", "title": "Mord mit Aussicht", "resume": "Mord mit Aussicht is a German satirical crime comedy television series, produced by ARD, following the adventures of Sophie Haas, a detective from the city that takes a job in the fictional country village of Hengasch. Much of the humour of the series derives from the clichés of both city and provincial lives, in a similar manner to the English comedy crime series Midsomer Murders.", "rate": 73, "genre": ["Comedy", "Crime"], "cast": ["Caroline Peters", "Bjarne Mädel", "Michael Hanemann", "Hans Peter Hallwachs", "Petra Kleinert"], "character": ["Kriminaloberkommissarin Sophie Haas", "Polizeiobermeister Dietmar Schäffer", "Hans Zielonka", "Hannes Haas", "Heike Schäffer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41132   Expand Mord mit Aussicht   (2008) User Score Overview Mord mit Aussicht is a German satirical crime comedy television series, produced by ARD, following the adventures of Sophie Haas, a detective from the city that takes a job in the fictional country village of Hengasch. Much of the humour of the series derives from the clichés of both city and provincial lives, in a similar manner to the English comedy crime series Midsomer Murders. Featured Crew Marie Reiners Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Caroline Peters Kriminaloberkommissarin Sophie Haas Bjarne Mädel Polizeiobermeister Dietmar Schäffer Michael Hanemann Hans Zielonka Hans Peter Hallwachs Hannes Haas Petra Kleinert Heike Schäffer Full Cast & Crew Last Season Season 3 2014 | 13 Episodes Season 3 of Mord mit Aussicht premiered on September  9, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Mord mit Aussicht. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2015-09-03 Sedwitz 8.0    2012-09-18 Braunschlag 8.5    2005-09-09 Pastewka 8.0    2011-12-23 Crime Scene Cleaner 7.8    2016-08-19 Jean-Claude Van Johnson 7.0    2004-10-11 Stromberg 6.8    2015-06-17 Deutschland 83 7.7    1970-11-29 Scene of the Crime 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  44m Homepage  - Genres Comedy Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 32 Samara M 7 Mec!as 6 Joe Carson s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}