{"link": "https://www.themoviedb.org/tv/12146?language=en", "title": "Shelley", "resume": "Shelley is a British sitcom made by Thames Television and originally broadcast on ITV from 12 July 1979 to 12 January 1984 and from 11 October 1988 to 1 September 1992. Starred Hywel Bennett as James Shelley, originally 28 years old and a sardonic, perpetually unemployed anti-establishment 'freelance layabout' with a doctoral degree. In the original run, Belinda Sinclair played Shelley's girlfriend Fran, and Josephine Tewson appeared regularly as his Landlady, Edna Hawkins. The series was created by Peter Tilbury who also wrote the first three series. The scripts for subsequent episodes were by Andy Hamilton and Guy Jenkin, Colin Bostock-Smith, David Frith, Bernard McKenna and Barry Pilton. All 71 episodes were produced and directed by Anthony Parker.\nSeries seven was titled on screen The return of Shelley, and was broadcast in 1988. This time round, Shelley is separated from Fran, and lives on his own, doing his best to avoid obtaining gainful employment. The series begins with Shelley returning to the UK from Saudi Arabia, where he had taught English for a few years, only to find that his calls to his old friends are now screened by answer phones and that yuppieness has taken root in his old neighbourhood. The final three series returned to the on-screen title of Shelley.", "rate": 100, "genre": ["Comedy"], "cast": ["Josephine Tewson", "Samantha Beckinsale", "Garfield Morgan", "Warren Clarke", "Hywel Bennett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12146   Expand Shelley   (1979) User Score Overview Shelley is a British sitcom made by Thames Television and originally broadcast on ITV from 12 July 1979 to 12 January 1984 and from 11 October 1988 to 1 September 1992. Starred Hywel Bennett as James Shelley, originally 28 years old and a sardonic, perpetually unemployed anti-establishment 'freelance layabout' with a doctoral degree. In the original run, Belinda Sinclair played Shelley's girlfriend Fran, and Josephine Tewson appeared regularly as his Landlady, Edna Hawkins. The series was created by Peter Tilbury who also wrote the first three series. The scripts for subsequent episodes were by Andy Hamilton and Guy Jenkin, Colin Bostock-Smith, David Frith, Bernard McKenna and Barry Pilton. All 71 episodes were produced and directed by Anthony Parker. Series seven was titled on screen The return of Shelley, and was broadcast in 1988. This time round, Shelley is separated from Fran, and lives on his own, doing his best to avoid obtaining gainful employment. The series begins with Shelley returning to the UK from Saudi Arabia, where he had taught English for a few years, only to find that his calls to his old friends are now screened by answer phones and that yuppieness has taken root in his old neighbourhood. The final three series returned to the on-screen title of Shelley. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josephine Tewson Samantha Beckinsale Garfield Morgan Warren Clarke Hywel Bennett Full Cast & Crew Last Season Season 10 1992 | 6 Episodes Season 10 of Shelley premiered on July 28, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shelley. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords anti establishment unemployed british humour Content Score 86 Almost there... Top Contributors O 5 Ozbourne TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}