{"link": "https://www.themoviedb.org/tv/72677?language=en", "title": "Mobile Suit Gundam 0083: Stardust Memory", "resume": "It is the year 0083 of the Universal Century. The rebellious Principality of Zeon has been defeated in the One Year War by the Earth Federation. However, a faction of Zeon remnants led by Aguille Delaz fled from the final battle, hiding themselves away. After three long years, they attempt to rise up once more, sending Delaz’s ace pilot, Anavel Gato, to infiltrate a Federation research base to steal one of two secretly developed prototype Gundams along with its deadly nuclear warhead.\nThreatened by the rogue Gundam suit and seeking to retain peace, the Earth Federation mobilizes the newly developed Albion carrier to recover the stolen unit. Manned by the remaining test pilots, with rookie pilot Kou Uraki piloting the remaining prototype Gundam, the Albion and her crew are determined to stop Gato, retake the stolen Gundam, and prevent the Zeon remnants from starting another war.", "rate": 70, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Ryou Horikawa", "Akio Otsuka", "Rei Sakuma", "Kiyoshi Kobayashi", "Mari Mashiba"], "character": ["Kou Uraki", "Anavel Gato", "Nina Purpleton", "Aiguille Delaz", "Cima Garahau"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72677   Expand Mobile Suit Gundam 0083: Stardust Memory   (1991) User Score Overview It is the year 0083 of the Universal Century. The rebellious Principality of Zeon has been defeated in the One Year War by the Earth Federation. However, a faction of Zeon remnants led by Aguille Delaz fled from the final battle, hiding themselves away. After three long years, they attempt to rise up once more, sending Delaz’s ace pilot, Anavel Gato, to infiltrate a Federation research base to steal one of two secretly developed prototype Gundams along with its deadly nuclear warhead. Threatened by the rogue Gundam suit and seeking to retain peace, the Earth Federation mobilizes the newly developed Albion carrier to recover the stolen unit. Manned by the remaining test pilots, with rookie pilot Kou Uraki piloting the remaining prototype Gundam, the Albion and her crew are determined to stop Gato, retake the stolen Gundam, and prevent the Zeon remnants from starting another war. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryou Horikawa Kou Uraki Akio Otsuka Anavel Gato Rei Sakuma Nina Purpleton Kiyoshi Kobayashi Aiguille Delaz Mari Mashiba Cima Garahau Full Cast & Crew Last Season Season 1 1991 | 13 Episodes Season 1 of Mobile Suit Gundam 0083: Stardust Memory premiered on May 23, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam 0083: Stardust Memory. You can help by rating TV shows you've seen. Facts Original Name  機動戦士ガンダム0083 STARDUST MEMORY Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.gundam0083.net/ Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 22 YabukiJoe1 S 13 SolarMaster 5 Elizabeth Jennings w 4 wyxslh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}