{"link": "https://www.themoviedb.org/tv/164?language=en", "title": "Dark Skies", "resume": "Dark Skies is an American UFO conspiracy theory-based sci-fi television series that aired from the 1996 to 1997 season for 18 episodes, plus a two-hour pilot episode. The success of The X-Files on Fox proved there was an audience for science fiction shows, resulting in NBC commissioning this proposed competitor following a pitch from producers Bryce Zabel and Brent Friedman. The series debuted September 21, 1996 on NBC, and was later rerun by the Sci-Fi Channel. Its tagline was \"History as we know it is a lie.\"", "rate": 76, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Tim Kelleher", "Eric Close", "Megan Ward", "Jeri Ryan", "J.T. Walsh"], "character": ["Jim Steele", "John Loengard", "Kimberly Sayers", "Juliet Stuart", "Frank Bach"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 164   Expand Dark Skies   (1996) User Score Overview Dark Skies is an American UFO conspiracy theory-based sci-fi television series that aired from the 1996 to 1997 season for 18 episodes, plus a two-hour pilot episode. The success of The X-Files on Fox proved there was an audience for science fiction shows, resulting in NBC commissioning this proposed competitor following a pitch from producers Bryce Zabel and Brent Friedman. The series debuted September 21, 1996 on NBC, and was later rerun by the Sci-Fi Channel. Its tagline was \"History as we know it is a lie.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Kelleher Jim Steele Eric Close John Loengard Megan Ward Kimberly Sayers Jeri Ryan Juliet Stuart J.T. Walsh Frank Bach Full Cast & Crew Last Season Season 1 1996 | 19 Episodes Season 1 of Dark Skies premiered on September 20, 1996. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of the best sci-Fi shows of the 90's Open 0 by Irina\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1986-10-06 The Trap Door 7.3    1987-09-13 The New Statesman 7.9    1996-05-26 Cold Lazarus 7.3    1978-04-02 Dallas 6.1    1964-09-18 The Addams Family 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m, 44m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords alien conspiracy theory alternate history alien invasion Content Score 86 Almost there... Top Contributors 11 Banana w 9 webmaster 3 Damien Haynes 2 luftikus009  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}