{"link": "https://www.themoviedb.org/tv/68866?language=en", "title": "Beauty Private Kitchen", "resume": "Song Yu Die, a renowned chef in the Jiangnan area, was actually a lost Song Dynasty princess. She grew up among the commoners and learned her trade from her adoptive mother. Just when she was about to marry her childhood sweetheart, she got entangled in a warfare between a Song prince and a Jin general. To settle the conflicts between the two countries, she left her beloved to marry her country's enemy.", "rate": 34, "genre": ["Drama"], "cast": ["Zheng Shuang", "Ma Tianyu"], "character": ["Song Yu Die", "Li Ma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68866   Expand Beauty Private Kitchen   (2016) User Score Overview Song Yu Die, a renowned chef in the Jiangnan area, was actually a lost Song Dynasty princess. She grew up among the commoners and learned her trade from her adoptive mother. Just when she was about to marry her childhood sweetheart, she got entangled in a warfare between a Song prince and a Jin general. To settle the conflicts between the two countries, she left her beloved to marry her country's enemy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zheng Shuang Song Yu Die Ma Tianyu Li Ma Full Cast & Crew Last Season Season 1 2016 | 50 Episodes Season 1 of Beauty Private Kitchen premiered on December  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Beauty Private Kitchen. You can help by rating TV shows you've seen. Facts Original Name  美人私房菜 Status  Ended Network Anhui Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china romance Content Score 56 We're so close, yet so far. Top Contributors M 32 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}