{"link": "https://www.themoviedb.org/tv/44821?language=en", "title": "Faith", "resume": "Faith is a 2012 South Korean fusion fantasy-historical-medical television series broadcast by SBS from August 13 to October 30, 2012 on Mondays and Tuesdays at 21:55 for 24 episodes. It is about a modern-day plastic surgeon who gets kidnapped and travels back in time to the Goryeo period, 700 years in the past. There, she meets and falls in love with a warrior who is the leader of the royal guard.", "rate": 76, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kim Hee-seon", "Lee Min-ho", "Yu Oh-seong", "Sung Hoon", "Ryu Deok-hwan"], "character": ["Yoo Eun-soo", "Choi Young", "Ki Chul", "Chun Eum-ja", "King Gongmin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44821   Expand Faith   (2012) User Score Overview Faith is a 2012 South Korean fusion fantasy-historical-medical television series broadcast by SBS from August 13 to October 30, 2012 on Mondays and Tuesdays at 21:55 for 24 episodes. It is about a modern-day plastic surgeon who gets kidnapped and travels back in time to the Goryeo period, 700 years in the past. There, she meets and falls in love with a warrior who is the leader of the royal guard. Featured Crew Kim Jong Hak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hee-seon Yoo Eun-soo Lee Min-ho Choi Young Yu Oh-seong Ki Chul Sung Hoon Chun Eum-ja Ryu Deok-hwan King Gongmin Full Cast & Crew Last Season Season 1 2012 | 24 Episodes Season 1 of Faith premiered on August 13, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2012-03-21 Rooftop Prince 8.1    2014-04-30 A New Leaf 7.7    2014-12-08 Healer 8.7    2015-02-16 Blood 7.0    2010-03-31 Personal Taste 7.4    2011-05-09 Lie To Me 7.6    2014-06-25 The Joseon Gunman 6.3    2012-09-12 The Innocent Man 8.8  Facts Original Name  신의 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://wizard2.sbs.co.kr/greatdoctor/ Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords time travel romance korea Content Score 93 Almost there... Top Contributors M 26 Maria180493 CM 17 Cherche Moi z 10 zurman1 p 8 ppreethi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}