{"link": "https://www.themoviedb.org/tv/879?language=en", "title": "All My Children", "resume": "All My Children is an American television soap opera that aired on ABC for 41 years, from January 5, 1970 to September 23, 2011, and on The Online Network since April 29, 2013 via Hulu, Hulu Plus, and iTunes. Created by Agnes Nixon, All My Children is set in Pine Valley, Pennsylvania, a fictitious suburb of Philadelphia which is modeled on the actual Philadelphia suburb of Rosemont. The original series featured Susan Lucci as Erica Kane, one of daytime's most popular characters. The title of the series refers to the bonds of humanity. All My Children was the first new network daytime drama to debut in the 1970s. Originally owned by Creative Horizons, Inc., the company created by Nixon and her husband, Bob, the show was sold to ABC in January 1975. The series started at a half-hour in per-installment length, then was expanded to a full hour on April 25, 1977. Earlier, the show had experimented with the full-hour format for one week starting on June 30, 1975, after which Ryan's Hope premiered.\nFrom 1970 to 1990, All My Children was recorded at ABC's TV18 at 101 West 67th St, now a 50-story apartment tower. From March 1990 to December 2009, it was taped at ABC's television studio TV23 at 320 West 66th Street in Manhattan, New York City, New York. In December 2009, the locale for taping the series moved from the costly New York City to California. The show was then produced in Stages 1 and 2 at the Andrita Studios in Los Angeles, California, and is now produced at the Connecticut Film Center in Stamford, Connecticut. All My Children started taping in high definition on January 4, 2010 and began airing in high definition on February 3, 2010. All My Children became the third soap opera to be produced and broadcast in high definition.", "rate": 50, "genre": [], "cast": ["Cameron Mathison", "Michael E. Knight", "Alicia Minshew", "Susan Lucci", "Jacob Young"], "character": ["Ryan Lavery", "Tad Martin", "Kendall Hart", "Jane Campbell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 879   Expand All My Children   (1970) User Score Overview All My Children is an American television soap opera that aired on ABC for 41 years, from January 5, 1970 to September 23, 2011, and on The Online Network since April 29, 2013 via Hulu, Hulu Plus, and iTunes. Created by Agnes Nixon, All My Children is set in Pine Valley, Pennsylvania, a fictitious suburb of Philadelphia which is modeled on the actual Philadelphia suburb of Rosemont. The original series featured Susan Lucci as Erica Kane, one of daytime's most popular characters. The title of the series refers to the bonds of humanity. All My Children was the first new network daytime drama to debut in the 1970s. Originally owned by Creative Horizons, Inc., the company created by Nixon and her husband, Bob, the show was sold to ABC in January 1975. The series started at a half-hour in per-installment length, then was expanded to a full hour on April 25, 1977. Earlier, the show had experimented with the full-hour format for one week starting on June 30, 1975, after which Ryan's Hope premiered. From 1970 to 1990, All My Children was recorded at ABC's TV18 at 101 West 67th St, now a 50-story apartment tower. From March 1990 to December 2009, it was taped at ABC's television studio TV23 at 320 West 66th Street in Manhattan, New York City, New York. In December 2009, the locale for taping the series moved from the costly New York City to California. The show was then produced in Stages 1 and 2 at the Andrita Studios in Los Angeles, California, and is now produced at the Connecticut Film Center in Stamford, Connecticut. All My Children started taping in high definition on January 4, 2010 and began airing in high definition on February 3, 2010. All My Children became the third soap opera to be produced and broadcast in high definition. Featured Crew Agnes Nixon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cameron Mathison Ryan Lavery Michael E. Knight Tad Martin Alicia Minshew Kendall Hart Susan Lucci Jane Campbell Jacob Young Full Cast & Crew Last Season season 42 — | 174 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on All My Children. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/daytime/allmychildren Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 13 t0by z 10 zurman1 4 Banana D 3 Denys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}