{"link": "https://www.themoviedb.org/tv/70117?language=en", "title": "Super Family", "resume": "Chun-Il is married to Ra-Yeon and they have a daughter Ik-Hee. Chun-Il works as a salaryman and tries to survive at his company. Ra-Yeon is worried about her husband's low salary and Ik-Hee going through adolescence.", "rate": 10, "genre": ["Drama", "Comedy"], "cast": ["Park Hyuk-kwon", "Park Sun-young", "Kim Ji-Min", "Uhm Hyo-sup", "Park Hee-von"], "character": ["Na Chun-Il", "Maeng Ra-Yeon", "Na Ik-Hee", "Choi Suk-Moon", "Ahn Jung-Min"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70117   Expand Super Family   (2017) User Score Overview Chun-Il is married to Ra-Yeon and they have a daughter Ik-Hee. Chun-Il works as a salaryman and tries to survive at his company. Ra-Yeon is worried about her husband's low salary and Ik-Hee going through adolescence. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Hyuk-kwon Na Chun-Il Park Sun-young Maeng Ra-Yeon Kim Ji-Min Na Ik-Hee Uhm Hyo-sup Choi Suk-Moon Park Hee-von Ahn Jung-Min Full Cast & Crew Last Season Season 1 2017 | 22 Episodes Season 1 of Super Family premiered on February 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Super Family. You can help by rating TV shows you've seen. Facts Original Name  초인가족 2017 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000010160 Genres Drama Comedy Keywords korea sitcom Content Score 86 Almost there... Top Contributors M 34 Maria180493 7 Danu t 3 turnmind 2 UniqueStream  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}