{"link": "https://www.themoviedb.org/tv/5857?language=en", "title": "Macross Frontier", "resume": "Macross Frontier is a Japanese animated science fiction space drama that aired in Japan on MBS from April 3, 2008 to September 25, 2008. It is the most recent Japanese anime television series set in the Macross universe. Animated by Satelight, premiered Japan on MBS on April 3, 2008. A pre-broadcast airing, called Macross Frontier Deculture Edition or Macross Special Edition, showcasing a preview version of the first episode was aired on December 23, 2007. The series also received its satellite television premiere in Japan on Animax on April 7, 2008. There are rumors of a possible official English release by Funimation.\nMacross Frontier is the story of a human space colony fleet trying to find a habitable planet near the center of the Milky Way Galaxy. The story focuses on three young adults and the events that occur around them as the fleet faces a crisis of alien origin.", "rate": 70, "genre": ["Animation", "Action", "Adventure"], "cast": ["Kenta Miyake", "Katsuyuki Konishi", "Sanae Kobayashi", "Tomomichi Nishimura", "Hiroshi Kamiya"], "character": ["Bobby Margo", "Ozma Lee", "Catherine Glass", "Howard Glass", "Michael Blanc"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5857   Expand Macross Frontier   (2008) User Score Overview Macross Frontier is a Japanese animated science fiction space drama that aired in Japan on MBS from April 3, 2008 to September 25, 2008. It is the most recent Japanese anime television series set in the Macross universe. Animated by Satelight, premiered Japan on MBS on April 3, 2008. A pre-broadcast airing, called Macross Frontier Deculture Edition or Macross Special Edition, showcasing a preview version of the first episode was aired on December 23, 2007. The series also received its satellite television premiere in Japan on Animax on April 7, 2008. There are rumors of a possible official English release by Funimation. Macross Frontier is the story of a human space colony fleet trying to find a habitable planet near the center of the Milky Way Galaxy. The story focuses on three young adults and the events that occur around them as the fleet faces a crisis of alien origin. Featured Crew Shoji Kawamori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenta Miyake Bobby Margo Katsuyuki Konishi Ozma Lee Sanae Kobayashi Catherine Glass Tomomichi Nishimura Howard Glass Hiroshi Kamiya Michael Blanc Full Cast & Crew Last Season Season 1 2008 | 25 Episodes Season 1 of Macross Frontier premiered on April  3, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Macross Frontier. You can help by rating TV shows you've seen. Facts Original Name  マクロス Frontier Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 12 BrerFox 5 Marr 🇳🇱 5 TenmaWorks b 4 blazingcd  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}