{"link": "https://www.themoviedb.org/tv/44217?language=en", "title": "Vikings", "resume": "Vikings follows the adventures of Ragnar Lothbrok, the greatest hero of his age. The series tells the sagas of Ragnar's band of Viking brothers and his family, as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods. Legend has it that he was a direct descendant of Odin, the god of war and warriors.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": ["Travis Fimmel", "Alex Høgh Andersen", "Katheryn Winnick", "Alexander Ludwig", "Jordan Patrick Smith"], "character": ["Ragnar Lothbrok", "Ivar", "Lagertha Lothbrok", "Bjorn Lothbrok", "Ubbe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44217   Expand Vikings   (2013) User Score  Play Trailer Overview Vikings follows the adventures of Ragnar Lothbrok, the greatest hero of his age. The series tells the sagas of Ragnar's band of Viking brothers and his family, as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods. Legend has it that he was a direct descendant of Odin, the god of war and warriors. Featured Crew Michael Hirst Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  13 Content Issues  5 Images Backdrops  45 Posters  51 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Travis Fimmel Ragnar Lothbrok Alex Høgh Andersen Ivar Katheryn Winnick Lagertha Lothbrok Alexander Ludwig Bjorn Lothbrok Jordan Patrick Smith Ubbe Full Cast & Crew Current Season Season 5 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  21 Subject Status Replies Last Reply Do you think the show is done without... (spoilers) Open 35 by  Invidia SPOILERS: Will LAGERTHA get a NEW LOVER???/  QUESTIONS RE: THE MESSAGE and a PREDICTION Open 12 by  Invidia I'm Ivar the Boneless I can't die Open 5 by  Invidia Go to Discussions Media Most Popular Videos  1 Backdrops  45 Posters  51 Recommendations   2010-01-22 Spartacus 7.8    2008-09-03 Sons of Anarchy 7.8    2011-10-02 Homeland 7.3    2015-04-10 Marvel's Daredevil 7.7    2013-02-01 House of Cards 8.2    2006-10-01 Dexter 8.0    2014-01-25 Black Sails 7.1    2014-01-12 True Detective 8.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m, 60m Homepage   http://www.history.com/shows/vikings Genres Action & Adventure Drama Keywords scandinavia viking historical fiction violence middle ages norse mythology historical drama warrior Content Score 100 Yes! Looking good! Top Contributors 158 Elizabeth Jennings 80 Apollo 35 niqo19 31 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}