{"link": "https://www.themoviedb.org/tv/11988?language=en", "title": "Cimarron Strip", "resume": "Cimarron Strip is an American Western television series that aired on CBS from September 1967 to March 1968. Starring Stuart Whitman as Marshal Jim Crown, the series was produced by the creators of Gunsmoke. Reruns of the original show were aired in the summer of 1971.\nCimarron Strip was one of only three 90-minute weekly Western series that aired during the 1960s, and the only 90-minute series of any kind to be centered primarily around one lead character. Cimarron Strip was set in the Oklahoma Panhandle, which comprises, east to west, Beaver, Texas, and Cimarron counties in Oklahoma. The show is set in 1888, just as the continuous frontier of the West, which once ran from the Canadian to the Mexican border, was closing. In less than five years there would no longer be that \"continuous frontier,\" only pockets of undeveloped land. This was the late \"Wild West\" that Marshall Jim Crown was called to defend.", "rate": 0, "genre": ["Western", "Action", "Adventure"], "cast": ["Stuart Whitman", "Randy Boone", "Percy Herbert", "Jill Townsend"], "character": ["Marshall Jim Crown", "Francis Wilde", "Mac Gregor", "Dulcey Coopersmith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11988   Expand Cimarron Strip   (1967) User Score Overview Cimarron Strip is an American Western television series that aired on CBS from September 1967 to March 1968. Starring Stuart Whitman as Marshal Jim Crown, the series was produced by the creators of Gunsmoke. Reruns of the original show were aired in the summer of 1971. Cimarron Strip was one of only three 90-minute weekly Western series that aired during the 1960s, and the only 90-minute series of any kind to be centered primarily around one lead character. Cimarron Strip was set in the Oklahoma Panhandle, which comprises, east to west, Beaver, Texas, and Cimarron counties in Oklahoma. The show is set in 1888, just as the continuous frontier of the West, which once ran from the Canadian to the Mexican border, was closing. In less than five years there would no longer be that \"continuous frontier,\" only pockets of undeveloped land. This was the late \"Wild West\" that Marshall Jim Crown was called to defend. Featured Crew Christopher Knopf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stuart Whitman Marshall Jim Crown Randy Boone Francis Wilde Percy Herbert Mac Gregor Jill Townsend Dulcey Coopersmith Full Cast & Crew Last Season Season 1 1967 | 23 Episodes Season 1 of Cimarron Strip premiered on September  7, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cimarron Strip. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  72m, 90m Homepage  - Genres Western Action & Adventure Keywords u.s. marshal wild west 19th century Content Score 93 Almost there... Top Contributors 15 Banana 1 Axholio 1 Karl Dietz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}