{"link": "https://www.themoviedb.org/tv/66623?language=en", "title": "Maya & Marty", "resume": "Within comedy circles, Maya Rudolph and Martin Short are considered two of the best sketch performers in the business. This series will feature sketches that spoof current events, celebrities and topical trends, as well as musical performances.", "rate": 59, "genre": ["Comedy"], "cast": ["Maya Rudolph", "Martin Short", "Kenan Thompson"], "character": ["Herself - Host", "Himself - Host", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66623   Expand Maya & Marty   (2016) User Score Overview Within comedy circles, Maya Rudolph and Martin Short are considered two of the best sketch performers in the business. This series will feature sketches that spoof current events, celebrities and topical trends, as well as musical performances. Featured Crew Lorne Michaels Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maya Rudolph Herself - Host Martin Short Himself - Host Kenan Thompson Himself Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Maya & Marty premiered on May 31, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Maya & Marty. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  41m Homepage   http://www.nbc.com/maya-and-marty Genres Comedy Keywords talk show musical sketch skit variety show Content Score 64 We're so close, yet so far. Top Contributors 15 abimanyu 14 Elizabeth Jennings 11 Nero Kosonen 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}