{"link": "https://www.themoviedb.org/tv/18165?language=en", "title": "The Vampire Diaries", "resume": "The story of two vampire brothers obsessed with the same girl, who bears a striking resemblance to the beautiful but ruthless vampire they knew and loved in 1864.", "rate": 69, "genre": ["Drama", "Fantasy", "Horror", "Romance"], "cast": ["Paul Wesley", "Ian Somerhalder", "Kat Graham", "Candice King", "Michael Malarkey"], "character": ["Stefan Salvatore", "Damon Salvatore", "Bonnie Bennett", "Caroline Forbes", "Enzo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18165   Expand The Vampire Diaries   (2009) User Score  Play Trailer Overview The story of two vampire brothers obsessed with the same girl, who bears a striking resemblance to the beautiful but ruthless vampire they knew and loved in 1864. Featured Crew Kevin Williamson Creator Julie Plec Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  28 Content Issues  1 Images Backdrops  71 Posters  72 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Wesley Stefan Salvatore Ian Somerhalder Damon Salvatore Kat Graham Bonnie Bennett Candice King Caroline Forbes Michael Malarkey Enzo Full Cast & Crew Last Season Season 8 2016 | 16 Episodes Season 8 of The Vampire Diaries premiered on October 21, 2016. View All Seasons Social Reviews  0 Discussions  29 Subject Status Replies Last Reply T Ranking the Seasons Open 0 by TheBayHarborButcher\n      \n     w Don't like it anymore Open 1 by  TheBayHarborButcher T Ian Somerhalder doing another Vampire series Open 0 by TheBayHarborButcher\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  71 Posters  72 Recommendations   2013-10-03 The Originals 7.2    2008-09-07 True Blood 7.1    2007-09-19 Gossip Girl 6.3    2001-10-16 Smallville 6.9    2011-06-05 Teen Wolf 6.9    2006-09-25 Heroes 6.9    2011-10-23 Once Upon a Time 6.4    2013-09-16 Sleepy Hollow 6.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cwtv.com/shows/the-vampire-diaries Genres Drama Fantasy Horror Romance Keywords witch love triangle vampire supernatural eternal youth werewolf doppelgänger eternal love interspecies romance based on young adult novel Content Score 100 Yes! Looking good! Top Contributors 130 Marr 🇳🇱 101 Banana 67 Francesco Tili 63 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}