{"link": "https://www.themoviedb.org/tv/29565?language=en", "title": "Hero Tales", "resume": "It is the time of wars. In the chaotic Empire, a group of seven heroes of the stars, the Hokushin-Tenkun, rose to lead the common folk. Out of the seven a destiny of heated battle unfolds between the \"Two Noble Spirits\", Hagun and Tonrou. Originally the two should not exist in the same time but the gears of Fate have turned otherwise. In the current feeble state of the Ken Empire, the conflicting \"Two Noble Spirits\" - Taitou Shirei of Hagun and Keirou of Tonrou each fight for their view of justice and the peace of the countries and their home country. In the name of Fate, the justice of whom shall prevail....?", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Akemi Kanda", "Kenichi Suzumura", "Takahiro Sakurai"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29565   Expand Hero Tales   (2007) User Score Overview It is the time of wars. In the chaotic Empire, a group of seven heroes of the stars, the Hokushin-Tenkun, rose to lead the common folk. Out of the seven a destiny of heated battle unfolds between the \"Two Noble Spirits\", Hagun and Tonrou. Originally the two should not exist in the same time but the gears of Fate have turned otherwise. In the current feeble state of the Ken Empire, the conflicting \"Two Noble Spirits\" - Taitou Shirei of Hagun and Keirou of Tonrou each fight for their view of justice and the peace of the countries and their home country. In the name of Fate, the justice of whom shall prevail....? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akemi Kanda Kenichi Suzumura Takahiro Sakurai Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Hero Tales premiered on October  7, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hero Tales. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors m 3 magoozin w 3 whitetigerx8  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}