{"link": "https://www.themoviedb.org/tv/13831?language=en", "title": "Gemini Man", "resume": "Sam Casey is an agent for INTERSECT, a government think-tank and operations center specializing in secret missions. While on a diving assignment, Sam was affected by the radiation from an underwater explosion. The radiation rendered him invisible, but INTERSECT devised a way to control his invisibility, by fitting him with a computerized watch that kept him visible. He could, however, shut it off, and become invisible again, for short periods of time. If he did this for more than 15 minutes in any 24 hour period he would die. This ability to become invisible made him a very effective agent.", "rate": 73, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ben Murphy", "William Sylvester"], "character": ["Sam Casey", "Leonard Driscoll"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13831   Expand Gemini Man   (1976) User Score  Play Trailer Overview Sam Casey is an agent for INTERSECT, a government think-tank and operations center specializing in secret missions. While on a diving assignment, Sam was affected by the radiation from an underwater explosion. The radiation rendered him invisible, but INTERSECT devised a way to control his invisibility, by fitting him with a computerized watch that kept him visible. He could, however, shut it off, and become invisible again, for short periods of time. If he did this for more than 15 minutes in any 24 hour period he would die. This ability to become invisible made him a very effective agent. Featured Crew Harve Bennett Creator Steven Bochco Creator Leslie Stevens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Murphy Sam Casey William Sylvester Leonard Driscoll Full Cast & Crew Last Season Season 1 1976 | 12 Episodes Season 1 of Gemini Man premiered on May 10, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Gemini Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords secret agent superhuman invisibility Content Score 71 Just a little bit more... Top Contributors 12 Banana d 9 denis TB 1 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}