{"link": "https://www.themoviedb.org/tv/69931?language=en", "title": "jerks.", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 84, "genre": ["Comedy"], "cast": ["Christian Ulmen", "Fahri Yardım", "Pheline Roggan", "Collien Ulmen-Fernandes", "Jasna Fritzi Bauer"], "character": ["himself", "himself", "Pheline", "Collien", "Jasna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69931   Expand jerks.   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Christian Ulmen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Ulmen himself Fahri Yardım himself Pheline Roggan Pheline Collien Ulmen-Fernandes Collien Jasna Fritzi Bauer Jasna Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of jerks. premiered on March 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2016-09-19 The Good Place 7.8    2001-10-02 Scrubs 7.7  Facts Status  Returning Series Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  21m Homepage   https://www.maxdome.de/jerks Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 19 igattaca S 11 Samara T 8 TimWeber J 7 JohnBordello  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}