{"link": "https://www.themoviedb.org/tv/502?language=en", "title": "Sesame Street", "resume": "Sesame Street is a long-running American children's television series created by Joan Ganz Cooney and Lloyd Morrisett. The program is known for its educational content, and creativity communicated through the use of Jim Henson's Muppets, animation, short films, humor, and cultural references. The series premiered on stations on November 10, 1969 to positive reviews, some controversy, and high ratings.", "rate": 74, "genre": ["Animation", "Comedy", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 502   Expand Sesame Street   (1969) User Score Overview Sesame Street is a long-running American children's television series created by Joan Ganz Cooney and Lloyd Morrisett. The program is known for its educational content, and creativity communicated through the use of Jim Henson's Muppets, animation, short films, humor, and cultural references. The series premiered on stations on November 10, 1969 to positive reviews, some controversy, and high ratings. Featured Crew Joan Ganz Cooney Creator Lloyd Morrisett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 47 2017 | 35 Episodes Season 47 of Sesame Street premiered on January  7, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for Sesame Street. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   1976-09-18 The Muppet Show 7.8    1962-09-23 The Jetsons 6.6    1983-09-10 Inspector Gadget 6.6    1960-09-30 The Flintstones 7.0    1996-04-28 Dexter's Laboratory 7.3    1960-11-14 Popeye the Sailor 5.8    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1988-09-17 Garfield and Friends 6.6  Facts Status  Returning Series Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  54m, 60m Homepage   http://www.sesamestreet.org/ Genres Animation Comedy Family Keywords puppet children educational learning Content Score 64 We're so close, yet so far. Top Contributors 29 lineker 10 Banana 6 Elizabeth Jennings 5 Fireful  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}