{"link": "https://www.themoviedb.org/tv/43077?language=en", "title": "NYC 22", "resume": "NYC 22 follows six diverse NYPD rookies as they patrol the gritty streets of upper Manhattan. With unique backgrounds, personalities and reasons for being on the force, the new cops will make their share of rookie mistakes while they figure out how to relate to their boss, each other and the people they swore to protect.", "rate": 63, "genre": ["Drama"], "cast": ["Terry Kinney", "Adam Goldberg", "Leelee Sobieski", "Stark Sands", "Judy Marte"], "character": ["Daniel 'Yoda' Dean", "Ray 'Lazarus' Harper", "Jennifer 'White House' Perry", "Kenny McLaren", "Tonya Sanchez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43077   Expand NYC 22   (2012) User Score Overview NYC 22 follows six diverse NYPD rookies as they patrol the gritty streets of upper Manhattan. With unique backgrounds, personalities and reasons for being on the force, the new cops will make their share of rookie mistakes while they figure out how to relate to their boss, each other and the people they swore to protect. Featured Crew Richard Price Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Terry Kinney Daniel 'Yoda' Dean Adam Goldberg Ray 'Lazarus' Harper Leelee Sobieski Jennifer 'White House' Perry Stark Sands Kenny McLaren Judy Marte Tonya Sanchez Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of NYC 22 premiered on April 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2013-10-03 The Millers 4.9    2014-05-29 Undateable 6.2    2013-09-26 The Crazy Ones 5.8    2011-09-25 Pan Am 5.8    2014-03-16 Crisis 5.9    2012-09-26 The Neighbors 6.3    2014-06-24 Tyrant 6.4    2015-09-29 The Grinder 6.6  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   https://www.cbs.com/shows/nyc_22/ Genres Drama Keywords police officer rookie cop nypd manhattan, new york city Content Score 93 Almost there... Top Contributors 19 United600 12 Banana a 3 alexmate s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}