{"link": "https://www.themoviedb.org/tv/61379?language=en", "title": "Monthly Girls' Nozaki-kun", "resume": "High school student Chiyo Sakura has a crush on schoolmate Umetarō Nozaki, but when she confesses her love to him, he mistakes her for a fan and gives her an autograph. When she says that she always wants to be with him, he invites her to his house and has her help on some drawings. Chiyo discovers that Nozaki is actually a renowned shōjo manga artist named Sakiko Yumeno. She then agrees to be his assistant in order to get closer to him. As they work on his manga Let's Fall in Love (恋しよっ), they encounter other schoolmates who assist them or serve as inspirations for characters in the stories.", "rate": 76, "genre": ["Animation", "Comedy"], "cast": ["Ari Ozawa", "Yuichi Nakamura", "Yuki Ono", "Mai Nakahara", "Nobuhiko Okamoto"], "character": ["Chiyo Sakura (voice)", "Umetarou Nozaki (voice)", "Masayuki Hori (voice)", "Yuu Kashima (voice)", "Mikoto Mikoshiba (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61379   Expand Monthly Girls' Nozaki-kun   (2014) User Score Overview High school student Chiyo Sakura has a crush on schoolmate Umetarō Nozaki, but when she confesses her love to him, he mistakes her for a fan and gives her an autograph. When she says that she always wants to be with him, he invites her to his house and has her help on some drawings. Chiyo discovers that Nozaki is actually a renowned shōjo manga artist named Sakiko Yumeno. She then agrees to be his assistant in order to get closer to him. As they work on his manga Let's Fall in Love (恋しよっ), they encounter other schoolmates who assist them or serve as inspirations for characters in the stories. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ari Ozawa Chiyo Sakura (voice) Yuichi Nakamura Umetarou Nozaki (voice) Yuki Ono Masayuki Hori (voice) Mai Nakahara Yuu Kashima (voice) Nobuhiko Okamoto Mikoto Mikoshiba (voice) Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Monthly Girls' Nozaki-kun premiered on July  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2013-10-07 Non Non Biyori 8.0    2008-10-02 Toradora! 7.5    2012-04-22 Hyouka 8.3    2017-06-23 Monster Musume: Everyday Life with Monster Girls 9.0  Facts Original Name  月刊少女野崎くん Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.nozakikun.tv/ Genres Animation Comedy Keywords slice of life anime Content Score 86 Almost there... Top Contributors t 26 tmdb983464 J 16 Jason 8 yoshizuka 6 nazgul5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}