{"link": "https://www.themoviedb.org/tv/3609?language=en", "title": "Young Americans", "resume": "Young Americans is an American television drama created by Steven Antin. The show debuted on July 12, 2000 on The WB network as a summer replacement for, and spin-off from, another Columbia TriStar Television production, Dawson's Creek. The series was originally ordered for the fall 1999-2000 season but was delayed due to unresolved matters between the ColumbiaTriStar and The WB. The main character, Will Krudski, was introduced late in season three of Dawson's Creek as a childhood friend of the group who has kept in contact with Pacey Witter. Will goes to Capeside to visit with old friends while on spring break. After briefly dating Andie McPhee he returns to Raleigh.\nThe show explores themes of forbidden love, morality, social classes and gender roles.", "rate": 60, "genre": ["Drama"], "cast": ["Mark Famiglietti", "Ian Somerhalder", "Rodney Scott", "Ed Quinn", "Kate Bosworth"], "character": ["Hamilton Fleming", "Bella Banks"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3609   Expand Young Americans   (2000) User Score Overview Young Americans is an American television drama created by Steven Antin. The show debuted on July 12, 2000 on The WB network as a summer replacement for, and spin-off from, another Columbia TriStar Television production, Dawson's Creek. The series was originally ordered for the fall 1999-2000 season but was delayed due to unresolved matters between the ColumbiaTriStar and The WB. The main character, Will Krudski, was introduced late in season three of Dawson's Creek as a childhood friend of the group who has kept in contact with Pacey Witter. Will goes to Capeside to visit with old friends while on spring break. After briefly dating Andie McPhee he returns to Raleigh. The show explores themes of forbidden love, morality, social classes and gender roles. Featured Crew Steve Antin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Famiglietti Ian Somerhalder Hamilton Fleming Rodney Scott Ed Quinn Kate Bosworth Bella Banks Full Cast & Crew Last Season Season 1 2000 | 9 Episodes Season 1 of Young Americans premiered on July 12, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Young Americans. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.sonypictures.com/tv/shows/youngamericans/home.html Genres Drama Keywords boarding school wealthy teen drama Content Score 93 Almost there... Top Contributors 7 Banana a 3 adltata s 3 speedycars D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}