{"link": "https://www.themoviedb.org/tv/47323?language=en", "title": "Low Winter Sun", "resume": "Low Winter Sun is an American television drama series developed by Chris Mundy, starring Mark Strong and Lennie James. The series premiered on August 11, 2013, on AMC, with the first season consisting of ten episodes. It is based upon the 2006 British two-part miniseries of the same name.", "rate": 68, "genre": ["Drama"], "cast": ["Mark Strong", "Lennie James", "James Ransone", "Sprague Grayden", "Athena Karkanis"], "character": ["Frank Agnew", "Joe Geddes", "Damon Callis", "Maya Callis", "Dani Kahlil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47323   Expand Low Winter Sun   (2013) User Score Overview Low Winter Sun is an American television drama series developed by Chris Mundy, starring Mark Strong and Lennie James. The series premiered on August 11, 2013, on AMC, with the first season consisting of ten episodes. It is based upon the 2006 British two-part miniseries of the same name. Featured Crew Chris Mundy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Strong Frank Agnew Lennie James Joe Geddes James Ransone Damon Callis Sprague Grayden Maya Callis Athena Karkanis Dani Kahlil Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of Low Winter Sun premiered on August 11, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2011-02-07 Outcasts 6.2    2004-01-22 Corner Gas 8.3    2007-02-26 The Black Donnellys 7.4    2014-08-23 Intruders 6.5    2002-06-16 The Dead Zone 6.5    2011-03-06 Breakout Kings 6.1    2001-11-14 The Bernie Mac Show 5.7    2011-01-09 The Cape 4.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 17 Manu 14 United600 z 10 zurman1 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}