{"link": "https://www.themoviedb.org/tv/31917?language=en", "title": "Pretty Little Liars", "resume": "Based on the Pretty Little Liars series of young adult novels by Sara Shepard, the series follows the lives of four girls — Spencer, Hanna, Aria, and Emily — whose clique falls apart after the disappearance of their queen bee, Alison. One year later, they begin receiving messages from someone using the name \"A\" who threatens to expose their secrets — including long-hidden ones they thought only Alison knew.", "rate": 62, "genre": ["Drama", "Mystery"], "cast": ["Troian Bellisario", "Ashley Benson", "Lucy Hale", "Shay Mitchell", "Sasha Pieterse"], "character": ["Spencer Hastings", "Hanna Marin", "Aria Montgomery", "Emily Fields", "Alison DiLaurentis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31917   Expand Pretty Little Liars   (2010) User Score  Play Trailer Overview Based on the Pretty Little Liars series of young adult novels by Sara Shepard, the series follows the lives of four girls — Spencer, Hanna, Aria, and Emily — whose clique falls apart after the disappearance of their queen bee, Alison. One year later, they begin receiving messages from someone using the name \"A\" who threatens to expose their secrets — including long-hidden ones they thought only Alison knew. Featured Crew I. Marlene King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  31 Content Issues  11 Images Backdrops  30 Posters  24 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Troian Bellisario Spencer Hastings Ashley Benson Hanna Marin Lucy Hale Aria Montgomery Shay Mitchell Emily Fields Sasha Pieterse Alison DiLaurentis Full Cast & Crew Last Season Original Air Date Original Air Date DVD Order (DVD) Netflix/Amazon Order (Digital) Season 7 2016 | 20 Episodes View All Seasons Social Reviews  0 Discussions  42 Subject Status Replies Last Reply w Alison: Happy Birthday Sasha Pieterse! Open 0 by wonder2wonder\n      \n     J Lucas... Open 7 by  Joe w Mona: Happy Birthday Janel Parrishn! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  30 Posters  24 Recommendations   2007-09-19 Gossip Girl 6.3    2009-09-10 The Vampire Diaries 6.9    2011-09-21 Revenge 6.9    2003-09-23 One Tree Hill 6.5    2009-10-23 White Collar 7.7    2011-06-05 Teen Wolf 6.9    2009-05-19 Glee 5.9    2013-10-03 The Originals 7.2  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  41m Homepage   http://freeform.go.com/shows/pretty-little-liars Genres Drama Mystery Keywords high school secret forbidden love female friendship bullying lesbian teenager teen drama suspicious death based on young adult novel Content Score 100 Yes! Looking good! Top Contributors 251 dbowman 161 Marr 🇳🇱 128 Banana 64 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}