{"link": "https://www.themoviedb.org/tv/78622?language=en", "title": "Little Cabin in the Woods", "resume": "Get away from the world that changes too fast, filled with too much information, and entangled in the net of complicated relationships. At a little house in the forest that lacks the conveniences of modern world like gas and wifi but is filled with the essentials, you can find true happiness of living a slow and simple life.", "rate": 0, "genre": ["Reality"], "cast": ["Park Shin-hye", "So Ji-sub"], "character": ["Park Shin-hye", "So Ji-sub"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78622   Expand Little Cabin in the Woods   (2018) User Score Overview Get away from the world that changes too fast, filled with too much information, and entangled in the net of complicated relationships. At a little house in the forest that lacks the conveniences of modern world like gas and wifi but is filled with the essentials, you can find true happiness of living a slow and simple life. Featured Crew Na Young-seok Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Shin-hye Park Shin-hye So Ji-sub So Ji-sub Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Little Cabin in the Woods premiered on April  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Little Cabin in the Woods. You can help by rating TV shows you've seen. Facts Original Name  숲속의 작은 집 Status  Returning Series Network Certification 12 Meaning This rating is for programs that may deemed inappropriate for those younger than 12, and parental discretion should be used. Usually used for animations that have stronger themes or violence then those designed for children, or for reality shows that have mild violence, themes, or language. Type  Reality Original Language  Korean Runtime  90m Homepage   http://program.tving.com/tvn/foresthouse Genres Reality Keywords variety Content Score 64 We're so close, yet so far. Top Contributors 24 Kyuhwan Kim 23 Lumina_B M 12 Maria180493 c 4 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}