{"link": "https://www.themoviedb.org/tv/60966?language=en", "title": "Celebrity Wife Swap", "resume": "Two women from celebrity families with different backgrounds trade places for one week. Not only are the moms given the opportunity to see how another celebrity chooses to raise her children and deal with the spotlight -- making them appreciate their own lives more -- but viewers are given a peek into how some controversial celebrities live their lives. At the end of each episode the couples meet and discuss how they feel about each other's life and share what they've learned from the experience.", "rate": 33, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60966   Expand Celebrity Wife Swap   (2012) User Score Overview Two women from celebrity families with different backgrounds trade places for one week. Not only are the moms given the opportunity to see how another celebrity chooses to raise her children and deal with the spotlight -- making them appreciate their own lives more -- but viewers are given a peek into how some controversial celebrities live their lives. At the end of each episode the couples meet and discuss how they feel about each other's life and share what they've learned from the experience. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2015 | 9 Episodes Season 4 of Celebrity Wife Swap premiered on May 20, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Celebrity Wife Swap. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://abc.go.com/shows/celebrity-wife-swap Genres Reality Keywords celebrity family swap Content Score 56 We're so close, yet so far. Top Contributors 29 Elizabeth Jennings TB 5 TMDb Bot z 4 zurman1 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}