{"link": "https://www.themoviedb.org/tv/62157?language=en", "title": "Maria the Virgin Witch", "resume": "Takes place during the Hundred Years War in France. Maria, a powerful young witch who cannot tolerate war, uses her powers to intervene and keep the factions at bay. Assisted by her succubus and incubus familiars, they are mostly successful until the Archangel Michael takes notice and decides to put a stop to her interference. He tells Maria that her powers will be stripped away if she loses her virginity, and also forbids her from using magic publicly. To ensure this, he posts the angel Ezekiel to watch over her.", "rate": 40, "genre": ["Animation", "Comedy", "Drama", "Fantasy"], "cast": ["Mamiko Noto", "Hisako Kanemoto", "Ai Kakuma", "Bin Shimada", "Kana Hanazawa"], "character": ["Viv", "Maria", "Anne", "Guillaume", "Ezekiel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62157   Expand Maria the Virgin Witch   (2015) User Score Overview Takes place during the Hundred Years War in France. Maria, a powerful young witch who cannot tolerate war, uses her powers to intervene and keep the factions at bay. Assisted by her succubus and incubus familiars, they are mostly successful until the Archangel Michael takes notice and decides to put a stop to her interference. He tells Maria that her powers will be stripped away if she loses her virginity, and also forbids her from using magic publicly. To ensure this, he posts the angel Ezekiel to watch over her. Featured Crew Masayuki Ishikawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamiko Noto Viv Hisako Kanemoto Maria Ai Kakuma Anne Bin Shimada Guillaume Kana Hanazawa Ezekiel Full Cast & Crew Last Season Season 1 2015 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Maria the Virgin Witch. You can help by rating TV shows you've seen. Facts Original Name  純潔のマリア Sorcière de gré, pucelle de force Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://junketsu-maria.tv/ Genres Animation Comedy Drama Fantasy Keywords witch religion historical magical creature seinen Content Score 93 Almost there... Top Contributors 52 miryoku f 17 fwaits 17 Elizabeth Jennings TB 11 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}