{"link": "https://www.themoviedb.org/tv/1431?language=en", "title": "CSI: Crime Scene Investigation", "resume": "The series follows Las Vegas criminalists working for the Las Vegas Police Department as they use physical evidence to solve grisly murders in this unusually graphic drama, which has inspired a host of other cop-show \"procedurals\". The series mixes deduction, gritty subject matter and character-driven drama. The network later added spin-offs CSI: Miami and CSI: NY, which have both been cancelled after ten and nine seasons respectively.", "rate": 68, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Ted Danson", "Elisabeth Shue", "George Eads", "Jorja Fox", "Eric Szmanda"], "character": ["D.B. Russell", "Julie Finlay", "Nick Stokes", "Sara Sidle", "Greg Sanders"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1431   Expand CSI: Crime Scene Investigation   (2000) User Score Overview The series follows Las Vegas criminalists working for the Las Vegas Police Department as they use physical evidence to solve grisly murders in this unusually graphic drama, which has inspired a host of other cop-show \"procedurals\". The series mixes deduction, gritty subject matter and character-driven drama. The network later added spin-offs CSI: Miami and CSI: NY, which have both been cancelled after ten and nine seasons respectively. Featured Crew Anthony Zuiker Creator Ann Donahue Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  3 Images Backdrops  31 Posters  18 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Ted Danson D.B. Russell Elisabeth Shue Julie Finlay George Eads Nick Stokes Jorja Fox Sara Sidle Eric Szmanda Greg Sanders Full Cast & Crew Last Season Season 15 2014 | 18 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w Catherine Willows: Happy Birthday Marg Helgenberger! Open 0 by wonder2wonder\n      \n     w Dr. Albert Robbins: Happy Birthday Robert David Hall! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  31 Posters  18 Recommendations   2002-09-23 CSI: Miami 5.8    2004-09-21 CSI: NY 6.7    1990-09-13 Law & Order 7.2    2001-09-30 Law & Order: Criminal Intent 7.1    2005-09-22 Criminal Minds 7.0    1997-09-08 Ally McBeal 5.9    2005-09-12 Bones 7.0    2003-09-28 Cold Case 7.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbs.com/shows/csi/ Genres Crime Drama Mystery Keywords mystery las vegas crime lab murder investigation crime investigation csi Content Score 100 Yes! Looking good! Top Contributors 224 seawolf 55 Srebrny jastrząb 47 d00ziie 40 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}