{"link": "https://www.themoviedb.org/tv/2420?language=en", "title": "Conviction", "resume": "Conviction is an American television drama on NBC that debuted as a mid-season replacement on Friday, March 3, 2006. The cast includes Stephanie March reprising her Law & Order: Special Victims Unit role as Alexandra Cabot. In the series, Cabot returns to New York City and becomes a Bureau Chief ADA supervising a group of young but talented assistant district attorneys after a stint in the Witness Protection Program. Other cast members include Eric Balfour, Anson Mount, Jordan Bridges, Julianne Nicholson, Milena Govich, and J. August Richards.\nPrior to the show's debut, creator Dick Wolf remarked, \"Conviction will be a 'charactercedural', we will be dealing extensively with characters' back stories and personal lives. I am delighted with the extraordinary cast we have assembled, which will give the show depth and emotional intensity.\"\nConviction's premiere came precisely one year after the premiere of the short-lived Law & Order: Trial by Jury, which was also created by Dick Wolf and also aired on NBC. On February 21, 2006, the pilot episode of Conviction was made available for free download through iTunes music store; the free download was available until March 3, the date of the NBC premiere. The pilot and all other aired episodes are now available for purchase.", "rate": 57, "genre": ["Drama"], "cast": ["Eric Balfour", "Milena Govich", "Julianne Nicholson", "Jordan Bridges", "Stephanie March"], "character": ["Alexandra Cabot"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2420   Expand Conviction   (2006) User Score Overview Conviction is an American television drama on NBC that debuted as a mid-season replacement on Friday, March 3, 2006. The cast includes Stephanie March reprising her Law & Order: Special Victims Unit role as Alexandra Cabot. In the series, Cabot returns to New York City and becomes a Bureau Chief ADA supervising a group of young but talented assistant district attorneys after a stint in the Witness Protection Program. Other cast members include Eric Balfour, Anson Mount, Jordan Bridges, Julianne Nicholson, Milena Govich, and J. August Richards. Prior to the show's debut, creator Dick Wolf remarked, \"Conviction will be a 'charactercedural', we will be dealing extensively with characters' back stories and personal lives. I am delighted with the extraordinary cast we have assembled, which will give the show depth and emotional intensity.\" Conviction's premiere came precisely one year after the premiere of the short-lived Law & Order: Trial by Jury, which was also created by Dick Wolf and also aired on NBC. On February 21, 2006, the pilot episode of Conviction was made available for free download through iTunes music store; the free download was available until March 3, the date of the NBC premiere. The pilot and all other aired episodes are now available for purchase. Featured Crew Dick Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Balfour Milena Govich Julianne Nicholson Jordan Bridges Stephanie March Alexandra Cabot Full Cast & Crew Last Season Season 1 2006 | 13 Episodes Season 1 of Conviction premiered on March  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Conviction. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords new york lawyer district attorney Content Score 93 Almost there... Top Contributors 7 Banana 3 seawolf w 3 webmaster TS 3 Tony S.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}