{"link": "https://www.themoviedb.org/tv/19105?language=en", "title": "Alan Carr: Chatty Man", "resume": "Alan Carr: Chatty Man is a BAFTA award-winning British comedy chat show presented by comedian Alan Carr. The show features interviews with celebrity guests, sketches, topical chat and music.\nThe show was first on as two pilots in late May 2009; it proved popular with the public and was commissioned for a series. The first episode drew in a total of 2.15 million viewers. To date, the show has broadcast 9 series and 82 episodes. Carr has signed a new deal worth £4 million, which will keep the show on air to 2014, spanning another four more series. The ninth series consisted of 14 episodes, making it the longest series to date. A new series began airing on 1 March 2013. In 2013, Carr signed a two-year contract extension with Channel 4, the exclusive deal will see him staying at the channel until 2015 in a new deal is worth £4 million.\nIn continental Europe and Scandinavia Alan Carr: Chattyman is shown on BBC Entertainment a week behind the UK. Old episodes are currently being aired on 4Music.", "rate": 53, "genre": ["Talk", "Comedy"], "cast": ["Alan Carr"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19105   Expand Alan Carr: Chatty Man   (2009) User Score Overview Alan Carr: Chatty Man is a BAFTA award-winning British comedy chat show presented by comedian Alan Carr. The show features interviews with celebrity guests, sketches, topical chat and music. The show was first on as two pilots in late May 2009; it proved popular with the public and was commissioned for a series. The first episode drew in a total of 2.15 million viewers. To date, the show has broadcast 9 series and 82 episodes. Carr has signed a new deal worth £4 million, which will keep the show on air to 2014, spanning another four more series. The ninth series consisted of 14 episodes, making it the longest series to date. A new series began airing on 1 March 2013. In 2013, Carr signed a two-year contract extension with Channel 4, the exclusive deal will see him staying at the channel until 2015 in a new deal is worth £4 million. In continental Europe and Scandinavia Alan Carr: Chattyman is shown on BBC Entertainment a week behind the UK. Old episodes are currently being aired on 4Music. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Carr Himself - Host Full Cast & Crew Last Season Season 16 2016 | 10 Episodes Season 16 of Alan Carr: Chatty Man premiered on March  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2004-10-11 The Paul O'Grady Show 3.7    1999-09-06 Loose Women 2.5    1979-09-22 Spider-Woman 6.7    1996-05-26 Cold Lazarus 7.3    1999-05-16 Atomic Train 4.4    1997-05-16 Spawn 7.8    1990-01-04 One Foot in the Grave 7.5    2004-01-08 The Celebrity Apprentice 4.2  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  50m, 60m Homepage   http://www.channel4.com/chattyman Genres Talk Comedy Keywords talk show Content Score 56 We're so close, yet so far. Top Contributors 17 Elizabeth Jennings 8 Banana TB 4 TMDb Bot z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}