{"link": "https://www.themoviedb.org/tv/69153?language=en", "title": "The Wall", "resume": "Game show in which correct answers cause a green ball to fall down the wall adding the value of the slot to the players' winning total and a missed question causes an ominous red ball to fall and deduct the value from the team's total. Teammates have to work together to build a huge cash prize.", "rate": 43, "genre": ["Reality"], "cast": ["Chris Hardwick"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69153   Expand The Wall   (2016) User Score  Play Trailer Overview Game show in which correct answers cause a green ball to fall down the wall adding the value of the slot to the players' winning total and a missed question causes an ominous red ball to fall and deduct the value from the team's total. Teammates have to work together to build a huge cash prize. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Hardwick Himself - Host Full Cast & Crew Last Season Season 2 2017 | 5 Episodes Season 2 of The Wall premiered on May  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Wall. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/the-wall Genres Reality Keywords game show Content Score 64 We're so close, yet so far. Top Contributors 20 Elizabeth Jennings m 5 maryannjbruno 5 Banana j 2 jacobwstiana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}