{"link": "https://www.themoviedb.org/tv/53300?language=en", "title": "Hello Ladies", "resume": "Stuart Pritchard is an awkward, overly-confident Englishman trying to date in Los Angeles – where he repeatedly attempts to infiltrate the world of beautiful people.", "rate": 67, "genre": ["Comedy"], "cast": ["Stephen Merchant", "Christine Woods", "Nate Torrence", "Kevin Weisman", "Crista Flanagan"], "character": ["Stephen", "Jessica", "Wade", "Kives", "Marion"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53300   Expand Hello Ladies   (2013) User Score  Play Trailer Overview Stuart Pritchard is an awkward, overly-confident Englishman trying to date in Los Angeles – where he repeatedly attempts to infiltrate the world of beautiful people. Featured Crew Stephen Merchant Creator Lee Eisenberg Creator Gene Stupnitsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Merchant Stephen Christine Woods Jessica Nate Torrence Wade Kevin Weisman Kives Crista Flanagan Marion Full Cast & Crew Last Season Season 1 2013 | 8 Episodes Season 1 of Hello Ladies premiered on September 29, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Hello Ladies. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  3 Recommendations   2014-06-04 Jennifer Falls 3.2    2011-09-29 How to Be a Gentleman 5.3    2011-11-10 Life's Too Short 7.1    2012-02-20 The Bleak Old Shop of Stuff 6.7    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2015-08-05 Difficult People 7.4    2010-02-19 The Ricky Gervais Show 7.9    2013-08-16 Big School 6.3  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hbo.com/hello-ladies Genres Comedy Keywords dating socially awkward Content Score 100 Yes! Looking good! Top Contributors 20 Elizabeth Jennings t 7 tolhauZ 6 Banana s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}