{"link": "https://www.themoviedb.org/tv/61579?language=en", "title": "Mortal Kombat: Legacy", "resume": "The first season of Mortal Kombat Legacy is a prequel to the original game, explaining the background stories of several characters from the series and demonstrating their reasons for participating in the upcoming tenth Mortal Kombat tournament on which the first game was based.", "rate": 60, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Casper Van Dien", "Ian Anthony Dale", "Samantha Jo", "Kim Do Nguyen", "David Lee McInnis"], "character": ["Johnny Cage", "Hanzo Hasashi", "Kitana", "Ermac", "Raiden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61579   Expand Mortal Kombat: Legacy   (2011) User Score Overview The first season of Mortal Kombat Legacy is a prequel to the original game, explaining the background stories of several characters from the series and demonstrating their reasons for participating in the upcoming tenth Mortal Kombat tournament on which the first game was based. Featured Crew Kevin Tancharoen Creator Oren Uziel Creator Ed Boon Creator John Tobias Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casper Van Dien Johnny Cage Ian Anthony Dale Hanzo Hasashi Samantha Jo Kitana Kim Do Nguyen Ermac David Lee McInnis Raiden Full Cast & Crew Last Season Season 2 2013 | 10 Episodes Season 2 of Mortal Kombat: Legacy premiered on September 26, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1995-01-29 Hercules: The Legendary Journeys 6.3    1998-08-05 Whose Line Is It Anyway? 7.8    2008-07-11 Flashpoint 6.6    2014-05-23 Street Fighter: Assassin's Fist 6.3    2010-11-26 Young Justice 8.2    1993-09-13 Animaniacs 7.6    2010-09-20 The Event 6.2    2010-09-23 An Idiot Abroad 7.8  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  10m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords martial arts combat based on video game martial arts tournament Content Score 93 Almost there... Top Contributors 24 Elizabeth Jennings 14 Wouter CM 10 Cherche Moi z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}