{"link": "https://www.themoviedb.org/tv/2661?language=en", "title": "Kamen Rider", "resume": "A Japanese anthology series centered around a man who transforms into a bug-themed superhero.", "rate": 69, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Atsuhiro Inukai", "Eiji Akaso", "Kôhei Takeda", "Kaho Takada", "Yasuyuki Maekawa"], "character": ["Sento Kiryuu · Kamen Rider Build", "Ryuuga Banjou · Kamen Rider Cross-Z", "Kazumi Sawatari · Kamen Rider Grease", "Misora Isurugi", "Souichi Isurugi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2661   Expand Kamen Rider   (1971) User Score  Play Trailer Overview A Japanese anthology series centered around a man who transforms into a bug-themed superhero. Featured Crew Shotaro Ishinomori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  10 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atsuhiro Inukai Sento Kiryuu · Kamen Rider Build Eiji Akaso Ryuuga Banjou · Kamen Rider Cross-Z Kôhei Takeda Kazumi Sawatari · Kamen Rider Grease Kaho Takada Misora Isurugi Yasuyuki Maekawa Souichi Isurugi Full Cast & Crew Last Season Kamen Rider Build 2017 | 43 Episodes View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply A discussion on character names Open 3 by  Jenn Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   1975-04-05 Super Sentai 3.5    2015-10-04 One-Punch Man 8.2    2017-02-08 Legion 7.6    2009-09-16 Archer 7.9    1999-01-31 Family Guy 6.5  Facts Original Name  仮面ライダ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords good vs evil martial arts superhero anthology tokusatsu motorcycle franchise masked rider Content Score 100 Yes! Looking good! Top Contributors J 646 Jenn 171 J. 167 liteignited y 46 yurururin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}