{"link": "https://www.themoviedb.org/tv/16208?language=en", "title": "Men of a Certain Age", "resume": "Men of a Certain Age is an American comedy-drama television series, which premiered on TNT on December 7, 2009. The hour-long program stars Ray Romano, Andre Braugher and Scott Bakula as three best friends in their late forties dealing with the realities of middle age. It won a Peabody Award in 2010. On July 15, 2011, TNT cancelled the series after two seasons.", "rate": 77, "genre": ["Comedy", "Drama"], "cast": ["Ray Romano", "Scott Bakula", "Andre Braugher", "LisaGay Hamilton", "Richard Gant"], "character": ["Joe Tranelli", "Terry Elliott", "Owen Thoreau Jr.", "Melissa Thoreau", "Owen Thoreau Sr."], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16208   Expand Men of a Certain Age   (2009) User Score Overview Men of a Certain Age is an American comedy-drama television series, which premiered on TNT on December 7, 2009. The hour-long program stars Ray Romano, Andre Braugher and Scott Bakula as three best friends in their late forties dealing with the realities of middle age. It won a Peabody Award in 2010. On July 15, 2011, TNT cancelled the series after two seasons. Featured Crew Ray Romano Creator Mike Royce Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ray Romano Joe Tranelli Scott Bakula Terry Elliott Andre Braugher Owen Thoreau Jr. LisaGay Hamilton Melissa Thoreau Richard Gant Owen Thoreau Sr. Full Cast & Crew Last Season Season 2 2010 | 12 Episodes Season 2 of Men of a Certain Age premiered on December  6, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  6 Recommendations   2004-07-21 Rescue Me 7.6    2004-07-18 Entourage 7.1    2001-04-21 Trailer Park Boys 7.9    2009-02-15 Eastbound & Down 7.4    2013-09-29 Masters of Sex 6.6    2010-09-19 Boardwalk Empire 7.7    2012-04-22 Veep 7.2    2010-06-29 Louie 7.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.tnt.tv/ Genres Comedy Drama Keywords wife husband relationship midlife crisis compulsive gambling car dealership divorce group of friends unemployed actor middle age Content Score 93 Almost there... Top Contributors 86 United600 9 Banana s 3 speedycars a 3 antrrax  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}