{"link": "https://www.themoviedb.org/tv/11924?language=en", "title": "Unit One", "resume": "Rejseholdet is a Danish television crime series starring Charlotte Fich, Mads Mikkelsen and Lars Brygmann. Produced by Danmarks Radio, the program aired 32 episodes spanning four seasons from 2000 to 2004. Each episode revolved around an elite mobile police task force called \"Unit One\" that travels around Denmark helping local police solve crimes. Cases portrayed in the show were loosely based upon actual incidents of sensational crimes such as murders, kidnappings, cross-border sex traffic and child pornography. Rejseholdet won the 2002 International Emmy Award for best drama series.", "rate": 69, "genre": ["Drama", "Mystery"], "cast": ["Charlotte Fich", "Mads Mikkelsen", "Lars Brygmann", "Waage Sandø", "Erik Wedersøe"], "character": ["Ingrid Dahl", "Allan Fischer", "Thomas La Cour", "Jens Peter 'IP' Sørensen", "Ulf Thomsen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11924   Expand Unit One   (2000) User Score  Play Trailer Overview Rejseholdet is a Danish television crime series starring Charlotte Fich, Mads Mikkelsen and Lars Brygmann. Produced by Danmarks Radio, the program aired 32 episodes spanning four seasons from 2000 to 2004. Each episode revolved around an elite mobile police task force called \"Unit One\" that travels around Denmark helping local police solve crimes. Cases portrayed in the show were loosely based upon actual incidents of sensational crimes such as murders, kidnappings, cross-border sex traffic and child pornography. Rejseholdet won the 2002 International Emmy Award for best drama series. Featured Crew Peter Thorsboe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlotte Fich Ingrid Dahl Mads Mikkelsen Allan Fischer Lars Brygmann Thomas La Cour Waage Sandø Jens Peter 'IP' Sørensen Erik Wedersøe Ulf Thomsen Full Cast & Crew Last Season Rejseholdet season 4 2003 | 2 Episodes Season 4 of Unit One premiered on December 25, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2002-10-27 Foyle's War 8.1    2000-04-16 The Corner 7.1    1980-09-15 Shogun 7.5    2003-05-18 State of Play 7.9    2008-11-30 Wallander 7.6    2002-05-13 Spooks 7.5  Facts Original Name  Rejseholdet Status  Ended Network Certification  - Type  Scripted Original Language  Danish Runtime  75m, 58m Homepage   http://www.dr.dk/DRfiktion/Arkiv/Serier/20001201_Rejseholdet/20060628110317.htm Genres Drama Mystery Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors t 6 the_partyman p 6 pernygaard T 5 Tigrecito 4 SkipperDK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}