{"link": "https://www.themoviedb.org/tv/62412?language=en", "title": "Kevin from Work", "resume": "A workplace comedy centered on Kevin, a young man who declares his unrequited love for his coworker Audrey in a letter, believing he’ll never see her again after he accepts a job overseas. But when the opportunity falls through and Kevin is forced to return to his old job, how will he and Audrey continue to work together now that his feelings are no longer secret?", "rate": 52, "genre": ["Comedy"], "cast": ["Noah Reid", "Paige Spara", "Amy Sedaris", "Jordan Hinson", "Matthew Florida"], "character": ["Kevin", "Audrey", "Julia", "Roxie", "Brock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62412   Expand Kevin from Work   (2015) User Score  Play Trailer Overview A workplace comedy centered on Kevin, a young man who declares his unrequited love for his coworker Audrey in a letter, believing he’ll never see her again after he accepts a job overseas. But when the opportunity falls through and Kevin is forced to return to his old job, how will he and Audrey continue to work together now that his feelings are no longer secret? Featured Crew Barbara Adler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noah Reid Kevin Paige Spara Audrey Amy Sedaris Julia Jordan Hinson Roxie Matthew Florida Brock Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Kevin from Work premiered on August 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2011-02-08 Traffic Light 7.2    2017-01-01 Beau Séjour 7.9    2015-12-01 Real Rob 5.8    2015-06-18 Hoff the Record 6.0    2014-10-06 Strange Empire 6.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  23m Homepage   http://abcfamily.go.com/shows/kevin-from-work Genres Comedy Keywords coworker relationship office romance workplace comedy Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings f 9 furkan-guven0115 6 Banana CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}