{"link": "https://www.themoviedb.org/tv/80478?language=en", "title": "Black Raven", "resume": "Two women who bear the same name and born of the same father, but do not know each other and do not suspect their kinship. However, their meeting is predetermined...", "rate": 100, "genre": ["Action", "Adventure", "Crime", "Drama", "Mystery"], "cast": ["Tatyana Kolganova", "Anna Germ", "Anna Samokhina", "Tatyana Tkach", "Yaroslav Ivanov"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80478   Expand Black Raven   (2001) User Score Overview Two women who bear the same name and born of the same father, but do not know each other and do not suspect their kinship. However, their meeting is predetermined... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tatyana Kolganova Anna Germ Anna Samokhina Tatyana Tkach Yaroslav Ivanov Full Cast & Crew Last Season Season 1 2001 | 64 Episodes Season 1 of Black Raven premiered on December 22, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2005-12-09 Каменская - 4 10.0    2003-09-29 Каменская - 3 10.0    2008-11-16 Kamenskaya - 5 10.0    2002-12-07 Каменская - 2 10.0  Facts Original Name  Чёрный ворон Status  Ended Networks Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Russian Runtime  45m Homepage  - Genres Action & Adventure Crime Drama Mystery Keywords based on novel or book Content Score 79 Pump it up! We're close now. Top Contributors 32 Elena Sergeeva n 31 navarro2018 23 Marr 🇳🇱 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}