{"link": "https://www.themoviedb.org/tv/10430?language=en", "title": "The Doodlebops", "resume": "The Doodlebops was a Canadian television children's television series. \"Rock & Bop with The Doodlebops\", was released in 2004 and continues to top the children's charts in North America. Its 2004-2007 TV broadcasting run, produced by Cookie Jar Entertainment, airs as reruns on the Canadian Broadcasting Corporation in Canada in the Kids' CBC morning broadcast programming schedule, and on Playhouse Disney and Tiny Pop in the UK. The show used to air on the Disney Channel in the USA as part of the Playhouse Disney morning programming schedule, but is no longer a part of that lineup. Reruns of the first season currently air Saturday mornings on CBS as part of the Cookie Jar TV lineup. The Doodlebops had a live concert tour. The Doodlebops stars are Lisa J. Lennox as Deedee Doodle, Chad McNamara as Rooney Doodle, and Jonathan Wexler as Moe Doodle.\nThe Doodlebops' characters are members of a children's band, The creators of The Doodlebops are Cookie Jar executive Michael Hirsh and musical director Carl Lenox. Jamie Waese is the producer and director of the TV series. David Connolly is the choreographer. Andrea Nevitt is the Line Producer. Gord McLennan is the Technical Producer. Ian Harvey is the Senior Editor.", "rate": 0, "genre": [], "cast": ["Jonathan Wexler", "Chad McNamara", "Lisa J. Lennox", "John Catucci"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10430   Expand The Doodlebops   (2005) User Score Overview The Doodlebops was a Canadian television children's television series. \"Rock & Bop with The Doodlebops\", was released in 2004 and continues to top the children's charts in North America. Its 2004-2007 TV broadcasting run, produced by Cookie Jar Entertainment, airs as reruns on the Canadian Broadcasting Corporation in Canada in the Kids' CBC morning broadcast programming schedule, and on Playhouse Disney and Tiny Pop in the UK. The show used to air on the Disney Channel in the USA as part of the Playhouse Disney morning programming schedule, but is no longer a part of that lineup. Reruns of the first season currently air Saturday mornings on CBS as part of the Cookie Jar TV lineup. The Doodlebops had a live concert tour. The Doodlebops stars are Lisa J. Lennox as Deedee Doodle, Chad McNamara as Rooney Doodle, and Jonathan Wexler as Moe Doodle. The Doodlebops' characters are members of a children's band, The creators of The Doodlebops are Cookie Jar executive Michael Hirsh and musical director Carl Lenox. Jamie Waese is the producer and director of the TV series. David Connolly is the choreographer. Andrea Nevitt is the Line Producer. Gord McLennan is the Technical Producer. Ian Harvey is the Senior Editor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Wexler Chad McNamara Lisa J. Lennox John Catucci Full Cast & Crew Last Season Season 1 2005 | 26 Episodes Season 1 of The Doodlebops premiered on April 16, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Doodlebops. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.doodlebops.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}