{"link": "https://www.themoviedb.org/tv/36697?language=en", "title": "Student Council Staff Members", "resume": "The stage is set at Ousai Private Academy which, due to declining birth rates, has transitioned from an all-girls high school to a co-ed. The current ratio of male to female students is 28:524. Within this paradise, Tsuda Takatoshi is inaugurated as vice-president of the student council. The student council has a strict image. However, there are some members who defy imagination...", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Shintarou Asanuma", "Satomi Arai", "Sayuri Yahagi", "Yukika Teramoto", "Youko Hikasa"], "character": ["Takatoshi Tsuda", "Aria Shichijou", "Suzu Hagimura", "Chiri Nakazato", "Shino Amakusa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36697   Expand Student Council Staff Members   (2010) User Score Overview The stage is set at Ousai Private Academy which, due to declining birth rates, has transitioned from an all-girls high school to a co-ed. The current ratio of male to female students is 28:524. Within this paradise, Tsuda Takatoshi is inaugurated as vice-president of the student council. The student council has a strict image. However, there are some members who defy imagination... Featured Crew Kanazawa Hiromichi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shintarou Asanuma Takatoshi Tsuda Satomi Arai Aria Shichijou Sayuri Yahagi Suzu Hagimura Yukika Teramoto Chiri Nakazato Youko Hikasa Shino Amakusa Full Cast & Crew Last Season Season 2 2014 | 13 Episodes Season 2 of Student Council Staff Members premiered on January  4, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Student Council Staff Members. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Student Council Staff Members. You can help by rating TV shows you've seen. Facts Original Name  生徒会役員共 Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://king-cr.jp/special/seitokai/ Genres Animation Comedy Keywords ecchi anime based on 4-koma Content Score 93 Almost there... Top Contributors 19 Dante 18 deanzel 11 sp1ti M 6 ManiacB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}