{"link": "https://www.themoviedb.org/tv/4818?language=en", "title": "Cartoon Alley", "resume": "Cartoon Alley is an American television program that aired on Turner Classic Movies every Saturday Morning at 11:30 AM ET.\nHosted by Ben Mankiewicz, the series featured three classic animated shorts from the 1930-1950's per episode. Most shorts were from The Golden Age of American animation. Each of the three shorts focused on a common theme. Most shorts came from Warner Bros., MGM, and Paramount, but during the show's first season Cartoon Alley featured shorts from the Gaumont Film Company. Many recognizable characters have been featured in at least one episode such as Bugs Bunny, Popeye, Porky Pig, Tom and Jerry, and others not so famous such as Goopy Geer and The Captain and the Kids. The shorts often appeared uncut and uncensored, and the more controversial cartoons were often introduced with a brief warning by Mankiewicz about the ethnic stereotypes being portrayed. The network's logo was only featured for a brief time, usually during the last short featured.\nFrom November 2004 to September 2005 the series was featured just once a month but after popular demand the series became a weekly feature. This series never aired in February because of TCM's 31 Days of Oscars programming. The series was canceled in autumn of 2007.", "rate": 0, "genre": ["Animation"], "cast": ["Mel Blanc", "Ben Mankiewicz"], "character": ["(archive footage)", "(archive footage)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4818   Expand Cartoon Alley   (2004) User Score Overview Cartoon Alley is an American television program that aired on Turner Classic Movies every Saturday Morning at 11:30 AM ET. Hosted by Ben Mankiewicz, the series featured three classic animated shorts from the 1930-1950's per episode. Most shorts were from The Golden Age of American animation. Each of the three shorts focused on a common theme. Most shorts came from Warner Bros., MGM, and Paramount, but during the show's first season Cartoon Alley featured shorts from the Gaumont Film Company. Many recognizable characters have been featured in at least one episode such as Bugs Bunny, Popeye, Porky Pig, Tom and Jerry, and others not so famous such as Goopy Geer and The Captain and the Kids. The shorts often appeared uncut and uncensored, and the more controversial cartoons were often introduced with a brief warning by Mankiewicz about the ethnic stereotypes being portrayed. The network's logo was only featured for a brief time, usually during the last short featured. From November 2004 to September 2005 the series was featured just once a month but after popular demand the series became a weekly feature. This series never aired in February because of TCM's 31 Days of Oscars programming. The series was canceled in autumn of 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mel Blanc (archive footage) Ben Mankiewicz (archive footage) Full Cast & Crew Last Season Season 3 2006 | 13 Episodes Season 3 of Cartoon Alley premiered on November  4, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cartoon Alley. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors N 3 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}