{"link": "https://www.themoviedb.org/tv/31745?language=en", "title": "The Exterminators", "resume": "Billy the Exterminator is a scripted American reality television series which airs on the A&E network.\nThe show follows the professional life of Billy Bretherton, an expert in the field of pest control and the proprietor of Vexcon Animal and Pest Control in Benton, Louisiana, which serves the Shreveport-Bossier metropolitan area. Bretherton, a former Senior Airman in the United States Air Force, had previously been featured on the Discovery Channel's Dirty Jobs series on the season 1 episode \"Vexcon\", and the season 2 episode \"Termite Controller\". Both previously and in his current show, Bretherton is known for his unusual fashion style, consisting mostly of black garments with large silver jewelry and steel studs and spikes in various configurations.\nMany members of Bretherton's family, such as his parents, \"Big\" Bill and Donnie, and his brother, Ricky, as well as other employees, make frequent appearances. Donnie Bretherton normally acts as Vexcon's dispatcher and rarely goes out on jobs. Ricky's ex-wife, Pam, resigned during the production of the first season.\nAs noted in many episodes, Billy Bretherton prefers, if at all possible, to relocate captured animals and is a proponent of natural methods of control. He frequently gives a description of the pests, their preferred environment, and any diseases associated with them. Ricky Bretherton acquired an allergy to bee and wasp stings due to being stung so many times.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31745   Expand The Exterminators   (2009) User Score Overview Billy the Exterminator is a scripted American reality television series which airs on the A&E network. The show follows the professional life of Billy Bretherton, an expert in the field of pest control and the proprietor of Vexcon Animal and Pest Control in Benton, Louisiana, which serves the Shreveport-Bossier metropolitan area. Bretherton, a former Senior Airman in the United States Air Force, had previously been featured on the Discovery Channel's Dirty Jobs series on the season 1 episode \"Vexcon\", and the season 2 episode \"Termite Controller\". Both previously and in his current show, Bretherton is known for his unusual fashion style, consisting mostly of black garments with large silver jewelry and steel studs and spikes in various configurations. Many members of Bretherton's family, such as his parents, \"Big\" Bill and Donnie, and his brother, Ricky, as well as other employees, make frequent appearances. Donnie Bretherton normally acts as Vexcon's dispatcher and rarely goes out on jobs. Ricky's ex-wife, Pam, resigned during the production of the first season. As noted in many episodes, Billy Bretherton prefers, if at all possible, to relocate captured animals and is a proponent of natural methods of control. He frequently gives a description of the pests, their preferred environment, and any diseases associated with them. Ricky Bretherton acquired an allergy to bee and wasp stings due to being stung so many times. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2017 | 11 Episodes Season 7 of The Exterminators premiered on April  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Exterminators. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.aetv.com/billy-the-exterminator/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors F 2 FLIX555 1 Sall 1 gianpoker 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}