{"link": "https://www.themoviedb.org/tv/31354?language=en", "title": "Gnome Wesley", "resume": "Kabouter Wesley (English: Gnome Wesley) is a series of comics and short animated cartoons about a grumpy and violent kabouter (gnome), made by Jonas Geirnaert. Both the drawing style and the content are purposely made naive and amateuristic and the situations are surreal and violent. There is also a lot of insulting and toilet humour in the series.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Jonas Geirnaert", "Jelle De Beule"], "character": ["Kabouter Wesley", "Overige stemmen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31354   Expand Gnome Wesley   (2009) User Score Overview Kabouter Wesley (English: Gnome Wesley) is a series of comics and short animated cartoons about a grumpy and violent kabouter (gnome), made by Jonas Geirnaert. Both the drawing style and the content are purposely made naive and amateuristic and the situations are surreal and violent. There is also a lot of insulting and toilet humour in the series. Featured Crew Jonas Geirnaert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonas Geirnaert Kabouter Wesley Jelle De Beule Overige stemmen Full Cast & Crew Last Season Season 1 2009 | 37 Episodes Season 1 of Gnome Wesley premiered on August 31, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gnome Wesley. You can help by rating TV shows you've seen. Facts Original Name  Kabouter Wesley Status  Ended Networks - Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  - Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors D 14 DartA 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}