{"link": "https://www.themoviedb.org/tv/4645?language=en", "title": "14-year-old Mother", "resume": "Miki Ichinose is a 14-year-old schoolgirl who is very outgoing and cheerful. She lives with her parents and younger brother. She is in a romantic relationship with Satoshi Kirino who is 15-years-old. They keep their relationship a secret from their parents because Miki is young and Satoshi is expected to excel in school and get into a university so he can take over the family business by his overbearing mother. One night, after a date, they sneak into a treehouse and consummate their relationship. Soon after, Miki suspects that she is pregnant and steals a pregnancy test, which her mother later finds. She is taken to a doctor who confirms her pregnancy. Initially upset, Miki's parents promise they will support her. Miki tells Satoshi of the pregnancy and he takes the news well. However, his mother is furious when she learns of it and forbids the two from seeing each other.", "rate": 80, "genre": ["Drama"], "cast": ["Mirai Shida", "Misako Tanaka", "Haruma Miura", "Katsuhisa Namase", "Shigeru Muroi"], "character": ["Miki Ichinose", "Satoshi Kirino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4645   Expand 14-year-old Mother   (2006) User Score Overview Miki Ichinose is a 14-year-old schoolgirl who is very outgoing and cheerful. She lives with her parents and younger brother. She is in a romantic relationship with Satoshi Kirino who is 15-years-old. They keep their relationship a secret from their parents because Miki is young and Satoshi is expected to excel in school and get into a university so he can take over the family business by his overbearing mother. One night, after a date, they sneak into a treehouse and consummate their relationship. Soon after, Miki suspects that she is pregnant and steals a pregnancy test, which her mother later finds. She is taken to a doctor who confirms her pregnancy. Initially upset, Miki's parents promise they will support her. Miki tells Satoshi of the pregnancy and he takes the news well. However, his mother is furious when she learns of it and forbids the two from seeing each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mirai Shida Miki Ichinose Misako Tanaka Haruma Miura Satoshi Kirino Katsuhisa Namase Shigeru Muroi Full Cast & Crew Last Season Season 1 2006 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on 14-year-old Mother. You can help by rating TV shows you've seen. Facts Original Name  14才の母 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.ntv.co.jp/14/ Genres Drama Keywords sociology family teenage pregnancy Content Score 93 Almost there... Top Contributors 24 part-mozi 9 Wendy 7 Patrik Selin 3 Cypral  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}