{"link": "https://www.themoviedb.org/tv/13910?language=en", "title": "64 Zoo Lane", "resume": "Lucy is a little girl who lives close to a zoo. Every night, the zoo  animals visit Lucy, tell her an exciting story and send her on a magical  night-time adventure. At the end of each story, the moral of the tale  is discussed,  then bedtime is declared, sending Lucy off for a cosy night's sleep.", "rate": 45, "genre": ["Kids", "Animation"], "cast": ["Anna Bentinck", "Adrienne Posta", "Lara Wollington", "Matt Wilkinson", "Keith Wickham"], "character": ["Lucy's Mother (voice) / Molly (voice) / Giggles (voice)", "Georgina (voice) / Tickles (voice)", "Lucy (voice)", "Boris (voice)", "Nelson (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13910   Expand 64 Zoo Lane   (2001) User Score  Play Trailer Overview Lucy is a little girl who lives close to a zoo. Every night, the zoo  animals visit Lucy, tell her an exciting story and send her on a magical  night-time adventure. At the end of each story, the moral of the tale  is discussed,  then bedtime is declared, sending Lucy off for a cosy night's sleep. Featured Crew An Vrombaut Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Bentinck Lucy's Mother (voice) / Molly (voice) / Giggles (voice) Adrienne Posta Georgina (voice) / Tickles (voice) Lara Wollington Lucy (voice) Matt Wilkinson Boris (voice) Keith Wickham Nelson (voice) Full Cast & Crew Last Season Season 4 2012 | 26 Episodes Season 4 of 64 Zoo Lane premiered on October 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 64 Zoo Lane. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.bbc.co.uk/programmes/b0079wgb Genres Kids Animation Keywords zoo bedtime story Content Score 100 Yes! Looking good! Top Contributors 84 Marr 🇳🇱 6 Banana TB 3 TMDb Bot 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}