{"link": "https://www.themoviedb.org/tv/58460?language=en", "title": "Bad Education", "resume": "Young teacher Alfie Wickers is \"the worst teacher ever to grace the British education system\" – at Abbey Grove School, in Watford Hertfordshire.", "rate": 74, "genre": ["Comedy"], "cast": ["Jack Whitehall", "Jack Binstead", "Sarah Solemani", "Mathew Horne", "Layton Williams"], "character": ["Alfie Wickers", "Rem Dogg", "Rosie Gulliver", "Fraser", "Stephen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58460   Expand Bad Education   (2012) User Score  Play Trailer Overview Young teacher Alfie Wickers is \"the worst teacher ever to grace the British education system\" – at Abbey Grove School, in Watford Hertfordshire. Featured Crew Jack Whitehall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Whitehall Alfie Wickers Jack Binstead Rem Dogg Sarah Solemani Rosie Gulliver Mathew Horne Fraser Layton Williams Stephen Full Cast & Crew Last Season Series 3 2014 | 6 Episodes Season 3 of Bad Education premiered on September 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2015-06-30 Not Safe for Work 7.3    2016-06-08 Power Monkeys 7.0    2016-07-04 Brief Encounters 7.3    2011-09-14 Free Agents 4.8    2010-09-28 Whites 6.7    2010-09-06 Him & Her 7.5    2013-05-12 Family Tree 6.2    2008-09-24 Celebrity Juice 7.3  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p01djw5m Genres Comedy Keywords high school education teacher school high school teacher british comedy sitcom british humour workplace comedy Content Score 100 Yes! Looking good! Top Contributors 34 Elizabeth Jennings 17 OmgImAlexis a 13 additup 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}