{"link": "https://www.themoviedb.org/tv/32798?language=en", "title": "Hawaii Five-0", "resume": "Steve McGarrett returns home to Oahu, in order to find his father's killer. The governor offers him the chance to run his own task force (Five-0). Steve's team is joined by Chin Ho Kelly, Danny \"Danno\" Williams, and Kono Kalakaua.", "rate": 63, "genre": ["Action", "Crime", "Drama"], "cast": ["Alex O'Loughlin", "Scott Caan", "Ian Anthony Dale", "Meaghan Rath", "Jorge Garcia"], "character": ["Steve McGarrett", "Danny \"Danno\" Williams", "Adam Noshimuri", "Tani Rey", "Jerry Ortega"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32798   Expand Hawaii Five-0   (2010) User Score  Play Trailer Overview Steve McGarrett returns home to Oahu, in order to find his father's killer. The governor offers him the chance to run his own task force (Five-0). Steve's team is joined by Chin Ho Kelly, Danny \"Danno\" Williams, and Kono Kalakaua. Featured Crew Leonard Freeman Creator Roberto Orci Creator Alex Kurtzman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  42 Content Issues  0 Images Backdrops  18 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex O'Loughlin Steve McGarrett Scott Caan Danny \"Danno\" Williams Ian Anthony Dale Adam Noshimuri Meaghan Rath Tani Rey Jorge Garcia Jerry Ortega Full Cast & Crew Last Season Season 8 2017 | 25 Episodes View All Seasons Social Reviews  0 Discussions  42 Subject Status Replies Last Reply b Adam Open 15 by  Jayhn1111 w S8E20 \"He Lokomaika'i Ka Manu O Kaiona\" Open 1 by  Jayhn1111 I Miss Catherine... Open 11 by  bratface Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  18 Recommendations   2009-09-22 NCIS: Los Angeles 6.4    2014-09-23 NCIS: New Orleans 6.3    2005-03-17 NCIS 6.7    2010-09-24 Blue Bloods 6.8    2007-06-28 Burn Notice 7.3    2005-09-22 Criminal Minds 7.0    2014-01-08 Chicago P.D. 6.9    2009-03-08 Castle 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/hawaii_five_0/ Genres Action Crime Drama Keywords hawaii remake task force criminal investigation Content Score 100 Yes! Looking good! Top Contributors 72 Banana 59 Elizabeth Jennings 48 niqo19 35 Jorge Torre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}