{"link": "https://www.themoviedb.org/tv/20724?language=en", "title": "Sai de Baixo", "resume": "Sai de Baixo is a Brazilian sitcom that first aired on Rede Globo.\nIt followed the lives of the members of a dysfunctional family, their maid and the doorman of the apartment building in which they lived.\nIt ran for 7 seasons, from 1996 to 2002, on Sunday nights after the newsmagazine Fantastico. That means that it always aired after 10 o'clock p.m., which was necessary given the show's heavy language and sexual innuendos. In 2000, however, the premiere of a new reality show shifted the program to the 11:30 p.m. slot, which lasted for about four months. After that the timeslot varied almost monthly, which started to hurt ratings. At one time, the show was airing around 12:30 a.m., which is considered the beginning of the \"wasteland\" of late night programming in Brazilian television, with fewer viewers and, therefore, fewer sponsors.\nThe show was hailed as a \"breath of fresh air\" in Brazilian TV comedy, given its innovative format and funny, smart stories. It was also considered the \"lifeline\" of Sunday night programming in Brazilian network television. This status did not last until the very end though. The show is considered to have jumped the shark around its 5th season, and was supposedly kept on the air only because Globo TV had nothing to replace it with. Towards the end, ratings had plummeted and the show had slid to what was called a \"vulgar version\" of its original, groundbreaking style.", "rate": 88, "genre": ["Comedy"], "cast": ["Miguel Falabella", "Cláudia Rodrigues", "Lucas Hornos", "Luis Gustavo Sánchez Blanco", "Marisa Orth"], "character": ["Sirene", "Caquinho", "Vavá", "Magda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20724   Expand Sai de Baixo   (1996) User Score Overview Sai de Baixo is a Brazilian sitcom that first aired on Rede Globo. It followed the lives of the members of a dysfunctional family, their maid and the doorman of the apartment building in which they lived. It ran for 7 seasons, from 1996 to 2002, on Sunday nights after the newsmagazine Fantastico. That means that it always aired after 10 o'clock p.m., which was necessary given the show's heavy language and sexual innuendos. In 2000, however, the premiere of a new reality show shifted the program to the 11:30 p.m. slot, which lasted for about four months. After that the timeslot varied almost monthly, which started to hurt ratings. At one time, the show was airing around 12:30 a.m., which is considered the beginning of the \"wasteland\" of late night programming in Brazilian television, with fewer viewers and, therefore, fewer sponsors. The show was hailed as a \"breath of fresh air\" in Brazilian TV comedy, given its innovative format and funny, smart stories. It was also considered the \"lifeline\" of Sunday night programming in Brazilian network television. This status did not last until the very end though. The show is considered to have jumped the shark around its 5th season, and was supposedly kept on the air only because Globo TV had nothing to replace it with. Towards the end, ratings had plummeted and the show had slid to what was called a \"vulgar version\" of its original, groundbreaking style. Featured Crew Luis Gustavo Sánchez Blanco Creator Daniel Filho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miguel Falabella Cláudia Rodrigues Sirene Lucas Hornos Caquinho Luis Gustavo Sánchez Blanco Vavá Marisa Orth Magda Full Cast & Crew Last Season Season 8 2013 | 4 Episodes Season 8 of Sai de Baixo premiered on June 11, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1986-09-13 Wildfire 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  45m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 26 klubesocial 3 Renato  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}