{"link": "https://www.themoviedb.org/tv/24106?language=en", "title": "Captain Tsubasa - Road to 2002", "resume": "Tsubasa becomes a superstar amongst soccer players in Brazil. He is now planning to play in Europe. At an important must-win game, as the fans cheer him on, Tsubasa looks back at the days when he started his soccer life. His passion to make goals and win the game is as strong as it was during his childhood. He recalls the games and moments that had decisive impact on his life. He remembers Goalkeeper Wakabayashi, Genius striker Hyuga, tender-hearted Misaki and Coach Roberto. He was happy to meet them, enjoyed playing with them, and learned many things from them. The whistle sounds and the game begins. Tsubasa dashes for the ball!", "rate": 61, "genre": ["Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24106   Expand Captain Tsubasa - Road to 2002   (2001) User Score Overview Tsubasa becomes a superstar amongst soccer players in Brazil. He is now planning to play in Europe. At an important must-win game, as the fans cheer him on, Tsubasa looks back at the days when he started his soccer life. His passion to make goals and win the game is as strong as it was during his childhood. He recalls the games and moments that had decisive impact on his life. He remembers Goalkeeper Wakabayashi, Genius striker Hyuga, tender-hearted Misaki and Coach Roberto. He was happy to meet them, enjoyed playing with them, and learned many things from them. The whistle sounds and the game begins. Tsubasa dashes for the ball! Featured Crew Yôichi Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Road to victory 2002 | 17 Episodes Season 3 of Captain Tsubasa - Road to 2002 premiered on June 15, 2002. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Captain Tsubasa - Road to 2002. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2000-04-18 Yu-Gi-Oh! Duel Monsters 7.1    1998-04-04 Yu-Gi-Oh! 6.4    1997-09-13 Recess 6.8    2002-06-07 Kim Possible 6.7    1991-04-26 Dinosaurs 7.2    1981-09-12 The Smurfs 6.2    2001-03-30 The Fairly OddParents 6.7    1987-09-18 DuckTales 7.6  Facts Original Name  Captain Tsubasa: Road to 2002 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Drama Keywords sport Content Score 64 We're so close, yet so far. Top Contributors HM 14 Horst Merten R 13 RoadtoParadise t 12 taito CN 7 Carmelo Nicolosi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}