{"link": "https://www.themoviedb.org/tv/31120?language=en", "title": "Shining Inheritance", "resume": "Go Eun Sung leads a charmed life. Her wealthy, adoring father allows her to live her dreams of studying abroad, and the only difficulty in her life is her younger brother's struggle with autism. Despite all this good fortune, everything changes for Eun Sang when her loving father dies of mysterious circumstances. After the family discovers that Eun Sang's father left behind a tremendous amount of debt, her stepmother promptly throws her and her brother out of the house. Homeless and penniless, Eun Sung takes a job as a waitress at a nightclub to support herself and her brother. Eun Sung hits rock bottom when her brother disappears. Her fortunes turn, however when her kindness lands her a new lucrative job and a new family of sorts, which leads to new fortune, but also new obstacles.\nBrilliant Legacy was among the top-rated Korean dramas of the year; it maintained its number one spot in the viewership ratings chart for 19 consecutive weeks and reached a peak rating of 47.1% for its last episode.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["Han Hyo-joo", "Lee Seung-gi", "Moon Chae-won", "Bae Soo-bin", "Min Young-won"], "character": ["Go Eun Sung", "Sunwoo Hwan", "Yoo Seung-mi", "Park Joon-se", "Lee Hye-ri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31120   Expand Shining Inheritance   (2009) User Score Overview Go Eun Sung leads a charmed life. Her wealthy, adoring father allows her to live her dreams of studying abroad, and the only difficulty in her life is her younger brother's struggle with autism. Despite all this good fortune, everything changes for Eun Sang when her loving father dies of mysterious circumstances. After the family discovers that Eun Sang's father left behind a tremendous amount of debt, her stepmother promptly throws her and her brother out of the house. Homeless and penniless, Eun Sung takes a job as a waitress at a nightclub to support herself and her brother. Eun Sung hits rock bottom when her brother disappears. Her fortunes turn, however when her kindness lands her a new lucrative job and a new family of sorts, which leads to new fortune, but also new obstacles. Brilliant Legacy was among the top-rated Korean dramas of the year; it maintained its number one spot in the viewership ratings chart for 19 consecutive weeks and reached a peak rating of 47.1% for its last episode. Featured Crew So Hyun Kyung Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Hyo-joo Go Eun Sung Lee Seung-gi Sunwoo Hwan Moon Chae-won Yoo Seung-mi Bae Soo-bin Park Joon-se Min Young-won Lee Hye-ri Full Cast & Crew Last Season Season 1 2009 | 28 Episodes Season 1 of Shining Inheritance premiered on April 25, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Shining Inheritance. You can help by rating TV shows you've seen. Facts Original Name  찬란한 유산 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://tv.sbs.co.kr/usan/index.html Genres Comedy Drama Keywords korea Content Score 93 Almost there... Top Contributors M 27 Maria180493 b 11 bielorkut N 10 Nightowl.Kr t 10 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}