{"link": "https://www.themoviedb.org/tv/58808?language=en", "title": "The Secret of Crickley Hall", "resume": "A year after the disappearance of their son, Gabe and Eve Caleigh and their two daughters attempt to start anew, they head to Crickley Hall - a seemingly perfect countryside house. But when cellar doors start to open on their own, phantom children's cries are heard through the night and a frenzied cane-wielding specter rears its head - the Caleigh's realize the house comes with a lot more than they bargained for. Just as they're ready to move out, Eve Caleigh hears Cam's cries and all bets are off.", "rate": 69, "genre": ["Drama"], "cast": ["Suranne Jones", "Maisie Williams", "Tom Ellis", "Douglas Henshall", "Olivia Cooke"], "character": ["Eve Caleigh", "Loren Caleigh", "Gabe Caleigh", "Augustus Cribben", "Nancy Linnet"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58808   Expand The Secret of Crickley Hall   (2012) User Score Overview A year after the disappearance of their son, Gabe and Eve Caleigh and their two daughters attempt to start anew, they head to Crickley Hall - a seemingly perfect countryside house. But when cellar doors start to open on their own, phantom children's cries are heard through the night and a frenzied cane-wielding specter rears its head - the Caleigh's realize the house comes with a lot more than they bargained for. Just as they're ready to move out, Eve Caleigh hears Cam's cries and all bets are off. Featured Crew Joe Ahearne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Suranne Jones Eve Caleigh Maisie Williams Loren Caleigh Tom Ellis Gabe Caleigh Douglas Henshall Augustus Cribben Olivia Cooke Nancy Linnet Full Cast & Crew Last Season Season 1 2012 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2010-08-03 The Deep 5.8    2014-11-23 Remember Me 6.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p00t081w Genres Drama Keywords based on novel or book orphanage haunted house miniseries new home missing child ghost Content Score 93 Almost there... Top Contributors 37 Banana TB 18 TMDb Bot 17 Elizabeth Jennings w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}