{"link": "https://www.themoviedb.org/tv/1421?language=en", "title": "Modern Family", "resume": "The Pritchett-Dunphy-Tucker clan is a wonderfully large and blended family. They give us an honest and often hilarious look into the sometimes warm, sometimes twisted, embrace of the modern family.", "rate": 73, "genre": ["Comedy"], "cast": ["Julie Bowen", "Ty Burrell", "Jesse Tyler Ferguson", "Eric Stonestreet", "Sofía Vergara"], "character": ["Claire Dunphy", "Phil Dunphy", "Mitchell Pritchett", "Cameron Tucker", "Gloria Delgado-Pritchett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1421   Expand Modern Family   (2009) User Score  Play Trailer Overview The Pritchett-Dunphy-Tucker clan is a wonderfully large and blended family. They give us an honest and often hilarious look into the sometimes warm, sometimes twisted, embrace of the modern family. Featured Crew Steven Levitan Creator Christopher Lloyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  13 Content Issues  3 Images Backdrops  41 Posters  27 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julie Bowen Claire Dunphy Ty Burrell Phil Dunphy Jesse Tyler Ferguson Mitchell Pritchett Eric Stonestreet Cameron Tucker Sofía Vergara Gloria Delgado-Pritchett Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 9 2017 | 22 Episodes Season 9 of Modern Family premiered on September 26, 2017. View All Seasons Social Reviews  0 Discussions  16 Subject Status Replies Last Reply Has this show lost it's edge? Open 1 by  Taylorfirst1 w Haley: Happy Birthday Sarah Hyland! Open 0 by wonder2wonder\n      \n     w Luke: Happy Birthday Nolan Gould! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  41 Posters  27 Recommendations   2005-09-19 How I Met Your Mother 7.4    2003-11-02 Arrested Development 8.2    2009-09-17 Community 7.9    2011-09-20 New Girl 6.5    2005-03-24 The Office 8.0    2003-09-22 Two and a Half Men 6.2    2006-10-11 30 Rock 7.1    2009-04-09 Parks and Recreation 7.9  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  25m Homepage   http://abc.go.com/shows/modern-family Genres Comedy Keywords gay family relationships mockumentary breaking the fourth wall family sitcom blended family Content Score 100 Yes! Looking good! Top Contributors 204 Marr 🇳🇱 117 Elizabeth Jennings 105 Banana 51 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}