{"link": "https://www.themoviedb.org/tv/55925?language=en", "title": "Hanzawa Naoki", "resume": "Hanzawa Naoki (Sakai Masato) works as a loan manager at the Osaka Nishi branch of Tokyo Central Bank. One day, Hanzawa makes a loan contract for 500 million yen with Nishi Osaka Steel Company. Hanzawa didn't want to approve the loan, but he had to due to the branch manager's order. Nishi Osaka Steel Company seems financially stable, but the company actually hides massive amounts of debt through fraudulent accounts. The company is caught. Three months later, Nishi Osaka Steel Company goes bankrupt. The bank's branch manager is Asano. He is an ambitious man and tries to shift the blame to Hanzawa. Hanzawa then attends an inquiry about the loan failure at the bank's headquarters in Tokyo. Hanzawa denies fault and promises to retrieve the 500 million yen loan. He did this because it's the only way for Hanzawa to survive as a banker.", "rate": 83, "genre": ["Drama"], "cast": ["Masato Sakai", "Teruyuki Kagawa", "Mitsuhiro Oikawa", "Kenichi Takito", "Kinya Kitaoji"], "character": ["Naoki Hanzawa", "Akira Owada", "Shinobu Tomari", "Naosuke Kondo", "Ken Nakanowatari"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55925   Expand Hanzawa Naoki   (2013) User Score Overview Hanzawa Naoki (Sakai Masato) works as a loan manager at the Osaka Nishi branch of Tokyo Central Bank. One day, Hanzawa makes a loan contract for 500 million yen with Nishi Osaka Steel Company. Hanzawa didn't want to approve the loan, but he had to due to the branch manager's order. Nishi Osaka Steel Company seems financially stable, but the company actually hides massive amounts of debt through fraudulent accounts. The company is caught. Three months later, Nishi Osaka Steel Company goes bankrupt. The bank's branch manager is Asano. He is an ambitious man and tries to shift the blame to Hanzawa. Hanzawa then attends an inquiry about the loan failure at the bank's headquarters in Tokyo. Hanzawa denies fault and promises to retrieve the 500 million yen loan. He did this because it's the only way for Hanzawa to survive as a banker. Featured Crew Jun Ikeido Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masato Sakai Naoki Hanzawa Teruyuki Kagawa Akira Owada Mitsuhiro Oikawa Shinobu Tomari Kenichi Takito Naosuke Kondo Kinya Kitaoji Ken Nakanowatari Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of Hanzawa Naoki premiered on July  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hanzawa Naoki. You can help by rating TV shows you've seen. Facts Original Name  半沢直樹 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.tbs.co.jp/hanzawa_naoki/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors n 24 naka c 13 ctchim 7 fmsonic 5 signxer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}