{"link": "https://www.themoviedb.org/tv/70566?language=en", "title": "Clique", "resume": "In the first year of uni, childhood best friends Holly and Georgia find themselves drawn to an elite clique. When Holly begins to suspect darkness lurks beneath the glamour, she will do anything to save her soulmate.", "rate": 57, "genre": ["Drama"], "cast": ["Emma Appleton", "Jack Bannon", "Synnove Karlsen", "Ella-Rae Smith", "Sophia Brown"], "character": ["Fay Brookstone", "James Buxton", "Holly McStay", "Phoebe Parker-Fox", "Louise Taggart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70566   Expand Clique   (2017) User Score Overview In the first year of uni, childhood best friends Holly and Georgia find themselves drawn to an elite clique. When Holly begins to suspect darkness lurks beneath the glamour, she will do anything to save her soulmate. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emma Appleton Fay Brookstone Jack Bannon James Buxton Synnove Karlsen Holly McStay Ella-Rae Smith Phoebe Parker-Fox Sophia Brown Louise Taggart Full Cast & Crew Last Season Series 1 2017 | 6 Episodes Season 1 of Clique premiered on March  5, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Very Promising 2 Episodes In Open 0 by domremy\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2017-03-31 13 Reasons Why 7.2  Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.bbc.co.uk/programmes/p04qm31j Genres Drama Keywords feminism suspense student university crime 21st century Content Score 93 Almost there... Top Contributors 21 szab 10 david8s95 y 8 yulasta 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}