{"link": "https://www.themoviedb.org/tv/80475?language=en", "title": "Wellington Paranormal", "resume": "New Zealand's capital is a hotbed of supernatural activity... so Officers Minogue and O'Leary, who featured in the vampire documentary What We Do In The Shadows, take to the streets to investigate all manner of paranormal phenomena.", "rate": 0, "genre": ["Comedy"], "cast": ["Karen O'Leary", "Mike Minogue", "Maaka Pohatu"], "character": ["Officer O'Leary", "Officer Minogue", "Sergeant Ruawai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80475   Expand Wellington Paranormal   (2018) User Score  Play Trailer Overview New Zealand's capital is a hotbed of supernatural activity... so Officers Minogue and O'Leary, who featured in the vampire documentary What We Do In The Shadows, take to the streets to investigate all manner of paranormal phenomena. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karen O'Leary Officer O'Leary Mike Minogue Officer Minogue Maaka Pohatu Sergeant Ruawai Full Cast & Crew Next Season Season 1 2018 | 0 Episodes Season 1 of Wellington Paranormal is set to premiere on July 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Facts Status  In Production Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://www.tvnz.co.nz/shows/wellington-paranormal Genres Comedy Keywords mockumentary based on movie Content Score 64 We're so close, yet so far. Top Contributors 21 Elizabeth Jennings 4 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}