{"link": "https://www.themoviedb.org/tv/65831?language=en", "title": "Ms. Temper & Nam Jung Gi", "resume": "Ok Da-Jung is the youngest team leader in the cosmetics industry. She has divorced three times so far. She doesn't care what others think about her and she also has quite a temper. Nam Jung-Gi works as a section chief at the same cosmetics company as Ok Da-Jung. Unlike her, Nam Jung-Gi has a timid and nice personality. He can't say anything that makes others uncomfortable. He is able to make Ok Da-Jung's blood boil.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Lee Yo-won", "Yoon Sang-hyun", "Hwang Chan-sung", "Im Ha-ryong", "Son Jong-hak"], "character": ["Ok Da-Jung", "Nam Jung-Gi", "Nam Bong-Gi", "Jung-Gi's Father", "Kim Hwan-Gyoo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65831   Expand Ms. Temper & Nam Jung Gi   (2016) User Score Overview Ok Da-Jung is the youngest team leader in the cosmetics industry. She has divorced three times so far. She doesn't care what others think about her and she also has quite a temper. Nam Jung-Gi works as a section chief at the same cosmetics company as Ok Da-Jung. Unlike her, Nam Jung-Gi has a timid and nice personality. He can't say anything that makes others uncomfortable. He is able to make Ok Da-Jung's blood boil. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yo-won Ok Da-Jung Yoon Sang-hyun Nam Jung-Gi Hwang Chan-sung Nam Bong-Gi Im Ha-ryong Jung-Gi's Father Son Jong-hak Kim Hwan-Gyoo Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of Ms. Temper & Nam Jung Gi premiered on March 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2012-08-18 Panda and Hedgehog 6.0    2014-03-17 Secret Love Affair 7.8    2016-08-27 Our Gap Soon 9.3    2016-03-16 Goodbye Mr. Black 5.4    2017-09-04 Argon 6.8    2016-11-21 White Nights 8.0    2016-05-13 Mirror of the Witch 5.2    2016-09-02 Fantastic 4.9  Facts Original Name  욱씨남정기 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.joins.com/wookc/ Genres Comedy Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 39 Maria180493 z 15 zurman1 h 4 hl5ydg V 4 Violsa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}