{"link": "https://www.themoviedb.org/tv/4028?language=en", "title": "Legion of Super Heroes", "resume": "Legion of Super Heroes is an American animated television series produced by Warner Bros. Animation that debuted on September 23, 2006, and is based on characters owned by DC Comics. The series centers on a young Superman's adventures in the 31st century, fighting alongside a group of futuristic superheroes known as the Legion of Super-Heroes. The show was produced by its main designer James Tucker, a co-producer of the Justice League Unlimited series, for the Kids' WB line on The CW network.\nThe series drew on the rich history of the Legion of Super-Heroes, taking inspiration from stories set during all time periods of the team's nearly 50-year history in comics. Continuity is internally consistent but is not shared with any previous incarnation of the Legion, either animated or in print. The series was cancelled after its second season.", "rate": 65, "genre": ["Animation"], "cast": ["Adam Wylie", "Yuri Lowenthal", "Andy Milder", "Kari Wahlgren"], "character": ["Brainiac 5 (voice)", "Superman / Kell-El (voice)", "Lightning Lad / Garth Ranzz (voice)", "Saturn Girl (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4028   Expand Legion of Super Heroes   (2006) User Score Overview Legion of Super Heroes is an American animated television series produced by Warner Bros. Animation that debuted on September 23, 2006, and is based on characters owned by DC Comics. The series centers on a young Superman's adventures in the 31st century, fighting alongside a group of futuristic superheroes known as the Legion of Super-Heroes. The show was produced by its main designer James Tucker, a co-producer of the Justice League Unlimited series, for the Kids' WB line on The CW network. The series drew on the rich history of the Legion of Super-Heroes, taking inspiration from stories set during all time periods of the team's nearly 50-year history in comics. Continuity is internally consistent but is not shared with any previous incarnation of the Legion, either animated or in print. The series was cancelled after its second season. Featured Crew Al Plastino Creator Otto Binder Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Wylie Brainiac 5 (voice) Yuri Lowenthal Superman / Kell-El (voice) Andy Milder Lightning Lad / Garth Ranzz (voice) Kari Wahlgren Saturn Girl (voice) Full Cast & Crew Last Season Season 2 2007 | 13 Episodes Season 2 of Legion of Super Heroes premiered on September 22, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2010-11-26 Young Justice 8.2    2000-11-04 X-Men: Evolution 7.3    2010-11-26 Transformers: Prime 7.4    1999-01-10 Batman Beyond 7.8    2000-09-09 Jackie Chan Adventures 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 9 Rebecca 6 joaoricardo z 5 zurman1 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}