{"link": "https://www.themoviedb.org/tv/34164?language=en", "title": "Haibane Renmei", "resume": "A dream of falling from the sky...and then birth. Rakka is born from a large cocoon into the Old Home, greeted by a group of females with small wings on their backs and shining halos above their heads. Soon Rakka’s own wings grow, a halo is placed on her head and she is told that she must work in the nearby town of Grie. She soon realizes that the town and the entire world they live in are confined behind the Wall, a tall, impenetrable wall that none except the mysterious Toga are allowed to exit.", "rate": 77, "genre": ["Animation", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Akiko Yajima", "Junko Noda", "Fumiko Orikasa", "Ryou Hirohashi", "Eri Miyajima"], "character": ["Kuu", "Reki", "Hikari", "Rakka", "Kana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34164   Expand Haibane Renmei   (2002) User Score Overview A dream of falling from the sky...and then birth. Rakka is born from a large cocoon into the Old Home, greeted by a group of females with small wings on their backs and shining halos above their heads. Soon Rakka’s own wings grow, a halo is placed on her head and she is told that she must work in the nearby town of Grie. She soon realizes that the town and the entire world they live in are confined behind the Wall, a tall, impenetrable wall that none except the mysterious Toga are allowed to exit. Featured Crew Yoshitoshi ABe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiko Yajima Kuu Junko Noda Reki Fumiko Orikasa Hikari Ryou Hirohashi Rakka Eri Miyajima Kana Full Cast & Crew Last Season Season 1 2002 | 13 Episodes Season 1 of Haibane Renmei premiered on October  9, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  8 Recommendations   2012-01-10 Daily Lives of High School Boys 7.3    2006-04-03 The Melancholy of Haruhi Suzumiya 7.6  Facts Original Name  灰羽連盟 Status  Ended Networks Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Mystery Sci-Fi & Fantasy Keywords japan angel redemption animation anime Content Score 93 Almost there... Top Contributors 37 Ailurus Fulgens 8 qw0aszx M 5 MAthePA V 3 VegaKita  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}