{"link": "https://www.themoviedb.org/tv/34156?language=en", "title": "Chiefs", "resume": "Chiefs is a television miniseries based upon the novel of the same name by Stuart Woods. It was broadcast on CBS over three nights in November 1983. It was directed by Jerry London, and stars Charlton Heston, Keith Carradine, Stephen Collins, Danny Glover, Wayne Rogers, and Billy Dee Williams. It received three Emmy Award nominations and one Eddie Award nomination.", "rate": 75, "genre": ["Drama"], "cast": ["Charlton Heston", "Keith Carradine", "Stephen Collins", "Brad Davis", "Wayne Rogers"], "character": ["Hugh Holmes", "Foxy Funderburke", "Billy Lee", "Sonny Butts", "Will Henry Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34156   Expand Chiefs   (1983) User Score  Play Trailer Overview Chiefs is a television miniseries based upon the novel of the same name by Stuart Woods. It was broadcast on CBS over three nights in November 1983. It was directed by Jerry London, and stars Charlton Heston, Keith Carradine, Stephen Collins, Danny Glover, Wayne Rogers, and Billy Dee Williams. It received three Emmy Award nominations and one Eddie Award nomination. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlton Heston Hugh Holmes Keith Carradine Foxy Funderburke Stephen Collins Billy Lee Brad Davis Sonny Butts Wayne Rogers Will Henry Lee Full Cast & Crew Last Season Season 1 1983 | 7 Episodes Season 1 of Chiefs premiered on November 13, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2014-02-16 Quirke 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  360m Homepage  - Genres Drama Keywords police chief miniseries murder investigation Content Score 93 Almost there... Top Contributors 12 Steve 8 Banana TB 7 TMDb Bot 4 bernadette5961  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}