{"link": "https://www.themoviedb.org/tv/61463?language=en", "title": "The Affair", "resume": "The Affair explores the emotional effects of an extramarital relationship between Noah Solloway and Alison Lockhart after the two meet in the resort town of Montauk in Long Island. Noah is a New York City schoolteacher with one novel published (book entitled A Person who Visits a Place) and he is struggling to write a second book. He is happily married with four children, but resents his dependence on his wealthy father-in-law. Alison is a young waitress trying to piece her life and marriage back together in the wake of the tragic death of her child. The story of the affair is told separately, complete with distinct memory biases, from the male and female perspectives.", "rate": 64, "genre": ["Drama"], "cast": ["Dominic West", "Ruth Wilson", "Maura Tierney", "Joshua Jackson", "Julia Goldani Telles"], "character": ["Noah Solloway", "Alison Bailey", "Helen Solloway", "Cole Lockhart", "Whitney Solloway"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61463   Expand The Affair   (2014) User Score  Play Trailer Overview The Affair explores the emotional effects of an extramarital relationship between Noah Solloway and Alison Lockhart after the two meet in the resort town of Montauk in Long Island. Noah is a New York City schoolteacher with one novel published (book entitled A Person who Visits a Place) and he is struggling to write a second book. He is happily married with four children, but resents his dependence on his wealthy father-in-law. Alison is a young waitress trying to piece her life and marriage back together in the wake of the tragic death of her child. The story of the affair is told separately, complete with distinct memory biases, from the male and female perspectives. Featured Crew Hagai Levi Creator Sarah Treem Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  17 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Dominic West Noah Solloway Ruth Wilson Alison Bailey Maura Tierney Helen Solloway Joshua Jackson Cole Lockhart Julia Goldani Telles Whitney Solloway Full Cast & Crew Current Season Season 4 2018 | 7 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Rewatching Open 0 by jingles173\n      \n     Season 3 finale - I'm confused ? Open 5 by  jingles173 Go to Discussions Media Most Popular Videos  2 Backdrops  17 Posters  11 Recommendations   2013-09-29 Masters of Sex 6.6    2015-01-29 Fortitude 6.9    2015-01-11 Togetherness 6.0    2013-05-12 The Fall 7.6    2014-09-26 Transparent 6.7    2013-07-10 The Bridge 6.3    2014-10-28 The Missing 7.0    2014-06-01 Halt and Catch Fire 7.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.sho.com/the-affair Genres Drama Keywords infidelity murderer extramarital affair complicated relationships Content Score 100 Yes! Looking good! Top Contributors 64 Elizabeth Jennings 25 Coquelicot a 11 adambakir92 10 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}