{"link": "https://www.themoviedb.org/tv/730?language=en", "title": "Dinnerladies", "resume": "Dinnerladies is a BBC sitcom written by and starring Victoria Wood that chronicles the antics of a group of workers in a canteen in the north of England. Bren tries to maintain a semblance of order in amongst the chaos, while dealing with the canteen supervisor, slightly sex-obsessed cancer sufferer Tony. Dolly and Jean are the bickering menopausal older women, always at odds but best friends beneath it all. Then there's thick-as-two-short-planks Anita, and the terminally uninterested Twinkle, more concerned with having a good time than anything else. Making up the motley crew are military man handyman Stan, all rules and regulations, and ditzy Philippa, who never seems to get anything right.", "rate": 66, "genre": ["Comedy"], "cast": ["Maxine Peake", "Thelma Barlow", "Anne Reid", "Shobna Gulati", "Duncan Preston"], "character": ["Anita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 730   Expand Dinnerladies   (1998) User Score Overview Dinnerladies is a BBC sitcom written by and starring Victoria Wood that chronicles the antics of a group of workers in a canteen in the north of England. Bren tries to maintain a semblance of order in amongst the chaos, while dealing with the canteen supervisor, slightly sex-obsessed cancer sufferer Tony. Dolly and Jean are the bickering menopausal older women, always at odds but best friends beneath it all. Then there's thick-as-two-short-planks Anita, and the terminally uninterested Twinkle, more concerned with having a good time than anything else. Making up the motley crew are military man handyman Stan, all rules and regulations, and ditzy Philippa, who never seems to get anything right. Featured Crew Victoria Wood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maxine Peake Thelma Barlow Anne Reid Shobna Gulati Anita Duncan Preston Full Cast & Crew Last Season Season 2 1999 | 10 Episodes Season 2 of Dinnerladies premiered on November 25, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2002-11-14 Harry Hill's TV Burp 7.2    1999-01-08 Gimme Gimme Gimme 7.0    1971-04-10 The Two Ronnies 9.0    1985-09-01 In Sickness and in Health 7.9    2007-08-27 Outnumbered 7.2    1965-07-22 Till Death Us Do Part 7.2    2001-02-26 Two Pints of Lager and a Packet of Crisps 7.0    2000-01-12 That Peter Kay Thing 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/dinnerladies/index.shtml Genres Comedy Keywords northern england manager workplace yorkshire working class staff sitcom canteen british humour handyman workplace comedy Content Score 93 Almost there... Top Contributors O 19 Ozbourne R 6 Rebecca 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}