{"link": "https://www.themoviedb.org/tv/17829?language=en", "title": "Engie Benjy", "resume": "Engie Benjy is a pre-school children's television show, broadcast on ITV's children's strand, CITV. Engie Benjy is a blue haired boy, a mechanic who helps fix problems with his friends' vehicles. His dog is Jollop. Other characters include Pilot Pete and Astronaut Al. The vehicles included in the show are a van, a bus, a bike, a plane, a boat, a tractor and a spaceship.\nEngie Benjy has a few catch phrases: \"whadda-we-do-Dan?\", \"This is an emergency!\" and \"Great work team!\" Engie also has a song he sings when solving a problem: \"There's a problem here without a doubt, let's look around and check it out... Spin the screws, hear the hum, check the temperature..\" before Jenny joins in singing \"Make a mess, break stuff, whack the dummy with a bat....\"\nThe main character voices are provided by television double act, Ant and Dec. In the first series Dec voiced the title role of Engie Benjy while Ant voiced his dog, Jollop. In the third series another character was added for Ant to voice called Trucker Troy, Engie Benjy's cousin, whilst Brianna Gentilella, the duo's American rival, voices Jenny, the assistant of Benjy.\nMany of the other characters are voiced by the entertainer Les Dennis.", "rate": 0, "genre": ["Animation"], "cast": ["Declan Donnelly"], "character": ["Engie Benjy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17829   Expand Engie Benjy User Score Overview Engie Benjy is a pre-school children's television show, broadcast on ITV's children's strand, CITV. Engie Benjy is a blue haired boy, a mechanic who helps fix problems with his friends' vehicles. His dog is Jollop. Other characters include Pilot Pete and Astronaut Al. The vehicles included in the show are a van, a bus, a bike, a plane, a boat, a tractor and a spaceship. Engie Benjy has a few catch phrases: \"whadda-we-do-Dan?\", \"This is an emergency!\" and \"Great work team!\" Engie also has a song he sings when solving a problem: \"There's a problem here without a doubt, let's look around and check it out... Spin the screws, hear the hum, check the temperature..\" before Jenny joins in singing \"Make a mess, break stuff, whack the dummy with a bat....\" The main character voices are provided by television double act, Ant and Dec. In the first series Dec voiced the title role of Engie Benjy while Ant voiced his dog, Jollop. In the third series another character was added for Ant to voice called Trucker Troy, Engie Benjy's cousin, whilst Brianna Gentilella, the duo's American rival, voices Jenny, the assistant of Benjy. Many of the other characters are voiced by the entertainer Les Dennis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Declan Donnelly Engie Benjy Full Cast & Crew Last Season Season 1 — | 52 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}