{"link": "https://www.themoviedb.org/tv/18696?language=en", "title": "Cavalcade of America", "resume": "Cavalcade of America is an anthology drama series that was sponsored by the DuPont Company, although it occasionally presented a musical, such as an adaptation of Show Boat, and condensed biographies of popular composers. It was initially broadcast on radio from 1935 to 1953, and later on television from 1952 to 1957. Originally on CBS, the series pioneered the use of anthology drama for company audio advertising. Cavalcade of America documented historical events using stories of individual courage, initiative and achievement, often with feel-good dramatizations of the human spirit's triumph against all odds. This was consistent with DuPont's overall conservative philosophy and legacy as an American company dating back to 1802. The company's motto, \"Maker of better things for better living through chemistry,\" was read at the beginning of each program, and the dramas emphasized humanitarian progress, particularly improvements in the lives of women, often through technological innovation.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18696   Expand Cavalcade of America   (1952) User Score Overview Cavalcade of America is an anthology drama series that was sponsored by the DuPont Company, although it occasionally presented a musical, such as an adaptation of Show Boat, and condensed biographies of popular composers. It was initially broadcast on radio from 1935 to 1953, and later on television from 1952 to 1957. Originally on CBS, the series pioneered the use of anthology drama for company audio advertising. Cavalcade of America documented historical events using stories of individual courage, initiative and achievement, often with feel-good dramatizations of the human spirit's triumph against all odds. This was consistent with DuPont's overall conservative philosophy and legacy as an American company dating back to 1802. The company's motto, \"Maker of better things for better living through chemistry,\" was read at the beginning of each program, and the dramas emphasized humanitarian progress, particularly improvements in the lives of women, often through technological innovation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 1956 | 27 Episodes Season 5 of Cavalcade of America premiered on September 18, 1956. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cavalcade of America. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 10 lineker T 8 TomStensson 6 Steve 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}