{"link": "https://www.themoviedb.org/tv/71884?language=en", "title": "Alone Together", "resume": "Esther and Benji are platonic best friends who want nothing more than to be accepted by the vain and status-obsessed culture of Los Angeles. Despite their sometimes contentious relationship, when push comes to shove, they’ve got each other’s back … And they have nobody else to hang out with.", "rate": 63, "genre": ["Comedy"], "cast": ["Esther Povitsky", "Benji Aflalo"], "character": ["Esther", "Benji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71884   Expand Alone Together   (2018) User Score  Play Trailer Overview Esther and Benji are platonic best friends who want nothing more than to be accepted by the vain and status-obsessed culture of Los Angeles. Despite their sometimes contentious relationship, when push comes to shove, they’ve got each other’s back … And they have nobody else to hang out with. Featured Crew Benji Aflalo Creator Esther Povitsky Creator Eben Russell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Esther Povitsky Esther Benji Aflalo Benji Full Cast & Crew Current Season Original Air Date Original Air Date Production Order (Production) Season 1 2018 | 10 Episodes Season 1 of Alone Together premiered on January  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Alone Together. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://freeform.go.com/shows/alone-together Genres Comedy Keywords friendship los angeles based on short film young adult Content Score 71 Just a little bit more... Top Contributors 64 Banana 9 Elizabeth Jennings AK 7 Avshalom Kor w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}