{"link": "https://www.themoviedb.org/tv/68879?language=en", "title": "Seven First Kisses", "resume": "Min Soo Jin meets a goddess who allows her to choose one guy among seven as her first kiss.", "rate": 64, "genre": ["Comedy"], "cast": ["Lee Cho-hee", "Lee Joon-gi", "Park Hae-jin", "Ji Chang-wook", "Kai"], "character": ["Min Soo Jin", "Church oppa", "Romantic Boss", "Sexy secret agent", "Charming Student"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68879   Expand Seven First Kisses   (2016) User Score  Play Trailer Overview Min Soo Jin meets a goddess who allows her to choose one guy among seven as her first kiss. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Cho-hee Min Soo Jin Lee Joon-gi Church oppa Park Hae-jin Romantic Boss Ji Chang-wook Sexy secret agent Kai Charming Student Full Cast & Crew Last Season Season 1 2016 | 9 Episodes Season 1 of Seven First Kisses premiered on December  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2016-05-02 Another Miss Oh 7.8  Facts Original Name  첫키스만 일곱번째 Status  Returning Series Networks Certification  - Type  Scripted Original Language  Korean Runtime  10m Homepage   http://tvcast.naver.com/firstkiss Genres Comedy Keywords romance korea Content Score 93 Almost there... Top Contributors 20 mp4soju 13 Elizabeth Jennings M 11 Maria180493 s 5 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}