{"link": "https://www.themoviedb.org/tv/64166?language=en", "title": "The Romeo Section", "resume": "Set in Vancouver, THE ROMEO SECTION is an hour-long serialized espionage drama following spymaster Professor Wolfgang McGee, an academic who secretly manages a roster of espionage assets. These assets, referred to as Romeo or Juliet spies, are informants engaged in intimate long or short term relations with state intelligence targets. Wolfgang is a semi-retired Romeo operator, having worked his way up from youth in an unnamed and officially deniable “service” under the umbrella of Canada’s Intelligence Community.", "rate": 74, "genre": ["Crime", "Drama"], "cast": ["Eugene Lipinski", "Stephanie Bennett", "Mathias Retamal", "Sophia Lauchlin Hirt", "Manny Jacinto"], "character": ["Al", "Dee", "Miguel", "Eva", "Wing Lei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64166   Expand The Romeo Section   (2015) User Score  Play Trailer Overview Set in Vancouver, THE ROMEO SECTION is an hour-long serialized espionage drama following spymaster Professor Wolfgang McGee, an academic who secretly manages a roster of espionage assets. These assets, referred to as Romeo or Juliet spies, are informants engaged in intimate long or short term relations with state intelligence targets. Wolfgang is a semi-retired Romeo operator, having worked his way up from youth in an unnamed and officially deniable “service” under the umbrella of Canada’s Intelligence Community. Featured Crew Anne Wheeler Creator Stephen Surjik Creator Chris Haddock Creator David Frazee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eugene Lipinski Al Stephanie Bennett Dee Mathias Retamal Miguel Sophia Lauchlin Hirt Eva Manny Jacinto Wing Lei Full Cast & Crew Last Season Season 2 2016 | 10 Episodes Season 2 of The Romeo Section premiered on October  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2015-11-16 The Coroner 5.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.cbc.ca/romeosection/ Genres Crime Drama Keywords canada spy Content Score 100 Yes! Looking good! Top Contributors 31 Bobel 13 Elizabeth Jennings 12 Banana x 4 x'Am  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}