{"link": "https://www.themoviedb.org/tv/46952?language=en", "title": "The Blacklist", "resume": "Raymond \"Red\" Reddington, one of the FBI's most wanted fugitives, surrenders in person at FBI Headquarters in Washington, D.C. He claims that he and the FBI have the same interests: bringing down dangerous criminals and terrorists. In the last two decades, he's made a list of criminals and terrorists that matter the most but the FBI cannot find because it does not know they exist. Reddington calls this \"The Blacklist\". Reddington will co-operate, but insists that he will speak only to Elizabeth Keen, a rookie FBI profiler.", "rate": 71, "genre": ["Drama", "Crime", "Mystery"], "cast": ["James Spader", "Megan Boone", "Diego Klattenhoff", "Ryan Eggold", "Amir Arison"], "character": ["Raymond \"Red\" Reddington", "Elizabeth \"Liz\" Keen", "Donald Ressler", "Tom Keen", "Aram Mojtabai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46952   Expand The Blacklist   (2013) User Score  Play Trailer Overview Raymond \"Red\" Reddington, one of the FBI's most wanted fugitives, surrenders in person at FBI Headquarters in Washington, D.C. He claims that he and the FBI have the same interests: bringing down dangerous criminals and terrorists. In the last two decades, he's made a list of criminals and terrorists that matter the most but the FBI cannot find because it does not know they exist. Reddington calls this \"The Blacklist\". Reddington will co-operate, but insists that he will speak only to Elizabeth Keen, a rookie FBI profiler. Featured Crew Jon Bokenkamp Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  50 Content Issues  7 Images Backdrops  29 Posters  23 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Spader Raymond \"Red\" Reddington Megan Boone Elizabeth \"Liz\" Keen Diego Klattenhoff Donald Ressler Ryan Eggold Tom Keen Amir Arison Aram Mojtabai Full Cast & Crew Last Season Season 5 2017 | 22 Episodes View All Seasons Social Reviews  0 Discussions  57 Subject Status Replies Last Reply SB I'm Confused again !! (SPOILERS if you haven't watched the series finale.) Open 0 by Strange Bedfellows\n      \n     The Bones! Open 18 by  Strange Bedfellows w Raymond Reddington: Conclusion? Open 1 by  write2topcat Go to Discussions Media Most Popular Videos  1 Backdrops  29 Posters  23 Recommendations   2011-09-22 Person of Interest 7.8    2012-09-27 Elementary 7.0    2011-10-02 Homeland 7.3    2015-09-21 Blindspot 6.3    2008-09-23 The Mentalist 7.3    2009-10-23 White Collar 7.7    2009-01-21 Lie to Me 7.4    2009-03-08 Castle 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/the-blacklist Genres Drama Crime Mystery Keywords terrorist fbi investigation criminal mastermind crime lord fbi profiler hidden identity criminal consultant Content Score 100 Yes! Looking good! Top Contributors 253 seawolf 82 Elizabeth Jennings 54 Banana VA 38 Viktor Andersson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}