{"link": "https://www.themoviedb.org/tv/69568?language=en", "title": "Master Devil Do Not Kiss Me", "resume": "The story follows our heroine who after losing her mother, is in the custody of a rich family (the male lead's family). She's then allowed to attend a high school with prestige with him. There, people call him Master Devil, he'll always make her pass for difficult moments. ~ Based on the novel of the same name written by Jin Xia Mo.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69568   Expand Master Devil Do Not Kiss Me   (2017) User Score Overview The story follows our heroine who after losing her mother, is in the custody of a rich family (the male lead's family). She's then allowed to attend a high school with prestige with him. There, people call him Master Devil, he'll always make her pass for difficult moments. ~ Based on the novel of the same name written by Jin Xia Mo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2017 | 23 Episodes Season 2 of Master Devil Do Not Kiss Me premiered on March  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Master Devil Do Not Kiss Me. You can help by rating TV shows you've seen. Facts Original Name  恶魔少爷别吻我 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  25m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 12 Elizabeth Jennings 7 MundoAsian n 4 nubie b 4 boudhum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}