{"link": "https://www.themoviedb.org/tv/387?language=en", "title": "SpongeBob SquarePants", "resume": "Deep down in the Pacific Ocean in the subterranean city of Bikini Bottom lives a square yellow sponge named SpongeBob SquarePants. SpongeBob lives in a pineapple with his pet snail, Gary, loves his job as a fry cook at the Krusty Krab, and has a knack for getting into all kinds of trouble without really trying. When he's not getting on the nerves of his cranky next door neighbor Squidward, SpongeBob can usually be found smack in the middle of all sorts of strange situations with his best buddy, the simple yet lovable starfish, Patrick, or his thrill-seeking surfer-girl squirrel pal, Sandy Cheeks.", "rate": 69, "genre": ["Animation", "Comedy"], "cast": ["Bill Fagerbakke", "Carolyn Lawrence", "Tom Kenny", "Clancy Brown", "Rodger Bumpass"], "character": ["Patrick Star (voice)", "Sandy Cheeks (voice)", "SpongeBob Squarepants (voice)", "Mr. Krabs (voice)", "Squidward (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 387   Expand SpongeBob SquarePants   (1999) User Score Overview Deep down in the Pacific Ocean in the subterranean city of Bikini Bottom lives a square yellow sponge named SpongeBob SquarePants. SpongeBob lives in a pineapple with his pet snail, Gary, loves his job as a fry cook at the Krusty Krab, and has a knack for getting into all kinds of trouble without really trying. When he's not getting on the nerves of his cranky next door neighbor Squidward, SpongeBob can usually be found smack in the middle of all sorts of strange situations with his best buddy, the simple yet lovable starfish, Patrick, or his thrill-seeking surfer-girl squirrel pal, Sandy Cheeks. Featured Crew Stephen Hillenburg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  6 Images Backdrops  18 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  2 Top Billed Cast Bill Fagerbakke Patrick Star (voice) Carolyn Lawrence Sandy Cheeks (voice) Tom Kenny SpongeBob Squarepants (voice) Clancy Brown Mr. Krabs (voice) Rodger Bumpass Squidward (voice) Full Cast & Crew Last Season Season 11 2017 | 32 Episodes Season 11 of SpongeBob SquarePants premiered on September 23, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for SpongeBob SquarePants. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  18 Posters  9 Recommendations   2001-03-30 The Fairly OddParents 6.7    1996-04-28 Dexter's Laboratory 7.3    1991-08-11 Rugrats 7.1    1997-07-07 Johnny Bravo 6.6    1998-11-18 The Powerpuff Girls 7.0    1997-09-13 Recess 6.8    1998-03-01 CatDog 6.4    1996-10-07 Hey Arnold! 6.8  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.nick.com/spongebob-squarepants/ Genres Animation Comedy Keywords underwater Content Score 100 Yes! Looking good! Top Contributors L 47 Leah 24 Banana 23 Damien Haynes 23 doncaruana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}