{"link": "https://www.themoviedb.org/tv/62565?language=en", "title": "My Love Story!!", "resume": "Takeo Godau is a giant guy with a giant heart. Too bad the girls don't want him! (They always go for his good-looking best friend, Makoto Sunakawa.) Used to being on the sidelines, Takeo simply stands tall and accepts his fate. But one day when he saves a girl named Rinko Yamato from a harasser on the train, his (love!) life suddenly takes an incredible turn! Takeo can hardly believe it when he crosses paths with Rinko again, and he finds himself falling in love with her... But with handsome Suna around, does Takeo even stand a chance?", "rate": 83, "genre": ["Animation", "Comedy"], "cast": ["Takuya Eguchi", "Megumi Han", "Nobunaga Shimazaki"], "character": ["Takeo Gouda (voice)", "Rinko Yamato (voice)", "Makoto \"Suna\" Sunakawa (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62565   Expand My Love Story!!   (2015) User Score  Play Trailer Overview Takeo Godau is a giant guy with a giant heart. Too bad the girls don't want him! (They always go for his good-looking best friend, Makoto Sunakawa.) Used to being on the sidelines, Takeo simply stands tall and accepts his fate. But one day when he saves a girl named Rinko Yamato from a harasser on the train, his (love!) life suddenly takes an incredible turn! Takeo can hardly believe it when he crosses paths with Rinko again, and he finds himself falling in love with her... But with handsome Suna around, does Takeo even stand a chance? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Eguchi Takeo Gouda (voice) Megumi Han Rinko Yamato (voice) Nobunaga Shimazaki Makoto \"Suna\" Sunakawa (voice) Full Cast & Crew Last Season Season 1 2015 | 24 Episodes Season 1 of My Love Story!! premiered on April  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2016-04-07 And you thought there is never a girl online? 7.6    2003-08-26 Full Metal Panic? Fumoffu 6.7    2015-07-06 Snow White with the Red Hair 7.5    2015-04-04 Is It Wrong to Try to Pick Up Girls in a Dungeon? 6.9    2013-04-05 My Teen Romantic Comedy SNAFU 7.4  Facts Original Name  俺物語!! Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.vap.co.jp/anime-ore Genres Animation Comedy Keywords love at first sight romance slice of life school life shoujo anime Content Score 64 We're so close, yet so far. Top Contributors 64 Marr 🇳🇱 28 WillofOwn 10 a4840639 C 9 Chintaran  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}