{"link": "https://www.themoviedb.org/tv/68590?language=en", "title": "The Swell", "resume": "When a big storm in the Netherlands and Begium comes down should prime minister Hans Kreuger the order taking: Can we evacuate four million people? But the storm can login deflect and the evacuation of civilians, hospitals and prisons takes sure 4 days.", "rate": 68, "genre": ["Drama"], "cast": ["Roos Dickmann", "Joppe Degrijse", "Lene Lanckriet", "Sadettin Kirmiziyüz", "Jamelia Sanda Nana"], "character": ["Naomi Wienesse", "Kevin Van Daele", "Femke Van Daele", "Samir Sentûrk", "Kimmy Asmara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68590   Expand The Swell   (2016) User Score  Play Trailer Overview When a big storm in the Netherlands and Begium comes down should prime minister Hans Kreuger the order taking: Can we evacuate four million people? But the storm can login deflect and the evacuation of civilians, hospitals and prisons takes sure 4 days. Featured Crew Johan Nijenhuis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roos Dickmann Naomi Wienesse Joppe Degrijse Kevin Van Daele Lene Lanckriet Femke Van Daele Sadettin Kirmiziyüz Samir Sentûrk Jamelia Sanda Nana Kimmy Asmara Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of The Swell premiered on November  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Swell. You can help by rating TV shows you've seen. Facts Original Name  Als de dijken breken Status  Returning Series Network EO Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  55m Homepage   http://www.npo.nl/series/artikelen/als-de-dijken-breken Genres Drama Keywords netherlands storm Content Score 100 Yes! Looking good! Top Contributors 30 HPauwelyn 26 dvandonkelaar 10 Maretoh 8 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}