{"link": "https://www.themoviedb.org/tv/14100?language=en", "title": "Care Bears: Adventures in Care-a-lot", "resume": "Care Bears: Adventures in Care-a-lot is an animated television series by SD Entertainment, Cookie Jar Entertainment and Shari Lewis Enterprises that premiered on CBS's KEWLopolis line-up from September 15, 2007 to December 6, 2008, and is designed to be an immediate follow up to the movie Care Bears: Oopsy Does It!. It was the third Care Bears television series made and was produced by Sabella Dern Entertainment, the same company that made Care Bears: Oopsy Does It!. It features songs with music by Andy Street and lyrics by Judy Rothman.\nAlong with the other shows in the KEWLopolis block, this series fulfills the federal \"E/I\" requirements.", "rate": 20, "genre": ["Animation", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Tracey Moore", "Ashleigh Ball", "Ian James Corlett", "Scott McNeil", "Tabitha St. Germain"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14100   Expand Care Bears: Adventures in Care-a-lot   (2009) User Score Overview Care Bears: Adventures in Care-a-lot is an animated television series by SD Entertainment, Cookie Jar Entertainment and Shari Lewis Enterprises that premiered on CBS's KEWLopolis line-up from September 15, 2007 to December 6, 2008, and is designed to be an immediate follow up to the movie Care Bears: Oopsy Does It!. It was the third Care Bears television series made and was produced by Sabella Dern Entertainment, the same company that made Care Bears: Oopsy Does It!. It features songs with music by Andy Street and lyrics by Judy Rothman. Along with the other shows in the KEWLopolis block, this series fulfills the federal \"E/I\" requirements. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tracey Moore Ashleigh Ball Ian James Corlett Scott McNeil Tabitha St. Germain Full Cast & Crew Last Season Season 1 2009 | 52 Episodes Season 1 of Care Bears: Adventures in Care-a-lot premiered on March 16, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply wrong count of episodes Open 0 by Baloralys\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Care Bears: Adventures in Care-a-lot. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  10m Homepage  - Genres Animation Kids Sci-Fi & Fantasy Keywords cartoon bear Content Score 86 Almost there... Top Contributors 15 Banana W 9 Wylaryzel 4 Baloralys l 2 lionpower  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}