{"link": "https://www.themoviedb.org/tv/62858?language=en", "title": "Colony", "resume": "In the near future a family must make difficult decisions as they balance staying together with trying to survive. They live in Los Angeles, which has been occupied by a force of outside intruders.  While some people have chosen to collaborate with the authorities and benefit from the new order, others have rebelled — and suffer the consequences.", "rate": 67, "genre": ["Science", "Fiction", "Drama"], "cast": ["Josh Holloway", "Sarah Wayne Callies", "Peter Jacobson", "Tory Kittles", "Alex Neustaedter"], "character": ["Will Bowman", "Katie Bowman", "Proxy Snyder", "Broussard", "Bram"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62858   Expand Colony   (2016) User Score  Play Trailer Overview In the near future a family must make difficult decisions as they balance staying together with trying to survive. They live in Los Angeles, which has been occupied by a force of outside intruders.  While some people have chosen to collaborate with the authorities and benefit from the new order, others have rebelled — and suffer the consequences. Featured Crew Carlton Cuse Creator Ryan Condal Creator Wes Tooke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  37 Content Issues  1 Images Backdrops  9 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Holloway Will Bowman Sarah Wayne Callies Katie Bowman Peter Jacobson Proxy Snyder Tory Kittles Broussard Alex Neustaedter Bram Full Cast & Crew Current Season Season 3 2018 | 13 Episodes Season 3 of Colony premiered on May  2, 2018. View All Seasons Social Reviews  0 Discussions  38 Subject Status Replies Last Reply c What will Snyder do? Open 54 by  Kathy Bram, Katie, and others Open 6 by  write2topcat t beau.. Open 1 by  chrisjdel Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  13 Recommendations   2016-01-05 The Shannara Chronicles 6.4    2016-10-17 Travelers 7.5    2015-12-14 The Expanse 7.5    2016-10-03 Timeless 7.0    2015-06-19 Killjoys 6.7    2015-06-12 Dark Matter 6.3    2015-06-14 Humans 7.5    2015-01-16 12 Monkeys 6.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.usanetwork.com/colony Genres Science Fiction Drama Keywords resistance dystopia occupying power occupation intruder collaborator Content Score 100 Yes! Looking good! Top Contributors 74 Elizabeth Jennings f 16 furkan-guven0115 10 express 9 scorpio686  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}