{"link": "https://www.themoviedb.org/tv/71866?language=en", "title": "Paula", "resume": "A thriller about Paula, a chemistry teacher whose life is turned upside down after a one-night stand with James. They become locked in a dance of destruction. Only one can survive.", "rate": 51, "genre": ["Drama"], "cast": ["Denise Gough", "Tom Hughes", "Owen McDonnell", "Jane Brennan", "Siobhán Cullen"], "character": ["Paula", "James", "McArthur", "Gemma", "Morgan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71866   Expand Paula   (2017) User Score  Play Trailer Overview A thriller about Paula, a chemistry teacher whose life is turned upside down after a one-night stand with James. They become locked in a dance of destruction. Only one can survive. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denise Gough Paula Tom Hughes James Owen McDonnell McArthur Jane Brennan Gemma Siobhán Cullen Morgan Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Paula premiered on May 25, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Paula. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b08s2bqh Genres Drama Keywords thriller Content Score 93 Almost there... Top Contributors 35 Elizabeth Jennings m 3 magoozin TB 3 TMDb Bot t 2 tijm2004  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}