{"link": "https://www.themoviedb.org/tv/37508?language=en", "title": "Pretty Cure", "resume": "Pretty Cure, known in Japan as Futari wa Pretty Cure, is a Japanese magical girl anime series produced by Toei Animation and broadcast across Japan by Animax, TV Asahi and Asahi Broadcasting Corporation. It is the first series in the Pretty Cure metaseries created by Izumi Todo. The series is watched mostly by elementary and secondary students in Japan; it is also broadcast around the world. The original Pretty Cure series, directed by Daisuke Nishio aired on TV Asahi between February 1, 2004 and January 30, 2005. It is the only Pretty Cure series to date to have received an English-language version, which aired in Canada from March 2009. A direct sequel, Futari wa Pretty Cure Max Heart, or simply Max Heart, aired in Japan between February 6, 2005 and January 29, 2006. Two Max Heart movies were released on April 16, 2005 and December 10, 2005 respectively.\nThe theme of the series revolves around Yin and Yang, which explains the relationship between Nagisa and Honoka trying to work together as Pretty Cures.", "rate": 80, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Kenichi Ono"], "character": ["Dark King (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37508   Expand Pretty Cure   (2004) User Score Overview Pretty Cure, known in Japan as Futari wa Pretty Cure, is a Japanese magical girl anime series produced by Toei Animation and broadcast across Japan by Animax, TV Asahi and Asahi Broadcasting Corporation. It is the first series in the Pretty Cure metaseries created by Izumi Todo. The series is watched mostly by elementary and secondary students in Japan; it is also broadcast around the world. The original Pretty Cure series, directed by Daisuke Nishio aired on TV Asahi between February 1, 2004 and January 30, 2005. It is the only Pretty Cure series to date to have received an English-language version, which aired in Canada from March 2009. A direct sequel, Futari wa Pretty Cure Max Heart, or simply Max Heart, aired in Japan between February 6, 2005 and January 29, 2006. Two Max Heart movies were released on April 16, 2005 and December 10, 2005 respectively. The theme of the series revolves around Yin and Yang, which explains the relationship between Nagisa and Honoka trying to work together as Pretty Cures. Featured Crew Izumi Todo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Ono Dark King (voice) Full Cast & Crew Last Season Season 2 2005 | 47 Episodes Season 2 of Pretty Cure premiered on February  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pretty Cure. You can help by rating TV shows you've seen. Facts Original Name  ふたりはプリキュア Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.toei-anim.co.jp/tv/f_precure/index.html Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 11 Banana 8 Sergiojamon 5 seboseboss m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}