{"link": "https://www.themoviedb.org/tv/60810?language=en", "title": "Dragonar Academy", "resume": "In a land of dragons, where citizens called breeders tame their dragon pals. Races of dragons are born from breeders who are given a Seikoku: a dragon star-shape brand.\nLearning to ride and tame dragons comes easy to most students at Ansarivan Dragonar Academy—except for Ash Blake, a first-year student who is known by his classmates as the \"problem child.\" His dragon has never appeared. Despite his unfashionably large star-shaped brand that marks him as a future dragon master, he has nothing to show for it. Until now, that is. One fateful day, while challenging a princess, Silvia Lautreamont, to a dragon race, Ash's dragon awakes in full glory, but appears different than any dragon ever seen before—in the form of a beautiful girl!—naming her Eco. What's more, Ash soon discovers that this new dragon has attitude to spare, as she promptly informs him that she is the master, and he, the servant. Ash's problems with dragon riding have only just begun.", "rate": 93, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Mariya Ise", "Ayane Sakura", "Ayane Sakura", "Tomoaki Maeno", "Genki Muro"], "character": ["Eco", "Silvia Lautreamont", "Rebecca Randall", "Raymond Kirkland", "Maximillian Russell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60810   Expand Dragonar Academy   (2014) User Score Overview In a land of dragons, where citizens called breeders tame their dragon pals. Races of dragons are born from breeders who are given a Seikoku: a dragon star-shape brand. Learning to ride and tame dragons comes easy to most students at Ansarivan Dragonar Academy—except for Ash Blake, a first-year student who is known by his classmates as the \"problem child.\" His dragon has never appeared. Despite his unfashionably large star-shaped brand that marks him as a future dragon master, he has nothing to show for it. Until now, that is. One fateful day, while challenging a princess, Silvia Lautreamont, to a dragon race, Ash's dragon awakes in full glory, but appears different than any dragon ever seen before—in the form of a beautiful girl!—naming her Eco. What's more, Ash soon discovers that this new dragon has attitude to spare, as she promptly informs him that she is the master, and he, the servant. Ash's problems with dragon riding have only just begun. Featured Crew Shingo Nagai Creator Shiki Mizuchi Creator Noboru Kimura Creator Amiya Masaharu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariya Ise Eco Ayane Sakura Silvia Lautreamont Ayane Sakura Rebecca Randall Tomoaki Maeno Raymond Kirkland Genki Muro Maximillian Russell Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Dragonar Academy premiered on April  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2010-07-06 Digimon Fusion 3.8    2010-07-10 Cat Planet Cuties 6.0    2004-07-10 DearS 5.0    2012-07-06 Aesthetica of a Rogue Hero 7.1    2011-10-08 Ben-To 7.2    2014-07-05 Sailor Moon Crystal 7.8    2007-04-13 Stigma of the Wind 8.1    2006-04-04 Air Gear 5.3  Facts Original Name  星刻の竜騎士 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 30 benf45 MR 9 Mike Robben n 7 nakamas CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}