{"link": "https://www.themoviedb.org/tv/398?language=en", "title": "The Last Train", "resume": "The Last Train is a British six-part post-apocalyptic television drama serial first broadcast on the ITV network in 1999. It has since been repeated on ITV2 in 1999/2001 and on numerous occasions on the UK Sci-Fi Channel. The serial was written by Matthew Graham and produced for ITV by Granada Television.\nIn the United States, the Fox Network purchased the rights to produce a new version of the series soon after its original UK transmission. Retitled The Ark, the idea did not progress beyond the pilot stage.\nAs of May 2013, the series has not been released on DVD or any other format, and has never aired in the US.", "rate": 75, "genre": ["Drama"], "cast": ["James Hazeldine", "Zoe Telford", "Nicola Walker", "Amita Dhiri", "Sacha Dhawan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 398   Expand The Last Train   (1999) User Score Overview The Last Train is a British six-part post-apocalyptic television drama serial first broadcast on the ITV network in 1999. It has since been repeated on ITV2 in 1999/2001 and on numerous occasions on the UK Sci-Fi Channel. The serial was written by Matthew Graham and produced for ITV by Granada Television. In the United States, the Fox Network purchased the rights to produce a new version of the series soon after its original UK transmission. Retitled The Ark, the idea did not progress beyond the pilot stage. As of May 2013, the series has not been released on DVD or any other format, and has never aired in the US. Featured Crew Matthew Graham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Hazeldine Zoe Telford Nicola Walker Amita Dhiri Sacha Dhawan Full Cast & Crew Last Season Season 1 1999 | 6 Episodes Season 1 of The Last Train premiered on April  7, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Last Train. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  55m Homepage  - Genres Drama Keywords future post-apocalyptic cryogenics survivor Content Score 93 Almost there... Top Contributors 8 Banana 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}