{"link": "https://www.themoviedb.org/tv/6457?language=en", "title": "500 Nations", "resume": "500 Nations is an eight-part documentary on the Native Americans of North and Central America. It documents from pre-Columbian to the end of the 19th century. Much of the information comes from text, eyewitnesses, pictorials, and computer graphics. The series was hosted by Kevin Costner, narrated by Gregory Harrison, and directed by Jack Leustig. It included the voice talents of Eric Schweig, Gordon Tootoosis, Wes Studi, Cástulo Guerra, Tony Plana, Edward James Olmos, Patrick Stewart, Gary Farmer, Tom Jackson, Tantoo Cardinal, Dante Basco, Sheldon Peters Wolfchild, Tim Bottoms, Michael Horse, Graham Greene, Floyd Red Crow Westerman, Amy Madigan, Frank Salsedo, and Kurtwood Smith. The series was written by Jack Leustig, Roberta Grossman, Lee Miller, and W. T. Morgan, with Dr. John M. D. Pohl.\n\"The truth is, we have a story worth talking about. We have a history worth celebrating. Long before the first Europeans arrived here, there were some 500 nations already in North America. They blanketed the continent from coast to coast, from Central America to the Arctic. There were tens of millions of people here, speaking over 300 languages. Many of them lived in beautiful cities, among the largest and most advanced in the world. In the coming hours, 500 Nations looks back on those ancient cultures, how they lived, and how many survived.... What you're about to see is what happened. It's not all that happened, and it's not always pleasant. We can't change that. We can't turn back the clock. But we can open our eyes and give the first nations of this land the recognition and respect they deserve: their rightful place in the history of the world.\" Kevin Costner", "rate": 76, "genre": ["Documentary"], "cast": ["Kevin Costner", "Gordon Tootoosis", "Tom Jackson", "Timothy Bottoms", "Castulo Guerra"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6457   Expand 500 Nations   (1995) User Score Overview 500 Nations is an eight-part documentary on the Native Americans of North and Central America. It documents from pre-Columbian to the end of the 19th century. Much of the information comes from text, eyewitnesses, pictorials, and computer graphics. The series was hosted by Kevin Costner, narrated by Gregory Harrison, and directed by Jack Leustig. It included the voice talents of Eric Schweig, Gordon Tootoosis, Wes Studi, Cástulo Guerra, Tony Plana, Edward James Olmos, Patrick Stewart, Gary Farmer, Tom Jackson, Tantoo Cardinal, Dante Basco, Sheldon Peters Wolfchild, Tim Bottoms, Michael Horse, Graham Greene, Floyd Red Crow Westerman, Amy Madigan, Frank Salsedo, and Kurtwood Smith. The series was written by Jack Leustig, Roberta Grossman, Lee Miller, and W. T. Morgan, with Dr. John M. D. Pohl. \"The truth is, we have a story worth talking about. We have a history worth celebrating. Long before the first Europeans arrived here, there were some 500 nations already in North America. They blanketed the continent from coast to coast, from Central America to the Arctic. There were tens of millions of people here, speaking over 300 languages. Many of them lived in beautiful cities, among the largest and most advanced in the world. In the coming hours, 500 Nations looks back on those ancient cultures, how they lived, and how many survived.... What you're about to see is what happened. It's not all that happened, and it's not always pleasant. We can't change that. We can't turn back the clock. But we can open our eyes and give the first nations of this land the recognition and respect they deserve: their rightful place in the history of the world.\" Kevin Costner Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Costner Gordon Tootoosis Tom Jackson Timothy Bottoms Castulo Guerra Full Cast & Crew Last Season Miniseries — | 8 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2005-06-10 Into the West 7.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords native american history miniseries Content Score 86 Almost there... Top Contributors R 10 Rebecca b 6 bandix TB 5 TMDb Bot A 4 Apicius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}