{"link": "https://www.themoviedb.org/tv/882?language=en", "title": "Connections", "resume": "Connections is a ten-episode documentary television series and 1978 book created, written and presented by science historian James Burke. The series was produced and directed by Mick Jackson of the BBC Science & Features Department and first aired in 1978 and 1979. It took an interdisciplinary approach to the history of science and invention and demonstrated how various discoveries, scientific achievements, and historical world events were built from one another successively in an interconnected way to bring about particular aspects of modern technology. The series was noted for Burke's crisp and enthusiastic presentation, historical re-enactments, and intricate working models.\nThe popular success of the series led to the production of The Day the Universe Changed, a similar program but showing a more linear history of several important scientific developments. Years later the success in syndication led to two sequels, Connections² and Connections³, both for TLC. In 2004, KCSM-TV produced a program called Re-Connections, consisting of an interview of Burke and highlights of the original series, for the 25th anniversary of the first broadcast in the USA on PBS.", "rate": 88, "genre": ["Documentary"], "cast": ["James Burke"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 882   Expand Connections   (1978) User Score Overview Connections is a ten-episode documentary television series and 1978 book created, written and presented by science historian James Burke. The series was produced and directed by Mick Jackson of the BBC Science & Features Department and first aired in 1978 and 1979. It took an interdisciplinary approach to the history of science and invention and demonstrated how various discoveries, scientific achievements, and historical world events were built from one another successively in an interconnected way to bring about particular aspects of modern technology. The series was noted for Burke's crisp and enthusiastic presentation, historical re-enactments, and intricate working models. The popular success of the series led to the production of The Day the Universe Changed, a similar program but showing a more linear history of several important scientific developments. Years later the success in syndication led to two sequels, Connections² and Connections³, both for TLC. In 2004, KCSM-TV produced a program called Re-Connections, consisting of an interview of Burke and highlights of the original series, for the 25th anniversary of the first broadcast in the USA on PBS. Featured Crew James Burke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast James Burke Full Cast & Crew Last Season Miniseries 1978 | 10 Episodes Season 1 of Connections premiered on October 17, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Connections. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m, 60m Homepage  - Genres Documentary Keywords miniseries Content Score 71 Just a little bit more... Top Contributors R 8 Rebecca 1 tigru89 b 1 blin2000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}