{"link": "https://www.themoviedb.org/tv/46314?language=en", "title": "Zombie-Loan", "resume": "Based on the manga by PEACH-PIT, serialised in G-Fantasy. When a human is marked to die, a faint gray line that is invisible to most appears around their neck. As time passes, that ring becomes darker and darker, until it is eventually black, and that person dies. Kita Michiru has an unusual gift - she posses \"Shinigami eyes,\" which allow her to see these rings. When Michiru notices that two of the boys in her Class, Akatsuki Chika and Tachibana Shito not only have rings, but that they`re jet black, they reveal to her that the were supposed to die in a tragic accident six months ago. With the help of the Zombie Loan loan office, they were given a second chance at life, should they be able to pay for their debt by doing the work of Shinigami and killing malicious zombies. They petition Michiru to assist them in their efforts, and she finds her everyday life changing dramatically.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Kana Ueda", "Toshiyuki Morikawa", "Houko Kuwashima", "Tetsuya Kakihara", "Chihiro Suzuki"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46314   Expand Zombie-Loan   (2007) User Score Overview Based on the manga by PEACH-PIT, serialised in G-Fantasy. When a human is marked to die, a faint gray line that is invisible to most appears around their neck. As time passes, that ring becomes darker and darker, until it is eventually black, and that person dies. Kita Michiru has an unusual gift - she posses \"Shinigami eyes,\" which allow her to see these rings. When Michiru notices that two of the boys in her Class, Akatsuki Chika and Tachibana Shito not only have rings, but that they`re jet black, they reveal to her that the were supposed to die in a tragic accident six months ago. With the help of the Zombie Loan loan office, they were given a second chance at life, should they be able to pay for their debt by doing the work of Shinigami and killing malicious zombies. They petition Michiru to assist them in their efforts, and she finds her everyday life changing dramatically. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Ueda Toshiyuki Morikawa Houko Kuwashima Tetsuya Kakihara Chihiro Suzuki Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of Zombie-Loan premiered on July  3, 2007. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Zombie-Loan. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Zombie-Loan. You can help by rating TV shows you've seen. Facts Original Name  ゾンビローン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.zombie-loan.com/ Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 7 NoemiTalavera 6 Razze 6 seboseboss x 3 xoINARIox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}