{"link": "https://www.themoviedb.org/tv/20149?language=en", "title": "The Swamp Fox", "resume": "The Swamp Fox is a television series produced by Walt Disney and starring Leslie Nielsen as American Revolutionary War hero Francis Marion.\nThe theme song * was sung by Nielsen as well. Myron Healey played Marion's top aide, Maj./Col. Peter Horry. One of the Swamp Fox's adversaries was Colonel Banastre Tarleton, played by John Sutton. Patrick Macnee played a British captain, Tim Considine played Marion's nephew Gabe Marion and Slim Pickens played Plunkett, one of the Swamp Fox's men. Hal Stalmaster appeared in three of the eight episodes as \"Gwynn.\" The Swamp Fox did not bring to Disney the commercial success that had been achieved by Davy Crockett.\nThe series encompassed eight episodes, running as part of The Wonderful World of Color. Episodes were presented on Sundays on ABC from 6:30 to 7:30 p.m. and were also broadcast by CBC Television.\nThe Disney Channel reran Swamp Fox episodes in the 1980s and 1990s, while Nielsen was at the height of a second career as a white-haired comedy movie star. The first three episodes of the series were also released in 2005 on DVD.", "rate": 20, "genre": [], "cast": ["Arthur Hunnicutt", "Dick Foran", "J. Pat O'Malley", "Joy Page", "James Seay"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20149   Expand The Swamp Fox   (1959) User Score Overview The Swamp Fox is a television series produced by Walt Disney and starring Leslie Nielsen as American Revolutionary War hero Francis Marion. The theme song * was sung by Nielsen as well. Myron Healey played Marion's top aide, Maj./Col. Peter Horry. One of the Swamp Fox's adversaries was Colonel Banastre Tarleton, played by John Sutton. Patrick Macnee played a British captain, Tim Considine played Marion's nephew Gabe Marion and Slim Pickens played Plunkett, one of the Swamp Fox's men. Hal Stalmaster appeared in three of the eight episodes as \"Gwynn.\" The Swamp Fox did not bring to Disney the commercial success that had been achieved by Davy Crockett. The series encompassed eight episodes, running as part of The Wonderful World of Color. Episodes were presented on Sundays on ABC from 6:30 to 7:30 p.m. and were also broadcast by CBC Television. The Disney Channel reran Swamp Fox episodes in the 1980s and 1990s, while Nielsen was at the height of a second career as a white-haired comedy movie star. The first three episodes of the series were also released in 2005 on DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arthur Hunnicutt Dick Foran J. Pat O'Malley Joy Page James Seay Full Cast & Crew Last Season Season 2 1961 | 2 Episodes Season 2 of The Swamp Fox premiered on January  8, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Swamp Fox. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}