{"link": "https://www.themoviedb.org/tv/61864?language=en", "title": "Good Witch", "resume": "Cassie Nightingale, Middleton’s favorite enchantress, and her young-teenage daughter Grace, who shares that same special intuition as her mom, welcome Dr. Sam Radford and his son to town. When the New York transplants move in next to the Grey House, they are immediately spellbound by the mother-daughter duo next door, but Sam and Cassie quickly find they may not see eye to eye. With her signature charm, Cassie attempts to bring everyone together, ensuring all of Middleton is in for new changes, big surprises and, of course, a little bit of magic!\n\"Good Witch” is based on Bell’s beloved character Cassie, the raven-haired enchantress who kept audiences spellbound for seven installments of Hallmark Channel's longest-running and highest-rated original movie franchise of all time.", "rate": 62, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Catherine Bell", "Bailee Madison", "James Denton", "Catherine Disher", "Sarah Power"], "character": ["Cassie Nightingale", "Grace Russell", "Dr. Sam Radford", "Martha Endicott Tinsdale", "Abigail Pershing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61864   Expand Good Witch   (2015) User Score  Play Trailer Overview Cassie Nightingale, Middleton’s favorite enchantress, and her young-teenage daughter Grace, who shares that same special intuition as her mom, welcome Dr. Sam Radford and his son to town. When the New York transplants move in next to the Grey House, they are immediately spellbound by the mother-daughter duo next door, but Sam and Cassie quickly find they may not see eye to eye. With her signature charm, Cassie attempts to bring everyone together, ensuring all of Middleton is in for new changes, big surprises and, of course, a little bit of magic! \"Good Witch” is based on Bell’s beloved character Cassie, the raven-haired enchantress who kept audiences spellbound for seven installments of Hallmark Channel's longest-running and highest-rated original movie franchise of all time. Featured Crew Sue Tenney Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  11 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine Bell Cassie Nightingale Bailee Madison Grace Russell James Denton Dr. Sam Radford Catherine Disher Martha Endicott Tinsdale Sarah Power Abigail Pershing Full Cast & Crew Current Season Season 4 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Grace Russell: Happy Birthday Bailee Madison! Open 0 by wonder2wonder\n      \n     a What is the name of the old movie in Good Witch episode 3x04? Open 2 by  acontributor Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  9 Recommendations   2017-09-20 Tiempos de guerra 7.0    2015-09-08 Apaches 7.3    2016-07-05 Fangbone! 6.7    2016-12-08 The Cuba Libre Story 7.7    2014-09-02 72 Dangerous Animals: Australia 7.0    2016-06-02 Hibana: Spark 7.8    2013-05-03 Maron 6.9    2015-09-02 Atelier 7.2  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.hallmarkchannel.com/good-witch Genres Comedy Drama Sci-Fi & Fantasy Keywords witch Content Score 100 Yes! Looking good! Top Contributors a 95 acontributor 92 Elizabeth Jennings 30 Medianoche 7 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}