{"link": "https://www.themoviedb.org/tv/46440?language=en", "title": "Samurai Girls", "resume": "The story takes place in Japan in the early 21st century, in an alternate reality where the Tokugawa Shogunate has remained in power. In this reality, student councils are tasked with oppressing schools. Yagyuu Muneakira is a high school student who rebels against his student council with the help of girls who've had the names of famous samurai heroes passed on to them.", "rate": 65, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Rie Kugimiya", "Aoi Yuki", "Daisuke Hirakawa", "Aki Toyosaki", "Ami Koshimizu"], "character": ["Yukimura Sanada (voice)", "Jūbee Yagyū (voice)", "Muneakira Yagyū (voice)", "Kanetsugu Naoe (voice)", "Charles d'Artanian (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46440   Expand Samurai Girls   (2010) User Score Overview The story takes place in Japan in the early 21st century, in an alternate reality where the Tokugawa Shogunate has remained in power. In this reality, student councils are tasked with oppressing schools. Yagyuu Muneakira is a high school student who rebels against his student council with the help of girls who've had the names of famous samurai heroes passed on to them.  Featured Crew KOBUN Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Kugimiya Yukimura Sanada (voice) Aoi Yuki Jūbee Yagyū (voice) Daisuke Hirakawa Muneakira Yagyū (voice) Aki Toyosaki Kanetsugu Naoe (voice) Ami Koshimizu Charles d'Artanian (voice) Full Cast & Crew Last Season Season 2 2013 | 12 Episodes Season 2 of Samurai Girls premiered on April  5, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Samurai Girls. You can help by rating TV shows you've seen. Facts Original Name  百花繚乱 サムライガールズ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.hyakka-ryoran.tv/ Genres Animation Comedy Action & Adventure Keywords japan samurai ecchi Content Score 100 Yes! Looking good! Top Contributors W 11 Watcher14 11 Thxneo p 10 psy4trik k 10 krzysiekj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}