{"link": "https://www.themoviedb.org/tv/17766?language=en", "title": "The Vice", "resume": "The Vice is an ITV police drama about the Metropolitan Police Vice Unit. It ran for five short series between 1999 and 2003. It tells the story of the London Metropolitan police force's vice squad, where prostitution, underage sex, and other such organized crime are regular occurrences. Most episodes end in such a way where the main villain is caught but often not in a 'naturally' concluded way that you would expect with other TV dramas, and often ending an episode with more questions unanswered than answered.\nThe small dedicated team is led by Detective Inspector Pat Chappel who struggles to manage the balance between his home life and his work life - as do the other members of the team. Working in the seedy underworld leads to a continual dilemma for the team - the tension between the Vice Squad and the vice-related crimes that they investigate runs throughout the series and gives the show a rich viewing experience. The programme often blurs the line of the team staying on the right side of the law, as almost every member of the team at different points submits briefly or permanently to the temptations of either sex, drugs, money or honey traps. Sometimes with drastic consequences.", "rate": 70, "genre": ["Drama"], "cast": ["Marc Warren", "Caroline Catz", "Anna Chancellor", "Tim Pigott-Smith", "David Harewood"], "character": ["P.C. Dougie Raymond", "PC Cheryl Hutchins", "Dr. Christine Weir", "D.C.I. Frank Vickers", "D.I. Joe Robinson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17766   Expand The Vice   (1999) User Score Overview The Vice is an ITV police drama about the Metropolitan Police Vice Unit. It ran for five short series between 1999 and 2003. It tells the story of the London Metropolitan police force's vice squad, where prostitution, underage sex, and other such organized crime are regular occurrences. Most episodes end in such a way where the main villain is caught but often not in a 'naturally' concluded way that you would expect with other TV dramas, and often ending an episode with more questions unanswered than answered. The small dedicated team is led by Detective Inspector Pat Chappel who struggles to manage the balance between his home life and his work life - as do the other members of the team. Working in the seedy underworld leads to a continual dilemma for the team - the tension between the Vice Squad and the vice-related crimes that they investigate runs throughout the series and gives the show a rich viewing experience. The programme often blurs the line of the team staying on the right side of the law, as almost every member of the team at different points submits briefly or permanently to the temptations of either sex, drugs, money or honey traps. Sometimes with drastic consequences. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Warren P.C. Dougie Raymond Caroline Catz PC Cheryl Hutchins Anna Chancellor Dr. Christine Weir Tim Pigott-Smith D.C.I. Frank Vickers David Harewood D.I. Joe Robinson Full Cast & Crew Last Season Season 5 2003 | 7 Episodes Season 5 of The Vice premiered on May 26, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Vice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Drama Keywords london england police detective crime investigation sex worker sex trade Content Score 86 Almost there... Top Contributors 18 Banana 5 kcdh TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}