{"link": "https://www.themoviedb.org/tv/3496?language=en", "title": "On the Lot", "resume": "On the Lot is a short-lived reality show competition for filmmaking, produced by Steven Spielberg and Mark Burnett. The show, which aired on Fox, featured filmmakers competing in weekly elimination competitions, with the ultimate prize of a million-dollar development deal at DreamWorks. On the Lot premiered May 22, 2007, and aired Tuesdays.\nThe show was initially hosted by Chelsea Handler but she quit early on; she later said, \"I quit because I smelled the disaster happening before it did.\" She was replaced by Adrianna Costa.\nInitial episodes narrowed 50 semi-finalists down to 18 finalists. After the audition stage, the program was a one-hour show, in which movies were screened: Film Premiere. The next day featured half-hour episodes of viewer reaction, entitled Box Office. Viewers could vote each week for their favorite directors, which resulted in the elimination of the directors with the lowest vote totals. Votes could be made online at thelot.com, in addition to landline calls and Verizon text messages, and were permitted for two hours after the show.\nOriginally scheduled for separate episodes on consecutive nights, the \"Film Premiere\" episodes eventually aired on Tuesday nights at 8:00PM/7:00PM CT, with voting results as part of the following week's episode, as of May 31, 2007. The show also aired in Canada, on People+Arts in Latin America, on FOX8 in Australia, on STAR Movies in Asia, and on STAR World in Pakistan, India and Israel. The show also aired on SABC 2 in South Africa from July 19 until early August, when it was removed from the schedule. From the 11 December 2008 SABC 2 begun broadcasting On the Lot once again.", "rate": 15, "genre": [], "cast": ["Carrie Fisher", "Garry Marshall"], "character": ["Herself - Host", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3496   Expand On the Lot   (2007) User Score Overview On the Lot is a short-lived reality show competition for filmmaking, produced by Steven Spielberg and Mark Burnett. The show, which aired on Fox, featured filmmakers competing in weekly elimination competitions, with the ultimate prize of a million-dollar development deal at DreamWorks. On the Lot premiered May 22, 2007, and aired Tuesdays. The show was initially hosted by Chelsea Handler but she quit early on; she later said, \"I quit because I smelled the disaster happening before it did.\" She was replaced by Adrianna Costa. Initial episodes narrowed 50 semi-finalists down to 18 finalists. After the audition stage, the program was a one-hour show, in which movies were screened: Film Premiere. The next day featured half-hour episodes of viewer reaction, entitled Box Office. Viewers could vote each week for their favorite directors, which resulted in the elimination of the directors with the lowest vote totals. Votes could be made online at thelot.com, in addition to landline calls and Verizon text messages, and were permitted for two hours after the show. Originally scheduled for separate episodes on consecutive nights, the \"Film Premiere\" episodes eventually aired on Tuesday nights at 8:00PM/7:00PM CT, with voting results as part of the following week's episode, as of May 31, 2007. The show also aired in Canada, on People+Arts in Latin America, on FOX8 in Australia, on STAR Movies in Asia, and on STAR World in Pakistan, India and Israel. The show also aired on SABC 2 in South Africa from July 19 until early August, when it was removed from the schedule. From the 11 December 2008 SABC 2 begun broadcasting On the Lot once again. Featured Crew Steven Spielberg Creator Mark Burnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carrie Fisher Herself - Host Garry Marshall Himself - Host Full Cast & Crew Last Season Season 1 2007 | 16 Episodes Season 1 of On the Lot premiered on May 22, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on On the Lot. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.thelot.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 3 Elizabeth Jennings s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}