{"link": "https://www.themoviedb.org/tv/62431?language=en", "title": "What Are We Eating Today?", "resume": "Fun and Easy Cooking by Two Guys. In Shin Don-yub and Sung Si-kyung’s kitchen, they show you how to fix delicious and easy meals. No tricky recipes here, so anybody can do it!", "rate": 0, "genre": ["Family"], "cast": ["Shin Dong-yup", "Sung Si-kyung"], "character": ["Himself - Host", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62431   Expand What Are We Eating Today?   (2014) User Score Overview Fun and Easy Cooking by Two Guys. In Shin Don-yub and Sung Si-kyung’s kitchen, they show you how to fix delicious and easy meals. No tricky recipes here, so anybody can do it! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin Dong-yup Himself - Host Sung Si-kyung Himself - Host Full Cast & Crew Last Season Season 1 2014 | 129 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on What Are We Eating Today?. You can help by rating TV shows you've seen. Facts Original Name  오늘 뭐 먹지? Status  Returning Series Network Certification ALL Meaning This rating is for programming that is appropriate for all ages. This program usually involves programs designed for children or families. Type  Documentary Original Language  Korean Runtime  25m Homepage   http://program.lifestyler.co.kr/olive/todaymenu Genres Family Keywords food Content Score 56 We're so close, yet so far. Top Contributors 57 tincircle 19 Elizabeth Jennings j 6 jdl111 M 3 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}