{"link": "https://www.themoviedb.org/tv/2174?language=en", "title": "Just the Ten of Us", "resume": "Just the Ten of Us is an American sitcom starring stand-up comedian Bill Kirchenbauer as Coach Graham Lubbock, a teacher and the head of a large Catholic family with eight children living in Eureka, California. The series is a spin-off of Growing Pains, in which Kirchenbauer portrayed the same character on a recurring basis. As the series progressed, Coach Lubbock's four eldest daughters, the teenagers Marie, Cindy, Wendy, and Connie, became the primary focus of the show.\nJust the Ten of Us aired on ABC starting with a trial run on April 26, 1988 and ending on May 17, 1990. After the first four episodes in an abbreviated first season were aired, the show was renewed for two more seasons, eventually ending after 47 episodes on May 4, 1990. The show was most notably a part of what would become that network's TGIF programming block.", "rate": 50, "genre": ["Comedy"], "cast": ["Jamie Luner", "Heather Langenkamp", "Brooke Theiss", "Heidi Zeigler", "Bill Kirchenbauer"], "character": ["Cynthia \"Cindy\" Lubbock", "Marie Lubbock", "Wendy Lubbock", "Sherry Lubbock", "Coach Graham T. Lubbock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2174   Expand Just the Ten of Us   (1988) User Score Overview Just the Ten of Us is an American sitcom starring stand-up comedian Bill Kirchenbauer as Coach Graham Lubbock, a teacher and the head of a large Catholic family with eight children living in Eureka, California. The series is a spin-off of Growing Pains, in which Kirchenbauer portrayed the same character on a recurring basis. As the series progressed, Coach Lubbock's four eldest daughters, the teenagers Marie, Cindy, Wendy, and Connie, became the primary focus of the show. Just the Ten of Us aired on ABC starting with a trial run on April 26, 1988 and ending on May 17, 1990. After the first four episodes in an abbreviated first season were aired, the show was renewed for two more seasons, eventually ending after 47 episodes on May 4, 1990. The show was most notably a part of what would become that network's TGIF programming block. Featured Crew Steve Marshall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Luner Cynthia \"Cindy\" Lubbock Heather Langenkamp Marie Lubbock Brooke Theiss Wendy Lubbock Heidi Zeigler Sherry Lubbock Bill Kirchenbauer Coach Graham T. Lubbock Full Cast & Crew Last Season Season 3 1989 | 23 Episodes Season 3 of Just the Ten of Us premiered on September 22, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Just the Ten of Us. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors RH 13 Rafael Herbert  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}