{"link": "https://www.themoviedb.org/tv/62171?language=en", "title": "Aesthetica of a Rogue Hero", "resume": "Known as a Rogue Hero in the fantasy world Arezard, Akatsuki decided to take upon the request of the defeated Demon King to take his daughter with him. After bringing her back to the world he came from, Akatsuki brought her to join Babel, an academy-like organization that specializes in training those who came from the other world.", "rate": 79, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Youko Hikasa", "Kana Hanazawa", "Kana Ueda", "Takahiro Sakurai", "Marina Inoue"], "character": ["Miu \"Myuu\" Ousawa", "Kuzuha Doumoto", "Chikage Izumi", "Kyoya Hikami", "Haruka Nagase"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62171   Expand Aesthetica of a Rogue Hero   (2012) User Score Overview Known as a Rogue Hero in the fantasy world Arezard, Akatsuki decided to take upon the request of the defeated Demon King to take his daughter with him. After bringing her back to the world he came from, Akatsuki brought her to join Babel, an academy-like organization that specializes in training those who came from the other world. Featured Crew Ryunosuke Kingetsu Creator Rion Kujo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Youko Hikasa Miu \"Myuu\" Ousawa Kana Hanazawa Kuzuha Doumoto Kana Ueda Chikage Izumi Takahiro Sakurai Kyoya Hikami Marina Inoue Haruka Nagase Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of Aesthetica of a Rogue Hero premiered on July  6, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Aesthetica of a Rogue Hero. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2014-04-05 Dragonar Academy 7.0    2010-01-05 Ladies versus Butlers! 10.0    2010-07-10 Cat Planet Cuties 6.0    2015-10-03 Chivalry of a Failed Knight 7.9    2007-04-13 Stigma of the Wind 8.1    2009-10-03 The Sacred Blacksmith 8.7    2014-04-09 Chaika - The Coffin Princess 8.2    2012-07-05 Good Luck Girl! 8.0  Facts Original Name  はぐれ勇者の鬼畜美学 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords anime Content Score 93 Almost there... Top Contributors W 39 Watcher14 17 CrewMdk 15 Elizabeth Jennings U 9 Uilio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}