{"link": "https://www.themoviedb.org/tv/32718?language=en", "title": "Robinson Ekspeditionen", "resume": "Robinson Ekspeditionen is a popular Danish reality television program debuting in 1998. In the spring of 1998 TV3 purchased the broadcast rights to air their own version of Expedition Robinson. Following the success of the Swedish version, Denmark was the first country to adopt their own version of the show. The show has proven to be a ratings success since its premiere in 1998.\nThe name alludes to both Robinson Crusoe and The Swiss Family Robinson, two stories featuring people marooned by shipwrecks.", "rate": 80, "genre": ["Drama", "Reality"], "cast": ["Jakob Kjeldbjerg"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32718   Expand Robinson Ekspeditionen   (1998) User Score Overview Robinson Ekspeditionen is a popular Danish reality television program debuting in 1998. In the spring of 1998 TV3 purchased the broadcast rights to air their own version of Expedition Robinson. Following the success of the Swedish version, Denmark was the first country to adopt their own version of the show. The show has proven to be a ratings success since its premiere in 1998. The name alludes to both Robinson Crusoe and The Swiss Family Robinson, two stories featuring people marooned by shipwrecks. Featured Crew Charlie Parsons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jakob Kjeldbjerg Host Full Cast & Crew Last Season Season 19 2017 | 4 Episodes Season 19 of Robinson Ekspeditionen premiered on August 28, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Robinson Ekspeditionen. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Robinson Ekspeditionen. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  Danish Runtime  90m Homepage   http://www.tv3.dk/robinson Genres Drama Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 31 Mads 30 Banana 11 AndenIDK 10 vacdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}