{"link": "https://www.themoviedb.org/tv/69050?language=en", "title": "Riverdale", "resume": "Set in the present, the series offers a bold, subversive take on Archie, Betty, Veronica and their friends, exploring the surreality of small-town life, the darkness and weirdness bubbling beneath Riverdale’s wholesome facade.", "rate": 72, "genre": ["Drama", "Mystery"], "cast": ["K.J. Apa", "Camila Mendes", "Lili Reinhart", "Cole Sprouse", "Madelaine Petsch"], "character": ["Archie Andrews", "Veronica Lodge", "Betty Cooper", "Jughead Jones", "Cheryl Blossom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69050   Expand Riverdale   (2017) User Score  Play Trailer Overview Set in the present, the series offers a bold, subversive take on Archie, Betty, Veronica and their friends, exploring the surreality of small-town life, the darkness and weirdness bubbling beneath Riverdale’s wholesome facade. Featured Crew Roberto Aguirre-Sacasa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  66 Content Issues  1 Images Backdrops  55 Posters  47 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast K.J. Apa Archie Andrews Camila Mendes Veronica Lodge Lili Reinhart Betty Cooper Cole Sprouse Jughead Jones Madelaine Petsch Cheryl Blossom Full Cast & Crew Current Season Original Air Date Original Air Date Netflix (Digital) Season 2 2017 | 22 Episodes Season 2 of Riverdale premiered on October 11, 2017. View All Seasons Social Reviews  1 Discussions  67 A review by TrentTX  10.0 Written by  TrentTX  on April 13, 2017 There is a lot to like about Riverdale, but it may not be right for the most loyal fans of the Archie comics.  There are major changes here as Archie is updated to current American culture.  Still, the core relationships ring true.  The cast is outstanding with some familiar faces among the parents.  The central focus of season 1 is a murder mystery.  Although somewhat unexpected for Archie and the gang, the story effectively introduces the characters and relationships while establishing a Riverdale universe that will serve the series well for many seasons to come if renewal beyond season 2 occ...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  55 Posters  47 Recommendations   2017-03-31 13 Reasons Why 7.2    2015-03-17 iZombie 6.9    2017-10-02 The Gifted 7.0    2016-09-19 The Good Place 7.8    2014-09-25 How to Get Away with Murder 7.4    2017-10-11 Dynasty 6.8    2017-08-18 Marvel's The Defenders 7.1    2016-01-12 Shadowhunters 6.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cwtv.com/shows/riverdale/ Genres Drama Mystery Keywords high school small town love triangle based on comic school grudge Content Score 100 Yes! Looking good! Top Contributors 114 Marso R 33 Rebecca F 26 FanAboutTown 26 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}