{"link": "https://www.themoviedb.org/tv/68947?language=en", "title": "Chief Kim", "resume": "Kim Gwan-Chul used to work as an accountant, but now he works as a chief for a company. He is man who follows his principles and uses common sense. He also stands up for those in weaker positions.", "rate": 79, "genre": ["Comedy", "Drama"], "cast": ["Namgoong Min", "Nam Sang-mi", "Lee Jun-ho", "Jung Hye-sung", "Lee Il-hwa"], "character": ["Kim Sung-Ryong", "Yoon Ha-Kyung", "Seo Yool", "Hong Ga-Eun", "Jang Yoo-Sun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68947   Expand Chief Kim   (2017) User Score Overview Kim Gwan-Chul used to work as an accountant, but now he works as a chief for a company. He is man who follows his principles and uses common sense. He also stands up for those in weaker positions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Namgoong Min Kim Sung-Ryong Nam Sang-mi Yoon Ha-Kyung Lee Jun-ho Seo Yool Jung Hye-sung Hong Ga-Eun Lee Il-hwa Jang Yoo-Sun Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Chief Kim premiered on January 25, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2017-01-16 Introverted Boss 8.7    2017-11-11 Money Flower 8.0    2017-10-11 Mad Dog 8.0    2017-10-09 Witch's Court 9.3    2017-03-27 Whisper 6.8    2017-04-07 Chicago Typewriter 7.0    2017-09-27 While You Were Sleeping 9.0    2017-03-15 Radiant Office 6.9  Facts Original Name  김과장 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/managerkim/ Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors M 52 Maria180493 l 34 longwoo 7 lemonlyman 7 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}