{"link": "https://www.themoviedb.org/tv/44315?language=en", "title": "Moyasimon: Tales of Agriculture", "resume": "Moyasimon: Tales of Agriculture, known in Japan as Moyashimon, is a manga series created by Masayuki Ishikawa. It has been serialized in Kodansha's seinen magazine Evening from August 2004 to June 2013 and moved since then to the magazine Morning two. It won the 2008 Tezuka Osamu Cultural Prize for Grand Prize and the 2008 Kodansha Manga Award for general manga. Del Rey Manga licensed the manga, but only released two volumes in English in North America. An 11-episode anime television series adaptation, animated by Shirogumi and Telecom Animation Film, aired between October and December 2007 on Fuji TV's noitamina programming block. A second season titled Moyasimon Returns aired from July to September 2012. The series follows Tadayasu Sawaki, a first-year college student at an agricultural university, who has a unique ability to see and communicate with bacteria and other micro-organisms.", "rate": 0, "genre": ["Comedy"], "cast": ["Daisuke Sakaguchi", "Mitsuki Saiga", "Tomomichi Nishimura", "Sayaka Ohara", "Akemi Kanda"], "character": ["Tadayasu Souemon Sawaki", "Kei Yūki", "Keizō Itsuki", "Haruka Hasegawa", "Hazuki Oikawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44315   Expand Moyasimon: Tales of Agriculture   (2010) User Score Overview Moyasimon: Tales of Agriculture, known in Japan as Moyashimon, is a manga series created by Masayuki Ishikawa. It has been serialized in Kodansha's seinen magazine Evening from August 2004 to June 2013 and moved since then to the magazine Morning two. It won the 2008 Tezuka Osamu Cultural Prize for Grand Prize and the 2008 Kodansha Manga Award for general manga. Del Rey Manga licensed the manga, but only released two volumes in English in North America. An 11-episode anime television series adaptation, animated by Shirogumi and Telecom Animation Film, aired between October and December 2007 on Fuji TV's noitamina programming block. A second season titled Moyasimon Returns aired from July to September 2012. The series follows Tadayasu Sawaki, a first-year college student at an agricultural university, who has a unique ability to see and communicate with bacteria and other micro-organisms. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Sakaguchi Tadayasu Souemon Sawaki Mitsuki Saiga Kei Yūki Tomomichi Nishimura Keizō Itsuki Sayaka Ohara Haruka Hasegawa Akemi Kanda Hazuki Oikawa Full Cast & Crew Last Season Moyashimon season 1 2010 | 11 Episodes Season 1 of Moyasimon: Tales of Agriculture premiered on July  8, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Moyasimon: Tales of Agriculture. You can help by rating TV shows you've seen. Facts Original Name  もやしもん Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 4 Aka75 m 4 magoozin 1 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}