{"link": "https://www.themoviedb.org/tv/62904?language=en", "title": "Just Add Magic", "resume": "Kelly Quinn and her two BFF's, Darbie and Hannah, stumble upon her grandmother's mysterious cookbook in the attic and discover some far from ordinary recipes. When the Shut'em Up Shortcake silences Kelly's pesky little brother and the Healing Hazelnut Tart heals Darbie's ankle, the girls discover they have the power of magic. A single-camera live-action pilot based on the popular book.", "rate": 88, "genre": ["Family", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Olivia Sanabia", "Abby Donnelly", "Aubrey K. Miller", "Judah Bellamy", "Dee Wallace"], "character": ["Kelly Quinn", "Darbie O'Brien", "Hannah Parker-Kent", "Jake", "Grandma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62904   Expand Just Add Magic   (2015) User Score  Play Trailer Overview Kelly Quinn and her two BFF's, Darbie and Hannah, stumble upon her grandmother's mysterious cookbook in the attic and discover some far from ordinary recipes. When the Shut'em Up Shortcake silences Kelly's pesky little brother and the Healing Hazelnut Tart heals Darbie's ankle, the girls discover they have the power of magic. A single-camera live-action pilot based on the popular book. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olivia Sanabia Kelly Quinn Abby Donnelly Darbie O'Brien Aubrey K. Miller Hannah Parker-Kent Judah Bellamy Jake Dee Wallace Grandma Full Cast & Crew Last Season Season 2 2016 | 13 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Hannah: Happy Birthday Aubrey Miller! Open 0 by wonder2wonder\n      \n     a I love this show. Open 1 by  wonder2wonder w Darbie: Happy Birthday Abby Donnelly! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Just Add Magic. You can help by rating TV shows you've seen. Facts Status  Planned Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.amazon.com/Just-Add-Magic-HD/dp/B00RSGJ0DW Genres Family Kids Sci-Fi & Fantasy Keywords magic cookbook Content Score 93 Almost there... Top Contributors 37 Elizabeth Jennings 21 Banana A 18 Az0zA a 11 acontributor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}