{"link": "https://www.themoviedb.org/tv/45608?language=en", "title": "Hercules", "resume": "Hercules is a 2005 RHI Entertainment television miniseries, chronicling the life of the legendary Greek hero, Heracles, called Hercules in this series. It is most often aired on television as a two-part miniseries: the first part documents his early life in Tiryns and his desire and marriage to the lady Megara; the second part follows the more widely-recognised part of his life, in seeking redemption for the madness-induced murder of his family.\nThe series incorporates Hercules's murder of his family—usually not included in modern interpretations of the character—and includes five of his twelve labors from Greek mythology. The series alters some of the elements of the myths including placing the giant Antaeus as his father while in Greek myths his father was the king of the gods, Zeus.", "rate": 54, "genre": ["Drama"], "cast": ["Elizabeth Perkins", "Paul Telfer", "Sean Astin", "Leelee Sobieski", "Leeanna Walsman"], "character": ["Alcmene", "Hercules", "Linus", "Deianeira", "Megara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45608   Expand Hercules   (2005) User Score  Play Trailer Overview Hercules is a 2005 RHI Entertainment television miniseries, chronicling the life of the legendary Greek hero, Heracles, called Hercules in this series. It is most often aired on television as a two-part miniseries: the first part documents his early life in Tiryns and his desire and marriage to the lady Megara; the second part follows the more widely-recognised part of his life, in seeking redemption for the madness-induced murder of his family. The series incorporates Hercules's murder of his family—usually not included in modern interpretations of the character—and includes five of his twelve labors from Greek mythology. The series alters some of the elements of the myths including placing the giant Antaeus as his father while in Greek myths his father was the king of the gods, Zeus. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth Perkins Alcmene Paul Telfer Hercules Sean Astin Linus Leelee Sobieski Deianeira Leeanna Walsman Megara Full Cast & Crew Last Season Miniseries 2005 | 2 Episodes Season 1 of Hercules premiered on January  1, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   1994-10-23 Family Album 3.5    1980-12-25 Arabela 8.3    1987-01-25 Miss Marple: At Bertram's Hotel 6.7    1987-01-11 Miss Marple: Sleeping Murder 7.0    1976-06-04 Twelve Chairs 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  178m Homepage  - Genres Drama Keywords greek mythology miniseries hercules Content Score 93 Almost there... Top Contributors TB 46 TMDb Bot 13 Steve O 9 OkayGo 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}