{"link": "https://www.themoviedb.org/tv/62875?language=en", "title": "BUNK'D", "resume": "Siblings Emma, Ravi, and Zuri Ross leave their extravagant New York City penthouse once again to return to Camp Kikiwaka, a rustic summer camp in Maine where their parents met as teenagers.", "rate": 53, "genre": ["Comedy"], "cast": ["Peyton List", "Miranda May", "Karan Brar", "Skai Jackson", "Aaron J Christopher"], "character": ["Emma Ross", "Lou", "Ravi Ross", "Zuri Ross", "Klimt Cheerios Ross Adopted Son"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62875   Expand BUNK'D   (2015) User Score Overview Siblings Emma, Ravi, and Zuri Ross leave their extravagant New York City penthouse once again to return to Camp Kikiwaka, a rustic summer camp in Maine where their parents met as teenagers. Featured Crew Pamela Eells Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peyton List Emma Ross Miranda May Lou Karan Brar Ravi Ross Skai Jackson Zuri Ross Aaron J Christopher Klimt Cheerios Ross Adopted Son Full Cast & Crew Current Season Season 3 2018 | 14 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply p Bunk'd - Season 3 Episodes and Airdates Open 4 by  poweranimals w Ravi: Happy Birthday Karan Brar! Open 0 by wonder2wonder\n      \n     w Jorge: Happy Birthday Nathan Arenas! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2015-12-11 Lost & Found Music Studios 8.0    2013-10-07 Mighty Med 6.2    2013-12-24 Turbo FAST 4.7    2014-01-06 Some Assembly Required 4.7    2009-04-05 Beyblade: Metal Fusion 3.8    2015-09-12 Game Shakers 6.4    2013-10-14 The Thundermans 8.2  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m Homepage   http://disneynow.go.com/shows/bunkd Genres Comedy Keywords summer camp spin off sitcom Content Score 93 Almost there... Top Contributors 45 Elizabeth Jennings 21 DarkMan 13 Banana 7 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}