{"link": "https://www.themoviedb.org/tv/75058?language=en", "title": "Kiss that Kills", "resume": "Otaro Dojima works as a popular host. Because of a past incident, he believes that love makes people unhappy. He now only pursues money and power.\nA mysterious woman appears in front of Otaro Dojima. The mysterious woman has a pale face with red lips. She kisses him and he dies, but the next moment he regains consciousness. He realizes he is now 7 days in the past. The mysterious woman also follows him. Due to her kiss, Otaro Dojima dies and goes back to the past over and over again.", "rate": 0, "genre": ["Drama", "Mystery"], "cast": ["Kento Yamazaki", "Mugi Kadowaki", "Mackenyu Arata", "Yuko Araki", "Hayato Sano"], "character": ["Otaro Dojima", "Mysterious woman", "Takauji Namiki", "Mikoto Namiki", "Hiroyuki Hasebe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75058   Expand Kiss that Kills   (2018) User Score Overview Otaro Dojima works as a popular host. Because of a past incident, he believes that love makes people unhappy. He now only pursues money and power. A mysterious woman appears in front of Otaro Dojima. The mysterious woman has a pale face with red lips. She kisses him and he dies, but the next moment he regains consciousness. He realizes he is now 7 days in the past. The mysterious woman also follows him. Due to her kiss, Otaro Dojima dies and goes back to the past over and over again. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kento Yamazaki Otaro Dojima Mugi Kadowaki Mysterious woman Mackenyu Arata Takauji Namiki Yuko Araki Mikoto Namiki Hayato Sano Hiroyuki Hasebe Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Kiss that Kills premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kiss that Kills. You can help by rating TV shows you've seen. Facts Original Name  トドメの接吻 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ntv.co.jp/todomenokiss/ Genres Drama Mystery Keywords fantasy japan supernatural romance Content Score 86 Almost there... Top Contributors M 65 Maria180493 5 Elizabeth Jennings 1 winnersx265 1 galactica_j  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}