{"link": "https://www.themoviedb.org/tv/13629?language=en", "title": "The Legend of Stars", "resume": "Schoolgirl Hikari has two loves: rhythmic gymnastics and Ohishi, a schoolmate who is one of the best gymnasts in his league. Natsukawa, Hikari's childhood friend, plays in a band called Mr.D. Over the years, he has come to love Hikari very deeply. Will Hikari gain Ohishi's love? Or will Natsukawa win her over?", "rate": 70, "genre": ["Animation"], "cast": ["Tsukasa Itou", "Michie Tomizawa", "Nobuo Tobita", "Yoshimasa Inoue"], "character": ["Hikari Kamijou (voice)", "Hazuki Shiina (voice)", "Takaaki Ooishi (voice)", "Mao Natsukawa (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13629   Expand The Legend of Stars   (1986) User Score Overview Schoolgirl Hikari has two loves: rhythmic gymnastics and Ohishi, a schoolmate who is one of the best gymnasts in his league. Natsukawa, Hikari's childhood friend, plays in a band called Mr.D. Over the years, he has come to love Hikari very deeply. Will Hikari gain Ohishi's love? Or will Natsukawa win her over? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast Tsukasa Itou Hikari Kamijou (voice) Michie Tomizawa Hazuki Shiina (voice) Nobuo Tobita Takaaki Ooishi (voice) Yoshimasa Inoue Mao Natsukawa (voice) Full Cast & Crew Last Season Season 1 1986 | 19 Episodes Season 1 of The Legend of Stars premiered on May  3, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Stars. You can help by rating TV shows you've seen. Facts Original Name  光の伝説 Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tatsunoko.co.jp/works/the-legend-of-stars Genres Animation Keywords love triangle sport music romance unrequited love rhythmic gymnastics Content Score 93 Almost there... Top Contributors 110 Marr 🇳🇱 t 4 tmdb983464 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}