{"link": "https://www.themoviedb.org/tv/5932?language=en", "title": "Sordid Lives: The Series", "resume": "Sordid Lives: The Series is an American television series created, written, and directed by Del Shores and acts as a prequel to 2000 film Sordid Lives, also by Shores, self-described as a \"Black comedy about white trash\". The show is set in small town Texas and centers around the Ingram family.\nIt stars Rue McClanahan, Olivia Newton-John, Caroline Rhea, Leslie Jordan, Beth Grant and most of the original cast of the film.\nIt premiered on Logo in July 2008. In Canada, Sordid Lives the uncut version can be seen on Super Channel and the censored version on Out TV. According to Logo's contact page a second season will not be produced due to a lack of funding, and the Logo online web page for the series is no longer available.\nThe series premiered in the UK on Film24 in August 2009.", "rate": 80, "genre": ["Comedy"], "cast": ["Jason Dottley", "Olivia Newton-John", "David Cowgill", "Beth Grant", "Sarah Hunley"], "character": ["Ty Williamson", "Bitsy Mae Harling", "Odell Owens", "Sissy Hickey", "Juanita Bartlett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5932   Expand Sordid Lives: The Series   (2008) User Score Overview Sordid Lives: The Series is an American television series created, written, and directed by Del Shores and acts as a prequel to 2000 film Sordid Lives, also by Shores, self-described as a \"Black comedy about white trash\". The show is set in small town Texas and centers around the Ingram family. It stars Rue McClanahan, Olivia Newton-John, Caroline Rhea, Leslie Jordan, Beth Grant and most of the original cast of the film. It premiered on Logo in July 2008. In Canada, Sordid Lives the uncut version can be seen on Super Channel and the censored version on Out TV. According to Logo's contact page a second season will not be produced due to a lack of funding, and the Logo online web page for the series is no longer available. The series premiered in the UK on Film24 in August 2009. Featured Crew Del Shores Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Dottley Ty Williamson Olivia Newton-John Bitsy Mae Harling David Cowgill Odell Owens Beth Grant Sissy Hickey Sarah Hunley Juanita Bartlett Full Cast & Crew Last Season (season 1) 2008 | 24 Episodes Season 1 of Sordid Lives: The Series premiered on July 23, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sordid Lives: The Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage   http://www.logoonline.com/shows/dyn/sordid_lives/series.jhtml Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 1 sbrodie F 1 Franky n 1 nixskits  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}