{"link": "https://www.themoviedb.org/tv/2342?language=en", "title": "Clone High", "resume": "Clone High is a Canadian-American adult animated television series that aired for one season on MTV and Teletoon.\nThe series had run in its entirety in Canada on Teletoon before premiering in the United States on MTV. The last five episodes were never broadcast in the United States. The Clone High theme song was written by Liam Lynch and performed by alternative rock band Abandoned Pools, who also provided much of the series' background music.", "rate": 66, "genre": ["Animation", "Comedy"], "cast": ["Christa Miller", "Will Forte", "Nicole Sullivan", "Michael McDonald", "Andy Dick"], "character": ["Cleopatra (voice)", "Abe Lincoln (voice)", "Joan of Arc (voice)", "Gandhi (voice)", "Mr. Sheepman (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2342   Expand Clone High   (2002) User Score Overview Clone High is a Canadian-American adult animated television series that aired for one season on MTV and Teletoon. The series had run in its entirety in Canada on Teletoon before premiering in the United States on MTV. The last five episodes were never broadcast in the United States. The Clone High theme song was written by Liam Lynch and performed by alternative rock band Abandoned Pools, who also provided much of the series' background music. Featured Crew Bill Lawrence Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christa Miller Cleopatra (voice) Will Forte Abe Lincoln (voice) Nicole Sullivan Joan of Arc (voice) Michael McDonald Gandhi (voice) Andy Dick Mr. Sheepman (voice) Full Cast & Crew Last Season Season 1 2002 | 13 Episodes Season 1 of Clone High premiered on November  2, 2002. View All Seasons Social Reviews  1 Discussions  0 e A review by emnel  7.0 Written by  emnel  on June  9, 2017 Ghandi achieves a lot in this show, just not in the way you would expect. He becomes a international rap sensation after rapping \"G Spot rock the G spot, G spot rock the G spot / What's my name? G SPOT!\" over G-Funk beats. He Develops TWO addictions to an energy drink that goes by the name of \"X-Stream Blu\" and -errr- smoking raisins, the  latter resulting in a trip through his sub conscience with a hummingbird-unicorn-donkey creature. He's diagnosed with ADD. He becomes a trucker, kidnaps a mascot, it goes on and on.   G Spot Rocks The G Spot.  Damn that song is catchy.  None of h...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2001-04-01 Undergrads 6.3    2007-08-06 Drunk History 6.6    1994-12-19 The Head 7.3    1999-09-24 Mission Hill 7.3    2006-10-16 Frisky Dingo 8.1    2011-06-01 Franklin & Bash 7.1    1999-06-15 The Man Show 5.9    1997-03-03 Daria 7.5  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.clone-high.com/ Genres Animation Comedy Keywords high school experiment clone historical figure Content Score 93 Almost there... Top Contributors 32 Banana 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}