{"link": "https://www.themoviedb.org/tv/60572?language=en", "title": "Pokémon", "resume": "Join Ash Ketchum, accompanied by his partner Pikachu, as he travels through many regions, meets new friends and faces new challenges on his quest to become a Pokémon Master.", "rate": 62, "genre": ["Action", "Adventure", "Animation"], "cast": ["Ikue Otani", "Fábio Lucindo"], "character": ["Pikachu", "Ash"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60572   Expand Pokémon   (1997) User Score Overview Join Ash Ketchum, accompanied by his partner Pikachu, as he travels through many regions, meets new friends and faces new challenges on his quest to become a Pokémon Master. Featured Crew Satoshi Tajiri Creator Ken Sugimori Creator Junichi Masuda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  9 Images Backdrops  12 Posters  17 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ikue Otani Pikachu Fábio Lucindo Ash Full Cast & Crew Current Season Sun & Moon: Ultra Adventures 2017 | 31 Episodes View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply There are no discussions for Pokémon. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  17 Recommendations   1991-08-11 Rugrats 7.1    1998-11-18 The Powerpuff Girls 7.0    1983-09-10 Inspector Gadget 6.6    1996-04-28 Dexter's Laboratory 7.3    1999-03-07 Digimon 6.8    1960-09-30 The Flintstones 7.0    1993-09-13 Animaniacs 7.6    1997-07-07 Johnny Bravo 6.6  Facts Original Name  ポケモン Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.pokemon.com/ Genres Action & Adventure Animation Keywords pokémon creature based on video game fantasy world anime Content Score 64 We're so close, yet so far. Top Contributors 141 Marr 🇳🇱 112 MDLefevere 90 xyzl b 73 benqen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}