{"link": "https://www.themoviedb.org/tv/64320?language=en", "title": "Oh My Venus", "resume": "Kim Young Ho is a personal trainer for Hollywood stars. Even though he comes from a wealthy family background, he suffered a devastating injury during his childhood days. Now, he overcomes his problems with patience and stubbornness. Meanwhile, Kang Joo Eun is 33-years-old lawyer. She has struggled to support her family. Now, she is overweight and challenge her-selves for a diet.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["So Ji-sub", "Shin Min-A", "Jung Gyu-woon", "Yoo In-young", "Jo Eun-ji"], "character": ["Kim Young-ho", "Kang Joo-eun", "Im Woo-shik", "Oh Soo-jin", "Lee Hyun-woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64320   Expand Oh My Venus   (2015) User Score Overview Kim Young Ho is a personal trainer for Hollywood stars. Even though he comes from a wealthy family background, he suffered a devastating injury during his childhood days. Now, he overcomes his problems with patience and stubbornness. Meanwhile, Kang Joo Eun is 33-years-old lawyer. She has struggled to support her family. Now, she is overweight and challenge her-selves for a diet. Featured Crew Kim Hyung-Suk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast So Ji-sub Kim Young-ho Shin Min-A Kang Joo-eun Jung Gyu-woon Im Woo-shik Yoo In-young Oh Soo-jin Jo Eun-ji Lee Hyun-woo Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Oh My Venus premiered on November 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2012-03-21 Rooftop Prince 8.1    2011-06-29 Heartstrings 7.0    2013-01-07 Flower Boy Next Door 7.2    2013-08-07 Master's Sun 7.7    2010-03-31 Personal Taste 7.4    2011-05-09 Lie To Me 7.6    2013-10-09 The Heirs 7.4    2010-11-13 Secret Garden 8.2  Facts Original Name  오 마이 비너스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/ohmyvenus/ Genres Comedy Drama Keywords romance korea weight loss Content Score 100 Yes! Looking good! Top Contributors M 50 Maria180493 7 GHOST p 6 ppreethi 5 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}