{"link": "https://www.themoviedb.org/tv/32651?language=en", "title": "Interny", "resume": "Medical sitcom Ivan Okhlobystin about doctors who still do not know how to treat, but know how to make people laugh. The main characters of the sitcom - four interns. They always get into stupid situations, and their leader Dr. Bykov pleasure of watching this", "rate": 57, "genre": ["Comedy", "Family"], "cast": ["Ivan Okhlobystin", "Aleksandr Ilin", "Ilya Glinnikov", "Svetlana Kamynina", "Svetlana Permyakova"], "character": ["Andrey Evgen'evich Bykov", "Semyon Lobanov", "Gleb Romanenko", "Kisegach", "Lyubov Mikhaylovna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32651   Expand Interny   (2010) User Score  Play Trailer Overview Medical sitcom Ivan Okhlobystin about doctors who still do not know how to treat, but know how to make people laugh. The main characters of the sitcom - four interns. They always get into stupid situations, and their leader Dr. Bykov pleasure of watching this Featured Crew Vyacheslav Dusmukhametov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ivan Okhlobystin Andrey Evgen'evich Bykov Aleksandr Ilin Semyon Lobanov Ilya Glinnikov Gleb Romanenko Svetlana Kamynina Kisegach Svetlana Permyakova Lyubov Mikhaylovna Full Cast & Crew Last Season Season 5 2016 | 20 Episodes Season 5 of Interny premiered on January 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  3 Recommendations   2010-11-08 Реальные пацаны 7.5    2005-12-19 The Master and Margarita 6.0    2008-08-25 Универ 4.3    2007-09-03 Daddy's Daughters 4.8    2006-03-08 Happy Together 4.0    2014-04-07 P. E. Teacher 6.1    2006-11-04 Our Russia 3.7    1986-05-13 KVN 6.3  Facts Original Name  Интерны Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Russian Runtime  25m Homepage   http://interny.tnt-online.ru/ Genres Comedy Family Keywords hospital doctor medical student sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 225 Fludogenerator 74 NEOhidra 6 West@ 5 tigriso1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}