{"link": "https://www.themoviedb.org/tv/7827?language=en", "title": "The Way We Live Now", "resume": "The Way We Live Now is a 2001 four-part television adaptation of the Anthony Trollope novel The Way We Live Now. The serial was first broadcast on the BBC and was directed by David Yates, written by Andrew Davies and produced by Nigel Stafford-Clark. David Suchet starred as Auguste Melmotte, with Shirley Henderson as his daughter Marie, Matthew Macfadyen as Sir Felix Carbury, Cillian Murphy as Paul Montague and Miranda Otto as Mrs Hurtle.", "rate": 79, "genre": ["Drama"], "cast": ["Shirley Henderson", "David Suchet", "Matthew Macfadyen", "Tony Britton", "Paloma Baeza"], "character": ["Marie Melmotte", "Augustus Melmotte", "Sir Felix Carbury", "Hetta Carbury"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7827   Expand The Way We Live Now   (2001) User Score Overview The Way We Live Now is a 2001 four-part television adaptation of the Anthony Trollope novel The Way We Live Now. The serial was first broadcast on the BBC and was directed by David Yates, written by Andrew Davies and produced by Nigel Stafford-Clark. David Suchet starred as Auguste Melmotte, with Shirley Henderson as his daughter Marie, Matthew Macfadyen as Sir Felix Carbury, Cillian Murphy as Paul Montague and Miranda Otto as Mrs Hurtle. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shirley Henderson Marie Melmotte David Suchet Augustus Melmotte Matthew Macfadyen Sir Felix Carbury Tony Britton Paloma Baeza Hetta Carbury Full Cast & Crew Last Season Season 1 2001 | 4 Episodes Season 1 of The Way We Live Now premiered on November 11, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2004-04-18 He Knew He Was Right 6.6    1994-04-10 Middlemarch 8.0    1999-06-20 Aristocrats 7.8    1996-11-17 The Tenant of Wildfell Hall 7.3    2002-11-23 Daniel Deronda 7.2    2008-01-13 Lark Rise to Candleford 7.3    2002-04-07 The Forsyte Saga 7.7    1999-11-28 Wives and Daughters 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  75m Homepage  - Genres Drama Keywords london england based on novel or book miniseries period drama 19th century Content Score 86 Almost there... Top Contributors TB 12 TMDb Bot 8 Banana R 5 Rebecca 3 TerminusMKB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}