{"link": "https://www.themoviedb.org/tv/20633?language=en", "title": "Poko", "resume": "Poko was a stop motion TV series about a young boy, his pet dog, and his toy monkey. Produced in Canada by Halifax Film, a DHX Media Company, Poko was created by Jeff Rosen, It began production in 2003 and ended in 2006 after three production cycles. Poko is still broadcast in Canada on CBC Television in the Kids' CBC programming block, is still broadcast in Turkey on Yumurcak TV and in Australia by ABC. It is narrated by actor and dancer Cory Bowles.\nThe show was awarded the 2004 Gemini for Best Pre-school Program in 2004 and the Alliance for Children & Television Grand Prize in 2007.", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20633   Expand Poko User Score Overview Poko was a stop motion TV series about a young boy, his pet dog, and his toy monkey. Produced in Canada by Halifax Film, a DHX Media Company, Poko was created by Jeff Rosen, It began production in 2003 and ended in 2006 after three production cycles. Poko is still broadcast in Canada on CBC Television in the Kids' CBC programming block, is still broadcast in Turkey on Yumurcak TV and in Australia by ABC. It is narrated by actor and dancer Cory Bowles. The show was awarded the 2004 Gemini for Best Pre-school Program in 2004 and the Alliance for Children & Television Grand Prize in 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 — | 15 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}