{"link": "https://www.themoviedb.org/tv/73030?language=en", "title": "Comrade Detective", "resume": "In the 1980s, millions of Romanians tuned in to Comrade Detective, a gritty, sexy, communist buddy cop show that has now been digitally remastered and dubbed into English for the first time.", "rate": 74, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Channing Tatum", "Florin Piersic Jr.", "Joseph Gordon-Levitt", "Corneliu Ulici", "Jenny Slate"], "character": ["Gregor Anghel (voice)", "Gregor Anghel", "Iosif Baciu (voice)", "Iosif Baciu", "Jane (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73030   Expand Comrade Detective   (2017) User Score  Play Trailer Overview In the 1980s, millions of Romanians tuned in to Comrade Detective, a gritty, sexy, communist buddy cop show that has now been digitally remastered and dubbed into English for the first time. Featured Crew Brian Gatewood Creator Alessandro Tanaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Channing Tatum Gregor Anghel (voice) Florin Piersic Jr. Gregor Anghel Joseph Gordon-Levitt Iosif Baciu (voice) Corneliu Ulici Iosif Baciu Jenny Slate Jane (voice) Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Comrade Detective premiered on August  4, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply spoiler alert Open 0 by dawna3\n      \n     anyone seen this? Open 2 by  TalisBriedis Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2017-02-03 Santa Clarita Diet 7.3    2014-01-25 Black Sails 7.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  40m Homepage   https://www.amazon.com/dp/B073X9R3TQ Genres Action & Adventure Comedy Keywords spoof police detective romania Content Score 100 Yes! Looking good! Top Contributors 49 Elizabeth Jennings s 6 speedycars 3 Mervan D 3 Denys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}