{"link": "https://www.themoviedb.org/tv/63699?language=en", "title": "Utopia", "resume": "Set inside the offices of the \"Nation Building Authority\", a newly created government organisation responsible for overseeing major infrastructure projects, Utopia explores that moment when bureaucracy and grand dreams collide. It's a tribute to those political leaders who have somehow managed to take a long-term vision and use it for short-term gain.", "rate": 82, "genre": ["Comedy"], "cast": ["Rob Sitch", "Anthony Lehmann", "Celia Pacquola", "Dave Lawson", "Kitty Flanagan"], "character": ["Tony Woodford", "Jim Gibson", "Nat Russell", "Scott Byrnes", "Rhonda Stewart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63699   Expand Utopia   (2014) User Score  Play Trailer Overview Set inside the offices of the \"Nation Building Authority\", a newly created government organisation responsible for overseeing major infrastructure projects, Utopia explores that moment when bureaucracy and grand dreams collide. It's a tribute to those political leaders who have somehow managed to take a long-term vision and use it for short-term gain. Featured Crew Rob Gleisner Creator Rob Sitch Creator Santo Cilauro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Sitch Tony Woodford Anthony Lehmann Jim Gibson Celia Pacquola Nat Russell Dave Lawson Scott Byrnes Kitty Flanagan Rhonda Stewart Full Cast & Crew Last Season Season 3 2017 | 8 Episodes Season 3 of Utopia premiered on July 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2012-11-01 Redfern Now 8.0    2016-06-08 Power Monkeys 7.0    2016-10-12 Rosehaven 6.5    2016-08-02 Borderline 7.1    2015-04-15 The Delivery Man 6.5    2015-10-22 No Activity 8.0    2003-01-27 Veritas: The Quest 6.3  Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  27m Homepage   http://www.abc.net.au/tv/programs/utopia/ Genres Comedy Keywords politics political satire government employee sitcom federal government workplace comedy government waste government agency Content Score 100 Yes! Looking good! Top Contributors c 53 cynphul 41 Elizabeth Jennings 36 United600 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}