{"link": "https://www.themoviedb.org/tv/61389?language=en", "title": "Saint Seiya The Lost Canvas - The Myth of Hades", "resume": "Saint Seiya: The Lost Canvas – The Myth of Hades, also known as simply The Lost Canvas, is a manga written and illustrated by Shiori Teshirogi. It is a spin-off based on the manga series Saint Seiya, which was created, written and illustrated by Japanese author Masami Kurumada. The Lost Canvas was published by Akita Shoten in the Weekly Shōnen Champion magazine since August 24, 2006, concluding after 223 chapters on April 6, 2011, with twenty-five tankōbon released. Originally envisioned as a comic book whose purpose was to work simultaneously with Kurumada's Saint Seiya Next Dimension as a multi-angle interpretation of the shared elements of its storyline, which stems from an event mentioned in Kurumada's original Saint Seiya manga; the approach was quickly abandoned, as both works greatly diverged, Kurumada's Next Dimension stayed as the canonical telling of these events, and The Lost Canvas as a separate alternate retelling. The story takes place in the 18th century, and focuses on how an orphan known as Tenma becomes one of Athena's 88 warriors known as Saints and finds himself in a war fighting against his best friend Alone who is revealed to be the reincarnation of Athena's biggest enemy, the God Hades.", "rate": 84, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": ["Hiro Shimono", "Sanae Kobayashi", "Tetsuya Kakihara", "Aya Hirano", "Atsushi Abe"], "character": ["Alone", "Crane", "Tenma, Pegasus", "Sasha", "Unicorn, Yato"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61389   Expand Saint Seiya The Lost Canvas - The Myth of Hades   (2009) User Score Overview Saint Seiya: The Lost Canvas – The Myth of Hades, also known as simply The Lost Canvas, is a manga written and illustrated by Shiori Teshirogi. It is a spin-off based on the manga series Saint Seiya, which was created, written and illustrated by Japanese author Masami Kurumada. The Lost Canvas was published by Akita Shoten in the Weekly Shōnen Champion magazine since August 24, 2006, concluding after 223 chapters on April 6, 2011, with twenty-five tankōbon released. Originally envisioned as a comic book whose purpose was to work simultaneously with Kurumada's Saint Seiya Next Dimension as a multi-angle interpretation of the shared elements of its storyline, which stems from an event mentioned in Kurumada's original Saint Seiya manga; the approach was quickly abandoned, as both works greatly diverged, Kurumada's Next Dimension stayed as the canonical telling of these events, and The Lost Canvas as a separate alternate retelling. The story takes place in the 18th century, and focuses on how an orphan known as Tenma becomes one of Athena's 88 warriors known as Saints and finds himself in a war fighting against his best friend Alone who is revealed to be the reincarnation of Athena's biggest enemy, the God Hades. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiro Shimono Alone Sanae Kobayashi Crane Tetsuya Kakihara Tenma, Pegasus Aya Hirano Sasha Atsushi Abe Unicorn, Yato Full Cast & Crew Last Season Season 1 2009 | 13 Episodes Season 1 of Saint Seiya The Lost Canvas - The Myth of Hades premiered on June 24, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Saint Seiya The Lost Canvas - The Myth of Hades. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2002-11-09 Saint Seiya: The Hades Chapter 8.4    1986-10-11 Saint Seiya 8.0    1995-10-04 Neon Genesis Evangelion 8.0  Facts Original Name  聖闘士星矢 THE LOST CANVAS 冥王神話 Status  Ended Networks - Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors T 36 Tinobe MI 14 Marcos IMX 13 dmolina1309 h 7 herlock60  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}