{"link": "https://www.themoviedb.org/tv/1886?language=en", "title": "Tutenstein", "resume": "Tutenstein is an animated television series, produced by Porchlight Entertainment for Discovery Kids based on the comic by Jay Stephens which was published in Oni Press' JetCat Clubhouse. This cartoon also airs on Jetix in Europe and Maxi TV in Turkey. It began broadcasting on November 1, 2003. The half-hour series features young mummy Tutankhamen who is awakened about 3,000 years after his accidental death and now must face that his kingdom is gone. The series is based on an idea by Jay Stephens. The name is a portmanteau of Tutankhamun and Frankenstein. On October 11, 2008 a TV movie entitled Tutenstein: Clash of the Pharaohs aired on Discovery Kids.\nThe production company, PorchLight Entertainment, which is based in Los Angeles, California, has won Emmys for the first and second seasons of the series. Irish TV production company Telegael, which is based in An Spidéal, Co Galway, also won an Emmy Award for the second season.\nThe Hub aired the show after the closure of Discovery Kids.", "rate": 71, "genre": ["Animation"], "cast": ["Crystal Scales", "Lex Lang", "Jeannie Elias", "Maryke Hendrikse", "David Lodge"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1886   Expand Tutenstein   (2003) User Score Overview Tutenstein is an animated television series, produced by Porchlight Entertainment for Discovery Kids based on the comic by Jay Stephens which was published in Oni Press' JetCat Clubhouse. This cartoon also airs on Jetix in Europe and Maxi TV in Turkey. It began broadcasting on November 1, 2003. The half-hour series features young mummy Tutankhamen who is awakened about 3,000 years after his accidental death and now must face that his kingdom is gone. The series is based on an idea by Jay Stephens. The name is a portmanteau of Tutankhamun and Frankenstein. On October 11, 2008 a TV movie entitled Tutenstein: Clash of the Pharaohs aired on Discovery Kids. The production company, PorchLight Entertainment, which is based in Los Angeles, California, has won Emmys for the first and second seasons of the series. Irish TV production company Telegael, which is based in An Spidéal, Co Galway, also won an Emmy Award for the second season. The Hub aired the show after the closure of Discovery Kids. Featured Crew Jay Stephens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Crystal Scales Lex Lang Jeannie Elias Maryke Hendrikse David Lodge Full Cast & Crew Last Season Season 3 2006 | 13 Episodes Season 3 of Tutenstein premiered on March 20, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   2004-12-18 W.I.T.C.H. 6.6    2003-08-23 Sonic X 5.5    2006-10-02 Yin Yang Yo! 4.8    2001-11-03 Totally Spies! 5.6    The Kids from Room 402 8.4    2006-09-08 Pucca 3.8    2005-07-08 Camp Lazlo 5.6    2001-09-26 What's with Andy? 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors P 6 Prototyp206 5 Marr 🇳🇱 s 3 speedycars 3 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}