{"link": "https://www.themoviedb.org/tv/10490?language=en", "title": "Pound Puppies", "resume": "Pound Puppies was a toy line sold by Tonka in the 1980s. It later inspired an animated TV special, an animated TV series, and a feature film. Shipments of the toys over five years generated sales of $300 million in 35 countries.\nThe puppies had a variety of plush stuffed dog dolls with floppy ears and droopy eyes. They came in a variety of colors, some with spots. Each one came in a carrying case with an adoption certificate. Smaller versions were also created, and a line of cats called Pound Pur-r-ries was also released. Each authentic puppy had a heart-shaped emblem near its tail that sported a \"PP\" logo with either a dog or cat peeking around it. In 1987, Hardee's restaurants also offered a series of Pound Puppies with their Children's Meals. Also, Pound Puppies continued to be popular in the early 1990s.", "rate": 67, "genre": ["Animation"], "cast": ["Nancy Cartwright", "Frank Welker", "Dan Gilvezan", "Ruth Buzzi", "Robert Morse"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10490   Expand Pound Puppies   (1986) User Score Overview Pound Puppies was a toy line sold by Tonka in the 1980s. It later inspired an animated TV special, an animated TV series, and a feature film. Shipments of the toys over five years generated sales of $300 million in 35 countries. The puppies had a variety of plush stuffed dog dolls with floppy ears and droopy eyes. They came in a variety of colors, some with spots. Each one came in a carrying case with an adoption certificate. Smaller versions were also created, and a line of cats called Pound Pur-r-ries was also released. Each authentic puppy had a heart-shaped emblem near its tail that sported a \"PP\" logo with either a dog or cat peeking around it. In 1987, Hardee's restaurants also offered a series of Pound Puppies with their Children's Meals. Also, Pound Puppies continued to be popular in the early 1990s. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nancy Cartwright Frank Welker Dan Gilvezan Ruth Buzzi Robert Morse Full Cast & Crew Last Season Season 2 2012 | 23 Episodes Season 2 of Pound Puppies premiered on June  2, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pound Puppies. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.poundpuppies.com/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Chase Williams R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}