{"link": "https://www.themoviedb.org/tv/4285?language=en", "title": "Pearl Princess", "resume": "Princess Pearl, also known in Singapore and the Philippines as My Fair Princess, is a Chinese-language television series adapted from Chiung Yao's novel series of the same title. Produced by Taiwan Pleasant Communications Limited Company and Hunan TV, the series centers around the legend of Princess Huanzhu during the reign of the Qianlong Emperor of the Qing Dynasty. Although some characters, the plot premise, and certain sections of the story are based on historical events and figures, considerable artistic license was employed. Fans may often abbreviate the series' pinyin name of Huánzhū Gégé into \"HZGG\".\nThe series was split into three seasons. The first season was produced in 1997 and broadcast in 1998. The second was broadcast in 1999, and the third in 2003.\nPrincess Pearl enjoyed the highest viewership of any television drama in Chinese history. Seasons 1 and 2 received up to 54% and 65% of audience shares respectively during broadcast, and became the television series with the most reruns broadcast from the 1990s to today. Princess Pearl went on to receive similar phenomenal popularity in Hong Kong, Taiwan, Korea, Malaysia, Singapore, Vietnam, Cambodia, Indonesia and Thailand. However, Season 3 suffered backlash in popularity, partly because most of the original cast had been replaced by different actors and actresses. The majority of the cast decided not to renew their contracts and left the series, which led to a major recasting of characters for the third season. The third season flopped in terms of ratings.", "rate": 90, "genre": ["Drama", "Comedy"], "cast": ["Zhao Wei", "Alec Su", "Ruby Lin", "Fan Bingbing", "Zhang Tielin"], "character": ["Xiaoyanzi", "Yong Qi", "Xia Ziwei", "Jin Suo", "Qian Long"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4285   Expand Pearl Princess   (1998) User Score Overview Princess Pearl, also known in Singapore and the Philippines as My Fair Princess, is a Chinese-language television series adapted from Chiung Yao's novel series of the same title. Produced by Taiwan Pleasant Communications Limited Company and Hunan TV, the series centers around the legend of Princess Huanzhu during the reign of the Qianlong Emperor of the Qing Dynasty. Although some characters, the plot premise, and certain sections of the story are based on historical events and figures, considerable artistic license was employed. Fans may often abbreviate the series' pinyin name of Huánzhū Gégé into \"HZGG\". The series was split into three seasons. The first season was produced in 1997 and broadcast in 1998. The second was broadcast in 1999, and the third in 2003. Princess Pearl enjoyed the highest viewership of any television drama in Chinese history. Seasons 1 and 2 received up to 54% and 65% of audience shares respectively during broadcast, and became the television series with the most reruns broadcast from the 1990s to today. Princess Pearl went on to receive similar phenomenal popularity in Hong Kong, Taiwan, Korea, Malaysia, Singapore, Vietnam, Cambodia, Indonesia and Thailand. However, Season 3 suffered backlash in popularity, partly because most of the original cast had been replaced by different actors and actresses. The majority of the cast decided not to renew their contracts and left the series, which led to a major recasting of characters for the third season. The third season flopped in terms of ratings. Featured Crew Chiung Yao Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhao Wei Xiaoyanzi Alec Su Yong Qi Ruby Lin Xia Ziwei Fan Bingbing Jin Suo Zhang Tielin Qian Long Full Cast & Crew Last Season Season 2 1999 | 48 Episodes Season 2 of Pearl Princess premiered on April 21, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pearl Princess. You can help by rating TV shows you've seen. Facts Original Name  還珠格格 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  40m, 48m Homepage   http://www.hnetv.com/hzgg/index.htm Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors c 25 ctchim H 4 Heleandra 3 Alternativ 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}