{"link": "https://www.themoviedb.org/tv/64350?language=en", "title": "Beautiful Secret", "resume": "20 years ago, singer Wang Xuan spent all her savings trying to treat the illness of her daughter, later called Jiang Mei Li, but to no avail. In the end had to give her up for adoption, while hiding the truth from the world. On her wedding day, she leaves to try and find her daughter once again. Mei Li is adopted by Jiang Wei Guo and his wife but her she has contracted a high fever and suffered amnesia from it. Unable to find her daughter, Wang Xuan decides to put all her love into her step daughter Xu Rou Lin. 20 years later, Ruo Lin enters a singing competition to win back her ex-boyfriends, producer Guan Yi. While coming out to support her sister, Jiang Mei Yan in the same competition, Jiang Mei Li ends up being a competitor. During the course of the competition, complicated relationships between love interests and family occur. When Mei Li becomes an overnight sensation by winning the competition, Producer Guan Yi decides to produce her, and at the dame time they start to have feelings for each other. This drama will depict a stylish entertainment industry.", "rate": 45, "genre": ["Drama"], "cast": ["Victoria Song", "Peter Ho", "Xian Zi", "Wei Qian Xiang"], "character": ["Jiang Mei Li", "Guan Yi", "Xu Ruo Lin", "Chen Wei Feng"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64350   Expand Beautiful Secret   (2015) User Score Overview 20 years ago, singer Wang Xuan spent all her savings trying to treat the illness of her daughter, later called Jiang Mei Li, but to no avail. In the end had to give her up for adoption, while hiding the truth from the world. On her wedding day, she leaves to try and find her daughter once again. Mei Li is adopted by Jiang Wei Guo and his wife but her she has contracted a high fever and suffered amnesia from it. Unable to find her daughter, Wang Xuan decides to put all her love into her step daughter Xu Rou Lin. 20 years later, Ruo Lin enters a singing competition to win back her ex-boyfriends, producer Guan Yi. While coming out to support her sister, Jiang Mei Yan in the same competition, Jiang Mei Li ends up being a competitor. During the course of the competition, complicated relationships between love interests and family occur. When Mei Li becomes an overnight sensation by winning the competition, Producer Guan Yi decides to produce her, and at the dame time they start to have feelings for each other. This drama will depict a stylish entertainment industry. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victoria Song Jiang Mei Li Peter Ho Guan Yi Xian Zi Xu Ruo Lin Wei Qian Xiang Chen Wei Feng Full Cast & Crew Last Season Season 1 2015 | 39 Episodes Season 1 of Beautiful Secret premiered on December 21, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beautiful Secret. You can help by rating TV shows you've seen. Facts Original Name  美丽的秘密 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/5375559526 Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 36 Maria180493 n 10 namsan 8 Elizabeth Jennings z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}