{"link": "https://www.themoviedb.org/tv/3199?language=en", "title": "Paradise Falls", "resume": "Paradise Falls was a weekly soap opera shown nationally on the Showcase channel in Canada, starting in 2001. It is set in a summer cottage community in Central Ontario.\nLike many major US soaps, sex is a dominant part of the storylines. However, it shows much more of this than would be allowed by censors on mainstream broadcast networks. The show's open approach to sexual and homosexual themes caused reruns of the show to be carried on the American Here! channel, which targets gay and lesbian viewers. Like the soap Passions, murder and a little witchcraft are included in the mix of themes.\nUnlike the typical soap opera, the series was shot entirely on location on Sparrow Lake in Muskoka and Whitevale, Ontario, to give the show an authentic looking background. It was produced entirely in digital format, to reduce production costs, and allow for easier editing when adapted for foreign markets. The show's production company is Breakthrough Entertainment.\nThe production schedule has been somewhat unorthodox and unpredictable for viewers. Originally 52 episodes were shot in a batch in 2001, then aired on Showcase. Then, new shows stopped appearing until 2004, leaving many to think the show was cancelled. A new batch of 26 episodes began to be aired in the fall of 2004. The show was recently renewed and shooting began on July 9, 2007 and ended on October 11, 2007. The 26 episodes started airing on April 11, 2008 on Here! and aired from September 2, 2009 on Showcase. The third season seems to be its last.", "rate": 0, "genre": ["Drama"], "cast": ["Kim Poirier", "Chantal Quesnel", "Michelle Latimer", "Art Hindle", "Danielle Hampton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3199   Expand Paradise Falls   (2001) User Score Overview Paradise Falls was a weekly soap opera shown nationally on the Showcase channel in Canada, starting in 2001. It is set in a summer cottage community in Central Ontario. Like many major US soaps, sex is a dominant part of the storylines. However, it shows much more of this than would be allowed by censors on mainstream broadcast networks. The show's open approach to sexual and homosexual themes caused reruns of the show to be carried on the American Here! channel, which targets gay and lesbian viewers. Like the soap Passions, murder and a little witchcraft are included in the mix of themes. Unlike the typical soap opera, the series was shot entirely on location on Sparrow Lake in Muskoka and Whitevale, Ontario, to give the show an authentic looking background. It was produced entirely in digital format, to reduce production costs, and allow for easier editing when adapted for foreign markets. The show's production company is Breakthrough Entertainment. The production schedule has been somewhat unorthodox and unpredictable for viewers. Originally 52 episodes were shot in a batch in 2001, then aired on Showcase. Then, new shows stopped appearing until 2004, leaving many to think the show was cancelled. A new batch of 26 episodes began to be aired in the fall of 2004. The show was recently renewed and shooting began on July 9, 2007 and ended on October 11, 2007. The 26 episodes started airing on April 11, 2008 on Here! and aired from September 2, 2009 on Showcase. The third season seems to be its last. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Poirier Chantal Quesnel Michelle Latimer Art Hindle Danielle Hampton Full Cast & Crew Last Season Season 2 2004 | 26 Episodes Season 2 of Paradise Falls premiered on September 18, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Paradise Falls. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}