{"link": "https://www.themoviedb.org/tv/41140?language=en", "title": "München 7", "resume": "München 7 is a German police drama series from Franz Xaver Bogner. The show is set in Munich, Germany and features the fictive police station \"München 7\" or \"Munich 7\". The main characters are the \"Sheriff from Marienplatz\" Xaver Bartl and his new colleague Felix Kandler.\nMünchen 7 is part of a series of commonly branded shows with similar themes called \"Heiter bis tödlich\".", "rate": 100, "genre": ["Comedy", "Crime"], "cast": ["Andreas Giebel", "Florian Karlheim", "Luise Kinseher", "Winfried Frey", "Julia Koschitz"], "character": ["Polizeihauptmeister Xaver Bartl", "Polizeiobermeister Felix Kandler", "Polizeihauptkommissarin Thekla Eichenseher", "Polizeihauptmeister Hans Kneidl", "Kriminalkommissarin Sandra Holzapfel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41140   Expand München 7   (2004) User Score Overview München 7 is a German police drama series from Franz Xaver Bogner. The show is set in Munich, Germany and features the fictive police station \"München 7\" or \"Munich 7\". The main characters are the \"Sheriff from Marienplatz\" Xaver Bartl and his new colleague Felix Kandler. München 7 is part of a series of commonly branded shows with similar themes called \"Heiter bis tödlich\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andreas Giebel Polizeihauptmeister Xaver Bartl Florian Karlheim Polizeiobermeister Felix Kandler Luise Kinseher Polizeihauptkommissarin Thekla Eichenseher Winfried Frey Polizeihauptmeister Hans Kneidl Julia Koschitz Kriminalkommissarin Sandra Holzapfel Full Cast & Crew Last Season Season 6 2016 | 6 Episodes Season 6 of München 7 premiered on October  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on München 7. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  50m Homepage  - Genres Comedy Crime Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 68 Samara B 8 BeJotEl L 6 Lemmy_6 m 2 manfred.h  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}