{"link": "https://www.themoviedb.org/tv/34691?language=en", "title": "Tytania", "resume": "Tytania is a Japanese novel series written by Yoshiki Tanaka that has not been concluded yet, with the latest volume being released in 1991. It has been adapted into an animated television series directed by Noboru Ishiguro. It premiered on NHK's BS-2 satellite channel on October 9, 2008. The series is a space opera based on a series of three books written by Tanaka between 1988 and 1991 about people who try to liberate the galaxy from the rule of the Tytania-clan and seek refuge with a rebel force.", "rate": 0, "genre": ["Animation"], "cast": ["Kaori Nazuka", "Kenta Miyake", "Katsuyuki Konishi", "Daisuke Kishio", "Takashi Kondō"], "character": ["Lydia", "Ajman Tytania", "Fan Hyulick", "Jouslain Tytania", "Ariabert Tytania"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34691   Expand Tytania   (2008) User Score Overview Tytania is a Japanese novel series written by Yoshiki Tanaka that has not been concluded yet, with the latest volume being released in 1991. It has been adapted into an animated television series directed by Noboru Ishiguro. It premiered on NHK's BS-2 satellite channel on October 9, 2008. The series is a space opera based on a series of three books written by Tanaka between 1988 and 1991 about people who try to liberate the galaxy from the rule of the Tytania-clan and seek refuge with a rebel force. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaori Nazuka Lydia Kenta Miyake Ajman Tytania Katsuyuki Konishi Fan Hyulick Daisuke Kishio Jouslain Tytania Takashi Kondō Ariabert Tytania Full Cast & Crew Last Season Season 1 2008 | 26 Episodes Season 1 of Tytania premiered on October  9, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tytania. You can help by rating TV shows you've seen. Facts Original Name  タイタニア Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 7 sheva_vitali m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}