{"link": "https://www.themoviedb.org/tv/58942?language=en", "title": "The Michael J. Fox Show", "resume": "After being diagnosed with Parkinson's disease, Mike Henry had to give up his career as a news anchor for New York's WNBC and focus on his health and his family. Four years later, Mike decides to get back to work and struggles between family and career.", "rate": 56, "genre": ["Comedy"], "cast": ["Michael J. Fox", "Betsy Brandt", "Juliette Goglia", "Conor Romero", "Jack Gore"], "character": ["Mike Henry", "Annie Henry", "Eve Henry", "Ian Henry", "Graham Henry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58942   Expand The Michael J. Fox Show   (2013) User Score  Play Trailer Overview After being diagnosed with Parkinson's disease, Mike Henry had to give up his career as a news anchor for New York's WNBC and focus on his health and his family. Four years later, Mike decides to get back to work and struggles between family and career. Featured Crew Will Gluck Creator Sam Laybourne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael J. Fox Mike Henry Betsy Brandt Annie Henry Juliette Goglia Eve Henry Conor Romero Ian Henry Jack Gore Graham Henry Full Cast & Crew Last Season Season 1 2013 | 22 Episodes Season 1 of The Michael J. Fox Show premiered on September 26, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2012-02-20 The Bleak Old Shop of Stuff 6.7    2013-09-26 The Crazy Ones 5.8    2013-05-23 Save Me 7.4    2011-09-29 How to Be a Gentleman 5.3    2013-09-17 Dads 4.8    2002-03-19 Andy Richter Controls the Universe 8.3    2015-08-05 Difficult People 7.4    2014-01-23 Rake 5.4  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Comedy Keywords parkinson's disease sitcom tv news anchor Content Score 100 Yes! Looking good! Top Contributors 13 Travis Bell 7 Banana z 4 zurman1 3 FeKuLa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}