{"link": "https://www.themoviedb.org/tv/73146?language=en", "title": "I Am Your King: The Series", "resume": "From the king game in the drunken circle to the drunken circle of friends. With only 1 rule. Whoever holds the King's card can order anyone to do anything he wants. Therefore the gang, New, Matt, Bright, August and Junho will have to get together before Pond leaves for his studies in China. The gang will play the king game. Little did they know that their king will order a life-changing decision that will change their friendship forever...", "rate": 38, "genre": ["Drama"], "cast": ["Kitiwhut Sawutdimilin", "Ruangvivatjarus Phurin"], "character": ["Pound", "Junho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73146   Expand I Am Your King: The Series   (2017) User Score Overview From the king game in the drunken circle to the drunken circle of friends. With only 1 rule. Whoever holds the King's card can order anyone to do anything he wants. Therefore the gang, New, Matt, Bright, August and Junho will have to get together before Pond leaves for his studies in China. The gang will play the king game. Little did they know that their king will order a life-changing decision that will change their friendship forever... Featured Crew Worarit Ninklom Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kitiwhut Sawutdimilin Pound Ruangvivatjarus Phurin Junho Full Cast & Crew Last Season Season 1 2017 | 5 Episodes Season 1 of I Am Your King: The Series premiered on August 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I Am Your King: The Series. You can help by rating TV shows you've seen. Facts Original Name  ผมขอสั่งให้คุณ Status  Returning Series Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Thai Runtime  26m Homepage  - Genres Drama Keywords friendship romance school Content Score 71 Just a little bit more... Top Contributors 28 kbogesz 9 Banana 9 gayso 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}