{"link": "https://www.themoviedb.org/tv/12475?language=en", "title": "Public Eye", "resume": "Public Eye is a British television series that ran from 1965 to 1975. It was produced by ABC Television for three series, and Thames Television for a further four series. The series depicted the investigations and cases handled by the unglamorous enquiry agent Frank Marker, an unmarried loner who is in his early forties when the series begins. In the words of an ABC trailer for the third series: \"Marker isn't a glamorous detective and he doesn't get glamorous cases—he doesn't even get glamorous girls. What he does get is people who are in trouble—the sort of trouble you can't go to the police about, even if you are innocent.\"", "rate": 0, "genre": [], "cast": ["Alfred Burke"], "character": ["Frank Marker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12475   Expand Public Eye   (1965) User Score Overview Public Eye is a British television series that ran from 1965 to 1975. It was produced by ABC Television for three series, and Thames Television for a further four series. The series depicted the investigations and cases handled by the unglamorous enquiry agent Frank Marker, an unmarried loner who is in his early forties when the series begins. In the words of an ABC trailer for the third series: \"Marker isn't a glamorous detective and he doesn't get glamorous cases—he doesn't even get glamorous girls. What he does get is people who are in trouble—the sort of trouble you can't go to the police about, even if you are innocent.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alfred Burke Frank Marker Full Cast & Crew Last Season (uk) season 7 1975 | 13 Episodes Season 7 of Public Eye premiered on January  6, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Public Eye. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}