{"link": "https://www.themoviedb.org/tv/76062?language=en", "title": "Beatless", "resume": "Most of the world's needs are fulfilled by humanoid robots called hIE's. One day, 17-year-old Arato Endo meets the android Lacia and becomes her owner. She is one of five androids with advanced AI. Each of the five units have their own motivations, and fight to gain each other's abilities. What will the relationship between man and machine be moving forward? That is something Arato must find.", "rate": 60, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Ono Saki", "Suyama Emiri", "Yoshinaga Takuto", "Nao Touyama", "Kaito Ishikawa"], "character": ["Endou Yuka (Voice)", "Erika Burroughs (Voice)", "Endou Arato (Voice)", "Lacia (Voice)", "Kaidai Ryou (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76062   Expand Beatless   (2018) User Score  Play Trailer Overview Most of the world's needs are fulfilled by humanoid robots called hIE's. One day, 17-year-old Arato Endo meets the android Lacia and becomes her owner. She is one of five androids with advanced AI. Each of the five units have their own motivations, and fight to gain each other's abilities. What will the relationship between man and machine be moving forward? That is something Arato must find. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ono Saki Endou Yuka (Voice) Suyama Emiri Erika Burroughs (Voice) Yoshinaga Takuto Endou Arato (Voice) Nao Touyama Lacia (Voice) Kaito Ishikawa Kaidai Ryou (Voice) Full Cast & Crew Current Season Season 1 2018 | 24 Episodes Season 1 of Beatless premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Beatless. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  1 Posters  2 Recommendations   2018-01-04 Ms. Koizumi Loves Ramen Noodles 7.7    2018-01-04 Laid-Back Camp 8.4  Facts Original Name  ビートレス Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://beatless-anime.jp Genres Animation Drama Sci-Fi & Fantasy Action & Adventure Keywords based on light novel Content Score 93 Almost there... Top Contributors 30 neonime 13 sp1ti b 13 beachsounddog 8 Resune  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}