{"link": "https://www.themoviedb.org/tv/524?language=en", "title": "The Days and Nights of Molly Dodd", "resume": "The Days and Nights of Molly Dodd is an American comedy-drama series that aired on NBC from 1987 to 1988, and on Lifetime from 1988 to 1991. It was created by Jay Tarses and stars Blair Brown in the title role.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["J. Smith-Cameron", "Richard Lawson", "Victor Garber", "John Pankow", "David Strathairn"], "character": ["Dennis Widmer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 524   Expand The Days and Nights of Molly Dodd   (1987) User Score Overview The Days and Nights of Molly Dodd is an American comedy-drama series that aired on NBC from 1987 to 1988, and on Lifetime from 1988 to 1991. It was created by Jay Tarses and stars Blair Brown in the title role. Featured Crew Jay Tarses Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  2 Top Billed Cast J. Smith-Cameron Richard Lawson Victor Garber Dennis Widmer John Pankow David Strathairn Full Cast & Crew Last Season Season 5 1991 | 13 Episodes Season 5 of The Days and Nights of Molly Dodd premiered on January 19, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Days and Nights of Molly Dodd. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 48m, 24m Homepage  - Genres Drama Comedy Keywords new york dating Content Score 86 Almost there... Top Contributors 7 Banana s 5 speedycars TB 2 TMDb Bot R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}