{"link": "https://www.themoviedb.org/tv/7389?language=en", "title": "Nuremberg", "resume": "Justice Robert H. Jackson leads Allied prosecutors in trying 21 Germans for Nazi war crimes after World War II.", "rate": 76, "genre": ["Drama"], "cast": ["Jill Hennessy", "Alec Baldwin", "Brian Cox", "Christopher Heyerdahl", "Matt Craven"], "character": ["Elsie Douglas", "Supreme Court Justice Robert H. Jackson", "Herman Wilhelm Goering", "Ernst Kaltenbrunner", "Gustave Gilbert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7389   Expand Nuremberg   (2000) User Score Overview Justice Robert H. Jackson leads Allied prosecutors in trying 21 Germans for Nazi war crimes after World War II. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jill Hennessy Elsie Douglas Alec Baldwin Supreme Court Justice Robert H. Jackson Brian Cox Herman Wilhelm Goering Christopher Heyerdahl Ernst Kaltenbrunner Matt Craven Gustave Gilbert Full Cast & Crew Last Season Season 1 2000 | 2 Episodes Season 1 of Nuremberg premiered on July 16, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   Avalon 6.0    1982-09-20 Smiley's People 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords nazi war crimes world war ii miniseries Content Score 93 Almost there... Top Contributors TB 76 TMDb Bot 28 Banana w 3 webmaster 1 Fludogenerator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}