{"link": "https://www.themoviedb.org/tv/58647?language=en", "title": "Dog and Beth: On the Hunt", "resume": "Each week, the Chapmans and their son Leland will fly from their Da Kine Bail Bonds headquarters in Hawaii to various bail bondsmen businesses around the United States as they assist in apprehending criminals. The series will also encompass the group as they improve the bail bondsmen businesses techniques on how to run more efficiently, from the writing of bonds to the tedious task of tracking criminals and technological device training.", "rate": 15, "genre": ["Reality"], "cast": ["Leland Chapman", "Selena Sevy", "Duane 'Dog' Chapman"], "character": ["Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58647   Expand Dog and Beth: On the Hunt   (2013) User Score Overview Each week, the Chapmans and their son Leland will fly from their Da Kine Bail Bonds headquarters in Hawaii to various bail bondsmen businesses around the United States as they assist in apprehending criminals. The series will also encompass the group as they improve the bail bondsmen businesses techniques on how to run more efficiently, from the writing of bonds to the tedious task of tracking criminals and technological device training. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leland Chapman Himself Selena Sevy Herself Duane 'Dog' Chapman Himself Full Cast & Crew Last Season Season 3 2015 | 10 Episodes Season 3 of Dog and Beth: On the Hunt premiered on July 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dog and Beth: On the Hunt. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.cmt.com/dog-and-beth-on-the-hunt/ Genres Reality Keywords bounty hunter Content Score 56 We're so close, yet so far. Top Contributors 32 Elizabeth Jennings 23 Jay Webster TB 8 TMDb Bot z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}