{"link": "https://www.themoviedb.org/tv/1738?language=en", "title": "60 Minutes", "resume": "60 Minutes, an Australian version of the U.S. television newsmagazine 60 Minutes, airs on Sunday nights on the Nine Network and is presented in much the same way as the American program on which it is based. The New Zealand version of the show has also featured segments of the Australian version.\nGerald Stone, the founding executive producer, was given the job by Kerry Packer and was told: \"I don't give a f... what it takes. Just do it and get it right.\" After the first episode was broadcast on 11 February 1979, Packer was less than impressed, telling Stone: \"You've blown it, son. You better fix it fast.\" Over the years, Stone's award winning 60 Minutes revolutionised Australian current affairs reporting and enhanced the careers of Ray Martin, Ian Leslie, George Negus, and later Jana Wendt.\nSince it was first broadcast, 60 Minutes has won five Silver Logies, one Special Achievement Logie, and received nominations for a further six Logie awards.", "rate": 78, "genre": ["News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1738   Expand 60 Minutes   (1979) User Score Overview 60 Minutes, an Australian version of the U.S. television newsmagazine 60 Minutes, airs on Sunday nights on the Nine Network and is presented in much the same way as the American program on which it is based. The New Zealand version of the show has also featured segments of the Australian version. Gerald Stone, the founding executive producer, was given the job by Kerry Packer and was told: \"I don't give a f... what it takes. Just do it and get it right.\" After the first episode was broadcast on 11 February 1979, Packer was less than impressed, telling Stone: \"You've blown it, son. You better fix it fast.\" Over the years, Stone's award winning 60 Minutes revolutionised Australian current affairs reporting and enhanced the careers of Ray Martin, Ian Leslie, George Negus, and later Jana Wendt. Since it was first broadcast, 60 Minutes has won five Silver Logies, one Special Achievement Logie, and received nominations for a further six Logie awards. Featured Crew Don Hewitt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2013 2013 | 41 Episodes Season 2013 of 60 Minutes premiered on January  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1988-01-19 48 Hours 7.3    60 Minutes 7.5    2014-09-14 The Roosevelts: An Intimate History 8.6    1978-06-02 20/20 7.0    The O'Reilly Factor 2.4    1991-09-09 Maury 3.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  46m, 60m Homepage   http://sixtyminutes.ninemsn.com.au/ Genres News Keywords news broadcast magazine show Content Score 64 We're so close, yet so far. Top Contributors 5 Elizabeth Jennings 3 Banana t 2 taci234 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}