{"link": "https://www.themoviedb.org/tv/2034?language=en", "title": "Drive", "resume": "Drive is an American action drama television series set against the backdrop of an illegal cross-country automobile road race, focusing on the willing and unwilling competitors and, as the plot develops, the unseen puppet masters who sponsor the race. Minear has described the show's thematic tone by saying \"a secret, illegal, underground road race can be anything from Cannonball Run to The Game to North by Northwest to Magnolia-on-wheels. Ours is all those things.\"", "rate": 73, "genre": ["Action", "Adventure", "Drama"], "cast": ["Emma Stone", "Riley Smith", "Amy Acker", "Kristin Lehman", "Taryn Manning"], "character": ["Violet Trimble", "Kathryn Tully", "Ivy Chitty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2034   Expand Drive   (2007) User Score Overview Drive is an American action drama television series set against the backdrop of an illegal cross-country automobile road race, focusing on the willing and unwilling competitors and, as the plot develops, the unseen puppet masters who sponsor the race. Minear has described the show's thematic tone by saying \"a secret, illegal, underground road race can be anything from Cannonball Run to The Game to North by Northwest to Magnolia-on-wheels. Ours is all those things.\" Featured Crew Ben Queen Creator Tim Minear Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  15 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emma Stone Violet Trimble Riley Smith Amy Acker Kathryn Tully Kristin Lehman Taryn Manning Ivy Chitty Full Cast & Crew Last Season Season 1 2007 | 6 Episodes Season 1 of Drive premiered on April 13, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Drive. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  15 Posters  3 Recommendations   2006-03-12 Big Love 7.6    2008-01-31 Eli Stone 6.7    2007-02-26 The Black Donnellys 7.4    2015-03-05 Dig 6.4    2011-02-25 Camelot 5.6    2009-06-28 Hung 6.4    2009-03-18 Better Off Ted 7.7    2009-01-18 United States of Tara 7.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Action & Adventure Drama Keywords car automobile racing Content Score 93 Almost there... Top Contributors 13 Elizabeth Jennings 7 Travis Bell 4 GhostKU w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}