{"link": "https://www.themoviedb.org/tv/34823?language=en", "title": "Area 88", "resume": "Area 88 is a Japanese manga series by Kaoru Shintani serialized between 1979 and 1986. The story is about a young pilot named Shin Kazama and his experiences at Area 88, a mercenary air force base secluded in the desert of a war torn country. Shin goes from head of his class at a world renowned aviation school dating the beautiful daughter of an airline president to a mercenary fighter pilot bound to Area 88 by a three-year contract that he was duped into signing by a jealous and competitive childhood friend. Determined to earn $1.5 million to buy his way out of the obligation and return home, killing becomes second nature to Shin as he quickly rises to the top rank at Area 88. Overwrought with shame and self-loathing for what he has become, Shin begins to question whether he is still fighting for survival, or like his fellow mercenaries, for the sheer excitement and camaraderie of battle.\nArea 88 was among the first three manga to be translated into English and published in North America. It has been adapted into a theatrical film, two anime series, the first an OVA originally published in 1985 and the latest, a 12-episode anime television series, which premiered across Japan on the anime television network Animax in 2005, and a video game, released in North America as U.N. Squadron. It is also a brand of model aircraft in Japan. While it appeals to aviation fans for its realistic depictions of aircraft and aerial combat it has also been critically acclaimed for its strong character development and Shintani's poignant storytelling, combining action, tragedy, romance, and comedy. In 1985, the manga received the Shogakukan Manga Award for shōnen.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Shin'ichirou Miki", "Tomokazu Seki", "Takehito Koyasu", "Hikaru Midorikawa", "Sanae Kobayashi"], "character": ["Makoto Shinjou", "Micky Simon", "Shin Kazama", "Satoru Kanzaki", "Kitri Parveneh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34823   Expand Area 88   (2004) User Score Overview Area 88 is a Japanese manga series by Kaoru Shintani serialized between 1979 and 1986. The story is about a young pilot named Shin Kazama and his experiences at Area 88, a mercenary air force base secluded in the desert of a war torn country. Shin goes from head of his class at a world renowned aviation school dating the beautiful daughter of an airline president to a mercenary fighter pilot bound to Area 88 by a three-year contract that he was duped into signing by a jealous and competitive childhood friend. Determined to earn $1.5 million to buy his way out of the obligation and return home, killing becomes second nature to Shin as he quickly rises to the top rank at Area 88. Overwrought with shame and self-loathing for what he has become, Shin begins to question whether he is still fighting for survival, or like his fellow mercenaries, for the sheer excitement and camaraderie of battle. Area 88 was among the first three manga to be translated into English and published in North America. It has been adapted into a theatrical film, two anime series, the first an OVA originally published in 1985 and the latest, a 12-episode anime television series, which premiered across Japan on the anime television network Animax in 2005, and a video game, released in North America as U.N. Squadron. It is also a brand of model aircraft in Japan. While it appeals to aviation fans for its realistic depictions of aircraft and aerial combat it has also been critically acclaimed for its strong character development and Shintani's poignant storytelling, combining action, tragedy, romance, and comedy. In 1985, the manga received the Shogakukan Manga Award for shōnen. Featured Crew Isamu Imagake Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin'ichirou Miki Makoto Shinjou Tomokazu Seki Micky Simon Takehito Koyasu Shin Kazama Hikaru Midorikawa Satoru Kanzaki Sanae Kobayashi Kitri Parveneh Full Cast & Crew Last Season Season 1 2004 | 12 Episodes Season 1 of Area 88 premiered on January  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Area 88. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 Sergiojamon l 3 lenneth78 m 3 magoozin 1 batellium  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}