{"link": "https://www.themoviedb.org/tv/64790?language=en", "title": "For Sarah", "resume": "After his alcohol-fuelled 18th birthday party, Cédric gets into a spectacular car crash as he drives home with his 17-year-old childhood friend, Sarah. That night, the two teens and their parents see their worlds turn upside down. The accident sets both families on a long and tortuous path they didn’t expect.\nThe tragedy forces them all to dig deep inside themselves as they struggle to survive and even grow stronger, through a series of medical, legal and emotional challenges. Their story is rooted in a quest for truth, as they try to come to grips with what really happened on that fateful night, and how these kids are dealing with it.", "rate": 60, "genre": ["Drama"], "cast": ["Félix-Antoine Duval", "Guillaume Gauthier", "Romane Denis", "Hélène Florent", "Sylvain Marcel "], "character": ["Cédric Dutil", "Gégé", "Lola", "Judith Laroche", "Luc Vaillancourt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64790   Expand For Sarah   (2015) User Score Overview After his alcohol-fuelled 18th birthday party, Cédric gets into a spectacular car crash as he drives home with his 17-year-old childhood friend, Sarah. That night, the two teens and their parents see their worlds turn upside down. The accident sets both families on a long and tortuous path they didn’t expect. The tragedy forces them all to dig deep inside themselves as they struggle to survive and even grow stronger, through a series of medical, legal and emotional challenges. Their story is rooted in a quest for truth, as they try to come to grips with what really happened on that fateful night, and how these kids are dealing with it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Félix-Antoine Duval Cédric Dutil Guillaume Gauthier Gégé Romane Denis Lola Hélène Florent Judith Laroche Sylvain Marcel  Luc Vaillancourt Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of For Sarah premiered on September 21, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on For Sarah. You can help by rating TV shows you've seen. Facts Original Name  Pour Sarah Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  60m Homepage   http://poursarah.tva.canoe.ca/ Genres Drama Keywords alcohol quebec hospital car accident teenager teen drama Content Score 86 Almost there... Top Contributors 51 Banana 3 Elizabeth Jennings M 1 MarioCine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}