{"link": "https://www.themoviedb.org/tv/31910?language=en", "title": "Naruto Shippūden", "resume": "Naruto Shippuuden is the continuation of the original animated TV series Naruto.The story revolves around an older and slightly more matured Uzumaki Naruto and his quest to save his friend Uchiha Sasuke from the grips of the snake-like Shinobi, Orochimaru. After 2 and a half years Naruto finally returns to his village of Konoha, and sets about putting his ambitions to work, though it will not be easy, as He has amassed a few (more dangerous) enemies, in the likes of the shinobi organization; Akatsuki.", "rate": 76, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Junko Takeuchi", "Chie Nakamura", "Kazuhiko Inoue", "Akira Ishida", "Hideo Ishikawa"], "character": ["Naruto Uzumaki", "Sakura Haruno", "Kakashi Hatake", "Gaara", "Itachi Uchiha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31910   Expand Naruto Shippūden   (2007) User Score  Play Trailer Overview Naruto Shippuuden is the continuation of the original animated TV series Naruto.The story revolves around an older and slightly more matured Uzumaki Naruto and his quest to save his friend Uchiha Sasuke from the grips of the snake-like Shinobi, Orochimaru. After 2 and a half years Naruto finally returns to his village of Konoha, and sets about putting his ambitions to work, though it will not be easy, as He has amassed a few (more dangerous) enemies, in the likes of the shinobi organization; Akatsuki. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  46 Images Backdrops  35 Posters  28 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Takeuchi Naruto Uzumaki Chie Nakamura Sakura Haruno Kazuhiko Inoue Kakashi Hatake Akira Ishida Gaara Hideo Ishikawa Itachi Uchiha Full Cast & Crew Last Season Season 24 — | 21 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  46 Subject Status Replies Last Reply There are no discussions for Naruto Shippūden. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  35 Posters  28 Recommendations   2002-10-03 Naruto 7.5    2009-10-12 Fairy Tail 7.5    2004-10-05 Bleach 7.5    2017-04-05 Boruto: Naruto Next Generations 7.1    1986-02-26 Dragon Ball 8.1    1999-10-20 One Piece 7.4    2003-11-24 Chrno Crusade 5.7    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3  Facts Original Name  ナルト 疾風伝 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.tv-tokyo.co.jp/anime/naruto/ Genres Animation Comedy Drama Keywords hero fight villain based on comic sequel ninja naruto shippuuden teenager martial arts master martial artist teenage boy teenager fighting adult teenage hero ninjitsu ninja warrior anime Content Score 93 Almost there... Top Contributors 162 boy0815 141 Steinholf t 72 tmdb983464 Z 41 Zypik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}