{"link": "https://www.themoviedb.org/tv/37291?language=en", "title": "Barefoot Around the World", "resume": "\"Wojciech Cejrowski - Barefoot Around the World\", produced for TVP 2 Entertainment Section is the winner of New York Festivals 2008 (Travel & Tourism). A series/recording of Wojciech Cejrowski's travels provides not only standard information on places worth seeing but more importantly it explains symbols, ideas, values and beliefs characteristic for any given country. Wojciech Cejrowski tries to familiarize the viewers with culture of various regions by participating in everyday tasks and rituals, discussions with locals and tasting traditional food. It allows him for an anthropological analysis of the observed phenomena.", "rate": 0, "genre": ["Documentary"], "cast": ["Wojciech Cejrowski"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37291   Expand Barefoot Around the World   (2007) User Score Overview \"Wojciech Cejrowski - Barefoot Around the World\", produced for TVP 2 Entertainment Section is the winner of New York Festivals 2008 (Travel & Tourism). A series/recording of Wojciech Cejrowski's travels provides not only standard information on places worth seeing but more importantly it explains symbols, ideas, values and beliefs characteristic for any given country. Wojciech Cejrowski tries to familiarize the viewers with culture of various regions by participating in everyday tasks and rituals, discussions with locals and tasting traditional food. It allows him for an anthropological analysis of the observed phenomena. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wojciech Cejrowski Himself - Host Full Cast & Crew Last Season Season 4 2007 | 6 Episodes Season 4 of Barefoot Around the World premiered on September  9, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Barefoot Around the World. You can help by rating TV shows you've seen. Facts Original Name  Boso przez świat Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Documentary Keywords travel culture Content Score 56 We're so close, yet so far. Top Contributors 9 Elizabeth Jennings q 1 qmich p 1 piotreklobcio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}