{"link": "https://www.themoviedb.org/tv/46941?language=en", "title": "Lightfields", "resume": "The story follows three families that each lived in Lightfields farmhouse at different time periods (1944, 1975 and 2012) but who are linked by a spine-chilling presence: the ghost of a teenage girl who died in mysterious and tragic circumstances.", "rate": 75, "genre": ["Drama"], "cast": ["Karla Crome", "Dakota Blue Richards", "Sam Hazeldine", "Jill Halfpenny", "Kris Marshall"], "character": ["Clare Mullen", "Eve", "Albert", "Martha Felwood", "Paul Fenner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46941   Expand Lightfields   (2013) User Score Overview The story follows three families that each lived in Lightfields farmhouse at different time periods (1944, 1975 and 2012) but who are linked by a spine-chilling presence: the ghost of a teenage girl who died in mysterious and tragic circumstances. Featured Crew David Schulner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karla Crome Clare Mullen Dakota Blue Richards Eve Sam Hazeldine Albert Jill Halfpenny Martha Felwood Kris Marshall Paul Fenner Full Cast & Crew Last Season Season 1 2013 | 5 Episodes Season 1 of Lightfields premiered on February 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   2004-07-19 The Grid 7.0    2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8    2011-05-02 Case Sensitive 5.4    2011-02-03 Marchlands 7.4    2016-06-08 Power Monkeys 7.0    2011-09-14 Free Agents 4.8    2011-06-06 Injustice 7.3  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Miniseries Original Language  English Runtime  44m Homepage  - Genres Drama Keywords haunted house ghost Content Score 79 Pump it up! We're close now. Top Contributors 19 Banana R 11 RoNain 3 Elizabeth Jennings 2 Nero Kosonen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}