{"link": "https://www.themoviedb.org/tv/67485?language=en", "title": "The Gentlemen of Wolgyesu Tailor Shop", "resume": "Depicts the trials and tribulations of four men who work at Laurel Tree Tailor Shop.", "rate": 58, "genre": ["Drama", "Family", "Comedy"], "cast": ["Lee Dong-gun", "Jo Yoon-hee", "Choi Won-young", "Hyun Woo", "Cha In-pyo"], "character": ["Lee Dong-Jin", "Na Yeon-Sil", "Sung Tae-Pyung", "Kang Tae-Yang", "Bae Sam-Do"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67485   Expand The Gentlemen of Wolgyesu Tailor Shop   (2016) User Score  Play Trailer Overview Depicts the trials and tribulations of four men who work at Laurel Tree Tailor Shop. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Dong-gun Lee Dong-Jin Jo Yoon-hee Na Yeon-Sil Choi Won-young Sung Tae-Pyung Hyun Woo Kang Tae-Yang Cha In-pyo Bae Sam-Do Full Cast & Crew Last Season Season 1 2016 | 54 Episodes Season 1 of The Gentlemen of Wolgyesu Tailor Shop premiered on August 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2016-07-30 Second To Last Love 8.3    2016-08-27 Blow Breeze 6.6    2016-08-12 Cinderella and Four Knights 5.8    2016-08-22 Love O2O 3.7    2016-07-22 Age of Youth 5.1  Facts Original Name  월계수 양복점 신사들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/gentle/index.html Genres Drama Family Comedy Keywords korea Content Score 93 Almost there... Top Contributors M 52 Maria180493 z 10 zurman1 5 andermairena 4 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}