{"link": "https://www.themoviedb.org/tv/4628?language=en", "title": "Auf Wiedersehen, Pet", "resume": "Auf Wiedersehen Pet is a British comedy-drama series about seven British migrant construction workers who leave the UK to search for employment overseas. In the first series, they live and work on a building site in Düsseldorf, Germany. In the second series, they work for a dodgy businessman on a manor in the English countryside, and then his swimming pool at his villa in Spain. In the third series, set fifteen years later, they reunite for a big job on the Middlesbrough transporter bridge which results in them working in Arizona. In the fourth series, they work on a British embassy in Havana, Cuba.\nThe lead roles were performed by Tim Healy, Kevin Whately, Jimmy Nail, Gary Holton, Christopher Fairbank, Pat Roach and Timothy Spall.\nAuf Wiedersehen, Pet was created by Franc Roddam after an idea from Mick Connell came to light. It was mostly written by Dick Clement and Ian La Frenais, who also wrote The Likely Lads, Whatever Happened to the Likely Lads? and Porridge. Stan Hey also contributed writing a number of episodes. The first two series were co-produced by Clement and LaFrenais's Witzend Productions and Central Television and the series were broadcast on ITV in 1983-1984 and 1986. A successful revival of the show saw two series and a Christmas special shown on BBC One in 2002 and 2004.\nThe show was the subject of the first episode of the BBC documentary series Drama Connections.", "rate": 86, "genre": ["Comedy", "Drama"], "cast": ["Tim Healy", "Kevin Whately", "Jimmy Nail", "Christopher Fairbank", "Timothy Spall"], "character": ["Dennis Patterson", "Neville Hope", "Leonard 'Oz' Osborne", "Albert Moxey", "Barry Taylor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4628   Expand Auf Wiedersehen, Pet   (1983) User Score Overview Auf Wiedersehen Pet is a British comedy-drama series about seven British migrant construction workers who leave the UK to search for employment overseas. In the first series, they live and work on a building site in Düsseldorf, Germany. In the second series, they work for a dodgy businessman on a manor in the English countryside, and then his swimming pool at his villa in Spain. In the third series, set fifteen years later, they reunite for a big job on the Middlesbrough transporter bridge which results in them working in Arizona. In the fourth series, they work on a British embassy in Havana, Cuba. The lead roles were performed by Tim Healy, Kevin Whately, Jimmy Nail, Gary Holton, Christopher Fairbank, Pat Roach and Timothy Spall. Auf Wiedersehen, Pet was created by Franc Roddam after an idea from Mick Connell came to light. It was mostly written by Dick Clement and Ian La Frenais, who also wrote The Likely Lads, Whatever Happened to the Likely Lads? and Porridge. Stan Hey also contributed writing a number of episodes. The first two series were co-produced by Clement and LaFrenais's Witzend Productions and Central Television and the series were broadcast on ITV in 1983-1984 and 1986. A successful revival of the show saw two series and a Christmas special shown on BBC One in 2002 and 2004. The show was the subject of the first episode of the BBC documentary series Drama Connections. Featured Crew Franc Roddam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Healy Dennis Patterson Kevin Whately Neville Hope Jimmy Nail Leonard 'Oz' Osborne Christopher Fairbank Albert Moxey Timothy Spall Barry Taylor Full Cast & Crew Last Season Season 5 2004 | 2 Episodes Season 5 of Auf Wiedersehen, Pet premiered on December 28, 2004. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Bomber says... Its still fun to watch after all these years Open 1 by  De Burgh Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1971-04-10 The Two Ronnies 9.0    1976-09-06 George and Mildred 6.6    1973-01-09 Whatever Happened to the Likely Lads? 7.8    1978-02-24 Going Straight 7.3    2002-11-14 Harry Hill's TV Burp 7.2    1964-12-16 The Likely Lads 7.8    1998-11-12 Dinnerladies 6.4    2009-01-03 Total Wipeout 5.3  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Comedy Drama Keywords friendship pornography spain northern england police cuba upper class germany culture clash pub brothel arizona russia embassy ballet dancer beer native american swimming pool serbian jungle landlord working class arsonist desert english countryside falklands gritty unemployment customs manor migrant worker electrician construction worker british intelligence british humour workplace comedy slave labor newcastle upon tyne geordie derelicts Content Score 93 Almost there... Top Contributors O 128 Ozbourne 81 Markxist 37 Elizabeth Jennings 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}