{"link": "https://www.themoviedb.org/tv/2803?language=en", "title": "LateLine", "resume": "LateLine is an American TV sitcom that ran on NBC from March 17, 1998, through March 16, 1999. Due to an abrupt cancellation, there were seven unaired episodes.\nCreated by John Markus and Al Franken, LateLine depicted the behind-the-scenes goings-on of a fictitious late-night television news broadcast, patterned in part after the long-running ABC program Nightline. Many plotlines in the series were satirical, dealing with topics like Deep Throat and the Watergate break-in, and the episodes often had cameos by famous politicians.\nOn August 17, 2004, Paramount released a DVD set containing all nineteen episodes on three discs.", "rate": 0, "genre": ["Comedy"], "cast": ["Al Franken", "Megyn Price", "Miguel Ferrer", "Ajay Naidu", "Sanaa Lathan"], "character": ["Gale Ingersoll", "Briana Gilliam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2803   Expand LateLine   (1998) User Score Overview LateLine is an American TV sitcom that ran on NBC from March 17, 1998, through March 16, 1999. Due to an abrupt cancellation, there were seven unaired episodes. Created by John Markus and Al Franken, LateLine depicted the behind-the-scenes goings-on of a fictitious late-night television news broadcast, patterned in part after the long-running ABC program Nightline. Many plotlines in the series were satirical, dealing with topics like Deep Throat and the Watergate break-in, and the episodes often had cameos by famous politicians. On August 17, 2004, Paramount released a DVD set containing all nineteen episodes on three discs. Featured Crew Al Franken Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Al Franken Megyn Price Gale Ingersoll Miguel Ferrer Ajay Naidu Sanaa Lathan Briana Gilliam Full Cast & Crew Last Season Season 3 1999 | 7 Episodes Season 3 of LateLine premiered on December  4, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on LateLine. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords behind the scenes tv news sitcom Content Score 79 Pump it up! We're close now. Top Contributors 5 Banana C 1 CherryJones RB 1 Rookie B.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}