{"link": "https://www.themoviedb.org/tv/1168?language=en", "title": "The Real Adventures of Jonny Quest", "resume": "The Real Adventures of Jonny Quest is an American animated action-adventure television series produced by Hanna-Barbera and broadcast on Cartoon Network from August 26, 1996 to September 24, 1999. A revival of the 1960s Jonny Quest franchise, it features teenage adventurers Jonny Quest, Hadji Singh, and Jessie Bannon as they accompanied Dr. Benton Quest and bodyguard Race Bannon to investigate strange phenomena, legends, and mysteries in exotic locales. Action also takes place in the virtual realm of QuestWorld, a three-dimensional cyberspace domain rendered with computer animation.\nConceived in the early 1990s, Real Adventures suffered a long and troubled development. Hanna-Barbera dismissed creator Peter Lawrence in 1996 and hired new producers to finish the show. John Eng and Cosmo Anzilotti completed Lawrence's work; David Lipman, Davis Doi, and Larry Houston wrote new episodes with reworked character designs akin to those of classic Quest. Each team produced half of the show's fifty-two episodes. While Lawrence's team crafted stories of real-world mystery and exploration, later writers used science fiction and paranormal plots.\nTurner Entertainment supported the show through a massive marketing campaign with thirty-three licensees. Real Adventures debuted with an unprecedented wide release on Cartoon Network, TBS, and TNT, airing twenty-one times per week. Critics have debated the merits of the show's animation, writing, and spirit compared to classic Quest, but it has also received praise in those categories. Real Adventures failed to gain high ratings with its targeted demographics and its merchandise performed poorly, leading to cancellation after fifty-two episodes. Turner has released eight VHS, two laserdisc, and twenty-six DVD episodes; reruns have appeared on Toonami, CNX, and other Cartoon Network formats.", "rate": 75, "genre": ["Action", "Adventure", "Animation"], "cast": ["J.D. Roth", "John de Lancie", "Quinton Flynn", "Robert Patrick", "George Segal"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1168   Expand The Real Adventures of Jonny Quest   (1996) User Score Overview The Real Adventures of Jonny Quest is an American animated action-adventure television series produced by Hanna-Barbera and broadcast on Cartoon Network from August 26, 1996 to September 24, 1999. A revival of the 1960s Jonny Quest franchise, it features teenage adventurers Jonny Quest, Hadji Singh, and Jessie Bannon as they accompanied Dr. Benton Quest and bodyguard Race Bannon to investigate strange phenomena, legends, and mysteries in exotic locales. Action also takes place in the virtual realm of QuestWorld, a three-dimensional cyberspace domain rendered with computer animation. Conceived in the early 1990s, Real Adventures suffered a long and troubled development. Hanna-Barbera dismissed creator Peter Lawrence in 1996 and hired new producers to finish the show. John Eng and Cosmo Anzilotti completed Lawrence's work; David Lipman, Davis Doi, and Larry Houston wrote new episodes with reworked character designs akin to those of classic Quest. Each team produced half of the show's fifty-two episodes. While Lawrence's team crafted stories of real-world mystery and exploration, later writers used science fiction and paranormal plots. Turner Entertainment supported the show through a massive marketing campaign with thirty-three licensees. Real Adventures debuted with an unprecedented wide release on Cartoon Network, TBS, and TNT, airing twenty-one times per week. Critics have debated the merits of the show's animation, writing, and spirit compared to classic Quest, but it has also received praise in those categories. Real Adventures failed to gain high ratings with its targeted demographics and its merchandise performed poorly, leading to cancellation after fifty-two episodes. Turner has released eight VHS, two laserdisc, and twenty-six DVD episodes; reruns have appeared on Toonami, CNX, and other Cartoon Network formats. Featured Crew Doug Wildey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast J.D. Roth John de Lancie Quinton Flynn Robert Patrick George Segal Full Cast & Crew Last Season Season 2 1996 | 26 Episodes Season 2 of The Real Adventures of Jonny Quest premiered on December 11, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   1999-08-16 Rocket Power 6.4    1969-09-13 Scooby-Doo, Where Are You! 7.5    1991-08-11 Rugrats 7.1    1995-09-09 Pinky and the Brain 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords unusual phenomena jonny quest Content Score 100 Yes! Looking good! Top Contributors 10 Banana TB 1 TMDb Bot e 1 elibiva 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}