{"link": "https://www.themoviedb.org/tv/73921?language=en", "title": "Borg Mom", "resume": "Choi Go-Bong works in the field of artificial intelligence. His wife died 7 years ago after giving birth to their son Choi Yool. Choi Go-Bong then developed a borg mom using AI and robotics. Choi Yool enters a prestigious kindergarten and the borg mom meets the other mothers there. The mothers group is full of vanity and pretentiousness.", "rate": 80, "genre": ["Comedy"], "cast": ["Yang Dong-geun", "Park Han-byul", "Ivy", "Choi Yeo-jin", "Hwang Bo-ra"], "character": ["Choi Go-Bong", "Borg Mom", "Do Do-Hye", "Boo Ti-Na", "Koo Seol Soo Ji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73921   Expand Borg Mom   (2017) User Score Overview Choi Go-Bong works in the field of artificial intelligence. His wife died 7 years ago after giving birth to their son Choi Yool. Choi Go-Bong then developed a borg mom using AI and robotics. Choi Yool enters a prestigious kindergarten and the borg mom meets the other mothers there. The mothers group is full of vanity and pretentiousness. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yang Dong-geun Choi Go-Bong Park Han-byul Borg Mom Ivy Do Do-Hye Choi Yeo-jin Boo Ti-Na Hwang Bo-ra Koo Seol Soo Ji Full Cast & Crew Last Season Season 1 2017 | 22 Episodes Season 1 of Borg Mom premiered on September 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Borg Mom. You can help by rating TV shows you've seen. Facts Original Name  보그맘 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/ent/borgmom/index.html Genres Comedy Keywords robot Content Score 86 Almost there... Top Contributors M 34 Maria180493 7 galactica_j 3 Elizabeth Jennings k 1 kunamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}