{"link": "https://www.themoviedb.org/tv/44840?language=en", "title": "Mob City", "resume": "The true story of a decades-long conflict between the Los Angeles Police Department, under the determined leadership of Police Chief William Parker, and ruthless criminal elements led by Mickey Cohen, a one-time boxer who rose to the top of L.A.'s criminal world. The series is a fast-paced crime drama set in Los Angeles during the 1940s and '50s. It's a world of glamorous movie stars, powerful studio heads, returning war heroes, a powerful and corrupt police force and an even more dangerous criminal network determined to make L.A. its West Coast base.", "rate": 70, "genre": ["Drama"], "cast": ["Jon Bernthal", "Alexa Davalos", "Milo Ventimiglia", "Neal McDonough", "Edward Burns"], "character": ["Joe Teague", "Jasmine", " Ned Stax", "Captain William Parker", "Ben \"Bugsy\" Siegel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44840   Expand Mob City   (2013) User Score  Play Trailer Overview The true story of a decades-long conflict between the Los Angeles Police Department, under the determined leadership of Police Chief William Parker, and ruthless criminal elements led by Mickey Cohen, a one-time boxer who rose to the top of L.A.'s criminal world. The series is a fast-paced crime drama set in Los Angeles during the 1940s and '50s. It's a world of glamorous movie stars, powerful studio heads, returning war heroes, a powerful and corrupt police force and an even more dangerous criminal network determined to make L.A. its West Coast base. Featured Crew Frank Darabont Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Bernthal Joe Teague Alexa Davalos Jasmine Milo Ventimiglia  Ned Stax Neal McDonough Captain William Parker Edward Burns Ben \"Bugsy\" Siegel Full Cast & Crew Last Season Season 1 2013 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  8 Recommendations   2000-04-16 The Corner 7.1    2012-01-22 Real Humans 7.7    2014-08-28 Hand of God 6.8    2009-04-09 Southland 7.8    2011-07-19 The Hour 7.3    2015-03-01 Secrets and Lies 7.1    2012-09-25 Vegas 7.4    2013-03-17 In the Flesh 7.4  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tntdrama.com/series/mob-city/ Genres Drama Keywords police mobster organized crime mafia criminal lapd ex-boxer 1940s Content Score 100 Yes! Looking good! Top Contributors 28 Travis Bell 12 Bendik 9 Banana s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}