{"link": "https://www.themoviedb.org/tv/70748?language=en", "title": "Bonus Family", "resume": "A new couple, their exes and their children navigate the emotional challenges and tricky logistics of blended family life in this Swedish dramedy.", "rate": 85, "genre": ["Drama", "Comedy"], "cast": ["Vera Vitali", "Petra Mede", "Fredrik Hallgren", "Erik Johansson "], "character": ["Lisa", "Katja", "Martin", "Patrik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70748   Expand Bonus Family   (2017) User Score  Play Trailer Overview A new couple, their exes and their children navigate the emotional challenges and tricky logistics of blended family life in this Swedish dramedy. Featured Crew Felix Herngren Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vera Vitali Lisa Petra Mede Katja Fredrik Hallgren Martin Erik Johansson  Patrik Full Cast & Crew Current Season Season 2 2018 | 8 Episodes Season 2 of Bonus Family premiered on January 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2015-09-08 Apaches 7.3    2016-07-05 Fangbone! 6.7    2017-09-20 Tiempos de guerra 7.0    2016-12-08 The Cuba Libre Story 7.7    2017-02-08 Alias J.J. 7.8    2017-09-22 Neo Yokio 5.5    2015-10-14 Call My Agent 8.2  Facts Original Name  Bonusfamiljen Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  - Homepage   http://www.svt.se/bonusfamiljen/ Genres Drama Comedy Keywords blended family Content Score 100 Yes! Looking good! Top Contributors 15 boston 12 Banana 6 borjeto 4 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}