{"link": "https://www.themoviedb.org/tv/62822?language=en", "title": "Humans", "resume": "In a parallel present where the latest must-have gadget for any busy family is a 'Synth' - a highly-developed robotic servant that's so similar to a real human it's transforming the way we live.", "rate": 75, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Gemma Chan", "Emily Berrington", "Colin Morgan", "Ivanno Jeremiah", "Katherine Parkinson"], "character": ["Anita / Mia", "Niska", "Leo Elster", "Max", "Laura Hawkins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62822   Expand Humans   (2015) User Score  Play Trailer Overview In a parallel present where the latest must-have gadget for any busy family is a 'Synth' - a highly-developed robotic servant that's so similar to a real human it's transforming the way we live. Featured Crew Jonathan Brackley Creator Sam Vincent Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  0 Images Backdrops  16 Posters  13 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gemma Chan Anita / Mia Emily Berrington Niska Colin Morgan Leo Elster Ivanno Jeremiah Max Katherine Parkinson Laura Hawkins Full Cast & Crew Current Season Series 3 2018 | 8 Episodes View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply Power surge, nope. Open 0 by MongoLloyd\n      \n     The Synth Who Sleeps Open 2 by  RodimusConvoy Is this an allegory for immigration in the UK? Open 0 by MongoLloyd\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  16 Posters  13 Recommendations   2015-06-01 The Whispers 5.7    2016-01-13 Second Chance 6.5    2015-06-19 Killjoys 6.7    2015-05-14 Wayward Pines 6.5    2015-06-05 Sense8 7.7    2015-06-12 Dark Matter 6.3    2016-01-14 Colony 6.8    2016-07-13 Minority Report 5.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  46m, 42m Homepage   http://www.channel4.com/programmes/humans Genres Drama Mystery Sci-Fi & Fantasy Keywords artificial intelligence technology robot Content Score 100 Yes! Looking good! Top Contributors 311 janar 79 Elizabeth Jennings AK 18 Avshalom Kor 16 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}