{"link": "https://www.themoviedb.org/tv/69309?language=en", "title": "Ransom", "resume": "Eric Beaumont's crisis negotiator team is brought in to save lives and resolve the most difficult kidnap and ransom cases when no one else can.", "rate": 52, "genre": ["Crime", "Drama"], "cast": ["Luke Roberts", "Brandon Jay McLaren", "Nazneen Contractor"], "character": ["Eric Beaumont", "Oliver Yates", "Zara Hallam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69309   Expand Ransom   (2017) User Score  Play Trailer Overview Eric Beaumont's crisis negotiator team is brought in to save lives and resolve the most difficult kidnap and ransom cases when no one else can. Featured Crew David Vainola Creator Frank Spotnitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Roberts Eric Beaumont Brandon Jay McLaren Oliver Yates Nazneen Contractor Zara Hallam Full Cast & Crew Current Season Season 2 2018 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t is it THAT bad? Open 1 by  bgirlmagic Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   2017-10-01 Ten Days in the Valley 6.0    2017-10-15 White Famous 5.9    2017-01-25 Mary Kills People 7.5    2016-04-12 Game of Silence 4.3    2018-03-18 Instinct 5.9    2013-04-03 Rogue 7.1    2016-09-27 Aftermath 6.1    2016-04-11 Hunters 4.9  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   https://www.globaltv.com/ransom/ Genres Crime Drama Keywords hostage situation hostage negotiator Content Score 71 Just a little bit more... Top Contributors 47 Banana p 17 plumpro j 9 jd1048576 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}