{"link": "https://www.themoviedb.org/tv/14426?language=en", "title": "Parlamentet", "resume": "Parlamentet is a satirical panel gameshow on on TV4, which parodies Swedish political debate. It was first broadcast in 1999 and is currently in its 23rd series. The current presenter is Anders S. Nilsson, who has hosted the show since 2004. Current team members include Babben Larsson, Robin Paulsson, Johan Rheborg and Johan Glans. Kodjo Akolor has also been featured. The program is a Swedish version of the short-run British show If I Ruled the World, which itself was as spin-off from Have I Got News For You - both produced by Hat Trick Productions. The comedians are divided into two teams, red and blue, representing traditional political colours. At the end of the show, the audience vote for the winners based on which team was funniest.", "rate": 30, "genre": ["News", "Comedy"], "cast": ["Anders S. Nilsson"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14426   Expand Parlamentet   (1999) User Score Overview Parlamentet is a satirical panel gameshow on on TV4, which parodies Swedish political debate. It was first broadcast in 1999 and is currently in its 23rd series. The current presenter is Anders S. Nilsson, who has hosted the show since 2004. Current team members include Babben Larsson, Robin Paulsson, Johan Rheborg and Johan Glans. Kodjo Akolor has also been featured. The program is a Swedish version of the short-run British show If I Ruled the World, which itself was as spin-off from Have I Got News For You - both produced by Hat Trick Productions. The comedians are divided into two teams, red and blue, representing traditional political colours. At the end of the show, the audience vote for the winners based on which team was funniest. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anders S. Nilsson Host Full Cast & Crew Last Season Season 28 2015 | 8 Episodes Season 28 of Parlamentet premiered on August 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2004-08-30 John Safran vs God 7.3    2002-10-31 Värsta språket 6.0    2016-04-25 After the Thrones 4.6    1987-09-05 På spåret 5.0    2011-01-06 The Reckoning 3.7    2013-11-07 Folkets främsta företrädare 5.0    2001-01-17 Uppdrag granskning 6.8    2015-12-01 1000 Years until Christmas Eve 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  30m, 22m Homepage   http://www.tv4.se/parlamentet Genres News Comedy Keywords talk show political humour Content Score 56 We're so close, yet so far. Top Contributors T 92 Thuresson j 57 jnylen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}