{"link": "https://www.themoviedb.org/tv/1999?language=en", "title": "The Comeback", "resume": "The series initially follows Valerie Cherish (Kudrow), a veteran sitcom actress who has been out of the spotlight for more than a decade, as she attempts in 2005 to return to the industry that made her famous. Valerie lands a role on a new network sitcom, but struggles with the matter of being an aging, non-influential performer in an increasingly-youthful Hollywood, while her every move on and off the set is being documented for a companion reality show.\nWhen the cameras catch up with Valerie in 2014, she is cast in an HBO series entitled Seeing Red, which chronicles the career of the sitcom writer/producer who tormented her nine years earlier.", "rate": 77, "genre": ["Comedy"], "cast": ["Lisa Kudrow", "Lance Barber", "Robert Michael Morris", "Laura Silverman", "Damian Young"], "character": ["Valerie Cherish", "Paulie G.", "Mickey Deane", "Jane", "Mark Berman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1999   Expand The Comeback   (2005) User Score Overview The series initially follows Valerie Cherish (Kudrow), a veteran sitcom actress who has been out of the spotlight for more than a decade, as she attempts in 2005 to return to the industry that made her famous. Valerie lands a role on a new network sitcom, but struggles with the matter of being an aging, non-influential performer in an increasingly-youthful Hollywood, while her every move on and off the set is being documented for a companion reality show. When the cameras catch up with Valerie in 2014, she is cast in an HBO series entitled Seeing Red, which chronicles the career of the sitcom writer/producer who tormented her nine years earlier. Featured Crew Michael Patrick King Creator Lisa Kudrow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Kudrow Valerie Cherish Lance Barber Paulie G. Robert Michael Morris Mickey Deane Laura Silverman Jane Damian Young Mark Berman Full Cast & Crew Last Season Season 2 2014 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2015-09-29 Grandfathered 7.1    2006-03-12 Big Love 7.6    1998-09-29 Felicity 6.5    2011-09-22 Whitney 3.8    2011-10-10 Enlightened 7.1    2018-04-08 Killing Eve 8.7    2011-09-25 Pan Am 5.8  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hbo.com/the-comeback Genres Comedy Keywords comeback mockumentary aging actor career resurrection Content Score 93 Almost there... Top Contributors 43 Elizabeth Jennings b 5 bugfix 3 Zlogorek s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}