{"link": "https://www.themoviedb.org/tv/2055?language=en", "title": "Monkey Dust", "resume": "Monkey Dust is a British satirical cartoon, notorious for its dark humour and handling of taboo topics such as bestiality, murder, suicide and paedophilia. There were three series broadcast on BBC Three between 2003 and 2005. Following co-creator Harry Thompson's death, no further series were made.", "rate": 89, "genre": ["Animation", "Comedy"], "cast": ["Morwenna Banks", "Frances Barber", "Enn Reitel", "Rebecca Front", "Simon Greenall"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2055   Expand Monkey Dust   (2003) User Score Overview Monkey Dust is a British satirical cartoon, notorious for its dark humour and handling of taboo topics such as bestiality, murder, suicide and paedophilia. There were three series broadcast on BBC Three between 2003 and 2005. Following co-creator Harry Thompson's death, no further series were made. Featured Crew Shaun Pye Creator Harry Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morwenna Banks Frances Barber Enn Reitel Rebecca Front Simon Greenall Full Cast & Crew Last Season Season 3 2005 | 6 Episodes Season 3 of Monkey Dust premiered on January  4, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2003-09-19 Peep Show 8.2    2006-02-03 The IT Crowd 8.2    1999-09-24 Spaced 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  29m, 30m Homepage  - Genres Animation Comedy Keywords dark comedy satire british humour Content Score 93 Almost there... Top Contributors O 12 Ozbourne m 3 morrison 1 brasileiro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}