{"link": "https://www.themoviedb.org/tv/42412?language=en", "title": "Heroman", "resume": "Heroman is a manga and anime produced by Bones and created by Marvel's Stan Lee. The manga is published in Monthly Shōnen Gangan and began serialization in September 2009, while the anime series premiered on April 1, 2010, on TV Tokyo and related stations. Stan Lee came up with the series' basic plot, referring to the series and character as \"a new hero for the 21st century\".\nBroadcast of Heroman in the United States is currently being planned by Lee and producer Masahiko Minami.", "rate": 0, "genre": ["Action", "Adventure", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42412   Expand Heroman   (2010) User Score Overview Heroman is a manga and anime produced by Bones and created by Marvel's Stan Lee. The manga is published in Monthly Shōnen Gangan and began serialization in September 2009, while the anime series premiered on April 1, 2010, on TV Tokyo and related stations. Stan Lee came up with the series' basic plot, referring to the series and character as \"a new hero for the 21st century\". Broadcast of Heroman in the United States is currently being planned by Lee and producer Masahiko Minami. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2010 | 26 Episodes Season 1 of Heroman premiered on April  1, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Heroman. You can help by rating TV shows you've seen. Facts Original Name  ヒーローマン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tv-tokyo.co.jp/anime/heroman/ Genres Action & Adventure Animation Keywords based on manga shounen anime Content Score 56 We're so close, yet so far. Top Contributors 13 sp1ti 8 seboseboss 4 Sergiojamon m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}