{"link": "https://www.themoviedb.org/tv/61027?language=en", "title": "The Wedding Scheme", "resume": "A mother of four daughters and the president of a kimchi factory decides to embark on a grand marriage scheme for her children... by having them cohabitate with four eligible bachelors.", "rate": 0, "genre": ["Comedy", "Family", "Romance"], "cast": ["Kang Hye-jung", "Lee Kyu-han", "Lee Min-woo ", "Park Min-ji", "Cha Hwa-yeon"], "character": ["Yoo Gun-hee", "Lee Kang-jae", "Seo Jang-won", "Yoo Min-ji", "So Doo-ryun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61027   Expand The Wedding Scheme   (2012) User Score Overview A mother of four daughters and the president of a kimchi factory decides to embark on a grand marriage scheme for her children... by having them cohabitate with four eligible bachelors.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Hye-jung Yoo Gun-hee Lee Kyu-han Lee Kang-jae Lee Min-woo  Seo Jang-won Park Min-ji Yoo Min-ji Cha Hwa-yeon So Doo-ryun Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of The Wedding Scheme premiered on April  2, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Wedding Scheme. You can help by rating TV shows you've seen. Facts Original Name  결혼의 꼼수 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage  - Genres Comedy Family Romance Keywords korea Content Score 86 Almost there... Top Contributors M 20 Maria180493 N 14 Nightowl.Kr s 3 sheva_vitali R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}