{"link": "https://www.themoviedb.org/tv/1419?language=en", "title": "Castle", "resume": "After a serial killer imitates the plots of his novels, successful mystery novelist Richard \"Rick\" Castle receives permission from the Mayor of New York City to tag along with an NYPD homicide investigation team for research purposes.", "rate": 73, "genre": ["Drama", "Crime"], "cast": ["Nathan Fillion", "Stana Katic", "Susan Sullivan", "Seamus Dever", "Jon Huertas"], "character": ["Richard Castle", "Kate Beckett", "Martha Rodgers", "Kevin Ryan", "Javier Esposito"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1419   Expand Castle   (2009) User Score  Play Trailer Overview After a serial killer imitates the plots of his novels, successful mystery novelist Richard \"Rick\" Castle receives permission from the Mayor of New York City to tag along with an NYPD homicide investigation team for research purposes. Featured Crew Andrew W. Marlowe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  12 Images Backdrops  49 Posters  24 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nathan Fillion Richard Castle Stana Katic Kate Beckett Susan Sullivan Martha Rodgers Seamus Dever Kevin Ryan Jon Huertas Javier Esposito Full Cast & Crew Last Season Season 8 2015 | 22 Episodes View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply w Lanie Parish: Happy Birthday Tamala Jones! Open 0 by wonder2wonder\n      \n     w Alexis: Happy Birthday Molly Quinn! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  49 Posters  24 Recommendations   2008-09-23 The Mentalist 7.3    2005-09-12 Bones 7.0    2007-06-28 Burn Notice 7.3    2009-01-21 Lie to Me 7.4    2009-10-23 White Collar 7.7    2000-10-06 CSI: Crime Scene Investigation 6.7    2007-09-24 Chuck 7.7    2012-09-27 Elementary 7.0  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m Homepage   http://abc.go.com/shows/castle Genres Drama Crime Keywords new york police writer female detective homicide detective criminal consultant male writer Content Score 100 Yes! Looking good! Top Contributors 539 seawolf 179 Marr 🇳🇱 N 110 Nada2007 66 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}