{"link": "https://www.themoviedb.org/tv/62019?language=en", "title": "Uncle", "resume": "Andy is a dissolute out-of work musician who forges an unlikely alliance with his 12-year-old nephew Errol after being morally blackmailed into looking after him by his chaotic sister Sam - all on the day Andy was planning to kill himself. Not a natural with either kids or responsibility, he tries to keep his new charge out of trouble while being knee-deep in it himself.", "rate": 73, "genre": ["Comedy"], "cast": ["Nick Helm", "Elliot Speller-Gillott", "Daisy Haggard"], "character": ["Andy", "Errol", "Sam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62019   Expand Uncle   (2014) User Score Overview Andy is a dissolute out-of work musician who forges an unlikely alliance with his 12-year-old nephew Errol after being morally blackmailed into looking after him by his chaotic sister Sam - all on the day Andy was planning to kill himself. Not a natural with either kids or responsibility, he tries to keep his new charge out of trouble while being knee-deep in it himself. Featured Crew Oliver Refson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Helm Andy Elliot Speller-Gillott Errol Daisy Haggard Sam Full Cast & Crew Last Season Series 3 2017 | 7 Episodes Season 3 of Uncle premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply S3Ep7 Open 0 by CaseyJones\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   1991-01-03 The Mary Whitehouse Experience 8.0    2016-05-09 Upstart Crow 7.4    2011-05-11 Angry Boys 6.5    2013-10-30 Ja'mie: Private School Girl 6.7    2015-04-29 Peter Kay's Car Share 7.5    2016-10-19 HIM 6.2    2014-08-28 Red Oaks 7.6    2006-10-06 Not Going Out 7.8  Facts Status  In Production Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b052ql4f Genres Comedy Keywords uncle nephew relationship sitcom child care british humour Content Score 64 We're so close, yet so far. Top Contributors 28 Elizabeth Jennings 8 Banana d 6 daedalus O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}