{"link": "https://www.themoviedb.org/tv/20043?language=en", "title": "Densha Otoko", "resume": "Densha Otoko is a Japanese television drama that aired on Fuji Television. It is based on the Densha Otoko story, which has also been portrayed in other media.\nThe drama's 11 episodes were aired on Fuji TV from July 7 to September 22, 2005. A two hour long TV special, Densha Otoko Deluxe, aired on September 23, 2006, featured a visit to Tahiti. Pony Canyon released the series on a DVD box set on December 22, 2005. It also aired in Taiwan's Videoland Japan from January 24, 2006, and in Hong Kong's TVB Jade from April 15, 2006.", "rate": 85, "genre": ["Drama", "Comedy"], "cast": ["Atsushi Ito", "Misaki Ito", "Maki Horikita", "Shigenori Yamazaki", "Miho Shiraishi"], "character": ["Densha otoko", "Hermes", "Aoi Yamada", "Shinpei Asano", "Kisuzu Jinkama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20043   Expand Densha Otoko   (2005) User Score Overview Densha Otoko is a Japanese television drama that aired on Fuji Television. It is based on the Densha Otoko story, which has also been portrayed in other media. The drama's 11 episodes were aired on Fuji TV from July 7 to September 22, 2005. A two hour long TV special, Densha Otoko Deluxe, aired on September 23, 2006, featured a visit to Tahiti. Pony Canyon released the series on a DVD box set on December 22, 2005. It also aired in Taiwan's Videoland Japan from January 24, 2006, and in Hong Kong's TVB Jade from April 15, 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atsushi Ito Densha otoko Misaki Ito Hermes Maki Horikita Aoi Yamada Shigenori Yamazaki Shinpei Asano Miho Shiraishi Kisuzu Jinkama Full Cast & Crew Last Season Season 1 2005 | 11 Episodes Season 1 of Densha Otoko premiered on July  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Densha Otoko. You can help by rating TV shows you've seen. Facts Original Name  電車男 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 25 Aka75 6 Sergiojamon NS 5 Norte Serra 3 Neilgle  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}