{"link": "https://www.themoviedb.org/tv/11111?language=en", "title": "Amos 'n' Andy", "resume": "Amos 'n' Andy is a sitcom set in Manhattan's historic black community of Harlem. The show was very popular in the United States from the 1920s through the 1950s on both radio and television. The radio show was written and voiced by two white actors playing a number of different characters: the titular Amos Jones and Andrew Hogg Brown, George Stevens, better known as \"The Kingfish,\" \"Lightnin'\", and many others. The number of characters portrayed by the two performers required not only their own vocal versatility, but compelled them to invent a number of innovative microphone techniques to help convey the illusion of multiple characters in the same space.\nAs the show came to television, black actors took over the overwhelming majority of the roles; white characters were infrequent. Although the television version in particular received some criticism even in its own time, it is notable that apart from a few of the regular characters, most of the characters portrayed are simply ordinary people, and not stereotypes. Even the Harlem neighborhood appears as any other normal American community: there are policemen, cab drivers, stores and shopkeepers, mothers with baby carriages, all going about their business in a perfectly unremarkable manner: they just happen to have black skin. Even \"Amos\" himself is a perfectly acceptable character, and no stereotype. He is a married man and an entrepreneur who owns and operates his own taxi business, the Fresh Air Cab Company. \"Andy\" is arguably more an unfortunate stereotype. He is chronically unemployed and a bit slow-witted. Despite his unemployment, he always seems to have a bit of money at hand, and one or two episodes suggest he has an adequate income from some stock holdings. \"Kingfish\" too is something of a stereotype going in the other direction, a clever, fast-talking huckster, always ready to cheat his friends with some get-rich-quick scheme. In this, though, Andy and the Kingfish are not so much black stereotypes as stock comic characters: they are very much in the mold of Abbott & Costello, with Andy as the naive, trusting Lou, always preyed upon by his unscrupulous friend.", "rate": 67, "genre": ["Comedy"], "cast": ["Alvin Childress", "Spencer Williams", "Tim Moore", "Ernestine Wade", "Amanda Randolph"], "character": ["Amos Jones", "Andrew H. \"Andy\" Brown", "George \"Kingfish\" Stevens", "Sapphire Stevens", "Mamma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11111   Expand Amos 'n' Andy   (1951) User Score Overview Amos 'n' Andy is a sitcom set in Manhattan's historic black community of Harlem. The show was very popular in the United States from the 1920s through the 1950s on both radio and television. The radio show was written and voiced by two white actors playing a number of different characters: the titular Amos Jones and Andrew Hogg Brown, George Stevens, better known as \"The Kingfish,\" \"Lightnin'\", and many others. The number of characters portrayed by the two performers required not only their own vocal versatility, but compelled them to invent a number of innovative microphone techniques to help convey the illusion of multiple characters in the same space. As the show came to television, black actors took over the overwhelming majority of the roles; white characters were infrequent. Although the television version in particular received some criticism even in its own time, it is notable that apart from a few of the regular characters, most of the characters portrayed are simply ordinary people, and not stereotypes. Even the Harlem neighborhood appears as any other normal American community: there are policemen, cab drivers, stores and shopkeepers, mothers with baby carriages, all going about their business in a perfectly unremarkable manner: they just happen to have black skin. Even \"Amos\" himself is a perfectly acceptable character, and no stereotype. He is a married man and an entrepreneur who owns and operates his own taxi business, the Fresh Air Cab Company. \"Andy\" is arguably more an unfortunate stereotype. He is chronically unemployed and a bit slow-witted. Despite his unemployment, he always seems to have a bit of money at hand, and one or two episodes suggest he has an adequate income from some stock holdings. \"Kingfish\" too is something of a stereotype going in the other direction, a clever, fast-talking huckster, always ready to cheat his friends with some get-rich-quick scheme. In this, though, Andy and the Kingfish are not so much black stereotypes as stock comic characters: they are very much in the mold of Abbott & Costello, with Andy as the naive, trusting Lou, always preyed upon by his unscrupulous friend. Featured Crew Charles J. Correll Creator Freeman F. Gosden Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alvin Childress Amos Jones Spencer Williams Andrew H. \"Andy\" Brown Tim Moore George \"Kingfish\" Stevens Ernestine Wade Sapphire Stevens Amanda Randolph Mamma Full Cast & Crew Last Season Season 1 1951 | 57 Episodes Season 1 of Amos 'n' Andy premiered on June 28, 1951. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amos 'n' Andy. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors RW 8 Rich Wannen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}