{"link": "https://www.themoviedb.org/tv/72898?language=en", "title": "Niko and the Sword of Light", "resume": "A plague of shadows has swept across the land, turning innocent creatures into terrible monsters. One champion remains to battle the darkness and return the world to the light: Niko. Armed with his magic sword and guided by a determined Princess, young Niko journeys to the Curse-ed Volcano to face the evil sorcerer Nar Est and free his people from their magic prison.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Andre Robinson", "Kari Wahlgren", "Jim Cummings", "Dee Bradley Baker", "Steve Blum"], "character": ["Niko (voice)", "Lyra (voice)", "Narrator / Mugwhump (voice)", "Flicker / Chompsky / Swamp Kittens (voice)", "Nar Est / Rasper (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72898   Expand Niko and the Sword of Light   (2017) User Score Overview A plague of shadows has swept across the land, turning innocent creatures into terrible monsters. One champion remains to battle the darkness and return the world to the light: Niko. Armed with his magic sword and guided by a determined Princess, young Niko journeys to the Curse-ed Volcano to face the evil sorcerer Nar Est and free his people from their magic prison. Featured Crew Jim Bryson Creator Adam Jeffcoat Creator Bobby Chiu Creator Kei Acedera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andre Robinson Niko (voice) Kari Wahlgren Lyra (voice) Jim Cummings Narrator / Mugwhump (voice) Dee Bradley Baker Flicker / Chompsky / Swamp Kittens (voice) Steve Blum Nar Est / Rasper (voice) Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Niko and the Sword of Light premiered on July 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Niko and the Sword of Light. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  24m Homepage   https://www.amazon.com/dp/B00RSI565Q Genres Animation Action & Adventure Sci-Fi & Fantasy Keywords friendship fantasy saving the world magic child hero honor destiny fighting evil Content Score 100 Yes! Looking good! Top Contributors A 90 Arkanthor 10 Elizabeth Jennings k 5 karina_petrova  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}