{"link": "https://www.themoviedb.org/tv/69087?language=en", "title": "Voice", "resume": "Two detectives teamed up to catch a serial killer who murdered their family. Moo Jin Hyuk's life spiraled out of control after his wife was murdered. He starts to put himself together after he meets Kang Kwon Joo, US-graduated voice-profiler, who lost her police father to the same serial killer. They work together on the 112 (emergency telephone number) call center team.", "rate": 69, "genre": ["Crime"], "cast": ["Lee Jin-wook", "Lee Ha-Na", "Son Eun-seo", "Ahn Se-ha"], "character": ["Do Kang-Woo", "Kang Kwon-Joo", "Park Eun-Soo", "Kwak Dok-Ki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69087   Expand Voice   (2017) User Score Overview Two detectives teamed up to catch a serial killer who murdered their family. Moo Jin Hyuk's life spiraled out of control after his wife was murdered. He starts to put himself together after he meets Kang Kwon Joo, US-graduated voice-profiler, who lost her police father to the same serial killer. They work together on the 112 (emergency telephone number) call center team. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jin-wook Do Kang-Woo Lee Ha-Na Kang Kwon-Joo Son Eun-seo Park Eun-Soo Ahn Se-ha Kwak Dok-Ki Full Cast & Crew Next Season Season 2 2018 | 2 Episodes Season 2 of Voice is set to premiere on August 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2017-10-11 Mad Dog 8.0    2017-11-11 Money Flower 8.0    2017-10-09 Witch's Court 9.3    2017-01-16 Introverted Boss 8.7    2017-03-25 Tunnel 6.6    2017-09-27 While You Were Sleeping 9.0    2017-03-15 Radiant Office 6.9    2017-01-25 Chief Kim 7.5  Facts Original Name  보이스 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/ocn/voice/ Genres Crime Keywords detective thriller korea Content Score 86 Almost there... Top Contributors M 56 Maria180493 z 15 zurman1 8 oyu 5 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}