{"link": "https://www.themoviedb.org/tv/61596?language=en", "title": "Drifters", "resume": "Comedy series about three young women living in Leeds who've graduated, had a year out, and are now struggling to find a job they're passionate about, a place to live that is half decent and a boyfriend they actually like. A sitcom about making terrible decisions, but having a brilliant time doing it.\nThe show focuses on Meg, her eccentric cousin Bunny and their friend Laura as they discover that life might just be a bit tougher than they had imagined. From demeaning Promotions jobs complete with mad outfits to pursuing the men of their dreams - yet dating the men of their nightmares - the girls face '#FML-worthy' disasters in both their work and personal lives.", "rate": 60, "genre": ["Comedy"], "cast": ["Jessica Knappett", "Lydia Rose Bewley", "Lauren O'Rourke", "Philip McGinley"], "character": ["Meg", "Bunny", "Laura", "Mark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61596   Expand Drifters   (2013) User Score  Play Trailer Overview Comedy series about three young women living in Leeds who've graduated, had a year out, and are now struggling to find a job they're passionate about, a place to live that is half decent and a boyfriend they actually like. A sitcom about making terrible decisions, but having a brilliant time doing it. The show focuses on Meg, her eccentric cousin Bunny and their friend Laura as they discover that life might just be a bit tougher than they had imagined. From demeaning Promotions jobs complete with mad outfits to pursuing the men of their dreams - yet dating the men of their nightmares - the girls face '#FML-worthy' disasters in both their work and personal lives. Featured Crew Jessica Knappett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Knappett Meg Lydia Rose Bewley Bunny Lauren O'Rourke Laura Philip McGinley Mark Full Cast & Crew Last Season Series 4 2016 | 5 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Drifters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.channel4.com/programmes/drifters Genres Comedy Keywords northern england roommate female friendship yorkshire sitcom young adult british humour british sitcom Content Score 100 Yes! Looking good! Top Contributors 26 CouchTater 10 Banana 8 Elizabeth Jennings O 7 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}