{"link": "https://www.themoviedb.org/tv/62299?language=en", "title": "Shine or Go Crazy", "resume": "Wang So is the Prince of Goryeo who has a cursed fate. He had to get married with the Last Princess of Balhae, Shin Yool. She was born with the fate of becoming the light for another country. But because of this fate, she has to face death. Through their marriage life, Wang So and Shin Yool begin to grow closer and love each other.", "rate": 70, "genre": ["Fantasy", "History", "Romance"], "cast": ["Jang Hyuk", "Oh Yeon-Seo", "Lee Ha-nui", "Lim Ju-hwan", "Lee Deok-hwa "], "character": ["Wang So", "Shin Yool", "Hwangbo Yeo-won", "Wang Uk", "Wang Sik-ryeom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62299   Expand Shine or Go Crazy   (2015) User Score Overview Wang So is the Prince of Goryeo who has a cursed fate. He had to get married with the Last Princess of Balhae, Shin Yool. She was born with the fate of becoming the light for another country. But because of this fate, she has to face death. Through their marriage life, Wang So and Shin Yool begin to grow closer and love each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Hyuk Wang So Oh Yeon-Seo Shin Yool Lee Ha-nui Hwangbo Yeo-won Lim Ju-hwan Wang Uk Lee Deok-hwa  Wang Sik-ryeom Full Cast & Crew Last Season Season 1 2015 | 24 Episodes Season 1 of Shine or Go Crazy premiered on January 19, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   2015-10-07 The Village: Achiara's Secret 7.9    2011-06-29 Heartstrings 7.0  Facts Original Name  빛나거나 미치거나 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/soc/ Genres Fantasy History Romance Keywords korea Content Score 86 Almost there... Top Contributors 27 Elizabeth Jennings M 23 Maria180493 5 Charles z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}