{"link": "https://www.themoviedb.org/tv/72313?language=en", "title": "Sick Note", "resume": "When Daniel Glass is misdiagnosed with a fatal disease he begins to notice how everyone around him treats him better. But then he finds out he was misdiagnosed by the most incompetent oncologist on Earth and now he has a big decision to make: come clean and go back to his old rubbish life, or keep pretending to be ill.", "rate": 60, "genre": ["Comedy"], "cast": ["Rupert Grint", "Nick Frost", "Don Johnson"], "character": ["Daniel Glass", "Dr Ian Glennis", "Kenny West"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72313   Expand Sick Note   (2017) User Score  Play Trailer Overview When Daniel Glass is misdiagnosed with a fatal disease he begins to notice how everyone around him treats him better. But then he finds out he was misdiagnosed by the most incompetent oncologist on Earth and now he has a big decision to make: come clean and go back to his old rubbish life, or keep pretending to be ill. Featured Crew James Serafinowicz Creator Nat Saunders Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rupert Grint Daniel Glass Nick Frost Dr Ian Glennis Don Johnson Kenny West Full Cast & Crew Current Season Season 1 2017 | 6 Episodes Season 1 of Sick Note premiered on November  7, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Can't wait! Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sick Note. You can help by rating TV shows you've seen. Facts Status  In Production Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   https://www.sky.com/watch/title/series/sick-note Genres Comedy Keywords terminal illness british humour Content Score 71 Just a little bit more... Top Contributors 34 Elizabeth Jennings a 3 atom100 J 3 Jmart93 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}