{"link": "https://www.themoviedb.org/tv/47224?language=en", "title": "Jekyll and Hyde", "resume": "Inspired by the original novella by Robert Louis Stevenson, Jekyll and Hyde is set in 1930s London and follows Robert Jekyll, the grandson of Henry Jekyll, on his quest to discover his real identity, his true family history and the nature of his ‘curse’ – which his foster father, Dr Vishal Najaran, is controlling with medication. His journey takes him into a dark and unforgiving place, as his alter ego seems capable of anything. At the same time there are shadowy forces trying to find Jekyll and the source of his powers.", "rate": 46, "genre": ["Action", "Adventure", "Drama", "Fantasy"], "cast": ["Tom Bateman", "Christian McKay", "Donald Sumpter", "Stephanie Hyam", "Natalie Gumede"], "character": ["Robert Jekyll / Hyde", "Maxwell Utterson", "Garson", "Lily Clarke", "Bella"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47224   Expand Jekyll and Hyde   (2015) User Score Overview Inspired by the original novella by Robert Louis Stevenson, Jekyll and Hyde is set in 1930s London and follows Robert Jekyll, the grandson of Henry Jekyll, on his quest to discover his real identity, his true family history and the nature of his ‘curse’ – which his foster father, Dr Vishal Najaran, is controlling with medication. His journey takes him into a dark and unforgiving place, as his alter ego seems capable of anything. At the same time there are shadowy forces trying to find Jekyll and the source of his powers. Featured Crew Charlie Higson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Bateman Robert Jekyll / Hyde Christian McKay Maxwell Utterson Donald Sumpter Garson Stephanie Hyam Lily Clarke Natalie Gumede Bella Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Jekyll and Hyde premiered on October 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2006-01-19 Hotel Babylon 6.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://www.itv.com/itvplayer/jekyll-and-hyde Genres Action Adventure Drama Fantasy Keywords london england double life transformation role reversal curse maniac split personality Content Score 93 Almost there... Top Contributors 72 Elizabeth Jennings 10 Banana RS 3 Regarder Series Online 3 kamwatka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}