{"link": "https://www.themoviedb.org/tv/15969?language=en", "title": "הפיג'מות", "resume": "HaPijamot is a sitcom on Israeli television about a struggling band determined to make it in the real world. The show runs on Arutz HaYeladim and Channel 2.", "rate": 100, "genre": ["Comedy"], "cast": ["Ilan Rosenfeld", "Kobi Faraj", "Oded Paz", "Yaniv Polishuk", "Yamit Sol"], "character": ["Ilan Rosenfeld", "Kobi Faraj", "Oded Paz", "Gershon 'Geri' Mandelbaum", "Yamit Sol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15969   Expand הפיג'מות   (2003) User Score Overview HaPijamot is a sitcom on Israeli television about a struggling band determined to make it in the real world. The show runs on Arutz HaYeladim and Channel 2. Featured Crew Arik Zilberman Creator Ruby Duenyas Creator Yoav Tzafir Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  18 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ilan Rosenfeld Ilan Rosenfeld Kobi Faraj Kobi Faraj Oded Paz Oded Paz Yaniv Polishuk Gershon 'Geri' Mandelbaum Yamit Sol Yamit Sol Full Cast & Crew Last Season Season 9 2015 | 25 Episodes Season 9 of הפיג'מות premiered on January  4, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Alona: Happy Birthday Alona Tal! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  18 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on הפיג'מות. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Hebrew Runtime  25m Homepage   http://www.kidstv.co.il/show/11356 Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors a 76 adambakir92 m 2 mikey641  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}