{"link": "https://www.themoviedb.org/tv/40360?language=en", "title": "Ben Hur", "resume": "Ben Hur is a TV miniseries that first aired in 2010. Based on Lew Wallace's1880 novel, Ben-Hur: A Tale of the Christ, the series was produced by Alchemy Television Group in association with Drimtim Entertainment and Muse Entertainment in Montreal. It aired on Canada's CBC network on April 4, 2010, and aired later in 2010 on ABC in the United States.\nBen-Hur was directed by Steve Shill, and stars Kristin Kreuk, Ray Winstone, Art Malik, Hugh Bonneville and Joseph Morgan as Judah Ben-Hur. The film was written by Alan Sharp.", "rate": 67, "genre": ["Drama"], "cast": ["Joseph Morgan", "Stephen Campbell Moore", "Kristin Kreuk", "Emily VanCamp", "Alex Kingston"], "character": ["Judah Ben-Hur", "Messala", "Tirzah", "Esther", "Ruth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40360   Expand Ben Hur   (2010) User Score  Play Trailer Overview Ben Hur is a TV miniseries that first aired in 2010. Based on Lew Wallace's1880 novel, Ben-Hur: A Tale of the Christ, the series was produced by Alchemy Television Group in association with Drimtim Entertainment and Muse Entertainment in Montreal. It aired on Canada's CBC network on April 4, 2010, and aired later in 2010 on ABC in the United States. Ben-Hur was directed by Steve Shill, and stars Kristin Kreuk, Ray Winstone, Art Malik, Hugh Bonneville and Joseph Morgan as Judah Ben-Hur. The film was written by Alan Sharp. Featured Crew Lew Wallace Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joseph Morgan Judah Ben-Hur Stephen Campbell Moore Messala Kristin Kreuk Tirzah Emily VanCamp Esther Alex Kingston Ruth Full Cast & Crew Last Season Season 1 2010 | 2 Episodes Season 1 of Ben Hur premiered on April  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  10 Recommendations   2006-04-14 Merlin's Apprentice 0.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords jerusalem religion miniseries historical fiction Content Score 100 Yes! Looking good! Top Contributors TB 85 TMDb Bot 19 Banana LH 7 Lars Haaber Pedersen i 4 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}