{"link": "https://www.themoviedb.org/tv/62070?language=en", "title": "Ghost in the Shell: Arise Alternative Architecture", "resume": "The story follows Motoko Kusanagi, a highly skilled member of the  military, whom upon meeting Daisuke Aramaki, a current chief of the  Public Security Section 9, in less than desirable conditions struggles  to clear her name whilst forming her own independent team with the  highest priority under the sponsorship and guidance of the chief Aramaki  himself.  Ghost in the Shell: Arise is a re-imagining of Masamune Shirow's Ghost in the Shell.", "rate": 73, "genre": ["Animation", "Crime"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62070   Expand Ghost in the Shell: Arise Alternative Architecture   (2015) User Score Overview The story follows Motoko Kusanagi, a highly skilled member of the  military, whom upon meeting Daisuke Aramaki, a current chief of the  Public Security Section 9, in less than desirable conditions struggles  to clear her name whilst forming her own independent team with the  highest priority under the sponsorship and guidance of the chief Aramaki  himself.  Ghost in the Shell: Arise is a re-imagining of Masamune Shirow's Ghost in the Shell. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Ghost in the Shell: Arise Alternative Architecture 2015 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Ghost in the Shell: Arise Alternative Architecture. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2015-03-02 Acquitted 7.0    2007-04-03 Claymore 7.1    2013-06-22 Ghost in the Shell: Arise 7.1    2009-10-14 Iris 8.0    2011-10-09 The Future Diary 6.8    2005-01-21 American Dragon: Jake Long 5.9    2004-04-06 Monster 7.7    2012-01-10 Another 7.2  Facts Original Name  攻殻機動隊 Arise Alternative Architecture Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://kokaku-a.jp/tv/index.html Genres Animation Crime Keywords science fiction cyberpunk Content Score 64 We're so close, yet so far. Top Contributors 24 Erwin D. Glockner t 9 tmdb983464 8 SniperSL 6 BarkingBaphomet  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}