{"link": "https://www.themoviedb.org/tv/5646?language=en", "title": "Ultraman Mebius", "resume": "Ultraman Mebius is a Japanese television series produced by Tsuburaya Productions and Chubu-Nippon Broadcasting. It is the 17th TV series and 40th anniversary production in the Ultra Series, which first began in 1966. It premiered on the Tokyo Broadcasting System on April 8, 2006. Unlike the two prior entries, Ultraman Nexus and Ultraman Max, Mebius was moved from Saturday mornings to Saturday evenings at 05:30. \"Mebius\" is the Japanese approximation of Möbius; the Möbius strip is a recurring motif in the series and the show going to air in Korea in April 2012.\nThe series opens with the introduction of the rookie Ultraman Mebius, who is sent to Earth by the Father of Ultra. The series is set 40 years after the shows of Ultraman, and makes many references from Ultra Q through to Ultraman 80.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Minoru Tanaka", "Shunji Igarashi", "Masaki Nishina", "Ai Saikawa", "Watanabe Daisuke"], "character": ["Shingo Sakomizu", "Mirai Hibino", "Ryu Aihara", "Marina Kazama", "George Ikaruga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5646   Expand Ultraman Mebius   (2006) User Score Overview Ultraman Mebius is a Japanese television series produced by Tsuburaya Productions and Chubu-Nippon Broadcasting. It is the 17th TV series and 40th anniversary production in the Ultra Series, which first began in 1966. It premiered on the Tokyo Broadcasting System on April 8, 2006. Unlike the two prior entries, Ultraman Nexus and Ultraman Max, Mebius was moved from Saturday mornings to Saturday evenings at 05:30. \"Mebius\" is the Japanese approximation of Möbius; the Möbius strip is a recurring motif in the series and the show going to air in Korea in April 2012. The series opens with the introduction of the rookie Ultraman Mebius, who is sent to Earth by the Father of Ultra. The series is set 40 years after the shows of Ultraman, and makes many references from Ultra Q through to Ultraman 80. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minoru Tanaka Shingo Sakomizu Shunji Igarashi Mirai Hibino Masaki Nishina Ryu Aihara Ai Saikawa Marina Kazama Watanabe Daisuke George Ikaruga Full Cast & Crew Last Season Season 1 — | 50 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ultraman Mebius. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hicbc.com/tv/mebius Genres Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}