{"link": "https://www.themoviedb.org/tv/4409?language=en", "title": "Pride and Prejudice", "resume": "The arrival of a young, well-off, eligible man named Mr. Bingley sends the Bennet household--with five girls of a marrying age--into a tizzy. But it's the introduction of Mr. Bingley's friend, Mr. Darcy, that sets in motion the fate of Elizabeth Bennet, resolved only after a labyrinth of social and personal complexities.", "rate": 69, "genre": ["Drama"], "cast": ["Elizabeth Garvie", "David Rintoul", "Moray Watson", "Judy Parfitt", "Clare Higgins"], "character": ["Elizabeth Bennet", "Mr. Darcy", "Mr. Bennet", "Lady Catherine de Bourgh", "Kitty Bennet"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4409   Expand Pride and Prejudice   (1980) User Score Overview The arrival of a young, well-off, eligible man named Mr. Bingley sends the Bennet household--with five girls of a marrying age--into a tizzy. But it's the introduction of Mr. Bingley's friend, Mr. Darcy, that sets in motion the fate of Elizabeth Bennet, resolved only after a labyrinth of social and personal complexities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth Garvie Elizabeth Bennet David Rintoul Mr. Darcy Moray Watson Mr. Bennet Judy Parfitt Lady Catherine de Bourgh Clare Higgins Kitty Bennet Full Cast & Crew Last Season Miniseries 1980 | 5 Episodes Season 1 of Pride and Prejudice premiered on January 12, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Go to your favorite version and talk about it. Open 0 by lantzn\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2012-09-25 The Paradise 6.8    2009-10-04 Emma 7.7    2008-01-01 Sense and Sensibility 7.7    2004-11-14 North & South 8.2    1995-09-24 Pride and Prejudice 8.1    1999-09-25 Freaks and Geeks 8.2    2004-10-18 Battlestar Galactica 8.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage  - Genres Drama Keywords based on novel or book miniseries Content Score 86 Almost there... Top Contributors R 13 Rebecca TB 10 TMDb Bot w 3 webmaster 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}