{"link": "https://www.themoviedb.org/tv/10360?language=en", "title": "The New Avengers", "resume": "The New Avengers is a British secret agent fantasy adventure television series produced during 1976 and 1977. It is a sequel to the 1960s series, The Avengers and was developed by original series producers Albert Fennell and Brian Clemens.\nThe series was produced by The Avengers Enterprises Ltd for the ITV network, cost £125,000 per episode to produce at Pinewood Studios in England and was seen in 120 countries.\nA joint United Kingdom-France-Canada production, the series picks up the adventures of John Steed as he and his team of \"Avengers\" fight evil plots and world domination. Whereas in the original series Steed had almost always been partnered with a woman, in the new series he had two partners: Mike Gambit, a top agent, crack marksman and trained martial artist, and Purdey, a former trainee with The Royal Ballet who was an amalgam of many of the best talents from Steed's female partners in The Avengers.", "rate": 76, "genre": ["Drama", "Action", "Adventure"], "cast": ["Patrick Macnee", "Gareth Hunt", "Joanna Lumley"], "character": ["Purdey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10360   Expand The New Avengers   (1976) User Score  Play Trailer Overview The New Avengers is a British secret agent fantasy adventure television series produced during 1976 and 1977. It is a sequel to the 1960s series, The Avengers and was developed by original series producers Albert Fennell and Brian Clemens. The series was produced by The Avengers Enterprises Ltd for the ITV network, cost £125,000 per episode to produce at Pinewood Studios in England and was seen in 120 countries. A joint United Kingdom-France-Canada production, the series picks up the adventures of John Steed as he and his team of \"Avengers\" fight evil plots and world domination. Whereas in the original series Steed had almost always been partnered with a woman, in the new series he had two partners: Mike Gambit, a top agent, crack marksman and trained martial artist, and Purdey, a former trainee with The Royal Ballet who was an amalgam of many of the best talents from Steed's female partners in The Avengers. Featured Crew Brian Clemens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Macnee Gareth Hunt Joanna Lumley Purdey Full Cast & Crew Last Season Season 2 1977 | 13 Episodes Season 2 of The New Avengers premiered on September  9, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  5 Recommendations   1982-09-26 Matt Houston 6.6    1973-09-25 Police Story 6.4    1980-01-27 Tenspeed and Brown Shoe 7.7    1978-11-10 Butterflies 6.9    1962-10-04 The Saint 7.2    1991-01-13 Harry and the Hendersons 4.9    1973-10-24 Kojak 7.4    1971-01-05 Alias Smith and Jones 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Action & Adventure Keywords spy british Content Score 71 Just a little bit more... Top Contributors 4 luftikus009 4 go2x 3 Steve d 2 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}