{"link": "https://www.themoviedb.org/tv/14693?language=en", "title": "The Pink Panther", "resume": "The Pink Panther is a 1993 animated television series. It was credited as a co-production of Metro-Goldwyn-Mayer Animation, Mirisch-Geoffrey DePatie-Freleng and United Artists and distributed by Claster Television. This is the only The Pink Panther in the TV series not to distributed by MGM Television, though MGM still owns The Pink Panther.", "rate": 65, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14693   Expand The Pink Panther   (1993) User Score Overview The Pink Panther is a 1993 animated television series. It was credited as a co-production of Metro-Goldwyn-Mayer Animation, Mirisch-Geoffrey DePatie-Freleng and United Artists and distributed by Claster Television. This is the only The Pink Panther in the TV series not to distributed by MGM Television, though MGM still owns The Pink Panther. Featured Crew Blake Edwards Creator Walter Mirisch Creator David H. DePatie Creator Friz Freleng Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1994 | 1 Episode Season 3 of The Pink Panther premiered on August  9, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   Free Willy 4.0    1995-12-09 Ace Ventura Pet Detective: The Series 5.0    1992-10-23 The World of Peter Rabbit and Friends 6.7    1991-09-14 Back To The Future: The Animated Series 4.0    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    1997-09-01 Extreme Ghostbusters 6.0    2002-09-07 Baby Looney Tunes 5.5    1997-10-11 Men in Black: The Series 6.3  Facts Status  Ended Networks Broadcast Syndication Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 11 TheOneManBoxOffice a 5 adltata z 5 zurman1 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}