{"link": "https://www.themoviedb.org/tv/549?language=en", "title": "Law & Order", "resume": "Law & Order is an American police procedural and legal drama television series, created by Dick Wolf and part of the Law & Order franchise. It originally aired on NBC and, in syndication, on various cable networks. Law & Order premiered on September 13, 1990, and completed its 20th and final season on May 24, 2010. At the time of its cancellation, Law & Order was the longest-running crime drama on American primetime television. After The Simpsons, both Law & Order and Gunsmoke tied for the second longest-running scripted American primetime series with ongoing characters.", "rate": 74, "genre": ["Drama"], "cast": ["Jeremy Sisto", "Linus Roache", "Anthony Anderson", "Alana de la Garza", "S. Epatha Merkerson"], "character": ["Cyrus Lupo", "Michael Cutter", "Kevin Bernard", "Connie Rubirosa", "Anita Van Buren"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 549   Expand Law & Order   (1990) User Score Overview Law & Order is an American police procedural and legal drama television series, created by Dick Wolf and part of the Law & Order franchise. It originally aired on NBC and, in syndication, on various cable networks. Law & Order premiered on September 13, 1990, and completed its 20th and final season on May 24, 2010. At the time of its cancellation, Law & Order was the longest-running crime drama on American primetime television. After The Simpsons, both Law & Order and Gunsmoke tied for the second longest-running scripted American primetime series with ongoing characters. Featured Crew Dick Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  55 Images Backdrops  6 Posters  22 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Sisto Cyrus Lupo Linus Roache Michael Cutter Anthony Anderson Kevin Bernard Alana de la Garza Connie Rubirosa S. Epatha Merkerson Anita Van Buren Full Cast & Crew Last Season Season 20 2009 | 23 Episodes View All Seasons Social Reviews  0 Discussions  60 Subject Status Replies Last Reply R This show is so stupid Open 0 by Rickers\n      \n     Spousal Privilege Open 1 by  Costumers Why Did Schiff And Branch Leave Office? Open 0 by Jetfire59\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  22 Recommendations   2001-09-30 Law & Order: Criminal Intent 7.1    2000-10-06 CSI: Crime Scene Investigation 6.7    1993-09-21 NYPD Blue 6.5    1999-09-20 Law & Order: Special Victims Unit 6.2    2002-09-23 CSI: Miami 5.8    2002-09-26 Without a Trace 6.8    2004-09-21 CSI: NY 6.7    2003-09-28 Cold Case 7.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.nbc.com/law-order Genres Drama Keywords new york police law lawyer law and order homicide detective crime investigation criminal law Content Score 93 Almost there... Top Contributors 270 lineker r 40 rick555 30 waaw m 22 mode2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}