{"link": "https://www.themoviedb.org/tv/78479?language=en", "title": "Layton Mystery Detective Agency: Kat's Mystery‑Solving Files", "resume": "Based on Level 5's Layton's Mystery Journey: Katrielle and the Millionaires' Conspiracy game.\n\nThe story is set in London and follows Katrielle as she solves mysteries with her talking dog Sherl.", "rate": 80, "genre": ["Animation", "Comedy", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78479   Expand Layton Mystery Detective Agency: Kat's Mystery‑Solving Files   (2018) User Score Overview Based on Level 5's Layton's Mystery Journey: Katrielle and the Millionaires' Conspiracy game. The story is set in London and follows Katrielle as she solves mysteries with her talking dog Sherl. Featured Crew Level-5 Creator Akihiro Hino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 11 Episodes Season 1 of Layton Mystery Detective Agency: Kat's Mystery‑Solving Files premiered on April  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Layton Mystery Detective Agency: Kat's Mystery‑Solving Files. You can help by rating TV shows you've seen. Facts Original Name  レイトン ミステリー探偵社 ～カトリーのナゾトキファイル～ Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   https://www.layton-anime.jp/ Genres Animation Comedy Mystery Keywords detective game Content Score 64 We're so close, yet so far. Top Contributors 13 neonime 11 seboseboss 8 sp1ti 5 Terence Haejin Lee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}