{"link": "https://www.themoviedb.org/tv/6137?language=en", "title": "The Courtship of Eddie's Father", "resume": "The Courtship of Eddie's Father is an American television sitcom based on the 1963 movie of the same name, which was based on the book written by Mark Toby. It tells the story of a widower, Tom Corbett, who is a magazine publisher, and his son, Eddie, who believes his father should marry, and manipulates situations surrounding the women his father is interested in. ABC had acquired the rights to the story; the series debuted on September 17, 1969, and was last broadcast on March 1, 1972.\nBixby received an Emmy nomination for the show.", "rate": 62, "genre": ["Comedy", "Family", "Kids"], "cast": ["Bill Bixby", "Brandon Cruz", "Miyoshi Umeki", "James Komack", "Kristina Holland"], "character": ["Tom Corbett", "Eddie Corbett", "Mrs. Livingston", "Norman Tinker", "Tina Rickles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6137   Expand The Courtship of Eddie's Father   (1969) User Score Overview The Courtship of Eddie's Father is an American television sitcom based on the 1963 movie of the same name, which was based on the book written by Mark Toby. It tells the story of a widower, Tom Corbett, who is a magazine publisher, and his son, Eddie, who believes his father should marry, and manipulates situations surrounding the women his father is interested in. ABC had acquired the rights to the story; the series debuted on September 17, 1969, and was last broadcast on March 1, 1972. Bixby received an Emmy nomination for the show. Featured Crew James Komack Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Bill Bixby Tom Corbett Brandon Cruz Eddie Corbett Miyoshi Umeki Mrs. Livingston James Komack Norman Tinker Kristina Holland Tina Rickles Full Cast & Crew Last Season Season 3 — | 20 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1952-10-03 The Adventures of Ozzie and Harriet 5.6    1958-09-24 The Donna Reed Show 6.7    1958-10-10 77 Sunset Strip 7.9    1948-06-20 The Ed Sullivan Show 6.6    1965-01-24 Branded 8.3    1961-10-02 Ben Casey 6.5    1963-09-18 The Patty Duke Show 5.6    1962-10-11 McHale's Navy 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Family Kids Keywords parent child relationship harry nilsson Content Score 100 Yes! Looking good! Top Contributors PE 14 Patrick E. Abe S 2 Samara TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}