{"link": "https://www.themoviedb.org/tv/35993?language=en", "title": "Ronin Warriors", "resume": "Ronin Warriors, originally Yoroiden Samurai Troopers in Japan, is one of the oldest anime series to air largely uncut to international markets. Since its U.S. re-broadcast in the summer of 1995, its popularity and fan-following has grown tremendously. The story is about five young men with mystical armor fighting to save modern-day Japan from the evil Talpa, who wants to take over the mortal world. The series contains 39 half-hour episodes and 3 movies: Gaiden, Kikoutei Densetsu, and Message. It is one of the most faithful animes to be broadcasted on basic cable; the footage was never cut or edited, and the dialouge remains true to the original.", "rate": 78, "genre": ["Action", "Adventure", "Animation"], "cast": ["Kiyoyuki Yanada", "Yasunori Matsumoto", "Tomohiro Nishimura", "Daiki Nakamura", "Kumiko Watanabe"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35993   Expand Ronin Warriors   (1988) User Score Overview Ronin Warriors, originally Yoroiden Samurai Troopers in Japan, is one of the oldest anime series to air largely uncut to international markets. Since its U.S. re-broadcast in the summer of 1995, its popularity and fan-following has grown tremendously. The story is about five young men with mystical armor fighting to save modern-day Japan from the evil Talpa, who wants to take over the mortal world. The series contains 39 half-hour episodes and 3 movies: Gaiden, Kikoutei Densetsu, and Message. It is one of the most faithful animes to be broadcasted on basic cable; the footage was never cut or edited, and the dialouge remains true to the original. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kiyoyuki Yanada Yasunori Matsumoto Tomohiro Nishimura Daiki Nakamura Kumiko Watanabe Full Cast & Crew Last Season Season 1 1988 | 39 Episodes Season 1 of Ronin Warriors premiered on April 30, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1985-01-23 ThunderCats 7.3    1994-10-24 Gargoyles 8.0    1989-04-26 Dragon Ball Z 8.1    2008-01-13 Terminator: The Sarah Connor Chronicles 7.3  Facts Original Name  鎧伝サムライトルーパー Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  20m Homepage  - Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 23 nass600 5 renegita J 5 JohnyB0y z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}