{"link": "https://www.themoviedb.org/tv/6080?language=en", "title": "Once Upon a Time... Man", "resume": "Once Upon a Time… Man is a French animated TV series from 1978 directed by Albert Barillé. It is the first in the Once Upon a Time... franchise. The series explains world history in a format designed for children. The action focuses around one group. The same familiar characters appear in all episodes as they deal with the problems of their time.\nThe series' opening and ending title sequences famously used Johann Sebastian Bach's Toccata and Fugue in D minor as the main title theme music. Shortening the piece to only 2 minutes in length, the introduction uses the very beginning, which jumps into the start of the middle section and finally the dramatic ending to coincide with the destruction of Earth at the end of the intro.", "rate": 85, "genre": ["Kids", "Animation", "Documentary", "Family"], "cast": ["Roger Carel", "Annie Balestra", "Josef Meinrad"], "character": ["Maestro", "deutscher Erähler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6080   Expand Once Upon a Time... Man   (1979) User Score  Play Trailer Overview Once Upon a Time… Man is a French animated TV series from 1978 directed by Albert Barillé. It is the first in the Once Upon a Time... franchise. The series explains world history in a format designed for children. The action focuses around one group. The same familiar characters appear in all episodes as they deal with the problems of their time. The series' opening and ending title sequences famously used Johann Sebastian Bach's Toccata and Fugue in D minor as the main title theme music. Shortening the piece to only 2 minutes in length, the introduction uses the very beginning, which jumps into the start of the middle section and finally the dramatic ending to coincide with the destruction of Earth at the end of the intro. Featured Crew Albert Barillé Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  28 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Roger Carel Maestro Annie Balestra Josef Meinrad deutscher Erähler Full Cast & Crew Last Season Season 1 1979 | 26 Episodes Season 1 of Once Upon a Time... Man premiered on March 24, 1979. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Once Upon a Time... Man. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  28 Recommendations   1994-01-03 Once Upon a Time... The Discoverers 7.1    1982-10-08 Once upon a time… Space 5.9    1987-06-17 Once Upon a Time... Life 8.0    1992-03-13 Once Upon a Time... The Americas 8.6    1980-01-08 The Wonderful Adventures of Nils 6.8    1998-01-17 Once Upon a Time... The Explorers 7.8    1984-10-15 Lucky Luke 6.1    1969-02-08 Pippi Longstocking 7.2  Facts Original Name  Il était une fois... l'homme Status  Ended Network Certification NR Meaning No rating information. Type  Scripted Original Language  French Runtime  26m Homepage   http://www.hellomaestro.fr/il-etait-une-fois-l-homme.html Genres Kids Animation Documentary Family Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors D 51 DorianP 29 Elizabeth Jennings M 26 Mr_Democracy 16 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}