{"link": "https://www.themoviedb.org/tv/53119?language=en", "title": "Minna! Esper Dayo", "resume": "In Notsu, Oita Prefecture, there are many people with supernatural powers. High school student Yoshio Kamogawa (Shota Sometani) is one of them and can read other people's minds. Yoshio uses his powers for trivial reasons.", "rate": 0, "genre": ["Comedy", "Drama", "Action", "Adventure"], "cast": ["Shota Sometani", "Kaho", "Erina Mano", "Ken Yasuda", "Megumi Kagurazaka"], "character": ["Yoshiro Kamogawa", "Miyuki Hirano", "Sae Asami", "Takahiro Asami", "Takako Akiyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53119   Expand Minna! Esper Dayo   (2018) User Score Overview In Notsu, Oita Prefecture, there are many people with supernatural powers. High school student Yoshio Kamogawa (Shota Sometani) is one of them and can read other people's minds. Yoshio uses his powers for trivial reasons. Featured Crew Kiminori Wakasugi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shota Sometani Yoshiro Kamogawa Kaho Miyuki Hirano Erina Mano Sae Asami Ken Yasuda Takahiro Asami Megumi Kagurazaka Takako Akiyama Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Minna! Esper Dayo premiered on April 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Minna! Esper Dayo. You can help by rating TV shows you've seen. Facts Original Name  みんな!エスパーだよ! Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres Comedy Drama Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors m 21 mitnoi 16 Sergiojamon 7 BrerFox 4 Kijung Kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}