{"link": "https://www.themoviedb.org/tv/39340?language=en", "title": "2 Broke Girls", "resume": "Comedy about the unlikely friendship that develops between two very different young women who meet waitressing at a diner in trendy Williamsburg, Brooklyn, and form a bond over one day owning their own successful cupcake business. Only one thing stands in their way – they’re broke.", "rate": 56, "genre": ["Comedy"], "cast": ["Kat Dennings", "Beth Behrs", "Garrett Morris", "Jonathan Kite", "Matthew Moy"], "character": ["Max Black", "Caroline Channing", "Earl Washington", "Oleg Golishevsky", "Han Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39340   Expand 2 Broke Girls   (2011) User Score  Play Trailer Overview Comedy about the unlikely friendship that develops between two very different young women who meet waitressing at a diner in trendy Williamsburg, Brooklyn, and form a bond over one day owning their own successful cupcake business. Only one thing stands in their way – they’re broke. Featured Crew Michael Patrick King Creator Whitney Cummings Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  4 Images Backdrops  14 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kat Dennings Max Black Beth Behrs Caroline Channing Garrett Morris Earl Washington Jonathan Kite Oleg Golishevsky Matthew Moy Han Lee Full Cast & Crew Last Season Season 6 2016 | 22 Episodes Season 6 of 2 Broke Girls premiered on October 10, 2016. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Sophie: Happy Birthday Jennifer Coolidge! Open 0 by wonder2wonder\n      \n     w Max: Happy Birthday Kat Dennings! Open 1 by  Satch_the_man The Money at the End? Open 1 by  SeinfeldFriend Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  18 Recommendations   2003-09-22 Two and a Half Men 6.2    2010-09-06 Mike & Molly 5.6    2011-09-20 New Girl 6.5    2013-09-23 Mom 6.0    2005-09-19 How I Met Your Mother 7.4    2011-09-28 Suburgatory 6.8    2009-09-23 Modern Family 7.3    2001-10-02 Scrubs 7.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.cbs.com/shows/2_broke_girls/ Genres Comedy Keywords new york restaurant female friendship sitcom workplace comedy riches to rags rich vs poor working life Content Score 100 Yes! Looking good! Top Contributors 183 Marr 🇳🇱 145 seawolf 41 Elizabeth Jennings M 35 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}