{"link": "https://www.themoviedb.org/tv/68728?language=en", "title": "My Mother and Other Strangers", "resume": "Drama series set in 1943 following the Coyne family and their neighbours as they struggle to maintain a normal life after a US Army Air Force base is set up in the middle of their rural parish.", "rate": 73, "genre": ["Drama"], "cast": ["Hattie Morahan", "Ciarán Hinds", "Eileen O'Higgins", "Aaron Staton", "Owen McDonnell"], "character": ["Rose Coyne", "Older Francis", "Emma Coyne", "Captain Ronald Dreyfuss", "Michael Coyne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68728   Expand My Mother and Other Strangers   (2016) User Score  Play Trailer Overview Drama series set in 1943 following the Coyne family and their neighbours as they struggle to maintain a normal life after a US Army Air Force base is set up in the middle of their rural parish. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hattie Morahan Rose Coyne Ciarán Hinds Older Francis Eileen O'Higgins Emma Coyne Aaron Staton Captain Ronald Dreyfuss Owen McDonnell Michael Coyne Full Cast & Crew Last Season Season 1 2016 | 5 Episodes Season 1 of My Mother and Other Strangers premiered on November 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Mother and Other Strangers. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b08302gm Genres Drama Keywords normality world war ii rural setting family Content Score 93 Almost there... Top Contributors z 26 zyck 14 genplant29 6 Elizabeth Jennings w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}