{"link": "https://www.themoviedb.org/tv/9162?language=en", "title": "Schulmädchen", "resume": "Schulmädchen is a comedy series aired on RTL Television in Germany beginning in 2002. A total of fifteen episodes have been produced as of 2005. While the show's title translates to \"school girls\", and is a clear reference to Schulmädchen-Report, a series of soft core porn movies made in Germany in the 1970s, the show itself is a parody of imported American teen dramas such as the 1989 movie Heathers and television series Beverly Hills, 90210, which have long been popular in Germany.\nThe show follows the adventures of a group of pushy, wealthy teenage girls at the fictitious Franz Josef Strauss-Gymnasium in Munich.\nThe show stars Birthe Wolter as Laura, Laura Osswald as Cara, Simone Hanselmann as Stella and Arzu Bazman as Ramona. The show's theme song is \"Hey Baby\" by No Doubt.", "rate": 65, "genre": ["Comedy"], "cast": ["Birthe Wolter", "Simone Hanselmann", "Laura Osswald", "Marie Rönnebeck", "Thomas Limpinsel"], "character": ["Laura Heller", "Stella Morgenroth", "Cara de Boni", "Lilliane Frank", "Paul Heller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9162   Expand Schulmädchen   (2002) User Score Overview Schulmädchen is a comedy series aired on RTL Television in Germany beginning in 2002. A total of fifteen episodes have been produced as of 2005. While the show's title translates to \"school girls\", and is a clear reference to Schulmädchen-Report, a series of soft core porn movies made in Germany in the 1970s, the show itself is a parody of imported American teen dramas such as the 1989 movie Heathers and television series Beverly Hills, 90210, which have long been popular in Germany. The show follows the adventures of a group of pushy, wealthy teenage girls at the fictitious Franz Josef Strauss-Gymnasium in Munich. The show stars Birthe Wolter as Laura, Laura Osswald as Cara, Simone Hanselmann as Stella and Arzu Bazman as Ramona. The show's theme song is \"Hey Baby\" by No Doubt. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Birthe Wolter Laura Heller Simone Hanselmann Stella Morgenroth Laura Osswald Cara de Boni Marie Rönnebeck Lilliane Frank Thomas Limpinsel Paul Heller Full Cast & Crew Last Season Season 2 2005 | 8 Episodes Season 2 of Schulmädchen premiered on July 29, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Schulmädchen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 15 Samara R 3 Rickedode  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}