{"link": "https://www.themoviedb.org/tv/4123?language=en", "title": "Rumpole of the Bailey", "resume": "Rumpole of the Bailey is a British television series created and written by the British writer and barrister John Mortimer. It stars Leo McKern as Horace Rumpole, an aging London barrister who defends any and all clients, and has been spun off into a series of short stories, novels, and radio programmes.", "rate": 79, "genre": ["Drama", "Comedy"], "cast": ["Leo McKern", "Derek Benfield", "Moray Watson", "Peter Bowles", "Bill Fraser"], "character": ["Horace Rumpole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4123   Expand Rumpole of the Bailey   (1975) User Score Overview Rumpole of the Bailey is a British television series created and written by the British writer and barrister John Mortimer. It stars Leo McKern as Horace Rumpole, an aging London barrister who defends any and all clients, and has been spun off into a series of short stories, novels, and radio programmes. Featured Crew John Mortimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Leo McKern Horace Rumpole Derek Benfield Moray Watson Peter Bowles Bill Fraser Full Cast & Crew Last Season Season 7 1992 | 6 Episodes Season 7 of Rumpole of the Bailey premiered on October 29, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1975-01-02 The Sweeney 6.4    1985-09-18 The Equalizer 6.3    1962-10-04 The Saint 7.2    1992-12-06 A Touch of Frost 7.9    2012-09-06 The Bletchley Circle 7.8    1986-01-09 Yes, Prime Minister 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors R 2 Rebecca MD 1 Monkey D Mills TB 1 TMDb Bot t 1 tmdb15589237  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}