{"link": "https://www.themoviedb.org/tv/7961?language=en", "title": "TekWar", "resume": "TekWar is a North American television series, based on the TekWar novels ghost-written by Ron Goulart from outlines by William Shatner and developed for television by Stephen Roloff. The series follows Jake Cardigan, a former police officer turned private investigator working for Cosmos, a private security firm owned and operated by Walter Bascom.\nThe series was broadcast in Canada on CTV and in the United States on USA Network and the Sci Fi Channel. The series, which was a co-production between Atlantis Films and Universal Television premiered on January 17, 1994 and ended on February 9, 1996.", "rate": 47, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7961   Expand TekWar   (1994) User Score Overview TekWar is a North American television series, based on the TekWar novels ghost-written by Ron Goulart from outlines by William Shatner and developed for television by Stephen Roloff. The series follows Jake Cardigan, a former police officer turned private investigator working for Cosmos, a private security firm owned and operated by Walter Bascom. The series was broadcast in Canada on CTV and in the United States on USA Network and the Sci Fi Channel. The series, which was a co-production between Atlantis Films and Universal Television premiered on January 17, 1994 and ended on February 9, 1996. Featured Crew William Shatner Creator Ron Goulart Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1994 | 18 Episodes Season 1 of TekWar premiered on December 22, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply strange how I remember more from this Open 0 by wreckage3001 🎃🏠☕🍪\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   1995-09-22 Space: Above and Beyond 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors L 18 Lysator 3 enams90 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}