{"link": "https://www.themoviedb.org/tv/78052?language=en", "title": "Marry Me Now", "resume": "Park Yoo-Ha studied hard in medical school and finished her intern course. She works hard to become a doctor due to her father. Her father raised 4 children by himself and her oldest sister also sacrificed for the family. Park Yoo-Ha is not interested in other people. Suddenly, her father marries a woman rich enough to own a building.\nMeanwhile, Jung Eun-Tae works as a doctor. He volunteered for performing medical service abroad, but he comes back to Korea. Jung Eun-Tae is not interested in marriage, because his father placed priority on his medical work over family and Jung Eun-Tae believes he is like his father.", "rate": 70, "genre": ["Drama", "Family"], "cast": ["Han Ji-hye", "Lee Sang-woo", "Yoo Dong-geun", "Chang Mi-hee", "Park Sun-young"], "character": ["Park Yoo-Ha", "Jung Eun-Tae", "Park Hyo-Seob", "Lee Mi-Yeon", "Park Sun-Ha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78052   Expand Marry Me Now   (2018) User Score Overview Park Yoo-Ha studied hard in medical school and finished her intern course. She works hard to become a doctor due to her father. Her father raised 4 children by himself and her oldest sister also sacrificed for the family. Park Yoo-Ha is not interested in other people. Suddenly, her father marries a woman rich enough to own a building. Meanwhile, Jung Eun-Tae works as a doctor. He volunteered for performing medical service abroad, but he comes back to Korea. Jung Eun-Tae is not interested in marriage, because his father placed priority on his medical work over family and Jung Eun-Tae believes he is like his father. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Ji-hye Park Yoo-Ha Lee Sang-woo Jung Eun-Tae Yoo Dong-geun Park Hyo-Seob Chang Mi-hee Lee Mi-Yeon Park Sun-young Park Sun-Ha Full Cast & Crew Current Season Season 1 2018 | 50 Episodes Season 1 of Marry Me Now premiered on March 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Marry Me Now. You can help by rating TV shows you've seen. Facts Original Name  같이 살래요 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/marrymenow/ Genres Drama Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 44 Maria180493 4 galactica_j h 3 huestory V 3 Violsa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}