{"link": "https://www.themoviedb.org/tv/519?language=en", "title": "Larry King Live", "resume": "Larry King Live is an American talk show that was hosted by Larry King on CNN from 1985 to 2010. It was CNN's most watched and longest-running program, with over one million viewers nightly.\nMainly aired from CNN's Los Angeles studios, the show was sometimes broadcast from CNN's studios in New York or Washington, D.C., where King gained national prominence during his years as a radio interviewer for the Mutual Broadcasting System. Every night, King interviewed one or more prominent individuals, usually celebrities, politicians and businesspeople.\nThe one-hour show was broadcast three times a day in some areas, and was seen all over the world on CNN International.\nOn June 29, 2010, King announced that the program would be coming to an end. The \"final edition\" of the program aired on December 16, but a new episode on the war against cancer aired two days later on December 18.\nLarry King Live was replaced by Piers Morgan Tonight, a talk show hosted by the British television personality and journalist Piers Morgan. It began airing January 17, 2011, featuring Oprah Winfrey as the first guest.", "rate": 55, "genre": ["Talk", "News"], "cast": ["Larry King", "Anderson Cooper", "Geraldo Rivera"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 519   Expand Larry King Live   (1985) User Score Overview Larry King Live is an American talk show that was hosted by Larry King on CNN from 1985 to 2010. It was CNN's most watched and longest-running program, with over one million viewers nightly. Mainly aired from CNN's Los Angeles studios, the show was sometimes broadcast from CNN's studios in New York or Washington, D.C., where King gained national prominence during his years as a radio interviewer for the Mutual Broadcasting System. Every night, King interviewed one or more prominent individuals, usually celebrities, politicians and businesspeople. The one-hour show was broadcast three times a day in some areas, and was seen all over the world on CNN International. On June 29, 2010, King announced that the program would be coming to an end. The \"final edition\" of the program aired on December 16, but a new episode on the war against cancer aired two days later on December 18. Larry King Live was replaced by Piers Morgan Tonight, a talk show hosted by the British television personality and journalist Piers Morgan. It began airing January 17, 2011, featuring Oprah Winfrey as the first guest. Featured Crew Larry King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry King Host Anderson Cooper Geraldo Rivera Full Cast & Crew Last Season Season 2010 2010 | 4 Episodes Season 2010 of Larry King Live premiered on June  3, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1999-08-16 Who Wants to Be a Millionaire? (US) 7.0  Facts Status  Ended Network Certification  - Type  Talk Show Original Language  English Runtime  60m Homepage   http://www.edition.cnn.com/CNN/Programs/larry.king.live/ Genres Talk News Keywords talk show Content Score 64 We're so close, yet so far. Top Contributors 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}