{"link": "https://www.themoviedb.org/tv/74278?language=en", "title": "The Secret Life of Couples", "resume": "Sexologist and therapist Sofia Prado, director of an institute of alternative therapies, has to deal with her own emotional disorders, which she hides from everyone. From the revelation of one of her patients, the specialist becomes involved in a dangerous network of corruption.", "rate": 80, "genre": ["Drama"], "cast": ["Bruna Lombardi", "Carlos Alberto Riccelli", "Letícia Colin", "Paulo Gorgulho", "Bia Seidl"], "character": ["Sofia Prado", "Luís", "Renata", "Edgar Andreazza", "Alice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74278   Expand The Secret Life of Couples   (2017) User Score Overview Sexologist and therapist Sofia Prado, director of an institute of alternative therapies, has to deal with her own emotional disorders, which she hides from everyone. From the revelation of one of her patients, the specialist becomes involved in a dangerous network of corruption. Featured Crew Bruna Lombardi Creator Kim Riccelli Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruna Lombardi Sofia Prado Carlos Alberto Riccelli Luís Letícia Colin Renata Paulo Gorgulho Edgar Andreazza Bia Seidl Alice Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of The Secret Life of Couples premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Secret Life of Couples. You can help by rating TV shows you've seen. Facts Original Name  A Vida Secreta dos Casais Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Portuguese Runtime  55m Homepage   http://br.hbomax.tv/serie/A-Vida-Secreta-dos-Casais/501465/TTL609742 Genres Drama Keywords sex couple Content Score 100 Yes! Looking good! Top Contributors 45 adrielmattos 33 Elizabeth Jennings s 3 speedycars jp 2 juan perez  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}