{"link": "https://www.themoviedb.org/tv/5403?language=en", "title": "Starman", "resume": "Starman is an American science fiction television series, starring Robert Hays and Christopher Daniel Barnes and continuing the story from John Carpenter's 1984 film. The series ran on the ABC network from September 19, 1986 to May 2, 1987. The series was an adaptation and sequel to a movie of the same name produced in 1984.", "rate": 64, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Robert Hays", "Christopher Daniel Barnes", "Michael Cavanaugh", "Patrick Culliton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5403   Expand Starman   (1986) User Score Overview Starman is an American science fiction television series, starring Robert Hays and Christopher Daniel Barnes and continuing the story from John Carpenter's 1984 film. The series ran on the ABC network from September 19, 1986 to May 2, 1987. The series was an adaptation and sequel to a movie of the same name produced in 1984. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Hays Christopher Daniel Barnes Michael Cavanaugh Patrick Culliton Full Cast & Crew Last Season Season 1 1986 | 22 Episodes Season 1 of Starman premiered on September 19, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1989-09-19 Doogie Howser, M.D. 5.7    1984-09-18 Punky Brewster 6.8    1974-09-07 Land of the Lost 6.9    1983-10-03 Scarecrow and Mrs. King 5.5    1999-04-03 The Lost World 7.4    1986-09-08 SilverHawks 7.1    1977-01-14 Fantasy Island 6.5    1986-03-25 Perfect Strangers 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 jlbueno73 S 2 Samara 2 paterjm 2 jessemusson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}