{"link": "https://www.themoviedb.org/tv/2466?language=en", "title": "In Justice", "resume": "In Justice is an American television police procedural created by Michelle King and Robert King. The series began airing on Sunday, January 1, 2006 on ABC as a midseason replacement and assumed its regular night and time on Friday, January 6, 2006 at 9 p.m. EST. It was cancelled after its 13-episode run on March 31, 2006. The series was simulcast in Canada on CTV. In the UK In Justice was shown on UKTV Gold beginning September 17, 2006 and was later repeated on ABC1 in 2007.", "rate": 68, "genre": ["Drama"], "cast": ["Jason O'Mara", "Kyle MacLachlan", "Constance Zimmer", "Daniel Cosgrove", "Marisol Nichols"], "character": ["Charles Conti", "David Swain", "Brianna", "Jon Lemonick", "Sonya Quintano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2466   Expand In Justice   (2006) User Score Overview In Justice is an American television police procedural created by Michelle King and Robert King. The series began airing on Sunday, January 1, 2006 on ABC as a midseason replacement and assumed its regular night and time on Friday, January 6, 2006 at 9 p.m. EST. It was cancelled after its 13-episode run on March 31, 2006. The series was simulcast in Canada on CTV. In the UK In Justice was shown on UKTV Gold beginning September 17, 2006 and was later repeated on ABC1 in 2007. Featured Crew Michelle King Creator Robert King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason O'Mara Charles Conti Kyle MacLachlan David Swain Constance Zimmer Brianna Daniel Cosgrove Jon Lemonick Marisol Nichols Sonya Quintano Full Cast & Crew Last Season Season 1 2006 | 13 Episodes Season 1 of In Justice premiered on January  1, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for In Justice. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2011-01-13 Kidnap and Ransom 7.6    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2012-08-30 Good Cop 6.6    2015-04-15 The Delivery Man 6.5    2011-05-02 Case Sensitive 5.4    2004-07-19 The Grid 7.0    2010-07-12 The Silence 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Keywords san francisco lawyer pro bono wrongful conviction Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana 5 United600 i 5 ismax935 E 4 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}