{"link": "https://www.themoviedb.org/tv/724?language=en", "title": "The Oprah Winfrey Show", "resume": "The Oprah Winfrey Show, often referred to simply as Oprah, is an American syndicated talk show that aired nationally for 25 seasons from 1986 to 2011. Produced and hosted by its namesake, Oprah Winfrey, it remains the highest-rated talk show in American television history.\nThe show was highly influential, and many of its topics penetrated into the American pop-cultural consciousness. Winfrey used the show as a platform to teach and inspire, providing viewers with a positive, spiritually uplifting experience by featuring book clubs, compelling interviews, self-improvement segments, and philanthropic forays into world events. The show gained credibility by not trying to profit off the products it endorsed; it had no licensing agreement with retailers when products were promoted, nor did the show make any money from endorsing books for its book club.\nOprah is one of the longest-running daytime television talk shows in history. The show received 47 Daytime Emmy Awards before Winfrey decided to stop submitting it for consideration in 2000.", "rate": 41, "genre": ["Talk"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 724   Expand The Oprah Winfrey Show User Score Overview The Oprah Winfrey Show, often referred to simply as Oprah, is an American syndicated talk show that aired nationally for 25 seasons from 1986 to 2011. Produced and hosted by its namesake, Oprah Winfrey, it remains the highest-rated talk show in American television history. The show was highly influential, and many of its topics penetrated into the American pop-cultural consciousness. Winfrey used the show as a platform to teach and inspire, providing viewers with a positive, spiritually uplifting experience by featuring book clubs, compelling interviews, self-improvement segments, and philanthropic forays into world events. The show gained credibility by not trying to profit off the products it endorsed; it had no licensing agreement with retailers when products were promoted, nor did the show make any money from endorsing books for its book club. Oprah is one of the longest-running daytime television talk shows in history. The show received 47 Daytime Emmy Awards before Winfrey decided to stop submitting it for consideration in 2000. Featured Crew Oprah Winfrey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Oprah Winfrey: Happy Birthday Oprah Winfrey! Open 0 by wonder2wonder\n      \n     AIDS in Williamson, West Virginia Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Networks - Certification  - Type  Talk Show Original Language  English Runtime  60m, 45m Homepage   http://www.oprah.com/ Genres Talk Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 6 xsnaruto 3 Zlogorek D 1 DirtRider  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}