{"link": "https://www.themoviedb.org/tv/74750?language=en", "title": "Rule the World", "resume": "It tells the story of a woman who travels 400 years into the body of Dong Ge, the most beautiful woman in the land, yet she is born with a curse that can make or break a nation. Can a woman from the modern times learn to adapt to a new life and a new romance? Can she escape what's been written in history?", "rate": 8, "genre": ["Drama"], "cast": ["Raymond Lam", "Tina Tang", "Ray Zhang", "Maggie Chen", "Xu Rong Zhen"], "character": ["Huang Taiji", "Dong'ge / Hai Lanzhu", "Daisan", "Abahai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74750   Expand Rule the World   (2017) User Score Overview It tells the story of a woman who travels 400 years into the body of Dong Ge, the most beautiful woman in the land, yet she is born with a curse that can make or break a nation. Can a woman from the modern times learn to adapt to a new life and a new romance? Can she escape what's been written in history? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raymond Lam Huang Taiji Tina Tang Dong'ge / Hai Lanzhu Ray Zhang Daisan Maggie Chen Abahai Xu Rong Zhen Full Cast & Crew Current Season Season 1 2017 | 45 Episodes Season 1 of Rule the World premiered on October 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rule the World. You can help by rating TV shows you've seen. Facts Original Name  独步天下 Status  Ended Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords fantasy china romance historical Content Score 86 Almost there... Top Contributors j 36 jklmo M 13 Maria180493 s 5 sinistervn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}