{"link": "https://www.themoviedb.org/tv/2527?language=en", "title": "Emmerdale", "resume": "The lives of several families in the Yorkshire Dales revolve around a farm and the nearby village. With murders, affairs, lies, deceit, laughter and tears, it's all there in the village.", "rate": 40, "genre": ["Soap", "Drama"], "cast": ["Danny Miller", "Ryan Hawley", "Elizabeth Estensen", "Lucy Pargeter", "Mark Charnock"], "character": ["Aaron Dingle", "Robert Sugden", "Diane Sugden", "Chas Dingle", "Marlon Dingle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2527   Expand Emmerdale   (1972) User Score Overview The lives of several families in the Yorkshire Dales revolve around a farm and the nearby village. With murders, affairs, lies, deceit, laughter and tears, it's all there in the village. Featured Crew Kevin Laffan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danny Miller Aaron Dingle Ryan Hawley Robert Sugden Elizabeth Estensen Diane Sugden Lucy Pargeter Chas Dingle Mark Charnock Marlon Dingle Full Cast & Crew Last Season Season 48 2017 | 161 Episodes Season 48 of Emmerdale premiered on January  2, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Loved David Gamp as Brian Coogan. Open 0 by David Dregden\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1983-09-22 Just Good Friends 6.4    2005-02-21 Masterchef Goes Large 4.8    1987-09-26 ChuckleVision 6.3    1960-12-09 Coronation Street 5.5    1984-10-16 The Bill 6.6    2005-02-16 The Apprentice 5.2    1990-01-10 Oranges Are Not the Only Fruit 7.6    1978-11-10 Butterflies 6.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   https://www.itv.com/itvplayer/emmerdale Genres Soap Drama Keywords farm northern england community yorkshire english countryside small village Content Score 93 Almost there... Top Contributors 887 lineker m 196 math1312 L 33 Leah TB 26 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}