{"link": "https://www.themoviedb.org/tv/64092?language=en", "title": "Danger Mouse", "resume": "Danger Mouse is back saving London, saving the World and, most importantly, saving Penfold in brand new and fantastically absurd, energetic adventures.", "rate": 74, "genre": ["Comedy", "Animation"], "cast": ["Alexander Armstrong"], "character": ["Danger mouse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64092   Expand Danger Mouse   (2015) User Score  Play Trailer Overview Danger Mouse is back saving London, saving the World and, most importantly, saving Penfold in brand new and fantastically absurd, energetic adventures. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Armstrong Danger mouse Full Cast & Crew Last Season Season 1 2015 | 50 Episodes Season 1 of Danger Mouse premiered on September 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Danger Mouse. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.bbc.co.uk/cbbc/shows/danger-mouse Genres Comedy Animation Keywords secret agent cartoon mouse Content Score 64 We're so close, yet so far. Top Contributors 18 Elizabeth Jennings z 8 zorg2000k 6 Banana C 3 Cpuroast  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}