{"link": "https://www.themoviedb.org/tv/3535?language=en", "title": "What About Brian", "resume": "Serial monogamist Brian O'Hara hits his mid-30s and suddenly realizes he's the last bachelor standing in his circle of friends. Not averse to the happily ever after his friends have achieved, Brian wonders whether he'll ever find Mrs. Right. The fact that he's in love with his best friend's girlfriend doesn't help his chances.", "rate": 65, "genre": ["Drama", "Comedy"], "cast": ["Rosanna Arquette", "Sarah Lancaster", "Amanda Detmer", "Matthew Davis", "Barry Watson"], "character": ["Nicole Varzi", "Marjorie Seaver", "Deena Greco", "Adam Hillman", "Brian Davis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3535   Expand What About Brian   (2006) User Score Overview Serial monogamist Brian O'Hara hits his mid-30s and suddenly realizes he's the last bachelor standing in his circle of friends. Not averse to the happily ever after his friends have achieved, Brian wonders whether he'll ever find Mrs. Right. The fact that he's in love with his best friend's girlfriend doesn't help his chances. Featured Crew Dana Stevens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rosanna Arquette Nicole Varzi Sarah Lancaster Marjorie Seaver Amanda Detmer Deena Greco Matthew Davis Adam Hillman Barry Watson Brian Davis Full Cast & Crew Last Season Season 2 2006 | 19 Episodes Season 2 of What About Brian premiered on October  9, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on What About Brian. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/shows/what-about-brian Genres Drama Comedy Keywords california bachelor dating Content Score 93 Almost there... Top Contributors 11 Banana a 6 asusar R 4 Rebecca w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}