{"link": "https://www.themoviedb.org/tv/78152?language=en", "title": "Dip", "resume": "Sahir, who is in charge of abandoning the people who attempt to commit suicide due to Istanbul Security, finds Bilge who is a scientist woman with a notice coming to the phone one day.", "rate": 0, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Can Gox", "Neslihan Atagül", "Ilker Kaleli", "Feridun Düzağaç", "Defne Kayalar"], "character": ["Bilge", "Sahir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78152   Expand Dip   (2018) User Score Overview Sahir, who is in charge of abandoning the people who attempt to commit suicide due to Istanbul Security, finds Bilge who is a scientist woman with a notice coming to the phone one day. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Can Gox Neslihan Atagül Bilge Ilker Kaleli Sahir Feridun Düzağaç Defne Kayalar Full Cast & Crew Current Season Season 1 2018 | 2 Episodes Season 1 of Dip premiered on March 30, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Dip. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  60m Homepage   https://puhutv.com/dip-detay Genres Crime Drama Mystery Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 35 sinefil 2 moviefars 1 tago1987  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}