{"link": "https://www.themoviedb.org/tv/72508?language=en", "title": "Convenience Store Boy Friends", "resume": "Six high school boys hang out at a local convenience store where they talk about their daily lives. Haruki Mishima and Towa Honda are first year students looking forward to the high school experience. Alongside them, there’s Nasa Sanagi, the only member of the cooking research club. Natsu Asumi is a loner but has third year students, Mikado Nakajima and Masamune Sakurakoji, looking out for him.", "rate": 73, "genre": ["Animation", "Comedy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72508   Expand Convenience Store Boy Friends   (2017) User Score Overview Six high school boys hang out at a local convenience store where they talk about their daily lives. Haruki Mishima and Towa Honda are first year students looking forward to the high school experience. Alongside them, there’s Nasa Sanagi, the only member of the cooking research club. Natsu Asumi is a loner but has third year students, Mikado Nakajima and Masamune Sakurakoji, looking out for him. Featured Crew Hayato Date Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Convenience Store Boy Friends premiered on July  7, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Convenience Store Boy Friends. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2017-07-12 My First Girlfriend is a Gal 7.4    2017-07-13 Gamers! 7.8    2017-07-04 Tsuredure Children 8.0    2017-07-12 Classroom of the Elite 7.6    2017-01-06 Fuuka 7.3  Facts Original Name  コンビニカレシ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/konbini/ Genres Animation Comedy Drama Keywords romance slice of life school life Content Score 64 We're so close, yet so far. Top Contributors C 14 Chintaran D 13 Destr0y 11 sp1ti f 7 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}