{"link": "https://www.themoviedb.org/tv/44952?language=en", "title": "Arang and the Magistrate", "resume": "Arang and the Magistrate is a 2012 South Korean historical television drama, starring Lee Joon-gi, Shin Min-ah and Yeon Woo-jin. The period horror-romance is based on the folklore of Arang, who died unjustly and returns as a ghost in order to reveal the circumstances surrounding her death. It aired on MBC from August 15 to October 18, 2012 on Wednesdays and Thursdays at 21:55 for 20 episodes.", "rate": 80, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Lee Joon-gi", "Shin Min-A", "Han Jung-soo", "Hwang Bo-ra", "Yoo Seung-Ho"], "character": ["Kim Eun Oh", "Arang / Lee Seo Rim", "Mu-young", "Bang-wool", "Jade Emperor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44952   Expand Arang and the Magistrate   (2012) User Score Overview Arang and the Magistrate is a 2012 South Korean historical television drama, starring Lee Joon-gi, Shin Min-ah and Yeon Woo-jin. The period horror-romance is based on the folklore of Arang, who died unjustly and returns as a ghost in order to reveal the circumstances surrounding her death. It aired on MBC from August 15 to October 18, 2012 on Wednesdays and Thursdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Joon-gi Kim Eun Oh Shin Min-A Arang / Lee Seo Rim Han Jung-soo Mu-young Hwang Bo-ra Bang-wool Yoo Seung-Ho Jade Emperor Full Cast & Crew Last Season Season 1 2012 | 20 Episodes Season 1 of Arang and the Magistrate premiered on August 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   2010-08-30 Sungkyunkwan Scandal 7.7    2013-12-09 The Prime Minister and I 7.1    2013-06-05 I Hear Your Voice 8.2    2015-08-05 Yong Pal 7.2    2014-12-08 Healer 8.7    2014-11-12 Pinocchio 7.4    2015-01-07 Kill Me, Heal Me 8.7    2010-11-13 Secret Garden 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/arang4to Genres Sci-Fi & Fantasy Keywords supernatural romance korea ghost Content Score 86 Almost there... Top Contributors M 34 Maria180493 N 14 Nightowl.Kr p 5 ppreethi t 4 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}