{"link": "https://www.themoviedb.org/tv/67894?language=en", "title": "Nobel", "resume": "Lieutenant Erling Riiser is on his way back to Norway after a long stay in Afghanistan. Much has gone wrong, several soldiers are missing from the Hercelus-plane. After only one day in Norway, Erling receives a text message saying an old acquaintance from Afghanistan is in Oslo - which can mean only one thing: A woman's life is in danger", "rate": 81, "genre": ["Drama"], "cast": ["Aksel Hennie", "Tuva Novotny", "Atheer Adel", "Ayesha Wolasmal", "Anders Danielsen Lie"], "character": ["Erling Riiser", "Johanne Riiser", "Sharif Zamani", "Wasima Zamani", "Jon Petter Hals"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67894   Expand Nobel   (2016) User Score  Play Trailer Overview Lieutenant Erling Riiser is on his way back to Norway after a long stay in Afghanistan. Much has gone wrong, several soldiers are missing from the Hercelus-plane. After only one day in Norway, Erling receives a text message saying an old acquaintance from Afghanistan is in Oslo - which can mean only one thing: A woman's life is in danger Featured Crew Per-Olav Sørensen Creator Mette M. Bølstad Creator Stephen Uhlander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aksel Hennie Erling Riiser Tuva Novotny Johanne Riiser Atheer Adel Sharif Zamani Ayesha Wolasmal Wasima Zamani Anders Danielsen Lie Jon Petter Hals Full Cast & Crew Last Season Season 1 2016 | 7 Episodes Season 1 of Nobel premiered on September 25, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of the best TV shows of recent years Open 3 by Java.Jane\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2016-10-16 Bordertown 7.5    2006-10-10 Intelligence 8.3    2014-04-21 Jamaica Inn 5.5    2015-09-22 Sea of Plastic 6.8    2015-05-24 Tales by Light 7.8    2016-01-07 Deep 7.0    2017-01-10 The Frozen Dead 6.6    2013-03-10 Shetland 7.5  Facts Original Name  Nobel - fred for enhver pris Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Norwegian Runtime  45m Homepage   https://tv.nrk.no/serie/nobel-fred-for-enhver-pris Genres Drama Keywords war afghanistan norway Content Score 100 Yes! Looking good! Top Contributors 44 Bendik M 19 Mr_Democracy 10 Elizabeth Jennings TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}