{"link": "https://www.themoviedb.org/tv/4745?language=en", "title": "Back To The Future: The Animated Series", "resume": "Back to the Future is an animated series for television based on the Back to the Future trilogy of feature films. The series lasted two seasons, each featuring 13 episodes, and ran on CBS from September 14, 1991 to December 26, 1992. It reran until August 14, 1993. and later on Fox from March to September 2003.\nAlthough the series takes place after the films, co-creator of the Back to the Future series Bob Gale has stated that it and the comics take place in their own 'what if' and alternate timelines and not part of the main continuity.", "rate": 40, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Mary Steenburgen", "David Kaufman", "Dan Castellaneta", "Josh Keaton", "Danny Mann"], "character": ["Clara Clayton (voice)", "Martin Seamus 'Marty' McFly (voice)", "Dr. Emmett Brown (voice)", "Jules Erastosthenes Brown (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4745   Expand Back To The Future: The Animated Series   (1991) User Score Overview Back to the Future is an animated series for television based on the Back to the Future trilogy of feature films. The series lasted two seasons, each featuring 13 episodes, and ran on CBS from September 14, 1991 to December 26, 1992. It reran until August 14, 1993. and later on Fox from March to September 2003. Although the series takes place after the films, co-creator of the Back to the Future series Bob Gale has stated that it and the comics take place in their own 'what if' and alternate timelines and not part of the main continuity. Featured Crew Bob Gale Creator Robert Zemeckis Creator John Loy Creator John Ludin Creator Mark Klastorin Creator Michael Klastorin Creator Rick Cunningham Creator Randy Gale Creator Peyton Reed Creator Michael Zimbalist Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Steenburgen Clara Clayton (voice) David Kaufman Martin Seamus 'Marty' McFly (voice) Dan Castellaneta Dr. Emmett Brown (voice) Josh Keaton Jules Erastosthenes Brown (voice) Danny Mann Full Cast & Crew Last Season Season 2 1992 | 13 Episodes Season 2 of Back To The Future: The Animated Series premiered on September 19, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   1997-10-11 Men in Black: The Series 6.3    1992-10-23 The World of Peter Rabbit and Friends 6.7    1993-09-11 The Pink Panther 6.5    1993-09-06 Adventures of Sonic the Hedgehog 4.9  Facts Status  Ended Network Certification 6+ Meaning Only kids the age of 6 or older can watch. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.bttf.com/ Genres Animation Sci-Fi & Fantasy Keywords time travel based on movie Content Score 93 Almost there... Top Contributors n 29 navarro2018 20 Banana 4 lineker J 4 JohnyB0y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}