{"link": "https://www.themoviedb.org/tv/12406?language=en", "title": "Powerpuff Girls Z", "resume": "They're Here! Powerpuff Girls Z, known in some other countries as Powerpuff Girls Z, or PPGZ for short, is a magical girl anime series based on the American animated television series The Powerpuff Girls. The anime is co-produced by Cartoon Network Japan and Aniplex and was animated by Toei Animation, featuring character design by Miho Shimogasa. As production occurred in Japan, Craig McCracken, the original creator of The Powerpuff Girls, was not directly involved with the project.\nThe 52-episode series aired in Japan on TV Tokyo between July 1, 2006, and June 30, 2007. It also aired on AT-X and on Cartoon Network in Japan. An English-dubbed version produced by Ocean Group aired by Cartoon Network Philippines on their Boomerang channel in 2008. A manga of the same name ran in Shueisha's Ribon magazine between July 2006 and June 2007.", "rate": 0, "genre": ["Animation"], "cast": ["Masashi Ebara", "Nami Miyahara", "Hideyuki Tanaka", "Tomoko Kaneda", "Emiri Kato"], "character": ["Mojo Jojo", "Miyako Goutokuji", "Mayor", "Peach", "Momoko Akatsutsumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12406   Expand Powerpuff Girls Z   (2006) User Score Overview They're Here! Powerpuff Girls Z, known in some other countries as Powerpuff Girls Z, or PPGZ for short, is a magical girl anime series based on the American animated television series The Powerpuff Girls. The anime is co-produced by Cartoon Network Japan and Aniplex and was animated by Toei Animation, featuring character design by Miho Shimogasa. As production occurred in Japan, Craig McCracken, the original creator of The Powerpuff Girls, was not directly involved with the project. The 52-episode series aired in Japan on TV Tokyo between July 1, 2006, and June 30, 2007. It also aired on AT-X and on Cartoon Network in Japan. An English-dubbed version produced by Ocean Group aired by Cartoon Network Philippines on their Boomerang channel in 2008. A manga of the same name ran in Shueisha's Ribon magazine between July 2006 and June 2007. Featured Crew Megumu Ishiguro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masashi Ebara Mojo Jojo Nami Miyahara Miyako Goutokuji Hideyuki Tanaka Mayor Tomoko Kaneda Peach Emiri Kato Momoko Akatsutsumi Full Cast & Crew Last Season Demashitaa!  season 1 2006 | 52 Episodes Season 1 of Powerpuff Girls Z premiered on July  1, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Powerpuff Girls Z. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors a 5 adltata 3 Maikkoum 3 minhus m 1 movie28  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}