{"link": "https://www.themoviedb.org/tv/73826?language=en", "title": "Caution, Hazardous Wife", "resume": "Nami Isayama met a man through a blind date and married him. She and her husband moved to a quiet, exclusive residential area. Nami is now a housewife and she decides to take cooking classes. She meets other housewives at the cooking class and receives tips from them, while becoming friends. Nami surmises that one of the housewives in her cooking class is the victim of domestic violence. Nami decides to save the victim by herself.", "rate": 0, "genre": ["Drama"], "cast": ["Haruka Ayase", "Ryoko Hirosue", "Tsubasa Honda", "Hidetoshi Nishijima", "Ken Ishiguro"], "character": ["Nami Isayama", "Yuri Ohara", "Kyoko Sato", "Yuki Isayama", "Keisuke Ohara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73826   Expand Caution, Hazardous Wife   (2017) User Score Overview Nami Isayama met a man through a blind date and married him. She and her husband moved to a quiet, exclusive residential area. Nami is now a housewife and she decides to take cooking classes. She meets other housewives at the cooking class and receives tips from them, while becoming friends. Nami surmises that one of the housewives in her cooking class is the victim of domestic violence. Nami decides to save the victim by herself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Ayase Nami Isayama Ryoko Hirosue Yuri Ohara Tsubasa Honda Kyoko Sato Hidetoshi Nishijima Yuki Isayama Ken Ishiguro Keisuke Ohara Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Caution, Hazardous Wife premiered on October  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Caution, Hazardous Wife. You can help by rating TV shows you've seen. Facts Original Name  奥様は、取り扱い注意 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ntv.co.jp/okusama/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 42 Maria180493 8 Elizabeth Jennings k 7 kedj09v g 3 gashtoby  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}