{"link": "https://www.themoviedb.org/tv/10420?language=en", "title": "The Whitest Kids U' Know", "resume": "The Whitest Kids U' Know is an American sketch comedy troupe and television program of the same name. The group consists of Trevor Moore, Zach Cregger, Sam Brown, Timmy Williams and Darren Trumeter, though other actors occasionally appear in their sketches. They were accepted into the HBO U.S. Comedy Arts Festival in 2006 and won the award for Best Sketch Group.", "rate": 81, "genre": ["Comedy"], "cast": ["Trevor Moore", "Timmy Williams", "Darren Trumeter", "Sam Brown", "Zach Cregger"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10420   Expand The Whitest Kids U' Know   (2007) User Score Overview The Whitest Kids U' Know is an American sketch comedy troupe and television program of the same name. The group consists of Trevor Moore, Zach Cregger, Sam Brown, Timmy Williams and Darren Trumeter, though other actors occasionally appear in their sketches. They were accepted into the HBO U.S. Comedy Arts Festival in 2006 and won the award for Best Sketch Group. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Trevor Moore Timmy Williams Darren Trumeter Sam Brown Zach Cregger Full Cast & Crew Last Season Season 5 2011 | 10 Episodes Season 5 of The Whitest Kids U' Know premiered on April 15, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2003-12-02 The Simple Life 1.9    2012-01-31 Key & Peele 7.2    2005-03-11 Wonder Showzen 7.4    2001-04-04 That's My Bush! 6.9    2013-07-09 Drunk History 7.2    2010-05-16 Check It Out! with Dr. Steve Brule 8.5    2003-08-26 Kenny vs. Spenny 7.6    1998-09-01 The Wild Thornberrys 6.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://whitestkids.com/ Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}