{"link": "https://www.themoviedb.org/tv/39351?language=en", "title": "Grimm", "resume": "After Portland homicide detective Nick Burkhardt discovers he's descended from an elite line of criminal profilers known as \"Grimms,\" he increasingly finds his responsibilities as a detective at odds with his new responsibilities as a Grimm.", "rate": 68, "genre": ["Drama", "Fantasy", "Mystery"], "cast": ["David Giuntoli", "Silas Weir Mitchell", "Bitsie Tulloch", "Russell Hornsby", "Bree Turner"], "character": ["Nick Burkhardt", "Monroe", "Juliette Silverton", "Hank Griffin", "Rosalee Calvert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39351   Expand Grimm   (2011) User Score  Play Trailer Overview After Portland homicide detective Nick Burkhardt discovers he's descended from an elite line of criminal profilers known as \"Grimms,\" he increasingly finds his responsibilities as a detective at odds with his new responsibilities as a Grimm. Featured Crew David Greenwalt Creator Jim Kouf Creator Stephen Carpenter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  35 Content Issues  1 Images Backdrops  18 Posters  25 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast David Giuntoli Nick Burkhardt Silas Weir Mitchell Monroe Bitsie Tulloch Juliette Silverton Russell Hornsby Hank Griffin Bree Turner Rosalee Calvert Full Cast & Crew Last Season Season 6 2017 | 13 Episodes Season 6 of Grimm premiered on January  6, 2017. View All Seasons Social Reviews  0 Discussions  36 Subject Status Replies Last Reply w Trubel: Happy Birthday Jacqueline Toboni! Open 0 by wonder2wonder\n      \n     Kelly's Mother Open 3 by  Katwah Stan Against Evil Open 0 by Katwah\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  18 Posters  25 Recommendations   2009-07-07 Warehouse 13 7.2    2010-07-09 Haven 7.0    2013-09-16 Sleepy Hollow 6.4    2012-05-27 Continuum 7.1    2008-09-09 Fringe 8.1    2006-09-25 Heroes 6.9    2011-06-19 Falling Skies 6.4    2011-10-23 Once Upon a Time 6.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.nbc.com/grimm/ Genres Drama Fantasy Mystery Keywords police fairy tale detective supernatural creature crime police detective homicide detective fighting supernatural Content Score 100 Yes! Looking good! Top Contributors 55 Elizabeth Jennings 47 Banana 35 niqo19 35 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}