{"link": "https://www.themoviedb.org/tv/65379?language=en", "title": "Please Love The Useless Me", "resume": "Michio is 30-years-old. She keeps looking for a job after her previous employer went bankrupt, but she is unable to find work. Michio still supports her younger boyfriend and her savings is almost gone. Then, Michio meets her ex-boss Ayumu. She was scared of Ayumu when they worked together. Ayumu now runs a tearoom which his grandmother ran. Michio decides to work part-time at Ayumu's tearoom. There, she various troubles everyday. Ayumu helps Michio, which allows her to see a different side of him that she never noticed before.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Kyoko Fukada", "Shohei Miura", "Maho Nonami", "Takehiko Ono", "Mimura"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65379   Expand Please Love The Useless Me   (2016) User Score Overview Michio is 30-years-old. She keeps looking for a job after her previous employer went bankrupt, but she is unable to find work. Michio still supports her younger boyfriend and her savings is almost gone. Then, Michio meets her ex-boss Ayumu. She was scared of Ayumu when they worked together. Ayumu now runs a tearoom which his grandmother ran. Michio decides to work part-time at Ayumu's tearoom. There, she various troubles everyday. Ayumu helps Michio, which allows her to see a different side of him that she never noticed before. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyoko Fukada Shohei Miura Maho Nonami Takehiko Ono Mimura Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Please Love The Useless Me premiered on January 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Please Love The Useless Me. You can help by rating TV shows you've seen. Facts Original Name  ダメな私に恋してください Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  46m Homepage  - Genres Comedy Drama Keywords unrequited love office romance cougars meat lovers Content Score 86 Almost there... Top Contributors t 13 taxigps 7 Elizabeth Jennings PE 7 Patrick E. Abe z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}