{"link": "https://www.themoviedb.org/tv/69194?language=en", "title": "Striking Out", "resume": "When Tara discovers her fiancé and fellow solicitor Eric has been cheating with a colleague, she leaves him and their prestigious law firm to set up her own practice specializing in family and divorce law. Tara's cases will put her in direct conflict with influential families and the legal and political establishment as well as challenging her own personal morals.", "rate": 80, "genre": ["Drama"], "cast": ["Amy Huberman", "Neil Morrissey", "Fiona O'Shaughnessy", "Rory Keenan", "Brahm Gallagher"], "character": ["Tara", "Vincent", "Meg", "Eric", "Pete"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69194   Expand Striking Out   (2017) User Score  Play Trailer Overview When Tara discovers her fiancé and fellow solicitor Eric has been cheating with a colleague, she leaves him and their prestigious law firm to set up her own practice specializing in family and divorce law. Tara's cases will put her in direct conflict with influential families and the legal and political establishment as well as challenging her own personal morals. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amy Huberman Tara Neil Morrissey Vincent Fiona O'Shaughnessy Meg Rory Keenan Eric Brahm Gallagher Pete Full Cast & Crew Current Season Season 2 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Striking Out. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  52m Homepage   http://www.rte.ie/tv/programmes/strikingout.html Genres Drama Keywords courtroom drama Content Score 93 Almost there... Top Contributors 26 Elizabeth Jennings 8 tatergator a 4 atom100 h 2 henk31  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}