{"link": "https://www.themoviedb.org/tv/46435?language=en", "title": "Robotics;Notes", "resume": "In 2019, Kaito Yashio and Akiho Senomiya are the sole members of the Robotics Club at Central Tanegashima High School in Kyushu, Japan. Kaito is a laid back student and a skilled gamer who is just trying to help Akiho, his childhood friend. She is an energetic positive-thinking girl who yearns to complete the ongoing project of the club: building a functional replica of Gunvarrel, the main robot of a once popular TV series. As they gather new members and try to assemble the robot, Kaito starts stumbling upon secret reports that might reveal a conspiracy of large proportions. Unaware of what he is actually dealing with, Kaito little by little starts discovering clues laid by the mysterious Ko Kimijima.", "rate": 73, "genre": ["Animation", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Rie Kugimiya", "Kaori Nazuka", "Ryohei Kimura", "Sora Tokui", "Yoshimasa Hosoya"], "character": ["Airi", "Frau Kōjiro", "Kaito Yashio", "Junna Daitoku", "Subaru Hidaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46435   Expand Robotics;Notes   (2012) User Score  Play Trailer Overview In 2019, Kaito Yashio and Akiho Senomiya are the sole members of the Robotics Club at Central Tanegashima High School in Kyushu, Japan. Kaito is a laid back student and a skilled gamer who is just trying to help Akiho, his childhood friend. She is an energetic positive-thinking girl who yearns to complete the ongoing project of the club: building a functional replica of Gunvarrel, the main robot of a once popular TV series. As they gather new members and try to assemble the robot, Kaito starts stumbling upon secret reports that might reveal a conspiracy of large proportions. Unaware of what he is actually dealing with, Kaito little by little starts discovering clues laid by the mysterious Ko Kimijima. Featured Crew Chiyomaru Shikura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Kugimiya Airi Kaori Nazuka Frau Kōjiro Ryohei Kimura Kaito Yashio Sora Tokui Junna Daitoku Yoshimasa Hosoya Subaru Hidaka Full Cast & Crew Last Season Season 1 2012 | 22 Episodes Season 1 of Robotics;Notes premiered on October 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  1 Recommendations   2012-10-02 Kamisama Kiss 5.3    2005-10-05 Shakugan no Shana 6.7    2009-10-02 A Certain Scientific Railgun 6.3  Facts Original Name  ロボティクス・ノーツ Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.funimation.com/shows/roboticsnotes/home Genres Animation Drama Mystery Sci-Fi & Fantasy Keywords adventure mystery robot anime school club Content Score 100 Yes! Looking good! Top Contributors 43 WillofOwn CM 17 Cherche Moi 9 Nakirasu 4 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}