{"link": "https://www.themoviedb.org/tv/31505?language=en", "title": "Iris", "resume": "Iris revolves around two friends from the 707th Special Mission Battalion recruited into a secret South Korean black ops agency known as the National Security Service. Of the pair, recruit Kim Hyun-jun begins to uncover evidence that his foggy past may not be so irrelevant to his joining of the secret organization after all. As the two friends find their loyalties tested and forge new, unlikely alliances, the journey takes them from their home country to Hungary, Japan, and China where they find themselves at the center of an international conspiracy.", "rate": 80, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lee Byung-hun", "Kim So-yeon", "Jung Joon-ho", "Kim Tae-hee", "Kim Yeong-cheol"], "character": ["Kim Hyeon-Jun", "Kim Seon-Hwa", "Jin Sa-Woo", "Choi Seung Hee", "Baek San"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31505   Expand Iris   (2009) User Score Overview Iris revolves around two friends from the 707th Special Mission Battalion recruited into a secret South Korean black ops agency known as the National Security Service. Of the pair, recruit Kim Hyun-jun begins to uncover evidence that his foggy past may not be so irrelevant to his joining of the secret organization after all. As the two friends find their loyalties tested and forge new, unlikely alliances, the journey takes them from their home country to Hungary, Japan, and China where they find themselves at the center of an international conspiracy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Byung-hun Kim Hyeon-Jun Kim So-yeon Kim Seon-Hwa Jung Joon-ho Jin Sa-Woo Kim Tae-hee Choi Seung Hee Kim Yeong-cheol Baek San Full Cast & Crew Last Season Season 1 2009 | 20 Episodes Season 1 of Iris premiered on October 14, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   2015-03-02 Acquitted 7.0    2015-04-05 Ghost in the Shell: Arise Alternative Architecture 7.3    2013-10-09 The Heirs 7.4    2014-07-06 Akame ga Kill! 7.0  Facts Original Name  아이리스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m, 70m Homepage   http://www.kbs.co.kr/drama/iris/index.html Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 34 Nightowl.Kr t 22 tmdb983464 17 Elizabeth Jennings t 8 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}