{"link": "https://www.themoviedb.org/tv/1408?language=en", "title": "House", "resume": "Dr. Gregory House, a drug-addicted, unconventional, misanthropic medical genius, leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital in New Jersey.", "rate": 82, "genre": ["Drama", "Comedy", "Mystery"], "cast": ["Hugh Laurie", "Omar Epps", "Robert Sean Leonard", "Jesse Spencer", "Peter Jacobson"], "character": ["Dr. Gregory House", "Dr. Eric Foreman", "Dr. James Wilson", "Dr. Robert Chase", "Dr. Chris Taub"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1408   Expand House   (2004) User Score  Play Trailer Overview Dr. Gregory House, a drug-addicted, unconventional, misanthropic medical genius, leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital in New Jersey. Featured Crew David Shore Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  4 Images Backdrops  69 Posters  50 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Laurie Dr. Gregory House Omar Epps Dr. Eric Foreman Robert Sean Leonard Dr. James Wilson Jesse Spencer Dr. Robert Chase Peter Jacobson Dr. Chris Taub Full Cast & Crew Last Season Season 8 2011 | 22 Episodes View All Seasons Social Reviews  1 Discussions  7 I A review by Ibraheem...  7.0 Written by  Ibraheem...  on October 29, 2017 I liked this show because House's character, but I was oblivious to most of their medical conversations.\nAn advice: Don't watch it unless you understand a lot of medical terminology. Read All Reviews Media Most Popular Videos  1 Backdrops  69 Posters  50 Recommendations   2006-10-01 Dexter 8.0    2006-09-25 Heroes 6.9    2005-09-19 How I Met Your Mother 7.4    2009-01-21 Lie to Me 7.4    2004-09-22 Lost 7.8    2001-10-02 Scrubs 7.7    2008-09-23 The Mentalist 7.3    1994-09-22 Friends 7.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.fox.com/house/index.htm Genres Drama Comedy Mystery Keywords drug addiction hospital doctor misanthropic medical drama Content Score 100 Yes! Looking good! Top Contributors 418 Marr 🇳🇱 78 Travis Bell AK 51 Avshalom Kor A 49 Antiq  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}