{"link": "https://www.themoviedb.org/tv/63114?language=en", "title": "La Señora", "resume": "In the 1920s Victoria and Ángel fall in love in a small town, northern Spain. They are two people both from a different social class, she is the daughter of a wealthy businessman and he comes from a poor family. They are so in love but social norms and circumstances of the era force them to break up. Several years later, they meet again, Victoria as a powerful businesswoman and Ángel as a priest.", "rate": 0, "genre": ["Drama"], "cast": ["Adriana Ugarte", "Rodolfo Sancho", "Roberto Enríquez", "Berta Ojea", "Ana Wagener"], "character": ["Victoria Márquez de la Vega, Marquesa de Castro", "Ángel González Ruiz", "Gonzalo López, Marqués de Castro", "Adelina", "Vicenta Ramírez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63114   Expand La Señora   (2008) User Score Overview In the 1920s Victoria and Ángel fall in love in a small town, northern Spain. They are two people both from a different social class, she is the daughter of a wealthy businessman and he comes from a poor family. They are so in love but social norms and circumstances of the era force them to break up. Several years later, they meet again, Victoria as a powerful businesswoman and Ángel as a priest. Featured Crew Virginia Yagüe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adriana Ugarte Victoria Márquez de la Vega, Marquesa de Castro Rodolfo Sancho Ángel González Ruiz Roberto Enríquez Gonzalo López, Marqués de Castro Berta Ojea Adelina Ana Wagener Vicenta Ramírez Full Cast & Crew Last Season Season 1 2008 | 13 Episodes Season 1 of La Señora premiered on March  6, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on La Señora. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  75m Homepage   http://www.rtve.es/television/la-senora/ Genres Drama Keywords romance priest 1920s Content Score 93 Almost there... Top Contributors 47 prm96 s 9 sora_sey z 5 zurman1 TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}