{"link": "https://www.themoviedb.org/tv/9279?language=en", "title": "Power Office Ladies", "resume": "Shomuni is a comedic TV drama serial based on the Japanese manga of the same name by Hiroyuki Yasuda, though much of the details have departed from the comic. Released in 1998, Shomuni was a surprise winner of the ratings war for drama serials aired in Japan between April to June, despite being projected to finish a lowly thirteenth in a survey conducted by a major TV station.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Mai Hosho", "Takahashi Yumiko", "Ken Ishiguro", "Leo Morimoto", "Atsuko Sakurai"], "character": ["Ume Maruhashi", "Rie Himukai", "Tomohiro Ukyo", "Koji Inoue", "Kana Miyashita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9279   Expand Power Office Ladies   (1998) User Score Overview Shomuni is a comedic TV drama serial based on the Japanese manga of the same name by Hiroyuki Yasuda, though much of the details have departed from the comic. Released in 1998, Shomuni was a surprise winner of the ratings war for drama serials aired in Japan between April to June, despite being projected to finish a lowly thirteenth in a survey conducted by a major TV station. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mai Hosho Ume Maruhashi Takahashi Yumiko Rie Himukai Ken Ishiguro Tomohiro Ukyo Leo Morimoto Koji Inoue Atsuko Sakurai Kana Miyashita Full Cast & Crew Last Season Season 4 2013 | 10 Episodes Season 4 of Power Office Ladies premiered on July 10, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Power Office Ladies. You can help by rating TV shows you've seen. Facts Original Name  ショムニ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors A 22 Aka75 b 8 beinasu 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}