{"link": "https://www.themoviedb.org/tv/32692?language=en", "title": "Blue Bloods", "resume": "A drama about a multi-generational family of cops dedicated to New York City law enforcement. Frank Reagan is the New York Police Commissioner and heads both the police force and the Reagan brood. He runs his department as diplomatically as he runs his family, even when dealing with the politics that plagued his unapologetically bold father, Henry, during his stint as Chief.", "rate": 68, "genre": ["Crime", "Drama"], "cast": ["Tom Selleck", "Donnie Wahlberg", "Bridget Moynahan", "Will Estes", "Len Cariou"], "character": ["Frank Reagan", "Danny Reagan", "Erin Reagan-Boyle", "Jamie Reagan", "Henry Reagan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32692   Expand Blue Bloods   (2010) User Score  Play Trailer Overview A drama about a multi-generational family of cops dedicated to New York City law enforcement. Frank Reagan is the New York Police Commissioner and heads both the police force and the Reagan brood. He runs his department as diplomatically as he runs his family, even when dealing with the politics that plagued his unapologetically bold father, Henry, during his stint as Chief. Featured Crew Robin Green Creator Mitchell Burgess Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  1 Images Backdrops  11 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Selleck Frank Reagan Donnie Wahlberg Danny Reagan Bridget Moynahan Erin Reagan-Boyle Will Estes Jamie Reagan Len Cariou Henry Reagan Full Cast & Crew Last Season Season 8 2017 | 23 Episodes Season 8 of Blue Bloods premiered on September 29, 2017. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Growing Boys Season 4 Episode 6 Open 4 by  write2topcat Under The Gun 5:9 Frank Reagan was wrong, family was right Open 5 by  write2topcat w Frank Reagan: Happy Birthday Tom Selleck! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  8 Recommendations   2010-09-20 Hawaii Five-0 6.2    2009-09-22 NCIS: Los Angeles 6.4    2014-01-08 Chicago P.D. 6.9    2012-08-13 Major Crimes 6.7    2007-06-28 Burn Notice 7.3    2012-10-10 Chicago Fire 7.1    2010-06-24 Rookie Blue 7.0    2014-09-23 NCIS: New Orleans 6.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbs.com/shows/blue_bloods/ Genres Crime Drama Keywords new york police commissioner cop drama family profession Content Score 100 Yes! Looking good! Top Contributors 376 seawolf 59 Elizabeth Jennings s 30 steelman1991 29 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}