{"link": "https://www.themoviedb.org/tv/43268?language=en", "title": "Bomb Girls", "resume": "Focusing on a group of women working in a munitions plant during World War II, this ensemble drama depicts the dangers and new experiences they face.", "rate": 67, "genre": ["Drama", "War", "Politics"], "cast": ["Meg Tilly", "Jodi Balfour", "Charlotte Hegele", "Ali Liebert", "Peter Outerbridge"], "character": ["Lorna Corbett", "Gladys Witham", "Kate Andrews", "Betty McRae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43268   Expand Bomb Girls   (2012) User Score  Play Trailer Overview Focusing on a group of women working in a munitions plant during World War II, this ensemble drama depicts the dangers and new experiences they face. Featured Crew Michael MacLennan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Meg Tilly Lorna Corbett Jodi Balfour Gladys Witham Charlotte Hegele Kate Andrews Ali Liebert Betty McRae Peter Outerbridge Full Cast & Crew Last Season Season 2 2013 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2009-11-09 Miranda 7.3  Facts Status  Ended Network Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.globaltv.com/bombgirls Genres Drama War & Politics Keywords world war ii munition working woman historical drama 1940s war women Content Score 100 Yes! Looking good! Top Contributors 33 Elizabeth Jennings 19 Marr 🇳🇱 9 Banana s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}