{"link": "https://www.themoviedb.org/tv/62703?language=en", "title": "Old Money", "resume": "A family, blessed with richness and power, is desperately seeking for a liver for their father, who wants to hand down his wealth to the one who gets the organ.", "rate": 73, "genre": ["Comedy", "Drama"], "cast": ["Udo Kier", "Sunnyi Melles", "Nicholas Ofczarek", "Edita Malovčić", "Nora von Waldstätten"], "character": ["Rauchensteiner", "Liane", "Zeno", "Tania", "Jana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62703   Expand Old Money   (2015) User Score Overview A family, blessed with richness and power, is desperately seeking for a liver for their father, who wants to hand down his wealth to the one who gets the organ. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Udo Kier Rauchensteiner Sunnyi Melles Liane Nicholas Ofczarek Zeno Edita Malovčić Tania Nora von Waldstätten Jana Full Cast & Crew Last Season Miniseries 2015 | 8 Episodes Season 1 of Old Money premiered on March 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2012-09-18 Braunschlag 8.5    2005-09-09 Pastewka 8.0  Facts Original Name  Altes Geld Status  Ended Network Certification  - Type  Miniseries Original Language  German Runtime  50m Homepage  - Genres Comedy Drama Keywords miniseries Content Score 86 Almost there... Top Contributors S 20 Samara R 8 Rebecca K 5 KSUMovieGuy 5 dariorufi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}