{"link": "https://www.themoviedb.org/tv/67535?language=en", "title": "Justice", "resume": "\"Justice\" is a 20-episodes miniseries written by Manuela Dias, with the colaboration of Mariana Mesquita, Lucas Paraizo and Roberto Vitorino. The plot follows four stories, presented on separate episodes, about people whose lives have been changed by injustice. A mother who sees her daughter getting shot on her own bathroom by her psycho-jealous boyfriend; a woman who goes to jail for a crime she didn't commit; a black girl being the only person picked by the police on an all-white-people party; and a man who accepts his wife's request of being euthanized after an accident that left her quadriplegic.", "rate": 74, "genre": ["Documentary", "Drama"], "cast": ["Débora Bloch", "Marina Ruy Barbosa", "Jesuíta Barbosa", "Adriana Esteves", "Leandra Leal"], "character": ["Elisa", "Isabela", "Vicente", "Fátima", "Kellen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67535   Expand Justice   (2016) User Score Overview \"Justice\" is a 20-episodes miniseries written by Manuela Dias, with the colaboration of Mariana Mesquita, Lucas Paraizo and Roberto Vitorino. The plot follows four stories, presented on separate episodes, about people whose lives have been changed by injustice. A mother who sees her daughter getting shot on her own bathroom by her psycho-jealous boyfriend; a woman who goes to jail for a crime she didn't commit; a black girl being the only person picked by the police on an all-white-people party; and a man who accepts his wife's request of being euthanized after an accident that left her quadriplegic. Featured Crew Manuela Dias Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Débora Bloch Elisa Marina Ruy Barbosa Isabela Jesuíta Barbosa Vicente Adriana Esteves Fátima Leandra Leal Kellen Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of Justice premiered on August 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Justice. You can help by rating TV shows you've seen. Facts Original Name  Justiça Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Portuguese Runtime  - Homepage   http://gshow.globo.com/series/justica/ Genres Documentary Drama Keywords frontier justice Content Score 93 Almost there... Top Contributors 42 Fabricioamorin28 7 alls2003 7 Banana 6 thegeerson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}