{"link": "https://www.themoviedb.org/tv/70220?language=en", "title": "The Package", "resume": "Yoon So-So works as a travel guide in France. She leads a group of tourists on a package tour. The travelers all have their own stories. San Ma-Roo joined the tour after being dumped by his girlfriend. Kim Gyung-Jae has been dating for the past 10 years. A mysterious man seems to follow Yoon So-So. Jung Yeon-Sung joined the package tour with a partner, but he will not reveal what kind of relationship they are in. Han So-Ran is a web designer and agonizes over staying single or marriage. Oh Gab-Soo is extremely stubborn. Han Book-Ja spent most of her life taking care of her husband. Na Hyun is a woman whom other people cannot guess her age.\nThey all do not want to become involved in each other's personal lives, but, while they travel together, they become closer and develop relationships.", "rate": 55, "genre": ["Drama"], "cast": ["Lee Yeon-hee", "Jung Yong-hwa", "Choi Woo-shik", "Yoon Park", "Ryu Seung-su"], "character": ["Yoon So-So", "San Ma-Roo", "Kim Gyung-Jae", "Jung Yeon-Sung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70220   Expand The Package   (2017) User Score Overview Yoon So-So works as a travel guide in France. She leads a group of tourists on a package tour. The travelers all have their own stories. San Ma-Roo joined the tour after being dumped by his girlfriend. Kim Gyung-Jae has been dating for the past 10 years. A mysterious man seems to follow Yoon So-So. Jung Yeon-Sung joined the package tour with a partner, but he will not reveal what kind of relationship they are in. Han So-Ran is a web designer and agonizes over staying single or marriage. Oh Gab-Soo is extremely stubborn. Han Book-Ja spent most of her life taking care of her husband. Na Hyun is a woman whom other people cannot guess her age. They all do not want to become involved in each other's personal lives, but, while they travel together, they become closer and develop relationships. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yeon-hee Yoon So-So Jung Yong-hwa San Ma-Roo Choi Woo-shik Kim Gyung-Jae Yoon Park Ryu Seung-su Jung Yeon-Sung Full Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of The Package premiered on October 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Package. You can help by rating TV shows you've seen. Facts Original Name  더 패키지 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors M 33 Maria180493 7 sansalayne 3 kangtahu j 3 joeyzhou  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}