{"link": "https://www.themoviedb.org/tv/18347?language=en", "title": "Community", "resume": "Follow the lives of a group of students at what is possibly the world’s worst community college in the fictional locale of Greendale, Colorado.", "rate": 79, "genre": ["Comedy"], "cast": ["Alison Brie", "Joel McHale", "Gillian Jacobs", "Danny Pudi", "Paget Brewster"], "character": ["Annie Edison", "Jeff Winger", "Britta Perry", "Abed Nadir", "Francesca 'Frankie' Dart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18347   Expand Community   (2009) User Score  Play Trailer Overview Follow the lives of a group of students at what is possibly the world’s worst community college in the fictional locale of Greendale, Colorado. Featured Crew Dan Harmon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  1 Images Backdrops  24 Posters  22 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  10 Top Billed Cast Alison Brie Annie Edison Joel McHale Jeff Winger Gillian Jacobs Britta Perry Danny Pudi Abed Nadir Paget Brewster Francesca 'Frankie' Dart Full Cast & Crew Last Season Season 6 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply w Jeff: Happy Birthday Joel McHale! Open 0 by wonder2wonder\n      \n     w Britta Perry: Happy Birthday Gillian Jacobs! Open 0 by wonder2wonder\n      \n     w Pierce Hawthorne: Happy Birthday Chevy Chase! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  11 Backdrops  24 Posters  22 Recommendations   2003-11-02 Arrested Development 8.2    2009-04-09 Parks and Recreation 7.9    2005-08-04 It's Always Sunny in Philadelphia 8.2    2006-10-11 30 Rock 7.1    2001-10-02 Scrubs 7.7    2005-03-24 The Office 8.0    2006-02-03 The IT Crowd 8.2    1989-07-05 Seinfeld 8.2  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/community-show/ Genres Comedy Keywords parody group of friends community college sitcom adult in college Content Score 100 Yes! Looking good! Top Contributors b 603 brewtown 58 dbowman 44 seawolf 26 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}