{"link": "https://www.themoviedb.org/tv/658?language=en", "title": "The Singing Detective", "resume": "The Singing Detective is a BBC television serial drama written by Dennis Potter, which stars Michael Gambon, and was directed by Jon Amiel. The six episodes were \"Skin\", \"Heat\", \"Lovely Days\", \"Clues\", \"Pitter Patter\" and \"Who Done It\".\nThe serial was broadcast in the United Kingdom on BBC1 in 1986 on Sunday nights at 8pm from 16 November to 21 December with later PBS and cable television showings in the United States. It won a Peabody Award in 1989. It ranks 20th on the British Film Institute's list of the 100 Greatest British Television Programmes, as voted by industry professionals in 2000. It was included in the 1992 Dennis Potter retrospective at the Museum of Television & Radio and became a permanent addition to the Museum's collections in New York and Los Angeles. There was co-production funding from the Australian Broadcasting Corporation. It was released on DVD in the US on 15 April 2003 and in the UK on 8 March 2004.", "rate": 81, "genre": ["Drama"], "cast": ["Michael Gambon", "Patrick Malahide", "Janet Suzman", "Alison Steadman", "Joanne Whalley"], "character": ["Philip Marlow", "Mark Binney", "Nurse Mills"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 658   Expand The Singing Detective   (1986) User Score Overview The Singing Detective is a BBC television serial drama written by Dennis Potter, which stars Michael Gambon, and was directed by Jon Amiel. The six episodes were \"Skin\", \"Heat\", \"Lovely Days\", \"Clues\", \"Pitter Patter\" and \"Who Done It\". The serial was broadcast in the United Kingdom on BBC1 in 1986 on Sunday nights at 8pm from 16 November to 21 December with later PBS and cable television showings in the United States. It won a Peabody Award in 1989. It ranks 20th on the British Film Institute's list of the 100 Greatest British Television Programmes, as voted by industry professionals in 2000. It was included in the 1992 Dennis Potter retrospective at the Museum of Television & Radio and became a permanent addition to the Museum's collections in New York and Los Angeles. There was co-production funding from the Australian Broadcasting Corporation. It was released on DVD in the US on 15 April 2003 and in the UK on 8 March 2004. Featured Crew Dennis Potter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Gambon Philip Marlow Patrick Malahide Mark Binney Janet Suzman Alison Steadman Joanne Whalley Nurse Mills Full Cast & Crew Last Season Season 1 1986 | 6 Episodes Season 1 of The Singing Detective premiered on November 16, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2009-11-17 Merry Madagascar 6.2    1973-10-31 The World at War 8.1    2003-05-18 State of Play 7.9    1990-11-18 House of Cards 8.3    2001-09-12 The Blue Planet 8.4    1981-09-08 Only Fools and Horses 8.2    1975-09-19 Fawlty Towers 8.1    1983-06-15 Blackadder 7.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  300m, 70m Homepage  - Genres Drama Keywords sex nurse music detective hallucination surreal musical song noir miniseries hospital psychiatrist english countryside mystery writer 1940s novel Content Score 100 Yes! Looking good! Top Contributors TB 59 TMDb Bot O 15 Ozbourne 8 xyzl 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}