{"link": "https://www.themoviedb.org/tv/5315?language=en", "title": "The New Adventures of Robin Hood", "resume": "The New Adventures of Robin Hood is a 1997-1998 live action TV series on Turner Network Television. It was filmed in Vilnius, Lithuania and produced and distributed by Dune Productions, M6, and Warner Bros. International.\nThe tone of the series resembled its contemporaries Hercules: The Legendary Journeys and Xena: Warrior Princess. The premiere episode aired immediately after an episode of WCW Monday Nitro. A unique promotional effort took place between the two, with the Nitro main event -- Hulk Hogan vs The Giant—not beginning until two minutes before the show ended and then continuing and being broadcast in lieu of standard commercial breaks.", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Christie Lee Woods", "John Bradley", "Anna Galvin", "Lucy Punch", "Hugh Dancy"], "character": ["Queen Stephanie", "Kyle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5315   Expand The New Adventures of Robin Hood   (1997) User Score Overview The New Adventures of Robin Hood is a 1997-1998 live action TV series on Turner Network Television. It was filmed in Vilnius, Lithuania and produced and distributed by Dune Productions, M6, and Warner Bros. International. The tone of the series resembled its contemporaries Hercules: The Legendary Journeys and Xena: Warrior Princess. The premiere episode aired immediately after an episode of WCW Monday Nitro. A unique promotional effort took place between the two, with the Nitro main event -- Hulk Hogan vs The Giant—not beginning until two minutes before the show ended and then continuing and being broadcast in lieu of standard commercial breaks. Featured Crew Sandra Weintraub Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christie Lee Woods John Bradley Anna Galvin Lucy Punch Queen Stephanie Hugh Dancy Kyle Full Cast & Crew Last Season Season 3 1998 | 13 Episodes Season 3 of The New Adventures of Robin Hood premiered on September 20, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The New Adventures of Robin Hood. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors w 4 waterhorse TD 4 Team DASF s 3 speedycars 3 shadowfurious  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}