{"link": "https://www.themoviedb.org/tv/45516?language=en", "title": "Here Comes Honey Boo Boo", "resume": "Alana and her mother, June, have been become two of the more familiar Toddlers & Tiaras faces after a 2012 episode showed Alana drinking go-go juice before a competition. The drink, which worked her into a frenzy in front of the cameras, is a combination of Red Bull and Mountain Dew and had the pair working the talk show circuit earlier in the year to defend their caffeine consumption. Nicknamed Honey Boo Boo, Alana and her family, mother June, dad Sugar Bear and sisters Lauryn, Jessica and Anna, will be the focus of the series when the youngest daughter isn't competing in pageants.", "rate": 19, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45516   Expand Here Comes Honey Boo Boo   (2012) User Score Overview Alana and her mother, June, have been become two of the more familiar Toddlers & Tiaras faces after a 2012 episode showed Alana drinking go-go juice before a competition. The drink, which worked her into a frenzy in front of the cameras, is a combination of Red Bull and Mountain Dew and had the pair working the talk show circuit earlier in the year to defend their caffeine consumption. Nicknamed Honey Boo Boo, Alana and her family, mother June, dad Sugar Bear and sisters Lauryn, Jessica and Anna, will be the focus of the series when the youngest daughter isn't competing in pageants. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season The Lost Episodes 2017 | 4 Episodes Season 5 of Here Comes Honey Boo Boo premiered on April 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2009-03-02 Late Night with Jimmy Fallon 6.0    2006-05-31 The Hills 2.7    2014-12-02 Late Night with Seth Meyers 5.6    2007-07-16 Chelsea Lately 4.3    1969-09-13 Scooby-Doo, Where Are You! 7.5    2003-12-03 Extreme Makeover: Home Edition 4.6    2011-07-17 Bar Rescue 8.1    1993-09-13 Late Night with Conan O'Brien 7.3  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors s 10 sora_sey TB 10 TMDb Bot f 2 fireyred 1 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}