{"link": "https://www.themoviedb.org/tv/31665?language=en", "title": "School Rumble", "resume": "While there is a decided lack of rumble in School Rumble, there’s more hilarious humdingers than any single dinger can hum… Look that one up! And while there is a truck full of pigs, a giraffe, flying saucers and crazy dream sequences, none of that’s even close to what this show’s about. (Though I would probably watch that show, too!)\nHere’s what you need to know: Sophomore cutie Tenma is completely crushed on classmate Karasuma past the point of freakin’ out. Tough guy Harima, with his own delinquent style of freak, has a long-standing crush on Tenma… And Karasuma? Can you say clueless? He’s pretty much all about the curry. Mmm… Curry!\nWith enough tangled triangles for an entire semester of geometry, just keep in mind… School Rumble – The absolutely funniest show you’ll ever see that’s not about anything that rumbles… Ever!", "rate": 91, "genre": ["Animation", "Comedy"], "cast": ["Ami Koshimizu", "Yui Horie", "Hitomi Nabatame", "Hiroki Takahashi", "Kaori Shimizu"], "character": ["Tenma Tsukamoto", "Eri Sawachika", "Mikoto Suou", "Kenji Harima", "Akira Takano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31665   Expand School Rumble   (2004) User Score Overview While there is a decided lack of rumble in School Rumble, there’s more hilarious humdingers than any single dinger can hum… Look that one up! And while there is a truck full of pigs, a giraffe, flying saucers and crazy dream sequences, none of that’s even close to what this show’s about. (Though I would probably watch that show, too!) Here’s what you need to know: Sophomore cutie Tenma is completely crushed on classmate Karasuma past the point of freakin’ out. Tough guy Harima, with his own delinquent style of freak, has a long-standing crush on Tenma… And Karasuma? Can you say clueless? He’s pretty much all about the curry. Mmm… Curry! With enough tangled triangles for an entire semester of geometry, just keep in mind… School Rumble – The absolutely funniest show you’ll ever see that’s not about anything that rumbles… Ever! Featured Crew Jin Kobayashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ami Koshimizu Tenma Tsukamoto Yui Horie Eri Sawachika Hitomi Nabatame Mikoto Suou Hiroki Takahashi Kenji Harima Kaori Shimizu Akira Takano Full Cast & Crew Last Season Season 2 2006 | 26 Episodes Season 2 of School Rumble premiered on April  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   2005-01-06 Negima! Magister Negi Magi 6.7    Shuffle! 6.5    2006-10-04 Negima!? Magister Negi Magi 5.9    2002-04-10 Ai Yori Aoshi 5.9    2007-04-01 My Bride is a Mermaid 7.8    2011-10-08 Ben-To 7.2    2012-04-05 Sankarea: Undying Love 7.0    2002-04-02 Chobits 6.9  Facts Original Name  スクールランブル Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/school-rumble/home Genres Animation Comedy Keywords slice of life school anime Content Score 93 Almost there... Top Contributors 38 WillofOwn p 8 psy4trik CM 5 Cherche Moi m 4 manmanjj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}