{"link": "https://www.themoviedb.org/tv/10548?language=en", "title": "Transformers: Animated", "resume": "Transformers Animated is an Japanese/American animated television series based on the Transformers toy line. The series debuted on Cartoon Network on December 26, 2007, and has been shown on NickToons in the UK since February 2008. It is produced by Cartoon Network Studios and animated by The Answer Studio, MOOK DLE., and Studio 4°C . The series has 42 episodes across three seasons. The European Jetix began to air the series on September 10, 2008. The series began its broadcast in Japan on April 3, 2010, on both TV Aichi and TV Tokyo. The Japanese version of the cartoon was slightly rewritten to tie into Michael Bay's Transformers trilogy.\nThe show's continuity is separate from any other previous Transformers series, despite using footage from the first series in its first episode as a historical film. Despite being a Cartoon Network original series, the show was aired on Nicktoons in the UK, Jetix/Disney XD in the rest of Europe and finally, back in the states on The Hub in high definition.", "rate": 73, "genre": ["Action", "Adventure", "Animation", "Family", "Sci-Fi", "Fantasy"], "cast": ["Tom Kenny", "Lance Henriksen", "Phil LaMarr", "Tara Strong", "David Kaye"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10548   Expand Transformers: Animated   (2007) User Score Overview Transformers Animated is an Japanese/American animated television series based on the Transformers toy line. The series debuted on Cartoon Network on December 26, 2007, and has been shown on NickToons in the UK since February 2008. It is produced by Cartoon Network Studios and animated by The Answer Studio, MOOK DLE., and Studio 4°C . The series has 42 episodes across three seasons. The European Jetix began to air the series on September 10, 2008. The series began its broadcast in Japan on April 3, 2010, on both TV Aichi and TV Tokyo. The Japanese version of the cartoon was slightly rewritten to tie into Michael Bay's Transformers trilogy. The show's continuity is separate from any other previous Transformers series, despite using footage from the first series in its first episode as a historical film. Despite being a Cartoon Network original series, the show was aired on Nicktoons in the UK, Jetix/Disney XD in the rest of Europe and finally, back in the states on The Hub in high definition. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Kenny Lance Henriksen Phil LaMarr Tara Strong David Kaye Full Cast & Crew Last Season Season 3 2009 | 13 Episodes Season 3 of Transformers: Animated premiered on March 14, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   1975-09-06 The Tom and Jerry Show 7.6    2010-11-26 Transformers: Prime 7.4    1984-10-06 The Transformers 7.4    1960-10-11 The Bugs Bunny Show 7.8    1960-09-30 The Flintstones 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 30m Homepage   http://www.cartoonnetwork.com/tv_shows/transformersa/index.html Genres Action & Adventure Animation Family Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors CM 10 Cherche Moi c 9 cbuehl 5 Atanas D 3 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}