{"link": "https://www.themoviedb.org/tv/23?language=en", "title": "Tugs", "resume": "Tugs is a British children's television series first broadcast in 1988. It was created by the producers of Thomas the Tank Engine & Friends, Robert D. Cardona and David Mitton. The series dealt with the adventures of two anthropomorphized tugboat fleets, the Star Fleet and the Z-Stacks, who compete against each other in the fictional Bigg City Port. The series was set in the Roaring Twenties, and was produced by Tugs Ltd., for TVS and Clearwater Features Ltd. Music was composed by Junior Campbell and Mike O'Donnell, who also wrote the music for Thomas the Tank Engine and Friends.\nDue to the bankruptcy of production company TVS, the series did not continue production past 13 episodes. Following the initial airing of the series throughout 1988, television rights were sold to an unknown party, while all models and sets from the series sold to Britt Allcroft. Modified set props and tugboat models were used in Thomas the Tank Engine and Friends from 1991 onwards, with footage from the original program being heavily dubbed and edited for use in American children's series Salty's Lighthouse. Mitton returned to working with Thomas & Friends in 1991, while Cardona would go on to direct Theodore Tugboat, a similarly natured animated series set in Canada. All thirteen episodes of the show were released on VHS between 1988 and 1993.", "rate": 100, "genre": [], "cast": ["Patrick Allen", "Timothy Bateson", "Shaun Prendergast", "John Baddeley", "Chris Tulloch"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23   Expand Tugs   (1988) User Score Overview Tugs is a British children's television series first broadcast in 1988. It was created by the producers of Thomas the Tank Engine & Friends, Robert D. Cardona and David Mitton. The series dealt with the adventures of two anthropomorphized tugboat fleets, the Star Fleet and the Z-Stacks, who compete against each other in the fictional Bigg City Port. The series was set in the Roaring Twenties, and was produced by Tugs Ltd., for TVS and Clearwater Features Ltd. Music was composed by Junior Campbell and Mike O'Donnell, who also wrote the music for Thomas the Tank Engine and Friends. Due to the bankruptcy of production company TVS, the series did not continue production past 13 episodes. Following the initial airing of the series throughout 1988, television rights were sold to an unknown party, while all models and sets from the series sold to Britt Allcroft. Modified set props and tugboat models were used in Thomas the Tank Engine and Friends from 1991 onwards, with footage from the original program being heavily dubbed and edited for use in American children's series Salty's Lighthouse. Mitton returned to working with Thomas & Friends in 1991, while Cardona would go on to direct Theodore Tugboat, a similarly natured animated series set in Canada. All thirteen episodes of the show were released on VHS between 1988 and 1993. Featured Crew Robert D. Cardona Creator David Mitton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Allen Timothy Bateson Shaun Prendergast John Baddeley Chris Tulloch Full Cast & Crew Last Season Season 1 1989 | 13 Episodes Season 1 of Tugs premiered on April  4, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Tugs. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 ash77ah  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}