{"link": "https://www.themoviedb.org/tv/5909?language=en", "title": "My Own Worst Enemy", "resume": "My Own Worst Enemy is an American television drama that aired on NBC in 2008. It premiered on October 13 and ended on December 15 after 9 episodes. The series was produced by Universal Media Studios. Jason Smilovic was the executive producer; David Semel was the director and executive producer. The final episode ended with a cliff-hanger, and the major plot lines ended without resolution.\nThe series followed the life of American secret agent Edward Albright and his cover, Henry Spivey, who had no knowledge of his double life. Albright, played by Christian Slater, was implanted with a chip allowing his handlers to physically switch Albright's personality to that of his cover. However, in the pilot episode, there was a malfunction which caused Albright's personalities to switch at random, revealing his secret life to his alias. Henry was then thrown into the highly dangerous life of Edward, with no real way for the two to communicate except through short cell phone video messages.\nGeneral Motors was a promotional sponsor of the show, and the new SUV model Chevrolet Traverse, along with the 2010 Chevrolet Camaro, appeared as cars for the program's characters via a product placement agreement.", "rate": 70, "genre": ["Drama"], "cast": ["Alfre Woodard", "Saffron Burrows", "Mädchen Amick", "Mike O'Malley", "Christian Slater"], "character": ["Mavis Heller", "Dr. Norah Skinner", "Angie Spivey", "Tom Grady / Raymond Carter", "Henry Spivey / Edward Albright"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5909   Expand My Own Worst Enemy   (2008) User Score Overview My Own Worst Enemy is an American television drama that aired on NBC in 2008. It premiered on October 13 and ended on December 15 after 9 episodes. The series was produced by Universal Media Studios. Jason Smilovic was the executive producer; David Semel was the director and executive producer. The final episode ended with a cliff-hanger, and the major plot lines ended without resolution. The series followed the life of American secret agent Edward Albright and his cover, Henry Spivey, who had no knowledge of his double life. Albright, played by Christian Slater, was implanted with a chip allowing his handlers to physically switch Albright's personality to that of his cover. However, in the pilot episode, there was a malfunction which caused Albright's personalities to switch at random, revealing his secret life to his alias. Henry was then thrown into the highly dangerous life of Edward, with no real way for the two to communicate except through short cell phone video messages. General Motors was a promotional sponsor of the show, and the new SUV model Chevrolet Traverse, along with the 2010 Chevrolet Camaro, appeared as cars for the program's characters via a product placement agreement. Featured Crew Jason Smilovic Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alfre Woodard Mavis Heller Saffron Burrows Dr. Norah Skinner Mädchen Amick Angie Spivey Mike O'Malley Tom Grady / Raymond Carter Christian Slater Henry Spivey / Edward Albright Full Cast & Crew Last Season Season 1 2008 | 9 Episodes Season 1 of My Own Worst Enemy premiered on October 13, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply R Cancelled Open 0 by Rickers\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2009-09-22 The Forgotten 6.2    2008-10-09 Eleventh Hour 6.5    2004-10-19 The Biggest Loser 4.6    2014-11-13 Babylon 7.1    2002-11-14 Wire in the Blood 7.5    2005-12-04 Sleeper Cell 7.4    2013-02-14 Zero Hour 4.9    2010-08-27 The Booth at the End 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 40m Homepage  - Genres Drama Keywords spy secret agent alter ego Content Score 93 Almost there... Top Contributors 11 lineker 7 Banana 6 galani s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}