{"link": "https://www.themoviedb.org/tv/1767?language=en", "title": "Bobby's World", "resume": "Bobby Generic lives in a typical suburban neighborhood and uses his overactive imagination to discover a world of daring adventure, incredible wonder and lots of laughs — all in pint-sized perspective.", "rate": 80, "genre": ["Animation"], "cast": ["Gary Owens", "Gail Matthius", "Debi Derryberry", "Edie McClurg", "Christine Ebersole"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1767   Expand Bobby's World   (1990) User Score Overview Bobby Generic lives in a typical suburban neighborhood and uses his overactive imagination to discover a world of daring adventure, incredible wonder and lots of laughs — all in pint-sized perspective. Featured Crew Howie Mandel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Owens Gail Matthius Debi Derryberry Edie McClurg Christine Ebersole Full Cast & Crew Last Season Season 7 1997 | 10 Episodes Season 7 of Bobby's World premiered on September  6, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1961-01-30 The Yogi Bear Show 6.8    Where in the World Is Carmen Sandiego? 8.0    1992-09-11 Eek! The Cat 6.8    1984-11-05 Muppet Babies 7.2    1986-09-15 Rambo 5.7    1980-11-08 Richie Rich 5.8    1964-09-18 Jonny Quest 7.9    1990-09-14 Tiny Toon Adventures 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bobbysworld.net/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 Robson Guedes Vieira 4 Rafaelasauani 2 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}