{"link": "https://www.themoviedb.org/tv/14880?language=en", "title": "Little Britain USA", "resume": "Little Britain USA is an American spin-off-continuation of British sketch show, Little Britain, produced and aired by HBO.\nAs in the British series, Matt Lucas and David Walliams play the majority of the characters: originals such as Lou and Andy, Daffyd Thomas, Sebastian Love, Marjorie Dawes and Vicky Pollard, as well as new characters not previously seen in the British series.\nThe first series started filming in March 2008 in Wilmington, North Carolina. HBO showed the first episode of the season in the United States on September 28, 2008; The Movie Network broadcast it in Canada the same day, followed by BBC One on October 3 in the UK.\nNew guest-stars include Rachael Harris, Bob Stephenson, Paul Rudd, Hilarie Burton, Vivica A. Fox, and Sting. Michael Patrick Jann served as executive producer of the series and directed the majority of the shows. David Schwimmer directed studio-based segments of the show. Rosie O'Donnell also makes an appearance in a \"Fat Fighters\" segment.\nThe series was released on DVD in the UK by 2entertain in August 2009.", "rate": 66, "genre": ["Comedy"], "cast": ["David Walliams", "Matt Lucas", "Tom Baker", "Geraldine James", "Lorna Scott"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14880   Expand Little Britain USA   (2008) User Score Overview Little Britain USA is an American spin-off-continuation of British sketch show, Little Britain, produced and aired by HBO. As in the British series, Matt Lucas and David Walliams play the majority of the characters: originals such as Lou and Andy, Daffyd Thomas, Sebastian Love, Marjorie Dawes and Vicky Pollard, as well as new characters not previously seen in the British series. The first series started filming in March 2008 in Wilmington, North Carolina. HBO showed the first episode of the season in the United States on September 28, 2008; The Movie Network broadcast it in Canada the same day, followed by BBC One on October 3 in the UK. New guest-stars include Rachael Harris, Bob Stephenson, Paul Rudd, Hilarie Burton, Vivica A. Fox, and Sting. Michael Patrick Jann served as executive producer of the series and directed the majority of the shows. David Schwimmer directed studio-based segments of the show. Rosie O'Donnell also makes an appearance in a \"Fat Fighters\" segment. The series was released on DVD in the UK by 2entertain in August 2009. Featured Crew David Walliams Creator Matt Lucas Creator Simon Fuller Creator Benjamin Silverman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Walliams Matt Lucas Tom Baker Geraldine James Lorna Scott Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of Little Britain USA premiered on September 28, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  3 Recommendations   2003-09-16 Little Britain 7.2    2013-08-16 Big School 6.3    2001-02-26 Two Pints of Lager and a Packet of Crisps 7.0    2011-05-11 Angry Boys 6.5    1985-03-18 Neighbours 5.4    2004-02-16 The Catherine Tate Show 5.5    2010-12-25 Come Fly With Me 6.6    1987-09-13 The New Statesman 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hbo.com/events/littlebritainusa/ Genres Comedy Keywords sketch comedy Content Score 93 Almost there... Top Contributors 5 t0by 5 kcdh m 4 misak0007 b 4 bBop87  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}