{"link": "https://www.themoviedb.org/tv/78295?language=en", "title": "The Rich Son", "resume": "Lee Gwang Jae is the son of a rich family who is reckless and immature. His father dies and leaves behind large debts. Gwang Jae promises to pay off his debt for his father's honor, but it's not as easy as he thinks. Kim Young Ha supports Gwang Jae with her positive personality and love, giving encouragement to him whenever he needs it.", "rate": 0, "genre": ["Family", "Drama"], "cast": ["Kim Ji-hun", "Kim Joo-Hyun", "Lee Kyu-han", "Hong Soo-hyun", "Kang Nam-Gil"], "character": ["Lee Gwang-Jae", "Kim Young-Ha", "Nam Tae-Il", "Kim Kyung-Ha", "Lee Gye-Dong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78295   Expand The Rich Son   (2018) User Score Overview Lee Gwang Jae is the son of a rich family who is reckless and immature. His father dies and leaves behind large debts. Gwang Jae promises to pay off his debt for his father's honor, but it's not as easy as he thinks. Kim Young Ha supports Gwang Jae with her positive personality and love, giving encouragement to him whenever he needs it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Ji-hun Lee Gwang-Jae Kim Joo-Hyun Kim Young-Ha Lee Kyu-han Nam Tae-Il Hong Soo-hyun Kim Kyung-Ha Kang Nam-Gil Lee Gye-Dong Full Cast & Crew Current Season Season 1 2018 | 16 Episodes Season 1 of The Rich Son premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Rich Son. You can help by rating TV shows you've seen. Facts Original Name  부잣집 아들 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.imbc.com/broad/tv/drama/richboy/ Genres Family Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 28 Maria180493 16 Charles j 5 jimy 3 JIMMY060156  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}