{"link": "https://www.themoviedb.org/tv/4217?language=en", "title": "Zoboomafoo", "resume": "Zoboomafoo is an American children's television series that aired from January 25, 1999, to April 28, 2001, and is still shown today in syndication depending on the area, and it is regularly shown on PBS Kids Sprout. A total of 65 episodes were aired. A creation of the Kratt Brothers, it features a talking Coquerel's Sifaka, a type of lemur, named Zoboomafoo, or Zoboo for short, and a collection of repeat animal guests. Every episode begins with the Kratt brothers in \"Animal Junction\", a peculiar place in which the rules of nature change and wild animals come to visit and play. After January 16, 2004, the show was pulled from its weekday airing on most PBS stations, though some continue to air the show.", "rate": 39, "genre": ["Comedy"], "cast": ["Chris Kratt", "Martin Kratt", "Gord Robertson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4217   Expand Zoboomafoo   (1999) User Score Overview Zoboomafoo is an American children's television series that aired from January 25, 1999, to April 28, 2001, and is still shown today in syndication depending on the area, and it is regularly shown on PBS Kids Sprout. A total of 65 episodes were aired. A creation of the Kratt Brothers, it features a talking Coquerel's Sifaka, a type of lemur, named Zoboomafoo, or Zoboo for short, and a collection of repeat animal guests. Every episode begins with the Kratt brothers in \"Animal Junction\", a peculiar place in which the rules of nature change and wild animals come to visit and play. After January 16, 2004, the show was pulled from its weekday airing on most PBS stations, though some continue to air the show. Featured Crew Chris Kratt Creator Martin Kratt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Kratt Martin Kratt Gord Robertson Full Cast & Crew Last Season Season 2 — | 25 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1994-10-30 Aaahh!!! Real Monsters 6.4    1997-09-16 Cow and Chicken 6.4    1997-09-13 Recess 6.8    1997-07-07 Johnny Bravo 6.6    1993-09-18 Rocko's Modern Life 7.7    1999-01-04 Ed, Edd n Eddy 7.0    2001-03-30 The Fairly OddParents 6.7    2000-09-09 Jackie Chan Adventures 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  29m, 30m Homepage   http://www.pbs.org/zoboo Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 3 Limnery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}