{"link": "https://www.themoviedb.org/tv/69871?language=en", "title": "Case", "resume": "A young ballerina is found hanged on a theatre stage in Reykjavik. The case is closed as suicide but two lawyers and a detective believe dark forces are at play in this challenging Icelandic thriller.", "rate": 73, "genre": ["Crime", "Mystery"], "cast": ["Elma Stefania Agustsdottir", "Bergur Þór Ingólfsson", "Magnús Jónsson", "Steinunn Ólína Þorsteinsdóttir", "Jóhanna Vigdís Arnardóttir"], "character": ["Ilmur", "Jónas", "Logi", "Gabríela", "Brynhildur"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69871   Expand Case   (2015) User Score Overview A young ballerina is found hanged on a theatre stage in Reykjavik. The case is closed as suicide but two lawyers and a detective believe dark forces are at play in this challenging Icelandic thriller. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elma Stefania Agustsdottir Ilmur Bergur Þór Ingólfsson Jónas Magnús Jónsson Logi Steinunn Ólína Þorsteinsdóttir Gabríela Jóhanna Vigdís Arnardóttir Brynhildur Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of Case premiered on October 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Case. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Icelandic Runtime  - Homepage  - Genres Crime Mystery Keywords nordic noir Content Score 86 Almost there... Top Contributors 16 Steve 10 Eramik 4 Elizabeth Jennings 3 ernie77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}