{"link": "https://www.themoviedb.org/tv/11203?language=en", "title": "Doctor Zhivago", "resume": "Doctor Zhivago is a 2002 British television miniseries directed by Giacomo Campiotti and starring Hans Matheson, Keira Knightley and Sam Neill. The teleplay by Andrew Davies is based on the 1957 novel of the same title by Boris Pasternak.\nThe serial is the second English-language screen adaptation of the book, following the 1965 feature film. It was produced by Granada Television, with co-funding from the American PBS station WGBH Boston and the German company Evision. It was first broadcast on ITV in the United Kingdom, beginning on 24 November 2002. In the United States, it aired as part of Masterpiece Theatre on 2 and 9 November 2003.", "rate": 68, "genre": ["Drama"], "cast": ["Hans Matheson", "Keira Knightley", "Sam Neill", "Bill Paterson", "Celia Imrie"], "character": ["Yuri Zhivago", "Lara Antipova", "Victor Komarovsky", "Alexander Gromyko", "Anna Gromyko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11203   Expand Doctor Zhivago   (2002) User Score  Play Trailer Overview Doctor Zhivago is a 2002 British television miniseries directed by Giacomo Campiotti and starring Hans Matheson, Keira Knightley and Sam Neill. The teleplay by Andrew Davies is based on the 1957 novel of the same title by Boris Pasternak. The serial is the second English-language screen adaptation of the book, following the 1965 feature film. It was produced by Granada Television, with co-funding from the American PBS station WGBH Boston and the German company Evision. It was first broadcast on ITV in the United Kingdom, beginning on 24 November 2002. In the United States, it aired as part of Masterpiece Theatre on 2 and 9 November 2003. Featured Crew Andrew Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hans Matheson Yuri Zhivago Keira Knightley Lara Antipova Sam Neill Victor Komarovsky Bill Paterson Alexander Gromyko Celia Imrie Anna Gromyko Full Cast & Crew Last Season Season 1 2002 | 3 Episodes Season 1 of Doctor Zhivago premiered on November 24, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2015-05-30 The Secret Life of Marilyn Monroe 6.4    1989-11-05 Bangkok Hilton 6.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  75m Homepage  - Genres Drama Keywords rape civil war based on novel or book russia remake miniseries period drama extramarital affair 1910s Content Score 100 Yes! Looking good! Top Contributors TB 36 TMDb Bot 10 Banana w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}