{"link": "https://www.themoviedb.org/tv/132?language=en", "title": "Fantastic Four: World's Greatest Heroes", "resume": "Fantastic Four: World's Greatest Heroes is an animated television series based on the Marvel Comics' Fantastic Four comic book series and the movie itself. The series is the team's fourth foray into animation, and combines two-dimensional anime-style art and three-dimensional computer animation produced by the France-based animation company MoonScoop, and is also produced by MoonScoop division Taffy Entertainment. All in collaboration with Cartoon Network. In the United States, the show suffered an erratic airing schedule on Cartoon Network, having premiered as part of Toonami on September 2, 2006 but only running for 8 of the season's 26 episodes before being pulled without explanation. It returned to the network starting June 9, 2007, shortly before the release of the film Fantastic Four: Rise of the Silver Surfer, but again, only nine further episodes were aired, leaving nine installments unaired in the USA. The show aired on Boomerang for a brief time before moving to the Nicktoons Network to air the final episodes. Episodes unaired in the US began airing on the Nicktoons Network in the winter of 2009.\nIt is distributed in the USA by 20th Century Fox and 20th Television, and in other countries by Warner Bros. Television Distribution.", "rate": 68, "genre": ["Animation", "Action", "Adventure"], "cast": ["Brian Dobson", "Lara Gilchrist", "Christopher Jacot", "Hiro Kanagawa"], "character": ["Ben Grimm (voice)", "Invisible Woman (voice)", "Johnny Storm (voice)", "Mr. Fantastic (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 132   Expand Fantastic Four: World's Greatest Heroes   (2006) User Score Overview Fantastic Four: World's Greatest Heroes is an animated television series based on the Marvel Comics' Fantastic Four comic book series and the movie itself. The series is the team's fourth foray into animation, and combines two-dimensional anime-style art and three-dimensional computer animation produced by the France-based animation company MoonScoop, and is also produced by MoonScoop division Taffy Entertainment. All in collaboration with Cartoon Network. In the United States, the show suffered an erratic airing schedule on Cartoon Network, having premiered as part of Toonami on September 2, 2006 but only running for 8 of the season's 26 episodes before being pulled without explanation. It returned to the network starting June 9, 2007, shortly before the release of the film Fantastic Four: Rise of the Silver Surfer, but again, only nine further episodes were aired, leaving nine installments unaired in the USA. The show aired on Boomerang for a brief time before moving to the Nicktoons Network to air the final episodes. Episodes unaired in the US began airing on the Nicktoons Network in the winter of 2009. It is distributed in the USA by 20th Century Fox and 20th Television, and in other countries by Warner Bros. Television Distribution. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Dobson Ben Grimm (voice) Lara Gilchrist Invisible Woman (voice) Christopher Jacot Johnny Storm (voice) Hiro Kanagawa Mr. Fantastic (voice) Full Cast & Crew Last Season Season 1 2006 | 26 Episodes Season 1 of Fantastic Four: World's Greatest Heroes premiered on September  2, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations   1994-09-24 Fantastic Four 6.7    2011-11-11 Green Lantern: The Animated Series 7.2    1994-09-10 The Tick 7.7    2003-07-11 Spider-Man: The New Animated Series 6.5    1997-09-20 The New Batman Adventures 7.7    2008-04-18 Ben 10: Alien Force 6.1    1981-09-12 Spider-Man and His Amazing Friends 6.7    2009-01-23 Wolverine and the X-Men 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Action & Adventure Keywords superhero based on comic fantastic four Content Score 86 Almost there... Top Contributors 25 Banana w 3 webmaster 3 Sergiojamon j 3 jco666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}