{"link": "https://www.themoviedb.org/tv/64770?language=en", "title": "Potato Star 2013QR3", "resume": "A mysterious asteroid crash-lands on Earth in 2013 and causes all sorts of weird things to start happening, specifically to the Noh family and their neighbors.", "rate": 0, "genre": ["Comedy", "Drama", "Family", "Fantasy", "Romance"], "cast": ["Lee Soon-jae", "Noh Joo-hyun", "Ko Kyoung-pyo", "Choi Song-hyun", "Seo Ye-ji"], "character": ["Noh Song", "Noh Soo-dong", "Noh Min-hyuk", "Noh Bo-young", "Noh Soo-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64770   Expand Potato Star 2013QR3   (2013) User Score Overview A mysterious asteroid crash-lands on Earth in 2013 and causes all sorts of weird things to start happening, specifically to the Noh family and their neighbors. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Soon-jae Noh Song Noh Joo-hyun Noh Soo-dong Ko Kyoung-pyo Noh Min-hyuk Choi Song-hyun Noh Bo-young Seo Ye-ji Noh Soo-young Full Cast & Crew Last Season Season 1 2013 | 120 Episodes Season 1 of Potato Star 2013QR3 premiered on September 23, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Potato Star 2013QR3. You can help by rating TV shows you've seen. Facts Original Name  감자별 2013QR3 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://program.interest.me/tvn/potatostar Genres Comedy Drama Family Fantasy Romance Keywords korea Content Score 86 Almost there... Top Contributors t 73 tmdb38202327 1 RainingBullets  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}