{"link": "https://www.themoviedb.org/tv/66405?language=en", "title": "Squad 38", "resume": "As a reference to Article 38 which pertains to tax payments, this special police unit utilizes the criminals' own tactics of scams and deceit to catch rich tax cheats.", "rate": 77, "genre": ["Crime", "Comedy"], "cast": ["Ma Dong-seok", "Seo In Guk", "Choi Soo-young", "Song Ok-Suk", "Heo Jae-ho"], "character": ["Baek Sung-il", "Yang Jung-do", "Chun Sung-hee", "No Bang-sil", "Jang Hak-joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66405   Expand Squad 38   (2016) User Score Overview As a reference to Article 38 which pertains to tax payments, this special police unit utilizes the criminals' own tactics of scams and deceit to catch rich tax cheats. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ma Dong-seok Baek Sung-il Seo In Guk Yang Jung-do Choi Soo-young Chun Sung-hee Song Ok-Suk No Bang-sil Heo Jae-ho Jang Hak-joo Full Cast & Crew Last Season Season 1 2016 | 16 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-05-02 Another Miss Oh 7.8    2016-05-25 Lucky Romance 7.3    2016-09-21 Shopping King Louie 6.7    2016-08-24 Jealousy Incarnate 7.4    2016-01-22 Signal 7.4    2016-01-23 Neighborhood’s Hero 6.7    2012-07-24 Reply 1997 8.5  Facts Original Name  38 사기동대 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/ocn/taxteam38/ Genres Crime Comedy Keywords korea Content Score 86 Almost there... Top Contributors t 34 tmdb38202327 M 21 Maria180493 d 12 daphie 5 nyedotcom  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}