{"link": "https://www.themoviedb.org/tv/17296?language=en", "title": "The Adventures of Superboy", "resume": "The Adventures of Superboy is a series of six-minute animated Superboy cartoons produced by Filmation that were broadcast on CBS between 1966 and 1969. The 34 segments appeared as part of three different programs during that time, packaged with similar shorts featuring The New Adventures of Superman other DC Comics superheroes.\nThese adventures marked the animation debut of Superboy, as well as his teenage alter ego Clark Kent, who acted as the bespectacled, mild-mannered disguise for the young hero, Lana Lang, and Krypto the super-powered dog who would accompany his master on every dangerous mission. Other characters such as Pa and Ma Kent, foster parents of the Boy of Steel, and the town of Smallville were also faithfully recreated from comic book adventures. As a result of the production's budget, the show featured a great amount of stock animation as well as limited movement from the characters.\nEach episode featured the Boy of Steel ducking out of high school and racing into action to battle a wide array of adversaries, from dognappers in \"Krypto, K-9 Detective,\" androids run amok in \"The Revolt of Robotville,\" and alien menaces in \"The Spy from Outer Space,\" to another young hero with similar powers in \"Superboy Meets Mighty Lad,\" and a slew of otherworldly monsters. He even wound up being captured and successfully having to fight a gang of small-time crooks—all while in his disguise as Clark Kent—in \"The Gorilla Gang.\" Most of the stories were written by DC writers such as Bob Haney and George Kashdan, while character designs were based closely upon the Superboy comic books of the time.", "rate": 40, "genre": ["Action", "Adventure", "Animation"], "cast": ["Ross Elliott", "Janet Waldo", "Bob Hastings", "Jackson Beck"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17296   Expand The Adventures of Superboy   (1966) User Score Overview The Adventures of Superboy is a series of six-minute animated Superboy cartoons produced by Filmation that were broadcast on CBS between 1966 and 1969. The 34 segments appeared as part of three different programs during that time, packaged with similar shorts featuring The New Adventures of Superman other DC Comics superheroes. These adventures marked the animation debut of Superboy, as well as his teenage alter ego Clark Kent, who acted as the bespectacled, mild-mannered disguise for the young hero, Lana Lang, and Krypto the super-powered dog who would accompany his master on every dangerous mission. Other characters such as Pa and Ma Kent, foster parents of the Boy of Steel, and the town of Smallville were also faithfully recreated from comic book adventures. As a result of the production's budget, the show featured a great amount of stock animation as well as limited movement from the characters. Each episode featured the Boy of Steel ducking out of high school and racing into action to battle a wide array of adversaries, from dognappers in \"Krypto, K-9 Detective,\" androids run amok in \"The Revolt of Robotville,\" and alien menaces in \"The Spy from Outer Space,\" to another young hero with similar powers in \"Superboy Meets Mighty Lad,\" and a slew of otherworldly monsters. He even wound up being captured and successfully having to fight a gang of small-time crooks—all while in his disguise as Clark Kent—in \"The Gorilla Gang.\" Most of the stories were written by DC writers such as Bob Haney and George Kashdan, while character designs were based closely upon the Superboy comic books of the time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ross Elliott Janet Waldo Bob Hastings Jackson Beck Full Cast & Crew Last Season Season 3 1968 | 8 Episodes Season 3 of The Adventures of Superboy premiered on September 14, 1968. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Superboy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  26m, 30m Homepage  - Genres Action & Adventure Animation Keywords dc comics superhero super power Content Score 71 Just a little bit more... Top Contributors 12 Banana R 4 Rebecca 1 Rodney Pike j 1 jco666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}