{"link": "https://www.themoviedb.org/tv/72974?language=en", "title": "Downtown no Gaki no Tsukai ya Arahende!", "resume": "A Japanese variety show hosted by popular Japanese owarai duo, Downtown, with comedian Hōsei Tsukitei (formerly known as Hōsei Yamasaki) and owarai duo Cocorico co-hosting.", "rate": 0, "genre": ["Comedy"], "cast": ["Masatoshi Hamada", "Hitoshi Matsumoto", "Hōsei Tsukitei", "Naoki Tanaka", "Shôzô Endô"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72974   Expand Downtown no Gaki no Tsukai ya Arahende!   (1989) User Score Overview A Japanese variety show hosted by popular Japanese owarai duo, Downtown, with comedian Hōsei Tsukitei (formerly known as Hōsei Yamasaki) and owarai duo Cocorico co-hosting. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Masatoshi Hamada Hitoshi Matsumoto Hōsei Tsukitei Naoki Tanaka Shôzô Endô Full Cast & Crew Current Season Season 30 2018 | 25 Episodes Season 30 of Downtown no Gaki no Tsukai ya Arahende! premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Downtown no Gaki no Tsukai ya Arahende!. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Downtown no Gaki no Tsukai ya Arahende!. You can help by rating TV shows you've seen. Facts Original Name  ダウンタウンのガキの使いやあらへんで! Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.ntv.co.jp/gaki/ Genres Comedy Keywords variety show Content Score 93 Almost there... Top Contributors S 110 SonofUgly 20 joelamhp r 5 rinob 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}