{"link": "https://www.themoviedb.org/tv/61143?language=en", "title": "God's Gift - 14 Days", "resume": "Kim Soo Hyun experiences the unfathomable when her daughter is kidnapped and murdered. Discovering a miraculous ability to go back in time exactly two weeks before the event, Soo Hyun races against the clock to unravel the plot and save her daughter. But when a private investigator sheds new light on the crime, Soo Hyun uncovers a secret far more treacherous than she could have ever imagined.", "rate": 68, "genre": ["Drama"], "cast": ["Lee Bo-young", "Cho Seung-woo", "Kim Yoo-bin", "Kim Tae-woo", "Jung Gyu-woon"], "character": ["Kim Soo-hyun", "Ki Dong-chan", "Han Saet-byul", "Han Ji-hoon", "Hyun Woo-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61143   Expand God's Gift - 14 Days   (2014) User Score Overview Kim Soo Hyun experiences the unfathomable when her daughter is kidnapped and murdered. Discovering a miraculous ability to go back in time exactly two weeks before the event, Soo Hyun races against the clock to unravel the plot and save her daughter. But when a private investigator sheds new light on the crime, Soo Hyun uncovers a secret far more treacherous than she could have ever imagined. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Bo-young Kim Soo-hyun Cho Seung-woo Ki Dong-chan Kim Yoo-bin Han Saet-byul Kim Tae-woo Han Ji-hoon Jung Gyu-woon Hyun Woo-jin Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of God's Gift - 14 Days premiered on March  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on God's Gift - 14 Days. You can help by rating TV shows you've seen. Facts Original Name  신의 선물 - 14일 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://wizard2.sbs.co.kr/14days/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 40 Maria180493 t 6 taxigps t 5 tmdb38202327 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}