{"link": "https://www.themoviedb.org/tv/38971?language=en", "title": "Cain and Abel", "resume": "Cain and Abel is a 2009 South Korean television series starring So Ji-sub, Shin Hyun-joon, Han Ji-min, and Chae Jung-an. It aired on SBS from February 18 to April 23, 2009 on Wednesdays and Thursdays at 21:55 for 20 episodes.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["So Ji-sub", "Shin Hyun-joon", "Han Ji-min", "Chae Jung-an", "Song Jong-ho"], "character": ["Lee Cho-in / Oh Kang-ho", "Lee Seon-woo", "Oh Young-ji", "Kim Seo-yeon", "Kang Suk-hoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38971   Expand Cain and Abel    (2009) User Score Overview Cain and Abel is a 2009 South Korean television series starring So Ji-sub, Shin Hyun-joon, Han Ji-min, and Chae Jung-an. It aired on SBS from February 18 to April 23, 2009 on Wednesdays and Thursdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast So Ji-sub Lee Cho-in / Oh Kang-ho Shin Hyun-joon Lee Seon-woo Han Ji-min Oh Young-ji Chae Jung-an Kim Seo-yeon Song Jong-ho Kang Suk-hoon Full Cast & Crew Last Season Season 1 2009 | 20 Episodes Season 1 of Cain and Abel  premiered on February 18, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cain and Abel . You can help by rating TV shows you've seen. Facts Original Name  카인과 아벨 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.tv.sbs.co.kr/cain/ Genres Action & Adventure Drama Keywords korea Content Score 86 Almost there... Top Contributors M 21 Maria180493 N 11 Nightowl.Kr z 10 zurman1 CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}