{"link": "https://www.themoviedb.org/tv/10160?language=en", "title": "Big Brother", "resume": "American version of the reality game show which follows a group of HouseGuests living together 24 hours a day in the \"Big Brother\" house, isolated from the outside world but under constant surveillance with no privacy for three months.", "rate": 44, "genre": ["Reality"], "cast": ["Julie Chen"], "character": ["Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10160   Expand Big Brother   (2000) User Score Overview American version of the reality game show which follows a group of HouseGuests living together 24 hours a day in the \"Big Brother\" house, isolated from the outside world but under constant surveillance with no privacy for three months. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  42 Content Issues  0 Images Backdrops  9 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julie Chen Herself - Host Full Cast & Crew Current Season Season 20 2018 | 5 Episodes Season 20 of Big Brother premiered on June 27, 2018. View All Seasons Social Reviews  0 Discussions  42 Subject Status Replies Last Reply Thoughts on season 20 so far? Open 3 by  Poetist Final two scenarios: Who wins the game? Open 29 by  Poetist T Celebrity Cast Revealed Open 2 by  TheBayHarborButcher Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  7 Recommendations   2000-05-31 Survivor 6.3    1969-09-26 The Brady Bunch 6.5    2010-12-01 Storage Wars 5.3    2011-09-21 The X Factor 4.4    2004-01-08 The Celebrity Apprentice 4.2    1968-09-14 The Adventures of Batman 7.4    2005-05-30 Hell's Kitchen 6.3    1993-01-01 Dr. Quinn, Medicine Woman 6.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbs.com/shows/big_brother/ Genres Reality Keywords competition house reality tv game show Content Score 64 We're so close, yet so far. Top Contributors J 255 JarofFlies 80 Elizabeth Jennings b 21 basher 19 davamuga  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}