{"link": "https://www.themoviedb.org/tv/12288?language=en", "title": "Hospital Central", "resume": "Hospital Central is a Spanish television series that follows the professional and personal lives of the staff of the fictitious Hospital Central in Madrid. New episodes are shown by Telecinco network in Spain, and cable/satellite channel Factoría de Ficción reruns them a couple of weeks later. Another cable/satellite channel, AXN, reruns the old episodes.\nThe series started in 2000 and is still on the air today in its 18th season, with its success going stronger. It is often said to be a Spanish version of ER.", "rate": 40, "genre": ["Drama"], "cast": ["Jordi Rebellón", "Antonio Zabálburu", "Mar Regueras", "Nani Jiménez", "Pablo Carbonell"], "character": ["Rodolfo Vilches", "Javier Sotomayor", "Manuela Rubio", "Ariadna Rubio", "David Gimeno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12288   Expand Hospital Central   (2000) User Score Overview Hospital Central is a Spanish television series that follows the professional and personal lives of the staff of the fictitious Hospital Central in Madrid. New episodes are shown by Telecinco network in Spain, and cable/satellite channel Factoría de Ficción reruns them a couple of weeks later. Another cable/satellite channel, AXN, reruns the old episodes. The series started in 2000 and is still on the air today in its 18th season, with its success going stronger. It is often said to be a Spanish version of ER. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jordi Rebellón Rodolfo Vilches Antonio Zabálburu Javier Sotomayor Mar Regueras Manuela Rubio Nani Jiménez Ariadna Rubio Pablo Carbonell David Gimeno Full Cast & Crew Last Season Season 20 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hospital Central. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage   http://www.telecinco.es/hospitalcentral/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 430 prm96 3 lineker 3 United600 R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}