{"link": "https://www.themoviedb.org/tv/3843?language=en", "title": "Central Park West", "resume": "Central Park West is an American prime time television soap opera that ran from September 1995 to June 1996 on CBS. The series was created and executive produced by Melrose Place's Darren Star. As the title suggests, CPW was set in New York, in the affluent Central Park West area of Manhattan. Actresses Mariel Hemingway, Lauren Hutton, and Raquel Welch portrayed three of the central characters on the show.\nThe program represented CBS's attempt to reestablish itself after a disastrous 1994-95 television season where the network lost a heavy amount of established affiliates due to affiliation switches related to Fox acquiring NFC football rights, and an attempt by the network to attract younger viewers. It was the network's most-promoted new show in many years with a promotional campaign exclusively produced to appeal to younger viewers, and attempted to recapture the network's past nighttime soap glory from the years of Dallas and Knots Landing.\nThe series was not successful and was removed from CBS' schedule mid-season, returning some months later with new additions made to the cast. The retooling was not enough to save the show, which was canceled in June 1996. The failure of the series returned the network quickly back to their traditional broadcasting focus and repairing relations between both the network's new affiliates and their older stations which were frustrated by the network's moves in programming rights and programming within the Laurence Tisch era, which would end shortly thereafter with Westinghouse's purchase of CBS Corporation in 1995.", "rate": 0, "genre": ["Drama", "Soap"], "cast": ["Lauren Hutton", "Justin Lazard", "John Barrowman", "Ron Leibman", "Tom Verica"], "character": ["Peter Fairchild"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3843   Expand Central Park West   (1995) User Score Overview Central Park West is an American prime time television soap opera that ran from September 1995 to June 1996 on CBS. The series was created and executive produced by Melrose Place's Darren Star. As the title suggests, CPW was set in New York, in the affluent Central Park West area of Manhattan. Actresses Mariel Hemingway, Lauren Hutton, and Raquel Welch portrayed three of the central characters on the show. The program represented CBS's attempt to reestablish itself after a disastrous 1994-95 television season where the network lost a heavy amount of established affiliates due to affiliation switches related to Fox acquiring NFC football rights, and an attempt by the network to attract younger viewers. It was the network's most-promoted new show in many years with a promotional campaign exclusively produced to appeal to younger viewers, and attempted to recapture the network's past nighttime soap glory from the years of Dallas and Knots Landing. The series was not successful and was removed from CBS' schedule mid-season, returning some months later with new additions made to the cast. The retooling was not enough to save the show, which was canceled in June 1996. The failure of the series returned the network quickly back to their traditional broadcasting focus and repairing relations between both the network's new affiliates and their older stations which were frustrated by the network's moves in programming rights and programming within the Laurence Tisch era, which would end shortly thereafter with Westinghouse's purchase of CBS Corporation in 1995. Featured Crew Darren Star Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lauren Hutton Justin Lazard John Barrowman Peter Fairchild Ron Leibman Tom Verica Full Cast & Crew Last Season Season 2 1996 | 8 Episodes Season 2 of Central Park West premiered on June  5, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Central Park West. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Soap Keywords manhattan, new york city soap opera Content Score 93 Almost there... Top Contributors 11 Banana s 3 speedycars 3 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}