{"link": "https://www.themoviedb.org/tv/61472?language=en", "title": "Prey", "resume": "Three-part crime thriller. When detective Marcus Farrow looks into a seemingly forgotten case, he has no idea of the chaos and heartache that will soon follow. He is found at the scene of a murder, and with all the evidence pointing towards him, he is arrested and charged.", "rate": 71, "genre": ["Crime"], "cast": ["Philip Glenister", "MyAnna Buring", "Rosie Cavaliero", "Nathan Stewart-Jarrett", "Sammy Winward"], "character": ["David Murdoch", "Jules Hope", "DS Susan Reinhart", "DC Richard Iddon", "Lucy Murdoch"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61472   Expand Prey   (2014) User Score  Play Trailer Overview Three-part crime thriller. When detective Marcus Farrow looks into a seemingly forgotten case, he has no idea of the chaos and heartache that will soon follow. He is found at the scene of a murder, and with all the evidence pointing towards him, he is arrested and charged. Featured Crew Chris Lunt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philip Glenister David Murdoch MyAnna Buring Jules Hope Rosie Cavaliero DS Susan Reinhart Nathan Stewart-Jarrett DC Richard Iddon Sammy Winward Lucy Murdoch Full Cast & Crew Last Season Season 2 2015 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2016-02-27 Stag 5.9    2014-11-13 Babylon 7.1    2013-01-04 Zen 7.7    2015-02-18 X Company 7.4    2015-03-16 Spotless 7.3    2014-02-06 The After 8.2    2012-03-04 GCB 5.3    2016-12-07 Shut Eye 6.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Keywords on the run Content Score 100 Yes! Looking good! Top Contributors 23 Elizabeth Jennings n 22 nicb19 7 Steve f 6 flow  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}