{"link": "https://www.themoviedb.org/tv/1883?language=en", "title": "Dog the Bounty Hunter", "resume": "Dog the Bounty Hunter was an American reality television series on A&E which chronicled Duane \"Dog\" Chapman's adventures as a fugitive recovery agent, or bounty hunter. With a few exceptions, the series took place in Hawaii or Dog's home state of Colorado.\nOn May 21, 2012, A&E cancelled the series after eight seasons, citing the popular phrase: \"Every dog has its day\".", "rate": 34, "genre": [], "cast": ["Duane 'Dog' Chapman", "Leland Chapman"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1883   Expand Dog the Bounty Hunter   (2004) User Score Overview Dog the Bounty Hunter was an American reality television series on A&E which chronicled Duane \"Dog\" Chapman's adventures as a fugitive recovery agent, or bounty hunter. With a few exceptions, the series took place in Hawaii or Dog's home state of Colorado. On May 21, 2012, A&E cancelled the series after eight seasons, citing the popular phrase: \"Every dog has its day\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Duane 'Dog' Chapman Himself Leland Chapman Himself Full Cast & Crew Last Season Season 8 2012 | 28 Episodes Season 8 of Dog the Bounty Hunter premiered on January  4, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Beth! Calm down you bulldog! Open 0 by couchplotato\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   2006-08-07 Gene Simmons Family Jewels 4.4    2009-02-08 Nitro Circus 6.0    2010-12-01 Storage Wars 5.3    1996-11-12 Never Mind the Buzzcocks 7.5    1997-06-14 The Adventures of Paddington Bear 7.3    1999-04-11 The Awful Truth 6.4    2005-07-20 Criss Angel Mindfreak 4.2    2004-01-08 The Celebrity Apprentice 4.2  Facts Status  Cancelled Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.aetv.com/dog_the_bounty_hunter/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 4 Travis Bell TS 3 Tony S. S 3 ShanghaiKid 2 Jay Webster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}