{"link": "https://www.themoviedb.org/tv/34861?language=en", "title": "Kurozuka", "resume": "Kurozuka is a novel and Japanese manga series written by Baku Yumemakura and illustrated by Takashi Noguchi. The manga was first serialized in the Japanese seinen manga magazine Super Jump starting in 2003 by Shueisha and ended in December 2006. An anime adaptation by Madhouse was announced by Japanese anime television network Animax in May 2008 and ran between October and December 2008, spanning a total of 12 episodes.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Romi Park", "Mamoru Miyano", "Kazuhiko Inoue", "Keiji Fujiwara", "Toshiko Fujita"], "character": ["Kuromitsu", "Kuro", "Izana", "Karuta", "Saniwa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34861   Expand Kurozuka   (2008) User Score Overview Kurozuka is a novel and Japanese manga series written by Baku Yumemakura and illustrated by Takashi Noguchi. The manga was first serialized in the Japanese seinen manga magazine Super Jump starting in 2003 by Shueisha and ended in December 2006. An anime adaptation by Madhouse was announced by Japanese anime television network Animax in May 2008 and ran between October and December 2008, spanning a total of 12 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Romi Park Kuromitsu Mamoru Miyano Kuro Kazuhiko Inoue Izana Keiji Fujiwara Karuta Toshiko Fujita Saniwa Full Cast & Crew Last Season Season 1 2008 | 12 Episodes Season 1 of Kurozuka premiered on October  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Kurozuka. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords martial arts samurai swordplay vampire dystopia supernatural horror based on manga violence female vampire dark fantasy seinen anime Content Score 86 Almost there... Top Contributors 14 Panayotis m 3 magoozin f 2 forbius a 1 asura766  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}