{"link": "https://www.themoviedb.org/tv/64404?language=en", "title": "Project Runway Junior", "resume": "12 contestants under the age of 18 compete in a modeling competition to win a full scholarship to FIDM in California, a full sewing and crafting studio from Brother, a feature in seventeen magazine, and $25,000 to start their own line.", "rate": 65, "genre": ["Reality"], "cast": ["Tim Gunn", "Kelly Osbourne", "Christian Siriano", "Hannah Davis"], "character": ["Himself - Host", "Herself - Judge", "Himself - Judge", "Herself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64404   Expand Project Runway Junior   (2015) User Score Overview 12 contestants under the age of 18 compete in a modeling competition to win a full scholarship to FIDM in California, a full sewing and crafting studio from Brother, a feature in seventeen magazine, and $25,000 to start their own line. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Gunn Himself - Host Kelly Osbourne Herself - Judge Christian Siriano Himself - Judge Hannah Davis Herself - Judge Full Cast & Crew Last Season Season 2 2016 | 10 Episodes Season 2 of Project Runway Junior premiered on December 22, 2016. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Who will win it all? Chelsea, Chris, Hawwaa, or Izzy? Open 4 by  Poetist IMDB sign in! Open 8 by Poetist\n      \n     Showing at the Final Runway Open 4 by Poetist\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Project Runway Junior. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  42m Homepage   http://www.mylifetime.com/shows/project-runway-junior Genres Reality Keywords fashion designer teenager fashion runway design fashion design Content Score 86 Almost there... Top Contributors t 25 tmdb51601368 12 Elizabeth Jennings 8 Banana sm 3 sheppard matteo23  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}