{"link": "https://www.themoviedb.org/tv/74547?language=en", "title": "Lifeline", "resume": "Lifeline, set in the not-too-distant future, is a half hour series about a little known life insurance company that sends its agents forward 33 days in time to prevent the accidental deaths of its clients. The company’s best agent, Conner Hooks (Gilford), has never missed a save – until he takes on the most personal case of his life. When sixteen-year-old Norah (Park) is orphaned on his watch, Conner pledges to protect her, even if that means putting his career at Lifeline – or his own life – in jeopardy.", "rate": 85, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Zach Gilford", "Sydney Park"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74547   Expand Lifeline   (2017) User Score  Play Trailer Overview Lifeline, set in the not-too-distant future, is a half hour series about a little known life insurance company that sends its agents forward 33 days in time to prevent the accidental deaths of its clients. The company’s best agent, Conner Hooks (Gilford), has never missed a save – until he takes on the most personal case of his life. When sixteen-year-old Norah (Park) is orphaned on his watch, Conner pledges to protect her, even if that means putting his career at Lifeline – or his own life – in jeopardy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zach Gilford Sydney Park Full Cast & Crew Current Season Season 1 2017 | 6 Episodes Season 1 of Lifeline premiered on October 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lifeline. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Keywords time travel Content Score 64 We're so close, yet so far. Top Contributors 28 Damien Haynes S 3 ShareRapid m 2 man_spb TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}