{"link": "https://www.themoviedb.org/tv/867?language=en", "title": "The John Larroquette Show", "resume": "The John Larroquette Show is an American television sitcom that ran on NBC from September 2, 1993 until October 30, 1996. Created by Don Reo, the show was a vehicle for John Larroquette following his run as Dan Fielding on Night Court. The series takes place in a seedy bus terminal in St. Louis, Missouri and originally focused on the somewhat broken people who worked the night shift, and in particular, the lead character's battle with alcoholism. The series was produced by Reo's Impact Zone Productions and Witt/Thomas Productions in association with Warner Bros. Television.", "rate": 78, "genre": ["Comedy"], "cast": ["John Larroquette", "Chi McBride", "Elizabeth Berridge", "Liz Torres", "Daryl Mitchell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 867   Expand The John Larroquette Show   (1993) User Score Overview The John Larroquette Show is an American television sitcom that ran on NBC from September 2, 1993 until October 30, 1996. Created by Don Reo, the show was a vehicle for John Larroquette following his run as Dan Fielding on Night Court. The series takes place in a seedy bus terminal in St. Louis, Missouri and originally focused on the somewhat broken people who worked the night shift, and in particular, the lead character's battle with alcoholism. The series was produced by Reo's Impact Zone Productions and Witt/Thomas Productions in association with Warner Bros. Television. Featured Crew Don Reo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Larroquette Chi McBride Elizabeth Berridge Liz Torres Daryl Mitchell Full Cast & Crew Last Season Season 4 1996 | 12 Episodes Season 4 of The John Larroquette Show premiered on September 18, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1958-09-22 Peter Gunn 8.3    1969-09-29 Love, American Style 5.7    1968-01-22 Rowan & Martin's Laugh-In 7.1    1957-09-14 Have Gun – Will Travel 8.3    1970-12-16 Night Gallery 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords night shift recovering alcoholic sitcom terminal workplace comedy Content Score 93 Almost there... Top Contributors 10 Banana B 1 ByteShare  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}