{"link": "https://www.themoviedb.org/tv/2522?language=en", "title": "Press Gang", "resume": "Press Gang was a British children's comedy-drama revolving around the staff at The Junior Gazette, a childrens weekly newspaper produced by a group of school pupils. \nThe show interspersed comedic elements with the dramatic, tackling issues such as solvent abuse, child abuse and firearms control.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Lucy Benjamin", "Julia Sawalha", "Dexter Fletcher", "Kelda Holmes", "Mmoloki Chrystie"], "character": ["Julie Craig", "Lynda Day", "Spike Thomson", "Sarah Jackson", "Frazz Davis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2522   Expand Press Gang   (1989) User Score Overview Press Gang was a British children's comedy-drama revolving around the staff at The Junior Gazette, a childrens weekly newspaper produced by a group of school pupils.  The show interspersed comedic elements with the dramatic, tackling issues such as solvent abuse, child abuse and firearms control. Featured Crew Steven Moffat Creator Bill Moffat Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucy Benjamin Julie Craig Julia Sawalha Lynda Day Dexter Fletcher Spike Thomson Kelda Holmes Sarah Jackson Mmoloki Chrystie Frazz Davis Full Cast & Crew Last Season Season 5 1993 | 6 Episodes Season 5 of Press Gang premiered on April 16, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   1990-01-04 One Foot in the Grave 7.5    1994-08-25 My So-Called Life 7.8    1992-11-12 Absolutely Fabulous 7.7  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Drama Keywords school teenager newspaper editor newspaper reporter british humour Content Score 93 Almost there... Top Contributors N 82 Notamymerrick 14 sander1 2 Lars the Alien O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}