{"link": "https://www.themoviedb.org/tv/40243?language=en", "title": "Lightning Point", "resume": "When a spaceship carrying pretty, teen aliens Zoey and Kiki lands in the quiet Australian surf town of Lightning Point, the girls have to befriend local surfiegirl Amber and let her in on their secret. But while the duo learns about Earth, surf and falling in love, the girls soon realize that they aren't the first extraterrestrial visitors.", "rate": 85, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Philippa Coulthard", "Jessica Green", "Lucy Fry", "Andrew James Morley", "Kenji Fitzgerald"], "character": ["Amber Mitchell", "Kiki", "Zoey", "Brandon Benedict", "Luca Benedict"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40243   Expand Lightning Point   (2012) User Score  Play Trailer Overview When a spaceship carrying pretty, teen aliens Zoey and Kiki lands in the quiet Australian surf town of Lightning Point, the girls have to befriend local surfiegirl Amber and let her in on their secret. But while the duo learns about Earth, surf and falling in love, the girls soon realize that they aren't the first extraterrestrial visitors. Featured Crew Jonathan M. Shiff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philippa Coulthard Amber Mitchell Jessica Green Kiki Lucy Fry Zoey Andrew James Morley Brandon Benedict Kenji Fitzgerald Luca Benedict Full Cast & Crew Last Season Season 1 2012 | 26 Episodes Season 1 of Lightning Point premiered on May 29, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Lightning Point. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Lightning Point. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords australia surfing alien teenager Content Score 100 Yes! Looking good! Top Contributors 39 Banana S 3 Samara s 3 speedycars TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}