{"link": "https://www.themoviedb.org/tv/20450?language=en", "title": "Witchblade", "resume": "Witchblade is an anime series based on the American comic book by the same name. Instead of an adaptation of the original story, the producers decided to create an entire new setup, with all new characters. This co-production between Japanese studio Gonzo and American publisher Top Cow, who owns the rights for the Witchblade franchise, was licensed for release in the United States. The English dub premiered on the US cable network IFC in January 2008. The show aired on Tuesdays & Wednesdays at 3:30 AM ET, and the series finale aired on June 13, 2008, on IFC. The show is also available on a purchase-to-download system on Xbox Live and PlayStation Network. The first twelve episodes are also available for download via Amazon's Unbox service. The show is also available on Netflix Instant Stream. As of June, 2011, it was available free on Hulu.\nAs of December 2008, in the USA and Canada there were 6 Volumes on DVD available, with Vol. 1 having been released in September 2007. There is also a full boxed set containing all 24 episodes and an extra disc with special features. A Blu-ray box set was released on November 3, 2009.\nThe anime was directed by Yoshimitsu Ohashi, who directed Galaxy Angel and Galaxy Angel Z, and the characters were designed by Uno Makoto, the character designer for Stellvia and Love Hina.", "rate": 70, "genre": ["Animation", "Drama", "Comedy", "Sci-Fi", "Fantasy", "Action", "Adventure", "Mystery"], "cast": ["Akemi Kanda", "Mamiko Noto", "Masaya Matsukaze", "Mie Sonozaki", "Nana Mizuki"], "character": ["Rihoko Amaha", "Masane Amaha", "Yusuke Tozawa", "Reina Soho", "Maria"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20450   Expand Witchblade   (2006) User Score Overview Witchblade is an anime series based on the American comic book by the same name. Instead of an adaptation of the original story, the producers decided to create an entire new setup, with all new characters. This co-production between Japanese studio Gonzo and American publisher Top Cow, who owns the rights for the Witchblade franchise, was licensed for release in the United States. The English dub premiered on the US cable network IFC in January 2008. The show aired on Tuesdays & Wednesdays at 3:30 AM ET, and the series finale aired on June 13, 2008, on IFC. The show is also available on a purchase-to-download system on Xbox Live and PlayStation Network. The first twelve episodes are also available for download via Amazon's Unbox service. The show is also available on Netflix Instant Stream. As of June, 2011, it was available free on Hulu. As of December 2008, in the USA and Canada there were 6 Volumes on DVD available, with Vol. 1 having been released in September 2007. There is also a full boxed set containing all 24 episodes and an extra disc with special features. A Blu-ray box set was released on November 3, 2009. The anime was directed by Yoshimitsu Ohashi, who directed Galaxy Angel and Galaxy Angel Z, and the characters were designed by Uno Makoto, the character designer for Stellvia and Love Hina. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akemi Kanda Rihoko Amaha Mamiko Noto Masane Amaha Masaya Matsukaze Yusuke Tozawa Mie Sonozaki Reina Soho Nana Mizuki Maria Full Cast & Crew Last Season Season 1 2006 | 24 Episodes Season 1 of Witchblade premiered on April  5, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   2015-07-07 Overlord 7.6    2014-10-12 Fate/stay night [Unlimited Blade Works] 6.8    2006-01-07 Fate/stay night 7.2  Facts Original Name  ウィッチブレイド Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.gonzo.co.jp/archives/witchblade/ Genres Animation Drama Comedy Sci-Fi & Fantasy Action & Adventure Mystery Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 16 Nakirasu 6 ressu 5 SeRuJi0 D 5 DuncanSin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}