{"link": "https://www.themoviedb.org/tv/33168?language=en", "title": "Fact or Faked: Paranormal Files", "resume": "Fact or Faked: Paranormal Files is a paranormal investigation series produced by Base Productions that began airing July 15, 2010, on SyFy. The show follows a team of investigators, led by former FBI agent Ben Hansen, who review various photographs and viral videos of alleged paranormal activity. If a particular piece of evidence is deemed intriguing enough to warrant further investigation, they set out to recreate and explain the sighting.\nBeginning episode #207 in first-half of season two, the show began to feature a \"You Decide\" segment in the middle of the program where a video is shown of something strange and then asks the viewing audience if they think the footage is fact or faked. After a commercial break the truth behind the video is revealed.", "rate": 47, "genre": ["Reality", "Documentary", "Mystery"], "cast": ["Jael de Pardo", "Chi-Lan Lieu", "Lanisha Cole"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33168   Expand Fact or Faked: Paranormal Files   (2010) User Score Overview Fact or Faked: Paranormal Files is a paranormal investigation series produced by Base Productions that began airing July 15, 2010, on SyFy. The show follows a team of investigators, led by former FBI agent Ben Hansen, who review various photographs and viral videos of alleged paranormal activity. If a particular piece of evidence is deemed intriguing enough to warrant further investigation, they set out to recreate and explain the sighting. Beginning episode #207 in first-half of season two, the show began to feature a \"You Decide\" segment in the middle of the program where a video is shown of something strange and then asks the viewing audience if they think the footage is fact or faked. After a commercial break the truth behind the video is revealed. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jael de Pardo Chi-Lan Lieu Lanisha Cole Full Cast & Crew Last Season Fact or faked paranormal files season 3 2012 | 12 Episodes Season 3 of Fact or Faked: Paranormal Files premiered on April 17, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   Stephen King's Desperation 5.7    2006-09-20 Jericho 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.syfy.com/factorfaked/ Genres Reality Documentary Mystery Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 12 d4rkm4n z 5 zurman1 3 wufatmio s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}