{"link": "https://www.themoviedb.org/tv/4386?language=en", "title": "Baywatch", "resume": "Baywatch is an American action drama series about the Los Angeles County Lifeguards who patrol the beaches of Los Angeles County, California, starring David Hasselhoff. The show was canceled after its first season on NBC, but survived and later became one of the most watched television shows in the world. The show ran in its original title and format from 1989 to 1999, except for the 1990–1991 season, during which it was not in production. From 1999 to 2001, with a setting change and large cast overhaul, it was known as Baywatch Hawaii.\nBaywatch premiered on NBC in 1989, but was canceled after only one season when it placed 73rd out of 103 shows in the seasonal ratings and also because the studio, GTG, went out of business. Feeling the series still had potential, Hasselhoff along with creators and Executive Producers Michael Berk, Douglas Schwartz and Greg Bonann revived it for the first-run syndication market in 1991. Hasselhoff was given the title of Executive Producer for his work on bringing the show back. The series was hugely successful, especially internationally. The show led to a spin-off: Baywatch Nights, and a reunion movie, Baywatch: Hawaiian Wedding.\nIn 1999, with production costs rising in Los Angeles, and the syndication market shrinking, the plan was to move the show to Australia and launch Baywatch Down Under. A pilot was filmed but the series was stopped when residents of Avalon put forth strong objections, including potential damage to a fragile ecosystem. Pittwater Council permanently barred all future filming. This pilot finally aired as a two-part episode of Baywatch.", "rate": 52, "genre": ["Action", "Adventure", "Drama"], "cast": ["Michael Bergin", "Krista Allen", "Brande Roderick", "Jason Momoa", "Stacy Kamano"], "character": ["J.D. Darius", "Jenna Avid", "Leigh Dyer", "Jason Ioane", "Kekoa Tanaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4386   Expand Baywatch   (1989) User Score Overview Baywatch is an American action drama series about the Los Angeles County Lifeguards who patrol the beaches of Los Angeles County, California, starring David Hasselhoff. The show was canceled after its first season on NBC, but survived and later became one of the most watched television shows in the world. The show ran in its original title and format from 1989 to 1999, except for the 1990–1991 season, during which it was not in production. From 1999 to 2001, with a setting change and large cast overhaul, it was known as Baywatch Hawaii. Baywatch premiered on NBC in 1989, but was canceled after only one season when it placed 73rd out of 103 shows in the seasonal ratings and also because the studio, GTG, went out of business. Feeling the series still had potential, Hasselhoff along with creators and Executive Producers Michael Berk, Douglas Schwartz and Greg Bonann revived it for the first-run syndication market in 1991. Hasselhoff was given the title of Executive Producer for his work on bringing the show back. The series was hugely successful, especially internationally. The show led to a spin-off: Baywatch Nights, and a reunion movie, Baywatch: Hawaiian Wedding. In 1999, with production costs rising in Los Angeles, and the syndication market shrinking, the plan was to move the show to Australia and launch Baywatch Down Under. A pilot was filmed but the series was stopped when residents of Avalon put forth strong objections, including potential damage to a fragile ecosystem. Pittwater Council permanently barred all future filming. This pilot finally aired as a two-part episode of Baywatch. Featured Crew Michael Berk Creator Douglas Schwartz Creator Gregory J. Bonann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Michael Bergin J.D. Darius Krista Allen Jenna Avid Brande Roderick Leigh Dyer Jason Momoa Jason Ioane Stacy Kamano Kekoa Tanaka Full Cast & Crew Last Season Season 11 2000 | 22 Episodes Season 11 of Baywatch premiered on October  2, 2000. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Running time Open 3 by  Marr 🇳🇱 w Mitch: Happy Birthday David Hasselhoff! Open 0 by wonder2wonder\n      \n     w C.J.: Happy Birthday Pamela Anderson! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations   1982-09-26 Knight Rider 6.5    1985-09-29 MacGyver 7.3    1983-01-23 The A-Team 6.9    1997-09-08 Ally McBeal 5.9    1995-01-29 Hercules: The Legendary Journeys 6.3    1993-09-12 Lois & Clark: The New Adventures of Superman 6.6    1993-04-21 Walker, Texas Ranger 5.0    1991-09-17 Home Improvement 7.0  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.baywatch.com/ Genres Action & Adventure Drama Keywords beach los angeles lifeguard Content Score 100 Yes! Looking good! Top Contributors 245 lineker m 14 mode2 14 Banana 12 dzero  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}