{"link": "https://www.themoviedb.org/tv/13271?language=en", "title": "Edward the Seventh", "resume": "Edward the Seventh is a 1975 television drama series, made by ATV in 13 episodes.\nBased on the biography of Edward VII by Philip Magnus, it starred Timothy West as the elder Edward VII and Simon Gipps-Kent and Charles Sturridge as Edward in his youth, Annette Crosbie as Queen Victoria, Deborah Grant and Helen Ryan as Queen Alexandra, Robert Hardy as the Prince Consort, Alison Leggatt as the Duchess of Kent, and Felicity Kendal as Princess Vicky. It was directed by John Gorrie, who wrote episodes 7-10 with David Butler writing the remainder of the series.\nThe series also featured John Gielgud as Benjamin Disraeli, Michael Hordern as William Ewart Gladstone, Harry Andrews as young Edward's tutor Colonel Bruce, Jane Lapotaire as Empress Marie of Russia, Christopher Neame as Kaiser Wilhelm II and, in one of his earliest roles, Charles Dance as Edward's eldest son Eddy, who died at the age of 28. Gielgud previously played Disraeli in the 1941 film The Prime Minister.\nThe actresses playing Edward's mistresses include Moira Redmond as Alice Keppel and Carolyn Seymour as Daisy Greville. Francesca Annis was featured in two episodes as Lillie Langtry which led to Butler writing a full series about Mrs Langtry's life for Annis to star in, Lillie.", "rate": 76, "genre": ["Drama"], "cast": ["Annette Crosbie", "Timothy West", "Christopher Neame", "Michael Hordern", "Robert Hardy"], "character": ["Queen Victoria", "Edward VII", "Kaiser Wilhelm II"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13271   Expand Edward the Seventh   (1975) User Score Overview Edward the Seventh is a 1975 television drama series, made by ATV in 13 episodes. Based on the biography of Edward VII by Philip Magnus, it starred Timothy West as the elder Edward VII and Simon Gipps-Kent and Charles Sturridge as Edward in his youth, Annette Crosbie as Queen Victoria, Deborah Grant and Helen Ryan as Queen Alexandra, Robert Hardy as the Prince Consort, Alison Leggatt as the Duchess of Kent, and Felicity Kendal as Princess Vicky. It was directed by John Gorrie, who wrote episodes 7-10 with David Butler writing the remainder of the series. The series also featured John Gielgud as Benjamin Disraeli, Michael Hordern as William Ewart Gladstone, Harry Andrews as young Edward's tutor Colonel Bruce, Jane Lapotaire as Empress Marie of Russia, Christopher Neame as Kaiser Wilhelm II and, in one of his earliest roles, Charles Dance as Edward's eldest son Eddy, who died at the age of 28. Gielgud previously played Disraeli in the 1941 film The Prime Minister. The actresses playing Edward's mistresses include Moira Redmond as Alice Keppel and Carolyn Seymour as Daisy Greville. Francesca Annis was featured in two episodes as Lillie Langtry which led to Butler writing a full series about Mrs Langtry's life for Annis to star in, Lillie. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Annette Crosbie Queen Victoria Timothy West Edward VII Christopher Neame Kaiser Wilhelm II Michael Hordern Robert Hardy Full Cast & Crew Last Season Season 1 1975 | 13 Episodes Season 1 of Edward the Seventh premiered on January  1, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1970-01-01 The Six Wives of Henry VIII 7.6    1971-02-17 Elizabeth R 8.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 kcdh M 4 MAthePA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}