{"link": "https://www.themoviedb.org/tv/11688?language=en", "title": "The Wind in the Willows", "resume": "The Wind in the Willows is a TV series that was originally broadcast between 1984 and 1987, based on characters from Kenneth Grahame's classic story The Wind in the Willows and following the 1983 film The Wind in the Willows. It was made by animation company Cosgrove Hall for Thames Television and shown on the ITV network. An hour-long feature, A Tale Of Two Toads, was broadcast in 1988, and a fifth season of 13 episodes was shown in 1989 under the title Oh! Mr Toad in some countries, whilst retaining the title The Wind in the Willows in others.", "rate": 80, "genre": ["Animation"], "cast": ["Daphne Oxenford", "Peter Sallis", "Jimmy Hibbert", "Michael Hordern", "David Jason"], "character": ["Toad"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11688   Expand The Wind in the Willows   (1983) User Score Overview The Wind in the Willows is a TV series that was originally broadcast between 1984 and 1987, based on characters from Kenneth Grahame's classic story The Wind in the Willows and following the 1983 film The Wind in the Willows. It was made by animation company Cosgrove Hall for Thames Television and shown on the ITV network. An hour-long feature, A Tale Of Two Toads, was broadcast in 1988, and a fifth season of 13 episodes was shown in 1989 under the title Oh! Mr Toad in some countries, whilst retaining the title The Wind in the Willows in others. Featured Crew Cosgrove Hall Films Creator Mark Hall Creator Chris Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daphne Oxenford Peter Sallis Jimmy Hibbert Michael Hordern David Jason Toad Full Cast & Crew Last Season Season 5 1990 | 13 Episodes Season 5 of The Wind in the Willows premiered on March 22, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1976-01-06 Rentaghost 8.0    1967-01-03 Trumpton 8.8    Randall and Hopkirk (Deceased) 7.0    1986-09-01 Brush Strokes 7.8    1966-01-03 Camberwick Green 8.3    1964-12-16 The Likely Lads 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors D 5 Dar84 3 Murnau TB 2 TMDb Bot N 1 NetU  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}