{"link": "https://www.themoviedb.org/tv/42951?language=en", "title": "Kaiji", "resume": "Tobaku Mokushiroku Kaiji, also known as Ultimate Survivor Kaiji, is a Japanese manga series about the art of gambling, written by Nobuyuki Fukumoto. It is published by Kodansha in Young Magazine. The first part of the manga, was adapted as a 26-episode anime television series called Gyakkyō Burai Kaiji: Ultimate Survivor, which began airing October 2007. A live-action 'Kaiji' movie was released October 10, 2009 in Japan with Tatsuya Fujiwara playing the role of Kaiji. Tobaku Mokushiroku Kaiji is considered Fukumoto's most famous work, and is well known in both Japan and Korea. In 1998, it was the winner of the Kodansha Manga Award in the General category. A second anime television series based on the second arc of the manga, entitled Gyakkyō Burai Kaiji: Hakairoku-hen premiered April 5, 2011 and ran until September 27, 2011.", "rate": 95, "genre": ["Drama", "Animation"], "cast": ["Masato Hagiwara", "Masane Tsukayama", "Naoya Uchida", "Hideo Ishikawa", "Yasunori Matsumoto"], "character": ["Kaiji Itō", "Kazutaka Hyōdō", "Yūji Endō", "Jōji Funai", "Takeshi Furuhata"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42951   Expand Kaiji   (2007) User Score Overview Tobaku Mokushiroku Kaiji, also known as Ultimate Survivor Kaiji, is a Japanese manga series about the art of gambling, written by Nobuyuki Fukumoto. It is published by Kodansha in Young Magazine. The first part of the manga, was adapted as a 26-episode anime television series called Gyakkyō Burai Kaiji: Ultimate Survivor, which began airing October 2007. A live-action 'Kaiji' movie was released October 10, 2009 in Japan with Tatsuya Fujiwara playing the role of Kaiji. Tobaku Mokushiroku Kaiji is considered Fukumoto's most famous work, and is well known in both Japan and Korea. In 1998, it was the winner of the Kodansha Manga Award in the General category. A second anime television series based on the second arc of the manga, entitled Gyakkyō Burai Kaiji: Hakairoku-hen premiered April 5, 2011 and ran until September 27, 2011. Featured Crew Nobuyuki Fukumoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masato Hagiwara Kaiji Itō Masane Tsukayama Kazutaka Hyōdō Naoya Uchida Yūji Endō Hideo Ishikawa Jōji Funai Yasunori Matsumoto Takeshi Furuhata Full Cast & Crew Last Season Kaiji: Against All Rules 2011 | 26 Episodes Season 2 of Kaiji premiered on April  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Kaiji. You can help by rating TV shows you've seen. Facts Original Name  逆境無頼カイジ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Drama Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 Marr 🇳🇱 7 aiman A 5 Aka75 4 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}