{"link": "https://www.themoviedb.org/tv/34791?language=en", "title": "Claymore", "resume": "Claymore is a dark fantasy manga series written and illustrated by Norihiro Yagi. The series initially premiered in the now defunct Monthly Shōnen Jump in the May 2001 issue. When the magazine was canceled in June 2007, the series was temporarily moved to Weekly Shōnen Jump where it was still published monthly. When Jump Square was introduced in November 2007, the series was moved to it. The individual chapters are published in tankōbon volumes by Shueisha, with 23 volumes released as of December 2012.\nMadhouse adapted the first eleven volumes of the series into a twenty-six episode anime series. Directed by Hiroyuki Tanaka the series premiered in Japan on NTV on April 3, 2007 and ran until September 25, 2007. A CD soundtrack for the anime series, and a CD of character songs using the anime voice actresses were released on July 25, 2007 and September 27, 2007, respectively.\nThe Claymore manga is licensed for an English language release in North America by Viz Media. It released the first volume of the series on April 4, 2006 and has released 21 volumes as of November 6, 2012. The anime adaptation is licensed for release in North America by Funimation Entertainment, which has released the first DVD for the series in Fall 2008 and released the entire series on Blu-ray in Spring 2010. Madman Entertainment has licensed the anime for release in Australia and New Zealand and the anime is sub-licenced by Manga Entertainment for UK distribution.", "rate": 71, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Junko Takeuchi", "Emi Shinohara", "Houko Kuwashima", "Romi Park", "Kazuma Horie"], "character": ["Noel (voice)", "Ophelia (voice)", "Claire (voice)", "Teresa (voice)", "Galk (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34791   Expand Claymore   (2007) User Score Overview Claymore is a dark fantasy manga series written and illustrated by Norihiro Yagi. The series initially premiered in the now defunct Monthly Shōnen Jump in the May 2001 issue. When the magazine was canceled in June 2007, the series was temporarily moved to Weekly Shōnen Jump where it was still published monthly. When Jump Square was introduced in November 2007, the series was moved to it. The individual chapters are published in tankōbon volumes by Shueisha, with 23 volumes released as of December 2012. Madhouse adapted the first eleven volumes of the series into a twenty-six episode anime series. Directed by Hiroyuki Tanaka the series premiered in Japan on NTV on April 3, 2007 and ran until September 25, 2007. A CD soundtrack for the anime series, and a CD of character songs using the anime voice actresses were released on July 25, 2007 and September 27, 2007, respectively. The Claymore manga is licensed for an English language release in North America by Viz Media. It released the first volume of the series on April 4, 2006 and has released 21 volumes as of November 6, 2012. The anime adaptation is licensed for release in North America by Funimation Entertainment, which has released the first DVD for the series in Fall 2008 and released the entire series on Blu-ray in Spring 2010. Madman Entertainment has licensed the anime for release in Australia and New Zealand and the anime is sub-licenced by Manga Entertainment for UK distribution. Featured Crew Norihiro Yagi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Takeuchi Noel (voice) Emi Shinohara Ophelia (voice) Houko Kuwashima Claire (voice) Romi Park Teresa (voice) Kazuma Horie Galk (voice) Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Claymore premiered on April  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  13 Recommendations   2015-04-05 Ghost in the Shell: Arise Alternative Architecture 7.3    2012-04-06 Accel World 7.3    2003-08-26 Full Metal Panic? Fumoffu 6.7    2005-10-08 Blood+ 7.0    2007-06-09 Ergo Proxy 7.3  Facts Original Name  CLAYMORE Status  Ended Networks Nitteleplus Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.j-claymore.com/ Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords based on manga anime Content Score 93 Almost there... Top Contributors t 34 tmdb42009110 W 15 Wingman 11 sp1ti t 10 theusedversion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}