{"link": "https://www.themoviedb.org/tv/1821?language=en", "title": "Going Straight", "resume": "Going Straight is a BBC sitcom which was a direct spin-off from Porridge, starring Ronnie Barker as Norman Stanley Fletcher, newly released from the fictional Slade Prison where the earlier series had been set.\nIt sees Fletcher trying to become an honest member of society, having vowed to stay away from crime on his release. The title refers to his attempt, 'straight' being a slang term meaning being honest, in contrast to 'bent', i.e., dishonest.\nAlso re-appearing was Richard Beckinsale as Lennie Godber, who was Fletcher's naïve young cellmate and was now in a relationship with his daughter Ingrid. Her brother Raymond was played by a teenage Nicholas Lyndhurst.\nOnly one series, of six episodes, was made in 1978. It attracted an audience of over 15 million viewers and won a BAFTA award in March 1979, but hopes of a further series had already been dashed by Beckinsale's premature death earlier in the same month.", "rate": 76, "genre": ["Comedy"], "cast": ["Nicholas Lyndhurst", "Ronnie Barker", "Patricia Brake", "Richard Beckinsale", "David Swift"], "character": ["Norman Stanley Fletcher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1821   Expand Going Straight   (1978) User Score Overview Going Straight is a BBC sitcom which was a direct spin-off from Porridge, starring Ronnie Barker as Norman Stanley Fletcher, newly released from the fictional Slade Prison where the earlier series had been set. It sees Fletcher trying to become an honest member of society, having vowed to stay away from crime on his release. The title refers to his attempt, 'straight' being a slang term meaning being honest, in contrast to 'bent', i.e., dishonest. Also re-appearing was Richard Beckinsale as Lennie Godber, who was Fletcher's naïve young cellmate and was now in a relationship with his daughter Ingrid. Her brother Raymond was played by a teenage Nicholas Lyndhurst. Only one series, of six episodes, was made in 1978. It attracted an audience of over 15 million viewers and won a BAFTA award in March 1979, but hopes of a further series had already been dashed by Beckinsale's premature death earlier in the same month. Featured Crew Dick Clement Creator Ian La Frenais Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Lyndhurst Ronnie Barker Norman Stanley Fletcher Patricia Brake Richard Beckinsale David Swift Full Cast & Crew Last Season Season 1 1978 | 6 Episodes Season 1 of Going Straight premiered on February 24, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1973-01-09 Whatever Happened to the Likely Lads? 7.8    2009-01-03 Total Wipeout 5.3    1995-09-14 They Think It's All Over 7.3    1986-05-01 Bread 7.4    2002-11-14 Harry Hill's TV Burp 7.2    1987-09-26 ChuckleVision 6.3    1994-07-04 Room 101 5.9    1965-07-22 Till Death Us Do Part 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords daughter sequel family ex-con sitcom british humour teenage son Content Score 93 Almost there... Top Contributors O 11 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}