{"link": "https://www.themoviedb.org/tv/63692?language=en", "title": "I Have a Lover", "resume": "I Have a Lover is described as the second chance romance between a woman who loses her memory and falls in love with her ex-husband with whom she formerly loathed to the core. Of course the unsaid explanation is usually giant misunderstanding or both characters were way immature and finally grows up the second time around.", "rate": 30, "genre": ["Drama"], "cast": ["Kim Hyun-joo", "Ji Jin-hee", "Park Han-byul", "Lee Kyu-han", "Na Young-hee"], "character": ["Do Hae-kang / Dokgo Yong-gi", "Choi Jin-uhn", "Kang Sul-li", "Baek Suk", "Hong Se-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63692   Expand I Have a Lover   (2015) User Score Overview I Have a Lover is described as the second chance romance between a woman who loses her memory and falls in love with her ex-husband with whom she formerly loathed to the core. Of course the unsaid explanation is usually giant misunderstanding or both characters were way immature and finally grows up the second time around. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hyun-joo Do Hae-kang / Dokgo Yong-gi Ji Jin-hee Choi Jin-uhn Park Han-byul Kang Sul-li Lee Kyu-han Baek Suk Na Young-hee Hong Se-hee Full Cast & Crew Last Season Season 1 2015 | 50 Episodes Season 1 of I Have a Lover premiered on August 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on I Have a Lover. You can help by rating TV shows you've seen. Facts Original Name  애인 있어요 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000008313 Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 56 Maria180493 7 Elizabeth Jennings s 3 sheva_vitali 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}