{"link": "https://www.themoviedb.org/tv/1425?language=en", "title": "House of Cards", "resume": "Set in present day Washington, D.C., House of Cards is the story of Frank Underwood, a ruthless and cunning politician, and his wife Claire who will stop at nothing to conquer everything. This wicked political drama penetrates the shadowy world of greed, sex and corruption in modern D.C. \nHouse of Cards is an adaptation of a previous BBC miniseries of the same name, which is based on the novel by Michael Dobbs.", "rate": 82, "genre": ["Drama"], "cast": ["Robin Wright", "Michael Kelly", "Cody Fern", "Diane Lane", "Greg Kinnear"], "character": ["Claire Underwood", "Doug Stamper"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1425   Expand House of Cards   (2013) User Score  Play Trailer Overview Set in present day Washington, D.C., House of Cards is the story of Frank Underwood, a ruthless and cunning politician, and his wife Claire who will stop at nothing to conquer everything. This wicked political drama penetrates the shadowy world of greed, sex and corruption in modern D.C.  House of Cards is an adaptation of a previous BBC miniseries of the same name, which is based on the novel by Michael Dobbs. Featured Crew Beau Willimon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  20 Content Issues  1 Images Backdrops  19 Posters  25 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Robin Wright Claire Underwood Michael Kelly Doug Stamper Cody Fern Diane Lane Greg Kinnear Full Cast & Crew Last Season Season 5 2017 | 13 Episodes View All Seasons Social Reviews  2 Discussions  22 A review by zag  10.0 Written by  zag  on February 23, 2017 I've seen a fair few political show's over the years but this is the first one that really brings home the corruption and power of today's political class. Spacey is brilliant as the central character, exuding ambition and showing just what he will do to make it to the top. The little scenes where he talks to the camera really make a difference too his character as you see whats going on in his mind rather than just seeing the front he puts on to various other characters in the show. Add to that some stunning performances from his wife and various other politicians and journalists and you ha...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  19 Posters  25 Recommendations   2014-01-12 True Detective 8.1    2006-10-01 Dexter 8.0    2011-10-02 Homeland 7.3    2014-04-15 Fargo 8.2    2010-07-25 Sherlock 8.3    2015-02-08 Better Call Saul 8.1    2008-01-19 Breaking Bad 8.3    2007-07-19 Mad Men 8.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.netflix.com/title/70178217 Genres Drama Keywords usa president politics manipulation revenge breaking the fourth wall power politics political corruption vice president usa politics Content Score 100 Yes! Looking good! Top Contributors 79 Elizabeth Jennings 54 Travis Bell 24 elpredatoro h 17 hornet  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}