{"link": "https://www.themoviedb.org/tv/13456?language=en", "title": "Food and Drink", "resume": "Food and Drink is a long-running British television series on BBC Two. First broadcast between 1982 and 2002, it was the first national television programme in the UK to cover the subject of food and drink without cookery and recipe demonstrations.\nCreated in 1982 by BBC producer Henry Murray from an original idea by Jancis Robinson, Fay Maschler and Paul Levy, the first series was presented by Simon Bates and Gillian Miles, and introduced Jilly Goolden in her first regular television appearances as the programme's wine expert. Russell Harty presented filmed location reports from exceptional restaurants around Britain. This series featured the innovative idea of a small contributing audience of 20 people who were called \"tasters and testers\". The first series broadcast in the summer months but was instantly successful, drawing an average audience of 1.5 million a week, a high rating for BBC Two in the summer in the 80s.\nLater series were presented by Chris Kelly and chef Michael Barry with wine experts Jilly Goolden and Oz Clarke.\nA spin-off panel game, Food and Drink Summer Quiz, aired during the main show's summer break in 1987.\nThe theme music was by Simon May.\nFood and Drink returned to BBC Two on 4 February 2013 co-hosted by Michel Roux Jr and Kate Goodman.", "rate": 50, "genre": [], "cast": ["Simon Bates", "Antony Worrall Thompson", "Jilly Goolden"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13456   Expand Food and Drink   (1982) User Score Overview Food and Drink is a long-running British television series on BBC Two. First broadcast between 1982 and 2002, it was the first national television programme in the UK to cover the subject of food and drink without cookery and recipe demonstrations. Created in 1982 by BBC producer Henry Murray from an original idea by Jancis Robinson, Fay Maschler and Paul Levy, the first series was presented by Simon Bates and Gillian Miles, and introduced Jilly Goolden in her first regular television appearances as the programme's wine expert. Russell Harty presented filmed location reports from exceptional restaurants around Britain. This series featured the innovative idea of a small contributing audience of 20 people who were called \"tasters and testers\". The first series broadcast in the summer months but was instantly successful, drawing an average audience of 1.5 million a week, a high rating for BBC Two in the summer in the 80s. Later series were presented by Chris Kelly and chef Michael Barry with wine experts Jilly Goolden and Oz Clarke. A spin-off panel game, Food and Drink Summer Quiz, aired during the main show's summer break in 1987. The theme music was by Simon May. Food and Drink returned to BBC Two on 4 February 2013 co-hosted by Michel Roux Jr and Kate Goodman. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Bates Antony Worrall Thompson Jilly Goolden Full Cast & Crew Last Season Season 1 2013 | 6 Episodes Season 1 of Food and Drink premiered on February  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Food and Drink. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}