{"link": "https://www.themoviedb.org/tv/60833?language=en", "title": "The Irregular at Magic High School", "resume": "In a world where magic is not a fairy tale but has existed for one hundred years siblings Tatsuya and Miyuki Shiba prepare to begin their studies at the elite Private Magic University Affiliated High School (Magic High School for short). Entering on different levels of the academic spectrum the two turn the once peaceful campus into a chaotic one.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Saori Hayami", "Yuichi Nakamura", "Yumi Uchiyama"], "character": ["Shiba Miyuki", "Shiba Tatsuya", "Chiba Erika"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60833   Expand The Irregular at Magic High School   (2014) User Score Overview In a world where magic is not a fairy tale but has existed for one hundred years siblings Tatsuya and Miyuki Shiba prepare to begin their studies at the elite Private Magic University Affiliated High School (Magic High School for short). Entering on different levels of the academic spectrum the two turn the once peaceful campus into a chaotic one. Featured Crew Manabu Ono Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saori Hayami Shiba Miyuki Yuichi Nakamura Shiba Tatsuya Yumi Uchiyama Chiba Erika Full Cast & Crew Last Season Season 1 2014 | 26 Episodes Season 1 of The Irregular at Magic High School premiered on April  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2014-05-16 Magi: Adventure of Sinbad 6.7    2013-12-24 Turbo FAST 4.7    2014-04-11 Knights of Sidonia 7.9    2015-07-05 Charlotte 6.8    2008-04-07 Soul Eater 7.0    2015-01-07 The Testament of Sister New Devil 6.8    2013-04-07 Gargantia on the Verdurous Planet 6.8    2011-04-17 Blue Exorcist 7.7  Facts Original Name  魔法科高校の劣等生 Status  Planned Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords based on light novel anime Content Score 71 Just a little bit more... Top Contributors 31 sp1ti 27 benf45 20 Elizabeth Jennings 20 Claudio Sanhueza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}