{"link": "https://www.themoviedb.org/tv/76132?language=en", "title": "How to Keep a Mummy", "resume": "Kashiwagi Sora is living a normal high school student life, when his \"adventurer\" father sends him a mummy from his travels in Egypt! Sora balks at the letter from his crazy dad (\"I found a cool mummy, so I decided to leave it with you, son!\") at first, but the mummy that emerges from inside the huge coffin is a mere 12 centimeters tall--small enough to fit in the palm of his hand... Not only that, it's shy, a crybaby, and most of all, heckin' cute. And so, Sora and ends up keeping the mummy, naming his new little buddy \"Mii-kun.\" But living with a mummy might be easier said than done...!", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Keisuke Kōmoto", "Mutsumi Tamura", "Himika Akaneya", "Kayano Ai", "Seiichirou Yamashita"], "character": ["Tazuki Kamiya (voice)", "Sora Kashiwagi (voice)", "Asa Motegi (voice)", "Kaede Kashiwagi (voice)", "Taichi Tatsuaki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76132   Expand How to Keep a Mummy   (2018) User Score  Play Trailer Overview Kashiwagi Sora is living a normal high school student life, when his \"adventurer\" father sends him a mummy from his travels in Egypt! Sora balks at the letter from his crazy dad (\"I found a cool mummy, so I decided to leave it with you, son!\") at first, but the mummy that emerges from inside the huge coffin is a mere 12 centimeters tall--small enough to fit in the palm of his hand... Not only that, it's shy, a crybaby, and most of all, heckin' cute. And so, Sora and ends up keeping the mummy, naming his new little buddy \"Mii-kun.\" But living with a mummy might be easier said than done...! Featured Crew Kaori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keisuke Kōmoto Tazuki Kamiya (voice) Mutsumi Tamura Sora Kashiwagi (voice) Himika Akaneya Asa Motegi (voice) Kayano Ai Kaede Kashiwagi (voice) Seiichirou Yamashita Taichi Tatsuaki (voice) Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of How to Keep a Mummy premiered on January 11, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for How to Keep a Mummy. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on How to Keep a Mummy. You can help by rating TV shows you've seen. Facts Original Name  ミイラの飼い方 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tbs.co.jp/anime/miira/ Genres Animation Sci-Fi & Fantasy Keywords based on manga Content Score 100 Yes! Looking good! Top Contributors 22 brockero 13 sp1ti 5 Despair-Paradise D 4 Destr0y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}