{"link": "https://www.themoviedb.org/tv/11106?language=en", "title": "As If", "resume": "As If is a British comedy-drama series broadcast on Channel 4. There were 76 episodes across four series, the first broadcast on January 22, 2001 and the last on July 31, 2004.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Jemima Rooper", "Emily Corrie", "Paul Chequer", "Orlando Wells", "Jamie Kristian"], "character": ["Nicki Sutton", "Suzanne 'Sooz' Lee", "Jamie Collier", "Alex Stanton", "Allen Rissbrook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11106   Expand As If   (2001) User Score Overview As If is a British comedy-drama series broadcast on Channel 4. There were 76 episodes across four series, the first broadcast on January 22, 2001 and the last on July 31, 2004. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jemima Rooper Nicki Sutton Emily Corrie Suzanne 'Sooz' Lee Paul Chequer Jamie Collier Orlando Wells Alex Stanton Jamie Kristian Allen Rissbrook Full Cast & Crew Last Season Season 4 2004 | 20 Episodes Season 4 of As If premiered on March 13, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on As If. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Drama Keywords london england england group of friends teen drama young adult Content Score 86 Almost there... Top Contributors 18 rudely_murray 16 Banana N 4 NoemiTalavera z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}