{"link": "https://www.themoviedb.org/tv/66025?language=en", "title": "Animal Kingdom", "resume": "The series centers on 17-year-old Joshua \"J\" Cody, who moves in with his freewheeling relatives in their Southern California beach town after his mother dies of a heroin overdose. Headed by boot-tough matriarch Janine \"Smurf\" Cody and her right-hand Baz, who runs the business and calls the shots, the clan also consists of Pope, the oldest and most dangerous of the Cody boys; Craig, the tough and fearless middle son; and Deran, the troubled, suspicious \"baby\" of the family.", "rate": 67, "genre": ["Crime", "Drama"], "cast": ["Finn Cole", "Ellen Barkin", "Shawn Hatosy", "Scott Speedman", "Ben Robson"], "character": ["Joshua \"J\" Cody", "Janine \"Smurf\" Cody", "Andrew \"Pope\" Cody", "Barry \"Baz\" Brown", "Craig Cody"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66025   Expand Animal Kingdom   (2016) User Score  Play Trailer Overview The series centers on 17-year-old Joshua \"J\" Cody, who moves in with his freewheeling relatives in their Southern California beach town after his mother dies of a heroin overdose. Headed by boot-tough matriarch Janine \"Smurf\" Cody and her right-hand Baz, who runs the business and calls the shots, the clan also consists of Pope, the oldest and most dangerous of the Cody boys; Craig, the tough and fearless middle son; and Deran, the troubled, suspicious \"baby\" of the family. Featured Crew Jonathan Lisco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Finn Cole Joshua \"J\" Cody Ellen Barkin Janine \"Smurf\" Cody Shawn Hatosy Andrew \"Pope\" Cody Scott Speedman Barry \"Baz\" Brown Ben Robson Craig Cody Full Cast & Crew Current Season Season 3 2018 | 6 Episodes View All Seasons Social Reviews  1 Discussions  7 j A review by jwestdiscounts Written by  jwestdiscounts  on October 29, 2017 Awesome series Read All Reviews Media Most Popular Videos  1 Backdrops  5 Posters  7 Recommendations   2017-07-05 Snowfall 7.5    2016-03-30 The Path 6.6    2017-09-27 SEAL Team 6.6    2017-09-10 The Deuce 7.9    2013-01-31 Do No Harm 6.6    2016-11-15 Shooter 6.7    2017-11-21 Marvel's Runaways 7.3    2018-01-02 LA to Vegas 7.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m Homepage   http://www.tntdrama.com/shows/animal-kingdom.html Genres Crime Drama Keywords outlaw crime family southern california Content Score 100 Yes! Looking good! Top Contributors 63 Elizabeth Jennings 9 Banana b 6 bugfix M 5 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}