{"link": "https://www.themoviedb.org/tv/65879?language=en", "title": "Houdini & Doyle", "resume": "Sir Arthur Conan Doyle, Harry Houdini and Stratton are tasked with the cases that nobody else can solve. It challenges their sense of what is real and what is not. Houdini is a skeptic, while Doyle believes in the unseen. Their diverse viewpoints make solving crime a challenge and often Stratton is put in the middle. The trio will take on cases that involve vampires, ghosts, monsters and poltergeists…or are they a ruse to conceal murder?", "rate": 59, "genre": ["Drama"], "cast": ["Michael Weston", "Stephen Mangan", "Rebecca Liddiard"], "character": ["Harry Houdini", "Arthur Conan Doyle", "Adelaide Stratton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65879   Expand Houdini & Doyle   (2016) User Score  Play Trailer Overview Sir Arthur Conan Doyle, Harry Houdini and Stratton are tasked with the cases that nobody else can solve. It challenges their sense of what is real and what is not. Houdini is a skeptic, while Doyle believes in the unseen. Their diverse viewpoints make solving crime a challenge and often Stratton is put in the middle. The trio will take on cases that involve vampires, ghosts, monsters and poltergeists…or are they a ruse to conceal murder? Featured Crew David N. Titcher Creator David Hoselton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Weston Harry Houdini Stephen Mangan Arthur Conan Doyle Rebecca Liddiard Adelaide Stratton Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Houdini & Doyle premiered on March 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   2016-06-14 Uncle Buck 5.7    2016-03-15 Crowded 6.4    2018-02-26 Final Space 7.8    2016-12-07 Shut Eye 6.3    2014-08-04 Partners 5.1    2013-07-21 Axe Cop 5.5    2016-09-11 Son of Zorn 5.6    2013-09-17 Dads 4.8  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/houdinianddoyle/ Genres Drama Keywords london england magic amateur detective period drama skepticism murder investigation houdini 20th century Content Score 71 Just a little bit more... Top Contributors z 35 zyck 32 Banana 24 Elizabeth Jennings c 6 castacasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}