{"link": "https://www.themoviedb.org/tv/44004?language=en", "title": "Animal Practice", "resume": "Comedy centering on Dr. George Coleman, a top veterinarian with an impressive list of famous animal patients at the Crane Animal Hospital - a bustling New York City veterinary practice where it often seems as if the patients are running the place. Despite his unorthodox style, George has an undeniable gift with animals of all kinds - except the human kind. Much to his chagrin, George recently learned that his ex-girlfriend, Dorothy Crane, has inherited the family business and is now George's boss. Whip-smart and ambitious, Dorothy shakes up the hospital as she brings order to the chaos and butts heads with George's animal-friendly administration.", "rate": 49, "genre": ["Comedy"], "cast": ["Justin Kirk", "JoAnna Garcia", "Tyler Labine", "Bobby Lee", "Kym Whitley"], "character": ["Dr. George Coleman", "Dorothy Crane", "Dr. Doug Jackson", "Dr. Robert Yamamoto", "Juanita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44004   Expand Animal Practice   (2012) User Score  Play Trailer Overview Comedy centering on Dr. George Coleman, a top veterinarian with an impressive list of famous animal patients at the Crane Animal Hospital - a bustling New York City veterinary practice where it often seems as if the patients are running the place. Despite his unorthodox style, George has an undeniable gift with animals of all kinds - except the human kind. Much to his chagrin, George recently learned that his ex-girlfriend, Dorothy Crane, has inherited the family business and is now George's boss. Whip-smart and ambitious, Dorothy shakes up the hospital as she brings order to the chaos and butts heads with George's animal-friendly administration. Featured Crew Brian Gatewood Creator Alessandro Tanaka Creator Alex Tanaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Justin Kirk Dr. George Coleman JoAnna Garcia Dorothy Crane Tyler Labine Dr. Doug Jackson Bobby Lee Dr. Robert Yamamoto Kym Whitley Juanita Full Cast & Crew Last Season Season 1 2012 | 9 Episodes Season 1 of Animal Practice premiered on August 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2012-03-21 Bent 6.5    2011-09-14 Up All Night 6.2    2014-01-23 Rake 5.4    2013-05-20 The Goodwin Games 5.4    2012-09-11 The New Normal 5.2    2014-08-04 Partners 5.1    2014-09-30 Happyland 3.3    2012-09-30 666 Park Avenue 6.1  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/animal-practice Genres Comedy Keywords veterinarian veterinary clinic workplace comedy Content Score 100 Yes! Looking good! Top Contributors 14 United600 j 10 jnylen 8 Banana F 8 Florent  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}