{"link": "https://www.themoviedb.org/tv/10214?language=en", "title": "Capitol", "resume": "Capitol is an American soap opera which aired on CBS from March 29, 1982 to March 20, 1987 for 1,270 episodes. As its name suggests, the storyline usually revolves around the political intrigues of people whose lives intertwined in Washington, D.C.", "rate": 0, "genre": ["War", "Politics", "Soap"], "cast": ["Dane Witherspoon", "Marla Adams", "Tonja Walker", "Carolyn Jones", "Kimberly Beck"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10214   Expand Capitol   (1982) User Score Overview Capitol is an American soap opera which aired on CBS from March 29, 1982 to March 20, 1987 for 1,270 episodes. As its name suggests, the storyline usually revolves around the political intrigues of people whose lives intertwined in Washington, D.C. Featured Crew Elinor Karpf Creator Steven Karpf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dane Witherspoon Marla Adams Tonja Walker Carolyn Jones Kimberly Beck Full Cast & Crew Last Season Season 6 1987 | 1 Episode Season 6 of Capitol premiered on March 20, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Capitol. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres War & Politics Soap Keywords washington d.c. politics Content Score 79 Pump it up! We're close now. Top Contributors 6 Banana R 2 Rebecca 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}