{"link": "https://www.themoviedb.org/tv/62771?language=en", "title": "Clipped", "resume": "Clipped centers on a group of barbershop coworkers who all went to high school together but ran in very different crowds. Now they find themselves working together at Buzzy's, a barbershop in Charlestown, Massachusetts.", "rate": 46, "genre": ["Comedy"], "cast": ["Mike Castle", "Diona Reasonover", "Matt Cook", "Lauren Lapkus", "Ryan Pinkston"], "character": ["A.J. Salerno", "Charmaine Eskowitz", "Mo", "Joy", "Ben"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62771   Expand Clipped   (2015) User Score Overview Clipped centers on a group of barbershop coworkers who all went to high school together but ran in very different crowds. Now they find themselves working together at Buzzy's, a barbershop in Charlestown, Massachusetts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Castle A.J. Salerno Diona Reasonover Charmaine Eskowitz Matt Cook Mo Lauren Lapkus Joy Ryan Pinkston Ben Full Cast & Crew Last Season Season 1 2015 | 11 Episodes Season 1 of Clipped premiered on June 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2013-08-05 Quick Draw 6.3    2015-03-25 Big Time in Hollywood, Fl 5.7    2015-06-18 The Astronaut Wives Club 5.3    2015-08-03 Significant Mother 5.9    2014-10-02 A to Z 5.7    2014-03-21 Welcome to Sweden 6.3    2013-04-19 Alpha House 7.3    2015-03-31 Younger 5.7  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.tbs.com/shows/clipped.html Genres Comedy Keywords hairdresser massachusetts high school friends barber shop sitcom Content Score 86 Almost there... Top Contributors 40 Elizabeth Jennings 6 Banana 4 thanasis039 j 4 jnylen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}