{"link": "https://www.themoviedb.org/tv/6947?language=en", "title": "Gangland", "resume": "Gangland was a television series that aired on The History Channel. It usually aired on Thursday evenings although it has been known to arbitrarily change days every so often. Gangland explored the history of some of America's more notorious gangs. It premiered on November 1, 2007 with a special episode about the Aryan Brotherhood. The theme song was performed by Buckshot of the Boot Camp Clik. Reruns currently air on the cable channel Spike.", "rate": 61, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6947   Expand Gangland   (2007) User Score Overview Gangland was a television series that aired on The History Channel. It usually aired on Thursday evenings although it has been known to arbitrarily change days every so often. Gangland explored the history of some of America's more notorious gangs. It premiered on November 1, 2007 with a special episode about the Aryan Brotherhood. The theme song was performed by Buckshot of the Boot Camp Clik. Reruns currently air on the cable channel Spike. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2010 | 13 Episodes Season 7 of Gangland premiered on May  7, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2010-07-11 Drugs, Inc. 8.0    2003-03-31 American Chopper 5.9    2001-09-12 The Blue Planet 8.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m, 47m Homepage   http://www.history.com/minisites/gangland Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 Michael 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}