{"link": "https://www.themoviedb.org/tv/78775?language=en", "title": "Servet", "resume": "The only thing that can be called real fortune in the world where everybody's fortune is pursuing is; A story about love. Ferah Feza was one of the thousands of young people who had to fill the age of 18 every year and have to leave their dorm. But there was an important difference from the others, she was not alone. She had a great family, yet she did not even know it, and she was so rich she could not even imagine. Can Yigit was 29 years old. Just like Ferah, he had lost his parents. He grew up like a child, but under the wings of an important business man around the country, he was able to do whatever he wanted, no matter what his son was like. In this age there was a man and money that no one could easily have, and this great family ruled. Can and Ferah stayed in the middle of a fight made for a huge fortune that can not be shared.", "rate": 0, "genre": ["Drama"], "cast": ["Bahar Şahin", "Baran Bölükbaşı", "Cemre Gümeli", "Alicia Kapudağ", "Barış Yalçın"], "character": ["Ferah Feza", "Korkmaz", "Hande Fettah", "Duru Fettah", "Efe Demirkol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78775   Expand Servet   (2018) User Score Overview The only thing that can be called real fortune in the world where everybody's fortune is pursuing is; A story about love. Ferah Feza was one of the thousands of young people who had to fill the age of 18 every year and have to leave their dorm. But there was an important difference from the others, she was not alone. She had a great family, yet she did not even know it, and she was so rich she could not even imagine. Can Yigit was 29 years old. Just like Ferah, he had lost his parents. He grew up like a child, but under the wings of an important business man around the country, he was able to do whatever he wanted, no matter what his son was like. In this age there was a man and money that no one could easily have, and this great family ruled. Can and Ferah stayed in the middle of a fight made for a huge fortune that can not be shared. Featured Crew Emir Khalilzadeh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bahar Şahin Ferah Feza Baran Bölükbaşı Korkmaz Cemre Gümeli Hande Fettah Alicia Kapudağ Duru Fettah Barış Yalçın Efe Demirkol Full Cast & Crew Current Season Season 1 2018 | 7 Episodes Season 1 of Servet premiered on April 13, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Servet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 35 moviefars 1 movie7s  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}