{"link": "https://www.themoviedb.org/tv/20580?language=en", "title": "Around the World in 80 Days", "resume": "Around the World in 80 Days is a 1989 three-part television Eastmancolor miniseries originally broadcast on NBC. The production garnered three nominations for Emmy awards that year. The teleplay by John Gay is based on the Jules Verne novel of the same title.\nStarring Pierce Brosnan as Phileas Fogg, Eric Idle as Passepartout, Julia Nickson as Princess Aouda, and Peter Ustinov as Detective Fix, the miniseries featured multiple cameo appearances, including Patrick Macnee, Simon Ward, and Christopher Lee as members of the Reform Club, and Robert Morley, who had a cameo in the 1956 film adaptation, and Roddy McDowall appear as officials of the Bank of England. Other familiar faces, credited as guest stars and in more substantial roles, include John Hillerman, Jack Klugman, Darren McGavin, Henry Gibson and John Mills.\nThe heroes travel a slightly different route than in the book, and the script makes several contemporary celebrities part of the story who were not mentioned in the book, such as Sarah Bernhardt, Louis Pasteur, Jesse James, Cornelius Vanderbilt and Queen Victoria.", "rate": 64, "genre": ["Drama"], "cast": ["Pierce Brosnan", "Eric Idle", "Peter Ustinov", "Jack Klugman", "Julia Nickson"], "character": ["Phileas Fogg", "Jean Passepartout", "Detective Wilbur Fix", "Captain Bunsby", "Prinzessin Aouda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20580   Expand Around the World in 80 Days   (1989) User Score Overview Around the World in 80 Days is a 1989 three-part television Eastmancolor miniseries originally broadcast on NBC. The production garnered three nominations for Emmy awards that year. The teleplay by John Gay is based on the Jules Verne novel of the same title. Starring Pierce Brosnan as Phileas Fogg, Eric Idle as Passepartout, Julia Nickson as Princess Aouda, and Peter Ustinov as Detective Fix, the miniseries featured multiple cameo appearances, including Patrick Macnee, Simon Ward, and Christopher Lee as members of the Reform Club, and Robert Morley, who had a cameo in the 1956 film adaptation, and Roddy McDowall appear as officials of the Bank of England. Other familiar faces, credited as guest stars and in more substantial roles, include John Hillerman, Jack Klugman, Darren McGavin, Henry Gibson and John Mills. The heroes travel a slightly different route than in the book, and the script makes several contemporary celebrities part of the story who were not mentioned in the book, such as Sarah Bernhardt, Louis Pasteur, Jesse James, Cornelius Vanderbilt and Queen Victoria. Featured Crew Buzz Kulik Creator John Gay Creator Jules Verne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierce Brosnan Phileas Fogg Eric Idle Jean Passepartout Peter Ustinov Detective Wilbur Fix Jack Klugman Captain Bunsby Julia Nickson Prinzessin Aouda Full Cast & Crew Last Season Season 1 1989 | 3 Episodes Season 1 of Around the World in 80 Days premiered on April 15, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  9 Recommendations   1997-05-11 20,000 Leagues Under the Sea 4.6    2000-03-05 Anne of Green Gables: The Continuing Story 6.3    2002-01-25 Mr. Bean: The Animated Series 5.4    1982-10-01 Remington Steele 6.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  360m Homepage  - Genres Drama Keywords jules verne travel miniseries traveller 19th century Content Score 93 Almost there... Top Contributors 22 Banana TB 21 TMDb Bot S 16 Samara C 11 Chnorzy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}