{"link": "https://www.themoviedb.org/tv/5738?language=en", "title": "Bangkok Hilton", "resume": "Bangkok Hilton is a three-part Australian mini-series, made in 1989 by Kennedy Miller Productions and directed by Ken Cameron. The title of the mini-series is, in the story, the nickname of a fictional Bangkok prison in which the protagonist is imprisoned, a mordant reference to Hanoi Hilton, the prison known as such used by North Vietnam during the Vietnam War.", "rate": 71, "genre": ["Drama"], "cast": ["Nicole Kidman", "Brian Bovell", "Judy Morris", "Richard Carter", "Joy Smithers"], "character": ["Katrina Stanton", "Catherine Faulkner", "Detective King", "Mandy Engels"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5738   Expand Bangkok Hilton   (1989) User Score Overview Bangkok Hilton is a three-part Australian mini-series, made in 1989 by Kennedy Miller Productions and directed by Ken Cameron. The title of the mini-series is, in the story, the nickname of a fictional Bangkok prison in which the protagonist is imprisoned, a mordant reference to Hanoi Hilton, the prison known as such used by North Vietnam during the Vietnam War. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicole Kidman Katrina Stanton Brian Bovell Judy Morris Catherine Faulkner Richard Carter Detective King Joy Smithers Mandy Engels Full Cast & Crew Last Season Season 1 1989 | 6 Episodes Season 1 of Bangkok Hilton premiered on November  5, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   1968-09-25 The Champions 6.3    2003-05-18 Hitler: The Rise of Evil 6.6    1997-04-27 The Shining 6.0    2003-08-05 The O.C. 6.9    2007-09-19 Gossip Girl 6.3    1995-05-14 The Langoliers 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  270m Homepage  - Genres Drama Keywords prison london england escape bangkok thailand father escape from prison miniseries drugs missing father Content Score 86 Almost there... Top Contributors TB 41 TMDb Bot w 3 webmaster e 2 egbertbos 1 clbonde  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}