{"link": "https://www.themoviedb.org/tv/44072?language=en", "title": "House Husbands", "resume": "House Husbands centres around four families with one thing in common, the husbands stay home to raise the children.\nFirass Dirani plays a fallen AFL hero, struggling with the burden of family life. In the midst of losing the ability to see his two twin boys (primary school age) and his eight month daughter, he is offered a contract to play football again in Perth. He rejects the offer made by his former manager (who is in a relationship with his ex wife)", "rate": 68, "genre": ["Drama"], "cast": ["Gary Sweet", "Rhys Muldoon", "Natalie Saleeba", "Firass Dirani", "Julia Morris"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44072   Expand House Husbands   (2012) User Score Overview House Husbands centres around four families with one thing in common, the husbands stay home to raise the children. Firass Dirani plays a fallen AFL hero, struggling with the burden of family life. In the midst of losing the ability to see his two twin boys (primary school age) and his eight month daughter, he is offered a contract to play football again in Perth. He rejects the offer made by his former manager (who is in a relationship with his ex wife) Featured Crew Drew Proffitt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Sweet Rhys Muldoon Natalie Saleeba Firass Dirani Julia Morris Full Cast & Crew Last Season Season 5 2017 | 10 Episodes Season 5 of House Husbands premiered on February  6, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply N Who are your Most Favorite, and Least Favorite Characters Open 0 by Nephlim14\n      \n     N (Echoes) HELLOOOO Open 0 by Nephlim14\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on House Husbands. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.9jumpin.com.au/show/house-husbands/ Genres Drama Keywords stay-at-home dad Content Score 93 Almost there... Top Contributors c 18 courtneysmith86 13 Elizabeth Jennings 8 szab c 7 coffeeguy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}