{"link": "https://www.themoviedb.org/tv/48304?language=en", "title": "HUNTER - Women After Reward Money", "resume": "On a return flight to Japan, cabin attendant Isaka Rei arrests a thief at Narita Airport’s International Terminal, and receives a reward of 1 million yen. However, she is half-forced to resign from her job as a cabin attendant because of this roundup. Furthermore, her younger sister, Akane, has made her a guarantor and disappeared, leaving her 10-year-old daughter, Haru behind. Rei starts to live with a reluctant Haru at ‘Shunkato’, the small eating house that Akane has been running. There is a firsthand account of Akane meeting a ‘Shunkato’ customer on the day she went missing. Rei brings the photograph of the man whom Akane met to Tsukishima Police Precinct, and learns that there is a 1 million yen bounty because he is a wanted criminal. The lack of motivation of the attending detective, Gondo Takeshi of the precinct’s Community Safety Division, spurs her to decide that she has to arrest this criminal who has some sort of connection to her sister. And so, Rei becomes a bounty hunter together with the ladies who gather at ‘Shunkato’.", "rate": 0, "genre": ["Mystery", "Drama"], "cast": ["Ryoko Yonekura", "Megumi Saito", "Daichi Saeki", "Risako Ito", "Yuichi Yasoda"], "character": ["Rei Isaka", "Yuko Nonomura", "Kenta Sakuma", "Akane Isaka (Young)", "Grocer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48304   Expand HUNTER - Women After Reward Money   (2011) User Score Overview On a return flight to Japan, cabin attendant Isaka Rei arrests a thief at Narita Airport’s International Terminal, and receives a reward of 1 million yen. However, she is half-forced to resign from her job as a cabin attendant because of this roundup. Furthermore, her younger sister, Akane, has made her a guarantor and disappeared, leaving her 10-year-old daughter, Haru behind. Rei starts to live with a reluctant Haru at ‘Shunkato’, the small eating house that Akane has been running. There is a firsthand account of Akane meeting a ‘Shunkato’ customer on the day she went missing. Rei brings the photograph of the man whom Akane met to Tsukishima Police Precinct, and learns that there is a 1 million yen bounty because he is a wanted criminal. The lack of motivation of the attending detective, Gondo Takeshi of the precinct’s Community Safety Division, spurs her to decide that she has to arrest this criminal who has some sort of connection to her sister. And so, Rei becomes a bounty hunter together with the ladies who gather at ‘Shunkato’. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryoko Yonekura Rei Isaka Megumi Saito Yuko Nonomura Daichi Saeki Kenta Sakuma Risako Ito Akane Isaka (Young) Yuichi Yasoda Grocer Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of HUNTER - Women After Reward Money premiered on October 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on HUNTER - Women After Reward Money. You can help by rating TV shows you've seen. Facts Original Name  HUNTER～その女たち、賞金稼ぎ～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  22m Homepage  - Genres Mystery Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 21 Aka75 16 BrerFox 10 Elizabeth Jennings 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}