{"link": "https://www.themoviedb.org/tv/7366?language=en", "title": "The Goode Family", "resume": "The Goode Family is an American animated comedy series, which originally aired on ABC from May 27, 2009 to August 7, 2009. The series was created by Mike Judge, and follows the life of an environmentally responsible, albeit obsessive, family. The series takes a comic look at contemporary society. Judge created the show along with former King of the Hill writers John Altschuler and David Krinsky. The show was cancelled after its first season due to low ratings.\nThe series was released on DVD format on January 8, 2013 by Shout! Factory.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Mike Judge", "Nancy Carell", "David Herman", "Linda Cardellini", "Brian Doyle-Murray"], "character": ["Gerald Goode (voice)", "Helen Goode (voice)", "Ubuntu Goode (voice)", "Bliss Goode (voice)", "Charlie (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7366   Expand The Goode Family   (2009) User Score Overview The Goode Family is an American animated comedy series, which originally aired on ABC from May 27, 2009 to August 7, 2009. The series was created by Mike Judge, and follows the life of an environmentally responsible, albeit obsessive, family. The series takes a comic look at contemporary society. Judge created the show along with former King of the Hill writers John Altschuler and David Krinsky. The show was cancelled after its first season due to low ratings. The series was released on DVD format on January 8, 2013 by Shout! Factory. Featured Crew Mike Judge Creator Dave Krinsky Creator John Altschuler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Judge Gerald Goode (voice) Nancy Carell Helen Goode (voice) David Herman Ubuntu Goode (voice) Linda Cardellini Bliss Goode (voice) Brian Doyle-Murray Charlie (voice) Full Cast & Crew Last Season Season 1 2009 | 13 Episodes Season 1 of The Goode Family premiered on May 27, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2011-05-11 Angry Boys 6.5    2012-01-19 Unsupervised 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://abc.go.com/primetime/goodefamily/index?pn=index Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 31 lineker m 3 morrison A 1 AnthonyAtkins232 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}