{"link": "https://www.themoviedb.org/tv/44549?language=en", "title": "Nashville", "resume": "Rayna Jaymes and Juliette Barnes face personal and professional challenges as they navigate their paths as artists and individuals. Surrounding them, and often complicating their lives, are their family, friends and, in some cases, lovers, as well as the up-and-coming performers and songwriters trying to get ahead in the business. In Nashville, musicians and songwriters are at the heart of the storm driven by their own ambitions. Some are fueled by their creativity and passion for fame. Others struggle to cope with the pressures of success and are doing everything in their power to stay on top.", "rate": 61, "genre": ["Drama"], "cast": ["Hayden Panettiere", "Clare Bowen", "Chip Esten", "Jonathan Jackson", "Lennon Stella"], "character": ["Juliette Barnes", "Scarlett O'Connor", "Deacon Claybourne", "Avery Barkley", "Maddie Conrad"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44549   Expand Nashville   (2012) User Score  Play Trailer Overview Rayna Jaymes and Juliette Barnes face personal and professional challenges as they navigate their paths as artists and individuals. Surrounding them, and often complicating their lives, are their family, friends and, in some cases, lovers, as well as the up-and-coming performers and songwriters trying to get ahead in the business. In Nashville, musicians and songwriters are at the heart of the storm driven by their own ambitions. Some are fueled by their creativity and passion for fame. Others struggle to cope with the pressures of success and are doing everything in their power to stay on top. Featured Crew Callie Khouri Creator Max Axall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  2 Images Backdrops  18 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hayden Panettiere Juliette Barnes Clare Bowen Scarlett O'Connor Chip Esten Deacon Claybourne Jonathan Jackson Avery Barkley Lennon Stella Maddie Conrad Full Cast & Crew Current Season Season 6 2018 | 16 Episodes Season 6 of Nashville premiered on January  4, 2018. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply d Nashville cancelled after season 6 Open 1 by  tuffysmom r Just started watching..on s4 Open 0 by rumble88\n      \n     Yay or Nay Since Going to CMT? Open 19 by  danithang Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  14 Recommendations   2017-10-01 Wisdom of the Crowd 7.1    2016-08-14 Chesapeake Shores 7.8    2017-09-25 The Brave 6.6    2017-09-27 SEAL Team 6.6    2016-10-10 Freakish 5.8    2018-01-03 9-1-1 6.7    2015-08-05 Difficult People 7.4    2016-09-20 This Is Us 8.1  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://cmt.com/shows/nashville/ Genres Drama Keywords country music music southern usa nashville tennessee Content Score 100 Yes! Looking good! Top Contributors 93 Banana 29 Elizabeth Jennings 26 seawolf 24 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}