{"link": "https://www.themoviedb.org/tv/4277?language=en", "title": "Archie Bunker's Place", "resume": "Archie Bunker's Place is an American sitcom originally broadcast on the CBS network, conceived in 1979 as a spin-off and continuation of All in the Family. While not as popular as its predecessor, the show maintained a large enough audience to last for four seasons, until its cancellation in 1983. In its first season, the show performed so well that it knocked Mork & Mindy out of its new Sunday night time slot.", "rate": 50, "genre": ["Comedy"], "cast": ["Anne Meara", "Jason Wingreen", "Danielle Brisebois", "Carroll O'Connor", "Allan Melvin"], "character": ["Veronica Rooney", "Stephanie Mills", "Archie Bunker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4277   Expand Archie Bunker's Place   (1979) User Score Overview Archie Bunker's Place is an American sitcom originally broadcast on the CBS network, conceived in 1979 as a spin-off and continuation of All in the Family. While not as popular as its predecessor, the show maintained a large enough audience to last for four seasons, until its cancellation in 1983. In its first season, the show performed so well that it knocked Mork & Mindy out of its new Sunday night time slot. Featured Crew Johnny Speight Creator Norman Lear Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Meara Veronica Rooney Jason Wingreen Danielle Brisebois Stephanie Mills Carroll O'Connor Archie Bunker Allan Melvin Full Cast & Crew Last Season Season 4 1982 | 24 Episodes Season 4 of Archie Bunker's Place premiered on September 26, 1982. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Stephanie: Happy Birthday Danielle Brisebois ! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Archie Bunker's Place. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york bar sitcom workplace comedy Content Score 93 Almost there... Top Contributors 11 Banana w 1 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}