{"link": "https://www.themoviedb.org/tv/31417?language=en", "title": "You're Beautiful", "resume": "You're Beautiful is a 2009 South Korean romantic comedy television drama series, starring Park Shin-hye, Jang Keun-suk, Lee Hong-ki of F.T. Island and Jung Yong-hwa of CN Blue. It is about a fictional boy band A.N.Jell and the relationship between its members when a female, posing as her twin brother, joins the group. It aired on Seoul Broadcasting System from October 7 to November 26, 2009 on Wednesdays and Thursdays at 21:55 for 16 episodes. The series has been posted on SBS's YouTube channel. A Japanese remake of this drama was released in Japan in July 2011 as Ikemen desu ne, and included a cameo appearance by Jang in Episode 8 as his Japanese counterpart, Gunsoku. A Taiwanese remake, Fabulous Boys, was broadcast in 2013, which includes a cameo appearance by Park Shin-hye.", "rate": 79, "genre": ["Comedy", "Drama"], "cast": ["Jang Keun-suk", "Park Shin-hye", "Jung Yong-hwa", "Lee Hong-gi", "Uee"], "character": ["Hwang Tae Kyung", "Go Mi-nam / Go Mi-nyeo", "Kang Shin Woo", "Jeremy", "Yoo He Yi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31417   Expand You're Beautiful   (2009) User Score Overview You're Beautiful is a 2009 South Korean romantic comedy television drama series, starring Park Shin-hye, Jang Keun-suk, Lee Hong-ki of F.T. Island and Jung Yong-hwa of CN Blue. It is about a fictional boy band A.N.Jell and the relationship between its members when a female, posing as her twin brother, joins the group. It aired on Seoul Broadcasting System from October 7 to November 26, 2009 on Wednesdays and Thursdays at 21:55 for 16 episodes. The series has been posted on SBS's YouTube channel. A Japanese remake of this drama was released in Japan in July 2011 as Ikemen desu ne, and included a cameo appearance by Jang in Episode 8 as his Japanese counterpart, Gunsoku. A Taiwanese remake, Fabulous Boys, was broadcast in 2013, which includes a cameo appearance by Park Shin-hye. Featured Crew Hong Mi Ran Creator Hong Jeong Eun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Keun-suk Hwang Tae Kyung Park Shin-hye Go Mi-nam / Go Mi-nyeo Jung Yong-hwa Kang Shin Woo Lee Hong-gi Jeremy Uee Yoo He Yi Full Cast & Crew Last Season Season 1 2009 | 16 Episodes Season 1 of You're Beautiful premiered on October  7, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  8 Recommendations   2011-06-29 Heartstrings 7.0    2005-12-14 My Girl 7.0    2007-07-02 Coffee Prince 8.8    2013-12-09 The Prime Minister and I 7.1    2014-12-15 Punch 8.9    2012-08-15 Arang and the Magistrate 8.0    2010-11-08 Mary Stayed Out All Night 8.0    2012-03-26 Love Rain 7.3  Facts Original Name  美男이시네요 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/anjell/ Genres Comedy Drama Keywords romance korea k-pop Content Score 93 Almost there... Top Contributors M 18 Maria180493 N 17 Nightowl.Kr z 10 zurman1 p 6 ppreethi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}