{"link": "https://www.themoviedb.org/tv/34575?language=en", "title": "Auction Hunters", "resume": "Auction Hunters is an American reality television series that premiered on November 9, 2010, on Spike and is produced by Gurney Productions Inc. It also airs internationally.\nIn June 2011, Spike announced that it had ordered a third season of 26 episodes. In August 2012, Spike announced that it had ordered a fourth season of 26 episodes. The fourth season premiered on January 30, 2013.", "rate": 51, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34575   Expand Auction Hunters   (2010) User Score Overview Auction Hunters is an American reality television series that premiered on November 9, 2010, on Spike and is produced by Gurney Productions Inc. It also airs internationally. In June 2011, Spike announced that it had ordered a third season of 26 episodes. In August 2012, Spike announced that it had ordered a fourth season of 26 episodes. The fourth season premiered on January 30, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2014 | 9 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2004-10-19 The Biggest Loser 4.6    2008-12-03 Man v. Food 6.7    2010-08-16 Hardcore Pawn 4.2    2003-03-31 American Chopper 5.9    2005-04-12 Deadliest Catch 6.6    2011-04-01 CHAOS 6.7    2010-12-01 Storage Wars 5.3    2009-07-19 Pawn Stars 6.5  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m, 22m Homepage   http://www.spike.com/shows/auction-hunters Genres Reality Keywords auction self storage Content Score 56 We're so close, yet so far. Top Contributors 11 Banana C 3 Cataloguer s 3 sref D 3 DracoAn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}