{"link": "https://www.themoviedb.org/tv/958?language=en", "title": "Beast Wars: Transformers", "resume": "Beast Wars: Transformers, titled Beasties: Transformers in Canada, is a Canadian CG animated television series that debuted in 1996, serving as the flagship of the Transformers: Beast Wars franchise. The series was set in the future of the \"original\" Transformers universe as a sequel to the first Transformers series.\nThe Beast Wars TV series was produced by Mainframe Entertainment of Canada; its story editors were Bob Forward and Larry DiTillio. All three seasons are currently available on DVD in the USA and other Region 1 territories. In Australia, to coincide with the show's tenth anniversary in 2006, Madman Entertainment released all three seasons in Region 4 format. These boxsets include \"world exclusive\" special features, such as commentaries and interviews with the voice actors.\nThe production designer for the show, Clyde Klotz, won a Daytime Emmy Award for Outstanding Individual Achievement in Animation in 1997 for his work on Beast Wars.", "rate": 77, "genre": ["Animation", "Action", "Adventure"], "cast": ["Richard Newman", "Colin Murdock", "David Kaye", "Ian James Corlett", "Jim Byrnes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 958   Expand Beast Wars: Transformers   (1996) User Score Overview Beast Wars: Transformers, titled Beasties: Transformers in Canada, is a Canadian CG animated television series that debuted in 1996, serving as the flagship of the Transformers: Beast Wars franchise. The series was set in the future of the \"original\" Transformers universe as a sequel to the first Transformers series. The Beast Wars TV series was produced by Mainframe Entertainment of Canada; its story editors were Bob Forward and Larry DiTillio. All three seasons are currently available on DVD in the USA and other Region 1 territories. In Australia, to coincide with the show's tenth anniversary in 2006, Madman Entertainment released all three seasons in Region 4 format. These boxsets include \"world exclusive\" special features, such as commentaries and interviews with the voice actors. The production designer for the show, Clyde Klotz, won a Daytime Emmy Award for Outstanding Individual Achievement in Animation in 1997 for his work on Beast Wars. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Newman Colin Murdock David Kaye Ian James Corlett Jim Byrnes Full Cast & Crew Last Season Beast wars season 3 1998 | 13 Episodes Season 3 of Beast Wars: Transformers premiered on October 25, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1997-09-15 Mummies Alive! 6.3    1994-09-10 ReBoot 8.3    1997-09-12 Ninja Turtles: The Next Mutation 3.9    1997-09-01 Extreme Ghostbusters 6.0    1993-09-18 Biker Mice from Mars 6.4    1999-01-10 Batman Beyond 7.8    1986-10-11 Saint Seiya 8.0    1996-09-06 Superman: The Animated Series 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 20 zurman1 A 4 Adaj D 3 Daniel 3 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}