{"link": "https://www.themoviedb.org/tv/68058?language=en", "title": "HIM", "resume": "A 17-year-old boy, known only as HIM, caught in the limbo between childhood and adulthood is also trapped in a limbo between the two homes of his divorced parents, each now remarried with new families. Like most boys he finds it hard to process his feelings so tends to “act out”. But his behaviour is also triggered by something else - his primal struggle to contain the terrifying secret of a supernatural power he inherited from his grandfather. A power that only his ageing grandmother understands, who urges him to use his gift only for ‘good’ for she knows if he doesn’t it could end in tragedy.", "rate": 62, "genre": ["Drama", "Mystery"], "cast": ["Fionn Whitehead", "Alec Newman", "Bobby Smalldridge", "McKell David", "Susan Jameson"], "character": ["HIM", "Ross Brodie / Clive", "Jack Davies", "Jamie", "Rose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68058   Expand HIM   (2016) User Score Overview A 17-year-old boy, known only as HIM, caught in the limbo between childhood and adulthood is also trapped in a limbo between the two homes of his divorced parents, each now remarried with new families. Like most boys he finds it hard to process his feelings so tends to “act out”. But his behaviour is also triggered by something else - his primal struggle to contain the terrifying secret of a supernatural power he inherited from his grandfather. A power that only his ageing grandmother understands, who urges him to use his gift only for ‘good’ for she knows if he doesn’t it could end in tragedy.  Featured Crew Paula Milne Creator Andy de Emmony Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fionn Whitehead HIM Alec Newman Ross Brodie / Clive Bobby Smalldridge Jack Davies McKell David Jamie Susan Jameson Rose Full Cast & Crew Last Season Season 1 2016 | 3 Episodes Season 1 of HIM premiered on October 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2016-03-01 Loosely Exactly Nicole 5.8    2015-10-16 Truth Be Told 5.5    2017-05-17 Downward Dog 6.7    2016-06-07 Agatha Raisin 6.3    2016-01-13 Teachers 7.1    2017-02-02 Superior Donuts 6.5    2016-09-05 Mary + Jane 6.1    2014-01-13 Uncle 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   https://itvstudios.com/programmes/him Genres Drama Mystery Keywords supernatural powers miniseries supernatural teen Content Score 93 Almost there... Top Contributors ☘ 23 ☘ 9 Banana 4 Elizabeth Jennings 4 Forrest73  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}