{"link": "https://www.themoviedb.org/tv/64505?language=en", "title": "Capital", "resume": "Set on a single street in South London, Capital is a portrait of a road transformed by soaring property prices: what was once the home of modest lower-middle class families, Pepys Road has been continuously gentrified into a street of multimillion pound houses.  On one day, the people of this South London street all receive an anonymous postcard with the simple message 'we want what you have'. Its unsettling ripples affect every corner of the community.", "rate": 75, "genre": ["Drama"], "cast": ["Toby Jones", "Lesley Sharp", "Rachael Stirling", "Hamza Jeetooa", "Danny Ashok"], "character": ["Roger", "Mary", "Arabella", "Usman Kamal", "Shahid"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64505   Expand Capital   (2015) User Score  Play Trailer Overview Set on a single street in South London, Capital is a portrait of a road transformed by soaring property prices: what was once the home of modest lower-middle class families, Pepys Road has been continuously gentrified into a street of multimillion pound houses.  On one day, the people of this South London street all receive an anonymous postcard with the simple message 'we want what you have'. Its unsettling ripples affect every corner of the community. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toby Jones Roger Lesley Sharp Mary Rachael Stirling Arabella Hamza Jeetooa Usman Kamal Danny Ashok Shahid Full Cast & Crew Last Season Season 1 2015 | 3 Episodes Season 1 of Capital premiered on November 24, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2015-03-17 Ordinary Lies 7.0    2012-03-04 GCB 5.3    2014-02-16 Quirke 5.9    2012-05-22 Hit & Miss 7.3    2016-01-22 Stan Lee's Lucky Man 7.3    2016-09-22 Paranoid 6.4    2016-09-30 The Level 6.5    2008-06-01 In Plain Sight 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b06r3jww Genres Drama Keywords london england neighborhood affluent Content Score 93 Almost there... Top Contributors TB 62 TMDb Bot 27 Elizabeth Jennings 11 Steve z 7 zyck  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}