{"link": "https://www.themoviedb.org/tv/34674?language=en", "title": "Master Keaton", "resume": "Master Keaton is a Japanese manga series created by Hokusei Katsushika and Naoki Urasawa. It was serialized in Big Comic Original between 1988 and 1994 and ran for 144 chapters. The chapters were combined into 18 tankōbon volumes. An anime adaptation was created, with 24 episodes airing between 1998 and 1999 in Japan on Nippon Television. An additional 15 episodes were created and released as OVAs, bringing the total to 39 episodes. The manga's target audience was Japanese men in their 20's and 30's, a comparatively older target audience than is common for most anime series.\nThough the manga series has not been translated into English, the anime and OVA series were dubbed into English and released by Pioneer Entertainment.\nNaoki Urasawa will be writing a sequel to the series, titled Master Keaton Remaster, with writer Takashi Nagasaki. Beginning in the March 2012 issue of Big Comic Original, it will take place 20 years after the original series ended.", "rate": 100, "genre": ["Mystery", "Animation", "Drama"], "cast": ["Ichirō Nagai", "Houko Kuwashima"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34674   Expand Master Keaton   (1998) User Score Overview Master Keaton is a Japanese manga series created by Hokusei Katsushika and Naoki Urasawa. It was serialized in Big Comic Original between 1988 and 1994 and ran for 144 chapters. The chapters were combined into 18 tankōbon volumes. An anime adaptation was created, with 24 episodes airing between 1998 and 1999 in Japan on Nippon Television. An additional 15 episodes were created and released as OVAs, bringing the total to 39 episodes. The manga's target audience was Japanese men in their 20's and 30's, a comparatively older target audience than is common for most anime series. Though the manga series has not been translated into English, the anime and OVA series were dubbed into English and released by Pioneer Entertainment. Naoki Urasawa will be writing a sequel to the series, titled Master Keaton Remaster, with writer Takashi Nagasaki. Beginning in the March 2012 issue of Big Comic Original, it will take place 20 years after the original series ended. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ichirō Nagai Houko Kuwashima Full Cast & Crew Last Season Season 1 1998 | 39 Episodes Season 1 of Master Keaton premiered on October  6, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Master Keaton. You can help by rating TV shows you've seen. Facts Original Name  マスターキートン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Mystery Animation Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors c 4 ctchim t 4 tmdb983464 3 cwhboy 3 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}