{"link": "https://www.themoviedb.org/tv/4000?language=en", "title": "Romeo!", "resume": "Romeo! is an American/Canadian television series that aired on Nickelodeon from 2003 to 2006, totaling 53 episodes. The filming was done in Vancouver, British Columbia, while the show takes place in Seattle, Washington.\nReruns occasionally aired on Nickelodeon, CBS, BET and The N until December 26, 2008. The series was produced by Tom Lynch Company and P. Miller Collection in association with Nickelodeon Productions.", "rate": 70, "genre": ["Comedy"], "cast": ["Noel Callahan", "Victoria Jackson", "Erica O'Keith", "Romeo Miller", "Zachary Isaiah Williams"], "character": ["Romeo Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4000   Expand Romeo!   (2003) User Score Overview Romeo! is an American/Canadian television series that aired on Nickelodeon from 2003 to 2006, totaling 53 episodes. The filming was done in Vancouver, British Columbia, while the show takes place in Seattle, Washington. Reruns occasionally aired on Nickelodeon, CBS, BET and The N until December 26, 2008. The series was produced by Tom Lynch Company and P. Miller Collection in association with Nickelodeon Productions. Featured Crew Thomas W. Lynch Creator Master P Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noel Callahan Victoria Jackson Erica O'Keith Romeo Miller Romeo Miller Zachary Isaiah Williams Full Cast & Crew Last Season Season 4 2006 | 12 Episodes Season 4 of Romeo! premiered on April  1, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Romeo!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Romeo!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Comedy Keywords aspiring singer teenager black family blended family black sitcom Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana s 4 sn3p L 1 Law 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}