{"link": "https://www.themoviedb.org/tv/68974?language=en", "title": "We're Millennials. Got a problem?", "resume": "Drama series depicts the lives of three men born in 1987 and oppose irrational things of the world through work, love and friendship. The men are from the Yutori generation when the Japanese government reformed the education system emphasizing a pressure-free environment referred to as Yutori education.", "rate": 0, "genre": ["Comedy", "Drama", "Family"], "cast": ["Masaki Okada", "Tori Matsuzaka", "Yuya Yagira", "Sakura Ando", "Taiga"], "character": ["Masakazu Sakama", "Kazutoyo Yamaji", "Maribu Michigami", "Akane Miyashita", "Hiromu Yamagishi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68974   Expand We're Millennials. Got a problem?   (2016) User Score Overview Drama series depicts the lives of three men born in 1987 and oppose irrational things of the world through work, love and friendship. The men are from the Yutori generation when the Japanese government reformed the education system emphasizing a pressure-free environment referred to as Yutori education. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaki Okada Masakazu Sakama Tori Matsuzaka Kazutoyo Yamaji Yuya Yagira Maribu Michigami Sakura Ando Akane Miyashita Taiga Hiromu Yamagishi Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of We're Millennials. Got a problem? premiered on April 17, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for We're Millennials. Got a problem?. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on We're Millennials. Got a problem?. You can help by rating TV shows you've seen. Facts Original Name  ゆとりですがなにか Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.ntv.co.jp/yutori/ Genres Comedy Drama Family Keywords japan Content Score 86 Almost there... Top Contributors c 32 ctchim M 28 Maria180493 16 thirstyhippo g 5 gashtoby  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}