{"link": "https://www.themoviedb.org/tv/18772?language=en", "title": "Urban Legends", "resume": "Urban Legends is a 30 minute 2007 television documentary-style series hosted by Michael Allcock. David Hewlett became the new host in 2011. In each episode, three urban legends are dramatized and presented to the television audience; the audience is then to speculate which one or two of the three is true. Each legend has witnesses to tell the story. For the one or two fake legends, the witnesses are actors, while the true legend uses real people affected by the story. Included in each episode are two quick quiz-like stories, called mini-myths, which air before the commercial breaks. Each will begin with the number of the mini myth and its name, followed by the story. After the commercial, the answer to the mini-myth is announced and the rest of the programming continues as it previously had. The show originally aired on the Biography Channel in the U.S., History Television in Canada and FX in the United Kingdom where it was hosted by Mark Dolan. It has also aired in Argentina, New Zealand, Sweden, Norway, Australia, Finland, Estonia, The Netherlands, Russia, Hungary and Denmark.\nThe series briefly returned to the Syfy network as an \"Original Series\" with new episodes starting on Monday April 18, 2011, then moved to the regular time, Fridays at 10. The new episodes followed exactly the same format as the original but were narrated by Stargate's David Hewlett. The show now airs occasionally as reruns and mini-marathons on both SyFy and Chiller.", "rate": 70, "genre": ["Documentary", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18772   Expand Urban Legends   (2007) User Score Overview Urban Legends is a 30 minute 2007 television documentary-style series hosted by Michael Allcock. David Hewlett became the new host in 2011. In each episode, three urban legends are dramatized and presented to the television audience; the audience is then to speculate which one or two of the three is true. Each legend has witnesses to tell the story. For the one or two fake legends, the witnesses are actors, while the true legend uses real people affected by the story. Included in each episode are two quick quiz-like stories, called mini-myths, which air before the commercial breaks. Each will begin with the number of the mini myth and its name, followed by the story. After the commercial, the answer to the mini-myth is announced and the rest of the programming continues as it previously had. The show originally aired on the Biography Channel in the U.S., History Television in Canada and FX in the United Kingdom where it was hosted by Mark Dolan. It has also aired in Argentina, New Zealand, Sweden, Norway, Australia, Finland, Estonia, The Netherlands, Russia, Hungary and Denmark. The series briefly returned to the Syfy network as an \"Original Series\" with new episodes starting on Monday April 18, 2011, then moved to the regular time, Fridays at 10. The new episodes followed exactly the same format as the original but were narrated by Stargate's David Hewlett. The show now airs occasionally as reruns and mini-marathons on both SyFy and Chiller. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2011 | 15 Episodes Season 3 of Urban Legends premiered on April  1, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Urban Legends. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Drama Keywords urban legend Content Score 56 We're so close, yet so far. Top Contributors 5 Elizabeth Jennings 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}