{"link": "https://www.themoviedb.org/tv/36982?language=en", "title": "Princess Daisy", "resume": "The lovely Daisy is the daughter of a Russian prince and an American movie star. After her parents are killed, she flees from her half-brother Ram. She fights her way to the top of the modeling profession and falls in love with a company president. But then, her half-brother arrives on the scene, ready to blackmail and destroy her.", "rate": 100, "genre": ["Drama"], "cast": ["Jim Metzler", "Alexa Kenin", "Nicolas Coster", "Sal Viscuso", "Hildy Brooks"], "character": ["John", "Kiki Kavanaugh", "Matty Firestone", "Wingo", "Margot Firestone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36982   Expand Princess Daisy   (1983) User Score  Play Trailer Overview The lovely Daisy is the daughter of a Russian prince and an American movie star. After her parents are killed, she flees from her half-brother Ram. She fights her way to the top of the modeling profession and falls in love with a company president. But then, her half-brother arrives on the scene, ready to blackmail and destroy her. Featured Crew Judith Krantz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Metzler John Alexa Kenin Kiki Kavanaugh Nicolas Coster Matty Firestone Sal Viscuso Wingo Hildy Brooks Margot Firestone Full Cast & Crew Last Season Miniseries 1983 | 2 Episodes Season 1 of Princess Daisy premiered on November  6, 1983. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Princess Daisy. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Princess Daisy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification NR Meaning No rating information Type  Miniseries Original Language  English Runtime  191m Homepage   https://www.moviemeter.nl/film/72728 Genres Drama Keywords rape based on novel or book miniseries new york city twins incest aristocrat Content Score 86 Almost there... Top Contributors TB 29 TMDb Bot 28 r3vanchist_ R 11 Rebecca 4 Gizmo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}