{"link": "https://www.themoviedb.org/tv/32858?language=en", "title": "Neighbors from Hell", "resume": "Neighbors from Hell was a satirical American animated sitcom that ran on TBS from June 7, 2010 to July 26, 2010. The executive producer of the series is Pam Brady. The first and only season consisted of 10 episodes.\nThe series is owned by 20th Century Fox Film Corporation. It's produced by Fox Television Animation and MoonBoy Animation, a division of DreamWorks Animation. The majority of the animation is produced by Bardel Entertainment in Vancouver, and a team of animators in Los Angeles, Bento Box Entertainment, did some of the animation and retakes.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["Will Sasso", "Patton Oswalt", "Jane Lynch", "Steve Coogan", "Molly Shannon"], "character": ["Balthazor Hellman", "Alex", "Satan", "Tina Hellman (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32858   Expand Neighbors from Hell   (2010) User Score Overview Neighbors from Hell was a satirical American animated sitcom that ran on TBS from June 7, 2010 to July 26, 2010. The executive producer of the series is Pam Brady. The first and only season consisted of 10 episodes. The series is owned by 20th Century Fox Film Corporation. It's produced by Fox Television Animation and MoonBoy Animation, a division of DreamWorks Animation. The majority of the animation is produced by Bardel Entertainment in Vancouver, and a team of animators in Los Angeles, Bento Box Entertainment, did some of the animation and retakes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Sasso Balthazor Hellman Patton Oswalt Jane Lynch Alex Steve Coogan Satan Molly Shannon Tina Hellman (voice) Full Cast & Crew Last Season Season 1 2010 | 10 Episodes Season 1 of Neighbors from Hell premiered on June  7, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  10 Recommendations   2010-03-17 Ugly Americans 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.tbs.com/shows/neighborsfromhell Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 anzani-hun A 4 AnthonyAtkins232 m 3 morrison 2 Zombizox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}