{"link": "https://www.themoviedb.org/tv/67052?language=en", "title": "Handa-kun", "resume": "Set six years prior to the events of Barakamon, detailing the life of Seishuu Handa as a high school student—and a very interesting life it is. In Handa-kun, Seishuu Handa is admired by his peers as a calligraphy genius and given the utmost respect, but Handa-kun himself is under the mistaken impression that the deference and attention he receives from the other students is actually bullying. Handa just wants to live a quiet life, but hilarity ensues as one character after another challenges his position as the school idol, and somehow comes away as a fan all while Handa is horrified and clueless.", "rate": 67, "genre": ["Animation", "Comedy"], "cast": ["Yuuya Hirose", "Nobunaga Shimazaki", "Kazuyuki Okitsu", "Tetsuya Kakihara", "Daiki Yamashita"], "character": ["Junichi Aizawa", "Seishuu Handa", "Takao Kawafuji", "Reo Nikaidou", "Yukio Kondou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67052   Expand Handa-kun   (2016) User Score Overview Set six years prior to the events of Barakamon, detailing the life of Seishuu Handa as a high school student—and a very interesting life it is. In Handa-kun, Seishuu Handa is admired by his peers as a calligraphy genius and given the utmost respect, but Handa-kun himself is under the mistaken impression that the deference and attention he receives from the other students is actually bullying. Handa just wants to live a quiet life, but hilarity ensues as one character after another challenges his position as the school idol, and somehow comes away as a fan all while Handa is horrified and clueless. Featured Crew Yoshino Satsuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuya Hirose Junichi Aizawa Nobunaga Shimazaki Seishuu Handa Kazuyuki Okitsu Takao Kawafuji Tetsuya Kakihara Reo Nikaidou Daiki Yamashita Yukio Kondou Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Handa-kun premiered on July  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2016-07-02 First Love Monster 5.7    2014-01-11 No-Rin 6.0    2015-10-04 Attack on Titan: Junior High 7.0    2013-01-03 Choboraunyopomi Gekijou Ai Mai Mii 4.5    2017-01-04 Akiba's Trip The Animation 8.8    2010-01-07 Baka and Test: Summon the Beasts 6.4    2017-07-04 Tsuredure Children 8.0    2017-07-07 18if 6.3  Facts Original Name  はんだくん Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/handaanime/ Genres Animation Comedy Keywords slice of life school based on manga shounen anime watercolour style Content Score 93 Almost there... Top Contributors n 36 nongtik 7 Yodev 6 sp1ti 5 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}