{"link": "https://www.themoviedb.org/tv/21285?language=en", "title": "Coach Trip", "resume": "Coach Trip is a reality game show originally broadcast on Channel 4 from 7 March 2005 to 30 June 2006. The programme returned to Channel 4 from 25 May 2009 to 9 March 2012 after a three-year break. In early 2013, the show went into hiatus again and was replaced by a new show called Brendan's Magical Mystery Tour. However, in September 2013, Channel 4 announced that they had renewed Coach Trip for another series.\nThe show's format consists of four to seven teams of two undertaking a coach tour principally of continental Europe.\nThe tours have usually lasted 30 or 50 days, with passengers remaining on the tour only until they are ejected by their companions on one day, to be replaced by a new couple the following day.\nThe travellers are accompanied by tour guide Brendan Sheerin, who appears in every episode.", "rate": 80, "genre": ["Action", "Adventure", "Reality"], "cast": ["Brendan Sheerin"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21285   Expand Coach Trip   (2005) User Score  Play Trailer Overview Coach Trip is a reality game show originally broadcast on Channel 4 from 7 March 2005 to 30 June 2006. The programme returned to Channel 4 from 25 May 2009 to 9 March 2012 after a three-year break. In early 2013, the show went into hiatus again and was replaced by a new show called Brendan's Magical Mystery Tour. However, in September 2013, Channel 4 announced that they had renewed Coach Trip for another series. The show's format consists of four to seven teams of two undertaking a coach tour principally of continental Europe. The tours have usually lasted 30 or 50 days, with passengers remaining on the tour only until they are ejected by their companions on one day, to be replaced by a new couple the following day. The travellers are accompanied by tour guide Brendan Sheerin, who appears in every episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brendan Sheerin Presenter Full Cast & Crew Last Season Season 15 2015 | 40 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Coach Trip. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m, 30m Homepage   http://www.channel4.com/programmes/coach-trip Genres Action & Adventure Reality Keywords competition europe travel Content Score 64 We're so close, yet so far. Top Contributors t 22 tmdb51601368 9 Banana CM 5 Cherche Moi TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}