{"link": "https://www.themoviedb.org/tv/30716?language=en", "title": "Single-Handed", "resume": "Single-Handed is an Irish television drama series, first broadcast on RTÉ Television in 2007. Set and filmed in the west of Ireland, it focuses on the life of a member of the Garda Síochána, Sergeant Jack Driscoll. Three two-episode, single-story series aired one each on consecutive nights in 2007, 2008 and 2009. Series Four, consisting of three stories told over six episodes, began in RTÉ One November 2010.\nThe series is partially inspired by garda corruption in County Donegal.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Owen McDonnell", "David Herlihy", "Ruth McCabe", "Sean McGinley", "Matthew McNulty"], "character": ["Garda Sergeant Jack Driscoll", "Garda Finbarr Colvin", "Eithne Driscoll", "Dennis Costello", "Brian Doyle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30716   Expand Single-Handed   (2007) User Score  Play Trailer Overview Single-Handed is an Irish television drama series, first broadcast on RTÉ Television in 2007. Set and filmed in the west of Ireland, it focuses on the life of a member of the Garda Síochána, Sergeant Jack Driscoll. Three two-episode, single-story series aired one each on consecutive nights in 2007, 2008 and 2009. Series Four, consisting of three stories told over six episodes, began in RTÉ One November 2010. The series is partially inspired by garda corruption in County Donegal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  9 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Owen McDonnell Garda Sergeant Jack Driscoll David Herlihy Garda Finbarr Colvin Ruth McCabe Eithne Driscoll Sean McGinley Dennis Costello Matthew McNulty Brian Doyle Full Cast & Crew Last Season Season 4 2010 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  6 Posters  9 Recommendations   2000-09-04 Waking the Dead 7.9    2013-10-16 The Tunnel 7.5    2007-02-18 Inspector Lewis 7.6    2002-10-27 Foyle's War 8.1    2008-11-30 Wallander 7.6    2014-10-06 Grantchester 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 47m Homepage   http://www.rte.ie/tv/singlehanded/ Genres Crime Drama Keywords cop rural setting ireland Content Score 93 Almost there... Top Contributors 29 Ockraz 27 Steve 2 ernie77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}