{"link": "https://www.themoviedb.org/tv/78461?language=en", "title": "Space Battleship Tiramisu", "resume": "The Earth Union is locked in a massive galactic war. Aboard the Space Battleship Tiramisu, ace pilot Subaru Ichinose carries the fate of humanity on his shoulders. Life for Subaru is tough. But nothing relieves tension quite like launching an all-out food-based assault on his own face. Snug as a bug in a rug, Subaru soothingly unwinds in his personal mecha, “Durandal F,” as bliss overtakes him.", "rate": 60, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Junichi Suwabe", "Kaito Ishikawa", "Takuya Eguchi", "Takahiro Sakurai"], "character": ["Vulgar Hammer", "Subaru Ichinose", "Subaru-B", "Isuzu Ichinose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78461   Expand Space Battleship Tiramisu   (2018) User Score Overview The Earth Union is locked in a massive galactic war. Aboard the Space Battleship Tiramisu, ace pilot Subaru Ichinose carries the fate of humanity on his shoulders. Life for Subaru is tough. But nothing relieves tension quite like launching an all-out food-based assault on his own face. Snug as a bug in a rug, Subaru soothingly unwinds in his personal mecha, “Durandal F,” as bliss overtakes him. Featured Crew Hiroshi Ikehata Creator Yuu Satou Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junichi Suwabe Vulgar Hammer Kaito Ishikawa Subaru Ichinose Takuya Eguchi Subaru-B Takahiro Sakurai Isuzu Ichinose Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Space Battleship Tiramisu premiered on April  3, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Space Battleship Tiramisu. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Space Battleship Tiramisu. You can help by rating TV shows you've seen. Facts Original Name  宇宙戦艦ティラミス Status  Ended Network Certification 12 Meaning Content suitable for viewers over the age of 12. Type  Scripted Original Language  Japanese Runtime  7m Homepage   http://www.tiramisu-anime.com/ Genres Animation Sci-Fi & Fantasy Comedy Keywords slice of life based on manga anime Content Score 100 Yes! Looking good! Top Contributors 27 sp1ti 20 0x3199 12 Elizabeth Jennings 5 animes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}