{"link": "https://www.themoviedb.org/tv/62233?language=en", "title": "Top Gear France", "resume": "Top Gear France is a french TV show on cars, based on the english original tv show Top Gear. IT is shwon on TNT RMC Découverte and will be hosted by the french actor Philippe Lellouche, the professional racing driver Bruce Jouanny and EDM musician and journalist Yann Larret-Menezo.", "rate": 60, "genre": ["Reality", "Documentary"], "cast": ["Philippe Lellouche", "Bruce Jouanny", "Yann Larret-Menezo", "Le Stig"], "character": ["Le Tone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62233   Expand Top Gear France   (2015) User Score Overview Top Gear France is a french TV show on cars, based on the english original tv show Top Gear. IT is shwon on TNT RMC Découverte and will be hosted by the french actor Philippe Lellouche, the professional racing driver Bruce Jouanny and EDM musician and journalist Yann Larret-Menezo. Featured Crew Géry Leymergie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philippe Lellouche Bruce Jouanny Yann Larret-Menezo Le Tone Le Stig Full Cast & Crew Current Season Season 4 2018 | 8 Episodes Season 4 of Top Gear France premiered on January  3, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Top Gear France. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Top Gear France. You can help by rating TV shows you've seen. Facts Status  In Production Network Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Documentary Original Language  French Runtime  60m Homepage   http://rmcdecouverte.bfmtv.com/operation/top-gear-france/ Genres Reality Documentary Keywords racing testing car Content Score 93 Almost there... Top Contributors 33 Teriak47 6 scorpio686 4 jerem0710 N 4 Neocide  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}