{"link": "https://www.themoviedb.org/tv/5258?language=en", "title": "Drop the Dead Donkey", "resume": "Drop the Dead Donkey is a situation comedy that first aired on Channel 4 in the United Kingdom between 1990 and 1998. It is set in the offices of “GlobeLink News”, a fictional TV news company. Recorded close to transmission, it made use of contemporary news events to give the programme a greater sense of realism. It was created by Andy Hamilton and Guy Jenkin. The series had an ensemble cast, making stars of Haydn Gwynne, Stephen Tompkinson and Neil Pearson.\nThe series began with the acquisition of GlobeLink by media mogul Sir Roysten Merchant, an allusion to either Robert Maxwell or Rupert Murdoch. Indeed, Andy Hamilton and Guy Jenkin note on their DVDs that it was fortunate for their libel lawyers that the two men shared the same initials. The series is mostly based on the on-going battle between the staff of GlobeLink, led by editor George Dent, as they try to maintain the company as a serious news organisation, and Sir Roysten’s right-hand man Gus Hedges, trying to make the show more sensationalist and suppress stories that might harm Sir Roysten’s business empire.\nThe show was awarded the Best Comedy Award at the 1994 BAFTA Awards. At the British Comedy Awards the show won Best New TV Comedy in 1990, Best Channel 4 Comedy in 1991, and Best Channel 4 Sitcom in 1994.", "rate": 75, "genre": ["Comedy"], "cast": ["Neil Pearson", "Victoria Wicks", "Susannah Doyle", "David Swift", "Stephen Tompkinson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5258   Expand Drop the Dead Donkey   (1990) User Score Overview Drop the Dead Donkey is a situation comedy that first aired on Channel 4 in the United Kingdom between 1990 and 1998. It is set in the offices of “GlobeLink News”, a fictional TV news company. Recorded close to transmission, it made use of contemporary news events to give the programme a greater sense of realism. It was created by Andy Hamilton and Guy Jenkin. The series had an ensemble cast, making stars of Haydn Gwynne, Stephen Tompkinson and Neil Pearson. The series began with the acquisition of GlobeLink by media mogul Sir Roysten Merchant, an allusion to either Robert Maxwell or Rupert Murdoch. Indeed, Andy Hamilton and Guy Jenkin note on their DVDs that it was fortunate for their libel lawyers that the two men shared the same initials. The series is mostly based on the on-going battle between the staff of GlobeLink, led by editor George Dent, as they try to maintain the company as a serious news organisation, and Sir Roysten’s right-hand man Gus Hedges, trying to make the show more sensationalist and suppress stories that might harm Sir Roysten’s business empire. The show was awarded the Best Comedy Award at the 1994 BAFTA Awards. At the British Comedy Awards the show won Best New TV Comedy in 1990, Best Channel 4 Comedy in 1991, and Best Channel 4 Sitcom in 1994. Featured Crew Guy Jenkin Creator Andy Hamilton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Pearson Victoria Wicks Susannah Doyle David Swift Stephen Tompkinson Full Cast & Crew Last Season Season 6 1998 | 7 Episodes Season 6 of Drop the Dead Donkey premiered on October 28, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1983-09-22 Just Good Friends 6.4    1986-09-01 Brush Strokes 7.8    1981-12-24 The Kenny Everett Television Show 7.0    1977-04-12 Citizen Smith 7.6    1964-12-16 The Likely Lads 7.8    1986-05-01 Bread 7.4    1979-10-29 Only When I Laugh 6.0    1998-05-08 Invasion: Earth 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Comedy Keywords television satire tv news sitcom british humour workplace comedy Content Score 93 Almost there... Top Contributors 25 kcdh 7 Banana O 2 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}