{"link": "https://www.themoviedb.org/tv/37854?language=en", "title": "One Piece", "resume": "Years ago, the fearsome pirate king Gol D. Roger was executed, leaving a huge pile of treasure and the famous \"One Piece\" behind. Whoever claims the \"One Piece\" will be named the new pirate king. Monkey D. Luffy, a boy who consumed one of the \"Devil's Fruits\", has it in his head that he'll follow in the footsteps of his idol, the pirate Shanks, and find the One Piece. It helps, of course, that his body has the properties of rubber and he's surrounded by a bevy of skilled fighters and thieves to help him along the way. Monkey D. Luffy brings a bunch of his crew followed by, Roronoa Zoro, Nami, Usopp, Sanji, Tony-Tony Chopper, Nico Robin, Franky, and Brook. They will do anything to get the One Piece and become King of the Pirates!", "rate": 74, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Mayumi Tanaka", "Kazuya Nakai", "Akemi Okamura", "Kappei Yamaguchi", "Hiroaki Hirata"], "character": ["Monkey D. Luffy", "Roronoa Zoro", "Nami", "Usopp", "Vinsmoke Sanji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37854   Expand One Piece   (1999) User Score  Play Trailer Overview Years ago, the fearsome pirate king Gol D. Roger was executed, leaving a huge pile of treasure and the famous \"One Piece\" behind. Whoever claims the \"One Piece\" will be named the new pirate king. Monkey D. Luffy, a boy who consumed one of the \"Devil's Fruits\", has it in his head that he'll follow in the footsteps of his idol, the pirate Shanks, and find the One Piece. It helps, of course, that his body has the properties of rubber and he's surrounded by a bevy of skilled fighters and thieves to help him along the way. Monkey D. Luffy brings a bunch of his crew followed by, Roronoa Zoro, Nami, Usopp, Sanji, Tony-Tony Chopper, Nico Robin, Franky, and Brook. They will do anything to get the One Piece and become King of the Pirates! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  29 Images Backdrops  27 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mayumi Tanaka Monkey D. Luffy Kazuya Nakai Roronoa Zoro Akemi Okamura Nami Kappei Yamaguchi Usopp Hiroaki Hirata Vinsmoke Sanji Full Cast & Crew Last Season Original Air Date Original Air Date All episodes (Absolute) Story Arcs (Story Arc) Sagas (Story Arc) Whole Cake Island Arc 2017 | 40 Episodes View All Seasons Social Reviews  0 Discussions  30 Subject Status Replies Last Reply Good show Open 0 by Bloodshot77\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  27 Posters  15 Recommendations   2002-10-03 Naruto 7.5    1986-02-26 Dragon Ball 8.1    2011-10-02 Hunter x Hunter 8.5    2004-10-05 Bleach 7.5    2015-10-04 One-Punch Man 8.2    1989-04-26 Dragon Ball Z 8.1    1996-01-10 Rurouni Kenshin 7.6    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1  Facts Original Name  ワンピース Status  Returning Series Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.toei-anim.co.jp/tv/onep/ Genres Action & Adventure Animation Comedy Keywords friendship bounty friends pirate based on manga shounen anime Content Score 93 Almost there... Top Contributors 91 sp1ti 86 alexcoman t 78 tmdb983464 D 42 Duraldon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}