{"link": "https://www.themoviedb.org/tv/5030?language=en", "title": "Get a Life", "resume": "Get a Life is a television sitcom that was broadcast in the United States on the Fox Network from September 23, 1990, to March 8, 1992. The show stars Chris Elliott as a 30-year-old paperboy named Chris Peterson. Peterson lived in an apartment above his parents' garage. The opening credits depict Chris Peterson delivering newspapers on his bike to the show's theme song, \"Stand\" by R.E.M.\nThe show was a creation of Elliott, Adam Resnick and writer/director David Mirkin. Mirkin was executive producer/showrunner of the series and also directed most of the episodes. Notable writers of the series included Charlie Kaufman, screenwriter of Being John Malkovich; and Bob Odenkirk, co-creator of Mr. Show with Bob and David and Tenacious D.\nThe show was unconventional for a prime time sitcom, and many times the storylines of the episodes were surreal. For example, Elliott's character actually dies in twelve episodes. The causes of death included being crushed by a giant boulder, old age, tonsillitis, stab wounds, gunshot wounds, falling from an airplane, strangulation, getting run over by cars, choking on cereal, and simply exploding. For this reason, it was a struggle for Elliott and Mirkin to get the show on the air. Many of the executives at the Fox Network hated the show and thought it was too disturbing and that Elliott's character was too insane.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Chris Elliott", "Brian Doyle-Murray", "Elinor Donahue", "Taylor Fry", "Sam Robards"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5030   Expand Get a Life   (1990) User Score Overview Get a Life is a television sitcom that was broadcast in the United States on the Fox Network from September 23, 1990, to March 8, 1992. The show stars Chris Elliott as a 30-year-old paperboy named Chris Peterson. Peterson lived in an apartment above his parents' garage. The opening credits depict Chris Peterson delivering newspapers on his bike to the show's theme song, \"Stand\" by R.E.M. The show was a creation of Elliott, Adam Resnick and writer/director David Mirkin. Mirkin was executive producer/showrunner of the series and also directed most of the episodes. Notable writers of the series included Charlie Kaufman, screenwriter of Being John Malkovich; and Bob Odenkirk, co-creator of Mr. Show with Bob and David and Tenacious D. The show was unconventional for a prime time sitcom, and many times the storylines of the episodes were surreal. For example, Elliott's character actually dies in twelve episodes. The causes of death included being crushed by a giant boulder, old age, tonsillitis, stab wounds, gunshot wounds, falling from an airplane, strangulation, getting run over by cars, choking on cereal, and simply exploding. For this reason, it was a struggle for Elliott and Mirkin to get the show on the air. Many of the executives at the Fox Network hated the show and thought it was too disturbing and that Elliott's character was too insane. Featured Crew Chris Elliott Creator David Mirkin Creator Adam Resnick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Elliott Brian Doyle-Murray Elinor Donahue Taylor Fry Sam Robards Full Cast & Crew Last Season Season 2 1991 | 13 Episodes Season 2 of Get a Life premiered on November  9, 1991. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply funny Open 2 by  CaptainJackRussell Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Get a Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 10 zurman1 k 3 kikujiro J 2 Jurginho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}