{"link": "https://www.themoviedb.org/tv/62057?language=en", "title": "GTO: Great Teacher Onizuka", "resume": "Eikichi Onizuka, former gang leader, becomes a teacher of a class of students who torment their teachers and fellow students. Of course they do not do this out of whim, they have their reasons. Onizuka is charged by the chairlady to help these troubled students into a more healthy adulthood, and help rehabilitate the teachers in the process as well.", "rate": 87, "genre": ["Comedy", "Drama"], "cast": ["Takashi Sorimachi", "Nanako Matsushima", "Baku Numata", "Aya Enjoji", "Naohito Fujiki"], "character": ["Onizuka Eikichi", "Fuyutsuki Azusa", "Makoto Fujitomi", "Hiroko Kotani", "Ryuji Saejima"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62057   Expand GTO: Great Teacher Onizuka   (1998) User Score Overview Eikichi Onizuka, former gang leader, becomes a teacher of a class of students who torment their teachers and fellow students. Of course they do not do this out of whim, they have their reasons. Onizuka is charged by the chairlady to help these troubled students into a more healthy adulthood, and help rehabilitate the teachers in the process as well.  Featured Crew Tohru Fujisawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Takashi Sorimachi Onizuka Eikichi Nanako Matsushima Fuyutsuki Azusa Baku Numata Makoto Fujitomi Aya Enjoji Hiroko Kotani Naohito Fujiki Ryuji Saejima Full Cast & Crew Last Season Season 1 1998 | 12 Episodes Season 1 of GTO: Great Teacher Onizuka premiered on July  7, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2009-10-19 Tokyo Dogs 8.5    2012-07-09 Rich Man, Poor Woman 7.8  Facts Original Name  グレート・ティーチャー・オニヅカ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres Comedy Drama Keywords teacher Content Score 100 Yes! Looking good! Top Contributors t 27 taxigps 10 Elizabeth Jennings 10 thirstyhippo 9 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}