{"link": "https://www.themoviedb.org/tv/68406?language=en", "title": "Wasteland", "resume": "When Hana Sikorova, mayor of a northern Bohemian village, stands up to a large coal mining concern that offers villagers large compensation in exchange for abandoning their houses built on land containing brown coal deposits, her fourteen year old daughter Misha disappears. The search for her daughter makes Hana suspicious of the whole community, after years of peaceful coexistence. Under the pressure of unfolding events, the community starts to fall apart and show its true face. Solving the mystery divides the story into several interweaving narratives that ultimately connect in unexpected ways.", "rate": 80, "genre": ["Mystery", "Drama"], "cast": ["Zuzana Stivínová", "Jaroslav Dušek", "Eliška Křenková", "Leoš Noha", "Roman Skamene"], "character": ["Hana Sikorová", "Karel Sikora", "Klára Sikorová", "Rajner", "Lipovský"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68406   Expand Wasteland   (2016) User Score  Play Trailer Overview When Hana Sikorova, mayor of a northern Bohemian village, stands up to a large coal mining concern that offers villagers large compensation in exchange for abandoning their houses built on land containing brown coal deposits, her fourteen year old daughter Misha disappears. The search for her daughter makes Hana suspicious of the whole community, after years of peaceful coexistence. Under the pressure of unfolding events, the community starts to fall apart and show its true face. Solving the mystery divides the story into several interweaving narratives that ultimately connect in unexpected ways. Featured Crew Jan Bílek Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zuzana Stivínová Hana Sikorová Jaroslav Dušek Karel Sikora Eliška Křenková Klára Sikorová Leoš Noha Rajner Roman Skamene Lipovský Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Wasteland premiered on October 30, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Wasteland. You can help by rating TV shows you've seen. Facts Original Name  Pustina Status  Returning Series Network Certification  - Type  Scripted Original Language  Czech Runtime  55m Homepage   http://pustina.hbo.cz/ Genres Mystery Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 29 Razorback121 20 Elizabeth Jennings 16 AyACZE 7 Jiri Roubal  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}