{"link": "https://www.themoviedb.org/tv/34524?language=en", "title": "Teen Wolf", "resume": "Scott McCall, a high school student living in the town of Beacon Hills has his life drastically changed when he's bitten by a werewolf, becoming one himself. He must henceforth learn to balance his problematic new identity with his day-to-day teenage life. The following characters are instrumental to his struggle: Stiles, his best friend; Allison, his love interest who comes from a family of werewolf hunters; and Derek, a mysterious werewolf with a dark past. Throughout the series, he strives to keep his loved ones safe while maintaining normal relationships with them.", "rate": 70, "genre": ["Action", "Adventure", "Mystery", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Tyler Posey", "Dylan O'Brien", "Holland Roden", "Shelley Hennig", "Ian Bohen"], "character": ["Scott McCall", "Stiles Stilinski", "Lydia Martin", "Malia Tate", "Peter Hale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34524   Expand Teen Wolf   (2011) User Score  Play Trailer Overview Scott McCall, a high school student living in the town of Beacon Hills has his life drastically changed when he's bitten by a werewolf, becoming one himself. He must henceforth learn to balance his problematic new identity with his day-to-day teenage life. The following characters are instrumental to his struggle: Stiles, his best friend; Allison, his love interest who comes from a family of werewolf hunters; and Derek, a mysterious werewolf with a dark past. Throughout the series, he strives to keep his loved ones safe while maintaining normal relationships with them. Featured Crew Jeff Davis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  18 Content Issues  2 Images Backdrops  19 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Tyler Posey Scott McCall Dylan O'Brien Stiles Stilinski Holland Roden Lydia Martin Shelley Hennig Malia Tate Ian Bohen Peter Hale Full Cast & Crew Last Season Season 6 2016 | 20 Episodes View All Seasons Social Reviews  0 Discussions  20 Subject Status Replies Last Reply w Scott: Happy Birthday Tyler Posey! Open 0 by wonder2wonder\n      \n     w Lydia: Happy Birthday Holland Roden! Open 0 by wonder2wonder\n      \n     a Can't wait for this show to end. Open 5 by  acontributor Go to Discussions Media Most Popular Videos  2 Backdrops  19 Posters  18 Recommendations   2009-09-10 The Vampire Diaries 6.9    2013-10-03 The Originals 7.2    2016-01-12 Shadowhunters 6.3    2013-09-16 Sleepy Hollow 6.4    2011-10-28 Grimm 6.7    2001-10-16 Smallville 6.9    2011-09-15 The Secret Circle 6.6    2007-09-19 Gossip Girl 6.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 40m, 41m Homepage   http://www.mtv.com/shows/teen_wolf/series.jhtml Genres Action & Adventure Mystery Sci-Fi & Fantasy Drama Keywords high school werewolf creature interspecies romance supernatural teen Content Score 100 Yes! Looking good! Top Contributors R 56 Rebecca 33 Atanas M 27 Manu 25 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}