{"link": "https://www.themoviedb.org/tv/65305?language=en", "title": "Alice in Wonderland", "resume": "A young girl named Alice follows a white rabbit into a hole, only to find herself in Wonderland, where she meets many interesting characters, including the mysterious Cheshire Cat and the terrible Queen of Hearts.", "rate": 56, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Masako Nozawa", "Issei Futamata", "Shozo Iizuka", "Noriko Uemura", "Kumiko Mizukura"], "character": ["Benny Bunny (voice)", "Cheshire Cat (voice)", "Humpty Dumpty (voice)", "Queen of Hearts (voice)", "Celia (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65305   Expand Alice in Wonderland   (1983) User Score Overview A young girl named Alice follows a white rabbit into a hole, only to find herself in Wonderland, where she meets many interesting characters, including the mysterious Cheshire Cat and the terrible Queen of Hearts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Benny Bunny (voice) Issei Futamata Cheshire Cat (voice) Shozo Iizuka Humpty Dumpty (voice) Noriko Uemura Queen of Hearts (voice) Kumiko Mizukura Celia (voice) Full Cast & Crew Last Season Season 1 1983 | 52 Episodes Season 1 of Alice in Wonderland premiered on October 10, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1971-03-07 Die Sendung mit der Maus 6.4    1999-09-06 Sabrina: The Animated Series 5.5    1981-02-14 Wanna bet, that..? 3.2    1975-05-01 The Adventures of Maya the Honey Bee 6.6    2002-06-07 Kim Possible 6.7  Facts Original Name  ふしぎの国のアリス Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords anime Content Score 71 Just a little bit more... Top Contributors P 47 Prototyp206 t 21 tmdb983464 CM 13 Cherche Moi 9 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}