{"link": "https://www.themoviedb.org/tv/31749?language=en", "title": "The Adventures of Batman", "resume": "The Adventures of Batman is an animated television series produced by Lou Schiemer's Filmation studios. It showcased the 12-minute Batman segments from The Batman/Superman Hour, sometimes broken up by and surrounding another cartoon from Filmation's fast growing stream of superhero stars. A re-branded 30-minute version premiered on CBS on September 13, 1969 as Batman with Robin the Boy Wonder. This version was repackaged without the Superman and Superboy segments.\nOver-the-top characters and catchy dramatic music cues gave this version of Batman a realistic look and feel—by cartoon standards of the day. The colors were vibrant and exciting even if the animation was a little stiff and repetitive in places.\nOlan Soule was the voice of Batman and is most likely best remembered for his work on that show, and many others in the Filmation stable. Casey Kasem, the popular radio countdown man in the 1980s, was the voice of Robin the Boy Wonder.\nBatman and Robin would next appear in a The New Scooby-Doo Movies crossover, various versions of Super Friends and The New Adventures of Batman in 1977.", "rate": 74, "genre": ["Animation", "Action", "Adventure"], "cast": ["Ted Knight", "Olan Soule", "Casey Kasem"], "character": ["Commissioner Gordon / Narrator (voice)", "Batman / Bruce Wayne (voice)", "Robin / Dick Grayson / Chief O'Hara  (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31749   Expand The Adventures of Batman   (1968) User Score Overview The Adventures of Batman is an animated television series produced by Lou Schiemer's Filmation studios. It showcased the 12-minute Batman segments from The Batman/Superman Hour, sometimes broken up by and surrounding another cartoon from Filmation's fast growing stream of superhero stars. A re-branded 30-minute version premiered on CBS on September 13, 1969 as Batman with Robin the Boy Wonder. This version was repackaged without the Superman and Superboy segments. Over-the-top characters and catchy dramatic music cues gave this version of Batman a realistic look and feel—by cartoon standards of the day. The colors were vibrant and exciting even if the animation was a little stiff and repetitive in places. Olan Soule was the voice of Batman and is most likely best remembered for his work on that show, and many others in the Filmation stable. Casey Kasem, the popular radio countdown man in the 1980s, was the voice of Robin the Boy Wonder. Batman and Robin would next appear in a The New Scooby-Doo Movies crossover, various versions of Super Friends and The New Adventures of Batman in 1977. Featured Crew Bob Kane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ted Knight Commissioner Gordon / Narrator (voice) Olan Soule Batman / Bruce Wayne (voice) Casey Kasem Robin / Dick Grayson / Chief O'Hara  (voice) Full Cast & Crew Last Season Season 2 1968 | 17 Episodes Season 2 of The Adventures of Batman premiered on September 14, 1968. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1966-09-10 Space Ghost and Dino Boy 7.2    1981-09-12 Spider-Man 6.8    1994-09-24 Fantastic Four 6.7    1987-09-13 The New Statesman 7.9    1975-11-07 Wonder Woman 6.7    1997-05-16 Spawn 7.8    1981-09-10 The Day of the Triffids 6.7    1995-05-28 Dr. Katz, Professional Therapist 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords superhero super power Content Score 64 We're so close, yet so far. Top Contributors N 14 Notamymerrick 8 Banana N 3 Nosirus m 3 movienator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}