{"link": "https://www.themoviedb.org/tv/62760?language=en", "title": "Played", "resume": "The Covert Investigations Unit (CIU) risks going undercover to infiltrate and bring down criminal organizations. In this new style of short-term, high-intensity undercover work, each covert “play” is crafted quickly and executed at an even faster pace. Placed into various worlds of crime without a safety net, the cops are in constant danger, as they repeatedly go off the grid. Wearing wires, coaxing confessions, and setting up stings, the cops of the CIU must think quickly, talk smoothly, and rely on pure instinct. They slip in and out of characters so often that, sometimes, they lose track of who they really are.", "rate": 60, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Lisa Marcos", "Vincent Walsh", "Chandra West", "Dwain Murphy", "Agam Darshi"], "character": ["Detective Constable Maria Cortez", "Detective John Moreland", "Detective Sergeant Rebecca Ellis", "Detective Constable Daniel Price", "Officer Khali Bhatt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62760   Expand Played   (2013) User Score Overview The Covert Investigations Unit (CIU) risks going undercover to infiltrate and bring down criminal organizations. In this new style of short-term, high-intensity undercover work, each covert “play” is crafted quickly and executed at an even faster pace. Placed into various worlds of crime without a safety net, the cops are in constant danger, as they repeatedly go off the grid. Wearing wires, coaxing confessions, and setting up stings, the cops of the CIU must think quickly, talk smoothly, and rely on pure instinct. They slip in and out of characters so often that, sometimes, they lose track of who they really are. Featured Crew Greg Nelson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Marcos Detective Constable Maria Cortez Vincent Walsh Detective John Moreland Chandra West Detective Sergeant Rebecca Ellis Dwain Murphy Detective Constable Daniel Price Agam Darshi Officer Khali Bhatt Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Played premiered on October  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Played. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.ctv.ca/Played Genres Action & Adventure Crime Drama Keywords canada undercover agent toronto cop Content Score 93 Almost there... Top Contributors 35 Banana CM 7 Cherche Moi S 4 Shady12 s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}