{"link": "https://www.themoviedb.org/tv/26051?language=en", "title": "Ghost Story", "resume": "Ghost Story is an American television anthology series that aired for one season on NBC from 1972 to 1973. Executive-produced by William Castle, Ghost Story initially featured supernatural entities such as ghosts, vampires, and witches. By midseason, low ratings led to a title change and a shift -- for the most part -- away from paranormal themes.", "rate": 80, "genre": [], "cast": ["Sebastian Cabot"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26051   Expand Ghost Story   (1972) User Score Overview Ghost Story is an American television anthology series that aired for one season on NBC from 1972 to 1973. Executive-produced by William Castle, Ghost Story initially featured supernatural entities such as ghosts, vampires, and witches. By midseason, low ratings led to a title change and a shift -- for the most part -- away from paranormal themes. Featured Crew William Castle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sebastian Cabot Host Full Cast & Crew Last Season Season 1 1972 | 24 Episodes Season 1 of Ghost Story premiered on September 15, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ghost Story. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords horror anthology Content Score 56 We're so close, yet so far. Top Contributors 9 Banana RK 3 Robert Kling CM 2 Cherche Moi 1 gaetano89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}