{"link": "https://www.themoviedb.org/tv/4656?language=en", "title": "WWE Raw", "resume": "WWE Raw is a professional wrestling television program that currently airs live on Monday evenings on the USA Network in the United States. The show debuted on January 11, 1993. WWE Raw moved from the USA Network to TNN in September, 2000 and then to Spike TV in August, 2003 when TNN was rebranded. On October 3, 2005 WWE Raw returned to the USA Network.\nSince its first episode, WWE Raw has broadcast live from 203 different arenas in 169 cities and towns in ten different nations. As of the show's 1,000th episode, airing on July 23, 2012, WWE Raw has become a three-hour broadcast from two-hours, a format that had previously been reserved for special episodes.", "rate": 63, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4656   Expand WWE Raw   (1993) User Score  Play Trailer Overview WWE Raw is a professional wrestling television program that currently airs live on Monday evenings on the USA Network in the United States. The show debuted on January 11, 1993. WWE Raw moved from the USA Network to TNN in September, 2000 and then to Spike TV in August, 2003 when TNN was rebranded. On October 3, 2005 WWE Raw returned to the USA Network. Since its first episode, WWE Raw has broadcast live from 203 different arenas in 169 cities and towns in ten different nations. As of the show's 1,000th episode, airing on July 23, 2012, WWE Raw has become a three-hour broadcast from two-hours, a format that had previously been reserved for special episodes. Featured Crew Vince McMahon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  118 Content Issues  22 Images Backdrops  17 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 26 2018 | 32 Episodes Season 26 of WWE Raw premiered on January  1, 2018. View All Seasons Social Reviews  0 Discussions  140 Subject Status Replies Last Reply LT What If Someone Ran A 'Fixed' MMA Promotion Like WWE? Open 0 by Lockard The GOAT\n      \n     E Jonathan Coachman is the worst commentator in wrestling history Open 3 by  Enickma CM Punk's second UFC fight is tonight Open 3 by  simian_ninja Go to Discussions Media Most Popular Videos  1 Backdrops  17 Posters  14 Recommendations   1999-04-29 WWE SmackDown Live 7.2    2010-02-23 WWE NXT 7.2    2009-01-11 Total Drama Action 5.7    2012-10-03 WWE Main Event 9.5    1981-09-16 Postman Pat 6.0    1995-09-04 WCW Monday Nitro 9.5    1996-11-12 Never Mind the Buzzcocks 7.5    1997-10-20 Bear in the Big Blue House 7.2  Facts Status  Returning Series Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  180m Homepage   http://www.usanetwork.com/wwe Genres Drama Keywords wrestling Content Score 71 Just a little bit more... Top Contributors 125 tphoenix d 47 domingoss 47 Elizabeth Jennings V 25 Vida13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}