{"link": "https://www.themoviedb.org/tv/61437?language=en", "title": "Cleaners", "resume": "Roxie and Veronica are two gorgeous young women - who also happen to be highly trained contract killers. While on an errand for their boss, an unpleasant surprise in the trunk of their car turns this lethal pair into hunted targets.", "rate": 74, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["David Arquette", "Emmanuelle Chriqui", "Clifton Collins Jr.", "Emily Osment", "Missi Pyle"], "character": ["Frank Barnes", "Veronica", "Julian", "Roxie", "Eileen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61437   Expand Cleaners   (2013) User Score Overview Roxie and Veronica are two gorgeous young women - who also happen to be highly trained contract killers. While on an errand for their boss, an unpleasant surprise in the trunk of their car turns this lethal pair into hunted targets. Featured Crew Paul Leyden Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Arquette Frank Barnes Emmanuelle Chriqui Veronica Clifton Collins Jr. Julian Emily Osment Roxie Missi Pyle Eileen Full Cast & Crew Last Season Season 2 2014 | 12 Episodes Season 2 of Cleaners premiered on August 19, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2016-10-03 Conviction 6.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.crackle.com/c/cleaners Genres Action & Adventure Crime Drama Keywords hitman outlaw contract killer Content Score 79 Pump it up! We're close now. Top Contributors 33 CouchTater 11 Banana CM 7 Cherche Moi TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}