{"link": "https://www.themoviedb.org/tv/64905?language=en", "title": "Science of Stupid", "resume": "This show combines cold hard science with some of the craziest, most spectacular and painful user generated clips ever recorded. Richard Hammond introduces all manner of mishaps featuring brave, if misguided individuals from around the world and then explains the science behind their failure and humiliation with the use of bespoke animations and super slo-mo cinematography. Every episode features between 50 and 60 clips of misadventure – ordinary folk making extraordinary mistakes. Each week watch stunts involving weightlifting, shooting guns or jumping over cars, that have gone wrong, paused, re-wound, and re-played and analysed to determine exactly what went wrong and why. Richard explains the physics, chemistry and biology at play, then presents forensic details to explain the stupidity that resulted in failure. He’ll look at everything including weight, volume, momentum, combustion and even how the brain operates. This is misadventure explained. This is the Science of Stupid.", "rate": 60, "genre": [], "cast": ["Richard Hammond"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64905   Expand Science of Stupid   (2014) User Score  Play Trailer Overview This show combines cold hard science with some of the craziest, most spectacular and painful user generated clips ever recorded. Richard Hammond introduces all manner of mishaps featuring brave, if misguided individuals from around the world and then explains the science behind their failure and humiliation with the use of bespoke animations and super slo-mo cinematography. Every episode features between 50 and 60 clips of misadventure – ordinary folk making extraordinary mistakes. Each week watch stunts involving weightlifting, shooting guns or jumping over cars, that have gone wrong, paused, re-wound, and re-played and analysed to determine exactly what went wrong and why. Richard explains the physics, chemistry and biology at play, then presents forensic details to explain the stupidity that resulted in failure. He’ll look at everything including weight, volume, momentum, combustion and even how the brain operates. This is misadventure explained. This is the Science of Stupid. Featured Crew Richard Hammond Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Richard Hammond Host Full Cast & Crew Last Season Season 5 2017 | 10 Episodes Season 5 of Science of Stupid premiered on September 29, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  1 Recommendations   2012-09-24 Unsealed: Conspiracy Files 5.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://channel.nationalgeographic.com/science-of-stupid/ Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors G 10 Gonçalo g 9 gr8kids R 8 Roland 7 OzDrDj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}