{"link": "https://www.themoviedb.org/tv/72505?language=en", "title": "In Another World With My Smartphone", "resume": "After dying as a result of God's mistake, the main character finds himself in a parallel world, where he begins his second life. His only possessions are the body that God gave back to him and a smartphone that works even in this new world. As he meets all kinds of new people and forges new friendships, he ends up learning the secret to this world. He inherits the legacy of an ancient civilization and works together with the kings of some very laid-back countries on his carefree travels through this new world.", "rate": 93, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72505   Expand In Another World With My Smartphone   (2017) User Score Overview After dying as a result of God's mistake, the main character finds himself in a parallel world, where he begins his second life. His only possessions are the body that God gave back to him and a smartphone that works even in this new world. As he meets all kinds of new people and forges new friendships, he ends up learning the secret to this world. He inherits the legacy of an ancient civilization and works together with the kings of some very laid-back countries on his carefree travels through this new world. Featured Crew Takeyuki Yanase Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of In Another World With My Smartphone premiered on July 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2017-07-03 Restaurant to Another World 8.8    2017-07-02 Knight's & Magic 8.5    2006-10-04 Negima!? Magister Negi Magi 5.9    2008-01-03 Rosario + Vampire 9.1    2017-07-04 Tsuredure Children 8.0    2016-07-10 Tales of Zestiria the X 7.7    2017-01-12 Miss Kobayashi's Dragon Maid 7.7    2005-01-06 Negima! Magister Negi Magi 6.7  Facts Original Name  異世界はスマートフォンとともに。 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://isesuma-anime.jp/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 21 Despair-Paradise Y 9 Yukihara2210 9 Zorro1 k 6 katus89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}