{"link": "https://www.themoviedb.org/tv/66147?language=en", "title": "Section Zéro", "resume": "Set in the near future, multi-national corporations are Europe’s new leaders. One of the most powerful, Promethee, wishes to further secure their growing dominance by replacing the police force with their own private militias, the Black Squad, led by Henry Munro. Following the shooting of his daughter, his life in shambles and darkest secrets exposed, an idealistic law enforcement officer, Sirius, with nowhere to turn, aligns himself with an old cop Franck Varnove. Sirius takes charge of Franck’s clandestine, elite squadron, Section Zéro, to battle these dark, violent militias, promising a return to traditional law enforcement before the world they’ve known disappears forever.", "rate": 63, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Juliette Dol", "Michaël Erpelding", "Stefan Ivanov", "Ola Rapace", "Hilde De Baerdemaeker"], "character": ["Cheyenne Rodriguez", "Tony 'Batskin' Balestra", "Dan Sorensen", "Sirius Becker", "Diane Becker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66147   Expand Section Zéro   (2016) User Score Overview Set in the near future, multi-national corporations are Europe’s new leaders. One of the most powerful, Promethee, wishes to further secure their growing dominance by replacing the police force with their own private militias, the Black Squad, led by Henry Munro. Following the shooting of his daughter, his life in shambles and darkest secrets exposed, an idealistic law enforcement officer, Sirius, with nowhere to turn, aligns himself with an old cop Franck Varnove. Sirius takes charge of Franck’s clandestine, elite squadron, Section Zéro, to battle these dark, violent militias, promising a return to traditional law enforcement before the world they’ve known disappears forever. Featured Crew Olivier Marchal Creator Laurent Guillaume Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Juliette Dol Cheyenne Rodriguez Michaël Erpelding Tony 'Batskin' Balestra Stefan Ivanov Dan Sorensen Ola Rapace Sirius Becker Hilde De Baerdemaeker Diane Becker Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Section Zéro premiered on April  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  1 Recommendations   2014-09-12 Z Nation 6.4    2015-06-05 Sense8 7.7    2008-09-03 Sons of Anarchy 7.8    2015-12-14 The Expanse 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  52m Homepage   http://sectionzero.canalplus.fr/ Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords future war army resistance thriller robot Content Score 100 Yes! Looking good! Top Contributors 73 Julien Lefebvre z 4 zurman1 3 Elizabeth Jennings p 2 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}