{"link": "https://www.themoviedb.org/tv/70445?language=en", "title": "American Playboy: The Hugh Hefner Story", "resume": "A fascinating docuseries chronicling Playboy magazine’s charismatic founder, Hugh Hefner, and his impact on global culture. Told from his unique perspective with never-before-seen footage from his private archive, discover the captivating story about the man behind the bunny.", "rate": 34, "genre": ["Documentary", "Drama"], "cast": ["Hugh Hefner", "Matt Whelan", "Shara Connolly", "Joy Buckle", "Adam Jonas Segaller"], "character": ["Himself", "Hugh Hefner", "Barbi Benton", "Marilyn Cole", "A.C. Spectrosky"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70445   Expand American Playboy: The Hugh Hefner Story   (2017) User Score Overview A fascinating docuseries chronicling Playboy magazine’s charismatic founder, Hugh Hefner, and his impact on global culture. Told from his unique perspective with never-before-seen footage from his private archive, discover the captivating story about the man behind the bunny. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Hefner Himself Matt Whelan Hugh Hefner Shara Connolly Barbi Benton Joy Buckle Marilyn Cole Adam Jonas Segaller A.C. Spectrosky Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of American Playboy: The Hugh Hefner Story premiered on April  7, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Missed Opportunity! Open 1 by  danithang Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2011-04-17 Game of Thrones 8.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  - Homepage   https://www.amazon.com/dp/B01MTEMDSR Genres Documentary Drama Keywords docudrama Content Score 86 Almost there... Top Contributors 43 Elizabeth Jennings b 3 bobgilles 2 TopKek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}