{"link": "https://www.themoviedb.org/tv/4003?language=en", "title": "The Mod Squad", "resume": "The Mod Squad was the enormously successful groundbreaking \"hippie\" undercover cop show that ran on ABC from September 24, 1968, until August 23, 1973. It starred Michael Cole as Pete Cochren, Peggy Lipton as Julie Barnes, Clarence Williams III as Linc Hayes, and Tige Andrews as Captain Adam Greer. The executive producers of the series were Aaron Spelling and Danny Thomas.\nThe iconic counter-culture police series earned six Emmy nominations, four Golden Globe nominations plus one win for Peggy Lipton, one Directors Guild of America award, and four Logies. In 1997 the episode \"Mother of Sorrow\" was ranked #95 on TV Guide's 100 Greatest Episodes of All Time.", "rate": 60, "genre": ["Action", "Adventure", "Drama"], "cast": ["Peggy Lipton", "Clarence Williams III", "Tige Andrews", "Michael Cole"], "character": ["Julie Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4003   Expand The Mod Squad   (1968) User Score Overview The Mod Squad was the enormously successful groundbreaking \"hippie\" undercover cop show that ran on ABC from September 24, 1968, until August 23, 1973. It starred Michael Cole as Pete Cochren, Peggy Lipton as Julie Barnes, Clarence Williams III as Linc Hayes, and Tige Andrews as Captain Adam Greer. The executive producers of the series were Aaron Spelling and Danny Thomas. The iconic counter-culture police series earned six Emmy nominations, four Golden Globe nominations plus one win for Peggy Lipton, one Directors Guild of America award, and four Logies. In 1997 the episode \"Mother of Sorrow\" was ranked #95 on TV Guide's 100 Greatest Episodes of All Time. Featured Crew Buddy Ruskin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Peggy Lipton Julie Barnes Clarence Williams III Tige Andrews Michael Cole Full Cast & Crew Last Season Season 5 1972 | 24 Episodes Season 5 of The Mod Squad premiered on September 14, 1972. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply of its time Open 1 by  clunybrown2017 Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   1965-09-14 Please Don't Eat the Daisies 7.0    1966-09-12 Family Affair 5.4    1965-01-24 Branded 8.3    1974-09-09 Rhoda 4.5    1950-10-28 The Jack Benny Program 8.8    1957-09-18 Wagon Train 6.3    1962-10-01 The Lucy Show 7.0    1957-09-14 Have Gun – Will Travel 8.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords hippie police cop drama Content Score 100 Yes! Looking good! Top Contributors 10 namjoereh73 7 Daemon CM 4 Cherche Moi 3 Pandawan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}