{"link": "https://www.themoviedb.org/tv/62548?language=en", "title": "Cruel Romance", "resume": "Adapted from a Republican-era novel called \"The Fate of Jinxiu\", Cruel Romance tells the story of Rong Jinxiu (Chen Qiao En, a country girl who travels to Shanghai in order to discover why her entire family was killed. Along the way, she meets triad leader Zuo Zhen (Huang Xiao Ming), and after a series of accidents and misunderstandings, the two fall in love. Also vying for Jinxiu's attention is businessman Xiang Yingdong, a businessman and close friend of Zuo Zhen. Ever protective of his woman, however, Zuo Zhen refuses to let other men even come close to Jinxiu – which ultimately pays off when a villainous Japanese man tries to finish off Jinxiu and her remaining family members.", "rate": 0, "genre": ["Action", "Romance"], "cast": ["Huang Xiaoming", "Joe Chen", "Qiao Renliang"], "character": ["Zuo Zhen", "Rong Jin Xiu", "Xiang Ying Dong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62548   Expand Cruel Romance   (2015) User Score Overview Adapted from a Republican-era novel called \"The Fate of Jinxiu\", Cruel Romance tells the story of Rong Jinxiu (Chen Qiao En, a country girl who travels to Shanghai in order to discover why her entire family was killed. Along the way, she meets triad leader Zuo Zhen (Huang Xiao Ming), and after a series of accidents and misunderstandings, the two fall in love. Also vying for Jinxiu's attention is businessman Xiang Yingdong, a businessman and close friend of Zuo Zhen. Ever protective of his woman, however, Zuo Zhen refuses to let other men even come close to Jinxiu – which ultimately pays off when a villainous Japanese man tries to finish off Jinxiu and her remaining family members. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Huang Xiaoming Zuo Zhen Joe Chen Rong Jin Xiu Qiao Renliang Xiang Ying Dong Full Cast & Crew Last Season Season 1 2015 | 40 Episodes Season 1 of Cruel Romance premiered on March  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cruel Romance. You can help by rating TV shows you've seen. Facts Original Name  锦绣缘·华丽冒险 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/jxyhlmx Genres Action Romance Keywords china Content Score 56 We're so close, yet so far. Top Contributors M 42 Maria180493 z 5 zurman1 3 lareina123 N 3 Nosirus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}