{"link": "https://www.themoviedb.org/tv/37680?language=en", "title": "Suits", "resume": "While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as difficult as possible.", "rate": 75, "genre": ["Drama"], "cast": ["Gabriel Macht", "Sarah Rafferty", "Rick Hoffman", "Amanda Schull", "Dulé Hill"], "character": ["Harvey Specter", "Donna Paulsen", "Louis Litt", "Katrina Bennett", "Alex Williams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37680   Expand Suits   (2011) User Score  Play Trailer Overview While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as difficult as possible. Featured Crew Aaron Korsh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  1 Images Backdrops  50 Posters  26 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabriel Macht Harvey Specter Sarah Rafferty Donna Paulsen Rick Hoffman Louis Litt Amanda Schull Katrina Bennett Dulé Hill Alex Williams Full Cast & Crew Current Season Season 8 2018 | 1 Episode Season 8 of Suits premiered on June 18, 2018. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply \"I'm a grown woman. I don't need protecting.\" Open 0 by cursethedarkness\n      \n     w Mike Ross: Happy Birthday Patrick J. Adams! Open 0 by wonder2wonder\n      \n     w Rachel: Happy Birthday Meghan Markle! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  50 Posters  26 Recommendations   2009-10-23 White Collar 7.7    2013-02-01 House of Cards 8.2    2006-10-01 Dexter 8.0    2011-10-02 Homeland 7.3    2004-11-16 House 8.1    2009-01-21 Lie to Me 7.4    2005-09-19 How I Met Your Mother 7.4    2010-07-25 Sherlock 8.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 45m, 67m, 42m, 44m Homepage   http://www.usanetwork.com/suits Genres Drama Keywords lawyer impostor law firm photographic memory paralegal corporate law courtroom drama Content Score 100 Yes! Looking good! Top Contributors 68 Elizabeth Jennings M 51 Mec!as 46 Travis Bell 42 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}