{"link": "https://www.themoviedb.org/tv/62287?language=en", "title": "A.D. The Bible Continues", "resume": "\"A.D. The Bible Continues\" picks up where the smash hit miniseries \"The Bible\" left off, continuing the greatest story ever told and exploring the exciting and inspiring events that followed the Crucifixion of Christ. The immediate aftermath of Christ's death had a massive impact on his disciples, his mother, Mary, and key political and religious leaders of the era, completely altering the entire world in an instant. Beginning at that fateful moment of the Crucifixion and the Resurrection, \"A.D. The Bible Continues\" will focus on the disciples who had to go forward and spread the teachings of Christ to a world dominated by political unrest, and the start of a whole new religion that would dramatically reshape the history of the world.", "rate": 53, "genre": ["Drama"], "cast": ["Fraser Ayres", "Andrew Gower", "Farzana Dua Elahe", "Pedro Lloyd Gardiner", "J\u0097hannes Haukur J\u0097hannesson"], "character": ["Simon the Zealot", "Caligua", "Joanna", "Matthew", "Thomas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62287   Expand A.D. The Bible Continues   (2015) User Score Overview \"A.D. The Bible Continues\" picks up where the smash hit miniseries \"The Bible\" left off, continuing the greatest story ever told and exploring the exciting and inspiring events that followed the Crucifixion of Christ. The immediate aftermath of Christ's death had a massive impact on his disciples, his mother, Mary, and key political and religious leaders of the era, completely altering the entire world in an instant. Beginning at that fateful moment of the Crucifixion and the Resurrection, \"A.D. The Bible Continues\" will focus on the disciples who had to go forward and spread the teachings of Christ to a world dominated by political unrest, and the start of a whole new religion that would dramatically reshape the history of the world. Featured Crew Roma Downey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fraser Ayres Simon the Zealot Andrew Gower Caligua Farzana Dua Elahe Joanna Pedro Lloyd Gardiner Matthew J\u0097hannes Haukur J\u0097hannesson Thomas Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of A.D. The Bible Continues premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for A.D. The Bible Continues. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on A.D. The Bible Continues. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage   http://www.nbc.com/ad-the-bible-continues Genres Drama Keywords religion miniseries Content Score 93 Almost there... Top Contributors 19 CouchTater o 7 onlinemoviestar 7 Banana TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}