{"link": "https://www.themoviedb.org/tv/14180?language=en", "title": "The Passion", "resume": "The Passion is a television drama serial produced by the BBC and HBO Films in association with Deep Indigo Productions. It tells the story of the last week in the life of Jesus. The serial was first proposed by Peter Fincham in 2006, on the success of the contemporary-set Manchester Passion. Writer Frank Deasy and producer Nigel Stafford-Clark were inspired to make a drama that opened up the story beyond the \"vacuum\" it is often told in. They did this by expanding the roles of Pontius Pilate and Caiaphas, and exploring the politics of Judea at the time. Deasy and Stafford-Clark were aided by scholar Mark Goodacre, with whom they put together an extensive research manual about the topic.\nThe part of Jesus is played by Joseph Mawle, who researched the role by reading the Gospels and research papers. Other main roles were played by Paloma Baeza, Ben Daniels, James Nesbitt, David Oyelowo, and Penelope Wilton. It was directed by Michael Offer on location in Morocco from 27 August to 23 October 2007, and broadcast on BBC One in four parts from 16 to 23 March 2008. Its viewing figures ranged from 3.2 million to 4.9 million people, and it received generally positive critical reception.", "rate": 33, "genre": ["Drama"], "cast": ["Ben Daniels", "Penelope Wilton", "James Nesbitt", "David Oyelowo", "Joseph Mawle"], "character": ["Mary", "Pilate", "Joseph of Arimathea", "Jesus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14180   Expand The Passion   (2008) User Score Overview The Passion is a television drama serial produced by the BBC and HBO Films in association with Deep Indigo Productions. It tells the story of the last week in the life of Jesus. The serial was first proposed by Peter Fincham in 2006, on the success of the contemporary-set Manchester Passion. Writer Frank Deasy and producer Nigel Stafford-Clark were inspired to make a drama that opened up the story beyond the \"vacuum\" it is often told in. They did this by expanding the roles of Pontius Pilate and Caiaphas, and exploring the politics of Judea at the time. Deasy and Stafford-Clark were aided by scholar Mark Goodacre, with whom they put together an extensive research manual about the topic. The part of Jesus is played by Joseph Mawle, who researched the role by reading the Gospels and research papers. Other main roles were played by Paloma Baeza, Ben Daniels, James Nesbitt, David Oyelowo, and Penelope Wilton. It was directed by Michael Offer on location in Morocco from 27 August to 23 October 2007, and broadcast on BBC One in four parts from 16 to 23 March 2008. Its viewing figures ranged from 3.2 million to 4.9 million people, and it received generally positive critical reception. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Daniels Penelope Wilton Mary James Nesbitt Pilate David Oyelowo Joseph of Arimathea Joseph Mawle Jesus Full Cast & Crew Last Season Season 1 2008 | 4 Episodes Season 1 of The Passion premiered on March 16, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Passion. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Miniseries Original Language  English Runtime  172m, 60m Homepage   http://www.bbc.co.uk/programmes/b009mgrw Genres Drama Keywords jesus christ crucifixion jerusalem religion miniseries Content Score 86 Almost there... Top Contributors TB 24 TMDb Bot 7 Banana R 5 Rebecca VA 2 Viktor Andersson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}