{"link": "https://www.themoviedb.org/tv/10977?language=en", "title": "The Wizard", "resume": "The Wizard is a live-action, family friendly, action/adventure series created by Michael Berk, Douglas Schwartz, and Paul B. Radin. The series included lessons in diversity, friendship, imagination, respect, and never giving up.", "rate": 80, "genre": ["Action", "Adventure"], "cast": ["Fran Ryan", "David Rappaport", "Douglas Barr", "Roddy McDowall", "Frank Welker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10977   Expand The Wizard   (1986) User Score Overview The Wizard is a live-action, family friendly, action/adventure series created by Michael Berk, Douglas Schwartz, and Paul B. Radin. The series included lessons in diversity, friendship, imagination, respect, and never giving up. Featured Crew Michael Berk Creator Douglas Schwartz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fran Ryan David Rappaport Douglas Barr Roddy McDowall Frank Welker Full Cast & Crew Last Season Season 1 1986 | 19 Episodes Season 1 of The Wizard premiered on September  9, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Wizard. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.thewizardtvfansite.com/ Genres Action & Adventure Keywords inventor little people traveller ex spy Content Score 93 Almost there... Top Contributors d 9 denis 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}