{"link": "https://www.themoviedb.org/tv/68561?language=en", "title": "Behind Your Smile", "resume": "A curse condemns Zhao Yi Ting to immortality removing his ability to reincarnate. Living among mortal humans forever he toys with man's greedy tendencies and his life becomes cold and meaningless. But when he meets Lei Xin Yu, a young woman whose wealthy family has fallen on hard times, everything changes. He is drawn to Xin Yu in a way that he has not felt in a long time. Will Yi Ting discover a new lease on life through Xin Yu?", "rate": 75, "genre": ["Drama"], "cast": ["Eugenie Liu", "Shih Hong", "Esther Yang", "Sean Lee", "Marcus Chang"], "character": ["Lei Xin Yu", "Tang Qian Ni", "Jian Xiao Yue", "Zhong Qian Ren", "Zhao Yi Ting"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68561   Expand Behind Your Smile   (2016) User Score Overview A curse condemns Zhao Yi Ting to immortality removing his ability to reincarnate. Living among mortal humans forever he toys with man's greedy tendencies and his life becomes cold and meaningless. But when he meets Lei Xin Yu, a young woman whose wealthy family has fallen on hard times, everything changes. He is drawn to Xin Yu in a way that he has not felt in a long time. Will Yi Ting discover a new lease on life through Xin Yu? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eugenie Liu Lei Xin Yu Shih Hong Tang Qian Ni Esther Yang Jian Xiao Yue Sean Lee Zhong Qian Ren Marcus Chang Zhao Yi Ting Full Cast & Crew Last Season Season 1 2016 | 19 Episodes Season 1 of Behind Your Smile premiered on November 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Behind Your Smile. You can help by rating TV shows you've seen. Facts Original Name  浮士德的微笑 Status  Ended Networks TTV Main Channel Sanlih E-Television Certification  - Type  Scripted Original Language  Chinese Runtime  90m Homepage   http://www.ttv.com.tw/drama16/FaustSmile/default.asp Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 31 wufatmio 9 Elizabeth Jennings s 3 sheva_vitali M 2 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}