{"link": "https://www.themoviedb.org/tv/34440?language=en", "title": "The Trip", "resume": "The Trip is a television sitcom series first broadcast on BBC Two and BBC HD in the United Kingdom. The series stars Steve Coogan and Rob Brydon as fictionalised versions of themselves undertaking a restaurant tour of northern England.\nThe partly improvised six episode series was first broadcast on Monday nights at 10:00pm on BBC Two starting on 1 November 2010. The series was edited into a feature film which premiered at the Toronto International Film festival in September 2010 and was released in the US by IFC Films in 2011.", "rate": 77, "genre": ["Comedy"], "cast": ["Steve Coogan", "Rob Brydon", "Claire Keelan", "Rebecca Johnson", "Marta Barrio"], "character": ["Steve", "Rob"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34440   Expand The Trip   (2010) User Score  Play Trailer Overview The Trip is a television sitcom series first broadcast on BBC Two and BBC HD in the United Kingdom. The series stars Steve Coogan and Rob Brydon as fictionalised versions of themselves undertaking a restaurant tour of northern England. The partly improvised six episode series was first broadcast on Monday nights at 10:00pm on BBC Two starting on 1 November 2010. The series was edited into a feature film which premiered at the Toronto International Film festival in September 2010 and was released in the US by IFC Films in 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Coogan Steve Rob Brydon Rob Claire Keelan Rebecca Johnson Marta Barrio Full Cast & Crew Last Season Season 3 2017 | 6 Episodes Season 3 of The Trip premiered on April  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2015-04-09 The Comedians 6.4    2004-01-06 Nighty Night 8.8    1997-01-29 Brass Eye 8.0    2010-02-19 The Ricky Gervais Show 7.9    2013-10-20 Toast of London 6.8    2002-11-07 15 Storeys High 8.0    1999-01-11 The League of Gentlemen 7.4    2011-11-10 Life's Too Short 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00vsvv5 Genres Comedy Keywords england restaurant sitcom british humour Content Score 93 Almost there... Top Contributors 21 Joe Carson 7 Banana D 3 Daxwoman 2 alexhansford  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}