{"link": "https://www.themoviedb.org/tv/35447?language=en", "title": "Invader! Squid Girl", "resume": "Squid Girl has come to the land from the depths of the sea to conquer humanity in revenge for pollution of the ocean. Unfortunately she ruins the first house she uses as an invasion base and has to work to pay for repairs. Of course, she can't overcome the Aizawa sisters who manage the house, so who knows whether she can subjugate humankind.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Yuichi Nakamura"], "character": ["Goro Arashiyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35447   Expand Invader! Squid Girl   (2010) User Score Overview Squid Girl has come to the land from the depths of the sea to conquer humanity in revenge for pollution of the ocean. Unfortunately she ruins the first house she uses as an invasion base and has to work to pay for repairs. Of course, she can't overcome the Aizawa sisters who manage the house, so who knows whether she can subjugate humankind. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuichi Nakamura Goro Arashiyama Full Cast & Crew Last Season Shinryaku! ika musume season 2 2011 | 12 Episodes Season 2 of Invader! Squid Girl premiered on September 27, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Invader! Squid Girl. You can help by rating TV shows you've seen. Facts Original Name  侵略！イカ娘 Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords invasion slice of life squid anime Content Score 56 We're so close, yet so far. Top Contributors 16 Ailurus Fulgens 4 majordrake m 3 magoozin 2 WillofOwn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}