{"link": "https://www.themoviedb.org/tv/78175?language=en", "title": "Fukuyadou Honpo: Kyoto Love Story", "resume": "Fukuyadou Honpo is a traditional Kyoto sweet shop with 450 years of history. This romantic drama depicts the careers, love lives and dreams of three sisters.", "rate": 0, "genre": ["Comedy", "Family"], "cast": ["Akari Hayami", "Hayato Ichihara", "Nozomi Sasaki", "Kenjiro Yamashita", "Fujiko Kojima"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78175   Expand Fukuyadou Honpo: Kyoto Love Story   (2016) User Score Overview Fukuyadou Honpo is a traditional Kyoto sweet shop with 450 years of history. This romantic drama depicts the careers, love lives and dreams of three sisters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akari Hayami Hayato Ichihara Nozomi Sasaki Kenjiro Yamashita Fujiko Kojima Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Fukuyadou Honpo: Kyoto Love Story premiered on October 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fukuyadou Honpo: Kyoto Love Story. You can help by rating TV shows you've seen. Facts Original Name  福家堂本舗-KYOTO LOVE STORY- Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  35m Homepage  - Genres Comedy Family Keywords romance Content Score 86 Almost there... Top Contributors 22 du17 M 20 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}