{"link": "https://www.themoviedb.org/tv/4963?language=en", "title": "Judge John Deed", "resume": "Judge John Deed is a British legal drama television series produced by the BBC in association with One-Eyed Dog for BBC One. It was created by G.F. Newman and stars Martin Shaw as Sir John Deed, a High Court judge who tries to seek real justice in the cases before him. It also stars Jenny Seagrove as the barrister Jo Mills, frequently the object of Deed's desire. A pilot episode was broadcast on 9 January 2001, followed by the first full series on 26 November 2001. The sixth and last series concluded on 18 January 2007. The programme then went on an indefinite break after Shaw became involved in another television programme, and he and Seagrove expressed a wish for the format of the series to change before they filmed new episodes. By 2009, the series had officially been cancelled. The six series produced make it the longest-running BBC legal drama.\nThe factual accuracy of the series is often criticised by legal professionals and journalists; many of the decisions taken by Deed are unlikely to happen in a real court. The romanticised vision of the court system created by Newman caused a judge to issue a warning to a jury not to let the series influence their view of trials—referring to an episode where Deed flouts rules when called up for jury duty. Another episode led to complaints about biased and incorrect information about the MMR vaccine, leading the BBC to ban repeats of it in its original form. All six series have been released on DVD in the UK.", "rate": 60, "genre": ["Drama"], "cast": ["Jenny Seagrove", "Martin Shaw", "Louisa Clein", "Donald Sinden", "Simon Chandler"], "character": ["Jo Mills", "Judge John Deed", "Charlie Deed"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4963   Expand Judge John Deed   (2001) User Score Overview Judge John Deed is a British legal drama television series produced by the BBC in association with One-Eyed Dog for BBC One. It was created by G.F. Newman and stars Martin Shaw as Sir John Deed, a High Court judge who tries to seek real justice in the cases before him. It also stars Jenny Seagrove as the barrister Jo Mills, frequently the object of Deed's desire. A pilot episode was broadcast on 9 January 2001, followed by the first full series on 26 November 2001. The sixth and last series concluded on 18 January 2007. The programme then went on an indefinite break after Shaw became involved in another television programme, and he and Seagrove expressed a wish for the format of the series to change before they filmed new episodes. By 2009, the series had officially been cancelled. The six series produced make it the longest-running BBC legal drama. The factual accuracy of the series is often criticised by legal professionals and journalists; many of the decisions taken by Deed are unlikely to happen in a real court. The romanticised vision of the court system created by Newman caused a judge to issue a warning to a jury not to let the series influence their view of trials—referring to an episode where Deed flouts rules when called up for jury duty. Another episode led to complaints about biased and incorrect information about the MMR vaccine, leading the BBC to ban repeats of it in its original form. All six series have been released on DVD in the UK. Featured Crew G. F. Newman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jenny Seagrove Jo Mills Martin Shaw Judge John Deed Louisa Clein Charlie Deed Donald Sinden Simon Chandler Full Cast & Crew Last Season Season 6 2007 | 4 Episodes Season 6 of Judge John Deed premiered on January  9, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2001-09-24 Murphy's Law 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/drama/judge Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors w 3 webmaster 2 Owla 1 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}