{"link": "https://www.themoviedb.org/tv/34092?language=en", "title": "Rune Soldier", "resume": "Rune Soldier is an anime and manga series based on the original light novel series by Ryo Mizuno, which features soldier Louie as the hero. The series takes place on the continent of Alecrast on the world called Forcelia, and is related to the novel, anime, and manga series Sword World. It is a sibling series to Record of Lodoss War, taking place on a continent north of Lodoss Island.", "rate": 85, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy", "Action", "Adventure"], "cast": ["Sayuri", "Akiko Yajima", "Mugihito", "Katsuyuki Konishi", "Minami Takayama"], "character": ["Jenny", "Eyra", "Carwess", "Louie", "Genie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34092   Expand Rune Soldier   (2001) User Score Overview Rune Soldier is an anime and manga series based on the original light novel series by Ryo Mizuno, which features soldier Louie as the hero. The series takes place on the continent of Alecrast on the world called Forcelia, and is related to the novel, anime, and manga series Sword World. It is a sibling series to Record of Lodoss War, taking place on a continent north of Lodoss Island. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sayuri Jenny Akiko Yajima Eyra Mugihito Carwess Katsuyuki Konishi Louie Minami Takayama Genie Full Cast & Crew Last Season Season 1 2001 | 24 Episodes Season 1 of Rune Soldier premiered on April  1, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Rune Soldier. You can help by rating TV shows you've seen. Facts Original Name  魔法戦士リウイ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.jcstaff.co.jp/sho-sai/ri-shokai/riui-syokai.htm Genres Animation Sci-Fi & Fantasy Comedy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 6 asura766 d 4 diablo1 h 3 hare0408 1 Ritz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}