{"link": "https://www.themoviedb.org/tv/18856?language=en", "title": "Hawthorne", "resume": "Hawthorne is an hour-long medical drama on the TNT television network starring Jada Pinkett Smith and Michael Vartan. It premiered on June 16, 2009. On Thursday, September 16, 2010, it was announced that Hawthorne has been renewed for a third and final season consisting of 10 episodes. The third and final season of the show premiered on June 14, 2011. On September 2, 2011, it was announced that TNT had decided not to renew HawthoRNe, so the Season 3 finale, a cliffhanger, was the series finale.", "rate": 51, "genre": ["Drama"], "cast": ["Michael Vartan", "Jada Pinkett Smith", "Christina Moore", "David Julian Hirsh", "Suleka Mathew"], "character": ["Dr. Tom Wakefield", "Christina Hawthorne", "Candy Sullivan", "Ray Stein", "Bobbie Jackson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18856   Expand Hawthorne   (2009) User Score  Play Trailer Overview Hawthorne is an hour-long medical drama on the TNT television network starring Jada Pinkett Smith and Michael Vartan. It premiered on June 16, 2009. On Thursday, September 16, 2010, it was announced that Hawthorne has been renewed for a third and final season consisting of 10 episodes. The third and final season of the show premiered on June 14, 2011. On September 2, 2011, it was announced that TNT had decided not to renew HawthoRNe, so the Season 3 finale, a cliffhanger, was the series finale. Featured Crew John Masius Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  12 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Vartan Dr. Tom Wakefield Jada Pinkett Smith Christina Hawthorne Christina Moore Candy Sullivan David Julian Hirsh Ray Stein Suleka Mathew Bobbie Jackson Full Cast & Crew Last Season Season 3 2011 | 10 Episodes Season 3 of Hawthorne premiered on June 14, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Christina Hawthorne: Happy Birthday Jada Pinkett Smith! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  5 Recommendations   1996-09-28 Early Edition 6.7  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.tnt.tv/series/hawthorne/ Genres Drama Keywords nurse hospital medical drama Content Score 100 Yes! Looking good! Top Contributors 15 Banana 5 Atanas R 4 Rebecca a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}