{"link": "https://www.themoviedb.org/tv/63210?language=en", "title": "Shadowhunters", "resume": "When Clary Fray's mother has disappeared, Clary joins a band of Shadowhunters; demon killing hunters, and gets caught up in a plan to save the world.", "rate": 63, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Katherine McNamara", "Dominic Sherwood", "Alberto Rosende", "Matthew Daddario", "Emeraude Toubia"], "character": ["Clarissa \"Clary\" Fray", "Jace Wayland", "Simon Lewis", "Alexander \"Alec\" Lightwood", "Isabelle \"Izzy\" Lightwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63210   Expand Shadowhunters   (2016) User Score  Play Trailer Overview When Clary Fray's mother has disappeared, Clary joins a band of Shadowhunters; demon killing hunters, and gets caught up in a plan to save the world. Featured Crew Ed Decter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  2 Images Backdrops  18 Posters  7 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine McNamara Clarissa \"Clary\" Fray Dominic Sherwood Jace Wayland Alberto Rosende Simon Lewis Matthew Daddario Alexander \"Alec\" Lightwood Emeraude Toubia Isabelle \"Izzy\" Lightwood Full Cast & Crew Current Season Season 3 2018 | 10 Episodes Season 3 of Shadowhunters premiered on March 20, 2018. View All Seasons Social Reviews  1 Discussions  16 A review by KarmaKing  10.0 Written by  KarmaKing  on September 21, 2017 A very well done series! There are many strong characters that really spice up the plot at all directions. Plot twists, drama, love stories and very nice and well done fighting scenes. The actors are excellent too and each one matches so much their role! Amazing series and very different! Read All Reviews Media Most Popular Videos  2 Backdrops  18 Posters  7 Recommendations   2013-10-03 The Originals 7.2    2015-12-16 The Magicians 6.8    2016-01-05 The Shannara Chronicles 6.4    2016-01-21 DC's Legends of Tomorrow 6.1    2015-06-02 Stitchers 6.3    2016-01-25 Lucifer 7.3    2015-06-19 Killjoys 6.7    2013-10-06 Witches of East End 6.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.shadowhunterstv.com/ Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords magic vampire werewolf demon warlock shadowhunter supernatural teen fighting supernatural based on young adult novel rune Content Score 100 Yes! Looking good! Top Contributors 189 Marr 🇳🇱 110 Banana V 40 Vaine 38 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}