{"link": "https://www.themoviedb.org/tv/65989?language=en", "title": "Kangoku Gakuen: Prison School", "resume": "5 male students enrolls at a school that has all female students. The boarding school was formerly an all-girls high school until the new school year. The student council then places the 5 male students in a place known as the prison on charges that they were peeping on the girls in the showers. The 5 male students struggle to escape from the prison. ~~ Based on the manga series with the same name by Hiramoto Akira.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Garigari Garikuson", "Daiki Miyagi", "Taishi Nakagawa", "Hirona Yamazaki", "Aoi Morikawa"], "character": ["Reiji Ando", "Jouji Nezu", "Kiyoshi Fujino", "Mari Kurihara", "Hana Midorikawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65989   Expand Kangoku Gakuen: Prison School   (2015) User Score Overview 5 male students enrolls at a school that has all female students. The boarding school was formerly an all-girls high school until the new school year. The student council then places the 5 male students in a place known as the prison on charges that they were peeping on the girls in the showers. The 5 male students struggle to escape from the prison. ~~ Based on the manga series with the same name by Hiramoto Akira. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Garigari Garikuson Reiji Ando Daiki Miyagi Jouji Nezu Taishi Nakagawa Kiyoshi Fujino Hirona Yamazaki Mari Kurihara Aoi Morikawa Hana Midorikawa Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of Kangoku Gakuen: Prison School premiered on October 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kangoku Gakuen: Prison School. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 26 Hamid Mohammadi 12 death72 w 11 wolff92 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}