{"link": "https://www.themoviedb.org/tv/3208?language=en", "title": "Icons", "resume": "Icons was a documentary TV show on G4 that originally focused on significant people, companies, products, history, and milestones in world of video games. It was relaunched in 2006 and focused entirely on pop culture. It was cancelled soon afterwards.\nOn May 10, 2006, it was announced that Icons was relaunching on June 3 with an episode focusing on J.J. Abrams. The show will feature a broader scope on things and people \"men 18–34 care about, admire and emulate.\" Future episodes would focus on Marc Ecko, The Onion, and Family Guy. This change in format had been suspected, due to the recent episodes about George A. Romero, Frank Miller and the history of the King Kong franchise.\nThe classic video game themed episodes continued to air on the network sporadically until 2008, under the new name of Game Makers.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3208   Expand Icons   (2002) User Score Overview Icons was a documentary TV show on G4 that originally focused on significant people, companies, products, history, and milestones in world of video games. It was relaunched in 2006 and focused entirely on pop culture. It was cancelled soon afterwards. On May 10, 2006, it was announced that Icons was relaunching on June 3 with an episode focusing on J.J. Abrams. The show will feature a broader scope on things and people \"men 18–34 care about, admire and emulate.\" Future episodes would focus on Marc Ecko, The Onion, and Family Guy. This change in format had been suspected, due to the recent episodes about George A. Romero, Frank Miller and the history of the King Kong franchise. The classic video game themed episodes continued to air on the network sporadically until 2008, under the new name of Game Makers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2006 | 18 Episodes Season 5 of Icons premiered on June  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Icons. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.g4tv.com/icons Genres Documentary Keywords video game Content Score 56 We're so close, yet so far. Top Contributors 3 Banana 1 lineker 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}