{"link": "https://www.themoviedb.org/tv/5920?language=en", "title": "The Mentalist", "resume": "Patrick Jane, a former celebrity psychic medium, uses his razor sharp skills of observation and expertise at \"reading\" people to solve serious crimes with the California Bureau of Investigation.", "rate": 74, "genre": ["Mystery", "Drama"], "cast": ["Simon Baker", "Robin Tunney", "Tim Kang", "Amanda Righetti", "Rockmond Dunbar"], "character": ["Patrick Jane", "Teresa Lisbon", "Kimball Cho", "Grace Van Pelt", "FBI Agent Dennis Abbott"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5920   Expand The Mentalist   (2008) User Score  Play Trailer Overview Patrick Jane, a former celebrity psychic medium, uses his razor sharp skills of observation and expertise at \"reading\" people to solve serious crimes with the California Bureau of Investigation. Featured Crew Bruno Heller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  2 Images Backdrops  11 Posters  34 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Baker Patrick Jane Robin Tunney Teresa Lisbon Tim Kang Kimball Cho Amanda Righetti Grace Van Pelt Rockmond Dunbar FBI Agent Dennis Abbott Full Cast & Crew Last Season Season 7 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply m Gave up after 2 episodes. Open 1 by  microscope w Patrick Jane: Happy Birthday Simon Baker! Open 0 by wonder2wonder\n      \n     w Teressa: Happy Birthday Robin Tunney! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  34 Recommendations   2009-01-21 Lie to Me 7.4    2009-03-08 Castle 7.3    2009-10-23 White Collar 7.7    2011-09-22 Person of Interest 7.8    2006-03-05 Numb3rs 6.5    2008-09-09 Fringe 8.1    2004-11-16 House 8.1    2005-09-12 Bones 7.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   https://www.warnerbros.co.uk/tv/the-mentalist/ Genres Mystery Drama Keywords california con man cops serial killer criminal investigation people reader criminal consultant Content Score 100 Yes! Looking good! Top Contributors 216 Marr 🇳🇱 116 seawolf 70 BudsieBuds 37 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}