{"link": "https://www.themoviedb.org/tv/39576?language=en", "title": "NY Ink", "resume": "NY Ink is an American reality documentary television series that debuted June 2, 2011, on TLC. TLC renewed the series for a second season in August 2011, also noting that the series' first season averaged 1.3 million viewers per episode. Filming for the third season started in August 2012 with the season premiering on April 4, 2013.", "rate": 50, "genre": ["Documentary"], "cast": ["Ami James"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39576   Expand NY Ink   (2011) User Score Overview NY Ink is an American reality documentary television series that debuted June 2, 2011, on TLC. TLC renewed the series for a second season in August 2011, also noting that the series' first season averaged 1.3 million viewers per episode. Filming for the third season started in August 2012 with the season premiering on April 4, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ami James Full Cast & Crew Last Season Season 3 2013 | 5 Episodes Season 3 of NY Ink premiered on April  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on NY Ink. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://tlc.howstuffworks.com/tv/ny-ink Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors R 1 Rich  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}