{"link": "https://www.themoviedb.org/tv/234?language=en", "title": "My Gym Partner's a Monkey", "resume": "My Gym Partner's a Monkey is an American animated television series created by Tim Cahill and Julie McNally-Cahill and produced by Cartoon Network Studios. It premiered on Cartoon Network on December 26, 2005, and on The WB Television Network on January 7, 2006. The story revolves around Adam Lyon, a human who, after a clerical error listed his surname as \"Lion,\" is forced to transfer to Charles Darwin Middle School, a school for local anthropomorphic zoo animals, where he is partnered with Jake Spidermonkey in gym, with whom he quickly becomes best friends.\nThe series aired 96 episodes, one special and a feature film during its run. The series ended its 4-season run on November 27, 2008. On April 27, 2012, this series returned to Cartoon Network to show reruns on the revived block, Cartoon Planet. Two DVD volumes have been released in 2007 and 2008. The first season was recently put on Netflix, along with other Cartoon Network shows, but it's in widescreen for unknown reasons..\nMy Gym Partner's a Monkey was a ratings success for Cartoon Network, gaining millions of viewers. The series was met with generally positive reviews from critics. It was nominated for four Annie Awards and won an Emmy Award.", "rate": 53, "genre": ["Animation"], "cast": ["Rick Gomez", "Cree Summer", "Maurice LaMarche", "Phil LaMarr", "Brian Doyle-Murray"], "character": ["Windsor Gorilla / Slips Python", "Kerry", "Principal Poncherello Pegone Pixiefrog", "Virgil \"Bull\" Sharkowski", "Coach Tiffany Gills"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 234   Expand My Gym Partner's a Monkey   (2005) User Score Overview My Gym Partner's a Monkey is an American animated television series created by Tim Cahill and Julie McNally-Cahill and produced by Cartoon Network Studios. It premiered on Cartoon Network on December 26, 2005, and on The WB Television Network on January 7, 2006. The story revolves around Adam Lyon, a human who, after a clerical error listed his surname as \"Lion,\" is forced to transfer to Charles Darwin Middle School, a school for local anthropomorphic zoo animals, where he is partnered with Jake Spidermonkey in gym, with whom he quickly becomes best friends. The series aired 96 episodes, one special and a feature film during its run. The series ended its 4-season run on November 27, 2008. On April 27, 2012, this series returned to Cartoon Network to show reruns on the revived block, Cartoon Planet. Two DVD volumes have been released in 2007 and 2008. The first season was recently put on Netflix, along with other Cartoon Network shows, but it's in widescreen for unknown reasons.. My Gym Partner's a Monkey was a ratings success for Cartoon Network, gaining millions of viewers. The series was met with generally positive reviews from critics. It was nominated for four Annie Awards and won an Emmy Award. Featured Crew Julie McNally Cahill Creator Timothy Cahill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rick Gomez Windsor Gorilla / Slips Python Cree Summer Kerry Maurice LaMarche Principal Poncherello Pegone Pixiefrog Phil LaMarr Virgil \"Bull\" Sharkowski Brian Doyle-Murray Coach Tiffany Gills Full Cast & Crew Last Season Season 4 2007 | 13 Episodes Season 4 of My Gym Partner's a Monkey premiered on September 17, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2001-06-08 Time Squad 6.4    2008-06-05 The Marvelous Misadventures of Flapjack 5.9    2002-12-06 Codename: Kids Next Door 6.5    2007-11-16 Chowder 6.5    2005-07-08 Camp Lazlo 5.6    2005-09-17 Johnny Test 4.2    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    2004-08-13 Foster's Home for Imaginary Friends 6.8  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.cartoonnetwork.com/tv_shows/gympartner/index.html Genres Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 24 Robson Guedes Vieira i 21 icarus29 21 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}