{"link": "https://www.themoviedb.org/tv/63525?language=en", "title": "Hyperdimension Neptunia", "resume": "This is Gameindustri. Beings called Goddesses rule the countries of this unreal world. The four goddesses govern four states: Planeptune, Lastation, Lowee and Leanbox. For many long years these countries fought each other over the Share, the source of the Goddesses' power. However, fearful that the conflict would pointlessly erode their strength, the goddesses signed a Friendship Treaty forbidding them from taking the Share by force. Under the treaty, the Goddesses and their younger sisters took a step forward to a new stage in their relations. It is the dawn of a new, dynamic era marked occasionally by shared laughter, disputes as well as cooperation. But what does the future hold in store for Gameindustri...?", "rate": 85, "genre": ["Animation", "Comedy"], "cast": ["Kana Ueda", "Neeko", "Yuuki Fujiwara", "Rie Tanaka", "Aoi Yuki"], "character": ["IF", "Warechu (Pirachu)", "Anonedeath", "Neptune/Purple Heart", "Pish (Peashy)/Yellow Heart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63525   Expand Hyperdimension Neptunia   (2013) User Score Overview This is Gameindustri. Beings called Goddesses rule the countries of this unreal world. The four goddesses govern four states: Planeptune, Lastation, Lowee and Leanbox. For many long years these countries fought each other over the Share, the source of the Goddesses' power. However, fearful that the conflict would pointlessly erode their strength, the goddesses signed a Friendship Treaty forbidding them from taking the Share by force. Under the treaty, the Goddesses and their younger sisters took a step forward to a new stage in their relations. It is the dawn of a new, dynamic era marked occasionally by shared laughter, disputes as well as cooperation. But what does the future hold in store for Gameindustri...? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Ueda IF Neeko Warechu (Pirachu) Yuuki Fujiwara Anonedeath Rie Tanaka Neptune/Purple Heart Aoi Yuki Pish (Peashy)/Yellow Heart Full Cast & Crew Last Season Original Air Date Original Air Date Absolute Order (Absolute) Season 1 2013 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hyperdimension Neptunia. You can help by rating TV shows you've seen. Facts Original Name  超次元ゲイム ネプテューヌ The Animation Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://nep-anime.tv Genres Animation Comedy Keywords ecchi anime Content Score 86 Almost there... Top Contributors 79 miryoku 14 Banana 11 Elizabeth Jennings 8 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}