{"link": "https://www.themoviedb.org/tv/68059?language=en", "title": "The Level", "resume": "A police detective finds herself at the centre of the most dangerous case of her life when she is seconded on to the investigation into the murder of a drugs trafficker. What nobody around her knows is that she is the missing witness that the police and the killer are searching for.", "rate": 65, "genre": ["Drama"], "cast": ["Karla Crome", "Laura Haddock", "Rob James-Collier", "Noel Clarke", "Lindsey Coulson"], "character": ["Nancy Devlin", "Hayley Svrcek", "Kevin O'Dowd", "Gunner Martin", "Michelle Newman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68059   Expand The Level   (2016) User Score Overview A police detective finds herself at the centre of the most dangerous case of her life when she is seconded on to the investigation into the murder of a drugs trafficker. What nobody around her knows is that she is the missing witness that the police and the killer are searching for. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karla Crome Nancy Devlin Laura Haddock Hayley Svrcek Rob James-Collier Kevin O'Dowd Noel Clarke Gunner Martin Lindsey Coulson Michelle Newman Full Cast & Crew Last Season Series 1 2016 | 6 Episodes Season 1 of The Level premiered on September 30, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2016-02-27 Stag 5.9    2012-03-04 GCB 5.3    2015-11-16 The Coroner 5.2    2016-09-22 Paranoid 6.4    2016-06-07 Agatha Raisin 6.3    2000-09-04 Waking the Dead 7.9    1996-02-21 Silent Witness 7.4    2016-10-05 Deep Water 6.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   https://www.itvmedia.co.uk/programmes/programme-planner/level Genres Drama Keywords thriller britain Content Score 86 Almost there... Top Contributors ☘ 48 ☘ 28 Elizabeth Jennings R 3 RickSavageDL z 2 zyck  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}