{"link": "https://www.themoviedb.org/tv/13427?language=en", "title": "Hetty Wainthropp Investigates", "resume": "Hetty Wainthropp Investigates is a genteel British crime/comedy drama television programme that aired from 1996 to 1998 on BBC One. Patricia Routledge starred as the titular character, Derek Benfield as her patient husband Robert, Dominic Monaghan as their lodger Geoffrey Shawcross and John Graham Davies as DCI Adams. Later episodes include Suzanne Maddock as Janet Frazer, a feisty young auto mechanic who sells a car to Geoffrey; their relationship develops by the end of the series. In the United States, episodes have been featured on PBS's anthology programme Mystery!", "rate": 70, "genre": ["Drama"], "cast": ["Dominic Monaghan", "Derek Benfield", "Patricia Routledge", "Suzanne Maddock", "John Graham Davies"], "character": ["Geoffrey Shawcross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13427   Expand Hetty Wainthropp Investigates   (1996) User Score Overview Hetty Wainthropp Investigates is a genteel British crime/comedy drama television programme that aired from 1996 to 1998 on BBC One. Patricia Routledge starred as the titular character, Derek Benfield as her patient husband Robert, Dominic Monaghan as their lodger Geoffrey Shawcross and John Graham Davies as DCI Adams. Later episodes include Suzanne Maddock as Janet Frazer, a feisty young auto mechanic who sells a car to Geoffrey; their relationship develops by the end of the series. In the United States, episodes have been featured on PBS's anthology programme Mystery! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dominic Monaghan Geoffrey Shawcross Derek Benfield Patricia Routledge Suzanne Maddock John Graham Davies Full Cast & Crew Last Season Season 4 1998 | 7 Episodes Season 4 of Hetty Wainthropp Investigates premiered on July 24, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hetty Wainthropp Investigates. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 kcdh R 3 Rebecca b 2 bBop87 a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}