{"link": "https://www.themoviedb.org/tv/60937?language=en", "title": "Time of Eve", "resume": "The future, probably Japan. Robots have long been put into practical use, and androids have just come into use. Influenced by the Robot Ethics Committee, it's become common sense for people to treat androids like household appliances. Their appearance - indistinguishable from humans except for the ring over each android's head - has led some people to empathize unnecessarily with androids. Known as \"android-holics\", such people have become a social problem. Rikuo, a high school student, has been taught from childhood that androids are not to be viewed as humans, and has always used them as convenient tools. One day Rikuo discovers some strange data in the behavior records of his family's household android, Sammy. Rikuo and his friend Masaki trace Sammy's movements, only to discover a mysterious café that features a house rule that \"humans and robots are to be treated the same\".", "rate": 84, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Jun Fukuyama", "Kenji Nojima", "Yuko Sanpei", "Rie Tanaka", "Rina Satou"], "character": ["Rikuo Sakisaka", "Masakazu Masaki", "Masakazu Masaki (Child)", "Sammy", "Nagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60937   Expand Time of Eve   (2008) User Score Overview The future, probably Japan. Robots have long been put into practical use, and androids have just come into use. Influenced by the Robot Ethics Committee, it's become common sense for people to treat androids like household appliances. Their appearance - indistinguishable from humans except for the ring over each android's head - has led some people to empathize unnecessarily with androids. Known as \"android-holics\", such people have become a social problem. Rikuo, a high school student, has been taught from childhood that androids are not to be viewed as humans, and has always used them as convenient tools. One day Rikuo discovers some strange data in the behavior records of his family's household android, Sammy. Rikuo and his friend Masaki trace Sammy's movements, only to discover a mysterious café that features a house rule that \"humans and robots are to be treated the same\". Featured Crew Yasuhiro Yoshiura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Rikuo Sakisaka Kenji Nojima Masakazu Masaki Yuko Sanpei Masakazu Masaki (Child) Rie Tanaka Sammy Rina Satou Nagi Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of Time of Eve premiered on August  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  7 Recommendations   2004-02-03 Paranoia Agent 7.8    2013-04-23 Teen Titans Go! 4.4    2011-01-07 Puella Magi Madoka Magica 7.9    1998-07-06 Serial Experiments Lain 8.2    2012-01-10 Another 7.2  Facts Original Name  イヴの時間 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  15m Homepage   http://timeofeve.com/ Genres Animation Sci-Fi & Fantasy Keywords android artificial intelligence maid robot cafe anime three laws of robotics Content Score 93 Almost there... Top Contributors M 45 Meysiv 26 Elizabeth Jennings CM 10 Cherche Moi 9 Panayotis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}