{"link": "https://www.themoviedb.org/tv/39272?language=en", "title": "Once Upon a Time", "resume": "There is a town in Maine where every story book character you've ever known is trapped between two worlds, victims of a powerful curse. Only one knows the truth and only one can break the spell.\nEmma Swan is a 28-year-old bail bonds collector who has been supporting herself since she was abandoned as a baby. Things change for her when her son Henry, whom she abandoned years ago, finds her and asks for her help explaining that she is from a different world where she is Snow White's missing daughter.", "rate": 64, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Lana Parrilla", "Colin O'Donoghue", "Robert Carlyle", "Andrew J. West", "Alison Fernandez"], "character": ["Regina Mills / Evil Queen", "Captain Hook / Killian Jones", "Mr. Gold / Rumplestiltskin", "Henry Mills", "Lucy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39272   Expand Once Upon a Time   (2011) User Score  Play Trailer Overview There is a town in Maine where every story book character you've ever known is trapped between two worlds, victims of a powerful curse. Only one knows the truth and only one can break the spell. Emma Swan is a 28-year-old bail bonds collector who has been supporting herself since she was abandoned as a baby. Things change for her when her son Henry, whom she abandoned years ago, finds her and asks for her help explaining that she is from a different world where she is Snow White's missing daughter. Featured Crew Edward Kitsis Creator Adam Horowitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  94 Content Issues  2 Images Backdrops  48 Posters  26 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Lana Parrilla Regina Mills / Evil Queen Colin O'Donoghue Captain Hook / Killian Jones Robert Carlyle Mr. Gold / Rumplestiltskin Andrew J. West Henry Mills Alison Fernandez Lucy Full Cast & Crew Current Season Season 7 2017 | 22 Episodes View All Seasons Social Reviews  1 Discussions  96 A review by Oldnewbie Written by  Oldnewbie  on May 19, 2017 A superb series finale but... It is not! Truly this would have been the end the show deserved had this been the final episode. Apparently it was written as such until the show was renewed BUT with most of the cast moving on contractually already! Yes, a wrap around\\ tag on scene\\tale opens the show up to an all new reset of the beginning, only with a now adult Henry being approached by his unknown to him daughter (about the same age Henry was when he found Emma in ep 1 season 1)! She says he must go with her cause \"his family needs him\". Sound familiar? It would seem Henry, like Emma in t...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  48 Posters  26 Recommendations   2011-10-28 Grimm 6.7    2013-09-16 Sleepy Hollow 6.4    2006-09-25 Heroes 6.9    2001-10-16 Smallville 6.9    2008-09-07 True Blood 7.1    2011-09-21 Revenge 6.9    2009-09-10 The Vampire Diaries 6.9    2012-05-27 Continuum 7.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m, 40m Homepage   http://abc.go.com/shows/once-upon-a-time Genres Drama Sci-Fi & Fantasy Keywords magic fairy tale fantasy world based on fairy tale storybook false memory different worlds Content Score 100 Yes! Looking good! Top Contributors 246 Marr 🇳🇱 93 Elizabeth Jennings 65 niqo19 R 60 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}