{"link": "https://www.themoviedb.org/tv/210?language=en", "title": "The Man from U.N.C.L.E.", "resume": "The Man from U.N.C.L.E. is an American television series that was broadcast on NBC from September 22, 1964, to January 15, 1968. It follows the exploits of two secret agents, played by Robert Vaughn and David McCallum, who work for a fictitious secret international espionage and law-enforcement agency called U.N.C.L.E. Originally co-creator Sam Rolfe wanted to leave the meaning of U.N.C.L.E. ambiguous so it could be viewed as either referring to \"Uncle Sam\" or the United Nations. Concerns by the MGM Legal department about possible New York law violations for using the abbreviation \"U.N.\" for commercial purposes resulted in the producers clarifying that U.N.C.L.E. was an acronym for the United Network Command for Law and Enforcement. Each episode of the television show had an \"acknowledgement\" credit to the U.N.C.L.E. on the end titles.", "rate": 79, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Robert Vaughn", "David McCallum", "Leo G. Carroll"], "character": ["Napoleon Solo", "Illya Kuryakin", "Alexander Waverly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 210   Expand The Man from U.N.C.L.E.   (1964) User Score  Play Trailer Overview The Man from U.N.C.L.E. is an American television series that was broadcast on NBC from September 22, 1964, to January 15, 1968. It follows the exploits of two secret agents, played by Robert Vaughn and David McCallum, who work for a fictitious secret international espionage and law-enforcement agency called U.N.C.L.E. Originally co-creator Sam Rolfe wanted to leave the meaning of U.N.C.L.E. ambiguous so it could be viewed as either referring to \"Uncle Sam\" or the United Nations. Concerns by the MGM Legal department about possible New York law violations for using the abbreviation \"U.N.\" for commercial purposes resulted in the producers clarifying that U.N.C.L.E. was an acronym for the United Network Command for Law and Enforcement. Each episode of the television show had an \"acknowledgement\" credit to the U.N.C.L.E. on the end titles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Robert Vaughn Napoleon Solo David McCallum Illya Kuryakin Leo G. Carroll Alexander Waverly Full Cast & Crew Last Season Season 4 1967 | 16 Episodes Season 4 of The Man from U.N.C.L.E. premiered on September 11, 1967. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Illya Kuryakin: Happy Birthday David McCallum! Open 0 by wonder2wonder\n      \n     open channell d Open 11 by  Col_Hessler Go to Discussions Media Most Popular Videos  2 Backdrops  10 Posters  6 Recommendations   1965-09-15 Lost in Space 6.8    1963-09-29 My Favorite Martian 5.4    1967-09-10 Gentle Ben 5.0    1970-09-24 The Odd Couple 7.1    1976-10-03 Quincy, M.E. 7.0    1971-09-14 Cannon 5.6    1970-09-16 McCloud 7.0    1970-09-25 The Partridge Family 5.5  Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Action & Adventure Comedy Keywords spy secret agent super spy Content Score 64 We're so close, yet so far. Top Contributors 15 Banana 10 Steve 10 go2x r 8 rick555  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}