{"link": "https://www.themoviedb.org/tv/9163?language=en", "title": "Perfect Strangers", "resume": "A darkly comic tale of a young man who comes face to face with his huge family - a variety of eccentrics, all of whom are hiding secrets from their pasts. At a family reunion Raymond is presented with a copy of the family tree and is absolutely amazed by the complexity of his family ties.", "rate": 70, "genre": ["Drama"], "cast": ["Lindsay Duncan", "Michael Gambon", "Matthew Macfadyen", "Claire Skinner", "Toby Stephens"], "character": ["Alice", "Raymond", "Daniel", "Rebecca"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9163   Expand Perfect Strangers   (2001) User Score Overview A darkly comic tale of a young man who comes face to face with his huge family - a variety of eccentrics, all of whom are hiding secrets from their pasts. At a family reunion Raymond is presented with a copy of the family tree and is absolutely amazed by the complexity of his family ties. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lindsay Duncan Alice Michael Gambon Raymond Matthew Macfadyen Daniel Claire Skinner Rebecca Toby Stephens Full Cast & Crew Last Season Miniseries 2001 | 3 Episodes Season 1 of Perfect Strangers premiered on May 10, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Perfect Strangers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p02zn094 Genres Drama Keywords family secret family relationships miniseries family reunion Content Score 86 Almost there... Top Contributors TB 17 TMDb Bot R 12 Rebecca 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}