{"link": "https://www.themoviedb.org/tv/10610?language=en", "title": "Challenge of the Super Friends", "resume": "Challenge of the Super Friends is an American animated television series about a team of superheroes which ran from September 9, 1978, to December 23, 1978, on ABC. The complete series was produced by Hanna-Barbera Productions for Warner Bros. Television and is based on the Justice League and associated comic book characters published by DC Comics and created by Julius Schwartz, Gardner Fox and Mike Sekowsky. It was the third series of Super Friends cartoons, following the original Super Friends in 1973 and The All-New Super Friends Hour in 1977. It continues to air on Boomerang in the United States.", "rate": 77, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Buster Jones", "Henry Corden", "Casey Kasem", "Jack Angel", "Melanie Chartoff"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10610   Expand Challenge of the Super Friends   (1978) User Score Overview Challenge of the Super Friends is an American animated television series about a team of superheroes which ran from September 9, 1978, to December 23, 1978, on ABC. The complete series was produced by Hanna-Barbera Productions for Warner Bros. Television and is based on the Justice League and associated comic book characters published by DC Comics and created by Julius Schwartz, Gardner Fox and Mike Sekowsky. It was the third series of Super Friends cartoons, following the original Super Friends in 1973 and The All-New Super Friends Hour in 1977. It continues to air on Boomerang in the United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Buster Jones Henry Corden Casey Kasem Jack Angel Melanie Chartoff Full Cast & Crew Last Season Challenge of the superfriends season 1 1978 | 16 Episodes Season 1 of Challenge of the Super Friends premiered on September  9, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1973-09-08 Super Friends 7.6    1977-09-10 The All-New Super Friends Hour 6.8    1979-09-22 The World's Greatest Super Friends 7.5    1967-09-09 Shazzan 6.5    1980-10-04 Thundarr the Barbarian 6.3    1967-09-09 Birdman and the Galaxy Trio 5.9    1967-09-09 Spider-Man 7.9    1975-11-07 Wonder Woman 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.batmanytb.com/animated/cotsf/ Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors NS 4 Norte Serra 2 Евгений  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}