{"link": "https://www.themoviedb.org/tv/70046?language=en", "title": "Sun Records", "resume": "Set in Memphis during the tumultuous early days of the civil rights movement, Sun Records tells the untold story of nothing less than the birth of rock ‘n’ roll. Guided by Sam Phillips, young musicians like Johnny Cash, Elvis Presley, Carl Perkins and Jerry Lee Lewis combined the styles of hillbilly country with the 1950s R&B sound created by artists like Muddy Waters, B.B. King, Fats Domino and Ike Turner, and changed the course of music forever. The series chronicles the young artists’ often jarring and sudden meteoric rise to fame in the face of sweeping political change and social unrest.", "rate": 73, "genre": ["Drama"], "cast": ["Castro Coleman", "Jennifer Holland", "Drake Milligan", "Dustin Ingram", "Billy Gardell"], "character": ["B.B. King", "Becky Phillips", "Elvis Presley", "Carl Perkins", "Colonel Parker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70046   Expand Sun Records   (2017) User Score  Play Trailer Overview Set in Memphis during the tumultuous early days of the civil rights movement, Sun Records tells the untold story of nothing less than the birth of rock ‘n’ roll. Guided by Sam Phillips, young musicians like Johnny Cash, Elvis Presley, Carl Perkins and Jerry Lee Lewis combined the styles of hillbilly country with the 1950s R&B sound created by artists like Muddy Waters, B.B. King, Fats Domino and Ike Turner, and changed the course of music forever. The series chronicles the young artists’ often jarring and sudden meteoric rise to fame in the face of sweeping political change and social unrest. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  12 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Castro Coleman B.B. King Jennifer Holland Becky Phillips Drake Milligan Elvis Presley Dustin Ingram Carl Perkins Billy Gardell Colonel Parker Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Sun Records premiered on February 23, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Great show Open 0 by Sjaool\n      \n     Premiers Tonight! Open 0 by HoneyWest\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sun Records. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.cmt.com/shows/sun-records Genres Drama Keywords rock and roll music based on play or musical memphis period drama 1950s Content Score 93 Almost there... Top Contributors 42 Elizabeth Jennings 10 Banana 7 Maretoh D 6 Derek.Jo.Lee88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}