{"link": "https://www.themoviedb.org/tv/2306?language=en", "title": "The Man from Snowy River", "resume": "The Man from Snowy River is an Australian television series based on Banjo Paterson's poem \"The Man from Snowy River\". Released in Australia as Banjo Paterson's The Man from Snowy River, the series was subsequently released in both the United States and the United Kingdom as Snowy River: The McGregor Saga.\nThe television series has no relationship to the 1982 film The Man from Snowy River or the 1988 sequel The Man from Snowy River II. Instead, the series follows the adventures of Matt McGregor, a successful squatter, and his family. Matt is the hero immortalized in Banjo Paterson's poem \"The Man from Snowy River\", and the series is set 25 years after his famous ride. The first season was very much a soap opera with several story arcs, but the primary one concerns the arrival of Matt's American nephew, who's bent on revenge, certain Matt cheated his father out of the station Matt now owns. In subsequent seasons, there were shorter story-arcs, often featuring guest stars over a few episodes, and some episodes stood entirely on their own. Stars and guest stars of the series included notables and future notables Andrew Clarke, Guy Pearce, Josh Lucas, Victoria Tennant, Olivia Newton John, Tracy Nelson, Lee Horsley, Dean Stockwell, Chad Lowe, Jane Badler, Wendy Hughes, Hugh Jackman, and Frances O'Connor.", "rate": 80, "genre": ["Drama", "Western"], "cast": ["Guy Pearce", "Andrew Clarke", "Brett Climo", "Sheryl Munks", "Hugh Jackman"], "character": ["Rob McGregor", "Matt McGregor", "Colin McGregor", "Emily McGregor", "Duncan Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2306   Expand The Man from Snowy River   (1994) User Score Overview The Man from Snowy River is an Australian television series based on Banjo Paterson's poem \"The Man from Snowy River\". Released in Australia as Banjo Paterson's The Man from Snowy River, the series was subsequently released in both the United States and the United Kingdom as Snowy River: The McGregor Saga. The television series has no relationship to the 1982 film The Man from Snowy River or the 1988 sequel The Man from Snowy River II. Instead, the series follows the adventures of Matt McGregor, a successful squatter, and his family. Matt is the hero immortalized in Banjo Paterson's poem \"The Man from Snowy River\", and the series is set 25 years after his famous ride. The first season was very much a soap opera with several story arcs, but the primary one concerns the arrival of Matt's American nephew, who's bent on revenge, certain Matt cheated his father out of the station Matt now owns. In subsequent seasons, there were shorter story-arcs, often featuring guest stars over a few episodes, and some episodes stood entirely on their own. Stars and guest stars of the series included notables and future notables Andrew Clarke, Guy Pearce, Josh Lucas, Victoria Tennant, Olivia Newton John, Tracy Nelson, Lee Horsley, Dean Stockwell, Chad Lowe, Jane Badler, Wendy Hughes, Hugh Jackman, and Frances O'Connor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Pearce Rob McGregor Andrew Clarke Matt McGregor Brett Climo Colin McGregor Sheryl Munks Emily McGregor Hugh Jackman Duncan Jones Full Cast & Crew Last Season Season 4 1998 | 12 Episodes Season 4 of The Man from Snowy River premiered on February  8, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Man from Snowy River. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Drama Western Keywords australia western 19th century Content Score 86 Almost there... Top Contributors 54 Banana D 3 Dekkit R 2 Rebecca b 1 bertrandj85  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}