{"link": "https://www.themoviedb.org/tv/13459?language=en", "title": "Funland", "resume": "Funland is a comedy thriller serial, produced by the BBC, about a detective who arrives in Blackpool to find the killer of his mother with only the flimsiest of clues to go on. It was first screened from 23 October 2005 to 7 November 2005, on the digital channel BBC Three. Created by Jeremy Dyson and Simon Ashdown, the series consists of a fifty-minute opening episode followed by ten half-hour installments.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Judy Parfitt", "Frances Barber", "Daniel Mays", "Kris Marshall", "Beth Cordingly"], "character": ["Vienna Keen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13459   Expand Funland   (2005) User Score Overview Funland is a comedy thriller serial, produced by the BBC, about a detective who arrives in Blackpool to find the killer of his mother with only the flimsiest of clues to go on. It was first screened from 23 October 2005 to 7 November 2005, on the digital channel BBC Three. Created by Jeremy Dyson and Simon Ashdown, the series consists of a fifty-minute opening episode followed by ten half-hour installments. Featured Crew Jeremy Dyson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Judy Parfitt Frances Barber Daniel Mays Kris Marshall Beth Cordingly Vienna Keen Full Cast & Crew Last Season Season 1 2005 | 11 Episodes Season 1 of Funland premiered on October 23, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Funland. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage  - Genres Drama Comedy Keywords mother northern england detective dark comedy surreal murder crime clue british humour Content Score 93 Almost there... Top Contributors O 10 Ozbourne R 2 Rebecca 2 Banana 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}