{"link": "https://www.themoviedb.org/tv/59726?language=en", "title": "My Daughter Seo-young", "resume": "My Daughter Seo-young is a 2012 South Korean television series, starring Chun Ho-jin, Lee Bo-young, Lee Sang-yoon and Park Hae-jin. The family drama focuses on the broken relationship between Seo-young and her father, who later reunite with the help of her twin brother. It aired on KBS2 from September 15, 2012 to March 3, 2013 on Saturdays and Sundays at 19:55 for 50 episodes.", "rate": 70, "genre": [], "cast": ["Lee Bo-young", "Cheon Ho-jin", "Min Young-won", "Song Ok-Suk", "Lee Sang-yoon"], "character": ["Lee Seo-young", "Lee Sam-jae", "Lee Yeon-hee", "Kim Kang-soon", "Kang Woo-jae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59726   Expand My Daughter Seo-young   (2012) User Score Overview My Daughter Seo-young is a 2012 South Korean television series, starring Chun Ho-jin, Lee Bo-young, Lee Sang-yoon and Park Hae-jin. The family drama focuses on the broken relationship between Seo-young and her father, who later reunite with the help of her twin brother. It aired on KBS2 from September 15, 2012 to March 3, 2013 on Saturdays and Sundays at 19:55 for 50 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Bo-young Lee Seo-young Cheon Ho-jin Lee Sam-jae Min Young-won Lee Yeon-hee Song Ok-Suk Kim Kang-soon Lee Sang-yoon Kang Woo-jae Full Cast & Crew Last Season Season 1 2012 | 50 Episodes Season 1 of My Daughter Seo-young premiered on September 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Daughter Seo-young. You can help by rating TV shows you've seen. Facts Original Name  내 딸 서영이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/seoyoung/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 16 kingofbeer t 15 tmdb38202327 M 5 Maria180493 N 5 Nightowl.Kr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}