{"link": "https://www.themoviedb.org/tv/17610?language=en", "title": "NCIS: Los Angeles", "resume": "The exploits of the Los Angeles–based Office of Special Projects (OSP), an elite division of the Naval Criminal Investigative Service that specializes in undercover assignments.", "rate": 65, "genre": ["Action", "Adventure", "Drama", "Crime", "Mystery"], "cast": ["Chris O'Donnell", "LL Cool J", "Daniela Ruah", "Eric Christian Olsen", "Linda Hunt"], "character": ["G. Callen", "Sam Hanna", "Kensi Blye", "Marty Deeks", "Henrietta \"Hetty\" Lange"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17610   Expand NCIS: Los Angeles   (2009) User Score Overview The exploits of the Los Angeles–based Office of Special Projects (OSP), an elite division of the Naval Criminal Investigative Service that specializes in undercover assignments. Featured Crew Shane Brennan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  2 Images Backdrops  21 Posters  18 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Chris O'Donnell G. Callen LL Cool J Sam Hanna Daniela Ruah Kensi Blye Eric Christian Olsen Marty Deeks Linda Hunt Henrietta \"Hetty\" Lange Full Cast & Crew Last Season Season 9 2017 | 24 Episodes Season 9 of NCIS: Los Angeles premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  13 Subject Status Replies Last Reply b Kensi Open 0 by bgirlmagic\n      \n     b Funny Open 0 by bgirlmagic\n      \n     Why didn't Sam give Michelle CPR? Open 0 by Mario Limbouris\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  21 Posters  18 Recommendations   2014-09-23 NCIS: New Orleans 6.3    2005-03-17 NCIS 6.7    2010-09-20 Hawaii Five-0 6.2    2004-09-21 CSI: NY 6.7    2005-09-22 Criminal Minds 7.0    2002-09-23 CSI: Miami 5.8    2007-06-28 Burn Notice 7.3    2000-10-06 CSI: Crime Scene Investigation 6.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.cbs.com/shows/ncis_los_angeles/ Genres Action & Adventure Drama Crime Mystery Keywords navy undercover los angeles spin off u.s. marine corps military crime investigation ncis Content Score 100 Yes! Looking good! Top Contributors 47 Elizabeth Jennings 37 niqo19 32 Banana 7 30 7Bee-NL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}