{"link": "https://www.themoviedb.org/tv/39214?language=en", "title": "Arsène Lupin", "resume": "Arsène Lupin is a French TV show which was co-produced with German, Canadian, Belgian, Dutch, Swiss, Italian and Austrian TV stations. It was only loosely based on Maurice Leblancs novels.\nGeorges Descrières' portrayal of Arsène Lupin showed more similarity to Graf Yoster than to Maurice Leblanc's original. He behaved in the first place as a perfect gentleman who never got angry. He was always relaxed, because whatever could possibly had bothered him in daily life was taken care of by his butler. It wasn't questioned how he had come to his financial independence although the series sometimes discreetly implied that he was a professional criminal. Besides rescuing damsels in distress Lupin took on criminals, competing with their wit and intelligence. Either he stole paintings from rich people who had to be considered white-collar criminals or he acted as a detective who derailed criminal schemes. However, when he was attacked, he could defend himself effortlessly by using elegant jujutsu methods.\nAmong the guest stars were German actors such as Günter Strack and Sky du Mont.\nJean-Paul Salomé said in his commentary on the DVD version of his film Arsène Lupin he had like this series as a child. German TV, one the investors, would broadcast the show eventually between 18:00-20:00 o'clock because it was only allowed to show commercials within that very timeslot. For them to get a financial return on investment the show had to be appropriate for families and also for children who would watch it alone. Subsequently it was nearby to ask to defuse and flatten some of Leblanc's plots in order to avoid possible complaints that could force the station to broadcast the show beyond the \"Vorabendprogramm\".", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Georges Descrières", "Marthe Keller", "Yvon Bouchard", "Roger Carel", "Henri Virlogeux"], "character": ["Arsène Lupin", "Natacha", "Grognard", "commissaire Guerchard", "Herlock Sholmès"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39214   Expand Arsène Lupin   (1971) User Score Overview Arsène Lupin is a French TV show which was co-produced with German, Canadian, Belgian, Dutch, Swiss, Italian and Austrian TV stations. It was only loosely based on Maurice Leblancs novels. Georges Descrières' portrayal of Arsène Lupin showed more similarity to Graf Yoster than to Maurice Leblanc's original. He behaved in the first place as a perfect gentleman who never got angry. He was always relaxed, because whatever could possibly had bothered him in daily life was taken care of by his butler. It wasn't questioned how he had come to his financial independence although the series sometimes discreetly implied that he was a professional criminal. Besides rescuing damsels in distress Lupin took on criminals, competing with their wit and intelligence. Either he stole paintings from rich people who had to be considered white-collar criminals or he acted as a detective who derailed criminal schemes. However, when he was attacked, he could defend himself effortlessly by using elegant jujutsu methods. Among the guest stars were German actors such as Günter Strack and Sky du Mont. Jean-Paul Salomé said in his commentary on the DVD version of his film Arsène Lupin he had like this series as a child. German TV, one the investors, would broadcast the show eventually between 18:00-20:00 o'clock because it was only allowed to show commercials within that very timeslot. For them to get a financial return on investment the show had to be appropriate for families and also for children who would watch it alone. Subsequently it was nearby to ask to defuse and flatten some of Leblanc's plots in order to avoid possible complaints that could force the station to broadcast the show beyond the \"Vorabendprogramm\". Featured Crew Jacques Nahum Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Georges Descrières Arsène Lupin Marthe Keller Natacha Yvon Bouchard Grognard Roger Carel commissaire Guerchard Henri Virlogeux Herlock Sholmès Full Cast & Crew Last Season Season 2 1973 | 13 Episodes Season 2 of Arsène Lupin premiered on December 18, 1973. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Arsène Lupin. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Arsène Lupin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  55m Homepage  - Genres Action & Adventure Keywords based on novel or book Content Score 93 Almost there... Top Contributors a 30 al-b-other 20 Banana s 8 sankukai35 5 go2x  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}