{"link": "https://www.themoviedb.org/tv/52878?language=en", "title": "Say \"I love you.\"", "resume": "Friends suck, and trusting someone is just setting yourself up. That's the lesson Mei Tachibana learned after her heart was ripped out and only a shell was left where a girl used to be. But unlike so many, she found an easy solution: she'll never make another friend. Ever. Okay, maybe that's not as easy as it sounds, but it's worked for Mei. Or at least it did. Until handsome, charming and annoyingly popular Yamato Kurosawa came along. Because for some freakish reason, he seems to like Mei. He even gave her his phone number! As if she would ever call him. Except she did. But only because she needed help. Still, he came. He actually came. And now things are getting way too complicated. Mei's no princess in a tower. She's not waiting for a knight in shining armor to rescue her. So why did he have to kiss her and confuse everything? And why are those three little words so hard to say? Between heartbeats, behind trembling lips, and unspoken with every breath, the specter of betrayals past, future and present now haunt them both in SAY \"I LOVE YOU.\"", "rate": 76, "genre": ["Animation", "Drama", "Romance"], "cast": ["Kayano Ai", "Takahiro Sakurai", "Minako Kotobuki", "Nobunaga Shimazaki", "Tomoaki Maeno"], "character": ["Mei Tachibana", "Yamato Kurosawa", "Megumi Kitagawa", "Kenji Nakanishi", "Kai Takemura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52878   Expand Say \"I love you.\"   (2012) User Score Overview Friends suck, and trusting someone is just setting yourself up. That's the lesson Mei Tachibana learned after her heart was ripped out and only a shell was left where a girl used to be. But unlike so many, she found an easy solution: she'll never make another friend. Ever. Okay, maybe that's not as easy as it sounds, but it's worked for Mei. Or at least it did. Until handsome, charming and annoyingly popular Yamato Kurosawa came along. Because for some freakish reason, he seems to like Mei. He even gave her his phone number! As if she would ever call him. Except she did. But only because she needed help. Still, he came. He actually came. And now things are getting way too complicated. Mei's no princess in a tower. She's not waiting for a knight in shining armor to rescue her. So why did he have to kiss her and confuse everything? And why are those three little words so hard to say? Between heartbeats, behind trembling lips, and unspoken with every breath, the specter of betrayals past, future and present now haunt them both in SAY \"I LOVE YOU.\" Featured Crew Kanae Hazuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kayano Ai Mei Tachibana Takahiro Sakurai Yamato Kurosawa Minako Kotobuki Megumi Kitagawa Nobunaga Shimazaki Kenji Nakanishi Tomoaki Maeno Kai Takemura Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Say \"I love you.\" premiered on October  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2014-01-14 Mushishi Tokubetsu-hen: Hihamukage 8.8    2014-10-05 Wolf Girl & Black Prince 7.0    2017-01-05 Masamune-kun's Revenge 7.0    2012-10-02 Kamisama Kiss 5.3    2016-07-04 Orange 7.3    2016-01-11 Grimgar of Fantasy and Ash 7.2    2016-07-02 ReLIFE 7.0    2016-04-08 Kabaneri of the Iron Fortress 6.4  Facts Original Name  好きっていいなよ。 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.sentaifilmworks.com/shows/say-i-love-you Genres Animation Drama Romance Keywords school troubled past anime Content Score 100 Yes! Looking good! Top Contributors 37 WillofOwn B 10 Bonsai 6 BrerFox 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}