{"link": "https://www.themoviedb.org/tv/20353?language=en", "title": "Ojamajo Doremi", "resume": "Ojamajo Doremi, known as Magical DoReMi in the US, is a magical girl anime television series created by Toei Animation in 1999. It focuses on elementary school students who become witch apprentices. Led by Doremi Harukaze, the girls must maintain their double lives in secret.\nOjamajo Doremi has been followed up by three direct sequels, lasting until its end in 2003. During the television series' runtime, two companion films were released in theaters. The English dub, produced by 4Kids Entertainment, released a preview episode in the US airing on August 13, 2005, and the first episode on September 10, 2005.", "rate": 0, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Tomoko Akiya", "Yuki Matsuoka", "Chiemi Chiba", "Rumi Shishido", "Nami Miyahara"], "character": ["Hazuki Fujiwara", "Aiko Senō", "Doremi Harukaze", "Onpu Segawa", "Masaru Yada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20353   Expand Ojamajo Doremi   (1999) User Score Overview Ojamajo Doremi, known as Magical DoReMi in the US, is a magical girl anime television series created by Toei Animation in 1999. It focuses on elementary school students who become witch apprentices. Led by Doremi Harukaze, the girls must maintain their double lives in secret. Ojamajo Doremi has been followed up by three direct sequels, lasting until its end in 2003. During the television series' runtime, two companion films were released in theaters. The English dub, produced by 4Kids Entertainment, released a preview episode in the US airing on August 13, 2005, and the first episode on September 10, 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomoko Akiya Hazuki Fujiwara Yuki Matsuoka Aiko Senō Chiemi Chiba Doremi Harukaze Rumi Shishido Onpu Segawa Nami Miyahara Masaru Yada Full Cast & Crew Last Season Season 5 2004 | 13 Episodes Season 5 of Ojamajo Doremi premiered on June 26, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Ojamajo Doremi. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords kids anime Content Score 86 Almost there... Top Contributors 14 SeRuJi0 6 matar12 z 5 zurman1 c 3 crow_  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}