{"link": "https://www.themoviedb.org/tv/62231?language=en", "title": "The Lizzie Borden Chronicles", "resume": "An intense and fictionalized account of actual events and people surrounding Lizzie’s life after her controversial acquittal of the horrific double murder of her father and stepmother in 1892.", "rate": 59, "genre": ["Crime", "Drama"], "cast": ["Christina Ricci", "Clea DuVall", "Cole Hauser", "Bradley Stryker", "Dylan Taylor"], "character": ["Lizzie Borden", "Emma borden", "Charlie Siringo", "Skipjack", "Officer Leslie Trotwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62231   Expand The Lizzie Borden Chronicles   (2015) User Score  Play Trailer Overview An intense and fictionalized account of actual events and people surrounding Lizzie’s life after her controversial acquittal of the horrific double murder of her father and stepmother in 1892. Featured Crew Gregory Small Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Ricci Lizzie Borden Clea DuVall Emma borden Cole Hauser Charlie Siringo Bradley Stryker Skipjack Dylan Taylor Officer Leslie Trotwood Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of The Lizzie Borden Chronicles premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2017-09-20 Tiempos de guerra 7.0    2016-07-05 Fangbone! 6.7    2011-07-27 The Code 6.7    2015-06-12 Conspiracy 5.7    2016-12-08 The Cuba Libre Story 7.7    2009-10-14 Alaska State Troopers 7.7    2016-10-12 Nurses Who Kill 7.3    2015-09-08 Apaches 7.3  Facts Status  Cancelled Network Certification 16 Meaning Not suitable for children under 16, access to these programs is locked by a personal password. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.mylifetime.com/shows/the-lizzie-borden-chronicles Genres Crime Drama Keywords sibling relationship based on a true story murder 19th century Content Score 100 Yes! Looking good! Top Contributors 21 Nero Kosonen 18 Elizabeth Jennings z 8 zurman1 w 6 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}