{"link": "https://www.themoviedb.org/tv/46279?language=en", "title": "Jormungand", "resume": "Jonah is a child soldier and the newest bodyguard for Koko, an international arms dealer with an entourage of hired guns. The cold-blooded kid hates Koko’s line of work, but following her into the darkest corners of the black market might be the only way he can find those responsible for his family’s slaughter. Besides, his employer isn’t like most merchants of death. She uses guile and cutthroat tactics to keep her clients armed to the teeth—all while cultivating her own warped plan for the future of world peace. With the CIA desperate for her capture, assassins eager to collect her head, and the potential for every contract to end in ultra-violence, Koko and her comrades in arms bring the boom to every corner of the world.", "rate": 75, "genre": ["Animation", "Adventure", "Action", "Adventure"], "cast": ["Mutsumi Tamura", "Sayaka Ohara", "Shizuka Itou", "Unsho Ishizuka", "Ami Koshimizu"], "character": ["Jonah", "Valmet", "Koko Hekmatyar", "Lehm", "Schokolade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46279   Expand Jormungand   (2012) User Score  Play Trailer Overview Jonah is a child soldier and the newest bodyguard for Koko, an international arms dealer with an entourage of hired guns. The cold-blooded kid hates Koko’s line of work, but following her into the darkest corners of the black market might be the only way he can find those responsible for his family’s slaughter. Besides, his employer isn’t like most merchants of death. She uses guile and cutthroat tactics to keep her clients armed to the teeth—all while cultivating her own warped plan for the future of world peace. With the CIA desperate for her capture, assassins eager to collect her head, and the potential for every contract to end in ultra-violence, Koko and her comrades in arms bring the boom to every corner of the world. Featured Crew Keitarō Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mutsumi Tamura Jonah Sayaka Ohara Valmet Shizuka Itou Koko Hekmatyar Unsho Ishizuka Lehm Ami Koshimizu Schokolade Full Cast & Crew Last Season Perfect Order 2012 | 12 Episodes Season 2 of Jormungand premiered on October  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2013-09-09 Tokyo Ravens 5.8    2012-04-05 Sankarea: Undying Love 7.0    2015-07-11 Prison School 7.7    2010-07-09 Shiki 6.7    2003-04-08 Kino's Journey 7.4    2013-04-07 Gargantia on the Verdurous Planet 6.8    2007-06-14 Devil May Cry 6.2    2015-04-05 Plastic Memories 6.8  Facts Original Name  ヨルムンガンド Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/jormungand/home Genres Animation Adventure Action & Adventure Keywords war weapons dealer anime Content Score 100 Yes! Looking good! Top Contributors 27 WillofOwn c 20 coffinbearer 10 Erwin D. Glockner TB 8 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}