{"link": "https://www.themoviedb.org/tv/62852?language=en", "title": "Billions", "resume": "A complex drama about power politics in the world of New York high finance. \nShrewd, savvy U.S. Attorney Chuck Rhoades and the brilliant, ambitious hedge fund king Bobby \"Axe\" Axelrod are on an explosive collision course, with each using all of his considerable smarts, power and influence to outmaneuver the other. The stakes are in the billions in this timely, provocative series.", "rate": 78, "genre": ["Drama"], "cast": ["Paul Giamatti", "Damian Lewis", "Maggie Siff", "Toby Leonard Moore", "David Costabile"], "character": ["Chuck Rhoades", "Bobby \"Axe\" Axelrod", "Wendy Rhoades", "Bryan Connerty", "Mike \"Wags\" Wagner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62852   Expand Billions   (2016) User Score  Play Trailer Overview A complex drama about power politics in the world of New York high finance.  Shrewd, savvy U.S. Attorney Chuck Rhoades and the brilliant, ambitious hedge fund king Bobby \"Axe\" Axelrod are on an explosive collision course, with each using all of his considerable smarts, power and influence to outmaneuver the other. The stakes are in the billions in this timely, provocative series. Featured Crew Brian Koppelman Creator David Levien Creator Andrew Ross Sorkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  18 Content Issues  0 Images Backdrops  16 Posters  11 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Giamatti Chuck Rhoades Damian Lewis Bobby \"Axe\" Axelrod Maggie Siff Wendy Rhoades Toby Leonard Moore Bryan Connerty David Costabile Mike \"Wags\" Wagner Full Cast & Crew Current Season Season 3 2018 | 12 Episodes View All Seasons Social Reviews  0 Discussions  18 Subject Status Replies Last Reply David Costabile, ugh. Open 4 by  roundthetwist Am I the only one who thinks that Chuck... Open 0 by Jason VoorDeez\n      \n     N Is the show economically/factually correct? Open 0 by Neeraj\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  16 Posters  11 Recommendations   2013-01-30 The Americans 7.7    2013-06-30 Ray Donovan 7.4    2011-10-02 Homeland 7.3    2016-02-21 The Night Manager 7.7    2014-02-06 Bosch 7.9    2016-10-14 Goliath 7.8    2015-02-08 Better Call Saul 8.1    2013-02-01 House of Cards 8.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.sho.com/sho/billions/home Genres Drama Keywords wall street wealth lawyer new york city rich people hedge fund businessman Content Score 100 Yes! Looking good! Top Contributors 113 Elizabeth Jennings 19 david8s95 18 niqo19 9 Bendik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}