{"link": "https://www.themoviedb.org/tv/10814?language=en", "title": "Counterstrike", "resume": "Counterstrike is a Canadian/French crime-fighting/espionage television series. It premiered on November 2, 1991 on CTV in Canada and on November 20, 1991 on TF1 in France. It also aired in the United States on cable channel USA Network, premiering on July 1, 1990. The series ran for three seasons, airing 66 hour-long episodes in total.\nCounterstrike has since aired in reruns in Canada on Showcase and TVtropolis.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Christopher Plummer", "Simon MacCorkindale", "Patricia Cartier", "Tom Kneebone", "Stephen Shellen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10814   Expand Counterstrike   (1990) User Score Overview Counterstrike is a Canadian/French crime-fighting/espionage television series. It premiered on November 2, 1991 on CTV in Canada and on November 20, 1991 on TF1 in France. It also aired in the United States on cable channel USA Network, premiering on July 1, 1990. The series ran for three seasons, airing 66 hour-long episodes in total. Counterstrike has since aired in reruns in Canada on Showcase and TVtropolis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Plummer Simon MacCorkindale Patricia Cartier Tom Kneebone Stephen Shellen Full Cast & Crew Last Season (ca) season 3 1992 | 22 Episodes Season 3 of Counterstrike premiered on September 26, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Counterstrike. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 4 Joe Carson 4 lineker S 2 Samara 2 Stan Smith  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}