{"link": "https://www.themoviedb.org/tv/49191?language=en", "title": "10.5", "resume": "Dr. Samantha Hill is an earthquake research scientist at a noted university in Washington State. Her alternative theories and her take-charge attitude cause friction with her peers. When the controversial Dr. Hill is ultimately put in charge, she is effectively entrusted with saving the entire population of the West Coast from a series of earthquakes that threaten to permanently fracture the West Coast from the rest of North America.", "rate": 61, "genre": ["Drama"], "cast": ["Beau Bridges", "Fred Ward", "Ivan Sergei", "Dulé Hill", "David Cubitt"], "character": ["President of the United States", "Roy Nolan, FEMA Director", "Dr. Zack Nolan", "Owen Hunter", "Dr. Jordan Fisher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49191   Expand 10.5   (2004) User Score Overview Dr. Samantha Hill is an earthquake research scientist at a noted university in Washington State. Her alternative theories and her take-charge attitude cause friction with her peers. When the controversial Dr. Hill is ultimately put in charge, she is effectively entrusted with saving the entire population of the West Coast from a series of earthquakes that threaten to permanently fracture the West Coast from the rest of North America. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Beau Bridges President of the United States Fred Ward Roy Nolan, FEMA Director Ivan Sergei Dr. Zack Nolan Dulé Hill Owen Hunter David Cubitt Dr. Jordan Fisher Full Cast & Crew Last Season Miniseries 2004 | 2 Episodes Season 1 of 10.5 premiered on May  2, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2006-05-21 10.5: Apocalypse 4.9    2007-01-10 Killer Wave 5.7    1999-11-14 Aftershock: Earthquake in New York 4.9    2009-07-26 The Storm 4.0    1997-05-04 Invasion 0.0    1999-10-01 BeastMaster 5.9    2012-12-21 Ring of Fire 5.9    2007-04-15 Superstorm 5.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords natural disaster earthquake miniseries Content Score 86 Almost there... Top Contributors TB 56 TMDb Bot 19 Banana t 2 thomas-dawidowski e 1 egbertbos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}