{"link": "https://www.themoviedb.org/tv/65917?language=en", "title": "The Imperial Doctress", "resume": "Growing up in a family of physicians, Tan Yun Xian was adored by her grandparents for her intellect, curiosity and medical acumen. Despite the many barriers for female physicians in ancient China, Yun Xian nevertheless proved herself to be a skilled family and female doctor — and ultimately the most famous female doctor of the Ming Dynasty.", "rate": 80, "genre": ["Drama"], "cast": ["Liu Shishi", "Wallace Huo", "Huang Xuan", "Yuan Wenkang", "Li Cheng-Yuan"], "character": ["Tan Yun Xian", "Zhu Qi Zhen", "Zhu Qi Yu", "Ye Xian", "Empress Qian"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65917   Expand The Imperial Doctress   (2016) User Score Overview Growing up in a family of physicians, Tan Yun Xian was adored by her grandparents for her intellect, curiosity and medical acumen. Despite the many barriers for female physicians in ancient China, Yun Xian nevertheless proved herself to be a skilled family and female doctor — and ultimately the most famous female doctor of the Ming Dynasty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Shishi Tan Yun Xian Wallace Huo Zhu Qi Zhen Huang Xuan Zhu Qi Yu Yuan Wenkang Ye Xian Li Cheng-Yuan Empress Qian Full Cast & Crew Last Season Season 1 2016 | 50 Episodes Season 1 of The Imperial Doctress premiered on February 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Imperial Doctress. You can help by rating TV shows you've seen. Facts Original Name  女医·明妃传 Status  Ended Networks JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/nvyimingfeizhuan Genres Drama Keywords romance history Content Score 86 Almost there... Top Contributors M 33 Maria180493 z 10 zurman1 3 lemonlyman 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}