{"link": "https://www.themoviedb.org/tv/77367?language=en", "title": "Untouchable Lovers", "resume": "Tianji Tower, the leading organisation of the pugilistic world is determined to overthrow the tyrannical ruler Liu Ziye. To achieve their mission, Tianji Tower replaces his sister Liu Chuyu with their own disciple and Princess-lookalike Zhu Que. Zhu Que meets the Princess’ learned companion Rong Zhi, who turns out to be a spy from Northern Wei.\nLiu Chuyu and Rong Zhi’s relationship eventually breaks down over misunderstandings and differing loyalties, and the latter fakes his death in order to regain Chuyu’s forgiveness. Somehow they accidentally lose their memories, and only meet five years later when Chuyu is sent to marry Northern Wei’s Prince regent, who is none other than the now amnesiac Rong Zhi.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Song Weilong", "Guan Xiao Tong", "Mi Re", "Zhang Xinyu"], "character": ["Rong Zhi", "Liu Chu Yu/ Liu Chu Xiu / Zhu Que", "Tuoba Yun", "Wang Yi Zhi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77367   Expand Untouchable Lovers   (2018) User Score  Play Trailer Overview Tianji Tower, the leading organisation of the pugilistic world is determined to overthrow the tyrannical ruler Liu Ziye. To achieve their mission, Tianji Tower replaces his sister Liu Chuyu with their own disciple and Princess-lookalike Zhu Que. Zhu Que meets the Princess’ learned companion Rong Zhi, who turns out to be a spy from Northern Wei. Liu Chuyu and Rong Zhi’s relationship eventually breaks down over misunderstandings and differing loyalties, and the latter fakes his death in order to regain Chuyu’s forgiveness. Somehow they accidentally lose their memories, and only meet five years later when Chuyu is sent to marry Northern Wei’s Prince regent, who is none other than the now amnesiac Rong Zhi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Weilong Rong Zhi Guan Xiao Tong Liu Chu Yu/ Liu Chu Xiu / Zhu Que Mi Re Tuoba Yun Zhang Xinyu Wang Yi Zhi Full Cast & Crew Current Season Season 1 2018 | 54 Episodes Season 1 of Untouchable Lovers premiered on January 14, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Untouchable Lovers. You can help by rating TV shows you've seen. Facts Original Name  凤囚凰 Status  Returning Series Networks Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors m 32 motfilm M 12 Maria180493 s 2 speedycars TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}