{"link": "https://www.themoviedb.org/tv/74597?language=en", "title": "Bravo My Life", "resume": "This drama is the story of three people, actors who fail to debut after seven years and their lives as they relate to a broadcasting station.", "rate": 80, "genre": ["Comedy", "Drama", "Family"], "cast": ["Do Ji-won", "Park Sang-min", "Yeon Jung-hoon", "Jeong Yu-mi", "Hyun Woo"], "character": ["Ra-Ra", "Jung Young-Woong", "Shin Dong-Woo", "Ha Do-Na", "Kim Bum-Woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74597   Expand Bravo My Life   (2017) User Score Overview This drama is the story of three people, actors who fail to debut after seven years and their lives as they relate to a broadcasting station. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Do Ji-won Ra-Ra Park Sang-min Jung Young-Woong Yeon Jung-hoon Shin Dong-Woo Jeong Yu-mi Ha Do-Na Hyun Woo Kim Bum-Woo Full Cast & Crew Current Season Season 1 2017 | 56 Episodes Season 1 of Bravo My Life premiered on October 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bravo My Life. You can help by rating TV shows you've seen. Facts Original Name  브라보 마이 라이프 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://programs.sbs.co.kr/drama/bravomylife Genres Comedy Drama Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 38 Maria180493 12 Elizabeth Jennings 6 Charles R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}