{"link": "https://www.themoviedb.org/tv/60889?language=en", "title": "State of Affairs", "resume": "Each day the President is faced with dozens of life and death decisions, and to prioritize the biggest international crises facing the country, one top CIA analyst - Charleston Tucker - assembles the President's Daily Briefing.\nThis list of the most vital security issues facing the nation brings with it moral and political judgment calls for Charleston and her trusted group of brilliant analysts at the agency. Aside from the political minefields she has to walk, Charlie has a close personal relationship with the President because she was once engaged to her son before a tragic terrorist attack took his life. Charlie survived that attack and is now determined to bring the perpetrators to justice.\nNavigating a complex personal life and a pressure-cooker profession is, of course, a challenge, and Charlie sometimes engages in boundary-pushing behavior to avoid facing her grief. But when the clock strikes 2 a.m., she is all about her job - protecting her nation, serving her president and still trying to get to the bottom of her fiancé's murder that will reveal itself as a shocking mystery.", "rate": 55, "genre": ["Drama"], "cast": ["Katherine Heigl", "Alfre Woodard", "Chris McKenna", "Sheila Vand", "Cliff Chamberlain"], "character": ["Charleston 'Charlie' Tucker", "President Constance Payton", "Nick Vera", "Maureen", "Kurt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60889   Expand State of Affairs   (2014) User Score  Play Trailer Overview Each day the President is faced with dozens of life and death decisions, and to prioritize the biggest international crises facing the country, one top CIA analyst - Charleston Tucker - assembles the President's Daily Briefing. This list of the most vital security issues facing the nation brings with it moral and political judgment calls for Charleston and her trusted group of brilliant analysts at the agency. Aside from the political minefields she has to walk, Charlie has a close personal relationship with the President because she was once engaged to her son before a tragic terrorist attack took his life. Charlie survived that attack and is now determined to bring the perpetrators to justice. Navigating a complex personal life and a pressure-cooker profession is, of course, a challenge, and Charlie sometimes engages in boundary-pushing behavior to avoid facing her grief. But when the clock strikes 2 a.m., she is all about her job - protecting her nation, serving her president and still trying to get to the bottom of her fiancé's murder that will reveal itself as a shocking mystery. Featured Crew Joe Carnahan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine Heigl Charleston 'Charlie' Tucker Alfre Woodard President Constance Payton Chris McKenna Nick Vera Sheila Vand Maureen Cliff Chamberlain Kurt Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of State of Affairs premiered on November 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  5 Posters  3 Recommendations   2016-02-27 Stag 5.9    2015-03-25 Big Time in Hollywood, Fl 5.7    2007-03-15 Raines 7.3    2015-06-10 The Interceptor 5.7    2015-02-18 X Company 7.4    2014-08-23 Intruders 6.5    2014-03-21 Welcome to Sweden 6.3    2014-10-02 Gracepoint 6.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/state-of-affairs Genres Drama Keywords cia usa president national security Content Score 100 Yes! Looking good! Top Contributors 56 Elizabeth Jennings 19 benf45 TB 6 TMDb Bot VM 6 Vaishnav MK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}