{"link": "https://www.themoviedb.org/tv/41693?language=en", "title": "Carlos / Le prix du Chacal", "resume": "Carlos is a French-German television and cinema biographical film from 2010, about the life of the 1970s international terrorist Carlos the Jackal, from his first series of attacks in 1973 until his arrest in 1994. It premiered as a three-part TV mini-series on French pay channel Canal+, with the three parts airing on 19 May, May 26 and June 2, 2010. On the same day it premiered on Canal+, the full 5½ hour version was also shown out of competition at the 2010 Cannes Film Festival.\nProduced by Daniel Leconte of French production company Film En Stock and Jens Meuer of German production company Egoli Tossell Film, in association with Canal+ and French Arte, it was directed by Olivier Assayas from a screenplay by Leconte, Assayas and Dan Franck, and stars Édgar Ramírez as Carlos. The film exists both as a three-part mini-series and a feature film of various lengths between 338 and 319 minutes, but also in several abridged versions, from 187 minutes down to 166 minutes.\nClassified as a theatrical film as well as a TV film/TV mini-series, Carlos has been awarded both theatrical awards and TV awards; among them the 2010 Golden Globe award for the 'Best Miniseries or Motion Picture Made for Television', the 2010 Los Angeles Film Critics Association Award for Best Foreign Language Film and Best Director, the National Society of Film Critics 2010 award for Best Director, the New York Film Critics Circle 2010 award for Best Foreign Language Film, the 2010 European Film Award for Best Editor, the 2010 Critics Award for Best Film at the São Paulo International Film Festival, and Édgar Ramírez won the 2010 César Award for Most Promising Actor.", "rate": 77, "genre": ["Drama", "Crime"], "cast": ["Alexander Scheer", "Nora von Waldstätten", "Edgar Ramírez", "Alejandro Arroyo", "Ahmad Kaabour"], "character": ["Johannes Weinrich", "Magdalena Kopp", "Ilich Ramírez Sánchez („Carlos“)", "Dr. Valentín Hernández", "Wadi Haddad"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41693   Expand Carlos / Le prix du Chacal   (2010) User Score Overview Carlos is a French-German television and cinema biographical film from 2010, about the life of the 1970s international terrorist Carlos the Jackal, from his first series of attacks in 1973 until his arrest in 1994. It premiered as a three-part TV mini-series on French pay channel Canal+, with the three parts airing on 19 May, May 26 and June 2, 2010. On the same day it premiered on Canal+, the full 5½ hour version was also shown out of competition at the 2010 Cannes Film Festival. Produced by Daniel Leconte of French production company Film En Stock and Jens Meuer of German production company Egoli Tossell Film, in association with Canal+ and French Arte, it was directed by Olivier Assayas from a screenplay by Leconte, Assayas and Dan Franck, and stars Édgar Ramírez as Carlos. The film exists both as a three-part mini-series and a feature film of various lengths between 338 and 319 minutes, but also in several abridged versions, from 187 minutes down to 166 minutes. Classified as a theatrical film as well as a TV film/TV mini-series, Carlos has been awarded both theatrical awards and TV awards; among them the 2010 Golden Globe award for the 'Best Miniseries or Motion Picture Made for Television', the 2010 Los Angeles Film Critics Association Award for Best Foreign Language Film and Best Director, the National Society of Film Critics 2010 award for Best Director, the New York Film Critics Circle 2010 award for Best Foreign Language Film, the 2010 European Film Award for Best Editor, the 2010 Critics Award for Best Film at the São Paulo International Film Festival, and Édgar Ramírez won the 2010 César Award for Most Promising Actor. Featured Crew Daniel LeConte Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Scheer Johannes Weinrich Nora von Waldstätten Magdalena Kopp Edgar Ramírez Ilich Ramírez Sánchez („Carlos“) Alejandro Arroyo Dr. Valentín Hernández Ahmad Kaabour Wadi Haddad Full Cast & Crew Last Season Season 1 2010 | 3 Episodes Season 1 of Carlos / Le prix du Chacal premiered on May 19, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1980-10-12 Berlin Alexanderplatz 8.8    1984-12-25 Fanny and Alexander 7.9    Made in Britain 7.5    1973-04-11 Scenes from a Marriage 8.0    1989-05-22 I Know My First Name Is Steven 6.8    1990-09-23 The Civil War 8.9    2011-03-27 Mildred Pierce 7.0    2014-05-06 Gomorrah 7.8  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Miniseries Original Language  English Runtime  333m, 319m, 330m Homepage  - Genres Drama Crime Keywords carlos the jackal Content Score 93 Almost there... Top Contributors S 31 Sebastian d 13 deniro90 S 5 Samara z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}