{"link": "https://www.themoviedb.org/tv/63323?language=en", "title": "SHIMONETA: A Boring World Where the Concept of Dirty Jokes Doesn't Exist", "resume": "Sixteen years after the \"Law for Public Order and Morals in Healthy Child-Raising\" banned coarse language in the country, Tanukichi Okuma enrolls in the country's leading elite public morals school and is soon invited into the Anti-Societal Organization (SOX) by its founder, Ayame Kajou. As a member blackmailed into joining by Ayame, Tanukichi ends up taking part in obscene acts of terrorism against the talented student council president Anna (for whom Tanukichi has a crush on).", "rate": 76, "genre": ["Animation", "Comedy"], "cast": ["Shizuka Ishigami", "Satomi Arai", "Haruka Yamazaki", "Yuusuke Kobayashi", "Yui Horie"], "character": ["Ayame Kajou (voice)", "Otome Saotome (voice)", "Tanukichi Okuma (voice)", "Tanukichi Okuma (voice)", "Kosuri Onigashira (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63323   Expand SHIMONETA: A Boring World Where the Concept of Dirty Jokes Doesn't Exist   (2015) User Score Overview Sixteen years after the \"Law for Public Order and Morals in Healthy Child-Raising\" banned coarse language in the country, Tanukichi Okuma enrolls in the country's leading elite public morals school and is soon invited into the Anti-Societal Organization (SOX) by its founder, Ayame Kajou. As a member blackmailed into joining by Ayame, Tanukichi ends up taking part in obscene acts of terrorism against the talented student council president Anna (for whom Tanukichi has a crush on). Featured Crew Youhei Suzuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shizuka Ishigami Ayame Kajou (voice) Satomi Arai Otome Saotome (voice) Haruka Yamazaki Tanukichi Okuma (voice) Yuusuke Kobayashi Tanukichi Okuma (voice) Yui Horie Kosuri Onigashira (voice) Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of SHIMONETA: A Boring World Where the Concept of Dirty Jokes Doesn't Exist premiered on July  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2014-10-04 Lord Marksman and Vanadis 10.0    2016-10-07 Kiss Him, Not Me 5.6    2007-04-13 Stigma of the Wind 8.1    2017-01-13 Scum's Wish 7.7    2010-07-09 Shiki 6.7    2016-04-08 Haven't You Heard? I'm Sakamoto 6.3    2015-01-07 The Testament of Sister New Devil 6.8    2013-04-04 The Devil Is a Part-Timer! 7.1  Facts Original Name  下ネタという概念が存在しない退屈な世界 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.shimoseka.com/ Genres Animation Comedy Keywords school life ecchi based on light novel anime Content Score 93 Almost there... Top Contributors 18 Diego d 13 draca 13 Elizabeth Jennings 4 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}