{"link": "https://www.themoviedb.org/tv/5929?language=en", "title": "Bull Fighting", "resume": "Bull Fighting is a 2007 Taiwanese drama starring Mike He, Hebe Tien, and Lee Wei. The series was broadcast on free-to-air Taiwan Television from 18 November 2007 to 9 March 2008 on Sunday at 22:00 and cable TV Sanlih E-Television from 24 November 2007 to 15 March 2008 on Saturday at 21:00. But it is worth noting that the word 鬥牛 in this context actually means street basketball.", "rate": 65, "genre": ["Comedy"], "cast": ["Godfrey Gao", "Mike He", "Hebe Tien"], "character": ["Tank", "Shen Ruo He", "Yi Sheng Xue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5929   Expand Bull Fighting   (2007) User Score Overview Bull Fighting is a 2007 Taiwanese drama starring Mike He, Hebe Tien, and Lee Wei. The series was broadcast on free-to-air Taiwan Television from 18 November 2007 to 9 March 2008 on Sunday at 22:00 and cable TV Sanlih E-Television from 24 November 2007 to 15 March 2008 on Saturday at 21:00. But it is worth noting that the word 鬥牛 in this context actually means street basketball. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Godfrey Gao Tank Mike He Shen Ruo He Hebe Tien Yi Sheng Xue Full Cast & Crew Last Season Season 1 — | 17 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bull Fighting. You can help by rating TV shows you've seen. Facts Original Name  鬥牛，要不要 Status  Ended Network TTV Main Channel Certification  - Type  Scripted Original Language  Chinese Runtime  60m Homepage   http://www.ttv.com.tw/drama/2007/basketball/index.htm Genres Comedy Keywords taiwanese Content Score 56 We're so close, yet so far. Top Contributors M 14 Maria180493 z 10 zurman1 CM 4 Cherche Moi 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}