{"link": "https://www.themoviedb.org/tv/3795?language=en", "title": "Mein Leben & Ich", "resume": "Mein Leben & Ich is a German situation comedy produced by Sony Pictures in association with RTL Television for RTL. The series was created by Paula A. Roth and loosely based on ABC's 1994 teen drama My So-Called Life. The series focuses on the life of student Alex Degenhardt, who deals with everyday life and sometimes frustrating friends, Claudia and Niko, as well as her family; her little brother Basti and her Hippie-parents Hendrik and Anke. A sixth Season was produced in 2006 but not shown until late 2009.\nIt is also telecast in Finland by Nelonen, in France and in Spain.", "rate": 90, "genre": ["Family", "Comedy"], "cast": ["Wolke Hegenbarth", "Maren Kroymann", "Frederik Hunschede", "Jonas Faust", "Gottfried Vollmer"], "character": ["Alexandra Degenhardt", "Anke Degenhardt", "Sebastian Degenhardt", "Stefan", "Hendrik Degenhardt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3795   Expand Mein Leben & Ich   (2001) User Score Overview Mein Leben & Ich is a German situation comedy produced by Sony Pictures in association with RTL Television for RTL. The series was created by Paula A. Roth and loosely based on ABC's 1994 teen drama My So-Called Life. The series focuses on the life of student Alex Degenhardt, who deals with everyday life and sometimes frustrating friends, Claudia and Niko, as well as her family; her little brother Basti and her Hippie-parents Hendrik and Anke. A sixth Season was produced in 2006 but not shown until late 2009. It is also telecast in Finland by Nelonen, in France and in Spain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wolke Hegenbarth Alexandra Degenhardt Maren Kroymann Anke Degenhardt Frederik Hunschede Sebastian Degenhardt Jonas Faust Stefan Gottfried Vollmer Hendrik Degenhardt Full Cast & Crew Last Season Season 6 2009 | 13 Episodes Season 6 of Mein Leben & Ich premiered on November 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mein Leben & Ich. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  25m Homepage  - Genres Family Comedy Keywords teenager Content Score 86 Almost there... Top Contributors S 30 Samara J 7 Julia11111 2 tehabe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}