{"link": "https://www.themoviedb.org/tv/61880?language=en", "title": "Garfunkel and Oates", "resume": "Garfunkel and Oates stars Riki Lindhome and Kate Micucci as both themselves and their musical comedy alter-egos, \"Garfunkel and Oates,\" following the pair as they try to expand the reaches of their meager celebrity. Well-known on the improv-comedy scene, Micucci and Lindhome met at the Upright Citizens Brigade Theatre in LA, naming their band for \"two famous rock-and-roll second bananas,\" Art Garfunkel and John Oates. In five bite-sized episodes, Riki and Kate skewer taboos and perform tongue-in-cheek songs about their woeful lives as single, late-20-something Los Angelinos.", "rate": 75, "genre": ["Comedy"], "cast": ["Riki Lindhome", "Kate Micucci"], "character": ["Garfunkel", "Oates"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61880   Expand Garfunkel and Oates   (2014) User Score Overview Garfunkel and Oates stars Riki Lindhome and Kate Micucci as both themselves and their musical comedy alter-egos, \"Garfunkel and Oates,\" following the pair as they try to expand the reaches of their meager celebrity. Well-known on the improv-comedy scene, Micucci and Lindhome met at the Upright Citizens Brigade Theatre in LA, naming their band for \"two famous rock-and-roll second bananas,\" Art Garfunkel and John Oates. In five bite-sized episodes, Riki and Kate skewer taboos and perform tongue-in-cheek songs about their woeful lives as single, late-20-something Los Angelinos. Featured Crew Riki Lindhome Creator Kate Micucci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Riki Lindhome Garfunkel Kate Micucci Oates Full Cast & Crew Last Season Season 1 2014 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Wow! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2013-10-18 The Birthday Boys 7.1    2012-02-20 The Bleak Old Shop of Stuff 6.7    2015-02-20 Richie Rich 3.0    2011-02-08 Traffic Light 7.2    2011-10-17 Threesome 6.3    2016-08-02 Borderline 7.1    2016-01-11 Crashing 7.2    2012-06-08 Comedy Bang! Bang! 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   http://www.ifc.com/shows/garfunkel-and-oates Genres Comedy Keywords stand-up comedy folk singer Content Score 64 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings 7 isavedtheday R 4 RobbnHood D 3 David1886  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}