{"link": "https://www.themoviedb.org/tv/1537?language=en", "title": "The Agency", "resume": "The Agency is a CBS television drama that followed the inner-workings of the CIA. The series was created by Michael Frost Beckner and was executive produced by Michael Frost Beckner, Shaun Cassidy Productions and Radiant Productions in association with Universal Network Television and CBS Productions. It aired from September 27, 2001 until May 17, 2003, lasting two seasons. It featured unprecedented filming from the actual CIA headquarters.\nThe show was controversial regarding its exploration of current international affairs and its treatment of the ethical conflicts inherent in intelligence work. Beckner's pilot script, written in March 2001, posited a re-invented CIA tasked with a \"War on Terror\" after Osama Bin Laden's Al Qaeda terrorist organization plots a lethal attack on the west. The pilot was to premiere at CIA Headquarters on September 18, 2001 and set to air on CBS September 21, 2001, however, the actual 9/11 attacks convinced the network to hold the pilot and instead air a later episode. That first episode was aired later as the third episode of the first season.\nThe September 11, 2001 terrorist events changed the way Americans viewed topical entertainment and \"The Agency\", at the time, was one of the most topical offering on network television. The producers of the series quickly responded to this new American perspective on world affairs, but CBS chose to cancel the show shortly after the second season's final episode.", "rate": 70, "genre": ["Drama"], "cast": ["Gil Bellows", "Jason O'Mara", "David Clennon", "Gloria Reuben", "Will Patton"], "character": ["Jackson Haisley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1537   Expand The Agency   (2001) User Score Overview The Agency is a CBS television drama that followed the inner-workings of the CIA. The series was created by Michael Frost Beckner and was executive produced by Michael Frost Beckner, Shaun Cassidy Productions and Radiant Productions in association with Universal Network Television and CBS Productions. It aired from September 27, 2001 until May 17, 2003, lasting two seasons. It featured unprecedented filming from the actual CIA headquarters. The show was controversial regarding its exploration of current international affairs and its treatment of the ethical conflicts inherent in intelligence work. Beckner's pilot script, written in March 2001, posited a re-invented CIA tasked with a \"War on Terror\" after Osama Bin Laden's Al Qaeda terrorist organization plots a lethal attack on the west. The pilot was to premiere at CIA Headquarters on September 18, 2001 and set to air on CBS September 21, 2001, however, the actual 9/11 attacks convinced the network to hold the pilot and instead air a later episode. That first episode was aired later as the third episode of the first season. The September 11, 2001 terrorist events changed the way Americans viewed topical entertainment and \"The Agency\", at the time, was one of the most topical offering on network television. The producers of the series quickly responded to this new American perspective on world affairs, but CBS chose to cancel the show shortly after the second season's final episode. Featured Crew Wolfgang Petersen Creator Gail Katz Creator Michael Frost Beckner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gil Bellows Jason O'Mara David Clennon Gloria Reuben Will Patton Jackson Haisley Full Cast & Crew Last Season Season 2 2002 | 22 Episodes Season 2 of The Agency premiered on September 28, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Agency. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords cia terrorist spy national security Content Score 93 Almost there... Top Contributors 8 Banana d 4 denis s 3 speedycars 3 Christian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}