{"link": "https://www.themoviedb.org/tv/25229?language=en", "title": "Junior Masterchef", "resume": "Junior MasterChef is a British TV cookery competition, broadcast by the BBC, in which nine- to twelve-year-olds compete to be crowned Junior MasterChef. It is a spin-off from the main series MasterChef.\nJunior MasterChef first ran from 1994 to 1999, presented by Loyd Grossman. After a long hiatus, it was revived in 2010 in a revamped format, presented by writer and actress Nadia Sawalha, previously a Celebrity MasterChef contestant and restaurant owner, and professional chef John Torode, who also presents MasterChef. The revival series was commissioned by CBBC Controller Anne Gilchrist and produced by Shine Television, and was broadcast on BBC One. A further series was commissioned in 2012 for broadcast on CBBC.", "rate": 50, "genre": ["Reality"], "cast": ["Loyd Grossman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25229   Expand Junior Masterchef   (1994) User Score Overview Junior MasterChef is a British TV cookery competition, broadcast by the BBC, in which nine- to twelve-year-olds compete to be crowned Junior MasterChef. It is a spin-off from the main series MasterChef. Junior MasterChef first ran from 1994 to 1999, presented by Loyd Grossman. After a long hiatus, it was revived in 2010 in a revamped format, presented by writer and actress Nadia Sawalha, previously a Celebrity MasterChef contestant and restaurant owner, and professional chef John Torode, who also presents MasterChef. The revival series was commissioned by CBBC Controller Anne Gilchrist and produced by Shine Television, and was broadcast on BBC One. A further series was commissioned in 2012 for broadcast on CBBC. Featured Crew Franc Roddam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Loyd Grossman Full Cast & Crew Last Season Season 2 1995 | 15 Episodes Season 2 of Junior Masterchef premiered on July 16, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Junior Masterchef. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Reality Keywords competition cooking Content Score 64 We're so close, yet so far. Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}