{"link": "https://www.themoviedb.org/tv/10545?language=en", "title": "True Blood", "resume": "True Blood is an American television drama series created and produced by Alan Ball. It is based on The Southern Vampire Mysteries series of novels by Charlaine Harris, detailing the co-existence of vampires and humans in Bon Temps, a fictional, small town in northwestern Louisiana. The series centers on the adventures of Sookie Stackhouse, a telepathic waitress with an otherworldly quality.", "rate": 71, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Anna Paquin", "Stephen Moyer", "Alexander Skarsgård", "Sam Trammell", "Ryan Kwanten"], "character": ["Sookie Stackhouse", "Bill Compton", "Eric Northman", "Sam Merlotte", "Jason Stackhouse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10545   Expand True Blood   (2008) User Score  Play Trailer Overview True Blood is an American television drama series created and produced by Alan Ball. It is based on The Southern Vampire Mysteries series of novels by Charlaine Harris, detailing the co-existence of vampires and humans in Bon Temps, a fictional, small town in northwestern Louisiana. The series centers on the adventures of Sookie Stackhouse, a telepathic waitress with an otherworldly quality. Featured Crew Alan Ball Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  53 Posters  41 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Paquin Sookie Stackhouse Stephen Moyer Bill Compton Alexander Skarsgård Eric Northman Sam Trammell Sam Merlotte Ryan Kwanten Jason Stackhouse Full Cast & Crew Last Season Season 7 2014 | 10 Episodes Season 7 of True Blood premiered on June 22, 2014. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Disappointed with Last Seasons Open 1 by  MirrorMask w Sarah: Happy Birthday Anna Camp! Open 0 by wonder2wonder\n      \n     w Eric: Happy Birthday Alexander Skarsgård! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  53 Posters  41 Recommendations   2006-09-25 Heroes 6.9    2006-10-01 Dexter 8.0    2010-01-22 Spartacus 7.8    2008-09-09 Fringe 8.1    2005-08-07 Weeds 7.1    2004-09-22 Lost 7.8    2001-10-16 Smallville 6.9    2010-09-19 Boardwalk Empire 7.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 52m Homepage   http://www.hbo.com/trueblood/ Genres Drama Sci-Fi & Fantasy Keywords based on novel or book vampire undead blood werewolf ghost dark fantasy erotic thriller fae interspecies romance Content Score 100 Yes! Looking good! Top Contributors M 165 Manu 67 Elizabeth Jennings 39 Travis Bell 25 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}