{"link": "https://www.themoviedb.org/tv/31205?language=en", "title": "Partners in Crime", "resume": "Partners in Crime is an American crime drama television series that aired from September 22 until December 29, 1984.", "rate": 75, "genre": ["Crime", "Drama"], "cast": ["Eileen Heckart", "Lynda Carter", "Walter Olkewicz", "Loni Anderson", "Leo Rossi"], "character": ["Carole Stanwyck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31205   Expand Partners in Crime   (1984) User Score Overview Partners in Crime is an American crime drama television series that aired from September 22 until December 29, 1984. Featured Crew James Stark Creator Leonard Stern Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eileen Heckart Lynda Carter Carole Stanwyck Walter Olkewicz Loni Anderson Leo Rossi Full Cast & Crew Last Season Season 1 1984 | 13 Episodes Season 1 of Partners in Crime premiered on September 22, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Wish It Had Succeeded Open 0 by BryanB\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Partners in Crime. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords san francisco private investigator female private detective Content Score 79 Pump it up! We're close now. Top Contributors 14 Banana 6 lineker e 3 error666 S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}