{"link": "https://www.themoviedb.org/tv/34000?language=en", "title": "The Fugitive: Plan B", "resume": "The Fugitive: Plan B is a 2010 South Korean action television series, starring Rain and Lee Na-young. It aired on KBS2 from September 29 to December 8, 2010 on Wednesdays and Thursdays at 21:55 for 20 episodes.\nThe series was directed by Kwak Jung-hwan and written by Cheon Sung-il, the same team behind The Slave Hunters. The rights to the series were sold to seven countries in asia including Japan, Taiwan, the Philippines, Thailand, Hong Kong, China, Singapore, Malaysia and Indonesia.", "rate": 80, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lee Na-young", "Daniel Henney", "Takako Uehara", "Naoto Takanaka", "Rain"], "character": ["Kai", "Ji Woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34000   Expand The Fugitive: Plan B   (2010) User Score Overview The Fugitive: Plan B is a 2010 South Korean action television series, starring Rain and Lee Na-young. It aired on KBS2 from September 29 to December 8, 2010 on Wednesdays and Thursdays at 21:55 for 20 episodes. The series was directed by Kwak Jung-hwan and written by Cheon Sung-il, the same team behind The Slave Hunters. The rights to the series were sold to seven countries in asia including Japan, Taiwan, the Philippines, Thailand, Hong Kong, China, Singapore, Malaysia and Indonesia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Na-young Daniel Henney Kai Takako Uehara Naoto Takanaka Rain Ji Woo Full Cast & Crew Last Season Season 1 2010 | 21 Episodes Season 1 of The Fugitive: Plan B premiered on September 29, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Fugitive: Plan B. You can help by rating TV shows you've seen. Facts Original Name  도망자 PLAN B Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/planb/ Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 15 Nightowl.Kr B 6 Blobfish z 6 zurman1 t 5 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}