{"link": "https://www.themoviedb.org/tv/40874?language=en", "title": "Ritas Welt", "resume": "Ritas Welt is a German television sitcom that premiered on RTL on 17 September 1999 and ended its run after five successful seasons on 19 December 2003. Starring Gaby Köster, the show was about a confident sales assistant, Rita Kruse; her fight with her self-righteous boss, Achim Schuhmann; and her life with her loving husband Horst and their two children, Sandra and Markus. Through it all, Rita is supported by her wacky best friend Gisi Wiemers.", "rate": 60, "genre": ["Comedy"], "cast": ["Gaby Köster", "Frank Vockroth", "Franziska Traub", "Lutz Herkenrath", "Marius Theobald"], "character": ["Rita Kruse", "Horst Kruse", "Gisela 'Gisi' Wiemers", "Achim Schumann", "Markus Kruse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40874   Expand Ritas Welt   (1999) User Score Overview Ritas Welt is a German television sitcom that premiered on RTL on 17 September 1999 and ended its run after five successful seasons on 19 December 2003. Starring Gaby Köster, the show was about a confident sales assistant, Rita Kruse; her fight with her self-righteous boss, Achim Schuhmann; and her life with her loving husband Horst and their two children, Sandra and Markus. Through it all, Rita is supported by her wacky best friend Gisi Wiemers. Featured Crew Thomas Koch Creator Michael Gantenberg Creator Peter Freiberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gaby Köster Rita Kruse Frank Vockroth Horst Kruse Franziska Traub Gisela 'Gisi' Wiemers Lutz Herkenrath Achim Schumann Marius Theobald Markus Kruse Full Cast & Crew Last Season Season 5 2002 | 14 Episodes Season 5 of Ritas Welt premiered on December 27, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ritas Welt. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 41 Samara S 7 SirTobi27  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}