{"link": "https://www.themoviedb.org/tv/66387?language=en", "title": "Beautiful Mind", "resume": "Lee Young-O is an excellent neurosurgeon with zero sympathy. One day, he becomes involved in bizarre patient deaths. He also falls in love and recovers his humanity.", "rate": 67, "genre": ["Drama", "Mystery"], "cast": ["Jang Hyuk", "Park So-dam", "Yoon Hyun-min", "Park Se-young", "Heo Jun-Ho"], "character": ["Lee Young-Oh", "Gye Jin-Sung", "Hyun Suk-Joo", "Kim Min-Jae", "Lee Geon-Myung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66387   Expand Beautiful Mind   (2016) User Score Overview Lee Young-O is an excellent neurosurgeon with zero sympathy. One day, he becomes involved in bizarre patient deaths. He also falls in love and recovers his humanity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Hyuk Lee Young-Oh Park So-dam Gye Jin-Sung Yoon Hyun-min Hyun Suk-Joo Park Se-young Kim Min-Jae Heo Jun-Ho Lee Geon-Myung Full Cast & Crew Last Season Season 1 2016 | 14 Episodes Season 1 of Beautiful Mind premiered on June 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2015-10-05 Six Flying Dragons 7.8    2016-03-05 Marriage Contract 8.2    2016-05-25 Lucky Romance 7.3    2016-04-20 Entertainer 6.0    2015-01-07 Kill Me, Heal Me 8.7    2016-01-22 Signal 7.4    2016-06-17 Squad 38 7.7    2014-12-08 Healer 8.7  Facts Original Name  뷰티풀 마인드 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/beautifulmind/ Genres Drama Mystery Keywords korea Content Score 86 Almost there... Top Contributors M 50 Maria180493 d 11 daphie z 10 zurman1 8 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}