{"link": "https://www.themoviedb.org/tv/70047?language=en", "title": "Rapunzel's Tangled Adventure", "resume": "Set between “Tangled” and “Tangled Ever After,” this animated adventure/comedy series unfolds as Rapunzel acquaints herself with her parents, her kingdom and the people of Corona.", "rate": 59, "genre": ["Animation", "Kids"], "cast": ["Mandy Moore", "Zachary Levi", "Julie Bowen", "Clancy Brown", "Eden Espinosa"], "character": ["Rapunzel (voice)", "Eugene (voice)", "Queen Arianna (voice)", "King Frederic (voice)", "Cassandra (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70047   Expand Rapunzel's Tangled Adventure   (2017) User Score  Play Trailer Overview Set between “Tangled” and “Tangled Ever After,” this animated adventure/comedy series unfolds as Rapunzel acquaints herself with her parents, her kingdom and the people of Corona. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mandy Moore Rapunzel (voice) Zachary Levi Eugene (voice) Julie Bowen Queen Arianna (voice) Clancy Brown King Frederic (voice) Eden Espinosa Cassandra (voice) Full Cast & Crew Current Season Season 2 2018 | 4 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Hair (spoilers) Open 0 by GForce59\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2016-10-03 Milo Murphy’s Law 7.5    2008-06-16 The Middleman 7.5    2009-01-23 Wolverine and the X-Men 7.0  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  21m Homepage   http://disneynow.go.com/shows/tangled-the-series Genres Animation Kids Keywords magic kingdom based on movie based on fairy tale Content Score 93 Almost there... Top Contributors 71 Elizabeth Jennings 16 Will Barks m 10 mikisoft a 7 airrr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}