{"link": "https://www.themoviedb.org/tv/119?language=en", "title": "Cory in the House", "resume": "Cory in the House is an American television sitcom, which aired on the Disney Channel from January 12, 2007 to September 13, 2008 and was a spin-off from the Disney show That's So Raven. The show focuses on Cory Baxter, who moved from San Francisco, California to Washington, D.C., after Victor Baxter gets a new job in the White House as the official head chef. The series marks a Disney Channel first, as it is the channel's first spin-off. This is also the only Disney Channel spin-off series to be broadcast in standard definition for the entire length of the show. Reruns of the series have not been produced on Disney Channel, or on Disney XD; however they continue to air on the Family channel in Canada. Raven-Symone guest-starred, reprising her role as Raven Baxter in one episode.", "rate": 53, "genre": ["Comedy"], "cast": ["Jason Dolley", "Kyle Massey", "Rondell Sheridan", "John D'Aquino", "Madison Pettis"], "character": ["Newt Livingston", "Cory Baxter", "Victor Baxter", "President Richard Martinez", "Sophie Martinez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 119   Expand Cory in the House   (2007) User Score Overview Cory in the House is an American television sitcom, which aired on the Disney Channel from January 12, 2007 to September 13, 2008 and was a spin-off from the Disney show That's So Raven. The show focuses on Cory Baxter, who moved from San Francisco, California to Washington, D.C., after Victor Baxter gets a new job in the White House as the official head chef. The series marks a Disney Channel first, as it is the channel's first spin-off. This is also the only Disney Channel spin-off series to be broadcast in standard definition for the entire length of the show. Reruns of the series have not been produced on Disney Channel, or on Disney XD; however they continue to air on the Family channel in Canada. Raven-Symone guest-starred, reprising her role as Raven Baxter in one episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Dolley Newt Livingston Kyle Massey Cory Baxter Rondell Sheridan Victor Baxter John D'Aquino President Richard Martinez Madison Pettis Sophie Martinez Full Cast & Crew Last Season Season 2 2007 | 13 Episodes Season 2 of Cory in the House premiered on November 17, 2007. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Sophie: Happy Birthday Madison Pettis! Open 0 by wonder2wonder\n      \n     w Newt: Happy Birthday Jason Dolley! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2003-01-17 That's So Raven 5.6    2012-10-12 Dog With a Blog 5.3    2009-02-08 Sonny with a Chance 5.0    2010-11-07 Shake It Up 2.8    2004-01-23 Dave the Barbarian 4.8    2007-10-12 Wizards of Waverly Place 6.6    2006-03-24 Hannah Montana 5.0    2010-04-04 Good Luck Charlie 5.8  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://en.wikipedia.org/wiki/Cory_In_the_House! Genres Comedy Keywords teenager Content Score 86 Almost there... Top Contributors 6 lineker 3 DarkMan 2 Banana S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}