{"link": "https://www.themoviedb.org/tv/31134?language=en", "title": "Holmes Inspection", "resume": "Holmes Inspection is a 2009 Canadian home renovation series on HGTV, hosted by general contractor Mike Holmes. It is the third of Holmes' renovation series, following Holmes on Homes and Holmes in New Orleans. The format of the series is similar to those of his previous series Holmes on Homes, where Mike enters a home in need of repair and often finds substandard work. However, unlike Holmes on Homes, whose focus was on substandard work done by fraudulent or poor-quality contractors, the focus of Holmes Inspection is on homeowners who have been victimized solely as a result of poor home inspections.\nIn the United States, the series debuted on HGTV on Sunday, December 19, 2010.", "rate": 90, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31134   Expand Holmes Inspection   (2009) User Score Overview Holmes Inspection is a 2009 Canadian home renovation series on HGTV, hosted by general contractor Mike Holmes. It is the third of Holmes' renovation series, following Holmes on Homes and Holmes in New Orleans. The format of the series is similar to those of his previous series Holmes on Homes, where Mike enters a home in need of repair and often finds substandard work. However, unlike Holmes on Homes, whose focus was on substandard work done by fraudulent or poor-quality contractors, the focus of Holmes Inspection is on homeowners who have been victimized solely as a result of poor home inspections. In the United States, the series debuted on HGTV on Sunday, December 19, 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2011 | 13 Episodes Season 3 of Holmes Inspection premiered on November 17, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Holmes Inspection. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}