{"link": "https://www.themoviedb.org/tv/16433?language=en", "title": "Jack and the Beanstalk: The Real Story", "resume": "Jack and the Beanstalk: The Real Story is a 2001 American television miniseries. It was directed by Brian Henson and was a co-production of CBS and Jim Henson Television. It is an alternative version of the classic English fairy tale Jack and the Beanstalk. The story was considerably reworked to reflect what Henson believed to be a more ethical, humanist view. The cast includes Matthew Modine, Mia Sara, Jon Voight, and Vanessa Redgrave. Richard Attenborough, Daryl Hannah, and a young James Corden play giants. Among the other giants in the film are beings from the mythology of various cultures, including Hebrew, Buddhist, and Nordic.", "rate": 65, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Matthew Modine", "Vanessa Redgrave", "Jim Carter", "Mia Sara", "Freddie Highmore"], "character": ["Jack Robinson (Johnathan William Duncan Robinson)", "Countess Wilhelmina, Matriarch / Narrator", "Odin, Member of Great Council of Mac Slec", "Ondine", "Son at Playground"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16433   Expand Jack and the Beanstalk: The Real Story   (2001) User Score  Play Trailer Overview Jack and the Beanstalk: The Real Story is a 2001 American television miniseries. It was directed by Brian Henson and was a co-production of CBS and Jim Henson Television. It is an alternative version of the classic English fairy tale Jack and the Beanstalk. The story was considerably reworked to reflect what Henson believed to be a more ethical, humanist view. The cast includes Matthew Modine, Mia Sara, Jon Voight, and Vanessa Redgrave. Richard Attenborough, Daryl Hannah, and a young James Corden play giants. Among the other giants in the film are beings from the mythology of various cultures, including Hebrew, Buddhist, and Nordic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Modine Jack Robinson (Johnathan William Duncan Robinson) Vanessa Redgrave Countess Wilhelmina, Matriarch / Narrator Jim Carter Odin, Member of Great Council of Mac Slec Mia Sara Ondine Freddie Highmore Son at Playground Full Cast & Crew Last Season Season 1 2001 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  11 Recommendations   2006-04-14 Merlin's Apprentice 0.0    2000-05-07 Jason and the Argonauts 5.6    2005-09-17 Mysterious Island 5.0    2000-04-30 Arabian Nights 6.8    2005-05-08 Elvis 5.8    1998-04-26 Merlin 6.3    1998-05-18 Creature 4.2    2004-06-20 Salem's Lot 5.5  Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  174m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords fantasy fairy tale beanstalk giant Content Score 93 Almost there... Top Contributors TB 40 TMDb Bot c 12 chispy 10 Steve 4 Farkas Tibor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}