{"link": "https://www.themoviedb.org/tv/4087?language=en", "title": "The X-Files", "resume": "The exploits of FBI Special Agents Fox Mulder and Dana Scully who investigate X-Files: marginalized, unsolved cases involving paranormal phenomena. Mulder believes in the existence of aliens and the paranormal while Scully, a skeptic, is assigned to make scientific analyses of Mulder's discoveries that debunk Mulder's work and thus return him to mainstream cases.", "rate": 81, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Gillian Anderson", "David Duchovny", "Mitch Pileggi", "William B. Davis"], "character": ["Dana Scully", "Fox Mulder", "Walter Skinner", "Cigarette Smoking Man"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4087   Expand The X-Files   (1993) User Score  Play Trailer Overview The exploits of FBI Special Agents Fox Mulder and Dana Scully who investigate X-Files: marginalized, unsolved cases involving paranormal phenomena. Mulder believes in the existence of aliens and the paranormal while Scully, a skeptic, is assigned to make scientific analyses of Mulder's discoveries that debunk Mulder's work and thus return him to mainstream cases. Featured Crew Chris Carter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  59 Content Issues  3 Images Backdrops  45 Posters  22 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gillian Anderson Dana Scully David Duchovny Fox Mulder Mitch Pileggi Walter Skinner William B. Davis Cigarette Smoking Man Full Cast & Crew Current Season Season 11 2018 | 10 Episodes Season 11 of The X-Files premiered on January  3, 2018. View All Seasons Social Reviews  0 Discussions  62 Subject Status Replies Last Reply Gillian Anderson to leave? Open 3 by  mechajutaro Nothing about My Struggle IV? Open 14 by  lennonforever Rm9sbG93ZXJz   Scully and Mulder battle AI and the Drones SPOILERS Open 1 by  tuffysmom Go to Discussions Media Most Popular Videos  1 Backdrops  45 Posters  22 Recommendations   1987-09-28 Star Trek: The Next Generation 8.2    2008-09-09 Fringe 8.1    2006-09-25 Heroes 6.9    2004-09-22 Lost 7.8    1966-09-08 Star Trek 8.1    1989-07-05 Seinfeld 8.2    1999-03-28 Futurama 8.2    2004-11-16 House 8.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.fox.com/the-x-files Genres Drama Mystery Sci-Fi & Fantasy Keywords fbi supernatural alien ufo conspiracy paranormal investigation phenomenon american folklore Content Score 100 Yes! Looking good! Top Contributors 228 Marr 🇳🇱 77 Elizabeth Jennings 34 lineker f 32 furkan-guven0115  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}