{"link": "https://www.themoviedb.org/tv/15487?language=en", "title": "Tales of Tomorrow", "resume": "Tales of Tomorrow is an American anthology science fiction series that was performed and broadcast live on ABC from 1951 to 1953. The series covered such stories as Frankenstein, starring Lon Chaney, Jr., 20,000 Leagues Under the Sea starring Thomas Mitchell as Captain Nemo, and many others featuring such performers as Boris Karloff, Brian Keith, Lee J. Cobb, Rod Steiger, Bruce Cabot, Franchot Tone, Gene Lockhart, Walter Abel, Leslie Nielsen, and Paul Newman. The series had many similarities to the later Twilight Zone which also covered one of the same stories, \"What You Need\". In total it ran for eighty-five 30-minute episodes.", "rate": 60, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15487   Expand Tales of Tomorrow   (1951) User Score Overview Tales of Tomorrow is an American anthology science fiction series that was performed and broadcast live on ABC from 1951 to 1953. The series covered such stories as Frankenstein, starring Lon Chaney, Jr., 20,000 Leagues Under the Sea starring Thomas Mitchell as Captain Nemo, and many others featuring such performers as Boris Karloff, Brian Keith, Lee J. Cobb, Rod Steiger, Bruce Cabot, Franchot Tone, Gene Lockhart, Walter Abel, Leslie Nielsen, and Paul Newman. The series had many similarities to the later Twilight Zone which also covered one of the same stories, \"What You Need\". In total it ran for eighty-five 30-minute episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1952 | 42 Episodes Season 2 of Tales of Tomorrow premiered on August 22, 1952. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tales of Tomorrow. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 8 lineker 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}