{"link": "https://www.themoviedb.org/tv/5275?language=en", "title": "That's My Boy", "resume": "That's My Boy is a British sitcom that aired on ITV from 1981 to 1986. Starring Mollie Sugden, it was written by Pam Valentine and Michael Ashton, who later wrote My Husband and I, which also starred Mollie Sugden. It was produced by Yorkshire Television for the ITV network.", "rate": 68, "genre": ["Comedy"], "cast": ["Mollie Sugden", "Christopher Blake", "Harold Goodwin", "Deddie Davies", "Tim Barrett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5275   Expand That's My Boy   (1981) User Score Overview That's My Boy is a British sitcom that aired on ITV from 1981 to 1986. Starring Mollie Sugden, it was written by Pam Valentine and Michael Ashton, who later wrote My Husband and I, which also starred Mollie Sugden. It was produced by Yorkshire Television for the ITV network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mollie Sugden Christopher Blake Harold Goodwin Deddie Davies Tim Barrett Full Cast & Crew Last Season Season 5 1986 | 7 Episodes Season 5 of That's My Boy premiered on February 21, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on That's My Boy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords mother adoption son couple british humour Content Score 71 Just a little bit more... Top Contributors O 8 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}