{"link": "https://www.themoviedb.org/tv/66732?language=en", "title": "Stranger Things", "resume": "When a young boy vanishes, a small town uncovers a mystery involving secret experiments, terrifying supernatural forces, and one strange little girl.", "rate": 84, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Winona Ryder", "David Harbour", "Finn Wolfhard", "Millie Bobby Brown", "Gaten Matarazzo"], "character": ["Joyce Byers", "Jim Hopper", "Mike Wheeler", "Eleven", "Dustin Henderson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66732   Expand Stranger Things   (2016) User Score  Play Trailer Overview When a young boy vanishes, a small town uncovers a mystery involving secret experiments, terrifying supernatural forces, and one strange little girl. Featured Crew Ross Duffer Creator Matt Duffer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  47 Content Issues  2 Images Backdrops  20 Posters  50 Videos Trailers  3 Teasers  1 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Winona Ryder Joyce Byers David Harbour Jim Hopper Finn Wolfhard Mike Wheeler Millie Bobby Brown Eleven Gaten Matarazzo Dustin Henderson Full Cast & Crew Current Season Season 2 2017 | 9 Episodes View All Seasons Social Reviews  0 Discussions  50 Subject Status Replies Last Reply m How Bout That Music? Open 3 by  Baz T Number of episodes confirmed in Season 3 Open 0 by Theother\n      \n     The sheriff’s Tide commercials LOL Open 0 by lantzn\n      \n     Go to Discussions Media Most Popular Videos  5 Backdrops  20 Posters  50 Recommendations   2011-12-04 Black Mirror 8.2    2016-10-02 Westworld 8.1    2015-04-10 Marvel's Daredevil 7.7    2015-11-20 Marvel's Jessica Jones 7.6    2010-07-25 Sherlock 8.3    2015-05-27 Mr. Robot 7.8    2013-02-01 House of Cards 8.2    2014-04-15 Fargo 8.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  50m Homepage   https://www.netflix.com/title/80057281 Genres Drama Mystery Sci-Fi & Fantasy Keywords friendship monster experiment supernatural telekinesis horror role playing parallel world missing person missing child government conspiracy 1980s psychologial thriller Content Score 100 Yes! Looking good! Top Contributors 101 Elizabeth Jennings 44 Imzadi T 42 Theother 4 36 42  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}