{"link": "https://www.themoviedb.org/tv/53721?language=en", "title": "Love Live!", "resume": "The school idol project is set at a school between Tokyo's Akihabara, Kanda, and Jinbouchou neighbourhoods. The school faces the danger of being streamlined out of existence, so nine of its female students decide to become idols to protect their school and boost attendance.", "rate": 78, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Aina Kusuda", "Emi Nitta", "Pile", "Riho Iida", "Suzuko Mimori"], "character": ["Nozomi Tōjō", "Honoka Kōsaka", "Maki Nishikino", "Rin Hoshizora", "Umi Sonoda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53721   Expand Love Live!   (2013) User Score  Play Trailer Overview The school idol project is set at a school between Tokyo's Akihabara, Kanda, and Jinbouchou neighbourhoods. The school faces the danger of being streamlined out of existence, so nine of its female students decide to become idols to protect their school and boost attendance. Featured Crew Hajime Yatate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aina Kusuda Nozomi Tōjō Emi Nitta Honoka Kōsaka Pile Maki Nishikino Riho Iida Rin Hoshizora Suzuko Mimori Umi Sonoda Full Cast & Crew Last Season Season 2 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2016-07-09 91 Days 7.3  Facts Original Name  ラブライブ! School idol project Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.lovelive-anime.jp/worldwide/ Genres Animation Comedy Drama Keywords high school sibling relationship sport music competition talent idol training friends school singing maid fashion learning school life anime hardworking Content Score 100 Yes! Looking good! Top Contributors 106 miryoku 40 minusha97 M 11 Maddrax 5 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}