{"link": "https://www.themoviedb.org/tv/66218?language=en", "title": "Dramaworld", "resume": "When 20-year-old college student and K-drama fanatic Claire Duncan is transported into her favorite drama, “Taste of Love”, her appearance throws the show off-balance, causing other dramas to splice into the series. Mysterious waiter Seth Ko made his own journey into the drama years ago from the real world and mentors Claire on how to navigate the dramaworld. What kind of crazy adventure will Claire experience?", "rate": 78, "genre": ["Drama"], "cast": ["Liv Hewson", "Sean Dulake", "Bae Noo-ri", "Kim Sa-hee", "Justin Chon"], "character": ["Claire Duncan", "Joon Park", "Seo-yeon", "Ga-in", "Seth Ko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66218   Expand Dramaworld   (2016) User Score  Play Trailer Overview When 20-year-old college student and K-drama fanatic Claire Duncan is transported into her favorite drama, “Taste of Love”, her appearance throws the show off-balance, causing other dramas to splice into the series. Mysterious waiter Seth Ko made his own journey into the drama years ago from the real world and mentors Claire on how to navigate the dramaworld. What kind of crazy adventure will Claire experience? Featured Crew Chris Martin Creator Josh Billig Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liv Hewson Claire Duncan Sean Dulake Joon Park Bae Noo-ri Seo-yeon Kim Sa-hee Ga-in Justin Chon Seth Ko Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Dramaworld premiered on April 17, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2011-09-05 Zig and Sharko 5.3    2009-10-04 Autumn's Concerto 7.8    2012-02-05 Glitter Force 6.3    2013-03-25 Max Steel 4.8  Facts Status  Returning Series Network Certification 12 Meaning This rating is for programs that may deemed inappropriate for those younger than 12, and parental discretion should be used. Usually used for animations that have stronger themes or violence then those designed for children, or for reality shows that have mild violence, themes, or language. Type  Scripted Original Language  English Runtime  20m Homepage   https://www.viki.com/tv/29149c-dramaworld Genres Drama Keywords romance Content Score 100 Yes! Looking good! Top Contributors j 20 jnylen 19 United600 Y 7 YJ 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}