{"link": "https://www.themoviedb.org/tv/2073?language=en", "title": "Mission Hill", "resume": "Mission Hill is an American animated television series that ran on The WB from September 24, 1999, to July 16, 2000, and on Adult Swim from July 14 to August 11, 2002. Although 18 episodes were planned, only 13 episodes were produced. The show was put on hiatus by the WB Network after two episodes due to poor ratings. It returned to the WB in the summer of 2000 but was canceled after four additional episodes. The show went on to develop a cult following, thanks to repeated airings of all 13 episodes on Teletoon's \"Teletoon Unleashed\" block, Cartoon Network's popular late night programing block, Adult Swim and Too Funny To Sleep, a late night programing block on TBS. Mission Hill was formerly known as The Downtowners, although MTV's production of the similarly titled Downtown forced a name change.\nIt has also been popular outside of the United States and Canada, receiving broadcasts in Australia, Eastern Europe, Latin America, Spain and New Zealand. Stylistically, the series is recognizable for its bright, neon color palette, and features a peculiar mixture of modern animation and traditional \"cartoonish\" drawings.", "rate": 73, "genre": ["Animation", "Comedy"], "cast": ["Brian Posehn", "Nick Jameson", "Wallace Langham", "Scott Menville", "Vicki Lewis"], "character": ["Jim Kuback (voice)", "Gus Duncz (voice)", "Andy French (voice)", "Kevin French (voice)", "Posey Tyler (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2073   Expand Mission Hill   (1999) User Score Overview Mission Hill is an American animated television series that ran on The WB from September 24, 1999, to July 16, 2000, and on Adult Swim from July 14 to August 11, 2002. Although 18 episodes were planned, only 13 episodes were produced. The show was put on hiatus by the WB Network after two episodes due to poor ratings. It returned to the WB in the summer of 2000 but was canceled after four additional episodes. The show went on to develop a cult following, thanks to repeated airings of all 13 episodes on Teletoon's \"Teletoon Unleashed\" block, Cartoon Network's popular late night programing block, Adult Swim and Too Funny To Sleep, a late night programing block on TBS. Mission Hill was formerly known as The Downtowners, although MTV's production of the similarly titled Downtown forced a name change. It has also been popular outside of the United States and Canada, receiving broadcasts in Australia, Eastern Europe, Latin America, Spain and New Zealand. Stylistically, the series is recognizable for its bright, neon color palette, and features a peculiar mixture of modern animation and traditional \"cartoonish\" drawings. Featured Crew Josh Weinstein Creator Bill Oakley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Posehn Jim Kuback (voice) Nick Jameson Gus Duncz (voice) Wallace Langham Andy French (voice) Scott Menville Kevin French (voice) Vicki Lewis Posey Tyler (voice) Full Cast & Crew Last Season Season 1 1999 | 13 Episodes Season 1 of Mission Hill premiered on September 24, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2004-08-01 Stroker and Hoop 7.0    2000-12-21 Sealab 2021 7.8    2001-04-01 Undergrads 6.3    2000-12-21 The Brak Show 7.0    2000-12-30 Harvey Birdman, Attorney at Law 7.7    1994-03-05 Duckman 8.1    1995-09-09 Freakazoid! 7.3    1968-01-22 Rowan & Martin's Laugh-In 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.msnhill.com/ Genres Animation Comedy Keywords roommate adult animation Content Score 93 Almost there... Top Contributors 17 Banana A 4 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}