{"link": "https://www.themoviedb.org/tv/6575?language=en", "title": "Muppets Tonight", "resume": "Muppets Tonight is a live-action/puppet television series created by Jim Henson Productions and featuring The Muppets. Much like the \"MuppeTelevision\" segment of The Jim Henson Hour, Muppets Tonight was a continuation of The Muppet Show, set in a television studio, rather than a theater. It ran on ABC from 1996 to 1998 and reruns ran on Disney Channel from 1997 to 2002. As of 2013, it is the last television series to star The Muppets characters.", "rate": 72, "genre": ["Comedy", "Family"], "cast": ["Jerry Nelson", "Steve Whitmire", "Drew Massey", "Frank Oz", "Dave Goelz"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6575   Expand Muppets Tonight   (1996) User Score Overview Muppets Tonight is a live-action/puppet television series created by Jim Henson Productions and featuring The Muppets. Much like the \"MuppeTelevision\" segment of The Jim Henson Hour, Muppets Tonight was a continuation of The Muppet Show, set in a television studio, rather than a theater. It ran on ABC from 1996 to 1998 and reruns ran on Disney Channel from 1997 to 2002. As of 2013, it is the last television series to star The Muppets characters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Nelson Steve Whitmire Drew Massey Frank Oz Dave Goelz Full Cast & Crew Last Season Season 2 1997 | 12 Episodes Season 2 of Muppets Tonight premiered on September 13, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1994-09-12 Party of Five 6.3    1976-09-18 The Muppet Show 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Family Keywords the muppets late night Content Score 86 Almost there... Top Contributors 3 joshzam 2 Razze t 2 tremas2009 D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}