{"link": "https://www.themoviedb.org/tv/57788?language=en", "title": "Hur Jun, The Original Story", "resume": "Drama depicts the dramatic life of historical figure Heo Joon, who wrote the oriental medical textbook \"Donguibogam\" and became physician for King Seonjo.", "rate": 50, "genre": ["Drama"], "cast": ["Park Jin-Hee", "Park Eun Bin", "Joo Ah-sung", "Kim Joo-hyuk", "Namgoong Min"], "character": ["Ye-Jin", "Da-Hee", "Goo Tae-hoon", "Hur Jun", "Yoo Do-Ji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57788   Expand Hur Jun, The Original Story   (2013) User Score Overview Drama depicts the dramatic life of historical figure Heo Joon, who wrote the oriental medical textbook \"Donguibogam\" and became physician for King Seonjo. Featured Crew Kim Keun-Hong Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Park Jin-Hee Ye-Jin Park Eun Bin Da-Hee Joo Ah-sung Goo Tae-hoon Kim Joo-hyuk Hur Jun Namgoong Min Yoo Do-Ji Full Cast & Crew Last Season Season 1 2013 | 135 Episodes Season 1 of Hur Jun, The Original Story premiered on March 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hur Jun, The Original Story. You can help by rating TV shows you've seen. Facts Original Name  구암 허준 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.imbc.com/broad/tv/drama/guam/ Genres Drama Keywords medicine historical joseon dynasty Content Score 100 Yes! Looking good! Top Contributors 23 animerika t 8 tmdb983464 TB 3 TMDb Bot t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}