{"link": "https://www.themoviedb.org/tv/1400?language=en", "title": "Seinfeld", "resume": "Seinfeld is an American television sitcom that originally aired on NBC from July 5, 1989, to May 14, 1998. It lasted nine seasons, and is now in syndication. It was created by Larry David and Jerry Seinfeld, the latter starring as a fictionalized version of himself. Set predominantly in an apartment block in Manhattan's Upper West Side in New York City, the show features a handful of Jerry's friends and acquaintances, particularly best friend George Costanza, former girlfriend Elaine Benes, and neighbor across the hall Cosmo Kramer.", "rate": 83, "genre": ["Comedy"], "cast": ["Jerry Seinfeld", "Jason Alexander", "Michael Richards", "Julia Louis-Dreyfus"], "character": ["Jerry Seinfeld", "George Costanza", "Cosmo Kramer", "Elaine Benes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1400   Expand Seinfeld   (1989) User Score  Play Trailer Overview Seinfeld is an American television sitcom that originally aired on NBC from July 5, 1989, to May 14, 1998. It lasted nine seasons, and is now in syndication. It was created by Larry David and Jerry Seinfeld, the latter starring as a fictionalized version of himself. Set predominantly in an apartment block in Manhattan's Upper West Side in New York City, the show features a handful of Jerry's friends and acquaintances, particularly best friend George Costanza, former girlfriend Elaine Benes, and neighbor across the hall Cosmo Kramer. Featured Crew Jerry Seinfeld Creator Larry David Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  23 Content Issues  5 Images Backdrops  22 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Seinfeld Jerry Seinfeld Jason Alexander George Costanza Michael Richards Cosmo Kramer Julia Louis-Dreyfus Elaine Benes Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 9 1997 | 24 Episodes View All Seasons Social Reviews  1 Discussions  28 t A review by tmdb81799156  10.0 Written by  tmdb81799156  on July 28, 2017 This series was absolutely hilarious.  I have to admit, I missed out when it first started and happened to catch it with my brother one day.  I believe we had seen Jerry on TV once or twice (this was way back when a lot of people didn't have cable TV) and this series became the funniest thing on TV.  I watched it whenever I could but that wasn't enough. Finally, quite a few years later, I bought the DVD set and watched everything in order, plus I watched all of the extras.  It is awesome.   This is one of first series that I know of where you really needed to watch every episode in sequence to...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  22 Posters  12 Recommendations   2000-10-15 Curb Your Enthusiasm 8.1    1993-09-16 Frasier 7.7    2003-11-02 Arrested Development 8.2    1996-09-13 Everybody Loves Raymond 6.3    1998-08-23 That '70s Show 7.4    1987-04-05 Married... with Children 7.4    1982-09-30 Cheers 7.5    2005-03-24 The Office 8.0  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.sonypictures.com/tv/shows/seinfeld/ Genres Comedy Keywords stand-up comedy observational comedy new york city manhattan, new york city sitcom Content Score 100 Yes! Looking good! Top Contributors 48 Banana 39 Bendik t 19 thermo6 AK 14 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}