{"link": "https://www.themoviedb.org/tv/71820?language=en", "title": "Starting From Now", "resume": "\"Starting From Now\" is a lesbian web series that explores the lives of four inner-Sydney women as they struggle to work out who they are, find a place where they belong, and maybe even find someone to love along the way. \nAfter building an international viral following across the first three seasons and reaching 20 million views in less than two years on YouTube, seasons 4 and 5 were acquired for broadcast television and screened on SBS2 in March, 2016.", "rate": 63, "genre": ["Drama"], "cast": ["Sarah de Possesse", "Rosie Lourde", "Lauren Orrell", "Bianca Bradey"], "character": ["Stephanie \"Steph\" Fraser", "Darcy \"Darc\" Peters", "Kristen Sheriden", "Emily \"Em\" Rochford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71820   Expand Starting From Now   (2014) User Score  Play Trailer Overview \"Starting From Now\" is a lesbian web series that explores the lives of four inner-Sydney women as they struggle to work out who they are, find a place where they belong, and maybe even find someone to love along the way.  After building an international viral following across the first three seasons and reaching 20 million views in less than two years on YouTube, seasons 4 and 5 were acquired for broadcast television and screened on SBS2 in March, 2016. Featured Crew Julie Kalceff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  2 Teasers  1 Clips  5 Featurettes  2 Opening Credits  0 Top Billed Cast Sarah de Possesse Stephanie \"Steph\" Fraser Rosie Lourde Darcy \"Darc\" Peters Lauren Orrell Kristen Sheriden Bianca Bradey Emily \"Em\" Rochford Full Cast & Crew Last Season Season 5 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Starting From Now. Login to be first! Go to Discussions Media Most Popular Videos  10 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Starting From Now. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.startingfromnowtv.com Genres Drama Keywords friendship lgbt Content Score 100 Yes! Looking good! Top Contributors 181 janar TB 12 TMDb Bot 2 thelword 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}