{"link": "https://www.themoviedb.org/tv/76409?language=en", "title": "Kakegurui: Compulsive Gambler", "resume": "Children from influential families in politics and businesses attend the Hyakkaou Private Academy. There, the hierarchy of the students are classified by a series of games. Students that win the games are on the ruling side and the students who lose become slaves. One day, a mysterious girl, Yumeko Jabami (Minami Hamabe), is transferred to Hyakkaou Private Academy. She looks pure and pretty, but she is actually a compulsive gambler and seeks out the thrill of taking calculated risks.", "rate": 85, "genre": ["Drama", "Mystery"], "cast": ["Minami Hamabe", "Mahiro Takasugi", "Aoi Morikawa", "Taishi Nakagawa", "Yurika Nakamura"], "character": ["Yumeko Jabami", "Ryota Suzui", "Meari Saotome", "Kaede Manyuda", "Sayaka Igarashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76409   Expand Kakegurui: Compulsive Gambler   (2018) User Score  Play Trailer Overview Children from influential families in politics and businesses attend the Hyakkaou Private Academy. There, the hierarchy of the students are classified by a series of games. Students that win the games are on the ruling side and the students who lose become slaves. One day, a mysterious girl, Yumeko Jabami (Minami Hamabe), is transferred to Hyakkaou Private Academy. She looks pure and pretty, but she is actually a compulsive gambler and seeks out the thrill of taking calculated risks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minami Hamabe Yumeko Jabami Mahiro Takasugi Ryota Suzui Aoi Morikawa Meari Saotome Taishi Nakagawa Kaede Manyuda Yurika Nakamura Sayaka Igarashi Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Kakegurui: Compulsive Gambler premiered on January 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kakegurui: Compulsive Gambler. You can help by rating TV shows you've seen. Facts Original Name  賭ケグルイ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.mbs.jp/kakegurui-drama/ Genres Drama Mystery Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 24 agungtsp 18 Sergiojamon 6 thirstyhippo 3 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}