{"link": "https://www.themoviedb.org/tv/3452?language=en", "title": "Frasier", "resume": "After many years spent at the “Cheers” bar, Frasier moves back home to Seattle to work as a radio psychiatrist after his policeman father gets shot in the hip on duty.", "rate": 77, "genre": ["Comedy"], "cast": ["Kelsey Grammer", "David Hyde Pierce", "Jane Leeves", "Peri Gilpin", "John Mahoney"], "character": ["Frasier Crane", "Niles Crane", "Daphne Moon", "Roz Doyle", "Martin Crane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3452   Expand Frasier   (1993) User Score  Play Trailer Overview After many years spent at the “Cheers” bar, Frasier moves back home to Seattle to work as a radio psychiatrist after his policeman father gets shot in the hip on duty. Featured Crew Peter Casey Creator David Angell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  12 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelsey Grammer Frasier Crane David Hyde Pierce Niles Crane Jane Leeves Daphne Moon Peri Gilpin Roz Doyle John Mahoney Martin Crane Full Cast & Crew Last Season Season 11 2003 | 24 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Dr. Frasier Crane: Happy Birthday Kelsey Grammer! Open 0 by wonder2wonder\n      \n     RIP John Mahoney Open 1 by  FormerlyKnownAs Top ten episodes Open 6 by  SeinfeldFriend Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  5 Recommendations   1982-09-30 Cheers 7.5    1996-09-13 Everybody Loves Raymond 6.3    1998-09-21 Will & Grace 6.5    1996-01-09 3rd Rock from the Sun 7.3    1989-07-05 Seinfeld 8.2    1990-09-10 The Fresh Prince of Bel-Air 7.3    1997-09-08 Ally McBeal 5.9    1998-08-23 That '70s Show 7.4  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords sibling relationship radio presenter seattle radio psychiatrist dog family widower apartment hometown psychiatry radio host sitcom living with parents father son relationship Content Score 100 Yes! Looking good! Top Contributors 99 lineker 20 rudely_murray 13 niqo19 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}