{"link": "https://www.themoviedb.org/tv/45665?language=en", "title": "The Amazing Race Australia", "resume": "The Amazing Race Australia is an Australian reality game show based on the American TV series, The Amazing Race.\nOn 19 July 2010, Seven Network has purchased the format rights to produce the Australian series. The show is produced by activeTV in assosiation with ABC Studios. It is distributed by Disney Media Distribution Asia Pacific. The host for the show is New Zealander-born actor Grant Bowler.\nIt is the third Asia-Pacific version of the franchise after The Amazing Race Asia and The Amazing Race: China Rush; thus it is the first Oceanian franchise.\nThe grand prize for the winning team is. A$250,000.", "rate": 90, "genre": [], "cast": ["Grant Bowler"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45665   Expand The Amazing Race Australia   (2011) User Score Overview The Amazing Race Australia is an Australian reality game show based on the American TV series, The Amazing Race. On 19 July 2010, Seven Network has purchased the format rights to produce the Australian series. The show is produced by activeTV in assosiation with ABC Studios. It is distributed by Disney Media Distribution Asia Pacific. The host for the show is New Zealander-born actor Grant Bowler. It is the third Asia-Pacific version of the franchise after The Amazing Race Asia and The Amazing Race: China Rush; thus it is the first Oceanian franchise. The grand prize for the winning team is. A$250,000. Featured Crew Elise Doganieri Creator Bertram van Munster Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Grant Bowler Full Cast & Crew Last Season Season 2 2012 | 12 Episodes Season 2 of The Amazing Race Australia premiered on May 30, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Amazing Race Australia. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://au.tv.yahoo.com/the-amazing-race-australia/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}