{"link": "https://www.themoviedb.org/tv/4885?language=en", "title": "The Lyon's Den", "resume": "The Lyon's Den is a 2003 television series set in Washington, D.C. The legal drama starred Rob Lowe as a lawyer called Jack Turner, newly appointed as partner of a long-established law firm that, as the plot revealed, harbored some dark secrets. Much of the plot centred around the firm's internal politics, and on Turner's attempts to uncover information on some of the firm's conspiracies, all the while acting as the defense for some of the firm's higher-profile clients in a different case each episode.\nSpearheaded by Lowe, who was also executive producer, the cast included Matt Craven, Elizabeth Mitchell, Kyle Chandler, Frances Fisher, and David Krumholtz.\nThe series premiered on the American television network NBC on September 28, 2003, but although thirteen episodes were ordered and produced, only six aired before NBC cancelled the show due to poor ratings. When five bought the UK terrestrial TV rights to the series in 2004, it aired all thirteen episodes.", "rate": 0, "genre": ["Drama"], "cast": ["Rob Lowe", "Kyle Chandler", "Matt Craven", "Elizabeth Mitchell", "David Krumholtz"], "character": ["John 'Jack' Turner", "Grant Rashton", "Ariel Saxon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4885   Expand The Lyon's Den   (2003) User Score Overview The Lyon's Den is a 2003 television series set in Washington, D.C. The legal drama starred Rob Lowe as a lawyer called Jack Turner, newly appointed as partner of a long-established law firm that, as the plot revealed, harbored some dark secrets. Much of the plot centred around the firm's internal politics, and on Turner's attempts to uncover information on some of the firm's conspiracies, all the while acting as the defense for some of the firm's higher-profile clients in a different case each episode. Spearheaded by Lowe, who was also executive producer, the cast included Matt Craven, Elizabeth Mitchell, Kyle Chandler, Frances Fisher, and David Krumholtz. The series premiered on the American television network NBC on September 28, 2003, but although thirteen episodes were ordered and produced, only six aired before NBC cancelled the show due to poor ratings. When five bought the UK terrestrial TV rights to the series in 2004, it aired all thirteen episodes. Featured Crew Remi Aubuchon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Lowe John 'Jack' Turner Kyle Chandler Grant Rashton Matt Craven Elizabeth Mitchell Ariel Saxon David Krumholtz Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of The Lyon's Den premiered on September 28, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Lyon's Den. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords washington d.c. lawyer law firm Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana j 1 joero290 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}