{"link": "https://www.themoviedb.org/tv/62131?language=en", "title": "Zombieland", "resume": "Zombieland follows four survivors outwitting zombies and searching for a place to call home.", "rate": 56, "genre": ["Comedy"], "cast": ["Kirk Ward", "Maiara Walsh", "Tyler Ross", "Izabela Vidovic"], "character": ["Tallahassee", "Wichita", "Columbus", "Little Rock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62131   Expand Zombieland   (2013) User Score Overview Zombieland follows four survivors outwitting zombies and searching for a place to call home. Featured Crew Rhett Reese Creator Paul Wernick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirk Ward Tallahassee Maiara Walsh Wichita Tyler Ross Columbus Izabela Vidovic Little Rock Full Cast & Crew Last Season Season 1 2013 | 1 Episode Season 1 of Zombieland premiered on April 19, 2013. View All Seasons Social Reviews  1 Discussions  0 A review by OzDrDj Written by  OzDrDj  on June 14, 2017 Zombieland, A Great movie, and the idea for a great TV Show, however the Cast just didn't Gel, like the original cast of the movie. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1998-11-10 Frank Lloyd Wright 6.3    2008-12-08 Childrens Hospital 7.0    2013-09-26 The Michael J. Fox Show 5.6    1976-11-14 Sybil 7.3    2011-09-21 Fresh Meat 7.2    2005-07-21 Extras 7.8    2011-11-10 Life's Too Short 7.1    2008-05-01 The Inbetweeners 7.7  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.amazon.com/Pilot-HD/dp/B00CE18P0K Genres Comedy Keywords zombie failed tv pilot based on movie Content Score 93 Almost there... Top Contributors a 24 alicea N 23 NoemiTalavera 22 lineker 17 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}