{"link": "https://www.themoviedb.org/tv/66202?language=en", "title": "Almost There", "resume": "Jackson Cooper is a handsome, eternally single psychiatrist living in New York City. Serial dating and workaholic behavior have successfully helped him avoid long-term commitments, until he meets the girl of his dreams. Unfortunately he fails to get her name, number or any other information...", "rate": 5, "genre": ["Comedy"], "cast": ["Steven Pasquale", "Christopher Fitzgerald", "Maddie Corman", "Susan Kelechi Watson", "Trieste Kelly Dunn"], "character": ["Jackson Cooper", "Carter", "Sophie", "Diane", "Natalie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66202   Expand Almost There   (2016) User Score  Play Trailer Overview Jackson Cooper is a handsome, eternally single psychiatrist living in New York City. Serial dating and workaholic behavior have successfully helped him avoid long-term commitments, until he meets the girl of his dreams. Unfortunately he fails to get her name, number or any other information... Featured Crew Kim Cella Creator Debbie Baldwin Creator Jace Alexander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Pasquale Jackson Cooper Christopher Fitzgerald Carter Maddie Corman Sophie Susan Kelechi Watson Diane Trieste Kelly Dunn Natalie Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Almost There premiered on March 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Almost There. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords soulmates search blind date teacher love neighbor psychiatrist Content Score 100 Yes! Looking good! Top Contributors t 61 tmdb84253387 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}