{"link": "https://www.themoviedb.org/tv/3527?language=en", "title": "My Friends Tigger & Pooh", "resume": "My Friends Tigger & Pooh is a American computer-animated television series inspired by Winnie-the-Pooh by A. A. Milne. The television series features Winnie-the-Pooh and his friends, including two new characters: a brave 6-year-old red-headed girl named Darby and her dog Buster. Although Darby appears to be the main human friend of Pooh and the gang and the leader of the Super Sleuths, Christopher Robin still appears sporadically.\nDeveloped by Walt Disney Television Animation, the show premiered on Disney Channel's Playhouse Disney block on May 12, 2007. The show's theme song was written by Jellyfish lead singer Andy Sturmer and is performed by former Letters to Cleo singer Kay Hanley. In Season 2, Chloë Grace Moretz as Darby performed the theme. Also, beginning with this series Travis Oates assumed the role of Piglet, taking over for John Fiedler, who had died in 2005, two years prior to the debut of the series.\nOn July 4, 2010, My Friends Tigger & Pooh has been removed from the Playhouse Disney lineup, while it returned in October with new episodes.", "rate": 0, "genre": ["Kids", "Animation"], "cast": ["Chloë Grace Moretz", "Dee Bradley Baker", "Jim Cummings", "Jim Cummings", "Travis Oates"], "character": ["Tessa", "Buster", "Winnie de Poeh", "Teigetje", "Knorretje"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3527   Expand My Friends Tigger & Pooh   (2007) User Score Overview My Friends Tigger & Pooh is a American computer-animated television series inspired by Winnie-the-Pooh by A. A. Milne. The television series features Winnie-the-Pooh and his friends, including two new characters: a brave 6-year-old red-headed girl named Darby and her dog Buster. Although Darby appears to be the main human friend of Pooh and the gang and the leader of the Super Sleuths, Christopher Robin still appears sporadically. Developed by Walt Disney Television Animation, the show premiered on Disney Channel's Playhouse Disney block on May 12, 2007. The show's theme song was written by Jellyfish lead singer Andy Sturmer and is performed by former Letters to Cleo singer Kay Hanley. In Season 2, Chloë Grace Moretz as Darby performed the theme. Also, beginning with this series Travis Oates assumed the role of Piglet, taking over for John Fiedler, who had died in 2005, two years prior to the debut of the series. On July 4, 2010, My Friends Tigger & Pooh has been removed from the Playhouse Disney lineup, while it returned in October with new episodes. Featured Crew A. A. Milne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chloë Grace Moretz Tessa Dee Bradley Baker Buster Jim Cummings Winnie de Poeh Jim Cummings Teigetje Travis Oates Knorretje Full Cast & Crew Last Season Season 1 2007 | 25 Episodes Season 1 of My Friends Tigger & Pooh premiered on May 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Friends Tigger & Pooh. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification AL Meaning Not harmful / All Ages. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Kids Animation Keywords winnie the pooh Content Score 100 Yes! Looking good! Top Contributors 25 Banana S 24 Sander c 5 chloris77 x 5 xristos33  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}