{"link": "https://www.themoviedb.org/tv/13406?language=en", "title": "Gunpowder, Treason & Plot", "resume": "Mini series depicting the turbulent and bloody reigns of Scottish monarchs Mary, Queen of Scots and her son King James VI of Scotland who became King James I of England and foiled the Gunpowder Plot.", "rate": 53, "genre": ["Drama", "War", "Politics"], "cast": ["Robert Carlyle", "Catherine McCormack", "Richard Coyle", "Paul Nicholls", "Gary Lewis"], "character": ["King James I", "Elizabeth I of England", "Catesby", "Lord Darnley", "John Knox"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13406   Expand Gunpowder, Treason & Plot   (2004) User Score Overview Mini series depicting the turbulent and bloody reigns of Scottish monarchs Mary, Queen of Scots and her son King James VI of Scotland who became King James I of England and foiled the Gunpowder Plot. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Carlyle King James I Catherine McCormack Elizabeth I of England Richard Coyle Catesby Paul Nicholls Lord Darnley Gary Lewis John Knox Full Cast & Crew Last Season Miniseries 2004 | 2 Episodes Season 1 of Gunpowder, Treason & Plot premiered on March 21, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   2005-09-17 Mysterious Island 5.0  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  100m Homepage  - Genres Drama War & Politics Keywords england scotland royal family miniseries mary queen of scots king execution gunpowder plot historical drama 17th century Content Score 86 Almost there... Top Contributors TB 43 TMDb Bot 36 Banana R 9 Rebecca 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}