{"link": "https://www.themoviedb.org/tv/42823?language=en", "title": "Sonic Soldier Borgman", "resume": "Sonic Soldier Borgman is a science fiction anime. It features a Super Sentai-like three member team that fight an organization known as Youma. Featuring three main characters: Chuck, Ryo and Anise. Ryo is the leader, while Chuck and Anise are teachers at a public school. Sometimes, the students help or make troubles to the Borgman somehow, some even know the Borgman secret identities. Ryo has a talking \"modern\" blue motorcycle that can upgrade itself. The transformation code is \"Borg. Get On\". Each member has a personal cannon that matches his/her armor color that appears only to finish the monster they fight.", "rate": 0, "genre": ["Action", "Adventure", "Animation"], "cast": ["Kumiko Watanabe", "Yasunori Matsumoto", "Kazuhiko Inoue", "Naoko Matsui", "Shinya Ōtaki"], "character": ["Tooru", "Ryou", "Chuck", "Katsura Miki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42823   Expand Sonic Soldier Borgman   (1988) User Score Overview Sonic Soldier Borgman is a science fiction anime. It features a Super Sentai-like three member team that fight an organization known as Youma. Featuring three main characters: Chuck, Ryo and Anise. Ryo is the leader, while Chuck and Anise are teachers at a public school. Sometimes, the students help or make troubles to the Borgman somehow, some even know the Borgman secret identities. Ryo has a talking \"modern\" blue motorcycle that can upgrade itself. The transformation code is \"Borg. Get On\". Each member has a personal cannon that matches his/her armor color that appears only to finish the monster they fight. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kumiko Watanabe Tooru Yasunori Matsumoto Ryou Kazuhiko Inoue Chuck Naoko Matsui Katsura Miki Shinya Ōtaki Full Cast & Crew Last Season Season 1 1988 | 33 Episodes Season 1 of Sonic Soldier Borgman premiered on April 13, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sonic Soldier Borgman. You can help by rating TV shows you've seen. Facts Original Name  超音戦士ボーグマン Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}