{"link": "https://www.themoviedb.org/tv/1422?language=en", "title": "The Middle", "resume": "The daily mishaps of a married woman and her semi-dysfunctional family and their attempts to survive life in general in the city of Orson, Indiana.", "rate": 66, "genre": ["Comedy"], "cast": ["Patricia Heaton", "Neil Flynn", "Charlie McDermott", "Eden Sher", "Atticus Shaffer"], "character": ["Frankie Heck", "Mike Heck", "Axl Heck", "Sue Heck", "Brick Heck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1422   Expand The Middle   (2009) User Score  Play Trailer Overview The daily mishaps of a married woman and her semi-dysfunctional family and their attempts to survive life in general in the city of Orson, Indiana. Featured Crew Eileen Heisler Creator DeAnn Heline Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  14 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patricia Heaton Frankie Heck Neil Flynn Mike Heck Charlie McDermott Axl Heck Eden Sher Sue Heck Atticus Shaffer Brick Heck Full Cast & Crew Last Season Season 9 2017 | 24 Episodes Season 9 of The Middle premiered on October  3, 2017. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply r Goodbye Hecks Open 1 by  lima-2 w Mike Heck: Happy Birthday Neil Flynn! Open 0 by wonder2wonder\n      \n     T Season 9 to be the Final Season Open 0 by TheBayHarborButcher\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  10 Recommendations   2013-09-24 The Goldbergs 7.6    2003-09-22 Two and a Half Men 6.2    2010-09-06 Mike & Molly 5.6    2000-01-09 Malcolm in the Middle 7.5    2009-09-23 Modern Family 7.3    2006-12-02 The Suite Life of Zack & Cody 5.3    2010-06-16 Hot in Cleveland 6.8    2005-09-20 My Name Is Earl 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.abc.go.com/shows/the-middle Genres Comedy Keywords indiana middle class dysfunctional family family middle america sitcom Content Score 100 Yes! Looking good! Top Contributors 49 Elizabeth Jennings 22 niqo19 M 13 Maisel m 11 magoma  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}