{"link": "https://www.themoviedb.org/tv/11372?language=en", "title": "Journey to the Unknown", "resume": "Journey To The Unknown is a British TV anthology series made in 1968, by Hammer Film Productions Ltd. It has a fantasy, science fiction and supernatural theme. It featured both British and American actors. American actors included George Maharis, Vera Miles, Barbara Bel Geddes, Patty Duke, Carol Lynley, Joseph Cotten, Stefanie Powers, and Brandon deWilde, along with familiar British actors such as Dennis Waterman, Jane Asher, Nanette Newman, Ann Bell and Tom Adams. Seventeen episodes in all were made.\nEight episodes were twinned to make four feature length films with added linking material. The New People and Paper Dolls became Journey into Darkness, hosted by Patrick McGoohan, Poor Butterfly and The Indian Spirit Guide became Journey to Midnight, hosted by Sebastian Cabot, Matakitas Is Coming and The Last Visitor became Journey to the Unknown, hosted by Joan Crawford and Do Me a Favour, Kill Me and The Killing Bottle became Journey to Murder, also hosted by Crawford.\nThe series had a memorably famous whistled theme tune by Hammer's Harry Robinson and title sequence involving a deserted and apparently haunted Battersea fairground.", "rate": 0, "genre": ["Drama"], "cast": ["Chad Everett", "Stefanie Powers"], "character": ["Jane Brown / Jane Glenville"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11372   Expand Journey to the Unknown   (1968) User Score Overview Journey To The Unknown is a British TV anthology series made in 1968, by Hammer Film Productions Ltd. It has a fantasy, science fiction and supernatural theme. It featured both British and American actors. American actors included George Maharis, Vera Miles, Barbara Bel Geddes, Patty Duke, Carol Lynley, Joseph Cotten, Stefanie Powers, and Brandon deWilde, along with familiar British actors such as Dennis Waterman, Jane Asher, Nanette Newman, Ann Bell and Tom Adams. Seventeen episodes in all were made. Eight episodes were twinned to make four feature length films with added linking material. The New People and Paper Dolls became Journey into Darkness, hosted by Patrick McGoohan, Poor Butterfly and The Indian Spirit Guide became Journey to Midnight, hosted by Sebastian Cabot, Matakitas Is Coming and The Last Visitor became Journey to the Unknown, hosted by Joan Crawford and Do Me a Favour, Kill Me and The Killing Bottle became Journey to Murder, also hosted by Crawford. The series had a memorably famous whistled theme tune by Hammer's Harry Robinson and title sequence involving a deserted and apparently haunted Battersea fairground. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chad Everett Stefanie Powers Jane Brown / Jane Glenville Full Cast & Crew Last Season Season 1 1968 | 17 Episodes Season 1 of Journey to the Unknown premiered on September 26, 1968. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Journey to the Unknown. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}