{"link": "https://www.themoviedb.org/tv/18359?language=en", "title": "The Bridge", "resume": "The Bridge was a Canadian police drama commissioned by CTV and CBS starring Aaron Douglas. The name of the series is derived from the bridge which connects the wealthy Rosedale neighborhood of Toronto with one of its poorest, St. James Town.\nThe initial order is for 11 episodes, produced by Entertainment One. After CTV ordered the pilot to series in November 2008, CTV later shared the pilot with CBS. This series premiered on CTV on March 5, 2010 and premiered on July 10, 2010 on CBS. It has been canceled in the US after three episodes due to low ratings. CTV announced on June 3, 2010 that the series will return for a second season during the 2010–2011 season. However, on January 13, 2011, star Aaron Douglas tweeted that the series has been officially canceled after only one season.", "rate": 77, "genre": ["Drama", "Action", "Adventure"], "cast": ["Aaron Douglas", "Ona Grauer", "Paul Popowich", "Michael Murphy", "Frank Cassini"], "character": ["Frank Leo", "Abby St. James", "Tommy Dunn", "Ed Wycoff", "Bernie Kantor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18359   Expand The Bridge   (2010) User Score Overview The Bridge was a Canadian police drama commissioned by CTV and CBS starring Aaron Douglas. The name of the series is derived from the bridge which connects the wealthy Rosedale neighborhood of Toronto with one of its poorest, St. James Town. The initial order is for 11 episodes, produced by Entertainment One. After CTV ordered the pilot to series in November 2008, CTV later shared the pilot with CBS. This series premiered on CTV on March 5, 2010 and premiered on July 10, 2010 on CBS. It has been canceled in the US after three episodes due to low ratings. CTV announced on June 3, 2010 that the series will return for a second season during the 2010–2011 season. However, on January 13, 2011, star Aaron Douglas tweeted that the series has been officially canceled after only one season. Featured Crew Alan Di Fiore Creator Robert Wertheimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aaron Douglas Frank Leo Ona Grauer Abby St. James Paul Popowich Tommy Dunn Michael Murphy Ed Wycoff Frank Cassini Bernie Kantor Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of The Bridge premiered on March  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Bridge. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  60m, 40m Homepage   http://shows.ctv.ca/TheBridge.aspx Genres Drama Action & Adventure Keywords canada corruption toronto cop drama Content Score 93 Almost there... Top Contributors 25 Banana R 16 Rebecca TB 4 TMDb Bot w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}