{"link": "https://www.themoviedb.org/tv/61822?language=en", "title": "Mindfuck", "resume": "Mindf * ck does away with the classic image of magic glitter curtains and sawn assistants. The viewer gets an insight into underlying psychological principles such as non-verbal communication, deception and influencing the subconscious. Are we in control of our own choices and can we really trust our perception?", "rate": 90, "genre": ["Mystery"], "cast": ["Victor Mids"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61822   Expand Mindfuck   (2015) User Score Overview Mindf * ck does away with the classic image of magic glitter curtains and sawn assistants. The viewer gets an insight into underlying psychological principles such as non-verbal communication, deception and influencing the subconscious. Are we in control of our own choices and can we really trust our perception? Featured Crew Victor Mids Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victor Mids Full Cast & Crew Last Season Season 2 2016 | 6 Episodes Season 2 of Mindfuck premiered on January 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mindfuck. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  Dutch; Flemish Runtime  29m Homepage   http://www.avrotros.nl/magic/mindfck/home Genres Mystery Keywords magic show Content Score 64 We're so close, yet so far. Top Contributors 18 mariixxx F 15 FCornelder 6 Elizabeth Jennings 2 davidwho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}