{"link": "https://www.themoviedb.org/tv/16401?language=en", "title": "Custer", "resume": "Custer, also known as The Legend of Custer, is a 17-episode military-western television series which ran on ABC from September 6 to December 27, 1967, with Wayne Maunder in the starring role of then Lieutenant Colonel George Armstrong Custer. During the American Civil War, Custer had risen to the rank of major general, the youngest in the Union Army. He was demoted after the war during force reductions to the rank of Captain, but was reinstated in 1866 as a Lieutenant Colonel in command of the Seventh Cavalry, stationed at Fort Riley, Kansas. Many of the soldiers in the regiment were derelicts, former Confederates, or even criminals. The series was cancelled before the script timeline would have reached the Little Big Horn River of southeastern Montana, where all perished on June 25, 1876, in a Sioux Indian ambush,\nRobert F. Simon played Custer's commanding officer, U.S. General Alfred H. Terry, who disapproved of Custer's long hair and much of his methodology of fighting Indians. Slim Pickens starred as a scout named California Joe Milner. Michael Dante appeared as Sioux Chief Crazy Horse. Peter Palmer played Sergeant James Bustard, a former Confederate soldier. Grant Woods appeared as Captain Myles Keogh. Read Morgan, formerly a cavalry officer on NBC's The Deputy, appeared in the episode \"Spirit Woman\" in the role of a medicine man.", "rate": 70, "genre": ["Western", "Drama"], "cast": ["Wayne Maunder", "Peter Palmer", "Michael Dante", "Slim Pickens", "Robert F. Simon"], "character": ["George Armstrong Custer", "Crazy Horse", "Alfred H. Terry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16401   Expand Custer   (1967) User Score Overview Custer, also known as The Legend of Custer, is a 17-episode military-western television series which ran on ABC from September 6 to December 27, 1967, with Wayne Maunder in the starring role of then Lieutenant Colonel George Armstrong Custer. During the American Civil War, Custer had risen to the rank of major general, the youngest in the Union Army. He was demoted after the war during force reductions to the rank of Captain, but was reinstated in 1866 as a Lieutenant Colonel in command of the Seventh Cavalry, stationed at Fort Riley, Kansas. Many of the soldiers in the regiment were derelicts, former Confederates, or even criminals. The series was cancelled before the script timeline would have reached the Little Big Horn River of southeastern Montana, where all perished on June 25, 1876, in a Sioux Indian ambush, Robert F. Simon played Custer's commanding officer, U.S. General Alfred H. Terry, who disapproved of Custer's long hair and much of his methodology of fighting Indians. Slim Pickens starred as a scout named California Joe Milner. Michael Dante appeared as Sioux Chief Crazy Horse. Peter Palmer played Sergeant James Bustard, a former Confederate soldier. Grant Woods appeared as Captain Myles Keogh. Read Morgan, formerly a cavalry officer on NBC's The Deputy, appeared in the episode \"Spirit Woman\" in the role of a medicine man. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wayne Maunder George Armstrong Custer Peter Palmer Michael Dante Crazy Horse Slim Pickens Robert F. Simon Alfred H. Terry Full Cast & Crew Last Season Season 1 1967 | 16 Episodes Season 1 of Custer premiered on September  6, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Custer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}