{"link": "https://www.themoviedb.org/tv/1398?language=en", "title": "The Sopranos", "resume": "The story of New Jersey-based Italian-American mobster Tony Soprano and the difficulties he faces as he tries to balance the conflicting requirements of his home life and the criminal organization he heads. Those difficulties are often highlighted through his ongoing professional relationship with psychiatrist Jennifer Melfi. The show features Tony's family members and Mafia associates in prominent roles and story arcs, most notably his wife Carmela and his cousin and protégé Christopher Moltisanti.", "rate": 83, "genre": ["Drama"], "cast": ["James Gandolfini", "Lorraine Bracco", "Edie Falco", "Michael Imperioli", "Steven Van Zandt"], "character": ["Tony Soprano", "Jennifer Melfi", "Carmela Soprano", "Christopher Moltisanti", "Silvio Dante"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1398   Expand The Sopranos   (1999) User Score  Play Trailer Overview The story of New Jersey-based Italian-American mobster Tony Soprano and the difficulties he faces as he tries to balance the conflicting requirements of his home life and the criminal organization he heads. Those difficulties are often highlighted through his ongoing professional relationship with psychiatrist Jennifer Melfi. The show features Tony's family members and Mafia associates in prominent roles and story arcs, most notably his wife Carmela and his cousin and protégé Christopher Moltisanti. Featured Crew David Chase Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  19 Posters  22 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast James Gandolfini Tony Soprano Lorraine Bracco Jennifer Melfi Edie Falco Carmela Soprano Michael Imperioli Christopher Moltisanti Steven Van Zandt Silvio Dante Full Cast & Crew Last Season Season 6 2006 | 21 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply All the times Tony ate in the show Open 2 by  Beck47 Show seems very dated now to me Open 7 by  SassyBeach The Real Life Sopranos Crime Family of New Jersey - Mafia Documentary Open 0 by DRDMovieMusings\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  19 Posters  22 Recommendations   2002-06-02 The Wire 8.4    2010-09-19 Boardwalk Empire 7.7    1997-07-12 Oz 8.1    2004-03-21 Deadwood 8.1    2001-06-03 Six Feet Under 8.2    2006-10-01 Dexter 8.0    2002-03-12 The Shield 8.1    2005-08-28 Rome 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 50m Homepage   http://www.hbo.com/sopranos/ Genres Drama Keywords italian american dysfunctional family family relationships outlaw dysfunctional marriage mobster organized crime mafia violence psychiatrist family criminal organization Content Score 100 Yes! Looking good! Top Contributors 97 lineker 56 Elizabeth Jennings 16 Travis Bell 13 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}