{"link": "https://www.themoviedb.org/tv/66012?language=en", "title": "Top Gear Italia", "resume": "Top Gear Italia is an international version of the popular British BBC Two motoring show. This version of the show is presented by Guido Meda (an Italian commentator of the Moto GP), Joe Bastianich (an American restaurateur, previously a judge on MasterChef Italia) and Davide Valsecchi (an Italian racing driver and GP2 Series champion). It also features the Italian version of \"The Stig\".", "rate": 65, "genre": ["Comedy", "Documentary", "Talk"], "cast": ["Guido Meda", "Davide Valsecchi", "Joe Bastianich", "The Stig"], "character": ["Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66012   Expand Top Gear Italia   (2016) User Score  Play Trailer Overview Top Gear Italia is an international version of the popular British BBC Two motoring show. This version of the show is presented by Guido Meda (an Italian commentator of the Moto GP), Joe Bastianich (an American restaurateur, previously a judge on MasterChef Italia) and Davide Valsecchi (an Italian racing driver and GP2 Series champion). It also features the Italian version of \"The Stig\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guido Meda Himself Davide Valsecchi Himself Joe Bastianich Himself The Stig Himself Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Top Gear Italia premiered on March 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Top Gear Italia. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Italian Runtime  50m Homepage   http://skyuno.sky.it/skyuno/top-gear/top-gear.html Genres Comedy Documentary Talk Keywords motor sport racing testing car vehicles Content Score 93 Almost there... Top Contributors 25 Uli666 5 FeIix 4 Elizabeth Jennings s 2 stevenjhon847  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}