{"link": "https://www.themoviedb.org/tv/64432?language=en", "title": "The Magicians", "resume": "Brakebills University is a secret institution specializing in magic. There, amidst an unorthodox education of spellcasting, a group of twenty-something friends soon discover that a magical fantasy world they read about as children is all too real— and poses grave danger to humanity.", "rate": 68, "genre": ["Drama", "Fantasy", "Horror"], "cast": ["Jason Ralph", "Olivia Taylor Dudley", "Arjun Gupta", "Stella Maeve", "Jade Tailor"], "character": ["Quentin Coldwater", "Alice Quinn", "William \"Penny\" Adiyodi", "Julia Wicker", "Kady Orloff-Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64432   Expand The Magicians   (2015) User Score  Play Trailer Overview Brakebills University is a secret institution specializing in magic. There, amidst an unorthodox education of spellcasting, a group of twenty-something friends soon discover that a magical fantasy world they read about as children is all too real— and poses grave danger to humanity. Featured Crew Sera Gamble Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  2 Images Backdrops  23 Posters  22 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Ralph Quentin Coldwater Olivia Taylor Dudley Alice Quinn Arjun Gupta William \"Penny\" Adiyodi Stella Maeve Julia Wicker Jade Tailor Kady Orloff-Diaz Full Cast & Crew Current Season Season 3 2018 | 13 Episodes View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply Season 3 Opinion Open 13 by  Philippe LeMarchand All That Josh (Musical Episode) Open 0 by Philippe LeMarchand\n      \n     Video Interveiws With the Cast and Creative From San Diego Comic-Con Open 0 by garethmb\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  22 Recommendations   2016-01-05 The Shannara Chronicles 6.4    2015-06-19 Killjoys 6.7    2012-05-27 Continuum 7.1    2014-12-07 The Librarians 6.4    2016-01-12 Shadowhunters 6.3    2016-01-14 Colony 6.8    2013-09-16 Sleepy Hollow 6.4    2013-10-09 The Tomorrow People 6.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.syfy.com/themagicians Genres Drama Fantasy Horror Keywords new york based on novel or book magic college supernatural powers school supernatural ability the magicians us Content Score 100 Yes! Looking good! Top Contributors 73 Elizabeth Jennings 27 Medianoche R 21 Rebecca m 18 misfit_noel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}