{"link": "https://www.themoviedb.org/tv/72519?language=en", "title": "Altair: A Record of Battles", "resume": "Tughril Mahmut is a young pasha serving on the Divan of the Türkiye Stratocracy. The clouds of war are gathering over his country due to the threat of an aggressive Empire. With the Divan split between warmongers and the pacifists, Mahmut begins his quest to keep the peace at any cost. As he finds himself deeper and deeper in the politics of the ancient world, new enemies and allies surface. Who will prevail? What will Mahmut do if war proves to be inevitable?", "rate": 80, "genre": ["Animation", "Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72519   Expand Altair: A Record of Battles   (2017) User Score Overview Tughril Mahmut is a young pasha serving on the Divan of the Türkiye Stratocracy. The clouds of war are gathering over his country due to the threat of an aggressive Empire. With the Divan split between warmongers and the pacifists, Mahmut begins his quest to keep the peace at any cost. As he finds himself deeper and deeper in the politics of the ancient world, new enemies and allies surface. Who will prevail? What will Mahmut do if war proves to be inevitable? Featured Crew Katou Kotono Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of Altair: A Record of Battles premiered on July  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Altair: A Record of Battles. You can help by rating TV shows you've seen. Facts Original Name  将国のアルタイル Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://project-altair.com/ Genres Animation Action & Adventure Drama Sci-Fi & Fantasy Keywords mythology history Content Score 71 Just a little bit more... Top Contributors 12 enkpowerranger 10 sp1ti 8 Zorro1 f 7 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}