{"link": "https://www.themoviedb.org/tv/2568?language=en", "title": "The Oblongs", "resume": "The Oblongs is an American animated television series aimed at teenagers and adults. It is loosely based on a series of characters introduced in creator Angus Oblong's picture book entitled Creepy Susie and 13 Other Tragic Tales for Troubled Children. The TV series was produced by Jobsite Productions and Mohawk Productions in association with Warner Bros. Television, and the theme song for the show was composed and performed by They Might Be Giants.\nThe Oblongs aired on The WB from April 1, 2001 until May 20, 2001 and then aired on Adult Swim from August 25, 2002 to October 20, 2002, with a total of thirteen episodes. There has been mention of a potential series revival with new episodes on Adult Swim, however, no other information has been announced. All thirteen episodes of The Oblongs were released on DVD on October 4, 2005.", "rate": 71, "genre": ["Animation", "Comedy"], "cast": ["Jean Smart", "Will Ferrell", "Pamela Adlon", "Lea DeLaria", "Jeannie Elias"], "character": ["Pickles Oblong", "Bob Oblong", "Milo Oblong", "Beth Oblong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2568   Expand The Oblongs   (2001) User Score Overview The Oblongs is an American animated television series aimed at teenagers and adults. It is loosely based on a series of characters introduced in creator Angus Oblong's picture book entitled Creepy Susie and 13 Other Tragic Tales for Troubled Children. The TV series was produced by Jobsite Productions and Mohawk Productions in association with Warner Bros. Television, and the theme song for the show was composed and performed by They Might Be Giants. The Oblongs aired on The WB from April 1, 2001 until May 20, 2001 and then aired on Adult Swim from August 25, 2002 to October 20, 2002, with a total of thirteen episodes. There has been mention of a potential series revival with new episodes on Adult Swim, however, no other information has been announced. All thirteen episodes of The Oblongs were released on DVD on October 4, 2005. Featured Crew Angus Oblong Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jean Smart Pickles Oblong Will Ferrell Bob Oblong Pamela Adlon Milo Oblong Lea DeLaria Jeannie Elias Beth Oblong Full Cast & Crew Last Season Season 2 2002 | 5 Episodes Season 2 of The Oblongs premiered on August 25, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1994-12-19 The Head 7.3    2005-10-30 Lucy, the Daughter of the Devil 7.0    2004-08-01 Stroker and Hoop 7.0    2004-11-07 Squidbillies 6.2    1999-09-24 Mission Hill 7.3    2012-01-19 Unsupervised 6.6    1990-09-28 Have I Got News for You 7.6    1994-03-05 Duckman 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.angusoblong.net/theoblongs.html Genres Animation Comedy Keywords radiation adult animation Content Score 93 Almost there... Top Contributors 14 Banana 6 Joe Carson A 5 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}