{"link": "https://www.themoviedb.org/tv/817?language=en", "title": "Barbara", "resume": "Barbara is a British sitcom starring Gwen Taylor in the title role. A pilot was broadcast in 1995, and three series were then televised from 1999 to 2003. It was made by Central Television, and filmed at their Lenton Lane studios in Nottingham in front of a live studio audience. The majority of location scenes for the series were filmed in various suburbs of Nottingham, including Mapperley and West Bridgford, with other scenes filmed around Nottinghamshire and Derbyshire. Despite winning awards and respectable viewing figures, it was axed by ITV in 2003.", "rate": 0, "genre": ["Comedy"], "cast": ["Gwen Taylor", "Sam Kelly", "Mark Benton", "Benedict Sandiford", "Elizabeth Carling"], "character": ["Barbara Liversidge", "Ted Liversidge", "Martin Pond", "Neil Liversidge", "Linda Pond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 817   Expand Barbara   (1999) User Score Overview Barbara is a British sitcom starring Gwen Taylor in the title role. A pilot was broadcast in 1995, and three series were then televised from 1999 to 2003. It was made by Central Television, and filmed at their Lenton Lane studios in Nottingham in front of a live studio audience. The majority of location scenes for the series were filmed in various suburbs of Nottingham, including Mapperley and West Bridgford, with other scenes filmed around Nottinghamshire and Derbyshire. Despite winning awards and respectable viewing figures, it was axed by ITV in 2003. Featured Crew Ramsay Gilderdale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gwen Taylor Barbara Liversidge Sam Kelly Ted Liversidge Mark Benton Martin Pond Benedict Sandiford Neil Liversidge Elizabeth Carling Linda Pond Full Cast & Crew Last Season Season 4 2003 | 6 Episodes Season 4 of Barbara premiered on February 23, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Barbara. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords yorkshire derbyshire farce family british farce sitcom british humour british sitcom Content Score 93 Almost there... Top Contributors a 37 alexmate 3 lineker O 3 Ozbourne s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}