{"link": "https://www.themoviedb.org/tv/37760?language=en", "title": "Exile", "resume": "Exile is a British psychological thriller television series dealing with the topic of Alzheimer's disease against a background of corruption. It stars John Simm and Jim Broadbent and was broadcast on BBC One. The series received varyingly positive reviews.\nJohn Simm received a BAFTA nomination for his role as Tom Ronstadt, as did the director John Alexander.", "rate": 74, "genre": ["Mystery", "Drama"], "cast": ["Jim Broadbent", "John Simm", "Timothy West", "Olivia Colman", "Shaun Dooley"], "character": ["Tom Ronstadt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37760   Expand Exile   (2011) User Score  Play Trailer Overview Exile is a British psychological thriller television series dealing with the topic of Alzheimer's disease against a background of corruption. It stars John Simm and Jim Broadbent and was broadcast on BBC One. The series received varyingly positive reviews. John Simm received a BAFTA nomination for his role as Tom Ronstadt, as did the director John Alexander. Featured Crew Danny Brocklehurst Creator Paul Abbott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Broadbent John Simm Tom Ronstadt Timothy West Olivia Colman Shaun Dooley Full Cast & Crew Last Season Season 1 2011 | 3 Episodes Season 1 of Exile premiered on May  1, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2015-02-15 Indian Summers 7.2    2003-05-18 State of Play 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b0110cpy Genres Mystery Drama Keywords corruption alzheimer's disease Content Score 100 Yes! Looking good! Top Contributors 4 Steve s 3 speedycars w 3 webmaster TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}