{"link": "https://www.themoviedb.org/tv/44953?language=en", "title": "The Lord of the Skies", "resume": "Set in the 1990s, these are the life and times of Amado Carrillo Fuentes, a man who became the head of the Juárez cartel. Nicknamed “El Señor de los Cielos” (Lord of the Skies) because of the large fleet of airplanes he used to transport drugs, he was also known for washing more than $200 million through Colombia to finance his huge fleet. He is described as the most powerful drug trafficker of his time.", "rate": 51, "genre": ["Crime", "Drama", "Soap"], "cast": ["Rafael Amaya", "Róbinson Díaz", "Carmen Aub"], "character": ["Aurelio Casillas \"El Señor de los Cielos\"", "Miltón Jiménez \"El Cabo\"", "Rutila Casillas Letrán"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44953   Expand The Lord of the Skies   (2013) User Score Overview Set in the 1990s, these are the life and times of Amado Carrillo Fuentes, a man who became the head of the Juárez cartel. Nicknamed “El Señor de los Cielos” (Lord of the Skies) because of the large fleet of airplanes he used to transport drugs, he was also known for washing more than $200 million through Colombia to finance his huge fleet. He is described as the most powerful drug trafficker of his time. Featured Crew Andrés López López Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  6 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rafael Amaya Aurelio Casillas \"El Señor de los Cielos\" Róbinson Díaz Miltón Jiménez \"El Cabo\" Carmen Aub Rutila Casillas Letrán Full Cast & Crew Current Season Season 6 2018 | 40 Episodes Season 6 of The Lord of the Skies premiered on May  8, 2018. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply There are no discussions for The Lord of the Skies. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   2017-08-16 The Many Faces of Ito 7.0    2017-12-15 Erased 8.2  Facts Original Name  El señor de los cielos Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://msnlatino.telemundo.com/novelas/El_Senor_de_los_Cielos/ Genres Crime Drama Soap Keywords drug cartel drug lord drug trafficking telenovela 1990s Content Score 71 Just a little bit more... Top Contributors 135 CrewMdk 46 Elizabeth Jennings wg 43 willian guillermo andrade charcape 30 camil2312  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}