{"link": "https://www.themoviedb.org/tv/35580?language=en", "title": "Edgar Wallace Mysteries", "resume": "The Edgar Wallace Mysteries was a British second-feature film series, produced at Merton Park Studios for Anglo-Amalgamated. There were 46 films in the series, made between 1960 and 1965.\nThe films were loose adaptations of Edgar Wallace's books and stories. Very few used his original titles, and there was no attempt to set them in the period in which Wallace wrote, probably to obviate the need for elaborate costumes and sets. A 1962 article in Scene magazine quotes £22,000 as the budget for an episode then in production.\nMost of the series featured a uniform title sequence, in which a shadowed bust of Edgar Wallace revolves slowly against a backdrop of swirling mist, to the accompaniment of the \"Man of Mystery\" theme written by Michael Carr. \"Man of Mystery\" was later recorded by The Shadows and became a no. 5 hit record in the UK.\nThe series has achieved lasting popularity through repeated showings on television. In Britain it was seen on ITV, Channel 4 and Bravo at various times from the late Sixties through to the Nineties. It was shown on U.S. television as The Edgar Wallace Mystery Theatre, with episodes cut to fit hour-long commercial TV slots.\nIn July 2012 Network DVD began to release the complete series on DVD, uncut and presented in its original widescreen cinema aspect ratio.", "rate": 70, "genre": ["Mystery", "Drama"], "cast": ["John Carson", "Alfred Burke", "Allan Cuthbertson", "Bernard Lee", "Bernard Archard"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35580   Expand Edgar Wallace Mysteries   (1959) User Score Overview The Edgar Wallace Mysteries was a British second-feature film series, produced at Merton Park Studios for Anglo-Amalgamated. There were 46 films in the series, made between 1960 and 1965. The films were loose adaptations of Edgar Wallace's books and stories. Very few used his original titles, and there was no attempt to set them in the period in which Wallace wrote, probably to obviate the need for elaborate costumes and sets. A 1962 article in Scene magazine quotes £22,000 as the budget for an episode then in production. Most of the series featured a uniform title sequence, in which a shadowed bust of Edgar Wallace revolves slowly against a backdrop of swirling mist, to the accompaniment of the \"Man of Mystery\" theme written by Michael Carr. \"Man of Mystery\" was later recorded by The Shadows and became a no. 5 hit record in the UK. The series has achieved lasting popularity through repeated showings on television. In Britain it was seen on ITV, Channel 4 and Bravo at various times from the late Sixties through to the Nineties. It was shown on U.S. television as The Edgar Wallace Mystery Theatre, with episodes cut to fit hour-long commercial TV slots. In July 2012 Network DVD began to release the complete series on DVD, uncut and presented in its original widescreen cinema aspect ratio. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Carson Alfred Burke Allan Cuthbertson Bernard Lee Bernard Archard Full Cast & Crew Last Season Season 7 1966 | 1 Episode Season 7 of Edgar Wallace Mysteries premiered on June  1, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Edgar Wallace Mysteries. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Mystery Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors B 10 BWYoda 2 kcdh J 1 Justi25  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}