{"link": "https://www.themoviedb.org/tv/70968?language=en", "title": "Downward Dog", "resume": "Follow the day-to-day life of Nan as told by her increasingly lonely and philosophical dog, Martin. Just one session at obedience school makes them realize that even at their worst, they may be the best thing for each other. Based on a web series.", "rate": 67, "genre": ["Comedy", "Drama"], "cast": ["Allison Tolman", "Lucas Neff", "Kirby Howell-Baptiste", "Barry Rothbart", "Ned"], "character": ["Nan", "Jason", "Jenn", "Kevin", "Martin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70968   Expand Downward Dog   (2017) User Score  Play Trailer Overview Follow the day-to-day life of Nan as told by her increasingly lonely and philosophical dog, Martin. Just one session at obedience school makes them realize that even at their worst, they may be the best thing for each other. Based on a web series. Featured Crew Samm Hodges Creator Michael Killen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Allison Tolman Nan Lucas Neff Jason Kirby Howell-Baptiste Jenn Barry Rothbart Kevin Ned Martin Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Downward Dog premiered on May 17, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Love it Already Open 4 by  Jessica Ratings ... Open 1 by  cursethedarkness Go to Discussions Media Most Popular Videos  2 Backdrops  9 Posters  1 Recommendations   2017-03-29 Nobodies 6.0    2016-03-01 Loosely Exactly Nicole 5.8    2016-05-09 Upstart Crow 7.4    2015-10-16 Truth Be Told 5.5    2016-01-13 Teachers 7.1    2016-06-07 Agatha Raisin 6.3    2016-10-19 HIM 6.2    2016-09-05 Mary + Jane 6.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   http://abc.go.com/shows/downward-dog Genres Comedy Drama Keywords relationship problems talking dog Content Score 100 Yes! Looking good! Top Contributors 56 Elizabeth Jennings jp 3 juan perez m 3 magoozin TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}