{"link": "https://www.themoviedb.org/tv/32757?language=en", "title": "Running Wilde", "resume": "Running Wilde is an American comedy television series created by Mitchell Hurwitz for the Fox Network. It stars Will Arnett as Steve Wilde, a self-centered, idle bachelor and heir to an oil fortune. The series follows Wilde's awkward attempts to regain the affection of his childhood sweetheart, Emmy, an environmentalist who had been living in the South American jungle, but whose young daughter does not want to return there and who secretly enlists Steve's help to keep Emmy at his mansion, leading to farcical situations and misunderstandings.", "rate": 68, "genre": ["Comedy"], "cast": ["Jayne Houdyshell", "Peter Serafinowicz", "David Cross", "Keri Russell", "Robert Michael Morris"], "character": ["Andy Weeks", "Emmy Kadubic"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32757   Expand Running Wilde   (2010) User Score  Play Trailer Overview Running Wilde is an American comedy television series created by Mitchell Hurwitz for the Fox Network. It stars Will Arnett as Steve Wilde, a self-centered, idle bachelor and heir to an oil fortune. The series follows Wilde's awkward attempts to regain the affection of his childhood sweetheart, Emmy, an environmentalist who had been living in the South American jungle, but whose young daughter does not want to return there and who secretly enlists Steve's help to keep Emmy at his mansion, leading to farcical situations and misunderstandings. Featured Crew Mitchell Hurwitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jayne Houdyshell Peter Serafinowicz David Cross Andy Weeks Keri Russell Emmy Kadubic Robert Michael Morris Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Running Wilde premiered on September 21, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   1998-08-19 Upright Citizens Brigade 8.0    2008-09-24 Gary Unmarried 5.1    2012-02-20 The Bleak Old Shop of Stuff 6.7    2003-11-10 Absolute Power 7.5    2005-06-29 Stella 7.0    2009-09-20 Bored to Death 7.4    2010-10-01 The Increasingly Poor Decisions of Todd Margaret 7.0    2011-10-24 Housos 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 21m Homepage  - Genres Comedy Keywords ex-lover wealthy billionaire Content Score 100 Yes! Looking good! Top Contributors 6 Travis Bell 3 lemonlyman 3 Zlogorek w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}