{"link": "https://www.themoviedb.org/tv/66068?language=en", "title": "Master: God of Noodles", "resume": "When Moo-Myung was young, he had an once-in-a-lifetime event. He walked into orphanage by himself. To take revenge, he attempts to become a God of Noodles.", "rate": 73, "genre": ["Drama"], "cast": ["Chun Jung-myung", "Jo Jae-hyeon", "Jeong Yu-mi", "Lee Sang-Yeob", "Gong Seung-yeon"], "character": ["Moo-Myung", "Kim Gil-Do", "Chae Yeo-Kyung", "Park Tae-Ha", "Kim Da-Hae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66068   Expand Master: God of Noodles   (2016) User Score Overview When Moo-Myung was young, he had an once-in-a-lifetime event. He walked into orphanage by himself. To take revenge, he attempts to become a God of Noodles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chun Jung-myung Moo-Myung Jo Jae-hyeon Kim Gil-Do Jeong Yu-mi Chae Yeo-Kyung Lee Sang-Yeob Park Tae-Ha Gong Seung-yeon Kim Da-Hae Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of Master: God of Noodles premiered on April 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-07-30 Second To Last Love 8.3    2016-03-05 Marriage Contract 8.2    2016-09-21 On the Way to the Airport 8.7    2016-05-25 Lucky Romance 7.3    2016-09-26 Woman with a Suitcase 7.1    2016-03-28 My Lawyer, Mr. Jo 8.0    2016-04-20 Entertainer 6.0  Facts Original Name  마스터-국수의 신 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/master/index.html Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors M 44 Maria180493 z 10 zurman1 3 lareina123 r 2 rogercyk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}