{"link": "https://www.themoviedb.org/tv/15579?language=en", "title": "The Guard", "resume": "The Guard is a Canadian drama television series portraying the life of the Canadian Coast Guard along the British Columbia Coast. Filming takes place in Squamish, British Columbia with Howe Sound standing in for the fictional Port Hallet and a real 47-foot Coast Guard lifeboat Cape St. James has been renamed Cape Pacific for the series.\nThe show primarily revolves around the four main characters: Miro Da Silva, Laura Nelson, Andrew Vanderlee, and Carly Greig. There is also a strong supporting cast, including Gordon Michael Woolvett, who worked with Bacic previously on Andromeda, and Eve Harlow, who won a 2009 Leo Award for her role on the show.\nThe show focuses on both the professional and personal lives of the lead characters, confronting issues such as addiction, post traumatic stress disorder, and family problems.\nIt was picked up by Ion premiering March 13, 2010. By late April, it was put on hiatus on the basis that it \"did not find a broad enough audience on the network\", explained a spokesperson. It subsequently aired for a period on the ION Life digital channel.", "rate": 0, "genre": ["Drama"], "cast": ["Steve Bacic", "Jeremy Guilbaut", "Zoie Palmer", "Ryan Robbins", "Claudette Mink"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15579   Expand The Guard   (2008) User Score Overview The Guard is a Canadian drama television series portraying the life of the Canadian Coast Guard along the British Columbia Coast. Filming takes place in Squamish, British Columbia with Howe Sound standing in for the fictional Port Hallet and a real 47-foot Coast Guard lifeboat Cape St. James has been renamed Cape Pacific for the series. The show primarily revolves around the four main characters: Miro Da Silva, Laura Nelson, Andrew Vanderlee, and Carly Greig. There is also a strong supporting cast, including Gordon Michael Woolvett, who worked with Bacic previously on Andromeda, and Eve Harlow, who won a 2009 Leo Award for her role on the show. The show focuses on both the professional and personal lives of the lead characters, confronting issues such as addiction, post traumatic stress disorder, and family problems. It was picked up by Ion premiering March 13, 2010. By late April, it was put on hiatus on the basis that it \"did not find a broad enough audience on the network\", explained a spokesperson. It subsequently aired for a period on the ION Life digital channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Bacic Jeremy Guilbaut Zoie Palmer Ryan Robbins Claudette Mink Full Cast & Crew Last Season Season 2 2008 | 15 Episodes Season 2 of The Guard premiered on August 29, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Guard. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.globaltv.com/globaltv/globalshows/theguard/index.html Genres Drama Keywords canada coast guard rescue team lifeboat maritime Content Score 86 Almost there... Top Contributors 12 Banana S 2 Samara c 1 castacasta w 1 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}