{"link": "https://www.themoviedb.org/tv/56570?language=en", "title": "Outlander", "resume": "The story of Claire Randall, a married combat nurse from 1945 who is mysteriously swept back in time to 1743, where she is immediately thrown into an unknown world where her life is threatened. When she is forced to marry Jamie, a chivalrous and romantic young Scottish warrior, a passionate affair is ignited that tears Claire's heart between two vastly different men in two irreconcilable lives.", "rate": 72, "genre": ["Adventure", "Drama", "Fantasy", "Romance"], "cast": ["Caitriona Balfe", "Sam Heughan", "Tobias Menzies", "Laura Donnelly", "Steven Cree"], "character": ["Claire Randall", "Jamie Fraser", "Frank Randall / Jonathan Randall", "Jenny Fraser", "Ian Murray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56570   Expand Outlander   (2014) User Score  Play Trailer Overview The story of Claire Randall, a married combat nurse from 1945 who is mysteriously swept back in time to 1743, where she is immediately thrown into an unknown world where her life is threatened. When she is forced to marry Jamie, a chivalrous and romantic young Scottish warrior, a passionate affair is ignited that tears Claire's heart between two vastly different men in two irreconcilable lives. Featured Crew Ronald D. Moore Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  12 Content Issues  0 Images Backdrops  30 Posters  26 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Caitriona Balfe Claire Randall Sam Heughan Jamie Fraser Tobias Menzies Frank Randall / Jonathan Randall Laura Donnelly Jenny Fraser Steven Cree Ian Murray Full Cast & Crew Last Season Book Three 2017 | 13 Episodes View All Seasons Social Reviews  1 Discussions  12 A A review by Ahstaroth Written by  Ahstaroth  on November 13, 2017 TL;DR: If you're interested in watching this show because you heard there was time travel, don't.  That is about 1% about what this show is about, at least in the first season (that's as far as I've gotten). And even the time travel aspect is mystical, there is  no  sci-fi element here.   LOST  it ain't.  If that changes past season one, well, I guess I might enjoy it more, but that's was my primary reason for giving the show a go, and my wife is enjoying this a lot more than I am.  Can't get enough of it. For me, it's pretty meh, and this is more of a warning for the guys than a proper revi...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  30 Posters  26 Recommendations   2014-01-25 Black Sails 7.1    2014-05-11 Penny Dreadful 7.4    2013-09-16 Sleepy Hollow 6.4    2010-09-26 Downton Abbey 8.0    2010-01-22 Spartacus 7.8    2013-04-12 Da Vinci's Demons 7.2    2014-12-12 Marco Polo 7.4    2013-03-30 Orphan Black 7.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.starz.com/originals/outlander Genres Adventure Drama Fantasy Romance Keywords based on novel or book magic scotland time travel romance history 18th century Content Score 100 Yes! Looking good! Top Contributors 122 Banana 67 Elizabeth Jennings 48 Medianoche 42 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}