{"link": "https://www.themoviedb.org/tv/57649?language=en", "title": "Surviving Evil", "resume": "Charisma Carpenter is the survivor of a real-life incident that she endured more than 20 years ago. The actress and two friends were swimming at San Diego's Torrey Pines State Beach in 1991 when they were violently attacked by an armed serial rapist. Carpenter fought for her survival after being held at gunpoint, but her two friends were both shot by the attacker. In the first episode of the series Charisma tells her story in raw emotional detail about what happened that night.", "rate": 80, "genre": ["Crime", "Documentary", "Drama"], "cast": ["Charisma Carpenter"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57649   Expand Surviving Evil   (2013) User Score Overview Charisma Carpenter is the survivor of a real-life incident that she endured more than 20 years ago. The actress and two friends were swimming at San Diego's Torrey Pines State Beach in 1991 when they were violently attacked by an armed serial rapist. Carpenter fought for her survival after being held at gunpoint, but her two friends were both shot by the attacker. In the first episode of the series Charisma tells her story in raw emotional detail about what happened that night. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charisma Carpenter Host Full Cast & Crew Last Season Season 3 2015 | 10 Episodes Season 3 of Surviving Evil premiered on October 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Surviving Evil. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  44m Homepage   http://investigationdiscovery.com/tv-shows/surviving-evil/ Genres Crime Documentary Drama Keywords survivor violence against women sexual violence violence Content Score 43 There's no 'I' in team... Top Contributors 24 Banana 12 Robert Nolan n 2 nnccll 2 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}