{"link": "https://www.themoviedb.org/tv/64172?language=en", "title": "Roommate", "resume": "Roommate is a South Korean reality show; a part of SBS's Good Sunday lineup, along with Running Man. It was first aired on May 4, 2014. The show features eleven celebrities living together in a share house, sharing common spaces such as the kitchen, living room, and washrooms, as well as household tasks. The house features sixty cameras and five bedrooms. The program is a response to society today where single-person households are dramatically increasing and aims to show the life, troubles, and joys of eleven different celebrities as they form friendships, relationships and possibly enemies living together under one roof.", "rate": 0, "genre": ["Comedy"], "cast": ["Jo Se-ho", "Sunny", "Heo Young-ji", "Lee Guk-joo", "Lee Dong-wook"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64172   Expand Roommate   (2014) User Score Overview Roommate is a South Korean reality show; a part of SBS's Good Sunday lineup, along with Running Man. It was first aired on May 4, 2014. The show features eleven celebrities living together in a share house, sharing common spaces such as the kitchen, living room, and washrooms, as well as household tasks. The house features sixty cameras and five bedrooms. The program is a response to society today where single-person households are dramatically increasing and aims to show the life, troubles, and joys of eleven different celebrities as they form friendships, relationships and possibly enemies living together under one roof. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Se-ho Sunny Heo Young-ji Lee Guk-joo Lee Dong-wook Full Cast & Crew Last Season Season 2 2014 | 26 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Roommate. You can help by rating TV shows you've seen. Facts Original Name  룸메이트 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  90m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000002481 Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 40 Maria180493 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}