{"link": "https://www.themoviedb.org/tv/5381?language=en", "title": "My Lovely Sam-Soon", "resume": "My Lovely Sam-soon is a South Korean television series which aired on MBC from June 1, 2005 to July 21, 2005. Touted as the Korean version of Bridget Jones Diary, it stars Kim Sun-ah, Hyun Bin, Jung Ryeo-won and Daniel Henney.\n\"Sam-soon\" is an old-fashioned name, and in Korean literally means \"30 years\", the exact age of the female protagonist.\nThe romantic comedy-drama series was a huge hit, with an average viewership rating of 37.6%, and its peak rating of 50.5% makes it the 26th highest rated Korean drama of all time. It also won numerous awards, including the Baeksang Arts Awards Grand Prize for TV, and the Grand Prize at the MBC Drama Awards for Kim Sun-ah.", "rate": 86, "genre": ["Comedy", "Drama"], "cast": ["Kim Sun-a", "Hyun Bin", "Jung Ryeo-won", "Daniel Henney", "Kwon Hae-hyo"], "character": ["Kim Sam-soon", "Hyun Jin-heon", "Yoo Hee-jin", "Henry Kim", "Lee Hyun-moo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5381   Expand My Lovely Sam-Soon   (2005) User Score Overview My Lovely Sam-soon is a South Korean television series which aired on MBC from June 1, 2005 to July 21, 2005. Touted as the Korean version of Bridget Jones Diary, it stars Kim Sun-ah, Hyun Bin, Jung Ryeo-won and Daniel Henney. \"Sam-soon\" is an old-fashioned name, and in Korean literally means \"30 years\", the exact age of the female protagonist. The romantic comedy-drama series was a huge hit, with an average viewership rating of 37.6%, and its peak rating of 50.5% makes it the 26th highest rated Korean drama of all time. It also won numerous awards, including the Baeksang Arts Awards Grand Prize for TV, and the Grand Prize at the MBC Drama Awards for Kim Sun-ah. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Sun-a Kim Sam-soon Hyun Bin Hyun Jin-heon Jung Ryeo-won Yoo Hee-jin Daniel Henney Henry Kim Kwon Hae-hyo Lee Hyun-moo Full Cast & Crew Last Season Season 1 2005 | 16 Episodes Season 1 of My Lovely Sam-Soon premiered on June  1, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  7 Recommendations   2011-06-29 Heartstrings 7.0    2009-10-07 You're Beautiful 7.9  Facts Original Name  내 이름은 김삼순 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/samsoon/ Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors N 14 Nightowl.Kr M 13 Maria180493 7 sansalayne CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}