{"link": "https://www.themoviedb.org/tv/64230?language=en", "title": "Preacher", "resume": "A preacher sets out on a mission to make the almighty himself confess his sin of abandoning the world. With his best friend Cassidy, an alcoholic Irish vampire, his love Tulip, a red blooded gun towing Texan, and the power of genesis, an unholy child born from an angel and a devil, Jesse gives up everything to set the world straight with its creator.", "rate": 74, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Dominic Cooper", "Ruth Negga", "Joseph Gilgun", "Ian Colletti", "Graham McTavish"], "character": ["Jesse Custer", "Tulip O'Hare", "Cassidy", "Eugene \"Arseface\" Root", "The Cowboy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64230   Expand Preacher   (2016) User Score  Play Trailer Overview A preacher sets out on a mission to make the almighty himself confess his sin of abandoning the world. With his best friend Cassidy, an alcoholic Irish vampire, his love Tulip, a red blooded gun towing Texan, and the power of genesis, an unholy child born from an angel and a devil, Jesse gives up everything to set the world straight with its creator. Featured Crew Sam Catlin Creator Seth Rogen Creator Evan Goldberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  0 Images Backdrops  29 Posters  23 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dominic Cooper Jesse Custer Ruth Negga Tulip O'Hare Joseph Gilgun Cassidy Ian Colletti Eugene \"Arseface\" Root Graham McTavish The Cowboy Full Cast & Crew Current Season Season 3 2018 | 10 Episodes View All Seasons Social Reviews  1 Discussions  17 Featured Review A review by Reno Written by  Reno  on February  4, 2018 Tales from hell and earth! SEASON 02: It was like last week I saw season 1, good to see the proceeding. Yeah, the story moves on, but it was totally different than the first. The initial setup was a road trip, then in the middle of the season, it settled down where the remaining story took place. After knowing the god is missing, Jesse the preacher along with his two friends embark to find him in various places. They come close yet unreachable. Besides, they go through a lot. A lot of obstacles, particularly the Saint of Killers was the most interesting aspect. Then there's a...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  29 Posters  23 Recommendations   2016-06-03 Outcast 7.0    2017-02-08 Legion 7.6    2017-04-30 American Gods 6.9    2015-05-14 Wayward Pines 6.5    2016-01-25 Lucifer 7.3    2014-10-24 Constantine 7.2    2015-11-20 Marvel's Jessica Jones 7.6    2016-09-30 Marvel's Luke Cage 6.9  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.amc.com/shows/preacher Genres Comedy Sci-Fi & Fantasy Keywords dc comics texas gore based on comic god blood Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings R 23 Rebecca 23 Travis Bell 21 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}