{"link": "https://www.themoviedb.org/tv/61670?language=en", "title": "Healer", "resume": "Kim Moon Ho is a successful reporter at a mainstream news station, but when he stumbles upon a 10-year-old mystery, he's forced to dive into a subversive underground news agency. On his journey to break open the case, Moon Ho teams up with Chae Young Shin, a second rate tabloid writer, and Healer, a mysterious internet-based journalist. With his career and his safety on the line, who can Moon Ho trust in a world full of unreliable sources?", "rate": 87, "genre": ["Comedy"], "cast": ["Ji Chang-wook", "Park Min-young", "Yoo Ji-tae", "Kim Mi-Kyung", "Oh Jong-hyuk"], "character": ["Seo Jung-hoo", "Chae Young-shin", "Kim Moon-ho", "Jo Min-ja", "Oh Gil-Han"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61670   Expand Healer   (2014) User Score  Play Trailer Overview Kim Moon Ho is a successful reporter at a mainstream news station, but when he stumbles upon a 10-year-old mystery, he's forced to dive into a subversive underground news agency. On his journey to break open the case, Moon Ho teams up with Chae Young Shin, a second rate tabloid writer, and Healer, a mysterious internet-based journalist. With his career and his safety on the line, who can Moon Ho trust in a world full of unreliable sources?  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Chang-wook Seo Jung-hoo Park Min-young Chae Young-shin Yoo Ji-tae Kim Moon-ho Kim Mi-Kyung Jo Min-ja Oh Jong-hyuk Oh Gil-Han Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Healer premiered on December  8, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  3 Posters  5 Recommendations   2015-01-07 Kill Me, Heal Me 8.7    2015-08-05 Yong Pal 7.2    2013-06-05 I Hear Your Voice 8.2    2013-08-05 Good Doctor 8.6    2012-08-13 Faith 7.6    2014-04-30 A New Leaf 7.7    2013-05-27 Heartless City 8.2    2012-08-15 Arang and the Magistrate 8.0  Facts Original Name  힐러 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/healer/ Genres Comedy Keywords romance korea Content Score 93 Almost there... Top Contributors M 59 Maria180493 t 9 tmdb38202327 CM 7 Cherche Moi 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}