{"link": "https://www.themoviedb.org/tv/38848?language=en", "title": "The Saddle Club", "resume": "The Saddle Club is a children's television series based on the books written by Bonnie Bryant and is an Australia/Canada co-production. Like the book series, the scripted live action series follows the lives of three teenage girls in training to compete in equestrian competitions at the fictional Pine Hollow Stables, while dealing with problems in their personal lives. This series debuted in 2001 and ended in 2003. However, due to popular demand, the series was renewed for a third season with new actors since the original ones were considered too old. The series revolves around the experiences of three girls, who form a club named \"The Saddle Club\" after recognizing their shared love for horse riding. Their natural rival is another young rider at the barn named Veronica DiAngelo.\nThroughout the series, The Saddle Club navigates their rivalry with Veronica, training for competitions, horse shows, and the quotidian dramas that arise between friends and staff in the fictional Pine Hollow Stables. In each show, The Saddle Club prevails over its adversities, usually sending a message emphasizing the importance of friendship and teamwork. The show is rated TV-G", "rate": 65, "genre": ["Family"], "cast": ["Sophie Bennett", "Brett Tucker", "Jessica Jacobs", "Lara Jean Marshall", "Keenan MacWilliam"], "character": ["Lisa Atwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38848   Expand The Saddle Club   (2001) User Score Overview The Saddle Club is a children's television series based on the books written by Bonnie Bryant and is an Australia/Canada co-production. Like the book series, the scripted live action series follows the lives of three teenage girls in training to compete in equestrian competitions at the fictional Pine Hollow Stables, while dealing with problems in their personal lives. This series debuted in 2001 and ended in 2003. However, due to popular demand, the series was renewed for a third season with new actors since the original ones were considered too old. The series revolves around the experiences of three girls, who form a club named \"The Saddle Club\" after recognizing their shared love for horse riding. Their natural rival is another young rider at the barn named Veronica DiAngelo. Throughout the series, The Saddle Club navigates their rivalry with Veronica, training for competitions, horse shows, and the quotidian dramas that arise between friends and staff in the fictional Pine Hollow Stables. In each show, The Saddle Club prevails over its adversities, usually sending a message emphasizing the importance of friendship and teamwork. The show is rated TV-G Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sophie Bennett Brett Tucker Jessica Jacobs Lara Jean Marshall Lisa Atwood Keenan MacWilliam Full Cast & Crew Last Season Season 3 2008 | 26 Episodes Season 3 of The Saddle Club premiered on September 29, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Saddle Club. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage   http://www.saddleclubtv.com/ Genres Family Keywords horse teenager based on children's book Content Score 86 Almost there... Top Contributors 13 Banana t 4 tmdb73933 4 Medianoche z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}