{"link": "https://www.themoviedb.org/tv/46127?language=en", "title": "GTO", "resume": "Through the introduction of his friend Danma Ryuji, Onizuka Eikichi, the former legendary bike gang member, visits Meishu Academy to tend to the trees in the garden as a part-time gardener. Learning that Yoshikawa Noboru, a student in teacher Fuyutsuki Azusa’s class is being bullied by Uehara Kyoko and other classmates, Onizuka befriends and saves Yoshikawa. Seeing Onizuka’s unprecedented but visceral, powerful response to problem solving, the school’s president and principal, Sakurai Yoshiko, overrides resistance from her vice principal Uchiyamada Hiroshi and makes Onizuka a teacher. Onizuka goes on to tackle many issues as the teacher in charge of the most problematic class, Class 2-4.", "rate": 80, "genre": ["Drama"], "cast": ["Akira"], "character": ["Eikichi Onizuka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46127   Expand GTO   (2012) User Score Overview Through the introduction of his friend Danma Ryuji, Onizuka Eikichi, the former legendary bike gang member, visits Meishu Academy to tend to the trees in the garden as a part-time gardener. Learning that Yoshikawa Noboru, a student in teacher Fuyutsuki Azusa’s class is being bullied by Uehara Kyoko and other classmates, Onizuka befriends and saves Yoshikawa. Seeing Onizuka’s unprecedented but visceral, powerful response to problem solving, the school’s president and principal, Sakurai Yoshiko, overrides resistance from her vice principal Uchiyamada Hiroshi and makes Onizuka a teacher. Onizuka goes on to tackle many issues as the teacher in charge of the most problematic class, Class 2-4.  Featured Crew Media Mix Japan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akira Eikichi Onizuka Full Cast & Crew Last Season Season 2 2014 | 11 Episodes Season 2 of GTO premiered on July  8, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on GTO. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 9 Sergiojamon H 7 Hoshi a 3 agabrielads 3 Monikua  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}