{"link": "https://www.themoviedb.org/tv/12089?language=en", "title": "The Millionaire", "resume": "The Millionaire is an American anthology series that aired on CBS from January 19, 1955, to June 8, 1960, originally sponsored by Colgate-Palmolive. The series explored the ways sudden and unexpected wealth changed life for better or for worse and became a five-season hit during the Golden Age of Television. It told the stories of people who were given one million dollars from a benefactor who insisted they never know him, with one exception. The series was known in syndication by two titles - The Millionaire, and as If You Had a Million.", "rate": 70, "genre": ["Drama"], "cast": ["Marvin Miller", "Paul Frees"], "character": ["Michael Anthony", "John Beresford Tipton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12089   Expand The Millionaire   (1955) User Score  Play Trailer Overview The Millionaire is an American anthology series that aired on CBS from January 19, 1955, to June 8, 1960, originally sponsored by Colgate-Palmolive. The series explored the ways sudden and unexpected wealth changed life for better or for worse and became a five-season hit during the Golden Age of Television. It told the stories of people who were given one million dollars from a benefactor who insisted they never know him, with one exception. The series was known in syndication by two titles - The Millionaire, and as If You Had a Million. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marvin Miller Michael Anthony Paul Frees John Beresford Tipton Full Cast & Crew Last Season Season 6 1959 | 36 Episodes Season 6 of The Millionaire premiered on September 16, 1959. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Millionaire. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Drama Keywords anthology millionaire philanthropist sudden wealth Content Score 64 We're so close, yet so far. Top Contributors 17 Stephen 10 lineker BD 2 Bob Daredevil TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}