{"link": "https://www.themoviedb.org/tv/4701?language=en", "title": "Ready Steady Go!", "resume": "Ready Steady Go! is one of the UK's first rock/pop music television programmes and was a forerunner of MTV-type programming. It was conceived by Elkan Allan, head of Rediffusion TV. Allan was assisted by record producer/talent manager Vicki Wickham, who became the show's producer, and Michael Lindsay-Hogg who was appointed the show's director in 1965. It was broadcast from August 1963 until December 1966. It was produced by Associated-Rediffusion the weekday ITV contractor for London, called Rediffusion-London post 1964. The live show was eventually networked nationally.\nThe show gained its highest ratings on 20 March 1964 when it featured the Beatles being interviewed and performing their songs \"It Won't Be Long\", \"You Can't Do That\" and \"Can't Buy Me Love\" - the last of which was a hit at the time.\nRSG! USA! was a Dick Clark production in 1964. A trademark infringement ended the show after six episodes.\nIts last episode was broadcast on 23 December 1966.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4701   Expand Ready Steady Go!   (1963) User Score Overview Ready Steady Go! is one of the UK's first rock/pop music television programmes and was a forerunner of MTV-type programming. It was conceived by Elkan Allan, head of Rediffusion TV. Allan was assisted by record producer/talent manager Vicki Wickham, who became the show's producer, and Michael Lindsay-Hogg who was appointed the show's director in 1965. It was broadcast from August 1963 until December 1966. It was produced by Associated-Rediffusion the weekday ITV contractor for London, called Rediffusion-London post 1964. The live show was eventually networked nationally. The show gained its highest ratings on 20 March 1964 when it featured the Beatles being interviewed and performing their songs \"It Won't Be Long\", \"You Can't Do That\" and \"Can't Buy Me Love\" - the last of which was a hit at the time. RSG! USA! was a Dick Clark production in 1964. A trademark infringement ended the show after six episodes. Its last episode was broadcast on 23 December 1966. Featured Crew Elkan Allan Creator Vicki Wickham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 1966 | 17 Episodes Season 4 of Ready Steady Go! premiered on September  2, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ready Steady Go!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 t0by TB 2 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}