{"link": "https://www.themoviedb.org/tv/4484?language=en", "title": "Chronicle", "resume": "Krøniken is a Danish television drama which aired on Sunday evenings between January 2004 and January 2007. The 22-episode series relates the lives of two fictional families during the historical development of the Danmarks Radio television network from the 1950s to the 1970s.\nCreated by Stig Thorsbøe for the DR broadcast-television network, the series debuted on 4 January 2004. The program's first season set popularity records. Five of the episodes were listed among the ten most watched television programs since records began in Denmark in 1992. The first season finale topped the list with 2,717,000 viewers. In 2004, the program was nominated for the International Emmy Award for Best Drama but lost to Waking the Dead.\nThe series concluded with the 22nd episode airing on 1 January 2007 and watched by 2.4 million viewers.", "rate": 0, "genre": ["Drama"], "cast": ["Stina Ekblad", "Anne Louise Hassing", "Lai Yde", "Lars Mikkelsen"], "character": ["Jens Otto Krag"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4484   Expand Chronicle   (2004) User Score Overview Krøniken is a Danish television drama which aired on Sunday evenings between January 2004 and January 2007. The 22-episode series relates the lives of two fictional families during the historical development of the Danmarks Radio television network from the 1950s to the 1970s. Created by Stig Thorsbøe for the DR broadcast-television network, the series debuted on 4 January 2004. The program's first season set popularity records. Five of the episodes were listed among the ten most watched television programs since records began in Denmark in 1992. The first season finale topped the list with 2,717,000 viewers. In 2004, the program was nominated for the International Emmy Award for Best Drama but lost to Waking the Dead. The series concluded with the 22nd episode airing on 1 January 2007 and watched by 2.4 million viewers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stina Ekblad Anne Louise Hassing Lai Yde Lars Mikkelsen Jens Otto Krag Full Cast & Crew Last Season Season 4 2006 | 2 Episodes Season 4 of Chronicle premiered on December 25, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Chronicle. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chronicle. You can help by rating TV shows you've seen. Facts Original Name  Krøniken Status  Ended Network Certification  - Type  Scripted Original Language  Danish Runtime  60m Homepage   http://www.dr.dk/kroeniken/kroeniken/forside/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 lineker 3 vacdk n 2 nato 2 Kecla  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}