{"link": "https://www.themoviedb.org/tv/6015?language=en", "title": "The State Within", "resume": "The State Within is a 2006 seven-episode British television political drama, written by Lizzie Mickery and Daniel Percival, produced by Grainne Marmion as a joint BBC–BBC America production, that was broadcast by BBC One in the United Kingdom from Thursday, 2 November 2006.", "rate": 78, "genre": ["Drama"], "cast": ["Sharon Gless", "Joe Pingue", "Aaron Abrams", "Eva Birthistle", "Ron Lea"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6015   Expand The State Within   (2006) User Score Overview The State Within is a 2006 seven-episode British television political drama, written by Lizzie Mickery and Daniel Percival, produced by Grainne Marmion as a joint BBC–BBC America production, that was broadcast by BBC One in the United Kingdom from Thursday, 2 November 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sharon Gless Joe Pingue Aaron Abrams Eva Birthistle Ron Lea Full Cast & Crew Last Season Season 1 2006 | 7 Episodes Season 1 of The State Within premiered on November  2, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   2012-11-07 Secret State 7.3    2006-07-09 Brotherhood 7.4    2014-02-06 The After 8.2    2005-12-04 Sleeper Cell 7.4    2011-02-07 Outcasts 6.2    2013-10-29 The Escape Artist 7.0    2008-10-06 XIII 6.0    2002-05-13 Spooks 7.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  57m, 60m Homepage  - Genres Drama Keywords politics conspiracy miniseries government conspiracy Content Score 86 Almost there... Top Contributors 10 Banana h 8 haribertlondon TB 8 TMDb Bot s 6 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}