{"link": "https://www.themoviedb.org/tv/34052?language=en", "title": "Better With You", "resume": "Better with You is an American romantic sitcom TV show starring Joanna Garcia Swisher and Jennifer Finnigan. The series aired on Wednesdays at 8:30 pm Eastern/7:30 pm Central on ABC and ran from September 22, 2010 to May 11, 2011.\nThe series was officially canceled on May 13, 2011 by ABC.", "rate": 60, "genre": ["Comedy"], "cast": ["Jennifer Finnigan", "Anabelle D. Munro", "Kurt Fuller", "JoAnna Garcia", "Debra Jo Rupp"], "character": ["Mia Putney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34052   Expand Better With You   (2010) User Score  Play Trailer Overview Better with You is an American romantic sitcom TV show starring Joanna Garcia Swisher and Jennifer Finnigan. The series aired on Wednesdays at 8:30 pm Eastern/7:30 pm Central on ABC and ran from September 22, 2010 to May 11, 2011. The series was officially canceled on May 13, 2011 by ABC. Featured Crew Shana Goldberg-Meehan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Finnigan Anabelle D. Munro Kurt Fuller JoAnna Garcia Mia Putney Debra Jo Rupp Full Cast & Crew Last Season Season 1 2010 | 22 Episodes Season 1 of Better With You premiered on September 22, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2013-05-23 Save Me 7.4    2014-02-23 Growing Up Fisher 5.9    2011-02-14 Mad Love 5.3    2013-09-23 Trophy Wife 5.7    2011-06-01 Franklin & Bash 7.1    2006-10-16 Frisky Dingo 8.1    2010-09-21 Running Wilde 6.8    2010-09-23 Outsourced 6.7  Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.abc.go.com/shows/better-with-you Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors z 5 zurman1 w 3 webmaster s 3 speedycars D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}