{"link": "https://www.themoviedb.org/tv/15185?language=en", "title": "Gotham Girls", "resume": "Gotham Girls is an American Flash animation series about the females of Gotham City, created and produced jointly by Warner Brothers and Noodle Soup Productions in 2000 to 2002. Episodes starred Harley Quinn, Poison Ivy, Batgirl, Catwoman and Zatanna in short stories of varying length about the daily lives of the characters.\nIt is also the name of a related comic book series.", "rate": 70, "genre": ["Drama", "Animation", "Comedy", "Action", "Adventure", "Crime"], "cast": ["Tom Kenny", "Adrienne Barbeau", "Tara Strong", "Jennifer Hale", "Arleen Sorkin"], "character": ["Catwoman (voice)", "Batgirl (voice)", "Harley Quinn (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15185   Expand Gotham Girls   (2000) User Score Overview Gotham Girls is an American Flash animation series about the females of Gotham City, created and produced jointly by Warner Brothers and Noodle Soup Productions in 2000 to 2002. Episodes starred Harley Quinn, Poison Ivy, Batgirl, Catwoman and Zatanna in short stories of varying length about the daily lives of the characters. It is also the name of a related comic book series. Featured Crew Paul Dini Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Kenny Adrienne Barbeau Catwoman (voice) Tara Strong Batgirl (voice) Jennifer Hale Arleen Sorkin Harley Quinn (voice) Full Cast & Crew Last Season Season 3 2002 | 10 Episodes Season 3 of Gotham Girls premiered on July 16, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gotham Girls. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  2m Homepage   http://www.warnerbrothers.com Genres Drama Animation Comedy Action & Adventure Crime Keywords superhero feminism Content Score 100 Yes! Looking good! Top Contributors 31 Cwf97 4 Daelin 3 lineker s 2 sashimi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}