{"link": "https://www.themoviedb.org/tv/2883?language=en", "title": "Dark Shadows", "resume": "Dark Shadows is an American gothic soap opera that originally aired weekdays on the ABC television network, from June 27, 1966, to April 2, 1971. The show was created by Dan Curtis. The story bible, which was written by Art Wallace, does not mention any supernatural elements. It was unprecedented in daytime television when ghosts were introduced about six months after it began.\nThe series became hugely popular when vampire Barnabas Collins appeared a year into its run. Dark Shadows also featured werewolves, zombies, man-made monsters, witches, warlocks, time travel, and a parallel universe. A small company of actors each played many roles; indeed, as actors came and went, some characters were played by more than one actor. Major writers besides Art Wallace included Malcolm Marmorstein, Sam Hall, Gordon Russell, and Violet Welles.\nDark Shadows was distinguished by its vividly melodramatic performances, atmospheric interiors, memorable storylines, numerous dramatic plot twists, unusually adventurous music score, and broad and epic cosmos of characters and heroic adventures. Now regarded as something of a classic, it continues to enjoy an intense cult following. Although the original series ran for only five years, its scheduling as a daily daytime drama allowed it to amass more single episodes during its run than most other science-fiction/fantasy genre series produced for English-language television, including Doctor Who and the entire Star Trek television franchise. Only the paranormal soap opera Passions, with a total of 2,231 episodes, has more.", "rate": 67, "genre": ["Drama", "Sci-Fi", "Fantasy", "Soap"], "cast": ["Jonathan Frid", "Grayson Hall", "Joan Bennett", "David Selby", "Kathryn Leigh Scott"], "character": ["Barnabas Collins", "Julia Hoffman", "Elizabeth Collins Stoddard", "Quentin Collins", "Maggie Evans"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2883   Expand Dark Shadows   (1966) User Score  Play Trailer Overview Dark Shadows is an American gothic soap opera that originally aired weekdays on the ABC television network, from June 27, 1966, to April 2, 1971. The show was created by Dan Curtis. The story bible, which was written by Art Wallace, does not mention any supernatural elements. It was unprecedented in daytime television when ghosts were introduced about six months after it began. The series became hugely popular when vampire Barnabas Collins appeared a year into its run. Dark Shadows also featured werewolves, zombies, man-made monsters, witches, warlocks, time travel, and a parallel universe. A small company of actors each played many roles; indeed, as actors came and went, some characters were played by more than one actor. Major writers besides Art Wallace included Malcolm Marmorstein, Sam Hall, Gordon Russell, and Violet Welles. Dark Shadows was distinguished by its vividly melodramatic performances, atmospheric interiors, memorable storylines, numerous dramatic plot twists, unusually adventurous music score, and broad and epic cosmos of characters and heroic adventures. Now regarded as something of a classic, it continues to enjoy an intense cult following. Although the original series ran for only five years, its scheduling as a daily daytime drama allowed it to amass more single episodes during its run than most other science-fiction/fantasy genre series produced for English-language television, including Doctor Who and the entire Star Trek television franchise. Only the paranormal soap opera Passions, with a total of 2,231 episodes, has more. Featured Crew Dan Curtis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Frid Barnabas Collins Grayson Hall Julia Hoffman Joan Bennett Elizabeth Collins Stoddard David Selby Quentin Collins Kathryn Leigh Scott Maggie Evans Full Cast & Crew Last Season Season 12 1971 | 46 Episodes Season 12 of Dark Shadows premiered on January 28, 1971. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Who all here watched this back in the day (or since)? Open 40 by  genplant29 r Love this show. Open 1 by  genplant29 Who are your 5 favorite characters on Dark Shadows? Open 1 by  genplant29 Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   1957-09-22 Maverick 8.3    1963-09-17 The Fugitive 7.9    1992-05-05 Forever Knight 7.7    1965-09-01 Gidget 5.2    1988-10-08 Empty Nest 5.5    1959-10-04 Dennis, The Menace 6.9    1967-03-28 Ironside 6.8    1955-09-10 Gunsmoke 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Sci-Fi & Fantasy Soap Keywords vampire supernatural curse mansion werewolf gothic horror mausoleum ghost family estate haunted Content Score 100 Yes! Looking good! Top Contributors 31 genplant29 4 Steve d 4 docgonzo w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}