{"link": "https://www.themoviedb.org/tv/790?language=en", "title": "Agatha Christie's Poirot", "resume": "From England to Egypt, accompanied by his elegant and trustworthy sidekicks, the intelligent yet eccentrically-refined Belgian detective Hercule Poirot pits his wits against a collection of first class deceptions.", "rate": 79, "genre": ["Crime", "Drama", "Family", "Mystery"], "cast": ["David Suchet", "Hugh Fraser", "Philip Jackson", "Pauline Moran"], "character": ["Hercule Poirot", "Arthur Hastings", "James Harold Japp", "Miss Lemon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 790   Expand Agatha Christie's Poirot   (1989) User Score Overview From England to Egypt, accompanied by his elegant and trustworthy sidekicks, the intelligent yet eccentrically-refined Belgian detective Hercule Poirot pits his wits against a collection of first class deceptions. Featured Crew Agatha Christie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  2 Images Backdrops  12 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Suchet Hercule Poirot Hugh Fraser Arthur Hastings Philip Jackson James Harold Japp Pauline Moran Miss Lemon Full Cast & Crew Last Season Season 13 2013 | 5 Episodes Season 13 of Agatha Christie's Poirot premiered on June  9, 2013. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply What are the worst adaptations? Open 2 by Notamymerrick\n      \n     w David Suchet is Hercules Poirot Open 1 by Notamymerrick\n      \n     N Changes from the books you liked / understood. Open 0 by Notamymerrick\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  10 Recommendations   1997-03-23 Midsomer Murders 7.7    1987-01-06 Inspector Morse 7.7    1971-09-15 Columbo 7.8    1984-04-24 Sherlock Holmes 8.5    1984-09-07 'Allo 'Allo! 7.8    1990-01-01 Mr. Bean 7.8    1984-09-30 Murder, She Wrote 6.5    1992-12-06 A Touch of Frost 7.9  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Crime Drama Family Mystery Keywords based on novel or book detective private investigator period drama private detective united kingdom belgian poirot murder mystery 1930s Content Score 100 Yes! Looking good! Top Contributors 256 Matthew Sanders 56 Elizabeth Jennings a 37 al-b-other DC 31 Don Chen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}