{"link": "https://www.themoviedb.org/tv/62267?language=en", "title": "Fall in Love with Soon Jung", "resume": "After his uncle's unjust takeover of the family company, Kang Min Ho grows up to be a successful, if not cynical investor who only cares about money. But when he undergoes a sudden heart transplant surgery, Min Ho literally has a change of heart when he inherits a warm and compassionate heart. In the midst of seeing the world anew, including falling for the kind Kim Soon Jung, Min Ho must mitigate his newfound personality with the demands of his cutthroat career.", "rate": 80, "genre": ["Drama", "Romance", "Comedy"], "cast": ["Jung Kyung-ho", "Kim So-yeon", "Park Young-gyu", "Yoon Hyun-min", "Ahn Suk-hwan"], "character": ["Kang Min-ho", "Kim Soon-jung", "Kang Hyun-chul", "Lee Joon-hee", "Ma Tae-seok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62267   Expand Fall in Love with Soon Jung   (2015) User Score Overview After his uncle's unjust takeover of the family company, Kang Min Ho grows up to be a successful, if not cynical investor who only cares about money. But when he undergoes a sudden heart transplant surgery, Min Ho literally has a change of heart when he inherits a warm and compassionate heart. In the midst of seeing the world anew, including falling for the kind Kim Soon Jung, Min Ho must mitigate his newfound personality with the demands of his cutthroat career. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Kyung-ho Kang Min-ho Kim So-yeon Kim Soon-jung Park Young-gyu Kang Hyun-chul Yoon Hyun-min Lee Joon-hee Ahn Suk-hwan Ma Tae-seok Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Fall in Love with Soon Jung premiered on April  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2014-10-13 Tomorrow's Cantabile 7.3    2015-07-24 Last 7.5  Facts Original Name  순정에 반하다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.joins.com/soonjung Genres Drama Romance Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 48 Maria180493 8 Imzadi z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}