{"link": "https://www.themoviedb.org/tv/74940?language=en", "title": "I Cannot Hug You", "resume": "The plot revolves around an inexplicable pull between two people and the romance that ensues between them. The main protagonist is the modern-day vampire who is apathetic towards everything in life until he showed up as her next-door neighbor (he's a germophobe, like in the webtoon). Her world changes as she feels the desperate need to get close to him. Will she finally be able to hug him?\n~~ Based on the \"unTouchable\" Line webtoon created by Massstar.", "rate": 80, "genre": ["Drama"], "cast": ["Xing Zhao Lin", "Zhang Yu Xi", "Dai Jing Yao", "Xin Rui Qi", "Xu Kai Cheng"], "character": ["Jiang Zhi Hao", "Li Shi Ya", "Xin Ba", "Xu Qing Ran", "Cui Jun He"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74940   Expand I Cannot Hug You   (2017) User Score Overview The plot revolves around an inexplicable pull between two people and the romance that ensues between them. The main protagonist is the modern-day vampire who is apathetic towards everything in life until he showed up as her next-door neighbor (he's a germophobe, like in the webtoon). Her world changes as she feels the desperate need to get close to him. Will she finally be able to hug him? ~~ Based on the \"unTouchable\" Line webtoon created by Massstar. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Xing Zhao Lin Jiang Zhi Hao Zhang Yu Xi Li Shi Ya Dai Jing Yao Xin Ba Xin Rui Qi Xu Qing Ran Xu Kai Cheng Cui Jun He Full Cast & Crew Current Season Season 2 2018 | 16 Episodes Season 2 of I Cannot Hug You premiered on February  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on I Cannot Hug You. You can help by rating TV shows you've seen. Facts Original Name  无法拥抱的你 Status  Ended Network Sohu Certification  - Type  Scripted Original Language  Chinese Runtime  35m Homepage  - Genres Drama Keywords romance youth Content Score 86 Almost there... Top Contributors j 26 jklmo M 24 Maria180493 TB 2 TMDb Bot 2 friend-series.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}