{"link": "https://www.themoviedb.org/tv/15242?language=en", "title": "It Started With a Kiss", "resume": "It Started with a Kiss is a Taiwanese drama starring Joe Cheng, Ariel Lin and Jiro Wang of Fahrenheit. It was based on the first 10 volumes of the Japanese manga series Itazura na Kiss written by Kaoru Tada. It was produced by Comic Productions and directed by Chu Yu-ning.\nIt was broadcast on free-to-air China Television from 25 September 2005 to 12 February 2006, every Sunday at 22:00 and cable TV Gala Television Variety Show/CH 28 on 31 September 2005 to 18 February 2006, every Saturday at 21:30 to 23:00.\nIt is the second live-action television adaptation following the Japanese adaptation also titled Itazura na Kiss and followed by its sequel They Kiss Again in 2007 and South Korean adaptation Playful Kiss in 2010 broadcast on MBC. It Started With a Kiss now airs on Hawaii's KIKU Television weekly on Saturdays at 6:00.", "rate": 60, "genre": ["Comedy"], "cast": ["Ariel Lin", "Joe Cheng", "Jiro Wang", "Tiffany Hsu", "Aaron Yan"], "character": ["Yuan Xiang Qin", "Jiang Zhi Shu", "Jin Yuan Feng", "Pei Zi Yu", "Ah Bu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15242   Expand It Started With a Kiss   (2005) User Score Overview It Started with a Kiss is a Taiwanese drama starring Joe Cheng, Ariel Lin and Jiro Wang of Fahrenheit. It was based on the first 10 volumes of the Japanese manga series Itazura na Kiss written by Kaoru Tada. It was produced by Comic Productions and directed by Chu Yu-ning. It was broadcast on free-to-air China Television from 25 September 2005 to 12 February 2006, every Sunday at 22:00 and cable TV Gala Television Variety Show/CH 28 on 31 September 2005 to 18 February 2006, every Saturday at 21:30 to 23:00. It is the second live-action television adaptation following the Japanese adaptation also titled Itazura na Kiss and followed by its sequel They Kiss Again in 2007 and South Korean adaptation Playful Kiss in 2010 broadcast on MBC. It Started With a Kiss now airs on Hawaii's KIKU Television weekly on Saturdays at 6:00. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ariel Lin Yuan Xiang Qin Joe Cheng Jiang Zhi Shu Jiro Wang Jin Yuan Feng Tiffany Hsu Pei Zi Yu Aaron Yan Ah Bu Full Cast & Crew Last Season They Kiss Again 2007 | 20 Episodes Season 2 of It Started With a Kiss premiered on December 16, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for It Started With a Kiss. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on It Started With a Kiss. You can help by rating TV shows you've seen. Facts Original Name  惡作劇之吻 Status  Ended Networks Certification  - Type  Scripted Original Language  Chinese Runtime  90m Homepage   http://www.chinatv.com.tw/event/2005/kiss/ Genres Comedy Keywords high school taiwan taiwanese high school sweetheart Content Score 86 Almost there... Top Contributors 16 Wendy t 9 tmdb983464 M 5 Maria180493 CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}