{"link": "https://www.themoviedb.org/tv/46880?language=en", "title": "The Fosters", "resume": "Stef Foster, a dedicated police officer, and her partner Lena Adams, a school vice principal, have built a close-knit, loving family with Stef's biological son from a previous marriage, Brandon, and their adopted twins, Mariana and Jesus. Their lives are disrupted in unexpected ways when Lena meets Callie, a hardened teen with an abusive past who has spent her life in and out of foster homes. Lena and Stef welcome Callie and her brother, Jude, into their home thinking it's just for a few weeks, until a more permanent placement can be found. But life has something else in store for the Fosters.", "rate": 62, "genre": ["Drama"], "cast": ["Maia Mitchell", "David Lambert", "Cierra Ramirez", "Noah Centineo", "Hayden Byerly"], "character": ["Callie Jacob", "Brandon Foster", "Mariana Foster", "Jesus Foster", "Jude Jacob"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46880   Expand The Fosters   (2013) User Score  Play Trailer Overview Stef Foster, a dedicated police officer, and her partner Lena Adams, a school vice principal, have built a close-knit, loving family with Stef's biological son from a previous marriage, Brandon, and their adopted twins, Mariana and Jesus. Their lives are disrupted in unexpected ways when Lena meets Callie, a hardened teen with an abusive past who has spent her life in and out of foster homes. Lena and Stef welcome Callie and her brother, Jude, into their home thinking it's just for a few weeks, until a more permanent placement can be found. But life has something else in store for the Fosters. Featured Crew Brad Bredeweg Creator Peter Paige Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  1 Images Backdrops  38 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maia Mitchell Callie Jacob David Lambert Brandon Foster Cierra Ramirez Mariana Foster Noah Centineo Jesus Foster Hayden Byerly Jude Jacob Full Cast & Crew Last Season Season 5 2017 | 22 Episodes Season 5 of The Fosters premiered on July 10, 2017. View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply w Jude: Happy Birthday Hayden Byerly! Open 0 by wonder2wonder\n      \n     w Callie: Happy Birthday Maia Mitchell! Open 0 by wonder2wonder\n      \n     r id like to see a Callie and Kyle interaction Open 0 by rumble88\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  38 Posters  5 Recommendations   2011-06-06 Switched at Birth 6.1    2015-09-12 Goldie & Bear 5.4    2013-12-24 Turbo FAST 4.7    2015-01-10 My Sunshine 7.4    2013-07-20 Cedar Cove 6.7    2013-07-19 Liv and Maddie 6.1    2017-01-06 One Day at a Time 6.6    2014-06-27 Girl Meets World 5.7  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://freeform.go.com/shows/the-fosters Genres Drama Keywords family relationships foster family gay parent foster child teen drama blended family Content Score 100 Yes! Looking good! Top Contributors 191 Banana 41 Elizabeth Jennings S 11 Sandor TB 8 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}