{"link": "https://www.themoviedb.org/tv/2178?language=en", "title": "Ramsay's Kitchen Nightmares", "resume": "Ramsay's Kitchen Nightmares is a television programme featuring British celebrity chef Gordon Ramsay. The BAFTA and Emmy Award-winning programme debuted on Channel 4 in 2004.\nIn each episode, Ramsay visits a failing restaurant and acts as a troubleshooter to help improve the establishment in just one week. Ramsay revisits the restaurant a few months later to see how business has fared in his absence. Episodes from series one and two have been re-edited with additional new material as Ramsay's Kitchen Nightmares Revisited; they featured Ramsay checking up on restaurants a year or more after he attended to them. In October 2009 Ramsay announced that after his four-year contract expired in 2011 he would not continue with Kitchen Nightmares and would instead work on his other shows.\nA one-off special entitled Ramsay's Great British Nightmare aired on Channel 4 on 30 January 2009 as part of 'The Great British Food Fight', a two week series of food-related programming. In the program, Ramsay campaigned for viewers to start supporting local restaurants, especially in a bad economy.\nAn American adaptation of this show, titled Kitchen Nightmares, debuted 19 September 2007, on Fox. It is broadcast in the UK on Channel 4 as Ramsay's Kitchen Nightmares USA.", "rate": 72, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2178   Expand Ramsay's Kitchen Nightmares   (2004) User Score Overview Ramsay's Kitchen Nightmares is a television programme featuring British celebrity chef Gordon Ramsay. The BAFTA and Emmy Award-winning programme debuted on Channel 4 in 2004. In each episode, Ramsay visits a failing restaurant and acts as a troubleshooter to help improve the establishment in just one week. Ramsay revisits the restaurant a few months later to see how business has fared in his absence. Episodes from series one and two have been re-edited with additional new material as Ramsay's Kitchen Nightmares Revisited; they featured Ramsay checking up on restaurants a year or more after he attended to them. In October 2009 Ramsay announced that after his four-year contract expired in 2011 he would not continue with Kitchen Nightmares and would instead work on his other shows. A one-off special entitled Ramsay's Great British Nightmare aired on Channel 4 on 30 January 2009 as part of 'The Great British Food Fight', a two week series of food-related programming. In the program, Ramsay campaigned for viewers to start supporting local restaurants, especially in a bad economy. An American adaptation of this show, titled Kitchen Nightmares, debuted 19 September 2007, on Fox. It is broadcast in the UK on Channel 4 as Ramsay's Kitchen Nightmares USA. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2007 | 8 Episodes Season 5 of Ramsay's Kitchen Nightmares premiered on October 30, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2005-10-27 The F Word 5.6    2007-09-19 Kitchen Nightmares 7.1    1984-01-31 Alas Smith and Jones 8.0    1971-04-10 The Two Ronnies 9.0    2009-10-18 Monty Python: Almost the Truth (The Lawyer's Cut) 7.0    2005-02-16 The Apprentice 5.2    2008-12-03 Man v. Food 6.7    2005-01-17 Supernanny 4.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m Homepage   http://www.channel4.com/nightmares Genres Reality Keywords cooking restaurant Content Score 56 We're so close, yet so far. Top Contributors 6 Elizabeth Jennings W 4 Wiruss m 4 moiraine r 3 rerem8433  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}