{"link": "https://www.themoviedb.org/tv/67581?language=en", "title": "Side by Side", "resume": "Norwegian sitcom about life on an idyllic street in Granli Norway, where the fences are low and neighborly relations close. Here we meet the residents who struggle with life's challenges big and small, trials all of us can relate to.", "rate": 80, "genre": ["Comedy"], "cast": ["Vidar Magnussen", "Henriette Friis Marø", "Tore Sagen", "Pernille Sørensen", "Jon Almaas"], "character": ["Jonas Kvåle", "Silje Helgesen", "Frode Pedersen", "Lisbeth Berg", "Christian Kopperud"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67581   Expand Side by Side   (2013) User Score Overview Norwegian sitcom about life on an idyllic street in Granli Norway, where the fences are low and neighborly relations close. Here we meet the residents who struggle with life's challenges big and small, trials all of us can relate to. Featured Crew Terje Solli Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vidar Magnussen Jonas Kvåle Henriette Friis Marø Silje Helgesen Tore Sagen Frode Pedersen Pernille Sørensen Lisbeth Berg Jon Almaas Christian Kopperud Full Cast & Crew Last Season Season 5 2017 | 10 Episodes Season 5 of Side by Side premiered on August 26, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Side by Side. You can help by rating TV shows you've seen. Facts Original Name  Side om side Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  30m Homepage  - Genres Comedy Keywords neighborhood sitcom Content Score 93 Almost there... Top Contributors 90 Bendik M 35 Mr_Democracy 15 Elizabeth Jennings S 6 Sall  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}