{"link": "https://www.themoviedb.org/tv/34989?language=en", "title": "Kaizoku Sentai Gokaiger", "resume": "Kaizoku Sentai Gokaiger is the title of Toei Company's 35th entry in its long-running Super Sentai Series of Japanese tokusatsu television series following Tensou Sentai Goseiger. It premiered on TV Asahi on February 13, 2011, joining Kamen Rider OOO and then Kamen Rider Fourze as a program featured in TV Asahi's Super Hero Time programming block. The catchphrase for the series is \"Let's make it showy!\".\nGokaiger is a special anniversary series. Its protagonists are able to transform into not only their own unique forms, but also all of the previous 34 Super Sentai teams, each of which have their own unique power that the Gokaigers can access. The series also features reappearances of actors reprising their characters from the previous series.\nOn July 30, 2010, Toei applied for trademarks on the title Kaizoku Sentai Gōkaijā to be used on various products. The Japan Patent Office approved these trademarks on August 26, 2010. During the Super Sentai VS Theater programming on December 26, 2010, the series was officially announced in a commercial. A Tokyo Dome City event for the premiere, serving as the introduction of the cast and theme song singers to the public, held on January 29 and 30, 2011.", "rate": 91, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Ryota Ozawa", "Yuki Yamada", "Mao Ichimichi", "Kazuki Shimizu", "Yui Koike"], "character": ["Captain Marvelous / Gokai Red", "Joe Gibken / Gokai Blue", "Luka Millfy / Gokai Yellow", "Don Dogoier / Gokai Green", "Ahim de Famille / Gokai Pink"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34989   Expand Kaizoku Sentai Gokaiger   (2011) User Score  Play Trailer Overview Kaizoku Sentai Gokaiger is the title of Toei Company's 35th entry in its long-running Super Sentai Series of Japanese tokusatsu television series following Tensou Sentai Goseiger. It premiered on TV Asahi on February 13, 2011, joining Kamen Rider OOO and then Kamen Rider Fourze as a program featured in TV Asahi's Super Hero Time programming block. The catchphrase for the series is \"Let's make it showy!\". Gokaiger is a special anniversary series. Its protagonists are able to transform into not only their own unique forms, but also all of the previous 34 Super Sentai teams, each of which have their own unique power that the Gokaigers can access. The series also features reappearances of actors reprising their characters from the previous series. On July 30, 2010, Toei applied for trademarks on the title Kaizoku Sentai Gōkaijā to be used on various products. The Japan Patent Office approved these trademarks on August 26, 2010. During the Super Sentai VS Theater programming on December 26, 2010, the series was officially announced in a commercial. A Tokyo Dome City event for the premiere, serving as the introduction of the cast and theme song singers to the public, held on January 29 and 30, 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Ryota Ozawa Captain Marvelous / Gokai Red Yuki Yamada Joe Gibken / Gokai Blue Mao Ichimichi Luka Millfy / Gokai Yellow Kazuki Shimizu Don Dogoier / Gokai Green Yui Koike Ahim de Famille / Gokai Pink Full Cast & Crew Last Season Season 1 2011 | 51 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kaizoku Sentai Gokaiger. You can help by rating TV shows you've seen. Facts Original Name  海賊戦隊ゴーカイジャー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.tv-asahi.co.jp/go-kai/ Genres Action & Adventure Sci-Fi & Fantasy Keywords treasure hunt tokusatsu pirate super sentai gokaiger Content Score 93 Almost there... Top Contributors 47 J. TB 6 TMDb Bot H 5 Hoshi CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}