{"link": "https://www.themoviedb.org/tv/41652?language=en", "title": "Tree With Deep Roots", "resume": "Deep Rooted Tree is a 2011 South Korean television series starring Jang Hyuk, Shin Se-kyung and Han Suk-kyu. Based on the novel of the same title by Lee Jeong-myeong, it aired on SBS from October 5 to December 22, 2011 on Wednesdays and Thursdays at 21:55 for 24 episodes.\nTaking its name from the poem Yongbieocheonga that says that trees with deep roots do not sway, the series tells the story of a royal guard investigating a case involving the serial murders of Jiphyeonjeon scholars in Gyeongbok Palace while King Sejong comes to create the Korean written language.", "rate": 89, "genre": ["Drama"], "cast": ["Han Suk-kyu", "Jang Hyuk", "Shin Se-kyung", "Song Joong-ki", "Kim Ki-bum"], "character": ["King Sejong", "Kang Chae-yoon / Ddol-bok", "So-yi / Dam", "Yi Do (teen)", "Pak Paengnyeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41652   Expand Tree With Deep Roots   (2011) User Score Overview Deep Rooted Tree is a 2011 South Korean television series starring Jang Hyuk, Shin Se-kyung and Han Suk-kyu. Based on the novel of the same title by Lee Jeong-myeong, it aired on SBS from October 5 to December 22, 2011 on Wednesdays and Thursdays at 21:55 for 24 episodes. Taking its name from the poem Yongbieocheonga that says that trees with deep roots do not sway, the series tells the story of a royal guard investigating a case involving the serial murders of Jiphyeonjeon scholars in Gyeongbok Palace while King Sejong comes to create the Korean written language. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Suk-kyu King Sejong Jang Hyuk Kang Chae-yoon / Ddol-bok Shin Se-kyung So-yi / Dam Song Joong-ki Yi Do (teen) Kim Ki-bum Pak Paengnyeon Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of Tree With Deep Roots premiered on October  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2015-10-05 Six Flying Dragons 7.8    2015-01-07 Kill Me, Heal Me 8.7  Facts Original Name  뿌리깊은 나무 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/root/ Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors t 32 tmdb38202327 N 20 Nightowl.Kr M 19 Maria180493 k 7 kongcs0504  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}