{"link": "https://www.themoviedb.org/tv/20053?language=en", "title": "Smiley's People", "resume": "Called out of retirement to settle the affairs of a friend, Smiley finds his old organization, the Circus, so overwhelmed by political considerations that it doesn't want to know what happened. He begins to follow up the clues of his friends past days, discovering that the clues lead to a high person in the Russian Secret service, and a secret important enough to kill for.", "rate": 79, "genre": ["Drama", "Mystery"], "cast": ["Alec Guinness", "Eileen Atkins", "Bill Paterson", "Bernard Hepton", "Anthony Bate"], "character": ["George Smiley", "Madame Ostrakova", "Lauder Strickland", "Toby Esterhase", "Oliver Lacon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20053   Expand Smiley's People   (1982) User Score  Play Trailer Overview Called out of retirement to settle the affairs of a friend, Smiley finds his old organization, the Circus, so overwhelmed by political considerations that it doesn't want to know what happened. He begins to follow up the clues of his friends past days, discovering that the clues lead to a high person in the Russian Secret service, and a secret important enough to kill for. Featured Crew John le Carré Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alec Guinness George Smiley Eileen Atkins Madame Ostrakova Bill Paterson Lauder Strickland Bernard Hepton Toby Esterhase Anthony Bate Oliver Lacon Full Cast & Crew Last Season Miniseries 1982 | 6 Episodes Season 1 of Smiley's People premiered on September 19, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   1979-09-10 Tinker Tailor Soldier Spy 7.7    1987-11-04 A Perfect Spy 5.5    Die Kinder 7.0    1983-09-05 Reilly, Ace of Spies 6.8    1967-07-08 Callan 6.0    1993-02-21 Lipstick on Your Collar 7.3    1983-02-06 The Winds of War 7.0    1988-11-13 War and Remembrance 7.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b04xvygv Genres Drama Mystery Keywords based on novel or book spy miniseries intelligence agent Content Score 100 Yes! Looking good! Top Contributors 26 Elizabeth Jennings TB 23 TMDb Bot 10 Banana z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}