{"link": "https://www.themoviedb.org/tv/655?language=en", "title": "Star Trek: The Next Generation", "resume": "Star Trek: The Next Generation is an American science fiction television series created by Gene Roddenberry as part of the Star Trek franchise. The show is set in the nearby regions of the Milky Way galaxy, approximately during the 2360s and features a new crew and a new starship Enterprise.", "rate": 82, "genre": ["Action", "Adventure", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Patrick Stewart", "Jonathan Frakes", "Brent Spiner", "Michael Dorn", "Marina Sirtis"], "character": ["Jean-Luc Picard", "William T. Riker", "Data", "Worf", "Deanna Troi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 655   Expand Star Trek: The Next Generation   (1987) User Score Overview Star Trek: The Next Generation is an American science fiction television series created by Gene Roddenberry as part of the Star Trek franchise. The show is set in the nearby regions of the Milky Way galaxy, approximately during the 2360s and features a new crew and a new starship Enterprise. Featured Crew Gene Roddenberry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  85 Content Issues  2 Images Backdrops  34 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Patrick Stewart Jean-Luc Picard Jonathan Frakes William T. Riker Brent Spiner Data Michael Dorn Worf Marina Sirtis Deanna Troi Full Cast & Crew Last Season Season 7 1993 | 26 Episodes View All Seasons Social Reviews  0 Discussions  87 Subject Status Replies Last Reply w The return of Captain Jean-Luc Picard Open 0 by wonder2wonder\n      \n     RIP Harlan Ellison Open 0 by Nexus71\n      \n     Where has everybody gone? Open 0 by Nexus71\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  34 Posters  13 Recommendations   1995-01-16 Star Trek: Voyager 7.8    1993-01-03 Star Trek: Deep Space Nine 7.8    1966-09-08 Star Trek 8.1    2001-09-26 Star Trek: Enterprise 7.4    2004-10-18 Battlestar Galactica 8.1    1997-07-27 Stargate SG-1 8.0    1994-01-26 Babylon 5 8.1    2002-09-20 Firefly 8.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.startrek.com/page/star-trek-the-next-generation Genres Action & Adventure Drama Mystery Sci-Fi & Fantasy Keywords spacecraft space travel alien space alien planet space opera Content Score 100 Yes! Looking good! Top Contributors 126 TonAngel 28 Elizabeth Jennings 25 johnv02139 24 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}