{"link": "https://www.themoviedb.org/tv/6279?language=en", "title": "Mummies Alive!", "resume": "Mummies Alive! is an American animated series from DIC Entertainment. It originally aired for one season in 1997.\nIn ancient Egypt, an evil sorcerer named Scarab, kills the pharaoh's son, Prince Rapses, so he can become immortal. Entombed alive for his crime, Scarab revives in the modern world and begins his search for Rapses' reincarnation, a San Francisco-dwelling boy named Presley Carnovan to retrieve the spirit of Rapses' so he can become immortal. Rapses' bodyguards, Ja-Kal, Rath, Armon, and Nefer-Tina, along with Rapses' cat, Kahti, awake from the dead to protect him from Scarab. They use the power of Ra to transform into powerful guardians.\nEach of the mummies is aligned with the power of an Egyptian god. Ja-Kal uses the spirit of falcon, Rath uses the spirit of snake, Armon uses the spirit of ram, and Nefer-Tina uses the spirit of cat. They are able to call upon it for magical armor and powers to fight superhuman evildoers. Although, once their strength is exhausted, they must rest in their sarcophagi to regain the ability. In order to access these powers, the mummies call out the phrase \"With the Strength of Ra!\", which triggers their transformation. The mummies also have the power to make a horrifying face, usually used to scare away nosy bystanders.", "rate": 70, "genre": ["Animation"], "cast": ["Bill Switzer", "Dale Wilson", "Scott McNeil", "Cree Summer", "Andrew Kavadas"], "character": ["Nefertina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6279   Expand Mummies Alive!   (1997) User Score Overview Mummies Alive! is an American animated series from DIC Entertainment. It originally aired for one season in 1997. In ancient Egypt, an evil sorcerer named Scarab, kills the pharaoh's son, Prince Rapses, so he can become immortal. Entombed alive for his crime, Scarab revives in the modern world and begins his search for Rapses' reincarnation, a San Francisco-dwelling boy named Presley Carnovan to retrieve the spirit of Rapses' so he can become immortal. Rapses' bodyguards, Ja-Kal, Rath, Armon, and Nefer-Tina, along with Rapses' cat, Kahti, awake from the dead to protect him from Scarab. They use the power of Ra to transform into powerful guardians. Each of the mummies is aligned with the power of an Egyptian god. Ja-Kal uses the spirit of falcon, Rath uses the spirit of snake, Armon uses the spirit of ram, and Nefer-Tina uses the spirit of cat. They are able to call upon it for magical armor and powers to fight superhuman evildoers. Although, once their strength is exhausted, they must rest in their sarcophagi to regain the ability. In order to access these powers, the mummies call out the phrase \"With the Strength of Ra!\", which triggers their transformation. The mummies also have the power to make a horrifying face, usually used to scare away nosy bystanders. Featured Crew Seth Kearsley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Switzer Dale Wilson Scott McNeil Cree Summer Nefertina Andrew Kavadas Full Cast & Crew Last Season Season 1 1997 | 42 Episodes Season 1 of Mummies Alive! premiered on September 15, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1996-09-16 Beast Wars: Transformers 7.7    2005-01-21 American Dragon: Jake Long 5.9    2010-09-22 The Avengers: Earth's Mightiest Heroes 7.5    1997-09-13 Recess 6.8    1994-09-05 Aladdin 6.2    2003-07-19 Teen Titans 7.6    2000-09-09 Jackie Chan Adventures 7.1    2001-08-24 The Grim Adventures of Billy and Mandy 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords mummy Content Score 93 Almost there... Top Contributors G 4 Ghostrider34 3 Sergiojamon D 3 Daniel s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}