{"link": "https://www.themoviedb.org/tv/39849?language=en", "title": "Tia & Tamera", "resume": "Tia & Tamera is an American reality television series on the Style Network. Originally titled Tia & Tamera Take 2, the series started off as a television special that aired on July 17, 2010. It was announced in February 2011 that the special was picked to series. Later, the series was changed to its current title and debuted on August 8, 2011. In September 2011, Style Network renewed the show for a second season, which later premiered on June 11, 2012. Season 3 was announced on February 12, 2013, with it premiering on July 14, 2013. The third season concluded September 22, 2013, and was the last program to air on Style, which rebranded as Esquire Network the next day; the future of the show is unknown. The series is currently airing reruns on Oxygen starting on September 26, 2013. Then on October 15, 2013, Tia & Tamera will start airing reruns on its new home network E! along with Giuliana & Bill.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39849   Expand Tia & Tamera   (2011) User Score Overview Tia & Tamera is an American reality television series on the Style Network. Originally titled Tia & Tamera Take 2, the series started off as a television special that aired on July 17, 2010. It was announced in February 2011 that the special was picked to series. Later, the series was changed to its current title and debuted on August 8, 2011. In September 2011, Style Network renewed the show for a second season, which later premiered on June 11, 2012. Season 3 was announced on February 12, 2013, with it premiering on July 14, 2013. The third season concluded September 22, 2013, and was the last program to air on Style, which rebranded as Esquire Network the next day; the future of the show is unknown. The series is currently airing reruns on Oxygen starting on September 26, 2013. Then on October 15, 2013, Tia & Tamera will start airing reruns on its new home network E! along with Giuliana & Bill. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2013 | 10 Episodes Season 3 of Tia & Tamera premiered on July 14, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tia & Tamera. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.mystyle.com/mystyle/shows/tiaandtamera/index.jsp Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}