{"link": "https://www.themoviedb.org/tv/40064?language=en", "title": "Black Dynamite", "resume": "Black Dynamite is an American animated television series based on the 2009 film of the same name, although the series follows a separate continuity, with some back-references to the film. The series was announced shortly after the release of the film, the 10-minute pilot episode was released on Adult Swim Video on August 8, 2011, and the full series premiered on Cartoon Network's late night programming block, Adult Swim, on July 15, 2012. Michael Jai White, Byron Minns, Tommy Davidson and Kym Whitley reprise their film roles as Black Dynamite, Bullhorn, Cream Corn and Honeybee, respectively.", "rate": 76, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Kym Whitley", "Tommy Davidson", "Byron Minns", "Michael Jai White"], "character": ["Honeybee", "Cream Corn", "Bull Horn", "Black Dynamite"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40064   Expand Black Dynamite   (2012) User Score  Play Trailer Overview Black Dynamite is an American animated television series based on the 2009 film of the same name, although the series follows a separate continuity, with some back-references to the film. The series was announced shortly after the release of the film, the 10-minute pilot episode was released on Adult Swim Video on August 8, 2011, and the full series premiered on Cartoon Network's late night programming block, Adult Swim, on July 15, 2012. Michael Jai White, Byron Minns, Tommy Davidson and Kym Whitley reprise their film roles as Black Dynamite, Bullhorn, Cream Corn and Honeybee, respectively. Featured Crew Byron Minns Creator Michael Jai White Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kym Whitley Honeybee Tommy Davidson Cream Corn Byron Minns Bull Horn Michael Jai White Black Dynamite Full Cast & Crew Last Season Season 2 2014 | 9 Episodes Season 2 of Black Dynamite premiered on October 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2014-08-18 Clarence 7.4    2016-12-16 Justice League Action 7.0    2008-11-14 Batman: The Brave and the Bold 7.1    2004-07-01 The Soup 4.9    2013-04-23 Teen Titans Go! 4.4    2010-09-22 The Avengers: Earth's Mightiest Heroes 7.5    2013-11-09 Marvel's Avengers Assemble 6.5    2003-01-22 Chappelle's Show 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  25m Homepage   http://www.adultswim.com/videos/black-dynamite Genres Action & Adventure Animation Comedy Keywords blaxploitation blacksploitation Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings 13 Norrin_Radd_Of_Zenn_La CM 8 Cherche Moi z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}