{"link": "https://www.themoviedb.org/tv/44006?language=en", "title": "Chicago Fire", "resume": "An edge-of-your-seat view into the lives of everyday heroes committed to one of America's noblest professions. For the firefighters, rescue squad and paramedics of Chicago Firehouse 51, no occupation is more stressful or dangerous, yet so rewarding and exhilarating. These courageous men and women are among the elite who forge headfirst into danger when everyone else is running the other way and whose actions make the difference between life and death.", "rate": 72, "genre": ["Drama"], "cast": ["Jesse Spencer", "Taylor Kinney", "Monica Raymund", "Eamonn Walker", "David Eigenberg"], "character": ["Matthew Casey", "Kelly Severide", "Gabriela Dawson", "Wallace Boden", "Christopher Herrmann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44006   Expand Chicago Fire   (2012) User Score  Play Trailer Overview An edge-of-your-seat view into the lives of everyday heroes committed to one of America's noblest professions. For the firefighters, rescue squad and paramedics of Chicago Firehouse 51, no occupation is more stressful or dangerous, yet so rewarding and exhilarating. These courageous men and women are among the elite who forge headfirst into danger when everyone else is running the other way and whose actions make the difference between life and death. Featured Crew Derek Haas Creator Michael Brandt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  13 Content Issues  0 Images Backdrops  12 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jesse Spencer Matthew Casey Taylor Kinney Kelly Severide Monica Raymund Gabriela Dawson Eamonn Walker Wallace Boden David Eigenberg Christopher Herrmann Full Cast & Crew Last Season Season 6 2017 | 23 Episodes Season 6 of Chicago Fire premiered on September 27, 2017. View All Seasons Social Reviews  0 Discussions  13 Subject Status Replies Last Reply b Casey Open 2 by  Jessica DuShon Monique Brown (\"Connie\") has died Open 1 by  bgirlmagic w Gabriela Dawson: Happy Birthday Monica Raymund! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  12 Recommendations   2014-01-08 Chicago P.D. 6.9    2015-11-17 Chicago Med 6.7    2017-11-02 S.W.A.T. 6.6    2010-06-24 Rookie Blue 7.0    2010-09-24 Blue Bloods 6.8    2015-01-27 Stalker 5.8    2010-09-20 Hawaii Five-0 6.2    2017-09-27 SEAL Team 6.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/chicago-fire Genres Drama Keywords chicago firemen paramedic crime investigation fire department Content Score 100 Yes! Looking good! Top Contributors 74 Banana 65 Elizabeth Jennings 55 seawolf 42 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}