{"link": "https://www.themoviedb.org/tv/65267?language=en", "title": "Halfworlds", "resume": "In the bustling streets and back alleys of Jakarta, a parallel world of bloodthirsty creatures from Indonesian mythology has lived alongside humans for generations. Taking on the appearance of humans themselves, the true identity of these \"Demit\" has been carefully concealed for centuries by a powerful family of mortals. The arrival of a mysterious supernatural event known only as the Gift will bring this hidden world to the surface. As the day of the Gift approaches, a young street artist named Sarah unexpectedly finds herself in the eye of the storm. Once the Demit realize who Sarah really is, and what she must do, humans and Demit are set on a collision course that could change the balance of their two worlds forever.", "rate": 68, "genre": ["Mystery", "Horror", "Thriller"], "cast": ["Peem Jaiyen", "Tia Tavee", "Emma Emika", "Myra Molloy", "Arifin Putra"], "character": ["Fyter", "Juliet Langstorm", "Pym", "Wish", "Barata"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65267   Expand Halfworlds   (2016) User Score  Play Trailer Overview In the bustling streets and back alleys of Jakarta, a parallel world of bloodthirsty creatures from Indonesian mythology has lived alongside humans for generations. Taking on the appearance of humans themselves, the true identity of these \"Demit\" has been carefully concealed for centuries by a powerful family of mortals. The arrival of a mysterious supernatural event known only as the Gift will bring this hidden world to the surface. As the day of the Gift approaches, a young street artist named Sarah unexpectedly finds herself in the eye of the storm. Once the Demit realize who Sarah really is, and what she must do, humans and Demit are set on a collision course that could change the balance of their two worlds forever. Featured Crew Joko Anwar Creator Collin Chang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peem Jaiyen Fyter Tia Tavee Juliet Langstorm Emma Emika Pym Myra Molloy Wish Arifin Putra Barata Full Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Halfworlds premiered on February  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Halfworlds. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://hboasia.com/Signature/en-id/shows/halfworlds/ Genres Mystery Horror Thriller Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 35 itzkadalizm M 34 MrStone 17 stego77 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}