{"link": "https://www.themoviedb.org/tv/2292?language=en", "title": "Porridge", "resume": "Porridge is a British situation comedy broadcast on BBC1 from 1974 to 1977, running for three series, two Christmas specials and a feature film also titled Porridge. Written by Dick Clement and Ian La Frenais, it stars Ronnie Barker and Richard Beckinsale as two inmates at the fictional HMP Slade in Cumberland. \"Doing porridge\" is British slang for serving a prison sentence, porridge once being the traditional breakfast in UK prisons.\nThe series was followed by a 1978 sequel, Going Straight, which established that Fletcher would not be going back to prison again. Porridge was voted number seven in a 2004 BBC poll of the 100 greatest British sitcoms.", "rate": 83, "genre": ["Comedy"], "cast": ["Tony Osoba", "Fulton Mackay", "Ronnie Barker", "Brian Wilde", "Sam Kelly"], "character": ["Mr. Mackay", "Norman Stanley Fletcher", "Mr. Barrowclough"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2292   Expand Porridge   (1974) User Score Overview Porridge is a British situation comedy broadcast on BBC1 from 1974 to 1977, running for three series, two Christmas specials and a feature film also titled Porridge. Written by Dick Clement and Ian La Frenais, it stars Ronnie Barker and Richard Beckinsale as two inmates at the fictional HMP Slade in Cumberland. \"Doing porridge\" is British slang for serving a prison sentence, porridge once being the traditional breakfast in UK prisons. The series was followed by a 1978 sequel, Going Straight, which established that Fletcher would not be going back to prison again. Porridge was voted number seven in a 2004 BBC poll of the 100 greatest British sitcoms. Featured Crew Dick Clement Creator Ian La Frenais Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Osoba Fulton Mackay Mr. Mackay Ronnie Barker Norman Stanley Fletcher Brian Wilde Mr. Barrowclough Sam Kelly Full Cast & Crew Last Season Series 3 1977 | 6 Episodes Season 3 of Porridge premiered on February 18, 1977. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Porridge. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1962-01-04 Steptoe and Son 8.2    1976-02-20 Open All Hours 7.7    1973-02-15 Some Mothers Do 'Ave 'Em 7.8    1973-01-09 Whatever Happened to the Likely Lads? 7.8    1968-07-31 Dad's Army 7.6    1991-01-03 The Brittas Empire 7.1    1974-09-02 Rising Damp 7.8    1995-09-14 They Think It's All Over 7.3  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006m9kn Genres Comedy Keywords prison judge england theft convict warden sitcom british humour scottish Content Score 93 Almost there... Top Contributors O 9 Ozbourne 8 Elizabeth Jennings l 7 lostarchitect 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}