{"link": "https://www.themoviedb.org/tv/28529?language=en", "title": "The Three Stooges", "resume": "The Three Stooges were an American vaudeville and comedy team active from 1922 until 1970, best known for their 190 short subject films by Columbia Pictures that have been regularly airing on television since 1958. Their hallmark was physical farce and slapstick. In films, the stooges were commonly known by their actual first names. There were a total of six stooges over the act's run (with only three active at any given time), but Moe Howard and Larry Fine were the mainstays throughout the ensemble's nearly fifty-year run.", "rate": 86, "genre": ["Comedy"], "cast": ["Joe Besser", "Shemp Howard", "Joe DeRita", "Moe Howard", "Larry Fine"], "character": ["Joe", "Shemp", "Curly Joe", "Moe", "Larry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28529   Expand The Three Stooges   (1934) User Score Overview The Three Stooges were an American vaudeville and comedy team active from 1922 until 1970, best known for their 190 short subject films by Columbia Pictures that have been regularly airing on television since 1958. Their hallmark was physical farce and slapstick. In films, the stooges were commonly known by their actual first names. There were a total of six stooges over the act's run (with only three active at any given time), but Moe Howard and Larry Fine were the mainstays throughout the ensemble's nearly fifty-year run. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  3 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Besser Joe Shemp Howard Shemp Joe DeRita Curly Joe Moe Howard Moe Larry Fine Larry Full Cast & Crew Last Season Season 26 1959 | 2 Episodes Season 26 of The Three Stooges premiered on February  2, 1959. View All Seasons Social Reviews  0 Discussions  12 Subject Status Replies Last Reply S Boo call Open 0 by Strannger18\n      \n     S Swinging the alphabet Open 0 by Strannger18\n      \n     S A hunting we will go Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1951-06-15 I Love Lucy 7.6    1964-09-24 The Munsters 7.1    1965-09-18 I Dream of Jeannie 7.1    1964-09-17 Bewitched 7.1    1964-09-18 The Addams Family 7.5  Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors t 20 tmdb42009110 12 Steve 9 Elizabeth Jennings 8 GDarck  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}