{"link": "https://www.themoviedb.org/tv/62829?language=en", "title": "Bonnie & Clyde", "resume": "Miniseries based on the true story of Clyde Barrow, a charismatic convicted armed robber who sweeps Bonnie Parker, an impressionable, petite, small-town waitress, off her feet, and the two embark on one one of most infamous bank-robbing sprees in history.", "rate": 67, "genre": ["Crime", "Drama"], "cast": ["Holliday Grainger", "Emile Hirsch", "Sarah Hyland", "Lane Garrison", "William Hurt"], "character": ["Bonnie Parker", "Clyde Barrow", "Blanche Barrow", "Buck Barrow", "Frank Hamer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62829   Expand Bonnie & Clyde   (2013) User Score Overview Miniseries based on the true story of Clyde Barrow, a charismatic convicted armed robber who sweeps Bonnie Parker, an impressionable, petite, small-town waitress, off her feet, and the two embark on one one of most infamous bank-robbing sprees in history. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Holliday Grainger Bonnie Parker Emile Hirsch Clyde Barrow Sarah Hyland Blanche Barrow Lane Garrison Buck Barrow William Hurt Frank Hamer Full Cast & Crew Last Season Season 1 2013 | 2 Episodes Season 1 of Bonnie & Clyde premiered on December  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bonnie & Clyde. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  English Runtime  240m Homepage   http://www.aetv.com/bonnie-and-clyde Genres Crime Drama Keywords kidnapping based on a true story outlaw period drama Content Score 93 Almost there... Top Contributors 46 Banana 23 Elizabeth Jennings TB 7 TMDb Bot z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}