{"link": "https://www.themoviedb.org/tv/68874?language=en", "title": "The Body Collector", "resume": "The story of Dutch journalist Hans Knoop's 1970s struggle to uncover the truth about World War II war criminal Pieter Menten.", "rate": 80, "genre": ["Drama"], "cast": ["Aus Greidanus", "Guy Clemens", "Noortje Herlaar", "Carine Crutzen"], "character": ["Pieter Menten", "Hans Knoop", "Betty Knoop", "Meta Menten"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68874   Expand The Body Collector   (2016) User Score Overview The story of Dutch journalist Hans Knoop's 1970s struggle to uncover the truth about World War II war criminal Pieter Menten. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aus Greidanus Pieter Menten Guy Clemens Hans Knoop Noortje Herlaar Betty Knoop Carine Crutzen Meta Menten Full Cast & Crew Last Season Season 1 2016 | 3 Episodes Season 1 of The Body Collector premiered on November 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Body Collector. You can help by rating TV shows you've seen. Facts Original Name  De Zaak Menten Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  - Homepage  - Genres Drama Keywords war crimes Content Score 86 Almost there... Top Contributors 14 sjerdo 9 Steve a 7 andre.meulemans t 3 tintin92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}