{"link": "https://www.themoviedb.org/tv/47665?language=en", "title": "Black Sails", "resume": "The pirate adventures of Captain Flint and his men twenty years prior to Robert Louis Stevenson’s classic “Treasure Island.” Flint, the most brilliant and most feared pirate captain of his day, takes on a fast-talking young addition to his crew who goes by the name John Silver. Threatened with extinction on all sides, they fight for the survival of New Providence Island, the most notorious criminal haven of its day – a debauched paradise teeming with pirates, prostitutes, thieves and fortune seekers, a place defined by both its enlightened ideals and its stunning brutality.", "rate": 72, "genre": ["Adventure", "Drama"], "cast": ["Toby Stephens", "Luke Arnold", "Hannah New", "Jessica Parker Kennedy", "Toby Schmitz"], "character": ["Captain Flint", "John Silver", "Eleanor Guthrie", "Max", "Jack Rackham"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47665   Expand Black Sails   (2014) User Score  Play Trailer Overview The pirate adventures of Captain Flint and his men twenty years prior to Robert Louis Stevenson’s classic “Treasure Island.” Flint, the most brilliant and most feared pirate captain of his day, takes on a fast-talking young addition to his crew who goes by the name John Silver. Threatened with extinction on all sides, they fight for the survival of New Providence Island, the most notorious criminal haven of its day – a debauched paradise teeming with pirates, prostitutes, thieves and fortune seekers, a place defined by both its enlightened ideals and its stunning brutality. Featured Crew Jonathan E. Steinberg Creator Robert Levine Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  1 Images Backdrops  37 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Toby Stephens Captain Flint Luke Arnold John Silver Hannah New Eleanor Guthrie Jessica Parker Kennedy Max Toby Schmitz Jack Rackham Full Cast & Crew Last Season Season 4 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply What a love story! *spoilers* Open 0 by SevenHouses\n      \n     Luke Arnold/Silver Open 1 by  SevenHouses What do you expect from the ending? Open 4 by  TheShredder Go to Discussions Media Most Popular Videos  2 Backdrops  37 Posters  18 Recommendations   2014-12-12 Marco Polo 7.4    2013-01-11 Banshee 7.9    2014-05-11 Penny Dreadful 7.4    2013-04-12 Da Vinci's Demons 7.2    2014-08-09 Outlander 7.1    2010-01-22 Spartacus 7.8    2011-11-06 Hell on Wheels 7.2    2005-08-28 Rome 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   https://www.starz.com/series/blacksails Genres Adventure Drama Keywords pirate period drama swashbuckler Content Score 100 Yes! Looking good! Top Contributors 125 Elizabeth Jennings 23 seawolf 22 CaribbeanKid 21 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}