{"link": "https://www.themoviedb.org/tv/72374?language=en", "title": "School 2017", "resume": "A coming-of-age story about the lives of 18-year-old high school students who are valued according to their ranking in school. Despite their frustrations, they find out how to make their own way in this world that seems to be a stagnant cycle of school and home.", "rate": 52, "genre": ["Drama"], "cast": ["Kim Se-Jeong", "Kim Jung-hyun", "Jang Dong-Yoon", "Seol In-Ah", "Ro Woon"], "character": ["Ra Eun-Ho", "Hyun Tae-Woon", "Song Dae-Whee", "Hong Nam-Joo", "Kang Hyun-Il"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72374   Expand School 2017   (2017) User Score Overview A coming-of-age story about the lives of 18-year-old high school students who are valued according to their ranking in school. Despite their frustrations, they find out how to make their own way in this world that seems to be a stagnant cycle of school and home. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Se-Jeong Ra Eun-Ho Kim Jung-hyun Hyun Tae-Woon Jang Dong-Yoon Song Dae-Whee Seol In-Ah Hong Nam-Joo Ro Woon Kang Hyun-Il Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of School 2017 premiered on July 17, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for School 2017. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2017-08-09 Manhole 7.3    2017-11-11 Money Flower 8.0    2017-10-11 Mad Dog 8.0    2017-01-16 Introverted Boss 8.7    2017-07-19 Man Who Dies to Live 8.3    2017-07-19 Reunited Worlds 8.3    2017-10-09 Witch's Court 9.3    2017-08-05 Save Me 7.0  Facts Original Name  학교 2017 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/school2017/ Genres Drama Keywords high school romance coming of age korea Content Score 93 Almost there... Top Contributors M 57 Maria180493 8 rychoi 5 galactica_j 4 koreacpv  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}