{"link": "https://www.themoviedb.org/tv/7447?language=en", "title": "Paddington Bear", "resume": "Paddington Bear is a series of British animated shorts based on the Paddington Bear book series by Michael Bond produced by FilmFair. This was the first television series based on the popular children's book Paddington Bear. In the United States it was usually shown on pay television as filler in between programs. Its narrator was actor Michael Hordern. It was one of the few television programmes to combine a puppet show with cartoon - Paddington himself was a puppet, but other characters in the series were depicted as cartoon characters.\nThe series has a very distinctive art style. Paddington himself is a stop-motion animated puppet who moves within a 3-dimensional space and interacts with 2-dimensional animated drawings of the human characters, buildings, etc.\nThe series, along with all other FilmFair productions is currently owned by DHX Media of Canada.", "rate": 77, "genre": ["Animation"], "cast": ["Michael Hordern"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7447   Expand Paddington Bear   (1976) User Score Overview Paddington Bear is a series of British animated shorts based on the Paddington Bear book series by Michael Bond produced by FilmFair. This was the first television series based on the popular children's book Paddington Bear. In the United States it was usually shown on pay television as filler in between programs. Its narrator was actor Michael Hordern. It was one of the few television programmes to combine a puppet show with cartoon - Paddington himself was a puppet, but other characters in the series were depicted as cartoon characters. The series has a very distinctive art style. Paddington himself is a stop-motion animated puppet who moves within a 3-dimensional space and interacts with 2-dimensional animated drawings of the human characters, buildings, etc. The series, along with all other FilmFair productions is currently owned by DHX Media of Canada. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Hordern Narrator Full Cast & Crew Last Season The Adventures of Paddington 1978 | 26 Episodes Season 2 of Paddington Bear premiered on November  7, 1978. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Paddington Bear. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1993-09-06 Sooty & Co. 6.8    1976-01-06 Rentaghost 8.0    1993-01-27 The Detectives 7.1    Randall and Hopkirk (Deceased) 7.0    1967-01-03 Trumpton 8.8    1966-01-03 Camberwick Green 8.3    1982-11-01 SuperTed 6.8    1972-10-16 Rainbow 7.0  Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  30m, 5m Homepage   http://www.paddingtonbear.co.uk/ Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors N 21 Notamymerrick E 2 Elky 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}