{"link": "https://www.themoviedb.org/tv/12740?language=en", "title": "Licence to Grill", "resume": "License to Gril is a show hosted by Rob Rainford and can be seen on Food Network Canada, Asian Food Channel and downloaded at MoboVivo. The show is produced by Knight Enterprises. The show was formerly carried in the United States on the Discovery Networks channel Discovery Home, but was dropped from the schedule when the channel was flipped to the ecology-themed Planet Green. The episode \"Bike Ride BBQ\" was the last one to air in the USA.\nLicense to Grill is a series that explores the enjoyment of backyard cooking, entertaining, and the barbecue. Each episode takes place over a day or two, but mainly on Saturdays. The host and chef Rob Rainford prepares a meal for the evening when guests will arrive.\nThe central theme is barbecue and with that, Rainford shows us tips and tricks for cooking on a barbecue. The recipes range from the typical barbecue fare, such as hamburgers, steaks, kebabs, to more ambitious meals such as leg of lamb, hot smoking sides of fish, grilled desserts.\nRainford has a philosophy when it comes to the barbecue: \"It's pretty simple. Just start with the freshest ingredients you can find and then you've got two choices: long slow cooking over low indirect heat, or red hot and smokin' for fast grilling. If you cook low and slow then you can use all sorts of rubs and smoking agents to infuse the food with a depth of flavour you just can’t get out of an oven. As for high heat grilling, your barbecue puts out way more heat than your stovetop so you can get that wonderful charring and searing, just like in a restaurant.\"", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12740   Expand Licence to Grill User Score Overview License to Gril is a show hosted by Rob Rainford and can be seen on Food Network Canada, Asian Food Channel and downloaded at MoboVivo. The show is produced by Knight Enterprises. The show was formerly carried in the United States on the Discovery Networks channel Discovery Home, but was dropped from the schedule when the channel was flipped to the ecology-themed Planet Green. The episode \"Bike Ride BBQ\" was the last one to air in the USA. License to Grill is a series that explores the enjoyment of backyard cooking, entertaining, and the barbecue. Each episode takes place over a day or two, but mainly on Saturdays. The host and chef Rob Rainford prepares a meal for the evening when guests will arrive. The central theme is barbecue and with that, Rainford shows us tips and tricks for cooking on a barbecue. The recipes range from the typical barbecue fare, such as hamburgers, steaks, kebabs, to more ambitious meals such as leg of lamb, hot smoking sides of fish, grilled desserts. Rainford has a philosophy when it comes to the barbecue: \"It's pretty simple. Just start with the freshest ingredients you can find and then you've got two choices: long slow cooking over low indirect heat, or red hot and smokin' for fast grilling. If you cook low and slow then you can use all sorts of rubs and smoking agents to infuse the food with a depth of flavour you just can’t get out of an oven. As for high heat grilling, your barbecue puts out way more heat than your stovetop so you can get that wonderful charring and searing, just like in a restaurant.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}