{"link": "https://www.themoviedb.org/tv/21784?language=en", "title": "Web Soup", "resume": "Web Soup is a weekly series that aired in the U.S. on G4. The show, hosted by Chris Hardwick, comments on the latest in viral videos. It has similar fashion to sister network E!'s series The Soup and is produced by the same crew as that show. The program held a TV-14 rating due to strong language, violent situations, and some suggestive scenes.\nDuring the first two seasons, this show was taped in front of a green screen like The Soup. In the third season, the program taped on the set usually utilized by E! News with added studio audience seating. Chris Hardwick confirmed via a comment on his website that season three was the last and the show would not continue. However, repackaged archived episodes returned to G4's schedule.", "rate": 0, "genre": ["Comedy"], "cast": ["Chris Hardwick"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21784   Expand Web Soup   (2009) User Score Overview Web Soup is a weekly series that aired in the U.S. on G4. The show, hosted by Chris Hardwick, comments on the latest in viral videos. It has similar fashion to sister network E!'s series The Soup and is produced by the same crew as that show. The program held a TV-14 rating due to strong language, violent situations, and some suggestive scenes. During the first two seasons, this show was taped in front of a green screen like The Soup. In the third season, the program taped on the set usually utilized by E! News with added studio audience seating. Chris Hardwick confirmed via a comment on his website that season three was the last and the show would not continue. However, repackaged archived episodes returned to G4's schedule. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Hardwick Full Cast & Crew Last Season Season 3 2011 | 18 Episodes Season 3 of Web Soup premiered on March 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Web Soup. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  23m, 22m, 30m Homepage   http://www.g4tv.com/websoup Genres Comedy Keywords viral video Content Score 56 We're so close, yet so far. Top Contributors 6 Banana 2 Elizabeth Jennings 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}