{"link": "https://www.themoviedb.org/tv/4946?language=en", "title": "Deal or No Deal", "resume": "Deal or No Deal is the American version of the international game show of Dutch origin of the same name. The show was hosted by Howie Mandel, and premiered on December 19, 2005, on National Broadcasting Company. The hour-long show typically aired at least twice a week during its run, and included special extended or theme episodes. The show started its fourth season on August 25, 2008, after NBC's coverage of the 2008 Beijing Olympics. A daily syndicated half-hour version of the show debuted on September 8, 2008 and continued for two seasons.\nThe game was primarily unchanged from the international format where a contestant chooses one briefcase from a selection of 26. Each briefcase contained a cash value from $.01 to $1,000,000. Over the course of the game, the contestant eliminated the other cases, periodically being presented with a \"deal\" from The Banker to take a cash amount to quit the game. Should the contestant refuse every deal, they were given the chance to trade the original case for the only other one left in play, and won whatever money was in the chosen case. Special variations of the game, including a \"Million Dollar Mission\" introduced in the third season, were also used, as well as a tie-in with a viewer \"Lucky Case Game\".", "rate": 52, "genre": [], "cast": ["Patricia Kara", "Howie Mandel", "Marisa Petroro", "Katie Cleary", "Anya Monzikova"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4946   Expand Deal or No Deal   (2005) User Score Overview Deal or No Deal is the American version of the international game show of Dutch origin of the same name. The show was hosted by Howie Mandel, and premiered on December 19, 2005, on National Broadcasting Company. The hour-long show typically aired at least twice a week during its run, and included special extended or theme episodes. The show started its fourth season on August 25, 2008, after NBC's coverage of the 2008 Beijing Olympics. A daily syndicated half-hour version of the show debuted on September 8, 2008 and continued for two seasons. The game was primarily unchanged from the international format where a contestant chooses one briefcase from a selection of 26. Each briefcase contained a cash value from $.01 to $1,000,000. Over the course of the game, the contestant eliminated the other cases, periodically being presented with a \"deal\" from The Banker to take a cash amount to quit the game. Should the contestant refuse every deal, they were given the chance to trade the original case for the only other one left in play, and won whatever money was in the chosen case. Special variations of the game, including a \"Million Dollar Mission\" introduced in the third season, were also used, as well as a tie-in with a viewer \"Lucky Case Game\". Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patricia Kara Howie Mandel Host Marisa Petroro Katie Cleary Anya Monzikova Full Cast & Crew Last Season Season 2 2006 | 70 Episodes Season 2 of Deal or No Deal premiered on September 18, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1996-09-08 Blue's Clues 6.3    Mister Rogers' Neighborhood 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m, 22m, 30m Homepage   http://www.nbc.com/Deal_Or_No_Deal/ Genres No genres have been added. Keywords game show Content Score 86 Almost there... Top Contributors 11 Banana TB 2 TMDb Bot 1 tphoenix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}