{"link": "https://www.themoviedb.org/tv/17446?language=en", "title": "Bondi Vet", "resume": "Chronicles the adventures of charismatic Veterinarians Dr. Chris Brown and Dr. Lisa Chimes as they live and work at one of Australia’s most famous locations – Sydney’s Bondi Beach.", "rate": 100, "genre": ["Documentary"], "cast": ["Lisa Chimes", "Andrew Marchevsky", "Chris Brown"], "character": ["Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17446   Expand Bondi Vet   (2009) User Score Overview Chronicles the adventures of charismatic Veterinarians Dr. Chris Brown and Dr. Lisa Chimes as they live and work at one of Australia’s most famous locations – Sydney’s Bondi Beach. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Chimes Herself Andrew Marchevsky Himself Chris Brown Himself Full Cast & Crew Last Season Season 5 2013 | 26 Episodes Season 5 of Bondi Vet premiered on February 23, 2013. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Bondi Vet. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bondi Vet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  42m, 23m Homepage   http://tenplay.com.au/channel-ten/bondi-vet Genres Documentary Keywords australia veterinarian animal veterinary clinic Content Score 56 We're so close, yet so far. Top Contributors 12 Banana L 8 Leah 6 SWFT O 2 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}