{"link": "https://www.themoviedb.org/tv/41255?language=en", "title": "Doctor’s Diary", "resume": "Doctor’s Diary is a German-Austrian medical drama, that aired for three seasons from 2008 to 2011 on RTL in a coproduction with ORF. The focus of the series is the young doctor Margarete \"Gretchen“ Haase, who wants to make a career in a hospital. It was directed by Bora Dağtekin and shown from the June 23, 2008 to February 14 2011 on German television, RTL Television.\nIn Canada, it was shown starting August 31, 2010 on Séries+ television. In France, from June 8, 2011 on TF1 television and starting March 31, 2013 on HD1 television.", "rate": 75, "genre": ["Comedy"], "cast": ["Diana Amft", "Peter Prager", "Ursela Monn", "Florian David Fitz", "Kai Schumann"], "character": ["Dr. Margarethe 'Gretchen' Haase", "Prof. Dr. Franz Haase", "Bärbel Haase", "Dr. Marc Meier", "Dr. Mehdi Kaan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41255   Expand Doctor’s Diary   (2008) User Score Overview Doctor’s Diary is a German-Austrian medical drama, that aired for three seasons from 2008 to 2011 on RTL in a coproduction with ORF. The focus of the series is the young doctor Margarete \"Gretchen“ Haase, who wants to make a career in a hospital. It was directed by Bora Dağtekin and shown from the June 23, 2008 to February 14 2011 on German television, RTL Television. In Canada, it was shown starting August 31, 2010 on Séries+ television. In France, from June 8, 2011 on TF1 television and starting March 31, 2013 on HD1 television. Featured Crew Bora Dağtekin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diana Amft Dr. Margarethe 'Gretchen' Haase Peter Prager Prof. Dr. Franz Haase Ursela Monn Bärbel Haase Florian David Fitz Dr. Marc Meier Kai Schumann Dr. Mehdi Kaan Full Cast & Crew Last Season Season 3 2011 | 8 Episodes Season 3 of Doctor’s Diary premiered on January  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  17 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Doctor’s Diary. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  45m, 60m Homepage  - Genres Comedy Keywords female doctor Content Score 100 Yes! Looking good! Top Contributors S 28 Samara L 20 Loopioh D 15 Doody a 8 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}