{"link": "https://www.themoviedb.org/tv/72404?language=en", "title": "Boy Band", "resume": "Singers battle it out to become a member of the next music sensation. Viewers at home vote for their five favorite band members. Winners get a spot in the band and a recording contract with Hollywood Records.", "rate": 65, "genre": ["Reality"], "cast": ["Rita Ora", "Emma Bunton", "Timbaland", "Nick Carter"], "character": ["Host", "Architect #1", "Architect #2", "Architect #3"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72404   Expand Boy Band   (2017) User Score  Play Trailer Overview Singers battle it out to become a member of the next music sensation. Viewers at home vote for their five favorite band members. Winners get a spot in the band and a recording contract with Hollywood Records. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rita Ora Host Emma Bunton Architect #1 Timbaland Architect #2 Nick Carter Architect #3 Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Boy Band premiered on June 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Boy Band. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://abc.go.com/shows/boy-band Genres Reality Keywords music competition singing Content Score 93 Almost there... Top Contributors 52 Gabriel W. Almeida 6 Elizabeth Jennings 3 Banana 1 Marco  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}