{"link": "https://www.themoviedb.org/tv/41196?language=en", "title": "Hausmeister Krause – Ordnung muss sein", "resume": "Hausmeister Krause – Ordnung muss sein is a German sitcom with Tom Gerhardt in the title role, shown from 1999 through 2010 on Sat.1.\nThe series parodies typical German \"squareness\". Half-day janitor Dieter Krause is the embodiment of the German \"square\"; he is pernickety, blindly follows order, denounces others, is nosy, consistently puts his own interests above all else, acts subservient to his superiors and is brutish and unjust to those he deemes below him.\nMany plot elements — mishaps, misunderstandings, and frequent cases of mistaken identity — originate from Boulevard theatre. The characters in the series borrow heavily from those in Tom Gerhardt's film Voll normaaal, in many cases sharing names. In Voll normaaal, Tom Gerhardt played the roles of both Dieter and Tommie Krause; in Hausmeister Krause, Tommie was played by Axel Stein. Daughter Carmen is played by Janine Kunze. Other characters from Voll normaaal, such as Tommie's friend Mario, are relegated to the status of background characters. The scope of action also changed.", "rate": 58, "genre": ["Comedy"], "cast": ["Tom Gerhardt", "Janine Kunze", "Axel Stein", "Irene Schwarz"], "character": ["Dieter Krause", "Carmen Krause", "Thomas „Tommie“ Krause", "Elisabeth \"Lisbeth\" Krause"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41196   Expand Hausmeister Krause – Ordnung muss sein   (1999) User Score Overview Hausmeister Krause – Ordnung muss sein is a German sitcom with Tom Gerhardt in the title role, shown from 1999 through 2010 on Sat.1. The series parodies typical German \"squareness\". Half-day janitor Dieter Krause is the embodiment of the German \"square\"; he is pernickety, blindly follows order, denounces others, is nosy, consistently puts his own interests above all else, acts subservient to his superiors and is brutish and unjust to those he deemes below him. Many plot elements — mishaps, misunderstandings, and frequent cases of mistaken identity — originate from Boulevard theatre. The characters in the series borrow heavily from those in Tom Gerhardt's film Voll normaaal, in many cases sharing names. In Voll normaaal, Tom Gerhardt played the roles of both Dieter and Tommie Krause; in Hausmeister Krause, Tommie was played by Axel Stein. Daughter Carmen is played by Janine Kunze. Other characters from Voll normaaal, such as Tommie's friend Mario, are relegated to the status of background characters. The scope of action also changed. Featured Crew Tom Gerhardt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Gerhardt Dieter Krause Janine Kunze Carmen Krause Axel Stein Thomas „Tommie“ Krause Irene Schwarz Elisabeth \"Lisbeth\" Krause Full Cast & Crew Last Season Season 8 2010 | 8 Episodes Season 8 of Hausmeister Krause – Ordnung muss sein premiered on July 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hausmeister Krause – Ordnung muss sein. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  30m Homepage  - Genres Comedy Keywords slapstick Content Score 93 Almost there... Top Contributors b 23 batzemeister81 S 14 Samara c 7 chrissl e 2 editor12432  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}