{"link": "https://www.themoviedb.org/tv/1417?language=en", "title": "Glee", "resume": "Glee is an American teen musical comedy-drama television series that airs on the Fox network in the United States. It focuses on the reconstituted William McKinley High School glee club, New Directions, which competes on the show choir competition circuit while its disparate members deal with relationships, sexuality, social issues, and learning to become an effective team.", "rate": 59, "genre": ["Comedy", "Drama"], "cast": ["Lea Michele", "Naya Rivera", "Jenna Ushkowitz", "Kevin McHale", "Chris Colfer"], "character": ["Rachel Berry", "Santana Lopez", "Tina Cohen-Chang", "Artie Abrams", "Kurt Hummel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1417   Expand Glee   (2009) User Score Overview Glee is an American teen musical comedy-drama television series that airs on the Fox network in the United States. It focuses on the reconstituted William McKinley High School glee club, New Directions, which competes on the show choir competition circuit while its disparate members deal with relationships, sexuality, social issues, and learning to become an effective team. Featured Crew Ryan Murphy Creator Ian Brennan Creator Brad Falchuk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  1 Images Backdrops  47 Posters  29 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lea Michele Rachel Berry Naya Rivera Santana Lopez Jenna Ushkowitz Tina Cohen-Chang Kevin McHale Artie Abrams Chris Colfer Kurt Hummel Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 6 2015 | 13 Episodes Season 6 of Glee premiered on January  8, 2015. View All Seasons Social Reviews  1 Discussions  8 J A review by Joe  9.0 Written by  Joe  on March  4, 2017 Really good show :) I really like it how this show promotes music, and musical theatre, and really helps you know that being different isn't a bad thing at all! Nearly all the characters are likeable- it's unique too, I miss it now, but I rewatch it a lot! :) <3 Read All Reviews Media Most Popular Videos  0 Backdrops  47 Posters  29 Recommendations   2006-09-28 Ugly Betty 5.5    2006-10-11 30 Rock 7.1    2009-09-23 Cougar Town 5.8    2004-10-03 Desperate Housewives 6.6    1997-09-08 Ally McBeal 5.9    2000-10-05 Gilmore Girls 7.5    1996-01-09 3rd Rock from the Sun 7.3    1998-06-06 Sex and the City 5.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/glee/ Genres Comedy Drama Keywords high school aspiring singer music band teen drama glee club Content Score 93 Almost there... Top Contributors 500 dbowman 73 Travis Bell 44 Banana R 37 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}