{"link": "https://www.themoviedb.org/tv/63648?language=en", "title": "Death Note", "resume": "Light Yagami is an ordinary university student. One day, he receives a death note which changes his life. The death note awakens his warped sense of justice and genius. He becomes murderer Kira and punishes criminals. L is a well known private detective. L appears in front of Light Yagami. L defines Kira as evil and decides to catch Kira. Then N, who has a beautiful appearance but dangerous existence, appears.", "rate": 68, "genre": ["Crime", "Drama"], "cast": ["Masataka Kubota", "Kento Yamazaki", "Mio Yuki", "Hinako Sano", "Reiko Fujiwara"], "character": ["Yagami Light", "L", "N", "Amane Misa", "Yagami Sayu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63648   Expand Death Note   (2015) User Score Overview Light Yagami is an ordinary university student. One day, he receives a death note which changes his life. The death note awakens his warped sense of justice and genius. He becomes murderer Kira and punishes criminals. L is a well known private detective. L appears in front of Light Yagami. L defines Kira as evil and decides to catch Kira. Then N, who has a beautiful appearance but dangerous existence, appears. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masataka Kubota Yagami Light Kento Yamazaki L Mio Yuki N Hinako Sano Amane Misa Reiko Fujiwara Yagami Sayu Full Cast & Crew Last Season Season 1 2015 | 11 Episodes Season 1 of Death Note premiered on July  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2014-04-09 No Game, No Life 7.9    2014-01-05 Noragami 7.4    2016-07-12 Mob Psycho 100 8.1    2010-11-26 Young Justice 8.2    2015-01-10 Death Parade 7.3    2015-10-04 One-Punch Man 8.2    2011-04-06 Steins;Gate 8.2    2006-10-04 Death Note 8.2  Facts Original Name  デスノート Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.ntv.co.jp/drama-deathnote/ Genres Crime Drama Keywords japan based on manga Content Score 86 Almost there... Top Contributors M 46 Maria180493 16 Renato k 11 ktoswang 8 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}