{"link": "https://www.themoviedb.org/tv/6456?language=en", "title": "Free Spirit", "resume": "Free Spirit is an American fantasy sitcom that aired on ABC during the 1989–1990 television season. The series stars Corinne Bohrer as a witch who moves in with a recently divorced father to help care for his three children. Originally produced by ELP Communications, Free Spirit aired from September 22, 1989, to January 14, 1990.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Corinne Bohrer", "Alyson Hannigan", "Franc Luz", "Edan Gross"], "character": ["Jessie Harper", "Gene Harper"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6456   Expand Free Spirit   (1989) User Score Overview Free Spirit is an American fantasy sitcom that aired on ABC during the 1989–1990 television season. The series stars Corinne Bohrer as a witch who moves in with a recently divorced father to help care for his three children. Originally produced by ELP Communications, Free Spirit aired from September 22, 1989, to January 14, 1990. Featured Crew Leslie Ray Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corinne Bohrer Alyson Hannigan Jessie Harper Franc Luz Edan Gross Gene Harper Full Cast & Crew Last Season Season 1 1989 | 14 Episodes Season 1 of Free Spirit premiered on September 22, 1989. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Good Show Open 1 by  manfromatlantis Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Free Spirit. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 3 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}