{"link": "https://www.themoviedb.org/tv/6309?language=en", "title": "The Magician's House", "resume": "The Magician's House is a quartet of children's fantasy books by William Corlett. Two mini-series were produced in 1999 for British television, which were directed by Paul Lynch. The series featured Jennifer Saunders and Stephen Fry voicing some of the animal characters.\nThe books were published in the early 1990s, and named as follows:\n⁕The Steps up the Chimney\n⁕The Door in the Tree\n⁕The Tunnel behind the Waterfall\n⁕The Bridge in the Clouds\nAlthough in a rural setting, this series' focus on subjects such as industrial development and the combining of present-day and past settings in the plotline gives it a feeling tending more towards urban fantasy than simply contemporary fantasy.\nIn addition, though there is no specific mention of Welsh myths and legends, the strong part nature plays in the stories and the settings bring to mind other British children's authors. Authors like Alan Garner, who is perhaps best known for The Owl Service and Elidor, and Susan Cooper, famous for The Dark Is Rising sequence of books, who allude more specifically to British myth and legend in their writings.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Gary Martin", "Katie Stuart", "Ian Richardson", "Neil Pearson", "Jennifer Saunders"], "character": ["Cinnabar the Fox (voice)", "Mary Green", "Stephen Tyler", "Jack Green", "The Rat (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6309   Expand The Magician's House   (1999) User Score Overview The Magician's House is a quartet of children's fantasy books by William Corlett. Two mini-series were produced in 1999 for British television, which were directed by Paul Lynch. The series featured Jennifer Saunders and Stephen Fry voicing some of the animal characters. The books were published in the early 1990s, and named as follows: ⁕The Steps up the Chimney ⁕The Door in the Tree ⁕The Tunnel behind the Waterfall ⁕The Bridge in the Clouds Although in a rural setting, this series' focus on subjects such as industrial development and the combining of present-day and past settings in the plotline gives it a feeling tending more towards urban fantasy than simply contemporary fantasy. In addition, though there is no specific mention of Welsh myths and legends, the strong part nature plays in the stories and the settings bring to mind other British children's authors. Authors like Alan Garner, who is perhaps best known for The Owl Service and Elidor, and Susan Cooper, famous for The Dark Is Rising sequence of books, who allude more specifically to British myth and legend in their writings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Martin Cinnabar the Fox (voice) Katie Stuart Mary Green Ian Richardson Stephen Tyler Neil Pearson Jack Green Jennifer Saunders The Rat (voice) Full Cast & Crew Last Season Season 2 2000 | 6 Episodes Season 2 of The Magician's House premiered on November 12, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Magician's House. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords magic based on children's book Content Score 86 Almost there... Top Contributors 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}