{"link": "https://www.themoviedb.org/tv/19885?language=en", "title": "Sherlock", "resume": "A modern update finds the famous sleuth and his doctor partner solving crime in 21st century London.", "rate": 83, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Benedict Cumberbatch", "Martin Freeman", "Rupert Graves", "Mark Gatiss", "Una Stubbs"], "character": ["Sherlock Holmes", "John Watson", "Greg Lestrade", "Mycroft Holmes", "Mrs. Hudson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19885   Expand Sherlock   (2010) User Score  Play Trailer Overview A modern update finds the famous sleuth and his doctor partner solving crime in 21st century London. Featured Crew Mark Gatiss Creator Steven Moffat Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  3 Images Backdrops  38 Posters  29 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benedict Cumberbatch Sherlock Holmes Martin Freeman John Watson Rupert Graves Greg Lestrade Mark Gatiss Mycroft Holmes Una Stubbs Mrs. Hudson Full Cast & Crew Last Season Series 4 2017 | 3 Episodes View All Seasons Social Reviews  1 Discussions  19 I A review by Ibraheem...  9.0 Written by  Ibraheem...  on October 13, 2017 A great TV show. Of course it contains a huge amount of legendary smartness, yet you'll feel so clever the moment you start understanding what's happening. \nGlimpsing small clues and anticipating scenes, all by yourself, makes the thrill runs in your veins. I wish I could forget it just so I can see it all over again. Welcome to my amnesia list. Read All Reviews Media Most Popular Videos  1 Backdrops  38 Posters  29 Recommendations   2006-10-01 Dexter 8.0    2014-01-12 True Detective 8.1    2004-11-16 House 8.1    2013-02-01 House of Cards 8.2    2015-04-10 Marvel's Daredevil 7.7    2005-09-19 How I Met Your Mother 7.4    2004-09-22 Lost 7.8    2014-04-15 Fargo 8.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/programmes/b018ttws Genres Crime Drama Mystery Keywords london england based on novel or book detective investigation sherlock holmes murder crime private detective misanthropic murder mystery Content Score 100 Yes! Looking good! Top Contributors 127 Elizabeth Jennings 23 Koen Klaren 23 Imzadi 21 erikraul31  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}