{"link": "https://www.themoviedb.org/tv/9855?language=en", "title": "Police Story", "resume": "Police Story is an anthology television crime drama that aired on NBC from 1973 through 1978. The show was the brainchild of author and former policeman Joseph Wambaugh and represented a major step forward in the realistic depiction of police work and violence on network TV. It was produced by David Gerber and Mel Swope.\nAlthough it was an anthology, there were certain things that all episodes had in common; for instance, the main character in each episode was a police officer. The setting was always Los Angeles and the characters always worked for some branch of the LAPD. Notwithstanding the anthology format, there were recurring characters. Scott Brady appeared in more than a dozen episodes as \"Vinnie,\" a former cop who, upon retirement, had opened a bar catering to police officers, and who acted as a sort of Greek chorus during the run of the series, commenting on the characters and plots. Tony Lo Bianco and Don Meredith made several appearances as Robbery-Homicide Division partners Tony Calabrese and Bert Jameson. Other recurring characters included surveillance specialist Joe LaFrieda, played by Vic Morrow, and vice officer turned homicide detective Charlie Czonka, played by James Farentino. Chuck Connors also starred in various episodes.", "rate": 64, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9855   Expand Police Story   (1973) User Score  Play Trailer Overview Police Story is an anthology television crime drama that aired on NBC from 1973 through 1978. The show was the brainchild of author and former policeman Joseph Wambaugh and represented a major step forward in the realistic depiction of police work and violence on network TV. It was produced by David Gerber and Mel Swope. Although it was an anthology, there were certain things that all episodes had in common; for instance, the main character in each episode was a police officer. The setting was always Los Angeles and the characters always worked for some branch of the LAPD. Notwithstanding the anthology format, there were recurring characters. Scott Brady appeared in more than a dozen episodes as \"Vinnie,\" a former cop who, upon retirement, had opened a bar catering to police officers, and who acted as a sort of Greek chorus during the run of the series, commenting on the characters and plots. Tony Lo Bianco and Don Meredith made several appearances as Robbery-Homicide Division partners Tony Calabrese and Bert Jameson. Other recurring characters included surveillance specialist Joe LaFrieda, played by Vic Morrow, and vice officer turned homicide detective Charlie Czonka, played by James Farentino. Chuck Connors also starred in various episodes. Featured Crew Joseph Wambaugh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 1988 | 5 Episodes Season 6 of Police Story premiered on October 29, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   1982-09-26 Matt Houston 6.6    1978-11-10 Butterflies 6.9    1971-01-05 Alias Smith and Jones 6.2    1987-09-26 ChuckleVision 6.3    1975-04-04 The Good Life 7.0    1979-09-30 To the Manor Born 7.1    1974-09-02 Rising Damp 7.8    1966-09-12 The Monkees 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords police anthology Content Score 71 Just a little bit more... Top Contributors 11 lineker 8 Banana 3 Daemon R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}