{"link": "https://www.themoviedb.org/tv/35091?language=en", "title": "Poldark", "resume": "Period drama series about the brooding rivalry between former soldier Ross Poldark and local industrialist George Warleggan, and the two women in their lives. Based on the books by Winston Graham.", "rate": 53, "genre": ["Drama"], "cast": ["Ralph Bates", "Robin Ellis", "Jill Townsend", "Angharad Rees", "Clive Francis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35091   Expand Poldark   (1975) User Score Overview Period drama series about the brooding rivalry between former soldier Ross Poldark and local industrialist George Warleggan, and the two women in their lives. Based on the books by Winston Graham. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ralph Bates Robin Ellis Jill Townsend Angharad Rees Clive Francis Full Cast & Crew Last Season Season 2 1977 | 13 Episodes Season 2 of Poldark premiered on September 11, 1977. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Oldark or Newdark? Open 12 by  sheezcrazy Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Poldark. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres Drama Keywords england period drama costume drama Content Score 86 Almost there... Top Contributors 5 Elizabeth Jennings z 4 zurman1 i 2 ismago MD 1 Monkey D Mills  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}