{"link": "https://www.themoviedb.org/tv/33835?language=en", "title": "Strawberry Shortcake's Berry Bitty Adventures", "resume": "Welcome to Berry Bitty City, a berry special little world under the leaves of a berry patch. It may be small, but Berry Bitty City is big on fun and adventure. It's where Strawberry Shortcake and all her friends live. Together, they prove that little girls can do berry big things. There's always something fun to do, and when someone needs help, her friends are always there to lend a hand.", "rate": 70, "genre": ["Family", "Animation"], "cast": ["Anna Cummer", "Janyse Jaud", "Andrea Libman", "Ashleigh Ball", "Britt McKillip"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33835   Expand Strawberry Shortcake's Berry Bitty Adventures   (2010) User Score Overview Welcome to Berry Bitty City, a berry special little world under the leaves of a berry patch. It may be small, but Berry Bitty City is big on fun and adventure. It's where Strawberry Shortcake and all her friends live. Together, they prove that little girls can do berry big things. There's always something fun to do, and when someone needs help, her friends are always there to lend a hand. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Cummer Janyse Jaud Andrea Libman Ashleigh Ball Britt McKillip Full Cast & Crew Last Season Season 3 2013 | 13 Episodes Season 3 of Strawberry Shortcake's Berry Bitty Adventures premiered on February 23, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Strawberry Shortcake's Berry Bitty Adventures. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hubnetwork.com/shows/strawberry-shortcakes-berry-bitty-adventures Genres Family Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 16 Elizabeth Jennings c 8 chaoskas P 4 PistoletDor v 3 veboli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}