{"link": "https://www.themoviedb.org/tv/21013?language=en", "title": "Iljimae", "resume": "Iljimae is a 2008 South Korean historical action television drama series, starring Lee Joon-gi in the title role of Iljimae, Han Hyo-joo, Lee Young-ah and Park Si-hoo. It is loosely based on a comic strip Iljimae, published between 1975 and 1977, by Ko Woo-yung that was based on a Chinese folklore from the Ming dynasty about a masked Robin Hood-esque character during the Joseon era.\nIt was directed by Lee Yong-suk and produced by Chorokbaem Media. It aired on Seoul Broadcasting System from May 21 to July 24, 2008 on Wednesdays and Thursdays at 21:55 for 20 episodes.", "rate": 86, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lee Joon-gi", "Han Hyo-joo", "Park Shi Hoo", "Lee Young-ah", "Kim Sung-ryung"], "character": ["Iljimae", "Eun Chae", "Shi Hoo", "Bong Soon", "Dani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21013   Expand Iljimae   (2008) User Score  Play Trailer Overview Iljimae is a 2008 South Korean historical action television drama series, starring Lee Joon-gi in the title role of Iljimae, Han Hyo-joo, Lee Young-ah and Park Si-hoo. It is loosely based on a comic strip Iljimae, published between 1975 and 1977, by Ko Woo-yung that was based on a Chinese folklore from the Ming dynasty about a masked Robin Hood-esque character during the Joseon era. It was directed by Lee Yong-suk and produced by Chorokbaem Media. It aired on Seoul Broadcasting System from May 21 to July 24, 2008 on Wednesdays and Thursdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Joon-gi Iljimae Han Hyo-joo Eun Chae Park Shi Hoo Shi Hoo Lee Young-ah Bong Soon Kim Sung-ryung Dani Full Cast & Crew Last Season Season 1 2008 | 20 Episodes Season 1 of Iljimae premiered on May 21, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2012-01-04 Moon Embracing the Sun 8.4    2011-07-20 The Princess' Man 8.6    2012-03-21 Rooftop Prince 8.1    2015-11-16 Oh My Venus 7.8    2013-10-09 The Heirs 7.4    2009-10-07 You're Beautiful 7.9  Facts Original Name  일지매 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/iljimae/ Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 17 Maria180493 CM 11 Cherche Moi N 8 Nightowl.Kr t 5 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}