{"link": "https://www.themoviedb.org/tv/3283?language=en", "title": "Wild Palms", "resume": "Wild Palms is a five-hour mini-series which was produced by Greengrass Productions and first aired in May 1993 on the ABC network in the United States. The sci-fi drama, announced as an \"event series\", deals with the dangers of politically motivated abuse of mass media technology, virtual realities in particular. It was based on a comic strip written by Bruce Wagner and illustrated by Julian Allen first published in 1990 in Details magazine. Wagner, who also wrote the screenplay, served as executive producer together with Oliver Stone. The series stars James Belushi, Dana Delany, Robert Loggia, Kim Cattrall and Angie Dickinson. The episodes were directed by Kathryn Bigelow, Keith Gordon, Peter Hewitt and Phil Joanou.", "rate": 56, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Ben Savage", "Dana Delany", "Robert Loggia", "Bob Gunton", "David Warner"], "character": ["Coty Wyckoff", "Grace Wyckoff", "Sen. Anton Kreutzer", "Dr. Tobias Schenkl", "Eli Levitt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3283   Expand Wild Palms   (1993) User Score Overview Wild Palms is a five-hour mini-series which was produced by Greengrass Productions and first aired in May 1993 on the ABC network in the United States. The sci-fi drama, announced as an \"event series\", deals with the dangers of politically motivated abuse of mass media technology, virtual realities in particular. It was based on a comic strip written by Bruce Wagner and illustrated by Julian Allen first published in 1990 in Details magazine. Wagner, who also wrote the screenplay, served as executive producer together with Oliver Stone. The series stars James Belushi, Dana Delany, Robert Loggia, Kim Cattrall and Angie Dickinson. The episodes were directed by Kathryn Bigelow, Keith Gordon, Peter Hewitt and Phil Joanou. Featured Crew Oliver Stone Creator Bruce Wagner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Savage Coty Wyckoff Dana Delany Grace Wyckoff Robert Loggia Sen. Anton Kreutzer Bob Gunton Dr. Tobias Schenkl David Warner Eli Levitt Full Cast & Crew Last Season Season 1 1993 | 6 Episodes Season 1 of Wild Palms premiered on May 16, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1981-03-18 The Greatest American Hero 7.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  270m, 360m, 285m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords future technology based on comic thriller conspiracy miniseries cyberpunk cyberspace woman director Content Score 93 Almost there... Top Contributors TB 39 TMDb Bot 14 Banana 3 Raúl R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}