{"link": "https://www.themoviedb.org/tv/45046?language=en", "title": "Do No Harm", "resume": "Do No Harm is an American drama that aired from January 31 through September 7, 2013, on NBC. The network placed a series order in May 2012. On November 12, 2012, NBC reduced its episode order for the series from 13 to 12 episodes, due to scheduling conflicts.\nOn February 8, 2013, it was announced that NBC had canceled the series after airing two episodes, due to low ratings. On April 26, 2013, NBC announced that the remaining episodes would be burned off, beginning June 29, 2013.", "rate": 67, "genre": ["Drama"], "cast": ["Steven Pasquale", "Phylicia Rashād", "Ruta Gedmintas", "Alana de la Garza", "Michael Esper"], "character": ["Dr. Jason Cole / Ian Price", "Dr. Vanessa Young", "Olivia Flynn", "Dr. Lena Solis", "Dr. Kenneth Jordan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45046   Expand Do No Harm   (2013) User Score Overview Do No Harm is an American drama that aired from January 31 through September 7, 2013, on NBC. The network placed a series order in May 2012. On November 12, 2012, NBC reduced its episode order for the series from 13 to 12 episodes, due to scheduling conflicts. On February 8, 2013, it was announced that NBC had canceled the series after airing two episodes, due to low ratings. On April 26, 2013, NBC announced that the remaining episodes would be burned off, beginning June 29, 2013. Featured Crew David Schulner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Pasquale Dr. Jason Cole / Ian Price Phylicia Rashād Dr. Vanessa Young Ruta Gedmintas Olivia Flynn Alana de la Garza Dr. Lena Solis Michael Esper Dr. Kenneth Jordan Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Do No Harm premiered on January 31, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2013-01-22 Banshee: Origins 8.9    2013-09-23 Hostages 6.1    2010-06-20 The Gates 6.8    2012-10-11 Copper 6.0    2015-01-27 Stalker 5.8    2012-09-30 666 Park Avenue 6.1    2016-03-07 Damien 6.5    2011-01-17 Being Human 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Keywords doctor neurosurgeon mental disorders dissociative identity disorder Content Score 93 Almost there... Top Contributors 21 Banana 3 Tifar w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}