{"link": "https://www.themoviedb.org/tv/17507?language=en", "title": "10 Things I Hate About You", "resume": "Outspoken Kat Stratford couldn't be less like her sister, super sweet, yet kinda conformist Bianca. The only things they seem to have in common are being new at school and their overprotective dad.", "rate": 67, "genre": ["Comedy"], "cast": ["Lindsey Shaw", "Nicholas Braun", "Larry Miller", "Meaghan Jette Martin", "Chris Zylka"], "character": ["Kat Stratford", "Cameron James", "Dr. Walter Stratford", "Bianca Stratford", "Joey Donner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17507   Expand 10 Things I Hate About You   (2009) User Score Overview Outspoken Kat Stratford couldn't be less like her sister, super sweet, yet kinda conformist Bianca. The only things they seem to have in common are being new at school and their overprotective dad. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  14 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lindsey Shaw Kat Stratford Nicholas Braun Cameron James Larry Miller Dr. Walter Stratford Meaghan Jette Martin Bianca Stratford Chris Zylka Joey Donner Full Cast & Crew Last Season Season 1 2009 | 20 Episodes Season 1 of 10 Things I Hate About You premiered on July  7, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Fine, I'll be the first..... Open 3 by  MirrorMask Go to Discussions Media Most Popular Videos  0 Backdrops  14 Posters  2 Recommendations   2008-07-01 The Secret Life of the American Teenager 4.8    2014-04-29 Playing House 7.4    2005-01-09 Zoey 101 5.3    2004-03-12 Wonderfalls 7.8    2014-08-07 Garfunkel and Oates 7.5    2007-09-27 Secret Diary of a Call Girl 6.4    2013-02-28 Please Like Me 7.6    2009-11-09 Miranda 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://freeform.go.com/shows/10-things-i-hate-about-you Genres Comedy Keywords high school california sibling relationship based on movie overprotective parent teen drama Content Score 86 Almost there... Top Contributors 18 Banana S 7 SHADE02 S 4 Samara w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}