{"link": "https://www.themoviedb.org/tv/61170?language=en", "title": "Surplus Princess", "resume": "Can a woman do anything for the sake of love? Ha Ni (Jo Bo Ah) is a mermaid princess in the underwater empire but she longs for the human world when she sees and falls in love with a man. She transforms into a human and follows Hyun Myung (On Joo Wan) to live in a temporary house for people who are preparing for employment. The pragmatic Hyun Myung is trying to find a good-paying job to provide him with a comfortable life. But will he be distracted by Ha Ni, who has just 100 days to make Hyun Myung fall in love with her so that she can remain a human? “Surplus Princess,” also known as “The Mermaid,” is a 2014 South Korean drama series directed by Baek Seung Ryong.", "rate": 75, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Jo Bo-Ah", "Song Jae-rim", "On Ju-wan", "Ahn Gil-kang", "Kim Seul-Gi"], "character": ["Ha Ni", "Kwon Shi-kyung", "Lee Hyun-myung", "Ahn Ma-nyeo", "Ahn Hye-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61170   Expand Surplus Princess   (2014) User Score  Play Trailer Overview Can a woman do anything for the sake of love? Ha Ni (Jo Bo Ah) is a mermaid princess in the underwater empire but she longs for the human world when she sees and falls in love with a man. She transforms into a human and follows Hyun Myung (On Joo Wan) to live in a temporary house for people who are preparing for employment. The pragmatic Hyun Myung is trying to find a good-paying job to provide him with a comfortable life. But will he be distracted by Ha Ni, who has just 100 days to make Hyun Myung fall in love with her so that she can remain a human? “Surplus Princess,” also known as “The Mermaid,” is a 2014 South Korean drama series directed by Baek Seung Ryong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Bo-Ah Ha Ni Song Jae-rim Kwon Shi-kyung On Ju-wan Lee Hyun-myung Ahn Gil-kang Ahn Ma-nyeo Kim Seul-Gi Ahn Hye-young Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Surplus Princess premiered on August  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2014-05-05 Doctor Stranger 7.3    2013-12-09 The Prime Minister and I 7.1    2010-03-31 Personal Taste 7.4    2013-08-07 Master's Sun 7.7    2009-01-05 Boys Over Flowers 7.8  Facts Original Name  잉여공주 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  45m Homepage   program.interest.me/tvn/princess/ Genres Comedy Sci-Fi & Fantasy Keywords mermaid korea Content Score 93 Almost there... Top Contributors M 53 Maria180493 CM 8 Cherche Moi z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}