{"link": "https://www.themoviedb.org/tv/11918?language=en", "title": "Empire", "resume": "As Conqueror Julius Caesar is drawing his last breath, he swears Tyrannus—Rome's finest warrior—to an oath to protect his successor, Octavius, his 18-year-old nephew. Tyrannus and Octavius are forced into exile to protect the young man from those who want to sever Caesar's bloodline once and for all.", "rate": 55, "genre": ["Drama"], "cast": ["Christopher Egan", "Emily Blunt", "James Frain", "Jonathan Cake", "Michael Maloney"], "character": ["Agrippa", "Camane", "Brutus", "Tyrannus", "Cassius"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11918   Expand Empire   (2005) User Score Overview As Conqueror Julius Caesar is drawing his last breath, he swears Tyrannus—Rome's finest warrior—to an oath to protect his successor, Octavius, his 18-year-old nephew. Tyrannus and Octavius are forced into exile to protect the young man from those who want to sever Caesar's bloodline once and for all. Featured Crew Tom Wheeler Creator Chip Johannessen Creator William Wheeler Creator Sara B. Cooper Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Egan Agrippa Emily Blunt Camane James Frain Brutus Jonathan Cake Tyrannus Michael Maloney Cassius Full Cast & Crew Last Season Miniseries 2005 | 6 Episodes Season 1 of Empire premiered on June 27, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Empire. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   2003-03-16 Frank Herbert's Children of Dune 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  257m Homepage  - Genres Drama Keywords rome ancient rome historical drama julius caesar Content Score 93 Almost there... Top Contributors L 18 Lysator TB 17 TMDb Bot c 13 chispy 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}