{"link": "https://www.themoviedb.org/tv/2025?language=en", "title": "Beverly Hills, 90210", "resume": "Beverly Hills, 90210 followed the lives of a group of teenagers living in the upscale, star-studded community of Beverly Hills, California and attending the fictitious West Beverly Hills High School and, subsequently, the fictitious California University after graduation.", "rate": 59, "genre": ["Drama"], "cast": ["Brian Austin Green", "Ian Ziering", "Jennie Garth", "Tori Spelling", "Joe E. Tata"], "character": ["David Silver", "Steve Sanders", "Kelly Taylor", "Donna Martin", "Nat Bussichio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2025   Expand Beverly Hills, 90210   (1990) User Score  Play Trailer Overview Beverly Hills, 90210 followed the lives of a group of teenagers living in the upscale, star-studded community of Beverly Hills, California and attending the fictitious West Beverly Hills High School and, subsequently, the fictitious California University after graduation. Featured Crew Aaron Spelling Creator Darren Star Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Austin Green David Silver Ian Ziering Steve Sanders Jennie Garth Kelly Taylor Tori Spelling Donna Martin Joe E. Tata Nat Bussichio Full Cast & Crew Last Season Season 10 1999 | 27 Episodes View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply Top 5 Favorite Actresses from this Show? Open 1 by  MirrorMask Besides 90210, What Are Your Favorite TV Shows from That Era??? Open 1 by  MirrorMask M Any imdb board survivors on here yet? Open 16 by  Irina Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  1 Recommendations   1992-07-08 Melrose Place 4.9    1994-09-12 Party of Five 6.3    1998-01-20 Dawson's Creek 6.0    1997-09-08 Ally McBeal 5.9    1989-04-23 Baywatch 5.0    1986-09-22 ALF 6.9    1990-09-10 The Fresh Prince of Bel-Air 7.3    1987-09-22 Full House 5.9  Facts Status  Ended Network Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Drama Keywords california los angeles beverly hills teenage romance teen drama wealthy teens Content Score 100 Yes! Looking good! Top Contributors 39 Banana m 12 mode2 10 dzero z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}