{"link": "https://www.themoviedb.org/tv/1424?language=en", "title": "Orange Is the New Black", "resume": "A crime she committed in her youthful past sends Piper Chapman to a women's prison, where she trades her comfortable New York life for one of unexpected camaraderie and conflict in an eccentric group of fellow inmates.", "rate": 74, "genre": ["Comedy", "Drama"], "cast": ["Taylor Schilling", "Laura Prepon", "Danielle Brooks", "Diane Guerrero", "Jackie Cruz"], "character": ["Piper Chapman", "Alex Vause", "Tasha 'Taystee' Jefferson", "Maritza Ramos", "Marisol 'Flaca' Gonzales"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1424   Expand Orange Is the New Black   (2013) User Score  Play Trailer Overview A crime she committed in her youthful past sends Piper Chapman to a women's prison, where she trades her comfortable New York life for one of unexpected camaraderie and conflict in an eccentric group of fellow inmates. Featured Crew Jenji Kohan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  19 Images Backdrops  18 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Taylor Schilling Piper Chapman Laura Prepon Alex Vause Danielle Brooks Tasha 'Taystee' Jefferson Diane Guerrero Maritza Ramos Jackie Cruz Marisol 'Flaca' Gonzales Full Cast & Crew Next Season Season 6 2018 | 13 Episodes Season 6 of Orange Is the New Black is set to premiere on July 27, 2018. View All Seasons Social Reviews  0 Discussions  36 Subject Status Replies Last Reply No Love for This Series? Open 13 by  The Hydracubus Would they have really \"won\" the negotiations? Open 3 by  JustinJackFlash w Taystee: Happy Birthday Danielle Brooks! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  18 Posters  15 Recommendations   2013-02-01 House of Cards 8.2    2013-03-30 Orphan Black 7.6    2006-10-01 Dexter 8.0    2013-04-04 Hannibal 7.7    2005-08-07 Weeds 7.1    2007-07-19 Mad Men 8.0    2008-09-03 Sons of Anarchy 7.8    2008-09-07 True Blood 7.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   https://www.netflix.com/title/70242311 Genres Comedy Drama Keywords prison lesbian relationship crime lgbt women in prison prison life Content Score 100 Yes! Looking good! Top Contributors 79 Elizabeth Jennings 50 Banana 20 Ryan McCloskey D 18 Dirk1313  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}