{"link": "https://www.themoviedb.org/tv/70346?language=en", "title": "Guesthouse Daughters", "resume": "Guesthouse Daughters is a Korean variety show where five famous actresses and two famous comedians move in to a large guesthouse and live together. As they live together in the large guesthouse, they play various games and greet new celebrity guests. Guesthouse Daughters promises you to deliver natural looks of the famous celebrities.", "rate": 0, "genre": ["Comedy"], "cast": ["Park Soo-hong", "Lee Soo-geun", "Lee Mi-sook", "Lee Da-hae", "Park Si-yeon"], "character": ["Himself", "Himself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70346   Expand Guesthouse Daughters   (2017) User Score Overview Guesthouse Daughters is a Korean variety show where five famous actresses and two famous comedians move in to a large guesthouse and live together. As they live together in the large guesthouse, they play various games and greet new celebrity guests. Guesthouse Daughters promises you to deliver natural looks of the famous celebrities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Soo-hong Himself Lee Soo-geun Himself Lee Mi-sook Herself Lee Da-hae Herself Park Si-yeon Herself Full Cast & Crew Last Season Season 1 2017 | 5 Episodes Season 1 of Guesthouse Daughters premiered on February 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Guesthouse Daughters. You can help by rating TV shows you've seen. Facts Status  Planned Network Certification  - Type  Reality Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 mp4soju d 6 dwkblog S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}