{"link": "https://www.themoviedb.org/tv/46609?language=en", "title": "Upstairs Downstairs", "resume": "Set in 1936, the show takes viewers, old and new, back to the lavish world of Belgravia, London. A new set of occupants reside at 165 Eaton Place and viewers see how external and internal influences of the tumultuous pre-war period shape and mould the lives of this wealthy family and their servants.‬", "rate": 67, "genre": ["Drama"], "cast": ["Keeley Hawes", "Ed Stoppard", "Adrian Scarborough", "Neil Jackson", "Anne Reid"], "character": ["Lady Agnes Holland", "Sir Hallam Holland", "Mr. Warwick Pritchard", "Harry Spargo", "Mrs. Clarice Thackeray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46609   Expand Upstairs Downstairs   (2010) User Score Overview Set in 1936, the show takes viewers, old and new, back to the lavish world of Belgravia, London. A new set of occupants reside at 165 Eaton Place and viewers see how external and internal influences of the tumultuous pre-war period shape and mould the lives of this wealthy family and their servants.‬ Featured Crew Heidi Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keeley Hawes Lady Agnes Holland Ed Stoppard Sir Hallam Holland Adrian Scarborough Mr. Warwick Pritchard Neil Jackson Harry Spargo Anne Reid Mrs. Clarice Thackeray Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of Upstairs Downstairs premiered on February 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  3 Recommendations   1971-10-10 Upstairs, Downstairs 8.2    2014-09-21 Our Girl 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p00njdvp Genres Drama Keywords london england england servant scandal romance class differences intrigue racial issues upstairs downstairs 1930s domestic worker Content Score 93 Almost there... Top Contributors 21 Elizabeth Jennings 14 Banana M 11 Mr_Popeye 9 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}