{"link": "https://www.themoviedb.org/tv/21007?language=en", "title": "Fortysomething", "resume": "Fortysomething is a 2003 British comedy-drama series, starring and directed by Hugh Laurie as Paul Slippery, a doctor facing a mid-life crisis. His wife Estelle is starting a new career as a headhunter. His three sons, Rory, a student at the fictitious University of Reigate, Daniel and Edwin, are sex-obsessed. Meanwhile, Paul appears to hear the inner thoughts of others.\nOther important characters include Paul's colleague and nemesis, Dr. Ronnie Pilfrey, and Estelle's new employer, Gwendolen Hartley.\nThe series was written by Nigel Williams based on his 1999 novel of the same name. The six episodes of the series were broadcast on ITV. Although a ratings failure on first transmission, leading to it being moved to an off-peak timeslot midway through the run, the appearance of several actors who went on to greater fame has subsequently led the series to sell well on DVD.", "rate": 74, "genre": ["Comedy"], "cast": ["Hugh Laurie", "Benedict Cumberbatch", "Anna Chancellor", "Lolita Chakrabarti", "Sheila Hancock"], "character": ["Paul Slippery", "Rory Slippery"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21007   Expand Fortysomething   (2003) User Score Overview Fortysomething is a 2003 British comedy-drama series, starring and directed by Hugh Laurie as Paul Slippery, a doctor facing a mid-life crisis. His wife Estelle is starting a new career as a headhunter. His three sons, Rory, a student at the fictitious University of Reigate, Daniel and Edwin, are sex-obsessed. Meanwhile, Paul appears to hear the inner thoughts of others. Other important characters include Paul's colleague and nemesis, Dr. Ronnie Pilfrey, and Estelle's new employer, Gwendolen Hartley. The series was written by Nigel Williams based on his 1999 novel of the same name. The six episodes of the series were broadcast on ITV. Although a ratings failure on first transmission, leading to it being moved to an off-peak timeslot midway through the run, the appearance of several actors who went on to greater fame has subsequently led the series to sell well on DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Laurie Paul Slippery Benedict Cumberbatch Rory Slippery Anna Chancellor Lolita Chakrabarti Sheila Hancock Full Cast & Crew Last Season Season 1 2003 | 6 Episodes Season 1 of Fortysomething premiered on June 29, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2008-02-17 The Last Enemy 6.8    1999-02-23 Queer as Folk 8.0    2012-08-24 Parade's End 6.7    2014-09-30 Manhattan Love Story 6.2    2013-07-04 Free! 6.4    2010-12-25 Come Fly With Me 6.6    2000-09-19 My Family 7.2    2013-04-29 Vicious 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords family middle aged man british humour Content Score 86 Almost there... Top Contributors 5 galani O 5 Ozbourne N 4 NikolaiKras s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}