{"link": "https://www.themoviedb.org/tv/75959?language=en", "title": "Die Puppenspieler", "resume": "Helpless, the young convent student Richard has to watch as his mother Sarazenin Zobeida is condemned by the inquisitor Heinrich Institoris as a witch and burned at the stake. From then on, Richard swears revenge on Institoris for what he did to his family. He can escape and is taken by the merchant Jakob Fugger. He wants to teach him not only to seek blind revenge, but to manipulate people like puppets and thus to reach his goals. The two travel from Florence to Rome to influence the upcoming election of the pope and to witness the power struggle between the Medicis and the Borgias up close.", "rate": 46, "genre": ["Drama", "War", "Politics"], "cast": ["Lukás Bech", "Petr Cemper", "Cestmír Gebouský", "Jan Kubka", "Petr Motloch"], "character": ["Wachmann", "Richard jung", "Abt Michael", "Cleric", "Bischof Golser"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75959   Expand Die Puppenspieler   (2017) User Score Overview Helpless, the young convent student Richard has to watch as his mother Sarazenin Zobeida is condemned by the inquisitor Heinrich Institoris as a witch and burned at the stake. From then on, Richard swears revenge on Institoris for what he did to his family. He can escape and is taken by the merchant Jakob Fugger. He wants to teach him not only to seek blind revenge, but to manipulate people like puppets and thus to reach his goals. The two travel from Florence to Rome to influence the upcoming election of the pope and to witness the power struggle between the Medicis and the Borgias up close. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lukás Bech Wachmann Petr Cemper Richard jung Cestmír Gebouský Abt Michael Jan Kubka Cleric Petr Motloch Bischof Golser Full Cast & Crew Current Season Season 1 2017 | 2 Episodes Season 1 of Die Puppenspieler premiered on December 26, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Die Puppenspieler. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Die Puppenspieler. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  German Runtime  90m Homepage  - Genres Drama War & Politics Keywords miniseries Content Score 86 Almost there... Top Contributors L 37 Lemmy_6 TB 25 TMDb Bot 7 Banana D 1 Dirk74  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}