{"link": "https://www.themoviedb.org/tv/72745?language=en", "title": "Instinct", "resume": "Dr. Dylan Reinhart, a gifted author, university professor and former CIA operative is lured back to his old life by tenacious top NYPD Detective Lizzie Needham. Though Dylan and Lizzie initially clash, when it comes to catching killers, they make an ideal team.", "rate": 63, "genre": ["Crime", "Drama"], "cast": ["Alan Cumming", "Bojana Novaković", "Daniel Ings", "Naveen Andrews", "Sharon Leal"], "character": ["Dylan Reinhart", "Elizabeth 'Lizzie' Needham", "Andy", "Julian Cousins", "Jasmine Gooden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72745   Expand Instinct   (2018) User Score  Play Trailer Overview Dr. Dylan Reinhart, a gifted author, university professor and former CIA operative is lured back to his old life by tenacious top NYPD Detective Lizzie Needham. Though Dylan and Lizzie initially clash, when it comes to catching killers, they make an ideal team. Featured Crew Michael Rauch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Cumming Dylan Reinhart Bojana Novaković Elizabeth 'Lizzie' Needham Daniel Ings Andy Naveen Andrews Julian Cousins Sharon Leal Jasmine Gooden Full Cast & Crew Current Season Original Air Date Original Air Date Intended Order (Absolute) Season 1 2018 | 13 Episodes Season 1 of Instinct premiered on March 18, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply 10 minutes in and I'm scratching my head.. Open 3 by  bratface Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2017-10-13 Lore 6.1    2018-03-11 Deception 7.0    2018-01-21 The Resident 7.0    2018-03-29 Siren 7.3    2013-11-14 Ground Floor 6.1    2018-03-21 Krypton 6.5    2017-02-07 Imposters 7.6    2018-04-02 The Crossing 7.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  40m Homepage   http://www.cbs.com/shows/instinct/ Genres Crime Drama Keywords new york based on novel or book nypd murder investigation criminal consultant Content Score 100 Yes! Looking good! Top Contributors t 30 tmdb42368388 23 United600 21 Elizabeth Jennings 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}