{"link": "https://www.themoviedb.org/tv/61635?language=en", "title": "Remember Me", "resume": "Three-part contemporary ghost story set in Yorkshire. Tom Parfitt's arrival at a local retirement home leads to an eerie unexpected death.", "rate": 67, "genre": ["Drama", "Mystery"], "cast": ["Michael Palin", "Jodie Comer", "Mark Addy", "Mina Anwar", "Mayuri Boonham"], "character": ["Tom Parfitt", "Hannah Ward", "Rob Fairholme", "Roshana Salim", "Isha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61635   Expand Remember Me   (2014) User Score  Play Trailer Overview Three-part contemporary ghost story set in Yorkshire. Tom Parfitt's arrival at a local retirement home leads to an eerie unexpected death. Featured Crew Gwyneth Hughes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Palin Tom Parfitt Jodie Comer Hannah Ward Mark Addy Rob Fairholme Mina Anwar Roshana Salim Mayuri Boonham Isha Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of Remember Me premiered on November 23, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Genuinely weird and haunting British miniseries from 2014 Open 2 by  genplant29 Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2010-07-12 The Silence 6.8    2013-09-05 The Guilty 7.0    2004-07-19 The Grid 7.0    2013-02-27 Lightfields 7.5    2009-01-12 Unforgiven 7.4    2008-11-13 Apparitions 7.9    2011-02-03 Marchlands 7.4    2011-09-14 Free Agents 4.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b04tcbyb Genres Drama Mystery Keywords england water old man miniseries violent death ghost story seashore retirement home mysterious photo strange event seashell Content Score 100 Yes! Looking good! Top Contributors 37 Elizabeth Jennings 19 genplant29 TB 11 TMDb Bot 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}