{"link": "https://www.themoviedb.org/tv/75486?language=en", "title": "Freedom Fighters: The Ray", "resume": "Reporter Raymond \"Ray\" Terrill is investigating a group of government scientists who are developing a weapon using light, when he is attacked with a \"genetic light bomb\" that ends up bestowing him with light-based super powers.", "rate": 0, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Russell Tovey", "Jason Mitchell", "Dilshad Vadsaria", "Sunil Malhotra", "Colleen O'Shaughnessey"], "character": ["Ray Terrill / The Ray (voice)", "John Trujillo / Black Condor (voice)", "Jenny Knight / Phantom Lady (voice)", "Jacob (voice)", "Mrs. Terrill (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75486   Expand Freedom Fighters: The Ray   (2017) User Score Overview Reporter Raymond \"Ray\" Terrill is investigating a group of government scientists who are developing a weapon using light, when he is attacked with a \"genetic light bomb\" that ends up bestowing him with light-based super powers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russell Tovey Ray Terrill / The Ray (voice) Jason Mitchell John Trujillo / Black Condor (voice) Dilshad Vadsaria Jenny Knight / Phantom Lady (voice) Sunil Malhotra Jacob (voice) Colleen O'Shaughnessey Mrs. Terrill (voice) Full Cast & Crew Current Season Season 1 2017 | 6 Episodes Season 1 of Freedom Fighters: The Ray premiered on December  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Freedom Fighters: The Ray. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  6m Homepage   http://www.cwseed.com/shows/freedom-fighters-the-ray Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords dc comics superhero based on comic Content Score 86 Almost there... Top Contributors R 33 Rebecca 21 Claudio Sanhueza a 2 atom100 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}