{"link": "https://www.themoviedb.org/tv/1255?language=en", "title": "October Road", "resume": "When Nick Garrett was 18, he packed up his truck and said goodbye for a summer road trip that turned into 10 years of being away. He has since become a literary celebrity in New York, living off the fame and fortune of his best-selling novel and movie, based on his hometown friends. To the literary world, Nick defined a generation, but to his hometown, he betrayed them by sharing secrets. Now, without inspiration for a new book, Nick returns to his hometown to find that feelings toward him have changed.", "rate": 70, "genre": ["Drama"], "cast": ["Bryan Greenberg", "Laura Prepon", "Tom Berenger", "Warren Christie", "Brad William Henke"], "character": ["Nick Garrett", "Hannah Daniels", "The Commander", "Ray 'Big Cat' Cataldo", "Owen Rowan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1255   Expand October Road   (2007) User Score Overview When Nick Garrett was 18, he packed up his truck and said goodbye for a summer road trip that turned into 10 years of being away. He has since become a literary celebrity in New York, living off the fame and fortune of his best-selling novel and movie, based on his hometown friends. To the literary world, Nick defined a generation, but to his hometown, he betrayed them by sharing secrets. Now, without inspiration for a new book, Nick returns to his hometown to find that feelings toward him have changed. Featured Crew Scott Rosenberg Creator André Nemec Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bryan Greenberg Nick Garrett Laura Prepon Hannah Daniels Tom Berenger The Commander Warren Christie Ray 'Big Cat' Cataldo Brad William Henke Owen Rowan Full Cast & Crew Last Season Season 2 2007 | 13 Episodes Season 2 of October Road premiered on November 22, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on October Road. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/shows/october-road Genres Drama Keywords small town massachusetts writer hometown Content Score 93 Almost there... Top Contributors 32 Banana 4 Zlogorek 4 Stan Smith w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}