{"link": "https://www.themoviedb.org/tv/2152?language=en", "title": "Wishbone", "resume": "Wishbone is a children's television show that aired from 1995 to 1997 in the United States. The show's title character is a Jack Russell Terrier of the same name. Wishbone lives with his owner Joe Talbot in the fictional modern town of Oakdale, Texas. He daydreams about being the lead character of stories from classic literature He was known as \"the little dog with a big imagination\". Only the viewers and the characters in his daydreams can hear Wishbone speak. The characters from his daydreams see Wishbone as whatever famous character he is currently portraying and not as a dog. The show won four Daytime Emmies, a Peabody Award, and honors from the Television Critics Association. Wishbone's exterior shots were filmed on the backlot of Lyrick Studios's teen division Big Feats! Entertainment in Allen, Texas, and its interior shots were filmed on a sound stage in a 50,000 square foot warehouse in Plano, Texas.\nThe theme song was written by Tim Cissell and Lynn Adler.\nThis show garnered particular praise for refusing to bowdlerise many of the sadder or more unpleasant aspects of the source works, which usually enjoyed a fairly faithful retelling in the fantasy sequences.", "rate": 80, "genre": ["Family", "Action", "Adventure", "Comedy"], "cast": ["Mary Chris Wall", "Larry Brantley", "Christie Abbott", "Adam Springfield", "Julio Cedillo"], "character": ["Ellen Talbot", "Wishbone", "Sam Kepler", "David Barnes", "Travis del Rio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2152   Expand Wishbone   (1995) User Score Overview Wishbone is a children's television show that aired from 1995 to 1997 in the United States. The show's title character is a Jack Russell Terrier of the same name. Wishbone lives with his owner Joe Talbot in the fictional modern town of Oakdale, Texas. He daydreams about being the lead character of stories from classic literature He was known as \"the little dog with a big imagination\". Only the viewers and the characters in his daydreams can hear Wishbone speak. The characters from his daydreams see Wishbone as whatever famous character he is currently portraying and not as a dog. The show won four Daytime Emmies, a Peabody Award, and honors from the Television Critics Association. Wishbone's exterior shots were filmed on the backlot of Lyrick Studios's teen division Big Feats! Entertainment in Allen, Texas, and its interior shots were filmed on a sound stage in a 50,000 square foot warehouse in Plano, Texas. The theme song was written by Tim Cissell and Lynn Adler. This show garnered particular praise for refusing to bowdlerise many of the sadder or more unpleasant aspects of the source works, which usually enjoyed a fairly faithful retelling in the fantasy sequences. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Chris Wall Ellen Talbot Larry Brantley Wishbone Christie Abbott Sam Kepler Adam Springfield David Barnes Julio Cedillo Travis del Rio Full Cast & Crew Last Season Season 2 1997 | 10 Episodes Season 2 of Wishbone premiered on March  3, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1996-09-02 Arthur 6.7    1993-09-10 Bill Nye The Science Guy 7.3    1991-08-11 Doug 7.0    1991-09-08 Darkwing Duck 7.3    1998-08-05 Whose Line Is It Anyway? 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Action & Adventure Comedy Keywords dog overflowing with imagination Content Score 86 Almost there... Top Contributors 14 Banana 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}