{"link": "https://www.themoviedb.org/tv/73551?language=en", "title": "Survivor", "resume": "Hungarian version of the reality contest where a group of castaways split between two or more “Tribes” are taken to a remote isolated location and are forced to live off the land with meager supplies. Frequent physical challenges are used to pit the tribes against each other for rewards, such as food or luxuries, or for “Immunity”, forcing the other tribe to attend “Tribal Council”, where they must vote off one of their players.", "rate": 42, "genre": ["Action", "Adventure", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73551   Expand Survivor   (2017) User Score Overview Hungarian version of the reality contest where a group of castaways split between two or more “Tribes” are taken to a remote isolated location and are forced to live off the land with meager supplies. Frequent physical challenges are used to pit the tribes against each other for rewards, such as food or luxuries, or for “Immunity”, forcing the other tribe to attend “Tribal Council”, where they must vote off one of their players. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 35 Episodes Season 1 of Survivor premiered on August 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Survivor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  Hungarian Runtime  50m Homepage   http://rtl.hu/rtlklub/survivor Genres Action & Adventure Reality Keywords island Content Score 64 We're so close, yet so far. Top Contributors 33 kbogesz 5 Elizabeth Jennings t 4 tcsaba E 2 Ezequiel98  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}