{"link": "https://www.themoviedb.org/tv/13925?language=en", "title": "Ellery Queen", "resume": "Ellery Queen is an American television detective mystery series based on the fictional character Ellery Queen. It aired on NBC during the 1975-76 television season and stars Jim Hutton as Ellery Queen, David Wayne as his father, Inspector Richard Queen, and Tom Reese as Sgt. Velie. Created by the writing/producing team of Richard Levinson and William Link, the title character \"breaks\" the fourth wall to ask the audience to consider their solution.", "rate": 90, "genre": ["Mystery", "Drama"], "cast": ["David Wayne", "Jim Hutton", "Tom Reese"], "character": ["Inspector Richard Queen", "Ellery Queen", "Sgt. Thomas Velie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13925   Expand Ellery Queen   (1975) User Score Overview Ellery Queen is an American television detective mystery series based on the fictional character Ellery Queen. It aired on NBC during the 1975-76 television season and stars Jim Hutton as Ellery Queen, David Wayne as his father, Inspector Richard Queen, and Tom Reese as Sgt. Velie. Created by the writing/producing team of Richard Levinson and William Link, the title character \"breaks\" the fourth wall to ask the audience to consider their solution. Featured Crew William Link Creator Richard Levinson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Wayne Inspector Richard Queen Jim Hutton Ellery Queen Tom Reese Sgt. Thomas Velie Full Cast & Crew Last Season Season 1 1975 | 24 Episodes Season 1 of Ellery Queen premiered on March 23, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1974-03-27 The Rockford Files 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Mystery Drama Keywords new york detective writer nypd post world war ii murder investigation 1940s Content Score 64 We're so close, yet so far. Top Contributors 22 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}