{"link": "https://www.themoviedb.org/tv/3821?language=en", "title": "Full House: Rags to Riches", "resume": "Rags to Riches is an American musical comedy drama series that was broadcast on NBC for two seasons from 1987 to 1988. Set in the 1960s, the series tells the story of Nick Foley, a self-made millionaire who adopts five orphan girls. Each episode included music videos of hit songs from the era sung by the cast integrated into the plot.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Tisha Campbell-Martin", "Joseph Bologna", "Heidi Zeigler", "Douglas Seale", "Kimiko Gelman"], "character": ["Marva Foley", "Nick Foley", "Mickey Foley", "John Clapper", "Rose Foley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3821   Expand Full House: Rags to Riches   (1987) User Score Overview Rags to Riches is an American musical comedy drama series that was broadcast on NBC for two seasons from 1987 to 1988. Set in the 1960s, the series tells the story of Nick Foley, a self-made millionaire who adopts five orphan girls. Each episode included music videos of hit songs from the era sung by the cast integrated into the plot. Featured Crew Bernie Kukoff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tisha Campbell-Martin Marva Foley Joseph Bologna Nick Foley Heidi Zeigler Mickey Foley Douglas Seale John Clapper Kimiko Gelman Rose Foley Full Cast & Crew Last Season Season 2 1987 | 15 Episodes Season 2 of Full House: Rags to Riches premiered on October  2, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1982-01-07 Fame 6.5    1996-09-21 Profiler 6.5    1972-09-14 The Waltons 6.6    1987-09-25 Beauty and the Beast 7.4    1984-09-19 Highway to Heaven 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m, 45m Homepage  - Genres Comedy Drama Keywords music wealthy los angeles orphan wealthy man bel air 1960s Content Score 79 Pump it up! We're close now. Top Contributors 25 Banana G 8 Ghostrider34 CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}