{"link": "https://www.themoviedb.org/tv/75310?language=en", "title": "Jugglers", "resume": "Jwa Yoon-Yi has lived her life with a passive attitude. She has a spirit of devotion and obedience. Nam Chi-Won is the director of HB Company, but he refuses interests of other people and developing relationships. The woman and man meet as secretary and boss.", "rate": 80, "genre": ["Comedy"], "cast": ["Choi Daniel", "Baek Jin-hee", "Kang Hye-jung", "Lee Won-keun", "Cha Joo-Young"], "character": ["Nam Chi-Won", "Jwa Yoon-Yi", "Wang Jung-Ae", "Hwangbo Yool", "Ma Bo-Na"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75310   Expand Jugglers   (2017) User Score Overview Jwa Yoon-Yi has lived her life with a passive attitude. She has a spirit of devotion and obedience. Nam Chi-Won is the director of HB Company, but he refuses interests of other people and developing relationships. The woman and man meet as secretary and boss. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Daniel Nam Chi-Won Baek Jin-hee Jwa Yoon-Yi Kang Hye-jung Wang Jung-Ae Lee Won-keun Hwangbo Yool Cha Joo-Young Ma Bo-Na Full Cast & Crew Current Season Season 1 2017 | 16 Episodes Season 1 of Jugglers premiered on December  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jugglers. You can help by rating TV shows you've seen. Facts Original Name  저글러스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  64m Homepage   http://www.kbs.co.kr/drama/jugglers/ Genres Comedy Keywords workplace romance Content Score 86 Almost there... Top Contributors M 42 Maria180493 6 Elizabeth Jennings 3 andermairena 1 kbogesz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}