{"link": "https://www.themoviedb.org/tv/60866?language=en", "title": "iZombie", "resume": "A medical student who becomes a zombie joins a Coroner's Office in order to gain access to the brains she must reluctantly eat so that she can maintain her humanity. But every brain she eats, she also inherits their memories and must now solve their deaths with help from the Medical examiner and a police detective.", "rate": 70, "genre": ["Horror", "Drama", "Crime", "Sci-Fi", "Fantasy"], "cast": ["Rose McIver", "David Anders", "Robert Buckley", "Malcolm Goodwin", "Rahul Kohli"], "character": ["Olivia \"Liv\" Moore", "Blaine DeBeers", "Major Lilywhite", "Clive Babinaux", "Ravi Chakrabarti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60866   Expand iZombie   (2015) User Score  Play Trailer Overview A medical student who becomes a zombie joins a Coroner's Office in order to gain access to the brains she must reluctantly eat so that she can maintain her humanity. But every brain she eats, she also inherits their memories and must now solve their deaths with help from the Medical examiner and a police detective. Featured Crew Rob Thomas Creator Diane Ruggiero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  13 Content Issues  1 Images Backdrops  14 Posters  19 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Rose McIver Olivia \"Liv\" Moore David Anders Blaine DeBeers Robert Buckley Major Lilywhite Malcolm Goodwin Clive Babinaux Rahul Kohli Ravi Chakrabarti Full Cast & Crew Current Season Season 4 2018 | 13 Episodes Season 4 of iZombie premiered on February 25, 2018. View All Seasons Social Reviews  1 Discussions  14 L A review by Lloyd Written by  Lloyd  on August  9, 2017 Wonderful show. I like Rose McIver who I remember from the Power Rangers.  This show is a drama but it has funny moments at times which makes it fun to watch. Love Rose and her character. Read All Reviews Media Most Popular Videos  2 Backdrops  14 Posters  19 Recommendations   2015-11-20 Marvel's Jessica Jones 7.6    2015-05-14 Wayward Pines 6.5    2013-03-30 Orphan Black 7.6    2014-09-12 Z Nation 6.4    2014-07-13 The Strain 6.6    2013-09-17 Brooklyn Nine-Nine 7.5    2013-09-16 Sleepy Hollow 6.4    2009-07-07 Warehouse 13 7.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m, 42m Homepage   http://www.cwtv.com/shows/izombie Genres Horror Drama Crime Sci-Fi & Fantasy Keywords dc comics morgue based on comic female protagonist zombie based on graphic novel coroner crime investigation medical examination Content Score 100 Yes! Looking good! Top Contributors 53 Elizabeth Jennings R 53 Rebecca 39 benf45 24 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}