{"link": "https://www.themoviedb.org/tv/35086?language=en", "title": "Alaska State Troopers", "resume": "Alaska State Troopers is an American documentary television series on the National Geographic Channel narrated by Marc Graue. The show primarily follows the daily beats of various bureaus within the Alaska State Troopers. In addition, the show features segments that follow village public safety officers from small rural villages as well as officers from other cities such as the Wasilla, Palmer, Anchorage, and Soldotna. The series premiered on October 14, 2009.\nThe show follows the exploits of a number of officers from all regions of the state. Troopers who are seen on the show include: James and Anne Sears, Howie Peterson, Jon Simeon and Brent Johnson, Scott Quist, Odean Hall, Lonny Piscoya, Luis Nieves, Dan Dahl, Rick Roberts, Abraham Garcia, Dan Cox, Gabe Rich, Jonathan Stroebele, Joshua Varys, Daron Cooper, Lance Ewers, and Kamau Leigh.\nIn 2011, a litter of Blue Heeler puppies were dropped off anonymously at a dog shelter in Kentucky. The two males were named \"Trooper Dan Dahl\" and \"Trooper Howie Peterson\", after the Troopers on the show. The female dogs were named after Troopers Aileen Witrosky, Amy Bowen and Anne Sears, who have all been featured on the show.\nAlthough the show is aired in many countries, the National Geographic Channel has so far not released DVDs of the series outside of the United States.", "rate": 77, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35086   Expand Alaska State Troopers   (2009) User Score Overview Alaska State Troopers is an American documentary television series on the National Geographic Channel narrated by Marc Graue. The show primarily follows the daily beats of various bureaus within the Alaska State Troopers. In addition, the show features segments that follow village public safety officers from small rural villages as well as officers from other cities such as the Wasilla, Palmer, Anchorage, and Soldotna. The series premiered on October 14, 2009. The show follows the exploits of a number of officers from all regions of the state. Troopers who are seen on the show include: James and Anne Sears, Howie Peterson, Jon Simeon and Brent Johnson, Scott Quist, Odean Hall, Lonny Piscoya, Luis Nieves, Dan Dahl, Rick Roberts, Abraham Garcia, Dan Cox, Gabe Rich, Jonathan Stroebele, Joshua Varys, Daron Cooper, Lance Ewers, and Kamau Leigh. In 2011, a litter of Blue Heeler puppies were dropped off anonymously at a dog shelter in Kentucky. The two males were named \"Trooper Dan Dahl\" and \"Trooper Howie Peterson\", after the Troopers on the show. The female dogs were named after Troopers Aileen Witrosky, Amy Bowen and Anne Sears, who have all been featured on the show. Although the show is aired in many countries, the National Geographic Channel has so far not released DVDs of the series outside of the United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2014 | 11 Episodes Season 6 of Alaska State Troopers premiered on August 19, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2016-10-12 Nurses Who Kill 7.3    2016-05-11 Killer Women with Piers Morgan 7.5    2012-09-17 Unsealed: Alien Files 5.4  Facts Status  Cancelled Network Certification  - Type  Reality Original Language  English Runtime  60m, 42m Homepage   http://www.channel.nationalgeographic.com/series/alaska-state-troopers/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 6 Elizabeth Jennings TB 3 TMDb Bot c 2 cffm s 2 sn3p  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}