{"link": "https://www.themoviedb.org/tv/76124?language=en", "title": "School Babysitters", "resume": "After their parents are killed in a plane crash, Ryuuichi and his younger brother Kotarou are taken in by the chairman, who they never met before, of an elite academy. Ryuuichi becomes the school daycare's new babysitter.", "rate": 77, "genre": ["Animation", "Comedy"], "cast": ["Miyadera Tomoko", "Oota Motohiro", "Yuuichirou Umehara", "Yuuko Sanpei", "Nozomi Furuki"], "character": ["Morinomiya Youko", "Nezu Chuukichi", "Kamitani Hayato", "Kamitani Taka", "Kashima Kotarou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76124   Expand School Babysitters   (2018) User Score  Play Trailer Overview After their parents are killed in a plane crash, Ryuuichi and his younger brother Kotarou are taken in by the chairman, who they never met before, of an elite academy. Ryuuichi becomes the school daycare's new babysitter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyadera Tomoko Morinomiya Youko Oota Motohiro Nezu Chuukichi Yuuichirou Umehara Kamitani Hayato Yuuko Sanpei Kamitani Taka Nozomi Furuki Kashima Kotarou Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of School Babysitters premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on School Babysitters. You can help by rating TV shows you've seen. Facts Original Name  学園ベビーシッターズ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://gakubaby-anime.com/ Genres Animation Comedy Keywords slice of life school based on manga shoujo anime Content Score 93 Almost there... Top Contributors 29 sp1ti 12 neonime D 9 Destr0y d 5 diabolikfansub  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}