{"link": "https://www.themoviedb.org/tv/8650?language=en", "title": "Life in the Undergrowth", "resume": "Life in the Undergrowth is a BBC nature documentary series written and presented by David Attenborough, first transmitted in the UK from 23 November 2005.\nA study of the evolution and habits of invertebrates, it was the fifth of Attenborough's specialised surveys following his major trilogy that began with Life on Earth. Each of the five 50-minute episodes looks at a group of the creatures using innovative photographic techniques.\nThe series was produced in conjunction with Animal Planet. The executive producer was Mike Gunton, the series producer Mike Salisbury, and the music was composed by Ben Salisbury and David Poore. The Chief Scientific Consultant was Dr. George McGavin.\nWithin David Attenborough's 'Life' series, it was preceded by The Life of Mammals, and is followed by Life in Cold Blood. Before the latter, Attenborough narrated Planet Earth. In May–June 2006, he also presented a two-part documentary on global warming: the programmes were entitled Are We Changing Planet Earth? and Can We Save Planet Earth?.", "rate": 84, "genre": ["Documentary"], "cast": ["David Attenborough"], "character": ["himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8650   Expand Life in the Undergrowth   (2005) User Score  Play Trailer Overview Life in the Undergrowth is a BBC nature documentary series written and presented by David Attenborough, first transmitted in the UK from 23 November 2005. A study of the evolution and habits of invertebrates, it was the fifth of Attenborough's specialised surveys following his major trilogy that began with Life on Earth. Each of the five 50-minute episodes looks at a group of the creatures using innovative photographic techniques. The series was produced in conjunction with Animal Planet. The executive producer was Mike Gunton, the series producer Mike Salisbury, and the music was composed by Ben Salisbury and David Poore. The Chief Scientific Consultant was Dr. George McGavin. Within David Attenborough's 'Life' series, it was preceded by The Life of Mammals, and is followed by Life in Cold Blood. Before the latter, Attenborough narrated Planet Earth. In May–June 2006, he also presented a two-part documentary on global warming: the programmes were entitled Are We Changing Planet Earth? and Can We Save Planet Earth?. Featured Crew David Attenborough Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  9 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Attenborough himself Full Cast & Crew Last Season Miniseries 2005 | 5 Episodes Season 1 of Life in the Undergrowth premiered on November 23, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Life in the Undergrowth. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  4 Recommendations   1990-10-04 The Trials of Life 9.5    2002-11-20 The Life of Mammals 9.1    1984-01-19 The Living Planet 9.1    2009-02-11 Nature's Great Events 8.4    2010-03-16 Richard Hammond's Invisible Worlds 7.6    1993-11-18 Life in the Freezer 9.2    2011-10-26 Frozen Planet 8.3    2001-09-12 The Blue Planet 8.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 50m Homepage   http://www.bbc.co.uk/sn/tvradio/programmes/lifeintheundergrowth/ Genres Documentary Keywords insect wildlife miniseries animal nature nature documentary Content Score 71 Just a little bit more... Top Contributors TB 23 TMDb Bot 10 waaw R 7 Rebecca D 4 Dan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}