{"link": "https://www.themoviedb.org/tv/58936?language=en", "title": "Mystery Diners", "resume": "What happens in the food world when a bad employee starts to take down an otherwise thriving establishment or when restaurant owners suspect someone of not doing their job appropriately? They call in the Mystery Diners. These undercover operatives go into restaurants, bars and food service establishments with hidden cameras to find out what's really going on when the boss isn't around.", "rate": 12, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58936   Expand Mystery Diners User Score  Play Trailer Overview What happens in the food world when a bad employee starts to take down an otherwise thriving establishment or when restaurant owners suspect someone of not doing their job appropriately? They call in the Mystery Diners. These undercover operatives go into restaurants, bars and food service establishments with hidden cameras to find out what's really going on when the boss isn't around. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 11 2015 | 11 Episodes Season 11 of Mystery Diners premiered on November  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  21m Homepage   http://www.foodnetwork.com/shows/mystery-diners.html Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 9 Elizabeth Jennings D 9 Damienlee69 s 3 servia a 3 apung21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}