{"link": "https://www.themoviedb.org/tv/1644?language=en", "title": "The Collector", "resume": "The Collector is a Canadian supernatural drama television series about a man attempting to help save people who have bargained their souls with the Devil. After over 600 years of \"collecting\" the souls of people at the end of their 10-year deals, Morgan Pym negotiates with the Devil for the ability to aid the damned in redeeming themselves rather than sending them to Hell. Under the Devil's mocking gaze, Morgan assists his \"clients\" in undoing the damage their deals have done because of the devil shifting good luck towards the client and away from others.\nThe series is set in Vancouver, British Columbia, Canada, where it was also filmed. CHUM cancelled the program after three seasons.", "rate": 54, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Carly Pope", "Christine Chatelain", "Ellen Dubin", "Aidan Drummond", "Chris Kramer"], "character": ["Maya Kandinski", "Taylor Slate", "Jeri Slate", "Gabriel Slate", "Morgan Pym"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1644   Expand The Collector   (2004) User Score Overview The Collector is a Canadian supernatural drama television series about a man attempting to help save people who have bargained their souls with the Devil. After over 600 years of \"collecting\" the souls of people at the end of their 10-year deals, Morgan Pym negotiates with the Devil for the ability to aid the damned in redeeming themselves rather than sending them to Hell. Under the Devil's mocking gaze, Morgan assists his \"clients\" in undoing the damage their deals have done because of the devil shifting good luck towards the client and away from others. The series is set in Vancouver, British Columbia, Canada, where it was also filmed. CHUM cancelled the program after three seasons. Featured Crew Ali Marie Matheson Creator Jon Cooksey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carly Pope Maya Kandinski Christine Chatelain Taylor Slate Ellen Dubin Jeri Slate Aidan Drummond Gabriel Slate Chris Kramer Morgan Pym Full Cast & Crew Last Season Season 3 2006 | 13 Episodes Season 3 of The Collector premiered on January 10, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1996-02-24 The Spooktacular New Adventures of Casper 4.4    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    2001-10-06 Mutant X 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.thecollectortv.com/ Genres Drama Sci-Fi & Fantasy Keywords canada devil saving lives reference to god Content Score 93 Almost there... Top Contributors z 8 zurman1 8 Banana S 4 SoyPlaymx 3 galani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}