{"link": "https://www.themoviedb.org/tv/13703?language=en", "title": "07 zgłoś się", "resume": "07 zgłoś się was a highly popular Polish criminal television series broadcast on TVP between 1976 and 1987. The series consists of twenty-one 60-minute Polish language episodes, divided into five seasons - filmed in 1976, 1978, 1981, 1984 and 1987. It combines elements of action film and police procedural genres.\nDirected by Krzysztof Szmagier, it centres around the investigations of Police Lieutenant Sławomir Borewicz. Each episode features a different case being solved by Borewicz. The series was loosely based on a novel series Ewa wzywa 07. The title of both the novels and the TV series refers to \"O-Seven\", a police radio call-sign used by Borewicz.\nDespite being widely considered a work of propaganda aimed at warming the image of \"Citizen's Militia\", the series proved highly popular in Poland and even gained a cult following. Critics consider it \"one of the biggest achievements of Polish crime drama\" the \"raw and realist response to >silly< Bond\", and \"the most popular Polish police series ever\". While taking place in Poland of the 1970s and 1980s, the series featured many elements of western lifestyle, mostly unavailable to ordinary Poles. Borewicz wears American clothes, drives German cars and often fights international criminal gangs.", "rate": 90, "genre": ["Drama", "Crime"], "cast": ["Bronisław Cieślak", "Zdzisław Tobiasz"], "character": ["porucznik Sławomir Borewicz", "major Wołczyk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13703   Expand 07 zgłoś się   (1976) User Score Overview 07 zgłoś się was a highly popular Polish criminal television series broadcast on TVP between 1976 and 1987. The series consists of twenty-one 60-minute Polish language episodes, divided into five seasons - filmed in 1976, 1978, 1981, 1984 and 1987. It combines elements of action film and police procedural genres. Directed by Krzysztof Szmagier, it centres around the investigations of Police Lieutenant Sławomir Borewicz. Each episode features a different case being solved by Borewicz. The series was loosely based on a novel series Ewa wzywa 07. The title of both the novels and the TV series refers to \"O-Seven\", a police radio call-sign used by Borewicz. Despite being widely considered a work of propaganda aimed at warming the image of \"Citizen's Militia\", the series proved highly popular in Poland and even gained a cult following. Critics consider it \"one of the biggest achievements of Polish crime drama\" the \"raw and realist response to >silly< Bond\", and \"the most popular Polish police series ever\". While taking place in Poland of the 1970s and 1980s, the series featured many elements of western lifestyle, mostly unavailable to ordinary Poles. Borewicz wears American clothes, drives German cars and often fights international criminal gangs. Featured Crew Krzysztof Szmagier Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bronisław Cieślak porucznik Sławomir Borewicz Zdzisław Tobiasz major Wołczyk Full Cast & Crew Last Season Original Air Date Original Air Date Absolute Order (Absolute) Season 5 1987 | 3 Episodes Season 5 of 07 zgłoś się premiered on April 26, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for 07 zgłoś się. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on 07 zgłoś się. You can help by rating TV shows you've seen. Facts Status  Ended Network TVP Certification  - Type  Scripted Original Language  Polish Runtime  60m Homepage   http://www.tvp.pl/seriale/archiwalne/07-zglos-sie/o-serialu Genres Drama Crime Keywords police criminal Content Score 71 Just a little bit more... Top Contributors L 23 Lysy500 P 19 Przemek p 14 piolo22 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}