{"link": "https://www.themoviedb.org/tv/4793?language=en", "title": "Extreme Ghostbusters", "resume": "Extreme Ghostbusters is an animated television series and a follow-up to the animated series The Real Ghostbusters. It is a part of the Ghostbusters franchise. The series originally aired in the autumn of 1997, and features a team of younger college-level Ghostbusters who are led by veteran Ghostbuster Egon Spengler.", "rate": 59, "genre": ["Animation", "Mystery", "Action", "Adventure", "Comedy"], "cast": ["Pat Musick", "Jason Marsden", "Rino Romano", "Dave Coulier", "Alfonso Ribeiro"], "character": ["Peter Venkman", "Roland Jackson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4793   Expand Extreme Ghostbusters   (1997) User Score Overview Extreme Ghostbusters is an animated television series and a follow-up to the animated series The Real Ghostbusters. It is a part of the Ghostbusters franchise. The series originally aired in the autumn of 1997, and features a team of younger college-level Ghostbusters who are led by veteran Ghostbuster Egon Spengler. Featured Crew Harold Ramis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pat Musick Jason Marsden Rino Romano Dave Coulier Peter Venkman Alfonso Ribeiro Roland Jackson Full Cast & Crew Last Season Season 1 1997 | 40 Episodes Season 1 of Extreme Ghostbusters premiered on September  1, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1997-07-15 I Am Weasel 7.4    1997-09-13 101 Dalmatians: The Series 7.0    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    Free Willy 4.0    2003-08-01 My Life as a Teenage Robot 6.1    2001-09-29 The Mummy: The Animated Series 4.8    1993-09-11 The Pink Panther 6.5    1994-09-05 Aladdin 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Mystery Action & Adventure Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 3 speedycars A 3 AnthonyAtkins232 1 BlackDelivery M 1 Meng3267  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}