{"link": "https://www.themoviedb.org/tv/72983?language=en", "title": "Welcome to the Wayne", "resume": "The Wayne is a high-rise apartment building in New York City. Ansi, Olly and his sister Saraline are friends who call themselves Team Timber, dedicated to exploring the ever-growing mysteries of “Wayne Phenomena” in the building they call home. All manner of action, adventure and otherworldly awesomeness could be right down the hall – or twelve floors up! You never know what’s in store behind a Wayne door", "rate": 53, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72983   Expand Welcome to the Wayne   (2017) User Score  Play Trailer Overview The Wayne is a high-rise apartment building in New York City. Ansi, Olly and his sister Saraline are friends who call themselves Team Timber, dedicated to exploring the ever-growing mysteries of “Wayne Phenomena” in the building they call home. All manner of action, adventure and otherworldly awesomeness could be right down the hall – or twelve floors up! You never know what’s in store behind a Wayne door Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season season 2 2017 | 1 Episode Season 2 of Welcome to the Wayne premiered on November  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Welcome to the Wayne. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   https://www.nickanimationstudio.com/welcome-to-the-wayne- Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors p 14 pezrongovrian 4 Elizabeth Jennings N 4 NeroDante w 3 weestewatt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}