{"link": "https://www.themoviedb.org/tv/77661?language=en", "title": "Roadkill Garage", "resume": "Roadkill Garage is where David Freiburger and Steve Dulcich show you how to do the wrong thing the right way! Whether the guys are wrenching on project cars from the Roadkill show or creating their own moving violations, you'll always get info and action on Roadkill Garage.", "rate": 100, "genre": [], "cast": ["David Freiburger", "Steve Dulcich"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77661   Expand Roadkill Garage   (2016) User Score Overview Roadkill Garage is where David Freiburger and Steve Dulcich show you how to do the wrong thing the right way! Whether the guys are wrenching on project cars from the Roadkill show or creating their own moving violations, you'll always get info and action on Roadkill Garage. Featured Crew David Freiburger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Freiburger Himself Steve Dulcich Himself Full Cast & Crew Current Season Season 3 2018 | 3 Episodes View All Seasons Social Reviews  1 Discussions  0 A review by ChrisN34  10.0 Written by  ChrisN34  on March  4, 2018 Roadkill Garage is a spin-off of the popular MotorTrend/HotRod show Roadkill. Host David Freigberger teams up with buddy and Engine master Steve Dulcich to tackle some in-depth and more technical hot rod challenges.  Garage entered its third season at the start of 2018 and each episode gives a really good look into the hardcore and more technical aspect of wrenching on old classics. The hosts Steve and David are old friends and they both work really well together. There never seems a serious or faked moment between the two and there is none of that fake, reality show tension or drama. It rea...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Roadkill Garage. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://www.motortrendondemand.com/show/roadkill-garage-/42024902/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 16 ChrisN34 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}