{"link": "https://www.themoviedb.org/tv/8344?language=en", "title": "Collision", "resume": "Collision is a five-part television drama miniseries, which debuted on ITV & UTV in November 2009. In the same month, it was also on PBS as a series in two parts. It tells the story of a group of strangers whose lives intertwine following a devastating car crash. The crash opens a number of startling revelations as stories of everything from government cover-ups and smuggling, to embezzlement and murder start to unravel.\nThe series is open-ended, with a number of unresolved issues; moreover, the story is ostensibly resolved in a metafictional manner with a flashback to an incident in the service station and the swatting of a wasp, which precipitates the initial crash, thus allowing the characters to carry on on their journeys. The wasp as a motif and theme is frequently in evidence throughout the series.\nThe original British broadcast of Collision was edited from the original 5 hours down to three and a half hours. The American broadcast on PBS's Masterpiece Contemporary, the Australian broadcast on ABC1 and the Region 1 DVD release all featured the shortened version. In Australia, Foxtel and Austar's W Channel aired Collision in its original format of five 45-minute episodes, Tuesday, 15 March 2011.", "rate": 80, "genre": ["Drama"], "cast": ["Paul McGann", "Douglas Henshall", "Matt Ryan", "Sylvia Syms", "Phil Davis"], "character": ["Richard Reeves", "D.I. John Tolin", "Dave Brown", "Joyce Thompson", "Brian Edwards"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8344   Expand Collision   (2009) User Score Overview Collision is a five-part television drama miniseries, which debuted on ITV & UTV in November 2009. In the same month, it was also on PBS as a series in two parts. It tells the story of a group of strangers whose lives intertwine following a devastating car crash. The crash opens a number of startling revelations as stories of everything from government cover-ups and smuggling, to embezzlement and murder start to unravel. The series is open-ended, with a number of unresolved issues; moreover, the story is ostensibly resolved in a metafictional manner with a flashback to an incident in the service station and the swatting of a wasp, which precipitates the initial crash, thus allowing the characters to carry on on their journeys. The wasp as a motif and theme is frequently in evidence throughout the series. The original British broadcast of Collision was edited from the original 5 hours down to three and a half hours. The American broadcast on PBS's Masterpiece Contemporary, the Australian broadcast on ABC1 and the Region 1 DVD release all featured the shortened version. In Australia, Foxtel and Austar's W Channel aired Collision in its original format of five 45-minute episodes, Tuesday, 15 March 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul McGann Richard Reeves Douglas Henshall D.I. John Tolin Matt Ryan Dave Brown Sylvia Syms Joyce Thompson Phil Davis Brian Edwards Full Cast & Crew Last Season Season 1 2009 | 5 Episodes Season 1 of Collision premiered on November  9, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2013-02-27 Lightfields 7.5    2011-02-03 Marchlands 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 12 tmdb48730457 z 8 zurman1 w 3 webmaster R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}