{"link": "https://www.themoviedb.org/tv/18797?language=en", "title": "Dark Blue", "resume": "Dark Blue was an action/drama television series which premiered on TNT on July 15, 2009, at 10 pm. It ended its run on September 15, 2010. The series is set in Los Angeles, California. It revolves around Carter Shaw, the leader of an undercover unit. He is an officer who has dedicated his life to taking down the worst criminals in L.A., and this dedication has cost him his marriage. His team includes Ty Curtis, a newlywed who struggles between his job and his new life; Dean Bendis, an officer who is so deep in his undercover role that his team is no longer sure which side he is on; and Jaimie Allen, a green patrol cop recruited into the undercover unit because of her dark past and criminal skills.", "rate": 66, "genre": ["Action", "Adventure", "Drama"], "cast": ["Logan Marshall-Green", "Dylan McDermott", "Nicki Aycox", "Omari Hardwick", "Tricia Helfer"], "character": ["Dean Bendis", "Carter Shaw", "Jaimie Allen", "Ty Curtis", "Alex Rice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18797   Expand Dark Blue   (2009) User Score  Play Trailer Overview Dark Blue was an action/drama television series which premiered on TNT on July 15, 2009, at 10 pm. It ended its run on September 15, 2010. The series is set in Los Angeles, California. It revolves around Carter Shaw, the leader of an undercover unit. He is an officer who has dedicated his life to taking down the worst criminals in L.A., and this dedication has cost him his marriage. His team includes Ty Curtis, a newlywed who struggles between his job and his new life; Dean Bendis, an officer who is so deep in his undercover role that his team is no longer sure which side he is on; and Jaimie Allen, a green patrol cop recruited into the undercover unit because of her dark past and criminal skills. Featured Crew Danny Cannon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Logan Marshall-Green Dean Bendis Dylan McDermott Carter Shaw Nicki Aycox Jaimie Allen Omari Hardwick Ty Curtis Tricia Helfer Alex Rice Full Cast & Crew Last Season Season 2 2010 | 10 Episodes Season 2 of Dark Blue premiered on August  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  14 Posters  3 Recommendations   2010-09-20 The Event 6.2  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.tnt.tv/series/darkblue/ Genres Action & Adventure Drama Keywords undercover agent undercover los angeles Content Score 100 Yes! Looking good! Top Contributors 14 Banana 9 rantamplan 5 seawolf z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}