{"link": "https://www.themoviedb.org/tv/57285?language=en", "title": "Quick Draw", "resume": "Quick Draw is a comedy television series created by Nancy Hower and John Lehr for Hulu. Lehr stars and Hower directs this entirely improvised half hour comedy. The show follows Harvard graduate John Henry Hoyle who becomes the sheriff of Great Bend, Kansas in 1875.\nThe show marks Hulu's third foray into original scripted programming. It premiered online on August 5, 2013.", "rate": 63, "genre": ["Western", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57285   Expand Quick Draw   (2013) User Score Overview Quick Draw is a comedy television series created by Nancy Hower and John Lehr for Hulu. Lehr stars and Hower directs this entirely improvised half hour comedy. The show follows Harvard graduate John Henry Hoyle who becomes the sheriff of Great Bend, Kansas in 1875. The show marks Hulu's third foray into original scripted programming. It premiered online on August 5, 2013. Featured Crew Nancy Hower Creator John Lehr Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2014 | 10 Episodes Season 2 of Quick Draw premiered on August  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2015-03-25 What Lives Inside 8.1    2015-03-25 Big Time in Hollywood, Fl 5.7    2015-04-26 HAPPYish 6.9    2014-10-02 Bad Judge 6.1    2015-08-22 Blunt Talk 6.3    2013-04-19 Alpha House 7.3    2015-06-16 Clipped 4.1    2014-03-21 Welcome to Sweden 6.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.hulu.com/quick-draw Genres Western Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 21 Elizabeth Jennings D 3 David1886 1 CouchTater ZK 1 Zdenek Kowalski  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}