{"link": "https://www.themoviedb.org/tv/1705?language=en", "title": "Fringe", "resume": "FBI Special Agent Olivia Dunham, brilliant but formerly institutionalized scientist Walter Bishop and his scheming, reluctant son Peter uncover a deadly mystery involving a series of unbelievable events and realize they may be a part of a larger, more disturbing pattern that blurs the line between science fiction and technology.", "rate": 81, "genre": ["Sci-Fi", "Fantasy", "Drama", "Mystery"], "cast": ["Anna Torv", "John Noble", "Joshua Jackson", "Lance Reddick", "Jasika Nicole"], "character": ["Olivia Dunham", "Walter Bishop", "Peter Bishop", "Phillip Broyles", "Astrid Farnsworth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1705   Expand Fringe   (2008) User Score  Play Trailer Overview FBI Special Agent Olivia Dunham, brilliant but formerly institutionalized scientist Walter Bishop and his scheming, reluctant son Peter uncover a deadly mystery involving a series of unbelievable events and realize they may be a part of a larger, more disturbing pattern that blurs the line between science fiction and technology. Featured Crew J.J. Abrams Creator Alex Kurtzman Creator Roberto Orci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  78 Posters  105 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Torv Olivia Dunham John Noble Walter Bishop Joshua Jackson Peter Bishop Lance Reddick Phillip Broyles Jasika Nicole Astrid Farnsworth Full Cast & Crew Last Season Season 5 2012 | 13 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Rewatching Open 7 by  The Midi-chlorian Count rewatching | season 2 (spoilers) Open 0 by acf\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  78 Posters  105 Recommendations   2006-09-25 Heroes 6.9    2004-09-22 Lost 7.8    2012-05-27 Continuum 7.1    2009-07-07 Warehouse 13 7.2    2008-09-23 The Mentalist 7.3    2004-10-18 Battlestar Galactica 8.1    2006-10-01 Dexter 8.0    1993-09-10 The X-Files 8.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  46m Homepage   http://www.fox.com/fringe Genres Sci-Fi & Fantasy Drama Mystery Keywords fbi supernatural mad scientist alternate dimension fringe science Content Score 100 Yes! Looking good! Top Contributors t 73 tmdb91800355 62 Travis Bell 28 seawolf 25 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}