{"link": "https://www.themoviedb.org/tv/1824?language=en", "title": "Captain N: The Game Master", "resume": "Captain N: The Game Master is a joint-venture between American-Canadian animated television series that aired on television from 1989 to 1991 as part of the Saturday morning cartoon lineup on NBC. The show is produced by DIC Entertainment and incorporated elements from many of the most popular video games from the Japanese company, Nintendo of the time. There was also a comic book version by Valiant Comics, albeit only featuring characters from games produced by Nintendo. The show is also part of an hour-long block in Season 2 with The Adventures of Super Mario Bros. 3 and with Super Mario World in Season 3 in a half-hour block.", "rate": 65, "genre": ["Animation", "Action", "Adventure"], "cast": ["Ian James Corlett", "Shane Meier", "Alessandro Juliani", "Levi Stubbs", "Alvin Sanders"], "character": ["Mother Brain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1824   Expand Captain N: The Game Master   (1989) User Score Overview Captain N: The Game Master is a joint-venture between American-Canadian animated television series that aired on television from 1989 to 1991 as part of the Saturday morning cartoon lineup on NBC. The show is produced by DIC Entertainment and incorporated elements from many of the most popular video games from the Japanese company, Nintendo of the time. There was also a comic book version by Valiant Comics, albeit only featuring characters from games produced by Nintendo. The show is also part of an hour-long block in Season 2 with The Adventures of Super Mario Bros. 3 and with Super Mario World in Season 3 in a half-hour block. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian James Corlett Shane Meier Alessandro Juliani Levi Stubbs Mother Brain Alvin Sanders Full Cast & Crew Last Season Season 3 1991 | 7 Episodes Season 3 of Captain N: The Game Master premiered on September 14, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1983-09-12 G.I. Joe 8.0    1986-09-15 Rambo 5.7    1988-10-01 Dino-Riders 7.0    1991-02-25 The Pirates of Dark Water 6.8    G.I. Joe: A Real American Hero 6.6    1964-09-18 Jonny Quest 7.9    1999-10-02 Spider-Man Unlimited 6.5    1985-09-09 She-Ra: Princess of Power 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Action & Adventure Keywords video game Content Score 86 Almost there... Top Contributors 11 Banana C 8 CroCop z 4 zurman1 J 3 Jurginho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}