{"link": "https://www.themoviedb.org/tv/2681?language=en", "title": "Off Centre", "resume": "Off Centre is an American sitcom that aired on The WB network from October 14, 2001 to October 31, 2002. Created by Chris Weitz, Paul Weitz, and Danny Zuker, the series was heavily promoted as \"from the guys who brought you American Pie\".", "rate": 74, "genre": ["Comedy"], "cast": ["Eddie Kaye Thomas", "Sean Maguire", "Lauren Stamile", "John Cho", "Jason George"], "character": ["Mike Platt", "Euan Pierce", "Liz Lombardi", "Chau Presley", "Nathan Cole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2681   Expand Off Centre   (2001) User Score Overview Off Centre is an American sitcom that aired on The WB network from October 14, 2001 to October 31, 2002. Created by Chris Weitz, Paul Weitz, and Danny Zuker, the series was heavily promoted as \"from the guys who brought you American Pie\". Featured Crew Paul Weitz Creator Chris Weitz Creator Danny Zuker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eddie Kaye Thomas Mike Platt Sean Maguire Euan Pierce Lauren Stamile Liz Lombardi John Cho Chau Presley Jason George Nathan Cole Full Cast & Crew Last Season Season 2 2002 | 9 Episodes Season 2 of Off Centre premiered on September 19, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2011-01-09 Bob's Burgers 7.7    2006-10-11 30 Rock 7.1    2004-03-21 Deadwood 8.1    2000-01-09 Malcolm in the Middle 7.5    2009-04-09 Parks and Recreation 7.9    2005-08-04 It's Always Sunny in Philadelphia 8.2    2010-09-19 Boardwalk Empire 7.7    2005-08-28 Rome 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york male friendship sitcom Content Score 93 Almost there... Top Contributors 24 United600 7 Banana 4 MacFly 🇫🇷 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}