{"link": "https://www.themoviedb.org/tv/46296?language=en", "title": "Spartacus", "resume": "Spartacus is an American television series inspired by the historical figure of Spartacus, a Thracian gladiator who from 73 to 71 BCE led a major slave uprising against the Roman Republic departing from Capua.", "rate": 78, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46296   Expand Spartacus   (2010) User Score  Play Trailer Overview Spartacus is an American television series inspired by the historical figure of Spartacus, a Thracian gladiator who from 73 to 71 BCE led a major slave uprising against the Roman Republic departing from Capua. Featured Crew Steven S. DeKnight Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  14 Images Backdrops  14 Posters  23 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season War of the Damned 2013 | 10 Episodes View All Seasons Social Reviews  0 Discussions  19 Subject Status Replies Last Reply the women of Spartacus Open 12 by  write2topcat Freed Slaves in the city Sinuessa Open 1 by  write2topcat Andy Whitfield Doc Open 4 by  write2topcat Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  23 Recommendations   2005-08-28 Rome 8.2    2006-10-01 Dexter 8.0    2008-09-07 True Blood 7.1    2010-09-19 Boardwalk Empire 7.7    2004-09-22 Lost 7.8    2014-01-12 True Detective 8.1    2008-09-03 Sons of Anarchy 7.8    2008-09-09 Fringe 8.1  Facts Status  Ended Network Certification 18 Meaning Can be aired only from 11:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  53m Homepage   http://www.starz.com/originals/spartacus Genres Drama Keywords sex gladiator arena ancient rome slave sword and sandal Content Score 71 Just a little bit more... Top Contributors 97 BudsieBuds 21 lineker AK 17 Avshalom Kor l 15 lexura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}