{"link": "https://www.themoviedb.org/tv/58347?language=en", "title": "Diablo Guardián", "resume": "The story of Violetta, a young woman who flees her native Mexico to start anew in New York City. But instead of a living a dream, Violetta is awoken to a harsh reality when she runs out of money, sending her into the arms of the villainous Nefastófeles.", "rate": 0, "genre": ["Drama"], "cast": ["Paulina Gaitán", "Adrián Ladrón de Guevara", "Andrés Almeida"], "character": ["Violetta", "Pig", "Nefastofeles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58347   Expand Diablo Guardián   (2018) User Score  Play Trailer Overview The story of Violetta, a young woman who flees her native Mexico to start anew in New York City. But instead of a living a dream, Violetta is awoken to a harsh reality when she runs out of money, sending her into the arms of the villainous Nefastófeles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paulina Gaitán Violetta Adrián Ladrón de Guevara Pig Andrés Almeida Nefastofeles Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Diablo Guardián premiered on May  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Diablo Guardián. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Spanish; Castilian Runtime  40m Homepage   https://www.amazon.com/dp/B07C26P33F Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 21 Elizabeth Jennings s 5 shiff7 4 peliculastop 2 joeynotjoe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}