{"link": "https://www.themoviedb.org/tv/76526?language=en", "title": "This Close", "resume": "BFFs Kate and Michael, who are both deaf and live in Los Angeles, are about to face new challenges - including a bad breakup, being tokenized at work and a troubling secret - all of which test their bond in surprising ways.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Josh Feldman", "Shoshannah Stern", "Marlee Matlin", "Zach Gilford", "Cheryl Hines"], "character": ["Michael", "Kate", "Annie", "Danny", "Stella"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76526   Expand This Close   (2018) User Score  Play Trailer Overview BFFs Kate and Michael, who are both deaf and live in Los Angeles, are about to face new challenges - including a bad breakup, being tokenized at work and a troubling secret - all of which test their bond in surprising ways. Featured Crew Shoshannah Stern Creator Josh Feldman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Feldman Michael Shoshannah Stern Kate Marlee Matlin Annie Zach Gilford Danny Cheryl Hines Stella Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of This Close premiered on February 14, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for This Close. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on This Close. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  25m Homepage   https://www.sundancenow.com/this-close/series/3902433 Genres Comedy Drama Keywords deafness deaf disability dramedy Content Score 100 Yes! Looking good! Top Contributors 35 Redouane 10 Elizabeth Jennings 4 tigru89 2 dhanny  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}