{"link": "https://www.themoviedb.org/tv/10485?language=en", "title": "The X Factor", "resume": "The X Factor is an Australian television reality music competition, based on the original UK series, to find new singing talent. The first series of the show was broadcast from February to May, however, since the second series it has been broadcast from July/August until the grand final in November. The X Factor is produced by FremantleMedia Australia, and is currently broadcast on the Seven Network. The title \"X Factor\" refers to a singing talent which is \"unique\" and \"something\" that makes for star quality. Network Ten held rights for The X Factor in 2005, but dropped the show after the first series due to poor ratings. In 2010, the Seven Network went into a \"bidding war\" to gain rights for the show, and later won and a second series went into production. The X Factor was renewed after a highly successful Australian Idol was no longer broadcast through Network Ten. It is also broadcast in New Zealand on TV3. Two series of The Xtra Factor were broadcast through Network Ten in 2005 and 7Two in 2010. The show was not renewed for a third series in 2011.\nThe original judging panel line-up in 2005 consisted of Kate Ceberano, Mark Holden, and John Reid. When the show was revived in 2010, the judging panel was replaced by Ronan Keating, Guy Sebastian, Natalie Imbruglia, and Kyle Sandilands. Imbruglia and Sandilands did not return for series three and were replaced by Melanie Brown and Natalie Bassingthwaighte. Dannii Minogue and Redfoo joined the panel in the fifth series as replacements for Brown and Sebastian. During the televised audition phases of The X Factor, originally the contestants sang in an \"audition room\" in front of just the judges, however, from series two onwards all auditionees sing on stage in an arena, in front of the judges and a live audience. The successful acts then progress to the next stage of the competition, \"bootcamp\" and later \"home visits\", where the judges narrow their category down to three acts who will continue to the live shows, where the public vote for their favourite act, following weekly performances by the contestants.", "rate": 0, "genre": [], "cast": ["Iggy Azalea", "Adam Lambert", "Guy Sebastian", "Jason Dundas"], "character": ["Herself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10485   Expand The X Factor   (2005) User Score Overview The X Factor is an Australian television reality music competition, based on the original UK series, to find new singing talent. The first series of the show was broadcast from February to May, however, since the second series it has been broadcast from July/August until the grand final in November. The X Factor is produced by FremantleMedia Australia, and is currently broadcast on the Seven Network. The title \"X Factor\" refers to a singing talent which is \"unique\" and \"something\" that makes for star quality. Network Ten held rights for The X Factor in 2005, but dropped the show after the first series due to poor ratings. In 2010, the Seven Network went into a \"bidding war\" to gain rights for the show, and later won and a second series went into production. The X Factor was renewed after a highly successful Australian Idol was no longer broadcast through Network Ten. It is also broadcast in New Zealand on TV3. Two series of The Xtra Factor were broadcast through Network Ten in 2005 and 7Two in 2010. The show was not renewed for a third series in 2011. The original judging panel line-up in 2005 consisted of Kate Ceberano, Mark Holden, and John Reid. When the show was revived in 2010, the judging panel was replaced by Ronan Keating, Guy Sebastian, Natalie Imbruglia, and Kyle Sandilands. Imbruglia and Sandilands did not return for series three and were replaced by Melanie Brown and Natalie Bassingthwaighte. Dannii Minogue and Redfoo joined the panel in the fifth series as replacements for Brown and Sebastian. During the televised audition phases of The X Factor, originally the contestants sang in an \"audition room\" in front of just the judges, however, from series two onwards all auditionees sing on stage in an arena, in front of the judges and a live audience. The successful acts then progress to the next stage of the competition, \"bootcamp\" and later \"home visits\", where the judges narrow their category down to three acts who will continue to the live shows, where the public vote for their favourite act, following weekly performances by the contestants. Featured Crew Simon Cowell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Iggy Azalea Herself Adam Lambert Himself Guy Sebastian Himself Jason Dundas Himself Full Cast & Crew Last Season Season 8 2016 | 2 Episodes Season 8 of The X Factor premiered on October  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The X Factor. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  90m Homepage   http://www.xfactortv.com.au/ Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors c 79 courtneysmith86 9 lineker 4 Elizabeth Jennings 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}