{"link": "https://www.themoviedb.org/tv/14531?language=en", "title": "The Corner", "resume": "The Corner presents the world of Fayette Street using real names and real events. The miniseries tells the true story of men, women and children living amid the open-air drug markets of West Baltimore. It chronicles a year in the lives of 15-year-old DeAndre McCullough, his mother Fran Boyd, and his father Gary McCullough, as well as other addicts and low-level drug dealers caught up in the twin-engine economy of heroin and cocaine.", "rate": 72, "genre": ["Drama"], "cast": ["T. K. Carter", "Khandi Alexander", "Sean Nelson", "Clarke Peters", "Glenn Plummer"], "character": ["Gary McCullough", "Denise Francine 'Fran' Boyd", "DeAndre McCullough", "Fat Curt", "George 'Blue' Epps"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14531   Expand The Corner   (2000) User Score  Play Trailer Overview The Corner presents the world of Fayette Street using real names and real events. The miniseries tells the true story of men, women and children living amid the open-air drug markets of West Baltimore. It chronicles a year in the lives of 15-year-old DeAndre McCullough, his mother Fran Boyd, and his father Gary McCullough, as well as other addicts and low-level drug dealers caught up in the twin-engine economy of heroin and cocaine. Featured Crew David Simon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast T. K. Carter Gary McCullough Khandi Alexander Denise Francine 'Fran' Boyd Sean Nelson DeAndre McCullough Clarke Peters Fat Curt Glenn Plummer George 'Blue' Epps Full Cast & Crew Last Season Season 1 2000 | 6 Episodes Season 1 of The Corner premiered on April 16, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2006-03-28 Thief 7.8    2000-10-01 Unit One 6.9    2013-12-04 Mob City 7.0    2016-01-30 Horace and Pete 7.1    2012-01-22 Real Humans 7.7    2003-03-27 New Tricks 7.3    1992-08-15 The Larry Sanders Show 7.4    2010-04-11 Treme 8.1  Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 19 United600 z 5 zurman1 w 3 webmaster 2 Dosedd  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}