{"link": "https://www.themoviedb.org/tv/58782?language=en", "title": "Seed", "resume": "Seed is a half-hour comedy follows that Harry, a likable bachelor and bartender whose previous foray into sperm donation resulted in offspring he was unaware of until now. Seed tells the story of Harry's relationship with his new-found relatives, and the interactions of these families with one another.", "rate": 63, "genre": ["Comedy"], "cast": ["Adam Korson", "Carrie-Lynn Neales", "Amanda Brugel", "Stephanie Mills", "Laura de Carteret"], "character": ["Harry Dacosta", "Rose Maybely", "Michelle Krasnoff", "Zoey Jones", "Dr. Janet Colborne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58782   Expand Seed   (2013) User Score Overview Seed is a half-hour comedy follows that Harry, a likable bachelor and bartender whose previous foray into sperm donation resulted in offspring he was unaware of until now. Seed tells the story of Harry's relationship with his new-found relatives, and the interactions of these families with one another. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Korson Harry Dacosta Carrie-Lynn Neales Rose Maybely Amanda Brugel Michelle Krasnoff Stephanie Mills Zoey Jones Laura de Carteret Dr. Janet Colborne Full Cast & Crew Last Season Season 2 2014 | 13 Episodes Season 2 of Seed premiered on March  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2016-07-21 Fleabag 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.citytv.com/toronto/shows/seed/ Genres Comedy Keywords sperm donor Content Score 86 Almost there... Top Contributors 29 Elizabeth Jennings 4 janar s 3 speedycars k 2 kisgab88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}