{"link": "https://www.themoviedb.org/tv/43358?language=en", "title": "Hammer House of Horror", "resume": "Hammer House of Horror is a British television series, made in 1980. An anthology series created by Hammer Films in association with Cinema Arts International and ITC Entertainment, it consisted of thirteen 50-minute episodes, which was broadcast on ITV.\nEach self-contained episode featured a different kind of horror, and these varied from witches, werewolves, ghosts, devil worship and voodoo, but also included non-supernatural horror themes such as cannibalism, confinement and serial killers. In 2003, Channel 4 placed Hammer House of Horror at No.50 in its \"100 Scariest Moments\" show. The clip shown was the children's party scene in \"The House That Bled to Death\".\nEpisodes were directed by Alan Gibson, Peter Sasdy and Tom Clegg, among others, and script edited by Anthony Read.", "rate": 64, "genre": ["Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43358   Expand Hammer House of Horror   (1980) User Score Overview Hammer House of Horror is a British television series, made in 1980. An anthology series created by Hammer Films in association with Cinema Arts International and ITC Entertainment, it consisted of thirteen 50-minute episodes, which was broadcast on ITV. Each self-contained episode featured a different kind of horror, and these varied from witches, werewolves, ghosts, devil worship and voodoo, but also included non-supernatural horror themes such as cannibalism, confinement and serial killers. In 2003, Channel 4 placed Hammer House of Horror at No.50 in its \"100 Scariest Moments\" show. The clip shown was the children's party scene in \"The House That Bled to Death\". Episodes were directed by Alan Gibson, Peter Sasdy and Tom Clegg, among others, and script edited by Anthony Read. Featured Crew Roy Skeggs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1980 | 13 Episodes Season 1 of Hammer House of Horror premiered on September 13, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1969-11-16 Clangers 9.3    1998-09-15 Ultraviolet 0.0    1986-10-06 The Trap Door 7.3    1981-09-10 The Day of the Triffids 6.7    2006-07-12 Nightmares & Dreamscapes: From the Stories of Stephen King 6.4    2009-12-28 The Day of the Triffids 5.6    2013-10-31 Darknet 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 51m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 4 kamwatka 3 Kalla Malla w 3 webmaster TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}