{"link": "https://www.themoviedb.org/tv/2225?language=en", "title": "Who Wants to Be a Millionaire?", "resume": "Who Wants to Be a Millionaire is an American television quiz show based upon the British program of the same title, which offers a maximum prize of $1,000,000 for correctly answering a series of consecutive multiple choice questions. Originally, as in the UK edition, contestants were required to correctly answer 15 questions of increasing difficulty, but in 2010, the format was modified so that the contestants are now faced with 14 questions of random difficulty. The program follows the same general premise as its original UK counterpart, and is one of many international variants in the Who Wants to Be a Millionaire? franchise.\nThe original U.S. version aired on ABC from August 16, 1999 to June 27, 2002, and was hosted by Regis Philbin. The current syndicated version of the show began airing on September 16, 2002, and was launched by Meredith Vieira, who remained host for 11 seasons, with her final first-run episodes airing in May 2013. Vieira was succeeded by Cedric the Entertainer beginning with the premiere of season 12 on September 2, 2013.\nAs the first U.S. network game show to offer a million-dollar top prize, the show made television history by becoming one of the highest-rated game shows in the history of American television. The U.S. Millionaire has gone on to win seven Daytime Emmy Awards, and TV Guide and GSN have ranked it #7 and #5 on their respective lists of the 50 Greatest Game Shows of All Time. In 2013, TV Guide ranked it #6 in its list of the 60 greatest game shows ever.", "rate": 73, "genre": ["Talk"], "cast": ["Meredith Vieira", "Regis Philbin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2225   Expand Who Wants to Be a Millionaire? (US)   (1999) User Score  Play Trailer Overview Who Wants to Be a Millionaire is an American television quiz show based upon the British program of the same title, which offers a maximum prize of $1,000,000 for correctly answering a series of consecutive multiple choice questions. Originally, as in the UK edition, contestants were required to correctly answer 15 questions of increasing difficulty, but in 2010, the format was modified so that the contestants are now faced with 14 questions of random difficulty. The program follows the same general premise as its original UK counterpart, and is one of many international variants in the Who Wants to Be a Millionaire? franchise. The original U.S. version aired on ABC from August 16, 1999 to June 27, 2002, and was hosted by Regis Philbin. The current syndicated version of the show began airing on September 16, 2002, and was launched by Meredith Vieira, who remained host for 11 seasons, with her final first-run episodes airing in May 2013. Vieira was succeeded by Cedric the Entertainer beginning with the premiere of season 12 on September 2, 2013. As the first U.S. network game show to offer a million-dollar top prize, the show made television history by becoming one of the highest-rated game shows in the history of American television. The U.S. Millionaire has gone on to win seven Daytime Emmy Awards, and TV Guide and GSN have ranked it #7 and #5 on their respective lists of the 50 Greatest Game Shows of All Time. In 2013, TV Guide ranked it #6 in its list of the 60 greatest game shows ever. Featured Crew Celador Creator Steven Knight Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Meredith Vieira Regis Philbin Full Cast & Crew Last Season Who wants to be a millionaire (us) season 10 2009 | 11 Episodes Season 10 of Who Wants to Be a Millionaire? (US) premiered on August  9, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   1985-06-03 Larry King Live 5.5    2001-04-16 Weakest Link 7.0    1983-09-19 Wheel of Fortune 7.3    1972-09-04 The Price Is Right 8.5    The O'Reilly Factor 2.4  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  60m, 30m Homepage   http://www.millionairetv.com/index.html Genres Talk Keywords game show Content Score 56 We're so close, yet so far. Top Contributors 3 TheOneManBoxOffice - 2 -Alexander- 2 tigru89 k 2 kaspey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}