{"link": "https://www.themoviedb.org/tv/44399?language=en", "title": "Golden Time", "resume": "Golden Time is a 2012 South Korean medical drama starring Lee Sun-kyun, Hwang Jung-eum, Lee Sung-min and Song Seon-mi. It aired on MBC from July 9 to September 25, 2012 on Mondays and Tuesdays at 21:55 for 23 episodes.\nIn emergency medicine, \"golden time\" or \"golden hour\" refers to the crucial time period right after a patient suffers a traumatic injury, during which timely medical treatment could determine life or death.", "rate": 60, "genre": ["Drama"], "cast": ["Lee Sun-kyun", "Hwang Jung-eum", "Lee Sung-min", "Song Seon-mi", "Jung Ae-yeon"], "character": ["Lee Min-woo", "Kang Jae-in", "Choi In-hyuk", "Shin Eun-ah", "Bang Hee-sun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44399   Expand Golden Time   (2012) User Score Overview Golden Time is a 2012 South Korean medical drama starring Lee Sun-kyun, Hwang Jung-eum, Lee Sung-min and Song Seon-mi. It aired on MBC from July 9 to September 25, 2012 on Mondays and Tuesdays at 21:55 for 23 episodes. In emergency medicine, \"golden time\" or \"golden hour\" refers to the crucial time period right after a patient suffers a traumatic injury, during which timely medical treatment could determine life or death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Sun-kyun Lee Min-woo Hwang Jung-eum Kang Jae-in Lee Sung-min Choi In-hyuk Song Seon-mi Shin Eun-ah Jung Ae-yeon Bang Hee-sun Full Cast & Crew Last Season Season 1 2012 | 23 Episodes Season 1 of Golden Time premiered on July  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Golden Time. You can help by rating TV shows you've seen. Facts Original Name  골든타임 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/goldentime/ Genres Drama Keywords korea medical drama Content Score 86 Almost there... Top Contributors M 22 Maria180493 N 14 Nightowl.Kr CM 4 Cherche Moi 3 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}