{"link": "https://www.themoviedb.org/tv/71673?language=en", "title": "Princess Agents", "resume": "During the Warring Period, the Western Wei enslaved large numbers of civilians. The slave girl, Chu Qiao, is thrown into a forest along with other slaves and becomes the next hunting target for the rich lords. She is saved by the Prince of Northern Wei, Yan Xun. Afterwards, she is brought into a powerful family of Yuwen and witnesses their bloody power struggle. Seeing this, she swears to take her younger sister and flee from the situation. However, she catches the attention of Yuwen Yue, and undergoes strict training while building a sense of companionship with Yan Xun. Unfortunately, Western Wei goes into battle and Yan Xun’s family is slaughtered. After that incident, Yan Xun grows ambitious and cruel to avenge for the things and the people he lost. He doubts Chu Qiao and takes advantages of her loyalty and love many times, disregarding their relationship as well as the sacrifices he will have to make for power. Disappointed with the man she once loved, Chu Qiao eventually breaks off her relationship with Yan Xun and chooses to fight with Yuwen Yue, destroying Yan Xun’s plans of vengeance. She eventually convinces Yuwen to free the country from slavery, becoming a successful military strategist/female general in the people’s hearts.", "rate": 41, "genre": ["Drama"], "cast": ["Zhao Liying", "Lin Gengxin", "Shawn Dou", "Li Qin", "Maggie Huang"], "character": ["Chu Qiao", "Yuwen Yue", "Yan Xun", "Yuan Chun", "Xiao Yu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71673   Expand Princess Agents   (2017) User Score Overview During the Warring Period, the Western Wei enslaved large numbers of civilians. The slave girl, Chu Qiao, is thrown into a forest along with other slaves and becomes the next hunting target for the rich lords. She is saved by the Prince of Northern Wei, Yan Xun. Afterwards, she is brought into a powerful family of Yuwen and witnesses their bloody power struggle. Seeing this, she swears to take her younger sister and flee from the situation. However, she catches the attention of Yuwen Yue, and undergoes strict training while building a sense of companionship with Yan Xun. Unfortunately, Western Wei goes into battle and Yan Xun’s family is slaughtered. After that incident, Yan Xun grows ambitious and cruel to avenge for the things and the people he lost. He doubts Chu Qiao and takes advantages of her loyalty and love many times, disregarding their relationship as well as the sacrifices he will have to make for power. Disappointed with the man she once loved, Chu Qiao eventually breaks off her relationship with Yan Xun and chooses to fight with Yuwen Yue, destroying Yan Xun’s plans of vengeance. She eventually convinces Yuwen to free the country from slavery, becoming a successful military strategist/female general in the people’s hearts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhao Liying Chu Qiao Lin Gengxin Yuwen Yue Shawn Dou Yan Xun Li Qin Yuan Chun Maggie Huang Xiao Yu Full Cast & Crew Last Season Season 1 2017 | 67 Episodes Season 1 of Princess Agents premiered on June  5, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Princess Agents. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations   2017-08-14 The King's Woman 4.3  Facts Original Name  特工皇妃楚乔传 Status  Returning Series Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/tegonghuangfei?is_hot=1 Genres Drama Keywords china romance Content Score 93 Almost there... Top Contributors M 54 Maria180493 9 YSac d 5 divyanka 4 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}