{"link": "https://www.themoviedb.org/tv/3518?language=en", "title": "Dennis the Menace", "resume": "Dennis the Menace is an American animated series produced by DHX Media, based on the comic strip by Hank Ketcham.\nThe young blond boy with a cowlick and a mischievous personality, Dennis the Menace, gets into numerous scrapes and adventures with his dog Ruff and his friends Joey, Margaret, Gina, Tommy, PeeBee and Jay.\nDennis is an impulsive, angel-faced little devil who is always getting into scrapes which end up tormenting his hapless next-door neighbor, Mr. Wilson. Dennis finds himself involved in all kinds of wild adventures but always manages to save the day.\nThe series was originally aired in syndication in the U.S., distributed by The Program Exchange. The second season aired on Saturday mornings on CBS. Each half-hour show consists of three six or seven minute shorts. The show was sponsored by General Mills.", "rate": 60, "genre": ["Kids", "Animation"], "cast": ["Phil Hartman", "Jeannie Elias", "Marilyn Lightstone", "Brennan Thicke", "Maurice LaMarche"], "character": ["George Wilson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3518   Expand Dennis the Menace   (1986) User Score Overview Dennis the Menace is an American animated series produced by DHX Media, based on the comic strip by Hank Ketcham. The young blond boy with a cowlick and a mischievous personality, Dennis the Menace, gets into numerous scrapes and adventures with his dog Ruff and his friends Joey, Margaret, Gina, Tommy, PeeBee and Jay. Dennis is an impulsive, angel-faced little devil who is always getting into scrapes which end up tormenting his hapless next-door neighbor, Mr. Wilson. Dennis finds himself involved in all kinds of wild adventures but always manages to save the day. The series was originally aired in syndication in the U.S., distributed by The Program Exchange. The second season aired on Saturday mornings on CBS. Each half-hour show consists of three six or seven minute shorts. The show was sponsored by General Mills. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Hartman George Wilson Jeannie Elias Marilyn Lightstone Brennan Thicke Maurice LaMarche Full Cast & Crew Last Season Season 2 1986 | 15 Episodes Season 2 of Dennis the Menace premiered on June  9, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1960-11-14 Popeye the Sailor 5.8    1962-09-23 The Jetsons 6.6    1978-09-09 The All-New Popeye Hour 6.5    1983-09-17 The Charlie Brown and Snoopy Show 7.0    1995-09-09 The Sylvester & Tweety Mysteries 7.3    2006-10-02 Yin Yang Yo! 4.8    1991-09-07 Taz-Mania 6.3    1961-09-27 Top Cat 6.9  Facts Status  Ended Networks Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Kids Animation Keywords dennis the menace Content Score 86 Almost there... Top Contributors 11 Elizabeth Jennings 5 Jaime Neto 4 Banana w 4 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}