{"link": "https://www.themoviedb.org/tv/10959?language=en", "title": "Later with Jools Holland", "resume": "Later... with Jools Holland is a contemporary British music television show hosted by Jools Holland. A spin-off of The Late Show, it has been running in short series since 1992 and is a part of BBC Two's late-night line-up, usually at around 11pm to 12 midnight. The day of transmission has varied, but currently it is usually recorded on a Tuesday for Friday broadcast and features a mixture of both established and new musical artists, from solo performers to bands and larger ensembles.\nThe show is considered an institution, having notched up millions of fans around the world. It is currently broadcast in America on Palladia; previously it has been shown on Ovation, BBC America, Fuse, and Dave. The Ovation and Fuse broadcasts leave out several performances in order to air commercials within a one-hour timeslot. It is also shown in Australia on the UKTV channel and ABC2, in Canada on HIFI and AUX TV, in Germany on zdf.kultur, in Spain in Canal+ Xtra and in Portugal, Switzerland, Belgium, France and the United Arab Emirates on iConcerts HD.\nThe 200th programme was broadcast on 1 February 2008. The 250th edition was broadcast in September 2010.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10959   Expand Later with Jools Holland User Score Overview Later... with Jools Holland is a contemporary British music television show hosted by Jools Holland. A spin-off of The Late Show, it has been running in short series since 1992 and is a part of BBC Two's late-night line-up, usually at around 11pm to 12 midnight. The day of transmission has varied, but currently it is usually recorded on a Tuesday for Friday broadcast and features a mixture of both established and new musical artists, from solo performers to bands and larger ensembles. The show is considered an institution, having notched up millions of fans around the world. It is currently broadcast in America on Palladia; previously it has been shown on Ovation, BBC America, Fuse, and Dave. The Ovation and Fuse broadcasts leave out several performances in order to air commercials within a one-hour timeslot. It is also shown in Australia on the UKTV channel and ABC2, in Canada on HIFI and AUX TV, in Germany on zdf.kultur, in Spain in Canal+ Xtra and in Portugal, Switzerland, Belgium, France and the United Arab Emirates on iConcerts HD. The 200th programme was broadcast on 1 February 2008. The 250th edition was broadcast in September 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 52 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/later/ Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors m 2 mbahsurip067 2 Alexandre Oliveira 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}