{"link": "https://www.themoviedb.org/tv/63464?language=en", "title": "Public Morals", "resume": "Set in the early 1960's in New York City's Public Morals Division, where cops walk the line between morality and criminality as the temptations that come from dealing with all kinds of vice can get the better of them.", "rate": 75, "genre": ["Crime", "Drama"], "cast": ["Edward Burns", "Michael Rapaport", "Katrina Bowden", "Cormac Cullinane", "Patrick Murney"], "character": ["Terry Muldoon", "Charlie Bullman", "Fortune", "James Muldoon", "Petey 'Mac' Mackenna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63464   Expand Public Morals   (2015) User Score  Play Trailer Overview Set in the early 1960's in New York City's Public Morals Division, where cops walk the line between morality and criminality as the temptations that come from dealing with all kinds of vice can get the better of them. Featured Crew Edward Burns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edward Burns Terry Muldoon Michael Rapaport Charlie Bullman Katrina Bowden Fortune Cormac Cullinane James Muldoon Patrick Murney Petey 'Mac' Mackenna Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Public Morals premiered on August 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  5 Recommendations   2015-02-12 The Slap 5.8    2015-10-27 Wicked City 5.4    2011-02-10 Mad Dogs 7.3    2015-01-11 Togetherness 6.0    2015-09-15 The Bastard Executioner 5.5    2016-01-21 Baskets 7.2    2015-03-01 Secrets and Lies 7.1    2015-03-05 American Crime 6.6  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.tntdrama.com/shows/public-morals.html Genres Crime Drama Keywords police gangster moral conflict new york city crime period drama temptation 1960s Content Score 100 Yes! Looking good! Top Contributors 58 Elizabeth Jennings S 13 Sergey 8 Banana S 4 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}