{"link": "https://www.themoviedb.org/tv/75532?language=en", "title": "Ra Rerng Fai", "resume": "Yada's father frames Chakrit's father for murder and has him arrested. Years later, Chakrit wants revenge on Yada's family. He starts by seducing Yada's sister, then abandoning her on their wedding day, embarrassing her and the family in front of guests. Yada is very angry at the man who hurt her family and wants revenge.\nYada and Chakrit fight each other on their families' behalf, both of them seeing through the otherperson's tricks.\nThe siblings soon join in, leading to a huge fiasco of revenge, often backfiring on the perpetrators.", "rate": 80, "genre": ["Drama"], "cast": ["Woranut Bhirombhakdi", "Theeradej Wongpuapan", "Suphakan Thanongsak", "Suphakan Thanongsak", "Amena Gul"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75532   Expand Ra Rerng Fai   (2017) User Score Overview Yada's father frames Chakrit's father for murder and has him arrested. Years later, Chakrit wants revenge on Yada's family. He starts by seducing Yada's sister, then abandoning her on their wedding day, embarrassing her and the family in front of guests. Yada is very angry at the man who hurt her family and wants revenge. Yada and Chakrit fight each other on their families' behalf, both of them seeing through the otherperson's tricks. The siblings soon join in, leading to a huge fiasco of revenge, often backfiring on the perpetrators. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Woranut Bhirombhakdi Theeradej Wongpuapan Suphakan Thanongsak Suphakan Thanongsak Amena Gul Full Cast & Crew Current Season Season 1 2017 | 4 Episodes Season 1 of Ra Rerng Fai premiered on December  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ra Rerng Fai. You can help by rating TV shows you've seen. Facts Original Name  ระเริงไฟ Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  2m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 34 vnmsc 13 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}