{"link": "https://www.themoviedb.org/tv/19002?language=en", "title": "Sybil", "resume": "A young woman whose childhood was so harrowing to her that she developed at least 13 different personalities.", "rate": 73, "genre": ["Drama"], "cast": ["Brad Davis", "Martine Bartlett", "Jane Hoffman", "Charles Lane", "Jessamine Milner"], "character": ["Richard", "Hattie", "Frieda Dorsett", "Dr. Quinoness", "Grandma Dorsett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19002   Expand Sybil   (1976) User Score Overview A young woman whose childhood was so harrowing to her that she developed at least 13 different personalities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brad Davis Richard Martine Bartlett Hattie Jane Hoffman Frieda Dorsett Charles Lane Dr. Quinoness Jessamine Milner Grandma Dorsett Full Cast & Crew Last Season Miniseries 1976 | 2 Episodes Season 1 of Sybil premiered on November 14, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1998-11-10 Frank Lloyd Wright 6.3    1984-10-26 V 6.6    2007-07-23 Saving Grace 8.0    A Christmas Carol 7.5    1991-03-01 Clarissa Explains It All 6.2    2007-10-05 Battlestar Galactica: Razor Flashbacks 7.0    1984-12-25 Fanny and Alexander 7.9    1979-08-24 The Facts of Life 5.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  99m Homepage  - Genres Drama Keywords miniseries split personality multiple personality treatment of mental disorders mental disorders dissociative identity disorder Content Score 86 Almost there... Top Contributors TB 30 TMDb Bot 13 Banana R 7 Rebecca 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}