{"link": "https://www.themoviedb.org/tv/1620?language=en", "title": "CSI: Miami", "resume": "CSI: Miami follows Crime Scene Investigators working for the Miami-Dade Police Department as they use physical evidence, similar to their Las Vegas counterparts, to solve grisly murders. The series mixes deduction, gritty subject matter, and character-driven drama in the same vein as the original series in the CSI franchise, except that the Miami CSIs are cops first, scientists second.", "rate": 60, "genre": ["Drama", "Mystery"], "cast": ["David Caruso", "Emily Procter", "Adam Rodríguez", "Rex Linn", "Jonathan Togo"], "character": ["Horatio Caine", "Calleigh Duquesne", "Eric Delko", "Frank Tripp", "Ryan Wolfe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1620   Expand CSI: Miami   (2002) User Score Overview CSI: Miami follows Crime Scene Investigators working for the Miami-Dade Police Department as they use physical evidence, similar to their Las Vegas counterparts, to solve grisly murders. The series mixes deduction, gritty subject matter, and character-driven drama in the same vein as the original series in the CSI franchise, except that the Miami CSIs are cops first, scientists second. Featured Crew Ann Donahue Creator Anthony Zuiker Creator Carol Mendelsohn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  15 Posters  8 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast David Caruso Horatio Caine Emily Procter Calleigh Duquesne Adam Rodríguez Eric Delko Rex Linn Frank Tripp Jonathan Togo Ryan Wolfe Full Cast & Crew Last Season Season 10 2011 | 19 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply L Did Horatio come from money? Open 0 by Lloyd\n      \n     w Calleigh: Happy Birthday Emily Procter! Open 0 by wonder2wonder\n      \n     w Ryan: Happy Birthday Jonathan Togo! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  8 Recommendations   2004-09-21 CSI: NY 6.7    2000-10-06 CSI: Crime Scene Investigation 6.7    2002-09-26 Without a Trace 6.8    2003-09-28 Cold Case 7.0    2006-03-05 Numb3rs 6.5    2001-09-30 Law & Order: Criminal Intent 7.1    1990-09-13 Law & Order 7.2    2005-09-23 Ghost Whisperer 5.6  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/csi-miami/ Genres Drama Mystery Keywords miami police detective crime spin off forensic science csi Content Score 100 Yes! Looking good! Top Contributors 114 Banana 18 d00ziie 17 lineker 14 MrSwift  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}