{"link": "https://www.themoviedb.org/tv/77778?language=en", "title": "A.I.C.O. -Incarnation-", "resume": "In Japan in the year 2035, an accident known as the \"Burst\" occurs during a research project, spawning an out-of-control artificial life form called \"Matter\" that has spread throughout the Kurobe Gorge. The research city that was once hailed as the hope for humanity is cordoned off by the government. Two years later, 15-year-old Aiko Tachibana, who lost her family in the Burst, learns something unbelievable from Yuya Kanzaki, a new student at her school. A secret is hidden within her body, and the answer to the puzzle lies at the \"Primary Point\" that was the center of the Burst. Aiko resolves to infiltrate the restricted area, escorted by a team of divers and with Yuya as her guide. When boy meets girl with the fate of humanity in their hands, what new truth will come to light?", "rate": 68, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Yuusuke Kobayashi", "Haruka Shiraishi", "Takehito Koyasu", "Toru Okawa", "Taishi Murata"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77778   Expand A.I.C.O. -Incarnation-   (2018) User Score  Play Trailer Overview In Japan in the year 2035, an accident known as the \"Burst\" occurs during a research project, spawning an out-of-control artificial life form called \"Matter\" that has spread throughout the Kurobe Gorge. The research city that was once hailed as the hope for humanity is cordoned off by the government. Two years later, 15-year-old Aiko Tachibana, who lost her family in the Burst, learns something unbelievable from Yuya Kanzaki, a new student at her school. A secret is hidden within her body, and the answer to the puzzle lies at the \"Primary Point\" that was the center of the Burst. Aiko resolves to infiltrate the restricted area, escorted by a team of divers and with Yuya as her guide. When boy meets girl with the fate of humanity in their hands, what new truth will come to light? Featured Crew Yuuichi Nomura Creator Kazuya Murata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuusuke Kobayashi Haruka Shiraishi Takehito Koyasu Toru Okawa Taishi Murata Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of A.I.C.O. -Incarnation- premiered on March  9, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A.I.C.O. -Incarnation-. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2018-03-02 B: The Beginning 7.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.project-aico.com/ Genres Animation Action & Adventure Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 16 neonime 14 sp1ti 13 jmf2k 9 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}