{"link": "https://www.themoviedb.org/tv/2461?language=en", "title": "Gladiators", "resume": "Gladiators is a British television entertainment series, produced by LWT for ITV, and broadcast between 10 October 1992 and 1 January 2000. It is an adaptation of the American format American Gladiators. The success of the British series spawned further adaptations in Australia and Sweden. The series was revived in 2008, before again being cancelled in 2009. The series was originally presented by John Fashanu and Ulrika Jonsson, however, Fashanu was replaced by Jeremy Guscott in 1997. Guscott left the series in 1998, and subsequently, Fashanu returned for the final series in 1999. The series was refereed by John Anderson and the timekeepers over the show's run were Andrew Norgate, Derek Redmond and Eugene Gilkes. John Sachs was the show's commentator, and the series was accompanied by its own group of cheerleaders, known as G-Force. Despite being made by London Weekend Television, all episodes of Gladiators, International Gladiators, the second series of The Ashes and the first series of The Springbok Challenge were recorded at the National Indoor Arena in Birmingham. The first series of The Ashes and the second series of the The Springbok Challenge, however, were filmed on the sets of the Australian and South African versions of the shows respectively. The series also spawned a version for children, entitled Gladiators: Train 2 Win, which was broadcast on CITV between 1995 and 1998.", "rate": 20, "genre": [], "cast": ["John Seru", "Suzanne Cox", "Eunice Huthart", "Ulrika Jonsson", "Michael Willson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2461   Expand Gladiators   (1992) User Score Overview Gladiators is a British television entertainment series, produced by LWT for ITV, and broadcast between 10 October 1992 and 1 January 2000. It is an adaptation of the American format American Gladiators. The success of the British series spawned further adaptations in Australia and Sweden. The series was revived in 2008, before again being cancelled in 2009. The series was originally presented by John Fashanu and Ulrika Jonsson, however, Fashanu was replaced by Jeremy Guscott in 1997. Guscott left the series in 1998, and subsequently, Fashanu returned for the final series in 1999. The series was refereed by John Anderson and the timekeepers over the show's run were Andrew Norgate, Derek Redmond and Eugene Gilkes. John Sachs was the show's commentator, and the series was accompanied by its own group of cheerleaders, known as G-Force. Despite being made by London Weekend Television, all episodes of Gladiators, International Gladiators, the second series of The Ashes and the first series of The Springbok Challenge were recorded at the National Indoor Arena in Birmingham. The first series of The Ashes and the second series of the The Springbok Challenge, however, were filmed on the sets of the Australian and South African versions of the shows respectively. The series also spawned a version for children, entitled Gladiators: Train 2 Win, which was broadcast on CITV between 1995 and 1998. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Seru Suzanne Cox Eunice Huthart Ulrika Jonsson Michael Willson Full Cast & Crew Last Season Season 8 1999 | 4 Episodes Season 8 of Gladiators premiered on December 11, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gladiators. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TB 2 TMDb Bot 1 Pandawan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}