{"link": "https://www.themoviedb.org/tv/79266?language=en", "title": "Spartacus: Gods of the Arena", "resume": "Before Spartacus struck down his first opponent in the arena, there were many gladiators who passed through the gates onto the sand.'Spartacus: Gods of the Arena' tells the story of the original Champion of the House of Batiatus: Gannicus, in a more ruthless time before Spartacus' arrival where honor was just finding its way into the arena.", "rate": 77, "genre": ["Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79266   Expand Spartacus: Gods of the Arena   (2011) User Score Overview Before Spartacus struck down his first opponent in the arena, there were many gladiators who passed through the gates onto the sand.'Spartacus: Gods of the Arena' tells the story of the original Champion of the House of Batiatus: Gannicus, in a more ruthless time before Spartacus' arrival where honor was just finding its way into the arena. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Spartacus: Gods of the Arena premiered on January 21, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2010-01-22 Spartacus 7.8    2006-10-04 Death Note 8.2    2011-12-04 Black Mirror 8.2    2006-10-01 Dexter 8.0    1994-09-22 Friends 7.8    2015-05-27 Mr. Robot 7.8    2001-09-09 Band of Brothers 8.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   https://www.starz.com/series/spartacus Genres Mystery Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 15 KakarotHUN z 8 zolenka 3 5 30344386@qq.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}