{"link": "https://www.themoviedb.org/tv/65656?language=en", "title": "The Lava Field", "resume": "When Reykjavik crime detective Helgi Marvin Runarsson is called in to investigate a suicide case on Snaefellsnes Peninsula, the case turns out to be far from simple. Pulled into a sinister trail of evidence, Helgi's own deeply hidden secrets are unearthed. Will Helgi turn a blind eye to murder in order to save the life of his daughter.", "rate": 64, "genre": ["Drama", "Crime"], "cast": ["Arnoddur Magnus Danks", "Salome R. Gunnarsdottir", "Unnur Birna Jónsdóttir", "Heida Reed"], "character": ["Össi", "Helena", "Hafdis", "Gréta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65656   Expand The Lava Field   (2014) User Score  Play Trailer Overview When Reykjavik crime detective Helgi Marvin Runarsson is called in to investigate a suicide case on Snaefellsnes Peninsula, the case turns out to be far from simple. Pulled into a sinister trail of evidence, Helgi's own deeply hidden secrets are unearthed. Will Helgi turn a blind eye to murder in order to save the life of his daughter. Featured Crew Reynir Lyngdal Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arnoddur Magnus Danks Össi Salome R. Gunnarsdottir Helena Unnur Birna Jónsdóttir Hafdis Heida Reed Gréta Full Cast & Crew Last Season Miniseries 2014 | 4 Episodes Season 1 of The Lava Field premiered on September 27, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2016-01-07 Deep 7.0  Facts Original Name  Hraunið Status  Ended Network Certification  - Type  Miniseries Original Language  Icelandic Runtime  220m Homepage   http://ruv.is/thaettir/hraunid Genres Drama Crime Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors m 20 mondauge74 16 Banana 10 Elizabeth Jennings K 5 Kadang  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}