{"link": "https://www.themoviedb.org/tv/71880?language=en", "title": "My Loser Husband", "resume": "Tsukasa Kobayashi has the appearance and educational background of an elite and earns a good salary, but he is actually incompetent at his job and makes mistakes frequently, earning the ire of his co-workers. Tsukasa was about to quit his job after much humiliation at work when he learns that his wife is pregnant.", "rate": 65, "genre": ["Drama"], "cast": ["Ryo Nishikido", "Mayu Matsuoka", "Imoto Ayako", "Mitsu Dan", "Kota Yabu"], "character": ["Tsukasa Kobayashi", "Sayaka Kobayashi", "Akari Machida", "Sayaka Kurokawa", "Yosuke Tadokoro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71880   Expand My Loser Husband   (2017) User Score Overview Tsukasa Kobayashi has the appearance and educational background of an elite and earns a good salary, but he is actually incompetent at his job and makes mistakes frequently, earning the ire of his co-workers. Tsukasa was about to quit his job after much humiliation at work when he learns that his wife is pregnant. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryo Nishikido Tsukasa Kobayashi Mayu Matsuoka Sayaka Kobayashi Imoto Ayako Akari Machida Mitsu Dan Sayaka Kurokawa Kota Yabu Yosuke Tadokoro Full Cast & Crew Last Season Season 1 2017 | 5 Episodes Season 1 of My Loser Husband premiered on July  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Loser Husband. You can help by rating TV shows you've seen. Facts Original Name  ウチの夫は仕事ができない Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.ntv.co.jp/shigotogadekinai/ Genres Drama Keywords japan Content Score 86 Almost there... Top Contributors 28 thirstyhippo M 16 Maria180493 3 無情天 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}