{"link": "https://www.themoviedb.org/tv/34943?language=en", "title": "Zen", "resume": "Zen is a British television mini series produced by Left Bank Pictures for the BBC, co-produced with WGBH Boston for its Masterpiece anthology series, Mediaset and ZDF. It stars Rufus Sewell and Caterina Murino and is based on the Aurelio Zen detective novels by Michael Dibdin. The series was filmed on location in Italy, but the dialogue is in English. The series, which comprises three 90-minute films, was broadcast in the United Kingdom on Sunday evenings from 2 January 2011 on BBC One. The three films were based on the books Vendetta, Cabal and Ratking.", "rate": 77, "genre": ["Drama"], "cast": ["Rufus Sewell", "Caterina Murino", "Callum Blue", "Valentina Cervi", "Julie Cox"], "character": ["Tania Moretti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34943   Expand Zen   (2013) User Score  Play Trailer Overview Zen is a British television mini series produced by Left Bank Pictures for the BBC, co-produced with WGBH Boston for its Masterpiece anthology series, Mediaset and ZDF. It stars Rufus Sewell and Caterina Murino and is based on the Aurelio Zen detective novels by Michael Dibdin. The series was filmed on location in Italy, but the dialogue is in English. The series, which comprises three 90-minute films, was broadcast in the United Kingdom on Sunday evenings from 2 January 2011 on BBC One. The three films were based on the books Vendetta, Cabal and Ratking. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rufus Sewell Caterina Murino Tania Moretti Callum Blue Valentina Cervi Julie Cox Full Cast & Crew Last Season Season 1 2013 | 3 Episodes Season 1 of Zen premiered on January  4, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply A detective with a touch of class. Open 1 by  Silvee Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  6 Recommendations   2004-05-13 The Murdoch Mysteries 5.5    1995-03-26 Hamish Macbeth 7.0    2009-10-19 Murderland 7.0    2011-06-05 Case Histories 8.2    2009-01-04 Above Suspicion 7.8    2000-09-04 Waking the Dead 7.9    1992-12-06 A Touch of Frost 7.9    2013-09-22 By Any Means 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/programmes/b00x9x43 Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors h 4 hopeless06128 h 4 hanyny 4 Zlogorek s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}