{"link": "https://www.themoviedb.org/tv/16133?language=en", "title": "Joan of Arc", "resume": "Joan of Arc is born in 1412 in the village of Domrémy in the war zone of Northern France. During her youth she often witnesses the horrors of war, but her spirit is kept high by the legend of the Maiden of Lorraine. This says that a young maiden one day will unite the divided country and lead the people to freedom.", "rate": 67, "genre": ["Drama"], "cast": ["Leelee Sobieski", "Powers Boothe", "Neil Patrick Harris", "Olympia Dukakis", "Shirley MacLaine"], "character": ["Joan D'Arc", "Jacques D'Arc", "The Dauphin, later King Charles VII of France", "Mother Babette", "Madame de Beaurevoir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16133   Expand Joan of Arc   (1999) User Score  Play Trailer Overview Joan of Arc is born in 1412 in the village of Domrémy in the war zone of Northern France. During her youth she often witnesses the horrors of war, but her spirit is kept high by the legend of the Maiden of Lorraine. This says that a young maiden one day will unite the divided country and lead the people to freedom. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leelee Sobieski Joan D'Arc Powers Boothe Jacques D'Arc Neil Patrick Harris The Dauphin, later King Charles VII of France Olympia Dukakis Mother Babette Shirley MacLaine Madame de Beaurevoir Full Cast & Crew Last Season Miniseries 1999 | 2 Episodes Season 1 of Joan of Arc premiered on May 16, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   1972-09-04 The Price Is Right 8.5    1995-05-14 The Langoliers 5.9    1994-05-08 The Stand 6.8    2012-01-01 Treasure Island 6.5    1995-09-13 The Drew Carey Show 6.4    2002-12-02 Taken 7.4    1983-05-01 V 7.3    1998-04-26 Merlin 6.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords france sword hundred years' war heilig dophin miniseries joan of arc 15th century Content Score 93 Almost there... Top Contributors TB 60 TMDb Bot R 13 Rebecca 11 Banana h 2 hanyny  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}