{"link": "https://www.themoviedb.org/tv/66120?language=en", "title": "Norn9: Norn+Nonet", "resume": "A man is transported through time and space to a special starship, where he and 12 other people must work out what happened.", "rate": 43, "genre": ["Sci-Fi", "Fantasy", "Animation", "Drama"], "cast": ["Ayumi Fujimura", "Atsushi Abe", "Kenji Hamada"], "character": ["Koharu", "Sorata Suzuhara", "Shiro Yuiga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66120   Expand Norn9: Norn+Nonet    (2016) User Score Overview A man is transported through time and space to a special starship, where he and 12 other people must work out what happened. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayumi Fujimura Koharu Atsushi Abe Sorata Suzuhara Kenji Hamada Shiro Yuiga Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Norn9: Norn+Nonet  premiered on January  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Norn9: Norn+Nonet . You can help by rating TV shows you've seen. Facts Original Name  Norn9 ノルン+ノネット Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.otomate.jp/norn9/ Genres Sci-Fi & Fantasy Animation Drama Keywords romance anime game adaptation Content Score 56 We're so close, yet so far. Top Contributors 39 Zlogorek m 3 magoozin 3 kamwatka f 2 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}