{"link": "https://www.themoviedb.org/tv/37602?language=en", "title": "The Shadow Line", "resume": "A noir thriller with diverse individuals whose worlds become interwoven after the murder of drug baron Harvey Wratten.\nFrom the cop with a bullet in his brain, whose amnesia leaves him doubtful of his own moral compass; to the drug-lord driven by a profound personal tragedy, risking it all on one last deal; to the brilliantly lethal puppet-master who gradually emerges from the shadows to bring the story to its shocking climax The Shadow Line explores the morality of these characters as they negotiate the repercussions of Wratten's death and attempt to navigate the fine line between right and wrong.\nAs the thread around Wratten's operation begins to unravel, the web of intrigue becomes more complex and the question of which side of the line they stand on becomes increasingly blurred. An intelligent and gripping conspiracy thriller that delves to the heart of human morality, The Shadow Line will have audiences enthralled over six taut and thrilling episodes. Faced with similar dilemmas, on which side of the line would you stand?", "rate": 81, "genre": ["Drama"], "cast": ["Chiwetel Ejiofor", "Christopher Eccleston", "Kierston Wareing", "Stephen Rea", "Rafe Spall"], "character": ["Jonah Gabriel", "Joseph Bede", "Lia Honey", "Gatehouse", "Jay Wratten"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37602   Expand The Shadow Line   (2011) User Score  Play Trailer Overview A noir thriller with diverse individuals whose worlds become interwoven after the murder of drug baron Harvey Wratten. From the cop with a bullet in his brain, whose amnesia leaves him doubtful of his own moral compass; to the drug-lord driven by a profound personal tragedy, risking it all on one last deal; to the brilliantly lethal puppet-master who gradually emerges from the shadows to bring the story to its shocking climax The Shadow Line explores the morality of these characters as they negotiate the repercussions of Wratten's death and attempt to navigate the fine line between right and wrong. As the thread around Wratten's operation begins to unravel, the web of intrigue becomes more complex and the question of which side of the line they stand on becomes increasingly blurred. An intelligent and gripping conspiracy thriller that delves to the heart of human morality, The Shadow Line will have audiences enthralled over six taut and thrilling episodes. Faced with similar dilemmas, on which side of the line would you stand? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chiwetel Ejiofor Jonah Gabriel Christopher Eccleston Joseph Bede Kierston Wareing Lia Honey Stephen Rea Gatehouse Rafe Spall Jay Wratten Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of The Shadow Line premiered on May  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2012-02-02 Inside Men 6.4    2011-06-06 Injustice 7.3    2011-01-13 Kidnap and Ransom 7.6    2009-02-02 Whitechapel 7.5    2006-01-01 In Justice 6.8    2007-08-05 The Company 7.0    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b0111dqc/ Genres Drama Keywords police england organized crime miniseries drug lord brit noir murder investigation Content Score 93 Almost there... Top Contributors 17 Elizabeth Jennings 16 lineker 9 Banana S 4 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}