{"link": "https://www.themoviedb.org/tv/69544?language=en", "title": "Murder Chose Me", "resume": "Homicide detective, Rod Demery, races against the clock to catch criminals running loose on the streets of Shreveport, Louisiana.", "rate": 70, "genre": ["Crime"], "cast": ["Rod Demery", "John Nicholson", "Jordan Eli Arellano"], "character": ["Himself", "Detective Rod Demery", "Young Rod Demery 1960"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69544   Expand Murder Chose Me   (2017) User Score Overview Homicide detective, Rod Demery, races against the clock to catch criminals running loose on the streets of Shreveport, Louisiana. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rod Demery Himself John Nicholson Detective Rod Demery Jordan Eli Arellano Young Rod Demery 1960 Full Cast & Crew Current Season Season 2 2018 | 7 Episodes Season 2 of Murder Chose Me premiered on March 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Murder Chose Me. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  60m Homepage   http://www.investigationdiscovery.com/tv-shows/murder-chose-me/ Genres Crime Keywords homicide detective shreveport Content Score 56 We're so close, yet so far. Top Contributors 19 Steve 10 Wong 6 Elizabeth Jennings 3 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}