{"link": "https://www.themoviedb.org/tv/35466?language=en", "title": "Ghost Stories", "resume": "When nearby construction disturbs a spiritual resting place, its disgruntled denizens do what any supernatural being would do after a rude awaking - they terrorize the local school. And that means it’s up to a scruffy band of young ghost hunters to expel their satanic schoolmates before everyone gets sent to permanent detention! Meet Satsuki, her crybaby brother, the resident class stud, the school nerd and “psychical researcher,” a born again beauty, and a resentful, demon-possessed cat in the funniest, scariest school you’ve ever enrolled in.\nThe series was originally dubbed in to English by ADV Films, whose dub replaces the original script with a comedic one. The series has also been translated and dubbed into English by the anime television network, Animax, who has broadcast the series unedited and uncensored under the title Ghosts at School.", "rate": 74, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Tomoko Kawakami", "Kotono Mitsuishi", "Kumi Sakuma", "Kurumi Mamiya", "Makoto Tsumura"], "character": ["Satsuki Miyanoshita", "Kayako Miyanoshita", "Momoko Koigakubo", "Keiichirou Miyanoshita", "Reo Kakinoki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35466   Expand Ghost Stories   (2000) User Score Overview When nearby construction disturbs a spiritual resting place, its disgruntled denizens do what any supernatural being would do after a rude awaking - they terrorize the local school. And that means it’s up to a scruffy band of young ghost hunters to expel their satanic schoolmates before everyone gets sent to permanent detention! Meet Satsuki, her crybaby brother, the resident class stud, the school nerd and “psychical researcher,” a born again beauty, and a resentful, demon-possessed cat in the funniest, scariest school you’ve ever enrolled in. The series was originally dubbed in to English by ADV Films, whose dub replaces the original script with a comedic one. The series has also been translated and dubbed into English by the anime television network, Animax, who has broadcast the series unedited and uncensored under the title Ghosts at School. Featured Crew Aniplex Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomoko Kawakami Satsuki Miyanoshita Kotono Mitsuishi Kayako Miyanoshita Kumi Sakuma Momoko Koigakubo Kurumi Mamiya Keiichirou Miyanoshita Makoto Tsumura Reo Kakinoki Full Cast & Crew Last Season Season 1 — | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2009-02-08 Sonny with a Chance 5.0  Facts Original Name  Gakkō no Kaidan Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords ghost Content Score 93 Almost there... Top Contributors 31 xyzl M 23 MiniCine F 4 FabioWC 4 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}