{"link": "https://www.themoviedb.org/tv/4284?language=en", "title": "H.R. Pufnstuf", "resume": "H.R. Pufnstuf is a children's television series produced by Sid and Marty Krofft in the United States. It was the first Krofft live-action, life-size puppet program. The seventeen episodes were originally broadcast from September 6, 1969 to December 27, 1969. The broadcasts were successful enough that NBC kept it on the Saturday morning schedule until August 1972. The show was shot in Paramount Studios and its opening was shot in Big Bear Lake, California. Reruns of the show aired on ABC Saturday morning from September 2, 1972 to September 8, 1973 and on Sunday mornings in some markets from September 16, 1973 to September 8, 1974. It was syndicated by itself from 1974 to 1978 and in a package with six other Kroft series under the banner Kroft Superstars from 1978 to 1985.\nIn 2004 and 2007, H.R. Pufnstuf was ranked #22 and #27 on TV Guide's Top Cult Shows Ever.", "rate": 68, "genre": ["Sci-Fi", "Fantasy", "Kids"], "cast": ["Jack Wild", "Billie Hayes", "Lennie Weinrib", "Sharon Baird", "Walker Edmiston"], "character": ["Jimmy", "Wilhemina W. Witchiepoo", "H.R. Pufnstuf", "Stupid Bat", "Boris Karloff Tree"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4284   Expand H.R. Pufnstuf   (1969) User Score Overview H.R. Pufnstuf is a children's television series produced by Sid and Marty Krofft in the United States. It was the first Krofft live-action, life-size puppet program. The seventeen episodes were originally broadcast from September 6, 1969 to December 27, 1969. The broadcasts were successful enough that NBC kept it on the Saturday morning schedule until August 1972. The show was shot in Paramount Studios and its opening was shot in Big Bear Lake, California. Reruns of the show aired on ABC Saturday morning from September 2, 1972 to September 8, 1973 and on Sunday mornings in some markets from September 16, 1973 to September 8, 1974. It was syndicated by itself from 1974 to 1978 and in a package with six other Kroft series under the banner Kroft Superstars from 1978 to 1985. In 2004 and 2007, H.R. Pufnstuf was ranked #22 and #27 on TV Guide's Top Cult Shows Ever. Featured Crew Marty Krofft Creator Sid Krofft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Wild Jimmy Billie Hayes Wilhemina W. Witchiepoo Lennie Weinrib H.R. Pufnstuf Sharon Baird Stupid Bat Walker Edmiston Boris Karloff Tree Full Cast & Crew Last Season Season 1 1969 | 17 Episodes Season 1 of H.R. Pufnstuf premiered on September  6, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1974-09-07 Land of the Lost 6.9    1974-09-09 Rhoda 4.5    1966-09-12 Family Affair 5.4    1963-09-29 My Favorite Martian 5.4    1957-09-14 Have Gun – Will Travel 8.3    1977-09-22 Man from Atlantis 5.6    1999-09-25 Relic Hunter 6.4    1972-10-14 Kung Fu 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Kids Keywords island magic puppet Content Score 93 Almost there... Top Contributors 9 Banana 3 DaMaN  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}