{"link": "https://www.themoviedb.org/tv/47450?language=en", "title": "Into the Badlands", "resume": "In a land controlled by feudal barons, a great warrior and a young boy embark on a journey across a dangerous land to find enlightenment. \nA genre-bending martial arts series very loosely based on the classic Chinese tale Journey to the West.", "rate": 74, "genre": ["Action", "Adventure"], "cast": ["Daniel Wu", "Emily Beecham", "Nick Frost", "Orla Brady", "Alexia Ioannides"], "character": ["Sunny", "The Widow", "Baije", "Lydia", "Tilda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47450   Expand Into the Badlands   (2015) User Score  Play Trailer Overview In a land controlled by feudal barons, a great warrior and a young boy embark on a journey across a dangerous land to find enlightenment.  A genre-bending martial arts series very loosely based on the classic Chinese tale Journey to the West. Featured Crew Miles Millar Creator Alfred Gough Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  0 Images Backdrops  21 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel Wu Sunny Emily Beecham The Widow Nick Frost Baije Orla Brady Lydia Alexia Ioannides Tilda Full Cast & Crew Current Season Season 3 2018 | 8 Episodes Season 3 of Into the Badlands premiered on April 22, 2018. View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply Season 2 finale Open 5 by  militades Cast and Crreative Video Interview: Wondercon 2018 Open 0 by garethmb\n      \n     D I knew it Open 2 by  Drew007 Go to Discussions Media Most Popular Videos  1 Backdrops  21 Posters  9 Recommendations   2016-01-14 Colony 6.8    2015-12-14 The Expanse 7.5    2016-05-22 Preacher 7.4    2015-10-10 The Last Kingdom 7.7    2016-01-05 The Shannara Chronicles 6.4    2015-11-20 Marvel's Jessica Jones 7.6    2016-01-22 Stan Lee's Lucky Man 7.3    2014-09-12 Z Nation 6.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.amc.com/shows/into-the-badlands Genres Action & Adventure Keywords martial arts post-apocalyptic enlightenment warrior feudal japan Content Score 100 Yes! Looking good! Top Contributors 98 Elizabeth Jennings 21 Imzadi 10 express 6 GHOST  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}