{"link": "https://www.themoviedb.org/tv/3435?language=en", "title": "Noah's Island", "resume": "Noah's Island was an animated children's television series made by the creators of The Animals of Farthing Wood and commissioned by the European Broadcasting Union. It was directed by Philippe Leclerc and Alan Simpson and written by Elphin Lloyd-Jones and John M. Mills. Each episode, of which there were 39, ran for 28 minutes. Although not as successful as Farthing Wood, it was fairly popular on Saturday mornings in many of the homes of the United Kingdom, particularly with its younger target audience. Based on the Bible story, Noah's Ark, the series was praised for its characterization, imaginative storylines and for introducing ecological themes in a way that delighted children.", "rate": 77, "genre": ["Animation"], "cast": ["Ron Moody", "Jon Glover", "Sally Grace", "David Holt"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3435   Expand Noah's Island   (1997) User Score Overview Noah's Island was an animated children's television series made by the creators of The Animals of Farthing Wood and commissioned by the European Broadcasting Union. It was directed by Philippe Leclerc and Alan Simpson and written by Elphin Lloyd-Jones and John M. Mills. Each episode, of which there were 39, ran for 28 minutes. Although not as successful as Farthing Wood, it was fairly popular on Saturday mornings in many of the homes of the United Kingdom, particularly with its younger target audience. Based on the Bible story, Noah's Ark, the series was praised for its characterization, imaginative storylines and for introducing ecological themes in a way that delighted children. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ron Moody Jon Glover Sally Grace David Holt Full Cast & Crew Last Season Season 3 — | 11 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Noah's Island. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 lohnjocke 2 Maretoh TB 1 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}