{"link": "https://www.themoviedb.org/tv/1506?language=en", "title": "Queer Eye for the Straight Guy", "resume": "Queer Eye is an American reality television series that premiered on the Bravo cable television network in July 2003. The program's name was changed from Queer Eye for the Straight Guy after the third season to broaden the scope of its content. The series was created by executive producers David Collins and Michael Williams along with their producing partner David Metzler; it was produced by their production company, Scout Productions.\nThe show is premised on and plays with the stereotypes that gay men are superior in matters of fashion, style, personal grooming, interior design and culture. In each episode, the team of five gay men known collectively as the \"Fab Five\" perform a makeover on a person, usually a straight man, revamping his wardrobe, redecorating his home and offering advice on grooming, lifestyle and food.\nQueer Eye for the Straight Guy debuted in 2003, and quickly became both a surprise hit and one of the most talked-about television programs of the year. The success of the show led to merchandising, franchising of the concept internationally, and a woman-oriented spin-off, Queer Eye for the Straight Girl. Queer Eye won an Emmy Award for Outstanding Reality Program in 2004. The show's name was shortened to Queer Eye at the beginning of its third season to reflect the show's change in direction from making over only straight men to including women and gay men. Queer Eye ended production in June 2006 and the final ten episodes aired in October 2007. The series ended October 30. In September 2008, the Fine Living Network briefly aired Queer Eye in syndication.", "rate": 60, "genre": ["Comedy", "Reality"], "cast": ["Jai Rodriguez", "Ted Allen", "Kyan Douglas", "Thom Filicia", "Blair Boone"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1506   Expand Queer Eye for the Straight Guy   (2003) User Score Overview Queer Eye is an American reality television series that premiered on the Bravo cable television network in July 2003. The program's name was changed from Queer Eye for the Straight Guy after the third season to broaden the scope of its content. The series was created by executive producers David Collins and Michael Williams along with their producing partner David Metzler; it was produced by their production company, Scout Productions. The show is premised on and plays with the stereotypes that gay men are superior in matters of fashion, style, personal grooming, interior design and culture. In each episode, the team of five gay men known collectively as the \"Fab Five\" perform a makeover on a person, usually a straight man, revamping his wardrobe, redecorating his home and offering advice on grooming, lifestyle and food. Queer Eye for the Straight Guy debuted in 2003, and quickly became both a surprise hit and one of the most talked-about television programs of the year. The success of the show led to merchandising, franchising of the concept internationally, and a woman-oriented spin-off, Queer Eye for the Straight Girl. Queer Eye won an Emmy Award for Outstanding Reality Program in 2004. The show's name was shortened to Queer Eye at the beginning of its third season to reflect the show's change in direction from making over only straight men to including women and gay men. Queer Eye ended production in June 2006 and the final ten episodes aired in October 2007. The series ended October 30. In September 2008, the Fine Living Network briefly aired Queer Eye in syndication. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jai Rodriguez Himself Ted Allen Himself Kyan Douglas Himself Thom Filicia Himself Blair Boone Himself Full Cast & Crew Last Season Season 5 2007 | 10 Episodes Season 5 of Queer Eye for the Straight Guy premiered on October  2, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Queer Eye for the Straight Guy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m, 54m Homepage  - Genres Comedy Reality Keywords gay makeover fashion show Content Score 86 Almost there... Top Contributors 19 Banana 3 lemonlyman g 2 g4gx4 1 Cor Cordium  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}