{"link": "https://www.themoviedb.org/tv/35080?language=en", "title": "Oddities", "resume": "Oddities is a half-hour documentary/reality television program which follows the operation of an East Village, Manhattan shop which trades in antiques and other rarities. The show premiered on November 4, 2010, and airs on the Discovery Channel and its sister network, the Science Channel.\nOddities focuses on the day-to-day operation of Obscura Antiques & Oddities, and stars co-owners Mike Zohn and Evan Michelson and buyer Ryan Matthew, with appearances by other employees and customers. The store's employees search flea markets, personal collections, auctions, and antique shows for unique and unusual artifacts. Odd items bought and sold by the shop or featured on the show have included a mummified cat, a Rhesus monkey skull, art made from nail clippings, and a straitjacket.\nCelebrities appearing on the show have included Jonathan Davis of the band Korn, Whitey Sterling, singer for the New York band Stiffs, Inc., musician Genesis P-Orridge, actress/comedian Amy Sedaris, actor Matthew Gray Gubler, artist Ann Hirsch, actress Chloë Sevigny, video game designer and commercial space flight enthusiast Richard Garriott, director Lloyd Kaufman, nerdcore rapper Schaffer The Darklord, musician Voltaire, artist Cynthia von Buhler, actor/comedian Paul Dinello, and \"High Pitch Eric\" of The Howard Stern Show. Legendary New York playwright Edgar Oliver has appeared on the program multliple times and appears in the show's title sequence admiring a straitjacket.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35080   Expand Oddities   (2010) User Score Overview Oddities is a half-hour documentary/reality television program which follows the operation of an East Village, Manhattan shop which trades in antiques and other rarities. The show premiered on November 4, 2010, and airs on the Discovery Channel and its sister network, the Science Channel. Oddities focuses on the day-to-day operation of Obscura Antiques & Oddities, and stars co-owners Mike Zohn and Evan Michelson and buyer Ryan Matthew, with appearances by other employees and customers. The store's employees search flea markets, personal collections, auctions, and antique shows for unique and unusual artifacts. Odd items bought and sold by the shop or featured on the show have included a mummified cat, a Rhesus monkey skull, art made from nail clippings, and a straitjacket. Celebrities appearing on the show have included Jonathan Davis of the band Korn, Whitey Sterling, singer for the New York band Stiffs, Inc., musician Genesis P-Orridge, actress/comedian Amy Sedaris, actor Matthew Gray Gubler, artist Ann Hirsch, actress Chloë Sevigny, video game designer and commercial space flight enthusiast Richard Garriott, director Lloyd Kaufman, nerdcore rapper Schaffer The Darklord, musician Voltaire, artist Cynthia von Buhler, actor/comedian Paul Dinello, and \"High Pitch Eric\" of The Howard Stern Show. Legendary New York playwright Edgar Oliver has appeared on the program multliple times and appears in the show's title sequence admiring a straitjacket. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2013 | 26 Episodes Season 4 of Oddities premiered on February  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oddities. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.dsc.discovery.com/tv/oddities/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 5 TMDb Bot m 3 manninp 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}