{"link": "https://www.themoviedb.org/tv/17968?language=en", "title": "Newswipe with Charlie Brooker", "resume": "Newswipe with Charlie Brooker was a British news review programme broadcast on BBC Four written and presented by Charlie Brooker. It is similar to Brooker's Screenwipe series which is also shown on BBC Four. A first series of six episodes ran between 25 March 2009 and 29 April 2009. A second series began on 19 January 2010 and concluded on 23 February 2010.", "rate": 82, "genre": ["News", "Documentary"], "cast": ["Charlie Brooker"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17968   Expand Newswipe with Charlie Brooker   (2009) User Score Overview Newswipe with Charlie Brooker was a British news review programme broadcast on BBC Four written and presented by Charlie Brooker. It is similar to Brooker's Screenwipe series which is also shown on BBC Four. A first series of six episodes ran between 25 March 2009 and 29 April 2009. A second series began on 19 January 2010 and concluded on 23 February 2010. Featured Crew Charlie Brooker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Brooker Presenter Full Cast & Crew Last Season Season 2 2010 | 6 Episodes Season 2 of Newswipe with Charlie Brooker premiered on January 19, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1979-10-16 Not The Nine O'Clock News 6.0    Charlie Brooker's Weekly Wipe 8.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00jhp50 Genres News Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 2 Banana 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}