{"link": "https://www.themoviedb.org/tv/8681?language=en", "title": "BBC Wildlife Specials", "resume": "The BBC Wildlife Specials are a series of nature documentary programmes commissioned by BBC Television. The Wildlife Specials began with a pilot episode in 1995. 20 programmes have been made to date, with three of the recent ones being in multi parts. The earlier programmes were produced in-house by the BBC's specialist Natural History Unit, but the more recent Spy in the... titles were made by the independent John Downer Productions. The first 18 programmes, up to 2008, were narrated by David Attenborough. The most recent two were narrated by David Tennant.\n\"The world's leading natural history filmmakers meet the world's most charismatic animals\"\n— BBC tagline", "rate": 90, "genre": ["Documentary"], "cast": ["David Attenborough"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8681   Expand BBC Wildlife Specials   (1995) User Score Overview The BBC Wildlife Specials are a series of nature documentary programmes commissioned by BBC Television. The Wildlife Specials began with a pilot episode in 1995. 20 programmes have been made to date, with three of the recent ones being in multi parts. The earlier programmes were produced in-house by the BBC's specialist Natural History Unit, but the more recent Spy in the... titles were made by the independent John Downer Productions. The first 18 programmes, up to 2008, were narrated by David Attenborough. The most recent two were narrated by David Tennant. \"The world's leading natural history filmmakers meet the world's most charismatic animals\" — BBC tagline Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Attenborough Full Cast & Crew Last Season The wildlife specials season 1 1995 | 30 Episodes Season 1 of BBC Wildlife Specials premiered on April 14, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2016-11-06 Planet Earth II 8.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Documentary Keywords animal nature documentary Content Score 56 We're so close, yet so far. Top Contributors TB 3 TMDb Bot 2 rudely_murray s 2 sedplan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}