{"link": "https://www.themoviedb.org/tv/63470?language=en", "title": "Cheo Yong", "resume": "Detective Yoon Cheo-yong was born with the supernatural ability to see, hear and touch ghosts. He solves mysterious, unsolved cases along with tough and passionate colleague Ha Sun-woo, and Han Na-young, the ghost of a high school girl.", "rate": 74, "genre": ["Action", "Crime", "Horror", "Mystery"], "cast": ["Oh Ji-ho", "Jun Hyo-seong", "Ha Yeon-joo", "Ju Jin-mo", "Yoo Seung-mok"], "character": ["Yoon Cheo-yong", "Han Na-young", "Jung Ha-yoon", "Kang Ki-young", "Byun Gook-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63470   Expand Cheo Yong   (2014) User Score Overview Detective Yoon Cheo-yong was born with the supernatural ability to see, hear and touch ghosts. He solves mysterious, unsolved cases along with tough and passionate colleague Ha Sun-woo, and Han Na-young, the ghost of a high school girl. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Ji-ho Yoon Cheo-yong Jun Hyo-seong Han Na-young Ha Yeon-joo Jung Ha-yoon Ju Jin-mo Kang Ki-young Yoo Seung-mok Byun Gook-jin Full Cast & Crew Last Season Season 2 2015 | 10 Episodes Season 2 of Cheo Yong premiered on August 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  8 Recommendations   2016-03-14 Nightmare Teacher 7.5    2014-10-13 Tomorrow's Cantabile 7.3    2008-03-16 Fated to Love You 7.3    2016-11-21 White Nights 8.0    2011-08-08 Birdie Buddy 7.7    2014-10-04 Bad Guys 7.6    2017-09-04 Argon 6.8    2016-03-23 Click your Heart 7.0  Facts Original Name  귀신보는 형사, 처용 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  75m Homepage   http://program.interest.me/ocn/cheo-yong2 Genres Action Crime Horror Mystery Keywords thriller korea Content Score 86 Almost there... Top Contributors t 60 tmdb38202327 z 5 zurman1 c 3 creativo 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}