{"link": "https://www.themoviedb.org/tv/10982?language=en", "title": "Miami Ink", "resume": "Miami Ink brings together a brotherhood of tattoo artists. They learned their craft together as apprentices in South Beach. Then they went their separate ways. From Los Angeles to New York, all have become renowned artists with celebrity clientele that wait months to be inked by the masters. Now, 10 years later, they're coming home. Back to the place where it all began, South Beach, to open a tattoo shop together, live together and teach their traditions to a new generation.", "rate": 60, "genre": ["Reality"], "cast": ["Ami James", "Chris Núñez", "Darren Brass", "Chris Garver", "Yoji Harada"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10982   Expand Miami Ink   (2005) User Score Overview Miami Ink brings together a brotherhood of tattoo artists. They learned their craft together as apprentices in South Beach. Then they went their separate ways. From Los Angeles to New York, all have become renowned artists with celebrity clientele that wait months to be inked by the masters. Now, 10 years later, they're coming home. Back to the place where it all began, South Beach, to open a tattoo shop together, live together and teach their traditions to a new generation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ami James Himself Chris Núñez Himself Darren Brass Himself Chris Garver Himself Yoji Harada Himself Full Cast & Crew Last Season Season 3 2007 | 4 Episodes Season 3 of Miami Ink premiered on June 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1995-09-16 Brotherly Love 6.3    1987-09-26 ALF: The Animated Series 5.7    MTV Cribs 4.7    2012-10-16 Tattoo Nightmares 6.3    1986-09-15 Rambo 5.7    2007-08-07 LA Ink 6.3    1986-09-17 Filmation's Ghostbusters 5.7    2002-01-08 Last Call with Carson Daly 2.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  43m, 60m Homepage   http://www.tlc.com/tv-shows/miami-ink/ Genres Reality Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 United600 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}