{"link": "https://www.themoviedb.org/tv/61910?language=en", "title": "Battlestar Galactica: Razor Flashbacks", "resume": "A series of webisodes that tell the story of William Adama who as a youth uncovers a Cylon experiment while serving in the first Cylon War.", "rate": 69, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Nico Cortez", "Jacob Blair", "Edward James Olmos"], "character": ["Young William Adama", "Squad Leader Banzai", "Commander William Adama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61910   Expand Battlestar Galactica: Razor Flashbacks   (2007) User Score Overview A series of webisodes that tell the story of William Adama who as a youth uncovers a Cylon experiment while serving in the first Cylon War. Featured Crew Wayne Rose Creator Félix Enríquez Alcalá Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Nico Cortez Young William Adama Jacob Blair Squad Leader Banzai Edward James Olmos Commander William Adama Full Cast & Crew Last Season Season 1 2007 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2008-12-12 Battlestar Galactica: The Face of the Enemy 8.0    2006-09-05 Battlestar Galactica: The Resistance 8.0    2007-07-23 Saving Grace 8.0    1997-09-16 Cow and Chicken 6.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  3m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 36 Batliebre A 6 ArgonMcKhaan z 5 zurman1 CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}