{"link": "https://www.themoviedb.org/tv/38735?language=en", "title": "Marry Me", "resume": "Rae Ann Carter always wanted the fairytale where she meets a prince, falls in love and gets married, but feared that dream would never come true. Suddenly, Rae goes from having no man in her life to having three –charming Luke, passionate Adam, and sophisticated Harry – all in love with Rae and asking to marry her. Which man will she choose?", "rate": 66, "genre": ["Comedy", "Drama"], "cast": ["Lucy Liu", "Bobby Cannavale", "Steven Pasquale", "Enrique Murciano", "Danielle Nicolet"], "character": ["Rae Ann Carter", "Adam", "Luke Maynard", "Harry", "Candace"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38735   Expand Marry Me   (2010) User Score Overview Rae Ann Carter always wanted the fairytale where she meets a prince, falls in love and gets married, but feared that dream would never come true. Suddenly, Rae goes from having no man in her life to having three –charming Luke, passionate Adam, and sophisticated Harry – all in love with Rae and asking to marry her. Which man will she choose? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucy Liu Rae Ann Carter Bobby Cannavale Adam Steven Pasquale Luke Maynard Enrique Murciano Harry Danielle Nicolet Candace Full Cast & Crew Last Season Season 1 2010 | 2 Episodes Season 1 of Marry Me premiered on December 12, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Marry Me. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  84m Homepage  - Genres Comedy Drama Keywords romantic comedy choice miniseries wedding dating searching for love Content Score 86 Almost there... Top Contributors 38 Banana TB 20 TMDb Bot 2 seawolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}