{"link": "https://www.themoviedb.org/tv/10283?language=en", "title": "Archer", "resume": "Sterling Archer is the world's most daunting spy. He works for ISIS, a spy agency run by his mother. In between dealing with his boss and his co-workers - one of whom is his ex-girlfriend - Archer manages to annoy or seduce everyone that crosses his path. His antics are only excusable because at the end of the day, he still somehow always manages to thwart whatever crises was threatening mankind.", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Drama", "Comedy"], "cast": ["H. Jon Benjamin", "Aisha Tyler", "Jessica Walter", "Chris Parnell", "Judy Greer"], "character": ["Sterling Archer (voice)", "Lana Kane (voice)", "Malory Archer (voice)", "Cyril Figgis (voice)", "Cheryl Tunt (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10283   Expand Archer   (2009) User Score  Play Trailer Overview Sterling Archer is the world's most daunting spy. He works for ISIS, a spy agency run by his mother. In between dealing with his boss and his co-workers - one of whom is his ex-girlfriend - Archer manages to annoy or seduce everyone that crosses his path. His antics are only excusable because at the end of the day, he still somehow always manages to thwart whatever crises was threatening mankind. Featured Crew Adam Reed Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  10 Images Backdrops  35 Posters  16 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast H. Jon Benjamin Sterling Archer (voice) Aisha Tyler Lana Kane (voice) Jessica Walter Malory Archer (voice) Chris Parnell Cyril Figgis (voice) Judy Greer Cheryl Tunt (voice) Full Cast & Crew Current Season Danger Island 2018 | 8 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply season 8 premiere Open 7 by  Dedoc1967 Finally on Season 7 Open 1 by  Dedoc1967 Go to Discussions Media Most Popular Videos  2 Backdrops  35 Posters  16 Recommendations   2005-08-04 It's Always Sunny in Philadelphia 8.2    2010-06-29 Louie 7.7    1999-03-28 Futurama 8.2    2009-09-17 Community 7.9    2003-11-02 Arrested Development 8.2    1997-08-13 South Park 7.8    2009-04-09 Parks and Recreation 7.9    2005-03-24 The Office 8.0  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://www.fxnetworks.com/shows/archer Genres Action & Adventure Animation Drama Comedy Keywords cia spy drugs Content Score 100 Yes! Looking good! Top Contributors 74 Elizabeth Jennings 32 Travis Bell 18 Nuno Filipe de Vilhena Santos 17 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}