{"link": "https://www.themoviedb.org/tv/5164?language=en", "title": "JoJo's Circus", "resume": "JoJo's Circus is an interactive stop-motion musical comedy series for preschool children. The series is created by the combined efforts of Jim Jinkins, David Campbell, Lisa Jinkins and Eric Weiner and produced by Cuppa Coffee Studios and Cartoon Pizza. The series is written by Douglas Wood, the creative executive for Tiny Toon Adventures and Animaniacs. It first aired on the Disney Channel as part of the Playhouse Disney morning programming schedule from September 28, 2003 to February 14, 2007, It is currently being broadcast on Disney Junior. JoJo's Circus marks as the first Claymation series done by Jinkins himself. It features songs with music by Jeffrey Zahn and Jim Latham and lyrics done by Judy Rothman.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Jayne Eastwood", "Madeleine Martin", "David Sparrow"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5164   Expand JoJo's Circus   (2003) User Score Overview JoJo's Circus is an interactive stop-motion musical comedy series for preschool children. The series is created by the combined efforts of Jim Jinkins, David Campbell, Lisa Jinkins and Eric Weiner and produced by Cuppa Coffee Studios and Cartoon Pizza. The series is written by Douglas Wood, the creative executive for Tiny Toon Adventures and Animaniacs. It first aired on the Disney Channel as part of the Playhouse Disney morning programming schedule from September 28, 2003 to February 14, 2007, It is currently being broadcast on Disney Junior. JoJo's Circus marks as the first Claymation series done by Jinkins himself. It features songs with music by Jeffrey Zahn and Jim Latham and lyrics done by Judy Rothman. Featured Crew Jim Jinkins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jayne Eastwood Madeleine Martin David Sparrow Full Cast & Crew Last Season Season 3 2006 | 7 Episodes Season 3 of JoJo's Circus premiered on May  6, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on JoJo's Circus. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  21m, 30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors A 2 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}