{"link": "https://www.themoviedb.org/tv/2379?language=en", "title": "Z-Cars", "resume": "Z-Cars or Z Cars is a British television drama series centred on the work of mobile uniformed police in the fictional town of Newtown, based on Kirkby, Merseyside. Produced by the BBC, it debuted in January 1962 and ran until September 1978.", "rate": 0, "genre": ["Drama"], "cast": ["James Ellis", "Colin Welland", "Dudley Foster", "Frank Windsor", "Leslie Sands"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2379   Expand Z-Cars   (1962) User Score Overview Z-Cars or Z Cars is a British television drama series centred on the work of mobile uniformed police in the fictional town of Newtown, based on Kirkby, Merseyside. Produced by the BBC, it debuted in January 1962 and ran until September 1978. Featured Crew Troy Kennedy Martin Creator Allan Prior Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Ellis Colin Welland Dudley Foster Frank Windsor Leslie Sands Full Cast & Crew Last Season Series 9 1974 | 32 Episodes Season 9 of Z-Cars premiered on September  9, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Z-Cars. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 14 Rebecca 3 Daemon 3 rudely_murray t🇧 1 ticao2 🇧🇷 pt-BR  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}