{"link": "https://www.themoviedb.org/tv/21269?language=en", "title": "Superbook", "resume": "Superbook, also known as Animated Parent and Child Theatre, is an anime television series initially produced by Tatsunoko Productions in Japan in conjunction with the Christian Broadcasting Network in the United States and more recently solely produced by CBN for global distribution and broadcast.\nThe series chronicled the events of the Bible's Old and New Testaments in its 52 episode run. The first 26 episodes aired from October 1, 1981 to March 29, 1982. The series returned as Superbook II with 26 episodes to air from April 4, 1983 to September 26, 1983. Between both series in the first run was the companion series The Flying House. The Christian Broadcasting Network is currently producing a new Superbook series and has released fourteen episodes.\nThe original series was broadcast on TV Tokyo, Fuji Television, and on various local stations across Japan, achieving good ratings during its broadcast run. The English version was aired on CBN Cable, and in syndication. It was previously seen on the Trinity Broadcasting Network, but is currently off the schedule.", "rate": 73, "genre": ["Animation"], "cast": ["Masako Sugaya", "Katsue Miwa", "Hiroshi Masuoka", "Fumio Matsuoka", "Runa Akiyama"], "character": ["Sho Asuka", "Azusa Yamato", "Zenmai Jikake", "Professor Asuka", "Yuu Asuka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21269   Expand Superbook   (1981) User Score Overview Superbook, also known as Animated Parent and Child Theatre, is an anime television series initially produced by Tatsunoko Productions in Japan in conjunction with the Christian Broadcasting Network in the United States and more recently solely produced by CBN for global distribution and broadcast. The series chronicled the events of the Bible's Old and New Testaments in its 52 episode run. The first 26 episodes aired from October 1, 1981 to March 29, 1982. The series returned as Superbook II with 26 episodes to air from April 4, 1983 to September 26, 1983. Between both series in the first run was the companion series The Flying House. The Christian Broadcasting Network is currently producing a new Superbook series and has released fourteen episodes. The original series was broadcast on TV Tokyo, Fuji Television, and on various local stations across Japan, achieving good ratings during its broadcast run. The English version was aired on CBN Cable, and in syndication. It was previously seen on the Trinity Broadcasting Network, but is currently off the schedule. Featured Crew Katsue Miwa Azusa Yamato Creator Masako Sugaya Sho Asuka Creator Hiroshi Masuoka Zenmai Jikake Creator Fumio Matsuoka Professor Asuka Creator Runa Akiyama Yuu Asuka Creator Eiji Maruyama God Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  3 Top Billed Cast Masako Sugaya Sho Asuka Katsue Miwa Azusa Yamato Hiroshi Masuoka Zenmai Jikake Fumio Matsuoka Professor Asuka Runa Akiyama Yuu Asuka Full Cast & Crew Last Season Season 2 1983 | 26 Episodes Season 2 of Superbook premiered on April  4, 1983. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Superbook. Login to be first! Go to Discussions Media Most Popular Videos  4 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Superbook. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  25m Homepage   https://www.cbn.com/partners/video/premiumcontent/kids/superbookclassic Genres Animation Keywords adventure christian animation Content Score 100 Yes! Looking good! Top Contributors R 29 RamonB 10 wells 4 Zlogorek TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}