{"link": "https://www.themoviedb.org/tv/3231?language=en", "title": "Match of the Day 2", "resume": "Match of the Day 2 is a football highlights programme shown on BBC One in the United Kingdom having previously been shown on BBC Two up until 2012. It was created in 2004 when the BBC regained the right to broadcast Premier League highlights.\nBroadcast on Sunday evenings, usually later than 10 p.m., it is advertised as a \"light-hearted look at the Premier League's action\", referring to its more fan focused presentational style than the Saturday night version. Launched with an anchor of Adrian Chiles and analysis from two pundits. Adrian Chiles became popular in this role. In 2010 he was replaced by Colin Murray who left Channel 5 to take up the position at the beginning of the 2010/11 season and to also host the BBC World Cup coverage in 2010. In early 2013 it was announced that Mark Chapman who had hosted MOTD2 before when Colin was unavailable and also hosted Final Score would replace Murray at the start of the 2013-14 season. It was then announced Colin will stay with the BBC presenting darts and American football. Like its sister programme, it is broadcast from MediaCityUK in Salford Quays on the banks of the Manchester Ship Canal in Greater Manchester.", "rate": 53, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3231   Expand Match of the Day 2 User Score Overview Match of the Day 2 is a football highlights programme shown on BBC One in the United Kingdom having previously been shown on BBC Two up until 2012. It was created in 2004 when the BBC regained the right to broadcast Premier League highlights. Broadcast on Sunday evenings, usually later than 10 p.m., it is advertised as a \"light-hearted look at the Premier League's action\", referring to its more fan focused presentational style than the Saturday night version. Launched with an anchor of Adrian Chiles and analysis from two pundits. Adrian Chiles became popular in this role. In 2010 he was replaced by Colin Murray who left Channel 5 to take up the position at the beginning of the 2010/11 season and to also host the BBC World Cup coverage in 2010. In early 2013 it was announced that Mark Chapman who had hosted MOTD2 before when Colin was unavailable and also hosted Final Score would replace Murray at the start of the 2013-14 season. It was then announced Colin will stay with the BBC presenting darts and American football. Like its sister programme, it is broadcast from MediaCityUK in Salford Quays on the banks of the Manchester Ship Canal in Greater Manchester. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2016 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.bbc.co.uk/programmes/b007t9yb Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 3 Elizabeth Jennings 3 danny.payne b 2 bangcaw H 2 HasanPicker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}