{"link": "https://www.themoviedb.org/tv/11441?language=en", "title": "West Point", "resume": "The West Point Story is a dramatic anthology television series shown in the United States by Columbia Broadcasting System during the 1956-57 season and by ABC during the 1957-58 season.\nThe West Point Story, produced with the full cooperation of the United States Department of Defense and the United States Military Academy, was said to be based on actual files documenting many of the real-life dramatic occurrences at West Point over the years. Names and dates were altered in order to protect the privacy of the real people portrayed, however. The program was at first hosted by a fictional cadet, Charles C. Thompson, but this device was discontinued prior to the end of 1956.\nDuring its second season on ABC, The West Point Story was in competition with NBC's The Californians, set in San Francisco during the gold rush of the 1850s, and with The $64,000 Question quiz series on CBS. The West Point Story was replaced on the summer schedule in 1958 by Jack Wyatt's Confession, which continued to air during the first half of the 1958-1959 season in the 10 p.m. Tuesday evening time slot.\nAt the time that The West Point Story was broadcast, four other military dramas aired either through syndication or on the major networks: Harbor Command, Navy Log, The Silent Service, and Men of Annapolis.", "rate": 0, "genre": ["Drama"], "cast": ["Donald May"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11441   Expand West Point   (1956) User Score Overview The West Point Story is a dramatic anthology television series shown in the United States by Columbia Broadcasting System during the 1956-57 season and by ABC during the 1957-58 season. The West Point Story, produced with the full cooperation of the United States Department of Defense and the United States Military Academy, was said to be based on actual files documenting many of the real-life dramatic occurrences at West Point over the years. Names and dates were altered in order to protect the privacy of the real people portrayed, however. The program was at first hosted by a fictional cadet, Charles C. Thompson, but this device was discontinued prior to the end of 1956. During its second season on ABC, The West Point Story was in competition with NBC's The Californians, set in San Francisco during the gold rush of the 1850s, and with The $64,000 Question quiz series on CBS. The West Point Story was replaced on the summer schedule in 1958 by Jack Wyatt's Confession, which continued to air during the first half of the 1958-1959 season in the 10 p.m. Tuesday evening time slot. At the time that The West Point Story was broadcast, four other military dramas aired either through syndication or on the major networks: Harbor Command, Navy Log, The Silent Service, and Men of Annapolis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Donald May Full Cast & Crew Last Season Season 1 1956 | 39 Episodes Season 1 of West Point premiered on October  5, 1956. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on West Point. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords anthology Content Score 43 There's no 'I' in team... Top Contributors m 9 movienator 3 Banana 3 puyol t🇧 1 ticao2 🇧🇷 pt-BR  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}