{"link": "https://www.themoviedb.org/tv/62518?language=en", "title": "Sin City Saints", "resume": "An off-beat comedy set in the front office of a fictional pro basketball expansion team and centered on Jake Tullus, a Silicon Valley tycoon whose lifelong dream was to buy a pro basketball team but quickly finds he’s in over his head. The group he assembled to run Las Vegas’ first pro sports team won’t be much help.", "rate": 60, "genre": ["Comedy"], "cast": ["Andrew Santino", "Malin Åkerman", "Keith Powers", "Justin Chon", "B.K. Cannon"], "character": ["Jake Tullus", "Dusty Halford", "LaDarius Pope", "Byron Summers", "Melissa Stanton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62518   Expand Sin City Saints   (2015) User Score Overview An off-beat comedy set in the front office of a fictional pro basketball expansion team and centered on Jake Tullus, a Silicon Valley tycoon whose lifelong dream was to buy a pro basketball team but quickly finds he’s in over his head. The group he assembled to run Las Vegas’ first pro sports team won’t be much help. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Santino Jake Tullus Malin Åkerman Dusty Halford Keith Powers LaDarius Pope Justin Chon Byron Summers B.K. Cannon Melissa Stanton Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Sin City Saints premiered on March 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sin City Saints. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   https://screen.yahoo.com/sin-city-saints/ Genres Comedy Keywords sport basketball las vegas Content Score 86 Almost there... Top Contributors 26 Elizabeth Jennings 9 Banana d 1 dshill5 d 1 dho4765  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}