{"link": "https://www.themoviedb.org/tv/764?language=en", "title": "Midsomer Murders", "resume": "The peacefulness of the Midsomer community is shattered by violent crimes, suspects are placed under suspicion, and it is up to a veteran DCI and his young sergeant to calmly and diligently eliminate the innocent and ruthlessly pursue the guilty.", "rate": 77, "genre": ["Crime", "Drama", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 764   Expand Midsomer Murders   (1997) User Score Overview The peacefulness of the Midsomer community is shattered by violent crimes, suspects are placed under suspicion, and it is up to a veteran DCI and his young sergeant to calmly and diligently eliminate the innocent and ruthlessly pursue the guilty.  Featured Crew Anthony Horowitz Creator Caroline Graham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  3 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Next Season Season 20 2018 | 6 Episodes Season 20 of Midsomer Murders is set to premiere on August  1, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Why so many sidekicks? Open 3 by  Stratego! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations   1987-01-06 Inspector Morse 7.7    1989-01-08 Agatha Christie's Poirot 7.9    2007-02-18 Inspector Lewis 7.6    2011-09-16 DCI Banks 7.9    2012-01-02 Endeavour 8.1    2000-09-04 Waking the Dead 7.9    1997-05-09 Jonathan Creek 7.7    2002-10-27 Foyle's War 8.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://www.itv.com/midsomermurders/ Genres Crime Drama Mystery Keywords england police detective murder investigation police inspector Content Score 64 We're so close, yet so far. Top Contributors 54 Elizabeth Jennings m 31 miro22 S 23 Shady12 m 22 michael47  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}