{"link": "https://www.themoviedb.org/tv/8040?language=en", "title": "Departures", "resume": "From epic landscapes and unforgettable culture, to the often trying times that come with international travel, Departures chronicles the unforgettable friendships, personal successes and sometimes crushing disappointments that befall travellers Scott Wilson and Justin Lukach on their journey. Departures is as much about the journey as it is the destination.", "rate": 93, "genre": ["Documentary"], "cast": ["Scott Wilson", "Justin Lukach"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8040   Expand Departures   (2008) User Score Overview From epic landscapes and unforgettable culture, to the often trying times that come with international travel, Departures chronicles the unforgettable friendships, personal successes and sometimes crushing disappointments that befall travellers Scott Wilson and Justin Lukach on their journey. Departures is as much about the journey as it is the destination. Featured Crew Scott Wilson Creator Andre Dupuis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Scott Wilson Himself Justin Lukach Himself Full Cast & Crew Last Season Season 3 2010 | 16 Episodes Season 3 of Departures premiered on March  6, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2015-02-20 Richie Rich 3.0    2016-06-02 Hibana: Spark 7.8  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  46m Homepage   http://www.departuresentertainment.com/ Genres Documentary Keywords canada japan cambodia new zealand thailand jordan friends travel india ascension island cook islands Content Score 71 Just a little bit more... Top Contributors 29 Joe Carson 20 United600 D 4 DracoAn s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}