{"link": "https://www.themoviedb.org/tv/47806?language=en", "title": "Hunderby", "resume": "Hunderby is a British sitcom produced by Sky, written by Julia Davis, that was first broadcast on Sky Atlantic in 2012. The series won two awards at the British Comedy Awards in 2012.", "rate": 80, "genre": ["Comedy"], "cast": ["Julia Davis", "Alexandra Roach", "Alex MacQueen", "Rebekah Staton", "Rosie Cavaliero"], "character": ["Dorothy", "Helene", "Edmund", "Annie", "Hesther"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47806   Expand Hunderby   (2012) User Score Overview Hunderby is a British sitcom produced by Sky, written by Julia Davis, that was first broadcast on Sky Atlantic in 2012. The series won two awards at the British Comedy Awards in 2012. Featured Crew Julia Davis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Davis Dorothy Alexandra Roach Helene Alex MacQueen Edmund Rebekah Staton Annie Rosie Cavaliero Hesther Full Cast & Crew Last Season Season 2 2015 | 2 Episodes Season 2 of Hunderby premiered on December 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1999-11-12 Hippies 7.3    2006-02-27 Snuff Box 8.2    2004-05-18 The Mighty Boosh 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords sitcom 19th century british humour period sitcom Content Score 93 Almost there... Top Contributors 11 EveDemocracy t 8 tmdb48730457 7 Banana 4 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}