{"link": "https://www.themoviedb.org/tv/64506?language=en", "title": "Z: The Beginning of Everything", "resume": "A biography series based on the life of Zelda Sayre Fitzgerald, the brilliant, beautiful and talented Southern Belle who becomes the original flapper and icon of the wild, flamboyant Jazz Age in the 20s. Z starts before Zelda Fitzgerald meets the unpublished writer F. Scott Fitzgerald and moves through their passionate, turbulent love affair and their marriage-made in heaven, lived out in hell as the celebrity couple of their time.", "rate": 75, "genre": ["Drama"], "cast": ["Christina Ricci", "Gavin Stenhouse", "David Strathairn", "Kristine Nielsen", "David Hoflin"], "character": ["Zelda Fitzgerald", "F. Scott Fitzgerald", "Judge Anthony Sayre", "Minnie Sayre", "F. Scott Fitzgerald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64506   Expand Z: The Beginning of Everything   (2017) User Score Overview A biography series based on the life of Zelda Sayre Fitzgerald, the brilliant, beautiful and talented Southern Belle who becomes the original flapper and icon of the wild, flamboyant Jazz Age in the 20s. Z starts before Zelda Fitzgerald meets the unpublished writer F. Scott Fitzgerald and moves through their passionate, turbulent love affair and their marriage-made in heaven, lived out in hell as the celebrity couple of their time. Featured Crew Dawn Prestwich Creator Nicole Yorkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Ricci Zelda Fitzgerald Gavin Stenhouse F. Scott Fitzgerald David Strathairn Judge Anthony Sayre Kristine Nielsen Minnie Sayre David Hoflin F. Scott Fitzgerald Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Z: The Beginning of Everything premiered on January 27, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply TV-14? Open 1 by  TheVorlon L Beginning of the end Open 0 by LoriKJones\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2015-01-15 Mad Dogs 6.8    2016-04-10 The Girlfriend Experience 5.5    2011-09-20 New Girl 6.5    2017-03-31 13 Reasons Why 7.2  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  27m, 30m Homepage   https://www.amazon.com/dp/B017APVGL4 Genres Drama Keywords biography period drama 1920s Content Score 93 Almost there... Top Contributors z 22 zyck 18 Elizabeth Jennings N 11 NoemiTalavera 8 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}