{"link": "https://www.themoviedb.org/tv/3034?language=en", "title": "Scene of the Crime", "resume": "Tatort is a long-running German/Austrian/Swiss, crime television series set in various parts of these countries. The show is broadcast on the channels of ARD in Germany, ORF 2 in Austria and SF1 in Switzerland. The first episode was broadcast on November 29, 1970. The opening sequence for the series has remained the same throughout the decades, which remains highly unusual for any such long-running TV series up to date.\nEach of the regional TV channels which together form ARD, plus ORF and SF, produces its own episodes, starring its own police inspector, some of which, like the discontinued Schimanski, have become cultural icons.\nThe show appears on DasErste and ORF 2 on Sundays at 8:15 p.m. and currently about 30 episodes are made per year. As of March 2013, 865 episodes in total have been produced.\nTatort is currently being broadcast in the United States on the MHz Worldview channel under the name Scene of the Crime.", "rate": 56, "genre": ["Drama", "Crime"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3034   Expand Scene of the Crime   (1970) User Score Overview Tatort is a long-running German/Austrian/Swiss, crime television series set in various parts of these countries. The show is broadcast on the channels of ARD in Germany, ORF 2 in Austria and SF1 in Switzerland. The first episode was broadcast on November 29, 1970. The opening sequence for the series has remained the same throughout the decades, which remains highly unusual for any such long-running TV series up to date. Each of the regional TV channels which together form ARD, plus ORF and SF, produces its own episodes, starring its own police inspector, some of which, like the discontinued Schimanski, have become cultural icons. The show appears on DasErste and ORF 2 on Sundays at 8:15 p.m. and currently about 30 episodes are made per year. As of March 2013, 865 episodes in total have been produced. Tatort is currently being broadcast in the United States on the MHz Worldview channel under the name Scene of the Crime. Featured Crew Gunther Witte Creator Günter Rohrbach Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  18 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 49 2018 | 21 Episodes Season 49 of Scene of the Crime premiered on January  1, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Scene of the Crime. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  18 Posters  1 Recommendations   1973-01-15 Ein Herz und eine Seele 6.8    1966-09-17 Raumpatrouille – Die phantastischen Abenteuer des Raumschiffes Orion 8.1    2011-12-23 Crime Scene Cleaner 7.8    1969-02-08 Pippi Longstocking 7.2    2008-01-07 Mord mit Aussicht 7.3    2004-10-11 Stromberg 6.8    1971-09-17 The Persuaders! 8.0    1954-09-12 Lassie 5.3  Facts Original Name  Tatort Status  Returning Series Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  90m Homepage   http://www.daserste.de/tatort Genres Drama Crime Keywords police crime investigation Content Score 64 We're so close, yet so far. Top Contributors S 2,686 Samara L 276 Lysator 31 Lava303 17 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}