{"link": "https://www.themoviedb.org/tv/60783?language=en", "title": "Bad Judge", "resume": "The series chronicles the personal life (and the wild lifestyle) of Rebecca Wright, a tough-as-nails judge serving on the Los Angeles County Circuit Court, whose time off the bench is spent partying and displaying a reckless behavior. Her reputation is about to be tamed—and judged—by Robby Shoemaker, a eight-year-old boy whose parents Rebecca put behind bars. He might be the one that can turn Rebecca's life around.", "rate": 61, "genre": ["Comedy"], "cast": ["Kate Walsh", "Tone Bell", "Ryan Hansen", "John Ducey", "Miguel Sandoval"], "character": ["Rebecca Wright", "Tedward Mulray", "Dr. Gary Boyd", "Tom Barlow", "Judge Hernandez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60783   Expand Bad Judge   (2014) User Score  Play Trailer Overview The series chronicles the personal life (and the wild lifestyle) of Rebecca Wright, a tough-as-nails judge serving on the Los Angeles County Circuit Court, whose time off the bench is spent partying and displaying a reckless behavior. Her reputation is about to be tamed—and judged—by Robby Shoemaker, a eight-year-old boy whose parents Rebecca put behind bars. He might be the one that can turn Rebecca's life around. Featured Crew Anne Heche Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Walsh Rebecca Wright Tone Bell Tedward Mulray Ryan Hansen Dr. Gary Boyd John Ducey Tom Barlow Miguel Sandoval Judge Hernandez Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Bad Judge premiered on October  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2013-08-05 Quick Draw 6.3    2016-03-01 Loosely Exactly Nicole 5.8    2014-09-30 Happyland 3.3    2015-03-25 Big Time in Hollywood, Fl 5.7    2015-07-15 Impastor 6.6    2015-10-16 Truth Be Told 5.5    2015-06-08 Odd Mom Out 6.7    2014-10-02 A to Z 5.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.nbc.com/bad-judge Genres Comedy Keywords female judge sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 49 Elizabeth Jennings 15 benf45 11 Banana TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}