{"link": "https://www.themoviedb.org/tv/1438?language=en", "title": "The Wire", "resume": "Told from the points of view of both the Baltimore homicide and narcotics detectives and their targets, the series captures a universe in which the national war on drugs has become a permanent, self-sustaining bureaucracy, and distinctions between good and evil are routinely obliterated.", "rate": 83, "genre": ["Drama", "Crime"], "cast": ["Dominic West", "Lance Reddick", "Sonja Sohn", "Wendell Pierce", "Clarke Peters"], "character": ["Jimmy McNulty", "Cedric Daniels", "Kima Greggs", "Bunk Moreland", "Lester Freamon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1438   Expand The Wire   (2002) User Score  Play Trailer Overview Told from the points of view of both the Baltimore homicide and narcotics detectives and their targets, the series captures a universe in which the national war on drugs has become a permanent, self-sustaining bureaucracy, and distinctions between good and evil are routinely obliterated. Featured Crew David Simon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  31 Posters  22 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dominic West Jimmy McNulty Lance Reddick Cedric Daniels Sonja Sohn Kima Greggs Wendell Pierce Bunk Moreland Clarke Peters Lester Freamon Full Cast & Crew Last Season Season 5 2008 | 10 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply t Still not understanding Avon's favor on Marlo (possible spoiler) Open 1 by  RCH2288 Rank the seasons Open 7 by  theugly w Stringer Bell: Happy Birthday Idris Elba! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  31 Posters  22 Recommendations   1999-01-10 The Sopranos 8.3    2010-09-19 Boardwalk Empire 7.7    2004-03-21 Deadwood 8.1    2002-03-12 The Shield 8.1    2014-01-12 True Detective 8.1    2005-08-28 Rome 8.2    2001-06-03 Six Feet Under 8.2    2013-02-01 House of Cards 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hbo.com/the-wire Genres Drama Crime Keywords drug dealer police baltimore police detective baltimore maryland newspaper reporter police precinct docks black project Content Score 100 Yes! Looking good! Top Contributors 127 Elizabeth Jennings 36 United600 19 Apollo 11 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}