{"link": "https://www.themoviedb.org/tv/66870?language=en", "title": "Magi: Adventure of Sinbad", "resume": "Thirty years before the events of Magi, a brave and  handsome young man named Sinbad set sail and started his adventure. The  future High King of Seven Seas gradually matured through various  encounters and farewells, taking him towards kingship step by step.", "rate": 58, "genre": ["Animation", "Action", "Adventure"], "cast": ["Takahiro Sukarai", "Daisuke Ono", "Tomokazu Sugita", "Akira Ishida"], "character": ["Ja'far", "Sinbad", "Drakon", "Yunan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66870   Expand Magi: Adventure of Sinbad   (2016) User Score Overview Thirty years before the events of Magi, a brave and  handsome young man named Sinbad set sail and started his adventure. The  future High King of Seven Seas gradually matured through various  encounters and farewells, taking him towards kingship step by step. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takahiro Sukarai Ja'far Daisuke Ono Sinbad Tomokazu Sugita Drakon Akira Ishida Yunan Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Magi: Adventure of Sinbad premiered on April 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Magi: Adventure of Sinbad. You can help by rating TV shows you've seen. Facts Original Name  マギ シンドバッドの冒険 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.project-magi.com/sinbad/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 24 Siriuspr z 15 zurman1 t 12 tmdb983464 S 6 Sokarius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}