{"link": "https://www.themoviedb.org/tv/49007?language=en", "title": "Super Fun Night", "resume": "Junior attorney Kimmie Boubier and her two best friends, Helen-Alice and Marika, have had a standing date every Friday night for the last 13 years. They even have a motto for what they call \"Friday Night Fun Night\": \"Always together! Always Inside!\" However Kimmie's recent promotion throws a monkey wrench into the tradition. Not only is she now working with her idol, \"Lady Lawyer of the Year\" Felicity Vanderstone, but she meets a dashingly handsome British attorney, Richard Lovell, who invites her to his party at a trendy club. Determined to spend time with Richard and heed Felicity's advice to network, Kimmie sets out to convince her friends to take Super Fun Night on the road.", "rate": 53, "genre": ["Comedy"], "cast": ["Rebel Wilson", "Lauren Ash", "Liza Lapira", "Kate Jenkinson", "Kevin Bishop"], "character": ["Kimmie", "Marika", "Helen-Alice", "Kendall Quinn", "Richard Royce"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49007   Expand Super Fun Night   (2013) User Score Overview Junior attorney Kimmie Boubier and her two best friends, Helen-Alice and Marika, have had a standing date every Friday night for the last 13 years. They even have a motto for what they call \"Friday Night Fun Night\": \"Always together! Always Inside!\" However Kimmie's recent promotion throws a monkey wrench into the tradition. Not only is she now working with her idol, \"Lady Lawyer of the Year\" Felicity Vanderstone, but she meets a dashingly handsome British attorney, Richard Lovell, who invites her to his party at a trendy club. Determined to spend time with Richard and heed Felicity's advice to network, Kimmie sets out to convince her friends to take Super Fun Night on the road. Featured Crew Conan O'Brien Creator Rebel Wilson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rebel Wilson Kimmie Lauren Ash Marika Liza Lapira Helen-Alice Kate Jenkinson Kendall Quinn Kevin Bishop Richard Royce Full Cast & Crew Last Season Season 1 2013 | 17 Episodes Season 1 of Super Fun Night premiered on October  2, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2013-01-14 My Mad Fat Diary 8.1    2012-04-11 Don't Trust the B---- in Apartment 23 6.7    2006-03-13 The New Adventures of Old Christine 5.7    2007-05-13 Gavin & Stacey 7.6    2014-09-30 Selfie 6.4    2011-01-21 Portlandia 6.3    2012-06-28 Anger Management 6.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords sitcom workplace comedy workplace romance Content Score 93 Almost there... Top Contributors 12 Banana m 12 magoma 8 dbowman b 8 brewtown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}