{"link": "https://www.themoviedb.org/tv/60909?language=en", "title": "The Sixties", "resume": "The space race, the cold war, \"free love,\" civil rights and more: The decade of the 1960s shaped our history -- and changed the world. In collaboration with Tom Hanks, Gary Goetzman and Mark Herzog, CNN explores perhaps the most transformative decade of the modern era in a 10-part documentary series and brings new insights into how those events shaped today.", "rate": 75, "genre": ["Documentary"], "cast": ["Walter Cronkite", "Tom Hanks", "David Brinkley", "Dan Rather", "Chet Huntley"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself - NBC News (archive footage)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60909   Expand The Sixties   (2014) User Score  Play Trailer Overview The space race, the cold war, \"free love,\" civil rights and more: The decade of the 1960s shaped our history -- and changed the world. In collaboration with Tom Hanks, Gary Goetzman and Mark Herzog, CNN explores perhaps the most transformative decade of the modern era in a 10-part documentary series and brings new insights into how those events shaped today. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Walter Cronkite Himself Tom Hanks Himself David Brinkley Himself Dan Rather Himself Chet Huntley Himself - NBC News (archive footage) Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of The Sixties premiered on May 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2015-06-11 The Seventies 8.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.cnn.com/thesixties/ Genres Documentary Keywords nostalgia 1960s Content Score 93 Almost there... Top Contributors 32 Elizabeth Jennings 13 Banana TB 13 TMDb Bot 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}