{"link": "https://www.themoviedb.org/tv/21618?language=en", "title": "Tales of Little Women", "resume": "Little Women, also known as Ai no Wakakusa Monogatari is a 1987 Japanese animated television series adaptation of Louisa May Alcott's Little Women, produced by Nippon Animation.\nA sequel series, Little Women II: Jo's Boys, premiered in 1993.", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21618   Expand Tales of Little Women   (1987) User Score Overview Little Women, also known as Ai no Wakakusa Monogatari is a 1987 Japanese animated television series adaptation of Louisa May Alcott's Little Women, produced by Nippon Animation. A sequel series, Little Women II: Jo's Boys, premiered in 1993. Featured Crew Junzō Nakajima Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1987 | 48 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Tales of Little Women. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tales of Little Women. You can help by rating TV shows you've seen. Facts Original Name  愛の若草物語 Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  Japanese Runtime  29m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors b 24 baux M 17 Marco R 5 Rebecca AK 3 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}