{"link": "https://www.themoviedb.org/tv/62643?language=en", "title": "DC's Legends of Tomorrow", "resume": "When heroes alone are not enough ... the world needs legends. Having seen the future, one he will desperately try to prevent from happening, time-traveling rogue Rip Hunter is tasked with assembling a disparate group of both heroes and villains to confront an unstoppable threat — one in which not only is the planet at stake, but all of time itself. Can this ragtag team defeat an immortal threat unlike anything they have ever known?", "rate": 61, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Brandon Routh", "Caity Lotz", "Victor Garber", "Dominic Purcell", "Franz Drameh"], "character": ["Ray Palmer / The Atom", "Sara Lance / White Canary", "Dr. Martin Stein / Firestorm", "Mick Rory / Heat Wave", "Jefferson 'Jax' Jackson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62643   Expand DC's Legends of Tomorrow   (2016) User Score  Play Trailer Overview When heroes alone are not enough ... the world needs legends. Having seen the future, one he will desperately try to prevent from happening, time-traveling rogue Rip Hunter is tasked with assembling a disparate group of both heroes and villains to confront an unstoppable threat — one in which not only is the planet at stake, but all of time itself. Can this ragtag team defeat an immortal threat unlike anything they have ever known? Featured Crew Greg Berlanti Creator Andrew Kreisberg Creator Marc Guggenheim Creator Phil Klemmer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  42 Content Issues  2 Images Backdrops  11 Posters  25 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brandon Routh Ray Palmer / The Atom Caity Lotz Sara Lance / White Canary Victor Garber Dr. Martin Stein / Firestorm Dominic Purcell Mick Rory / Heat Wave Franz Drameh Jefferson 'Jax' Jackson Full Cast & Crew Current Season Season 3 2017 | 18 Episodes View All Seasons Social Reviews  0 Discussions  44 Subject Status Replies Last Reply U Amara is FINE Open 15 by  UrielF OK I don’t think the puppet was the best tactic. Open 0 by lantzn\n      \n     Don't they exist in an alternate timeline? Open 3 by  madmehr Go to Discussions Media Most Popular Videos  3 Backdrops  11 Posters  25 Recommendations   2015-10-26 Supergirl 5.7    2015-11-20 Marvel's Jessica Jones 7.6    2016-09-30 Marvel's Luke Cage 6.9    2012-10-10 Arrow 6.0    2015-04-10 Marvel's Daredevil 7.7    2014-10-07 The Flash 6.7    2013-09-24 Marvel's Agents of S.H.I.E.L.D. 6.7    2015-01-06 Marvel's Agent Carter 7.5  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cwtv.com/shows/legends-of-tomorrow Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords dc comics superhero villain time travel based on comic spin off superhero team Content Score 100 Yes! Looking good! Top Contributors R 109 Rebecca 47 Elizabeth Jennings 44 niqo19 35 Ander33x  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}