{"link": "https://www.themoviedb.org/tv/34216?language=en", "title": "Blassreiter", "resume": "Blassreiter is a 2008 Japanese anime from the animation studio Gonzo and the multimedia studio Nitro+. The title is pseudo-German and literally means \"Pale Rider\". A manga titled Blassreiter -genetic- also exists and is serialized in Champion Red magazine.\nAlong with The Tower of Druaga: The Aegis of Uruk, and later Strike Witches, this series was officially broadcast with English subtitles on the video websites YouTube, Crunchyroll, and BOST TV. As of April 9, 2012, the full English dub of the series is available on YouTube. It has been licensed for a North American release by Funimation Entertainment.", "rate": 65, "genre": ["Animation", "Action", "Adventure", "Drama"], "cast": ["Masaya Matsukaze", "Kenta Miyake", "Kana Hanazawa", "Junko Minagawa", "Unsho Ishizuka"], "character": ["Joseph Jobson", "Hermann Saltza", "Elea", "Malek Yildrim Werner", "Shido Kasagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34216   Expand Blassreiter   (2008) User Score Overview Blassreiter is a 2008 Japanese anime from the animation studio Gonzo and the multimedia studio Nitro+. The title is pseudo-German and literally means \"Pale Rider\". A manga titled Blassreiter -genetic- also exists and is serialized in Champion Red magazine. Along with The Tower of Druaga: The Aegis of Uruk, and later Strike Witches, this series was officially broadcast with English subtitles on the video websites YouTube, Crunchyroll, and BOST TV. As of April 9, 2012, the full English dub of the series is available on YouTube. It has been licensed for a North American release by Funimation Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaya Matsukaze Joseph Jobson Kenta Miyake Hermann Saltza Kana Hanazawa Elea Junko Minagawa Malek Yildrim Werner Unsho Ishizuka Shido Kasagi Full Cast & Crew Last Season Season 1 2008 | 24 Episodes Season 1 of Blassreiter premiered on April  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Blassreiter. You can help by rating TV shows you've seen. Facts Original Name  ブラスレイター Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 TheDerpMan 5 yoshizuka m 3 magoozin 2 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}