{"link": "https://www.themoviedb.org/tv/71915?language=en", "title": "Good Omens", "resume": "In 2018 the world is on the brink of an apocalypse as humanity prepares for a final judgment. But follies ensue — Aziraphale, a somewhat fussy angel, and Crowley, a demon aren’t enthusiastic about the end of the world, and can’t seem to find the Antichrist.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Michael Sheen", "David Tennant", "Jon Hamm", "Michael McKean", "Anna Maxwell Martin"], "character": ["Aziraphale", "Crowley", "Gabriel", "Shadwell", "Beelzebub"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71915   Expand Good Omens   (2018) User Score Overview In 2018 the world is on the brink of an apocalypse as humanity prepares for a final judgment. But follies ensue — Aziraphale, a somewhat fussy angel, and Crowley, a demon aren’t enthusiastic about the end of the world, and can’t seem to find the Antichrist. Featured Crew Neil Gaiman Creator Terry Pratchett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Sheen Aziraphale David Tennant Crowley Jon Hamm Gabriel Michael McKean Shadwell Anna Maxwell Martin Beelzebub Full Cast & Crew  Create Episode Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Can't say I'm happy about the way the BBC are creating this as a commission for Amazon Prime. Open 0 by Remington Steele\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Planned Networks Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Drama Keywords based on novel or book Content Score 79 Pump it up! We're close now. Top Contributors 36 Elizabeth Jennings t 17 tmdb42368388 6 rudely_murray f 4 flockofmonkies  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}