{"link": "https://www.themoviedb.org/tv/71747?language=en", "title": "Visible Man", "resume": "In a world where being invisible is the norm, fainthearted Kurtulus finds himself in the middle of an explosion that would turn him visible, which set by the villain boss Esref Serif.", "rate": 80, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Betül Akdeniz", "Levent Özdilek", "Erkan Kolçak Köstendil", "Osman Sonant", "Selim Bayraktar"], "character": ["İpek", "Kurtuluş", "İsfendiyar", "Eşref Şerif"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71747   Expand Visible Man   (2017) User Score Overview In a world where being invisible is the norm, fainthearted Kurtulus finds himself in the middle of an explosion that would turn him visible, which set by the villain boss Esref Serif. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Betül Akdeniz İpek Levent Özdilek Erkan Kolçak Köstendil Kurtuluş Osman Sonant İsfendiyar Selim Bayraktar Eşref Şerif Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Visible Man premiered on May 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Visible Man. You can help by rating TV shows you've seen. Facts Original Name  Görünen Adam Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  15m Homepage  - Genres Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 30 ardayzb 6 Sinema Arşivcisi 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}