{"link": "https://www.themoviedb.org/tv/8592?language=en", "title": "Parks and Recreation", "resume": "Hilarious ensemble comedy that follows Leslie Knope, a mid-level bureaucrat in the Parks and Recreation Department of Pawnee, Indiana, and her tireless efforts to make her quintessentially American town just a little bit more fun.", "rate": 79, "genre": ["Comedy"], "cast": ["Amy Poehler", "Adam Scott", "Nick Offerman", "Aubrey Plaza", "Aziz Ansari"], "character": ["Leslie Knope", "Ben Wyatt", "Ron Swanson", "April Ludgate", "Tom Haverford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8592   Expand Parks and Recreation   (2009) User Score  Play Trailer Overview Hilarious ensemble comedy that follows Leslie Knope, a mid-level bureaucrat in the Parks and Recreation Department of Pawnee, Indiana, and her tireless efforts to make her quintessentially American town just a little bit more fun. Featured Crew Greg Daniels Creator Michael Schur Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  1 Images Backdrops  17 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Amy Poehler Leslie Knope Adam Scott Ben Wyatt Nick Offerman Ron Swanson Aubrey Plaza April Ludgate Aziz Ansari Tom Haverford Full Cast & Crew Last Season Season 7 2015 | 13 Episodes Season 7 of Parks and Recreation premiered on January 13, 2015. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Rob Lowe Open 0 by rudely_murray\n      \n     w Ron: Happy Birthday Nick Offerman! Open 0 by wonder2wonder\n      \n     w April: Happy Birthday Aubrey Plaza! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  17 Posters  11 Recommendations   2003-11-02 Arrested Development 8.2    2005-03-24 The Office 8.0    2009-09-17 Community 7.9    2006-10-11 30 Rock 7.1    2005-08-04 It's Always Sunny in Philadelphia 8.2    2010-06-29 Louie 7.7    2009-03-20 Party Down 7.4    1999-09-25 Freaks and Geeks 8.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/parks-and-recreation/ Genres Comedy Keywords indiana politics satire mockumentary female protagonist employer employee relationship political satire office romance sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 128 seawolf 46 Travis Bell 30 Banana 17 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}