{"link": "https://www.themoviedb.org/tv/64646?language=en", "title": "Les recettes pompettes", "resume": "Each Week, Éric Salvail invites a new \"drinking buddy\" to join him in making a recipe that must resemble the original as much as possible, while downing increasing numbers of shots and glasses of wine. This sizeable challenge naturally leads to fits of laughter, surprising confessions … and a few broken glasses!", "rate": 10, "genre": ["Comedy", "Reality"], "cast": ["Éric Salvail"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64646   Expand Les recettes pompettes   (2015) User Score Overview Each Week, Éric Salvail invites a new \"drinking buddy\" to join him in making a recipe that must resemble the original as much as possible, while downing increasing numbers of shots and glasses of wine. This sizeable challenge naturally leads to fits of laughter, surprising confessions … and a few broken glasses! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Éric Salvail Host Full Cast & Crew Last Season Season 3 2017 | 10 Episodes Season 3 of Les recettes pompettes premiered on January 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Les recettes pompettes. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  French Runtime  22m Homepage   http://noovo.ca/emissions/les-recettes-pompettes/ Genres Comedy Reality Keywords alcohol cooking drunk cooking show Content Score 56 We're so close, yet so far. Top Contributors 52 Banana 5 Elizabeth Jennings TB 1 TMDb Bot s 1 steeve38  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}