{"link": "https://www.themoviedb.org/tv/13511?language=en", "title": "Genesis Climber MOSPEADA", "resume": "Genesis Climber MOSPEADA is an anime science fiction series created by Shinji Aramaki and Hideki Kakinuma. The 25-episode television series ran from late 1983 to early 1984 in Japan. MOSPEADA stands for Military Operation Soldier Protection Emergency Aviation Dive Armor, one of the transformable motorcycle-armors the series features. The other primary mecha featured in the show is the three-form transformable fighter called the Armo-Fighter AFC-01 Legioss, which is somewhat similar in design to the VF-1 Valkyrie variable fighter from The Super Dimension Fortress Macross.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Bin Shimada", "Hisao Oyama", "Mika Doi", "Sanae Miyuki", "Tomomichi Nishimura"], "character": ["Stig Bernard", "Ray", "Houquet", "Mint Labule", "Jim Warston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13511   Expand Genesis Climber MOSPEADA   (1983) User Score Overview Genesis Climber MOSPEADA is an anime science fiction series created by Shinji Aramaki and Hideki Kakinuma. The 25-episode television series ran from late 1983 to early 1984 in Japan. MOSPEADA stands for Military Operation Soldier Protection Emergency Aviation Dive Armor, one of the transformable motorcycle-armors the series features. The other primary mecha featured in the show is the three-form transformable fighter called the Armo-Fighter AFC-01 Legioss, which is somewhat similar in design to the VF-1 Valkyrie variable fighter from The Super Dimension Fortress Macross. Featured Crew Shinji Aramaki Creator Hideki Kakinuma Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bin Shimada Stig Bernard Hisao Oyama Ray Mika Doi Houquet Sanae Miyuki Mint Labule Tomomichi Nishimura Jim Warston Full Cast & Crew Last Season Season 1 1983 | 25 Episodes Season 1 of Genesis Climber MOSPEADA premiered on October  2, 1983. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Genesis Climber MOSPEADA. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1986-09-22 ALF 6.9  Facts Original Name  機甲創世記モスピーダ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords war giant robot alien invasion anime Content Score 93 Almost there... Top Contributors C 96 Claudio t 9 tmdb59661364 l 1 ltcomdata R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}