{"link": "https://www.themoviedb.org/tv/53068?language=en", "title": "Mrs. Tawan and the Devil's Rose", "resume": "Rose, she is the heir of the Queen Rose Hotel. She was raised spoiled because she was the only the granddaughter of the president of Queen Rose Hotel. She was raised in England and graduated from there so, she look down on the low-class / or commoner people. Tawan, a farmer grandson who loves nature and enjoys to play with flowers, was hired to organized a welcome party for Rose, but she was displeased with his taste in choosing the flowers for the party. Therefore, she hates him from their first meet, but coincidentally their grandfathers are childhood friends and promised to let their grandson and granddaughter marry each other. However, Rose refused to marry Tawan, so her grandfather offers to go to work in the Tawan farm for one year but if she runs away before one year, she will have to marry him.", "rate": 53, "genre": ["Soap", "Drama"], "cast": ["Gun Kantathaworn", "Davika Hoorne", "Rapeepat Eakpankul", "Chawallakorn Wanthanapisitkul", "Arisa Will"], "character": ["Tawan", "Rose", "Peera", "Usawadee", "Malai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53068   Expand Mrs. Tawan and the Devil's Rose   (2014) User Score  Play Trailer Overview Rose, she is the heir of the Queen Rose Hotel. She was raised spoiled because she was the only the granddaughter of the president of Queen Rose Hotel. She was raised in England and graduated from there so, she look down on the low-class / or commoner people. Tawan, a farmer grandson who loves nature and enjoys to play with flowers, was hired to organized a welcome party for Rose, but she was displeased with his taste in choosing the flowers for the party. Therefore, she hates him from their first meet, but coincidentally their grandfathers are childhood friends and promised to let their grandson and granddaughter marry each other. However, Rose refused to marry Tawan, so her grandfather offers to go to work in the Tawan farm for one year but if she runs away before one year, she will have to marry him.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gun Kantathaworn Tawan Davika Hoorne Rose Rapeepat Eakpankul Peera Chawallakorn Wanthanapisitkul Usawadee Arisa Will Malai Full Cast & Crew Last Season Season 1 2014 | 15 Episodes Season 1 of Mrs. Tawan and the Devil's Rose premiered on January  9, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Mrs. Tawan and the Devil's Rose. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mrs. Tawan and the Devil's Rose. You can help by rating TV shows you've seen. Facts Original Name  กุหลาบร้ายของนายตะวัน Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  90m Homepage   http://drama.ch7.com/detail/59663/%E0%B8%81%E0%B8%B8%E0%B8%AB%E0%B8%A5%E0%B8%B2%E0%B8%9A%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A2%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B8%99%E0%B8%B2%E0%B8%A2%E0%B8%95%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%99.html Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 38 Crip 16 Elizabeth Jennings TB 2 TMDb Bot z 1 zazouxy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}