{"link": "https://www.themoviedb.org/tv/72515?language=en", "title": "Princess Principal", "resume": "The stage is set during the 19th century London, in its capital where a wall divides the east and west of the Kingdom of Albion. Five high school girls, who enrolled in the prestigious Queens May Fair School, are involved in spy activities that involve disguise, infiltration, car chase, and more. These girls take advantage of their special abilities and fly around the shadow world.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Akari Kitō", "Daisuke Motohashi", "Eiko Hanawa", "Hazuki Ogino", "Hazuki Ogino"], "character": ["Lily Gaveston", "subordinate", "queen", "female student", "fencing club member"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72515   Expand Princess Principal   (2017) User Score Overview The stage is set during the 19th century London, in its capital where a wall divides the east and west of the Kingdom of Albion. Five high school girls, who enrolled in the prestigious Queens May Fair School, are involved in spy activities that involve disguise, infiltration, car chase, and more. These girls take advantage of their special abilities and fly around the shadow world. Featured Crew Masaki Tachibana Creator Ichiro Okouchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akari Kitō Lily Gaveston Daisuke Motohashi subordinate Eiko Hanawa queen Hazuki Ogino female student Hazuki Ogino fencing club member Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Princess Principal premiered on July  9, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Princess Principal. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Princess Principal. You can help by rating TV shows you've seen. Facts Original Name  プリンセス・プリンシパル Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.pripri-anime.jp/ Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 99 Sergiojamon 10 Zorro1 8 Mar2ck 7 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}