{"link": "https://www.themoviedb.org/tv/4653?language=en", "title": "Star Trek: Phase II", "resume": "Star Trek: Phase II is a fan-created science fiction series set in the Star Trek universe. The series was created by James Cawley and Jack Marshall in April 2003. The series, released exclusively via the Internet, is designed as a continuation of the original Star Trek, beginning in the fifth and final year of the starship Enterprise's \"five-year mission.\" The first episode of the series was released in January 2004, with new episodes being released at a rate of about one per year, though producers have expressed their desire to accelerate production.\nCBS, which owns the legal rights to the Star Trek franchise, allows the distribution of fan-created material as long as no attempt is made to profit from it without official authorization, and Phase II enjoys the same tolerance.\nStar Trek: Phase II stars James Cawley as Captain Kirk, Brandon Stacy as Mr. Spock, and John Kelley as Dr. McCoy. Eugene Roddenberry Jr., the son of Star Trek creator Gene Roddenberry, serves as consulting producer. Some of the original actors have returned to reprise their roles, including George Takei as Sulu in \"World Enough and Time\", and Walter Koenig as Chekov in \"To Serve All My Days\". The episodes are filmed on new sets located in Port Henry, NY, at a long-shuttered car dealership.", "rate": 82, "genre": ["Drama", "Action", "Adventure"], "cast": ["James Cawley", "Jeffery Quinn", "John M. Kelley"], "character": ["Kirk", "Spock", "McCoy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4653   Expand Star Trek: Phase II   (2004) User Score  Play Trailer Overview Star Trek: Phase II is a fan-created science fiction series set in the Star Trek universe. The series was created by James Cawley and Jack Marshall in April 2003. The series, released exclusively via the Internet, is designed as a continuation of the original Star Trek, beginning in the fifth and final year of the starship Enterprise's \"five-year mission.\" The first episode of the series was released in January 2004, with new episodes being released at a rate of about one per year, though producers have expressed their desire to accelerate production. CBS, which owns the legal rights to the Star Trek franchise, allows the distribution of fan-created material as long as no attempt is made to profit from it without official authorization, and Phase II enjoys the same tolerance. Star Trek: Phase II stars James Cawley as Captain Kirk, Brandon Stacy as Mr. Spock, and John Kelley as Dr. McCoy. Eugene Roddenberry Jr., the son of Star Trek creator Gene Roddenberry, serves as consulting producer. Some of the original actors have returned to reprise their roles, including George Takei as Sulu in \"World Enough and Time\", and Walter Koenig as Chekov in \"To Serve All My Days\". The episodes are filmed on new sets located in Port Henry, NY, at a long-shuttered car dealership. Featured Crew Gene Roddenberry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Cawley Kirk Jeffery Quinn Spock John M. Kelley McCoy Full Cast & Crew Last Season Season 1 2004 | 14 Episodes Season 1 of Star Trek: Phase II premiered on October  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Star Trek: Phase II. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   http://www.startreknewvoyages.com Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 15 SJK m 6 movienator L 4 Lysator 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}