{"link": "https://www.themoviedb.org/tv/69993?language=en", "title": "Tokyo Tarareba Girls", "resume": "30-year-old Kamata Rinko is single and a struggling scriptwriter. She has no boyfriend and keeps having night outs at drinking spots with her girlfriends Kaori and Koyuki. “If I become beautiful, a better guy will appear!” “If we grow to like each other, we can get married!” They will not stop talking about these hypothetical questions. Then a younger, handsome, golden-haired guy suddenly utters, “These “what if” women!” and the trio have to face the harsh reality that they are no longer girls. Rinko enters her 30s while still immature, seeking happiness and struggling with romance and work.", "rate": 0, "genre": ["Drama"], "cast": ["Yuriko Yoshitaka", "Nana Eikura", "Yuko Oshima", "Kentaro Sakaguchi", "Ryohei Suzuki"], "character": ["Rinko Kamata", "Kaori Yamakawa", "Koyuki Torii", "Key", "Tetsuro Hayasaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69993   Expand Tokyo Tarareba Girls   (2017) User Score Overview 30-year-old Kamata Rinko is single and a struggling scriptwriter. She has no boyfriend and keeps having night outs at drinking spots with her girlfriends Kaori and Koyuki. “If I become beautiful, a better guy will appear!” “If we grow to like each other, we can get married!” They will not stop talking about these hypothetical questions. Then a younger, handsome, golden-haired guy suddenly utters, “These “what if” women!” and the trio have to face the harsh reality that they are no longer girls. Rinko enters her 30s while still immature, seeking happiness and struggling with romance and work. Featured Crew Akiko Higashimura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuriko Yoshitaka Rinko Kamata Nana Eikura Kaori Yamakawa Yuko Oshima Koyuki Torii Kentaro Sakaguchi Key Ryohei Suzuki Tetsuro Hayasaka Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Tokyo Tarareba Girls premiered on January 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tokyo Tarareba Girls. You can help by rating TV shows you've seen. Facts Original Name  東京タラレバ娘 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ntv.co.jp/tarareba/ Genres Drama Keywords japan romance based on manga Content Score 93 Almost there... Top Contributors 25 thirstyhippo M 21 Maria180493 13 empireyura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}