{"link": "https://www.themoviedb.org/tv/46350?language=en", "title": "Yakitate!! Japan", "resume": "Azuma Kazuma isn't terribly clever, but he's got a good heart and  great skill - at baking. Since childhood, he's been on a quest to create  the perfect bread to represent Japan internationally. Now, he seeks to  enter the famous bakery Pantasia, in hopes of reaching his goal. But  plots abound...", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Marina Inoue", "Yumiko Kobayashi", "Yuu Shimaka", "Takehito Koyasu", "Chigusa Ikeda"], "character": ["Shigeru Kanmuri", "Kazuma Azuma", "Dave Hashiguchi", "Ryou Kuroyanagi", "Mizuno Azusagawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46350   Expand Yakitate!! Japan   (2004) User Score Overview Azuma Kazuma isn't terribly clever, but he's got a good heart and  great skill - at baking. Since childhood, he's been on a quest to create  the perfect bread to represent Japan internationally. Now, he seeks to  enter the famous bakery Pantasia, in hopes of reaching his goal. But  plots abound... Featured Crew Yasunao Aoki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marina Inoue Shigeru Kanmuri Yumiko Kobayashi Kazuma Azuma Yuu Shimaka Dave Hashiguchi Takehito Koyasu Ryou Kuroyanagi Chigusa Ikeda Mizuno Azusagawa Full Cast & Crew Last Season Season 3 2005 | 18 Episodes Season 3 of Yakitate!! Japan premiered on October 18, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Yakitate!! Japan. You can help by rating TV shows you've seen. Facts Original Name  焼きたて!!ジャぱん Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.yakitate-japan.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 10 Sergiojamon t 8 tmdb983464 3 RubeensVinicius 3 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}