{"link": "https://www.themoviedb.org/tv/80507?language=en", "title": "Kamenskaya - 1", "resume": "The series \"Kamenskaya\" is the first adaptation of the popular novels of \"Russian Agatha Christie\" Alexandra Marinina. The main heroine of the series is Major of Police Anastasia Kamenskaya, behind whom the glory of a fine analyst is entrenched, speaks five languages ​​and adores her work. She readily takes on insoluble at first glance affairs and skillfully calculates criminals for the most insignificant details of their actions, character, psychology. Nastin's abilities combined with the professionalism of two other criminal investigation officers - Mikhail Lesnikov and Yuri Korotkov - give excellent results in the detection of crimes.", "rate": 100, "genre": ["Action", "Adventure", "Mystery", "Drama", "Comedy", "Crime"], "cast": ["Elena Yakovleva", "Sergey Nikonenko", "Sergey Garmash", "Dmitriy Nagiev", "Andrey Ilin"], "character": ["Анастасия Павловна Каменская (главная роль, майор милиции)", "Виктор Алексеевич Гордеев (\"Колобок\", главная роль, полковник, начальник следственной группы)", "Юрий Викторович Коротков (главная роль, майор, старший оперуполномоченный)", "Михаил Лесников (главная роль, капитан милиции)", "Алексей Чистяков (главная роль, муж Каменской)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80507   Expand Kamenskaya - 1   (1999) User Score Overview The series \"Kamenskaya\" is the first adaptation of the popular novels of \"Russian Agatha Christie\" Alexandra Marinina. The main heroine of the series is Major of Police Anastasia Kamenskaya, behind whom the glory of a fine analyst is entrenched, speaks five languages ​​and adores her work. She readily takes on insoluble at first glance affairs and skillfully calculates criminals for the most insignificant details of their actions, character, psychology. Nastin's abilities combined with the professionalism of two other criminal investigation officers - Mikhail Lesnikov and Yuri Korotkov - give excellent results in the detection of crimes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elena Yakovleva Анастасия Павловна Каменская (главная роль, майор милиции) Sergey Nikonenko Виктор Алексеевич Гордеев (\"Колобок\", главная роль, полковник, начальник следственной группы) Sergey Garmash Юрий Викторович Коротков (главная роль, майор, старший оперуполномоченный) Dmitriy Nagiev Михаил Лесников (главная роль, капитан милиции) Andrey Ilin Алексей Чистяков (главная роль, муж Каменской) Full Cast & Crew Last Season Season 1 1999 | 16 Episodes Season 1 of Kamenskaya - 1 premiered on December 14, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kamenskaya - 1. You can help by rating TV shows you've seen. Facts Original Name  Каменская - 1 Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Russian Runtime  51m Homepage  - Genres Action & Adventure Mystery Drama Comedy Crime Keywords based on novel or book police woman Content Score 93 Almost there... Top Contributors n 38 navarro2018 9 Elena Sergeeva TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}