{"link": "https://www.themoviedb.org/tv/14769?language=en", "title": "Xavier: Renegade Angel", "resume": "Xavier: Renegade Angel is an American CGI fantasy-comedy television series created by John Lee, Vernon Chatman, Jim Tozzi and Alyson Levy. Lee and Chatman are also the creators of Wonder Showzen. The show was produced by PFFR, with animation by Cinematico. It premiered at midnight on November 4, 2007, on Adult Swim, and November 1, 2007, on the Adult Swim website.\nXavier features a style characterized by a nonlinear, incoherent plot following the humorous musings of an itinerant humanoid pseudo-shaman and spiritual seeker named Xavier. The show is known for its ubiquitous use of ideologically critical black comedy, surrealist and absurdist humor presented through a psychedelic, New Age lens. The program is also normally rated TV-MA for intense, graphic, often bloody violence, as well as strong sexual content, use of racially/ethnically offensive language, grotesque depictions and content that is considered \"too morbid and too incomprehensible for young viewers\"\nXavier: Renegade Angel premiered on November 4, 2007, and ended on April 16, 2009, with a total of 20 episodes, as a result of being cancelled due to low ratings.", "rate": 85, "genre": ["Animation", "Comedy"], "cast": ["John Flansburgh", "Bill Hader", "Bill Hader", "Judah Friedlander", "Judah Friedlander"], "character": ["Pavlov", "Priest", "Big Papa Dick", "Slippy Town Village Announcer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14769   Expand Xavier: Renegade Angel   (2007) User Score Overview Xavier: Renegade Angel is an American CGI fantasy-comedy television series created by John Lee, Vernon Chatman, Jim Tozzi and Alyson Levy. Lee and Chatman are also the creators of Wonder Showzen. The show was produced by PFFR, with animation by Cinematico. It premiered at midnight on November 4, 2007, on Adult Swim, and November 1, 2007, on the Adult Swim website. Xavier features a style characterized by a nonlinear, incoherent plot following the humorous musings of an itinerant humanoid pseudo-shaman and spiritual seeker named Xavier. The show is known for its ubiquitous use of ideologically critical black comedy, surrealist and absurdist humor presented through a psychedelic, New Age lens. The program is also normally rated TV-MA for intense, graphic, often bloody violence, as well as strong sexual content, use of racially/ethnically offensive language, grotesque depictions and content that is considered \"too morbid and too incomprehensible for young viewers\" Xavier: Renegade Angel premiered on November 4, 2007, and ended on April 16, 2009, with a total of 20 episodes, as a result of being cancelled due to low ratings. Featured Crew Vernon Chatman Creator John Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Flansburgh Bill Hader Pavlov Bill Hader Priest Judah Friedlander Big Papa Dick Judah Friedlander Slippy Town Village Announcer Full Cast & Crew Last Season Season 2 2009 | 10 Episodes Season 2 of Xavier: Renegade Angel premiered on February 12, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2004-11-14 Tom Goes to the Mayor 7.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  15m, 11m Homepage   http://www.adultswim.com/shows/xavier/index.html Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}