{"link": "https://www.themoviedb.org/tv/37783?language=en", "title": "Wonders of the Universe", "resume": "Wonders of the Universe is a 2011 television series produced by the BBC, Discovery Channel, and Science Channel, hosted by physicist Professor Brian Cox. Wonders of the Universe was first broadcast in the United Kingdom on BBC Two from 6 March 2011. The series comprises four episodes, each of which focuses on an aspect of the universe and features a 'wonder' relevant to the theme. It follows on from Cox's 2010 series for the BBC, Wonders of the Solar System.", "rate": 83, "genre": ["Documentary"], "cast": ["Brian Cox"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37783   Expand Wonders of the Universe   (2011) User Score Overview Wonders of the Universe is a 2011 television series produced by the BBC, Discovery Channel, and Science Channel, hosted by physicist Professor Brian Cox. Wonders of the Universe was first broadcast in the United Kingdom on BBC Two from 6 March 2011. The series comprises four episodes, each of which focuses on an aspect of the universe and features a 'wonder' relevant to the theme. It follows on from Cox's 2010 series for the BBC, Wonders of the Solar System. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Cox Presenter Full Cast & Crew Last Season Miniseries 2011 | 4 Episodes Season 1 of Wonders of the Universe premiered on March  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  7 Recommendations   2010-03-07 Wonders of the Solar System 7.6    2001-07-22 Space 8.0    2011-08-07 Curiosity 7.2    2010-04-25 Into the Universe with Stephen Hawking 7.6    1968-09-22 Land of the Giants 6.3    2013-01-27 Wonders of Life 9.0    2008-06-28 Wipeout 5.5    2012-10-16 The Men Who Built America 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 59m Homepage   http://www.bbc.co.uk/programmes/b00zdhtg Genres Documentary Keywords light star time supernova miniseries universe gravity cosmos Content Score 56 We're so close, yet so far. Top Contributors TB 33 TMDb Bot 9 Elizabeth Jennings 8 Aty l 6 lining2808  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}