{"link": "https://www.themoviedb.org/tv/1215?language=en", "title": "Californication", "resume": "A self-loathing, alcoholic writer attempts to repair his damaged relationships with his daughter and her mother while combating sex addiction, a budding drug problem, and the seeming inability to avoid making bad decisions.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["David Duchovny", "Evan Handler", "Pamela Adlon", "Natascha McElhone"], "character": ["Hank Moody", "Charlie Runkle", "Marcy", "Karen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1215   Expand Californication   (2007) User Score  Play Trailer Overview A self-loathing, alcoholic writer attempts to repair his damaged relationships with his daughter and her mother while combating sex addiction, a budding drug problem, and the seeming inability to avoid making bad decisions. Featured Crew Tom Kapinos Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  7 Images Backdrops  49 Posters  37 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Duchovny Hank Moody Evan Handler Charlie Runkle Pamela Adlon Marcy Natascha McElhone Karen Full Cast & Crew Last Season Season 7 2014 | 12 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply w Hank: Happy Birthday David Duchovny! Open 0 by wonder2wonder\n      \n     A Californication Open 1 by  wonder2wonder Go to Discussions Media Most Popular Videos  1 Backdrops  49 Posters  37 Recommendations   2005-08-07 Weeds 7.1    2006-10-01 Dexter 8.0    2004-07-18 Entourage 7.1    2001-10-02 Scrubs 7.7    2001-06-03 Six Feet Under 8.2    2004-11-16 House 8.1    2010-09-19 Boardwalk Empire 7.7    2005-09-20 My Name Is Earl 7.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m Homepage   http://www.sho.com/californication Genres Comedy Drama Keywords california change self-destruction addiction writer willpower Content Score 100 Yes! Looking good! Top Contributors 322 t0by 49 Elizabeth Jennings 23 BudsieBuds 18 Atanas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}