{"link": "https://www.themoviedb.org/tv/26103?language=en", "title": "Hindsight", "resume": "The series begins with Becca on the eve of her second wedding. It all seems perfect this time around, but she is still plagued by doubt. What if she could fix everything, and make the 'right' choices this time? Becca finds herself thinking about her former best friend Lolly, with whom she had a falling out many years ago. If only she could talk to her once again… Suddenly, after a freakish elevator ride, Becca gets the opportunity to do just that as she wakes up in New York City on the morning of her first wedding day in 1995. She's about to marry Sean, a bad-boy artist who is all wrong for her – and she knows her first move must be to reconnect with Lolly to re-live that day. Can she 'make it right' by living her life all over while re-adapting to life in New York City in the 90's – a time of smoking in bars, carrying pagers, having an AOL email address? Becca will soon discover there's no sure-fire way to make the right choices in life – even knowing everything she thinks she knows now.", "rate": 65, "genre": ["Comedy", "Drama"], "cast": ["Laura Ramsey", "Sarah Goldberg", "Craig Horner", "John Patrick Amedori"], "character": ["Becca", "Lolly", "Sean", "Jamie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26103   Expand Hindsight   (2017) User Score  Play Trailer Overview The series begins with Becca on the eve of her second wedding. It all seems perfect this time around, but she is still plagued by doubt. What if she could fix everything, and make the 'right' choices this time? Becca finds herself thinking about her former best friend Lolly, with whom she had a falling out many years ago. If only she could talk to her once again… Suddenly, after a freakish elevator ride, Becca gets the opportunity to do just that as she wakes up in New York City on the morning of her first wedding day in 1995. She's about to marry Sean, a bad-boy artist who is all wrong for her – and she knows her first move must be to reconnect with Lolly to re-live that day. Can she 'make it right' by living her life all over while re-adapting to life in New York City in the 90's – a time of smoking in bars, carrying pagers, having an AOL email address? Becca will soon discover there's no sure-fire way to make the right choices in life – even knowing everything she thinks she knows now. Featured Crew Emily Fox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Ramsey Becca Sarah Goldberg Lolly Craig Horner Sean John Patrick Amedori Jamie Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Hindsight premiered on March 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2016-06-08 Power Monkeys 7.0    2011-09-14 Free Agents 4.8    2016-10-12 Rosehaven 6.5    2006-01-01 In Justice 6.8    2013-02-27 Lightfields 7.5    2011-02-03 Marchlands 7.4    2004-07-19 The Grid 7.0    2010-07-12 The Silence 6.8  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   http://www.vh1.com/shows/hindsight/ Genres Comedy Drama Keywords women self-discovery time travel best friend twenty something changing the past or future searching for love 1990s Content Score 100 Yes! Looking good! Top Contributors 21 futurebackwards 16 Elizabeth Jennings J 7 JohnBordello 6 Nero Kosonen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}