{"link": "https://www.themoviedb.org/tv/70674?language=en", "title": "Ghost Brothers", "resume": "Ghost Brothers, is a trio of friends exploring the paranormal with a dash of comedy.", "rate": 53, "genre": ["Documentary", "Mystery", "Reality"], "cast": ["Dalen Spratt", "Juwan Mass", "Marcus Harvey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70674   Expand Ghost Brothers   (2016) User Score Overview Ghost Brothers, is a trio of friends exploring the paranormal with a dash of comedy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dalen Spratt Juwan Mass Marcus Harvey Full Cast & Crew Last Season Season 2 2017 | 11 Episodes Season 2 of Ghost Brothers premiered on March 10, 2017. View All Seasons Social Reviews  1 Discussions  0 D A review by Dan_Tebasco  7.0 Written by  Dan_Tebasco  on May 19, 2017 Fairly amusing ghosthunter show. It's in the lines of Ghost Adventures or any other paranormal show, the difference is that the team in this don't take themselves as uber seriously as they do in some other shows. Which is not a bad thing, many of these shows do take themselves way too seriously so it's a breath of fresh air in that regard. They play a bit on their 'blackness' but not to the point that it gets annoying or anything, I've read reviews on other site saying they make a mockery of ghost hunting. I disagree about that, and at least they don't obviously fake as much stuff as o...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1989-06-10 Tales from the Crypt 7.7  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   https://www.tlc.com/tv-shows/ghost-brothers-on-tlc/ Genres Documentary Mystery Reality Keywords thriller travel Content Score 56 We're so close, yet so far. Top Contributors 26 szab 9 Elizabeth Jennings 4 WatchFilmi r 1 rickyedward09  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}