{"link": "https://www.themoviedb.org/tv/5672?language=en", "title": "National Geographic Explorer", "resume": "National Geographic Explorer is an American documentary television series that originally premiered on Nickelodeon on April 7, 1985, after having been produced as a less costly and intensive alternative to PBS's National Geographic Specials by Pittsburgh station WQED. The first episode was produced by WQED and featured long-time Explorer camerman Mark Knobil, who is the few staff members with the franchise during all 24 seasons. The program is the longest-running documentary television series on cable television. Presented every Sunday from 5:00 PM to 8:00 PM, the original series was three hours in length, containing five to ten short films. Although the National Geographic Society had been producing specials for television for 20 years prior to Explorer, the premiere of the series required an increase in production from 4 hours of programming a year to 156 hours. Tim Cowling and Tim Kelly were the executive producers for the series during this transition.\nIn its 24 years on television, Explorer has worked for five television outlets. In February 1986, Explorer moved to TBS, where it had a successful run until September 1999, when it moved to CNBC. In October 2001, the series moved to MSNBC. In June 2003, the series re-launched itself on MSNBC as Ultimate Explorer, with Lisa Ling as the host. On July 8, 2004, Explorer joined the National Geographic Channel, where currently it airs every Tuesday night at 10:00 PM.", "rate": 58, "genre": ["Documentary"], "cast": ["Lisa Ling"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5672   Expand National Geographic Explorer   (1985) User Score  Play Trailer Overview National Geographic Explorer is an American documentary television series that originally premiered on Nickelodeon on April 7, 1985, after having been produced as a less costly and intensive alternative to PBS's National Geographic Specials by Pittsburgh station WQED. The first episode was produced by WQED and featured long-time Explorer camerman Mark Knobil, who is the few staff members with the franchise during all 24 seasons. The program is the longest-running documentary television series on cable television. Presented every Sunday from 5:00 PM to 8:00 PM, the original series was three hours in length, containing five to ten short films. Although the National Geographic Society had been producing specials for television for 20 years prior to Explorer, the premiere of the series required an increase in production from 4 hours of programming a year to 156 hours. Tim Cowling and Tim Kelly were the executive producers for the series during this transition. In its 24 years on television, Explorer has worked for five television outlets. In February 1986, Explorer moved to TBS, where it had a successful run until September 1999, when it moved to CNBC. In October 2001, the series moved to MSNBC. In June 2003, the series re-launched itself on MSNBC as Ultimate Explorer, with Lisa Ling as the host. On July 8, 2004, Explorer joined the National Geographic Channel, where currently it airs every Tuesday night at 10:00 PM. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Ling Host Full Cast & Crew Last Season Season 6 2009 | 22 Episodes Season 6 of National Geographic Explorer premiered on October 27, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on National Geographic Explorer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 90m Homepage   http://channel.nationalgeographic.com/series/explorer/all/Overview Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors d 3 denis - 1 -Alexander- M 1 Mannaya 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}