{"link": "https://www.themoviedb.org/tv/60797?language=en", "title": "Scorpion", "resume": "Based on a true story, Scorpion is a high-octane drama about eccentric genius Walter O’Brien and his team of brilliant misfits who comprise the last line of defense against complex, high-tech threats of the modern age. As Homeland Security’s new think tank, O’Brien’s “Scorpion” team includes Toby Curtis, an expert behaviorist who can read anyone; Happy Quinn, a mechanical prodigy; and Sylvester Dodd, a statistics guru.", "rate": 68, "genre": ["Action", "Adventure", "Drama"], "cast": ["Elyes Gabel", "Katharine McPhee", "Eddie Kaye Thomas", "Jadyn Wong", "Ari Stidham"], "character": ["Walter O'Brien", "Paige Dineen", "Toby Curtis", "Happy Quinn", "Sylvester Dodd"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60797   Expand Scorpion   (2014) User Score  Play Trailer Overview Based on a true story, Scorpion is a high-octane drama about eccentric genius Walter O’Brien and his team of brilliant misfits who comprise the last line of defense against complex, high-tech threats of the modern age. As Homeland Security’s new think tank, O’Brien’s “Scorpion” team includes Toby Curtis, an expert behaviorist who can read anyone; Happy Quinn, a mechanical prodigy; and Sylvester Dodd, a statistics guru. Featured Crew Nick Santora Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  2 Images Backdrops  7 Posters  8 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Elyes Gabel Walter O'Brien Katharine McPhee Paige Dineen Eddie Kaye Thomas Toby Curtis Jadyn Wong Happy Quinn Ari Stidham Sylvester Dodd Full Cast & Crew Last Season Season 4 2017 | 22 Episodes Season 4 of Scorpion premiered on September 24, 2017. View All Seasons Social Reviews  0 Discussions  19 Subject Status Replies Last Reply Wow, this show hasnt gotten canceled yey? Open 5 by  mechajutaro Does Walter O' Brian really have a sister? Open 0 by Mario Limbouris\n      \n     Renewal? Open 3 by  MyriVerse Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  8 Recommendations   2012-09-27 Elementary 7.0    2014-12-07 The Librarians 6.4    2012-07-09 Perception 6.7    2014-09-22 Forever 7.5    2011-09-22 Person of Interest 7.8    2014-09-23 NCIS: New Orleans 6.3    2008-09-23 The Mentalist 7.3    2009-09-22 NCIS: Los Angeles 6.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m, 43m, 44m Homepage   http://www.cbs.com/shows/scorpion/ Genres Action & Adventure Drama Keywords autism genius nerd computer hacker science national security social outcast problem solving Content Score 100 Yes! Looking good! Top Contributors 59 Banana 55 Elizabeth Jennings 31 niqo19 23 benf45  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}