{"link": "https://www.themoviedb.org/tv/1492?language=en", "title": "Howards' Way", "resume": "The BBC's answer to Dynasty, Howards' Way was launched in 1985 with an enormous 1 million pound budget. The main characters in the show were 'best boat designer in the world' Tom Howard, his boutique running wife Jan Howard, 'I'll have a drink' Jack Rolfe and a nasty man called Ken Masters. It starred Maurice Colbourne.", "rate": 38, "genre": ["Drama"], "cast": ["Kate O'Mara", "Maurice Colbourne", "Glyn Owen", "Lana Morris", "Tony Anholt"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1492   Expand Howards' Way   (1985) User Score Overview The BBC's answer to Dynasty, Howards' Way was launched in 1985 with an enormous 1 million pound budget. The main characters in the show were 'best boat designer in the world' Tom Howard, his boutique running wife Jan Howard, 'I'll have a drink' Jack Rolfe and a nasty man called Ken Masters. It starred Maurice Colbourne. Featured Crew Allan Prior Creator Gerard Glaister Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate O'Mara Maurice Colbourne Glyn Owen Lana Morris Tony Anholt Full Cast & Crew Last Season Series 6 1990 | 13 Episodes Season 6 of Howards' Way premiered on September  6, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Howards' Way. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b0093t51 Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 19 lmarshall1995 R 11 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}