{"link": "https://www.themoviedb.org/tv/32786?language=en", "title": "Elena's Ghost", "resume": "El fantasma de Elena is a Spanish-language telenovela produced by the United States-based television network Telemundo. The first season comprised 117 episodes transmitted in the USA from July 20, 2010 to January 7, 2011. As with most of its other soap operas, the network broadcast English subtitles as closed captions on CC3.\nIt stars Elizabeth Gutiérrez and Segundo Cernadas as protagonists and Ana Layevska as the main antagonist in a double role.\nIt has had different titles. When the original story was changed after just 30 episodes, the novela was renamed \"Elena contra Elena\". Two weeks later, the script was taken to a new direction again and its title was changed to \"La venganza de Elena\". Finally, the novela was named \"El desafío de Elena\" just after 20 episodes. After the 60th episode, the novela was renamed back to its original name \"El fantasma de Elena\".", "rate": 0, "genre": ["Mystery"], "cast": ["Braulio Castillo hijo"], "character": ["Tomás Lafé"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32786   Expand Elena's Ghost   (2010) User Score Overview El fantasma de Elena is a Spanish-language telenovela produced by the United States-based television network Telemundo. The first season comprised 117 episodes transmitted in the USA from July 20, 2010 to January 7, 2011. As with most of its other soap operas, the network broadcast English subtitles as closed captions on CC3. It stars Elizabeth Gutiérrez and Segundo Cernadas as protagonists and Ana Layevska as the main antagonist in a double role. It has had different titles. When the original story was changed after just 30 episodes, the novela was renamed \"Elena contra Elena\". Two weeks later, the script was taken to a new direction again and its title was changed to \"La venganza de Elena\". Finally, the novela was named \"El desafío de Elena\" just after 20 episodes. After the 60th episode, the novela was renamed back to its original name \"El fantasma de Elena\". Featured Crew Humberto 'Kiko' Olivieri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Braulio Castillo hijo Tomás Lafé Full Cast & Crew Last Season Season 1 2010 | 2 Episodes Season 1 of Elena's Ghost premiered on July 20, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Elena's Ghost. You can help by rating TV shows you've seen. Facts Original Name  El fantasma de Elena Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  42m Homepage   http://www.msnlatino.telemundo.com/novelas/El_Fantasma_de_Elena/ Genres Mystery Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors D 18 Double-Dee s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}