{"link": "https://www.themoviedb.org/tv/73315?language=en", "title": "Monster", "resume": "In the dark and remote landscape of northern Norway, a brutal murder reveals a mass grave which links old cases to missing people. Local police woman Hedda is put on the case with special investigator Joel Dreyer who comes from the metropolitan south. Their different backgrounds, personalities and methods immediately set them against each other. But when the investigation begins to spiral out of control, both detectives resort to questionable moves in order to stay on the case and protect their secrets.", "rate": 67, "genre": ["Crime", "Drama"], "cast": ["Ingvild Holthe Bygdnes", "Jakob Oftebro", "Bjørn Sundquist", "Gørild Mauseth", "Niklas Gundersen"], "character": ["Hedda Hersoug", "Joel Dreyer", "Ed Arvola", "Margot van Gebert", "Ross Eriksen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73315   Expand Monster   (2017) User Score  Play Trailer Overview In the dark and remote landscape of northern Norway, a brutal murder reveals a mass grave which links old cases to missing people. Local police woman Hedda is put on the case with special investigator Joel Dreyer who comes from the metropolitan south. Their different backgrounds, personalities and methods immediately set them against each other. But when the investigation begins to spiral out of control, both detectives resort to questionable moves in order to stay on the case and protect their secrets. Featured Crew Hans Christian Storrøsten Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ingvild Holthe Bygdnes Hedda Hersoug Jakob Oftebro Joel Dreyer Bjørn Sundquist Ed Arvola Gørild Mauseth Margot van Gebert Niklas Gundersen Ross Eriksen Full Cast & Crew Current Season Season 1 2017 | 7 Episodes Season 1 of Monster premiered on October  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2014-10-12 The Affair 6.5    2016-09-23 The Exorcist 7.2    2015-06-30 Zoo 5.9    2013-06-30 Ray Donovan 7.4    2013-09-23 The Blacklist 7.0    2014-04-15 Fargo 8.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  55m Homepage  - Genres Crime Drama Keywords serial killer murder investigation Content Score 100 Yes! Looking good! Top Contributors 56 Bendik 9 Elizabeth Jennings TB 5 TMDb Bot 4 scorpio686  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}