{"link": "https://www.themoviedb.org/tv/64048?language=en", "title": "Yun Zhong Ge", "resume": "Yun Zhong Ge also known as Song in the Clouds is a sequel to Ballad of the Desert. During the Western Han Dynasty, an eight-year-old Emperor Zhao of Han meets a girl Huo Yunge (daughter of Huo Qubing and Jin Yu from Ballad of the Desert), who rescued him from the cold of the desert. Ten years later, Huo is now a beautiful young woman, who could not forget the boy she saved. However, she mistook another Liu Bing Yi as Emperor Liu Fu Ling. Yunge helplessly watched him marry Xu Pingjun. The heartbroken Huo later meets a handsome Meng Jue, only later to find herself embroiled in a power struggles within the imperial palace.", "rate": 75, "genre": ["Drama"], "cast": ["AngelaBaby", "Yang Rong", "Chen Xiao", "Chun Du", "Lu Yi"], "character": ["Yun Ge", "Huo Cheng Jun", "Liu Xun", "Meng Jue", "Liu Fu Ling"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64048   Expand Yun Zhong Ge   (2015) User Score Overview Yun Zhong Ge also known as Song in the Clouds is a sequel to Ballad of the Desert. During the Western Han Dynasty, an eight-year-old Emperor Zhao of Han meets a girl Huo Yunge (daughter of Huo Qubing and Jin Yu from Ballad of the Desert), who rescued him from the cold of the desert. Ten years later, Huo is now a beautiful young woman, who could not forget the boy she saved. However, she mistook another Liu Bing Yi as Emperor Liu Fu Ling. Yunge helplessly watched him marry Xu Pingjun. The heartbroken Huo later meets a handsome Meng Jue, only later to find herself embroiled in a power struggles within the imperial palace. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast AngelaBaby Yun Ge Yang Rong Huo Cheng Jun Chen Xiao Liu Xun Chun Du Meng Jue Lu Yi Liu Fu Ling Full Cast & Crew Last Season Season 1 2015 | 45 Episodes Season 1 of Yun Zhong Ge premiered on September 13, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Yun Zhong Ge. You can help by rating TV shows you've seen. Facts Original Name  大汉情缘之云中歌 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/3215106567 Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 43 Maria180493 z 10 zurman1 6 Elizabeth Jennings m 2 mario  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}