{"link": "https://www.themoviedb.org/tv/54309?language=en", "title": "Pan Tau", "resume": "Pan Tau always had a gentle expression and a friendly smile, he was elegantly dressed in a stroller, with an umbrella and a white carnation in the lapel. Foremost, he was famous for his magic bowler hat. By tapping on his hat, Pan Tau was able to change his appearance into a puppet, to conjure up miscellaneous objects or to do other magic. His most characteristically behavior is that he would help children who were experiencing some sort of difficulties in-between their dreams and reality, like finding a place for skiing, settling family problems on Christmas, and even give a boy a good time at a fair when he is supposed to have piano lessons. To adults, he usually remained invisible.", "rate": 70, "genre": ["Family"], "cast": ["Jan Werich", "Otto Šimánek", "František Filipovský", "Jiřina Bohdalová", "Vladimír Menšík"], "character": ["Pan Viola", "Pan Tau", "dědeček Urban", "Helena Urbanová", "Josef Urban"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54309   Expand Pan Tau   (1970) User Score Overview Pan Tau always had a gentle expression and a friendly smile, he was elegantly dressed in a stroller, with an umbrella and a white carnation in the lapel. Foremost, he was famous for his magic bowler hat. By tapping on his hat, Pan Tau was able to change his appearance into a puppet, to conjure up miscellaneous objects or to do other magic. His most characteristically behavior is that he would help children who were experiencing some sort of difficulties in-between their dreams and reality, like finding a place for skiing, settling family problems on Christmas, and even give a boy a good time at a fair when he is supposed to have piano lessons. To adults, he usually remained invisible. Featured Crew Jindřich Polák Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jan Werich Pan Viola Otto Šimánek Pan Tau František Filipovský dědeček Urban Jiřina Bohdalová Helena Urbanová Vladimír Menšík Josef Urban Full Cast & Crew Last Season Season 3 1978 | 7 Episodes Season 3 of Pan Tau premiered on December 31, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pan Tau. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Czech Runtime  30m Homepage  - Genres Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 20 dannyvl S 16 Samara VS 8 Vit Sindlar T 6 Tommy2015  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}