{"link": "https://www.themoviedb.org/tv/72350?language=en", "title": "DuckTales", "resume": "The adventures of billionaire Scrooge McDuck and his nephews Huey, Dewey and Louie, their famous uncle Donald Duck, pilot extraordinaire Launchpad, Mrs. Beakly, Webby and Roboduck. Adventures and hidden treasures are everywhere, in their hometown Duckburg and all around the world.", "rate": 75, "genre": ["Family", "Comedy", "Animation"], "cast": ["Danny Pudi", "Ben Schwartz", "Bobby Moynihan", "Kate Micucci", "Beck Bennett"], "character": ["Huey (voice)", "Dewey (voice)", "Louie (voice)", "Webby Vanderquack (voice)", "Launchpad McQuack (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72350   Expand DuckTales   (2017) User Score  Play Trailer Overview The adventures of billionaire Scrooge McDuck and his nephews Huey, Dewey and Louie, their famous uncle Donald Duck, pilot extraordinaire Launchpad, Mrs. Beakly, Webby and Roboduck. Adventures and hidden treasures are everywhere, in their hometown Duckburg and all around the world. Featured Crew Matt Youngberg Creator Francisco Angones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  3 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  1 Opening Credits  1 Top Billed Cast Danny Pudi Huey (voice) Ben Schwartz Dewey (voice) Bobby Moynihan Louie (voice) Kate Micucci Webby Vanderquack (voice) Beck Bennett Launchpad McQuack (voice) Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of DuckTales premiered on August 12, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply A So what's everyone's opinion about the new show? Open 5 by  vman315 Go to Discussions Media Most Popular Videos  3 Backdrops  3 Posters  4 Recommendations   2016-11-27 Pacific Heat 5.1    2015-04-17 Major Lazer 6.7    2013-01-17 King of the Nerds 2.9    2016-10-16 Eyewitness 7.4    2014-04-09 Deadbeat 6.2    2010-12-25 Come Fly With Me 6.6    2013-09-17 Dads 4.8    1995-09-08 Timon & Pumbaa 5.7  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://disneynow.go.com/shows/ducktales-disney-channel Genres Family Comedy Animation Keywords cartoon duck Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings 34 toeggi 28 6plka6 8 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}