{"link": "https://www.themoviedb.org/tv/75797?language=en", "title": "The Oath", "resume": "Explore a gang world we've never seen before: gangs that are made up of the very men and women sworn to uphold the law – cops. Only select officers make the cut, but once inside, gang members will do what they must to protect each other from enemies inside and outside their ranks.", "rate": 70, "genre": ["Drama"], "cast": ["Sean Bean", "Ryan Kwanten", "Katrina Law", "Joseph Julian Soria", "Cory Hardrict"], "character": ["Tom Hammond", "Steve Hammond", "Karen Beach", "Ramos", "Cole Hammond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75797   Expand The Oath   (2018) User Score  Play Trailer Overview Explore a gang world we've never seen before: gangs that are made up of the very men and women sworn to uphold the law – cops. Only select officers make the cut, but once inside, gang members will do what they must to protect each other from enemies inside and outside their ranks. Featured Crew Joe Halpin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sean Bean Tom Hammond Ryan Kwanten Steve Hammond Katrina Law Karen Beach Joseph Julian Soria Ramos Cory Hardrict Cole Hammond Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of The Oath premiered on March  8, 2018. View All Seasons Social Reviews  1 Discussions  0 A review by Mr. Moovee Written by  Mr. Moovee  on February 28, 2018 Watched the Pilot on 50Cent Facebook feed, Pretty good premiere, sorta gritty like The Shield and Gang Related (surprisely) cancelled) A few well known actors (Katrina Law (Spartacus) , Ryan Kwanten( True Blood) to name a few.  The only thing I didn't like was the shaky cameras. I get the look the director is going for trying to make it seem live but in this case, it's overused and often made me dizzy.   When the rest of the season is released in March I will have more to write.  I love Crackle's other crime show (Startup) so  I'm hoping this one can live up to that show. Read All Reviews Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Oath. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   https://www.crackle.com/the-oath Genres Drama Keywords police gang Content Score 100 Yes! Looking good! Top Contributors 23 Elizabeth Jennings S 17 Skywalker1705 6 Marco S 3 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}