{"link": "https://www.themoviedb.org/tv/144?language=en", "title": "Head Cases", "resume": "Head Cases is an American primetime comedy-drama television program, best known as the first show cancelled for the 2005–2006 season. It was broadcast by FOX and premiered on September 14, 2005. It was cancelled after two episodes on September 22 after disastrous ratings and critical drubbing.\nThe program starred Chris O'Donnell as Jason Payne, who was a superstar attorney at a prestigious law firm until his career put a strain on his marriage. Eventually, Payne had a nervous breakdown and was sent to a \"wellness center\" where he recovered. Upon leaving the center, Payne's therapist \"buddied him up\" with another patient and lawyer, Russell Shultz, who suffered from explosive disorder. As Payne's world continued to crumble around him, he found that his only friend seems to be Shultz. Ultimately, Payne and Shultz decided to open a law firm of their own.\nO'Donnell, known more for his film work, was quoted in a TV Guide article about his reasons for trying a television series:\nThe program was created by Bill Chais, who along with Barry Josephson and Jeff Rake served as executive producers.", "rate": 60, "genre": ["Drama"], "cast": ["Rockmond Dunbar", "Adam Goldberg", "Krista Allen", "Jake Cherry", "Richard Kind"], "character": ["Laurie Payne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 144   Expand Head Cases   (2005) User Score Overview Head Cases is an American primetime comedy-drama television program, best known as the first show cancelled for the 2005–2006 season. It was broadcast by FOX and premiered on September 14, 2005. It was cancelled after two episodes on September 22 after disastrous ratings and critical drubbing. The program starred Chris O'Donnell as Jason Payne, who was a superstar attorney at a prestigious law firm until his career put a strain on his marriage. Eventually, Payne had a nervous breakdown and was sent to a \"wellness center\" where he recovered. Upon leaving the center, Payne's therapist \"buddied him up\" with another patient and lawyer, Russell Shultz, who suffered from explosive disorder. As Payne's world continued to crumble around him, he found that his only friend seems to be Shultz. Ultimately, Payne and Shultz decided to open a law firm of their own. O'Donnell, known more for his film work, was quoted in a TV Guide article about his reasons for trying a television series: The program was created by Bill Chais, who along with Barry Josephson and Jeff Rake served as executive producers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rockmond Dunbar Adam Goldberg Krista Allen Laurie Payne Jake Cherry Richard Kind Full Cast & Crew Last Season Season 1 2005 | 6 Episodes Season 1 of Head Cases premiered on September 14, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Head Cases. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 mea6an  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}