{"link": "https://www.themoviedb.org/tv/61105?language=en", "title": "Naughty Angel", "resume": "In this romantic comedy Teepob (Put) and Lallalit \"Beauty\" (Vill) grew up together but he hates her. So when she comes to him for help to regain power over her family's company, he pranks her by sending her to do the lowest jobs. Lallalit is a spoiled, bratty and selfish heiress who is completely absorbed with her own beauty. Looking down from heaven two angels decide to teach her a lesson by acting as her fairy godmothers and casting a spell on her. Only she doesn't receive a reward but the curse of living her life as a human at day and as a bird at night. Only true love's kiss can break the spell thinks everyone loves her, so when she was challenged to break the spell. Of course Lallalit thinks it would be a piece of cake to find somebody love her but to her surprise she overhears people talking badly about her, hating her for being rotten. Will Lallalit overcome her spoiled attitude and find true love at last?", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Wannarot Sonthichai", "Put Puttichai", "Nicole Theriault", "Butsakon Tantiphana", "Alongkorn Tonnuangkoo"], "character": ["Lallalit/Beauty", "Teepob", "Lalita (Lallalit's mom)", "Pat", "Jade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61105   Expand Naughty Angel   (2014) User Score Overview In this romantic comedy Teepob (Put) and Lallalit \"Beauty\" (Vill) grew up together but he hates her. So when she comes to him for help to regain power over her family's company, he pranks her by sending her to do the lowest jobs. Lallalit is a spoiled, bratty and selfish heiress who is completely absorbed with her own beauty. Looking down from heaven two angels decide to teach her a lesson by acting as her fairy godmothers and casting a spell on her. Only she doesn't receive a reward but the curse of living her life as a human at day and as a bird at night. Only true love's kiss can break the spell thinks everyone loves her, so when she was challenged to break the spell. Of course Lallalit thinks it would be a piece of cake to find somebody love her but to her surprise she overhears people talking badly about her, hating her for being rotten. Will Lallalit overcome her spoiled attitude and find true love at last? Featured Crew นิพนธ์ ผิวเณร Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wannarot Sonthichai Lallalit/Beauty Put Puttichai Teepob Nicole Theriault Lalita (Lallalit's mom) Butsakon Tantiphana Pat Alongkorn Tonnuangkoo Jade Full Cast & Crew Last Season Season 1 2014 | 28 Episodes Season 1 of Naughty Angel premiered on April  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Naughty Angel. You can help by rating TV shows you've seen. Facts Original Name  Leh Nang Fah Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Thai Runtime  58m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 37 Crip 11 Sven-Erik Andersen 4 mariilakorn21 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}