{"link": "https://www.themoviedb.org/tv/48979?language=en", "title": "The Liquidator", "resume": "Jeff Schwarz, the owner of a large liquidation house, works seven days a week following leads and tips that could bring him to the next big buy. Back at the shop, his crew works to make room for the new merchandise by finding buyers for the old.", "rate": 100, "genre": ["Reality"], "cast": ["Jeff Schwarz"], "character": ["Jeff Schwarz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48979   Expand The Liquidator   (2012) User Score Overview Jeff Schwarz, the owner of a large liquidation house, works seven days a week following leads and tips that could bring him to the next big buy. Back at the shop, his crew works to make room for the new merchandise by finding buyers for the old. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Schwarz Jeff Schwarz Full Cast & Crew Last Season Season 4 2015 | 39 Episodes Season 4 of The Liquidator premiered on January  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Liquidator. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  22m Homepage   http://www.oln.ca/shows/the-liquidator/ Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors s 13 servia 9 Elizabeth Jennings z 5 zurman1 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}