{"link": "https://www.themoviedb.org/tv/35331?language=en", "title": "Good Game: Spawn Point", "resume": "Hosted by passionate gamers Hex (Stephanie Bendixsen) and Bajo (Steven  O'Donnell) and not so nice Robot, Darren (Data Analysing Robot for the  Ruthless Extermination of Noobs), Good Game: SP will be the show for  younger gamers by gamers.", "rate": 50, "genre": ["Kids", "News"], "cast": ["Steven 'Bajo' O'Donnell", "Angharad Yeo", "Gus Ronald"], "character": ["Himself - Host", "Herself - Host", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35331   Expand Good Game: Spawn Point   (2010) User Score Overview Hosted by passionate gamers Hex (Stephanie Bendixsen) and Bajo (Steven  O'Donnell) and not so nice Robot, Darren (Data Analysing Robot for the  Ruthless Extermination of Noobs), Good Game: SP will be the show for  younger gamers by gamers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven 'Bajo' O'Donnell Himself - Host Angharad Yeo Herself - Host Gus Ronald Himself - Host Full Cast & Crew Last Season Series 8 2017 | 20 Episodes Season 8 of Good Game: Spawn Point premiered on February 18, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Good Game: Spawn Point. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Good Game: Spawn Point. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.abc.net.au/abc3/goodgamesp/ Genres Kids News Keywords video game reviews Content Score 56 We're so close, yet so far. Top Contributors 36 United600 a 2 apung21 1 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}