{"link": "https://www.themoviedb.org/tv/75701?language=en", "title": "Unnatural", "resume": "Mikoto Misumi is a pathologist at UDI (Unnatural Death Investigation) Lab. She can't stand neglecting unnatural deaths and believes there must be a truth behind the deaths. Team members that work with her are autopsy doctor Kai Nakado, recorder Rokuro Kube, clinical test technologist Yuko Shoji and UDI director Yasuo Kamikura.\nThey work on unnatural death cases and try to reveal the truth behind the deaths.", "rate": 97, "genre": ["Crime", "Drama", "Drama"], "cast": ["Satomi Ishihara", "Arata Iura", "Masataka Kubota", "Mikako Ichikawa", "Yutaka Matsushige"], "character": ["Mikoto Misumi", "Kai Nakado", "Rokuro Kube", "Yuko Shoji", "Yasuo Kamikura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75701   Expand Unnatural   (2018) User Score Overview Mikoto Misumi is a pathologist at UDI (Unnatural Death Investigation) Lab. She can't stand neglecting unnatural deaths and believes there must be a truth behind the deaths. Team members that work with her are autopsy doctor Kai Nakado, recorder Rokuro Kube, clinical test technologist Yuko Shoji and UDI director Yasuo Kamikura. They work on unnatural death cases and try to reveal the truth behind the deaths. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satomi Ishihara Mikoto Misumi Arata Iura Kai Nakado Masataka Kubota Rokuro Kube Mikako Ichikawa Yuko Shoji Yutaka Matsushige Yasuo Kamikura Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Unnatural premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Unnatural. You can help by rating TV shows you've seen. Facts Original Name  アンナチュラル Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.tbs.co.jp/unnatural2018/ Genres Crime Drama Drama Keywords japan forensic 日本 Content Score 86 Almost there... Top Contributors M 37 Maria180493 5 Elizabeth Jennings 5 MagicFire 4 lovelydelta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}