{"link": "https://www.themoviedb.org/tv/34114?language=en", "title": "Cat's Eye", "resume": "Cat's Eye is a Japanese manga series written and illustrated by Tsukasa Hojo. It was serialized in Weekly Shōnen Jump from 1981 to 1985, and collected into 18 tankōbon by Shueisha. The story follows the adventures of the three Kisugi sisters, Hitomi, Rui and Ai, who are art thieves trying to collect all the works belonging to their missing father.\nThe manga was made into a televised anime series originally broadcast in 1983 to 1984 on NTV, with a second season ending in 1985. It has also received two live-action adaptations; a TV movie in 1988 and a theatrical film in 1997.\nCat's Eye is one of Weekly Shōnen Jump's best-selling manga series of all time, with over 18 million copies sold. The anime has also aired in a number of countries outside Japan, including Canada, France, Germany, Italy, Philippines, and China. In 2007, ImaginAsian broadcast the first season of the first anime on ImaginAsian TV, and then gave the series its first North American home video release. Right Stuf Inc. announced that they licensed the series in 2013 and release it on DVD under their Nozomi label.\nA remake manga of the series drawn by Shingo Asai, also titled Cat's Eye, began publication in the debut issue of Coamix's Monthly Comic Zenon anthology, which was published on October 25, 2010.", "rate": 87, "genre": ["Animation", "Action", "Adventure", "Comedy", "Drama"], "cast": ["Keiko Toda", "Toshiko Fujita", "Chika Sakamoto", "Yoshito Yasuhara", "Tamio Ohki"], "character": ["Hitomi Kisugi", "Rui Kisugi", "Ai Kisugi", "Toshio Utsumi", "Sadatsugu Nagaishi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34114   Expand Cat's Eye   (1983) User Score Overview Cat's Eye is a Japanese manga series written and illustrated by Tsukasa Hojo. It was serialized in Weekly Shōnen Jump from 1981 to 1985, and collected into 18 tankōbon by Shueisha. The story follows the adventures of the three Kisugi sisters, Hitomi, Rui and Ai, who are art thieves trying to collect all the works belonging to their missing father. The manga was made into a televised anime series originally broadcast in 1983 to 1984 on NTV, with a second season ending in 1985. It has also received two live-action adaptations; a TV movie in 1988 and a theatrical film in 1997. Cat's Eye is one of Weekly Shōnen Jump's best-selling manga series of all time, with over 18 million copies sold. The anime has also aired in a number of countries outside Japan, including Canada, France, Germany, Italy, Philippines, and China. In 2007, ImaginAsian broadcast the first season of the first anime on ImaginAsian TV, and then gave the series its first North American home video release. Right Stuf Inc. announced that they licensed the series in 2013 and release it on DVD under their Nozomi label. A remake manga of the series drawn by Shingo Asai, also titled Cat's Eye, began publication in the debut issue of Coamix's Monthly Comic Zenon anthology, which was published on October 25, 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keiko Toda Hitomi Kisugi Toshiko Fujita Rui Kisugi Chika Sakamoto Ai Kisugi Yoshito Yasuhara Toshio Utsumi Tamio Ohki Sadatsugu Nagaishi Full Cast & Crew Last Season Season 2 1984 | 37 Episodes Season 2 of Cat's Eye premiered on October 18, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Cat's Eye. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Cat's Eye. You can help by rating TV shows you've seen. Facts Original Name  キャッツ・アイ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 Linero M 11 Marco 6 TheDerpMan M 4 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}