{"link": "https://www.themoviedb.org/tv/90?language=en", "title": "Mayday", "resume": "Revealing the dark truth that aviation safety improves one crash at a time, Mayday  investigates legendary aviation disasters to find out what went wrong and why.\nBased on cockpit voice recorders, accident reports and eyewitness accounts, every episode also features interviews, state-of-the-art CGI and gripping reenactments.", "rate": 72, "genre": ["Documentary", "Drama"], "cast": ["Stephen Bogaert"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 90   Expand Mayday   (2003) User Score  Play Trailer Overview Revealing the dark truth that aviation safety improves one crash at a time, Mayday  investigates legendary aviation disasters to find out what went wrong and why. Based on cockpit voice recorders, accident reports and eyewitness accounts, every episode also features interviews, state-of-the-art CGI and gripping reenactments. Featured Crew Andre Barro Creator Bernard Vaillot Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Bogaert Himself - Narrator Full Cast & Crew Current Season Season 18 2018 | 6 Episodes Season 18 of Mayday premiered on February 13, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Mayday. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2004-10-11 Postcards from Buster 8.5    2014-04-09 Science of Stupid 6.0    NBA on TNT 0.0  Facts Status  Returning Series Networks Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.discovery.ca/Shows/Mayday Genres Documentary Drama Keywords airplane investigation aviation disaster airplane crash forensic Content Score 71 Just a little bit more... Top Contributors 29 OzDrDj N 27 NeXrom 26 Banana 25 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}