{"link": "https://www.themoviedb.org/tv/73532?language=en", "title": "Surrogate", "resume": "Jane Martin (25 years old), young graduate, is recruited by the Doctor Faye's clinical, \"the clinical for healthy sex\". Through her maturity, self-confidence and great sexual experience, she requires the obvious qualities to become a good therapist. But Jane does not respect all the rules with her patients and becomes more closer with them. Ignoring the warnings of Dr. Faye, Jane puts her patients and herself in danger.", "rate": 0, "genre": ["Drama"], "cast": ["Marise Askehave"], "character": ["Alexandra Faye"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73532   Expand Surrogate   (2017) User Score  Play Trailer Overview Jane Martin (25 years old), young graduate, is recruited by the Doctor Faye's clinical, \"the clinical for healthy sex\". Through her maturity, self-confidence and great sexual experience, she requires the obvious qualities to become a good therapist. But Jane does not respect all the rules with her patients and becomes more closer with them. Ignoring the warnings of Dr. Faye, Jane puts her patients and herself in danger. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marise Askehave Alexandra Faye Full Cast & Crew Last Season Season 1 2017 | 9 Episodes Season 1 of Surrogate premiered on June 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Surrogate. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   https://www.blackpills.com/ Genres Drama Keywords sex Content Score 50 Still needs a little work. Top Contributors 9 joeynotjoe E 9 Erinshea d 3 delbosk 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}