{"link": "https://www.themoviedb.org/tv/46700?language=en", "title": "The Escape Artist", "resume": "A chilling and bloody legal thriller that explores the line between law and justice. Will Burton, a talented junior barrister of peerless intellect and winning charm, specialises in spiriting people out of tight legal corners. He is in high demand as he has never lost a case. But when his talents acquit the notorious prime suspect in an horrific murder trial, that brilliance comes back to bite him with unexpected and chilling results, not to mention a shocking twist.", "rate": 70, "genre": ["Drama"], "cast": ["David Tennant", "Toby Kebbell", "Gus Barry", "Brid Brennan", "Tony Gardner"], "character": ["Will Burton", "Liam Foyle", "Jamie Burton", "Mary", "Trevor Harris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46700   Expand The Escape Artist   (2013) User Score  Play Trailer Overview A chilling and bloody legal thriller that explores the line between law and justice. Will Burton, a talented junior barrister of peerless intellect and winning charm, specialises in spiriting people out of tight legal corners. He is in high demand as he has never lost a case. But when his talents acquit the notorious prime suspect in an horrific murder trial, that brilliance comes back to bite him with unexpected and chilling results, not to mention a shocking twist. Featured Crew David Wolstencroft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Tennant Will Burton Toby Kebbell Liam Foyle Gus Barry Jamie Burton Brid Brennan Mary Tony Gardner Trevor Harris Full Cast & Crew Last Season Season 1 2013 | 3 Episodes Season 1 of The Escape Artist premiered on October 29, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Escape Artist. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2012-02-02 Inside Men 6.4    2015-04-06 Code of a Killer 7.0    2010-07-12 The Silence 6.8    2011-05-02 Case Sensitive 5.4    2004-07-19 The Grid 7.0    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p01jmyrk Genres Drama Keywords london england revenge lawyer barrister wife murder Content Score 100 Yes! Looking good! Top Contributors 11 Steve 10 Banana 9 Elizabeth Jennings CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}