{"link": "https://www.themoviedb.org/tv/22940?language=en", "title": "SCTV Network 90", "resume": "After a successful Canadian run as Second City TV on Global and SCTV on CBC, the cast packed up and moved to America (theoretically) when NBC offered them a timeslot under the title SCTV Network 90. With them, they brought their unique, quirky characters, their personalities, and the shows they had appeared on. Dick Blasucci had begun writing for the cast in their second series, SCTV, and joined them here, serving as a recurring straight man for the characters. Tony Rosato and Robin Duke wrote scripts at the beginning of the show as they had before, until quickly leaving to write and perform for Saturday Night Live. The appeal of SCTV Network 90, however, doesn't only come from the writing, but from the sheer wit of its legendary stars.", "rate": 81, "genre": ["Comedy"], "cast": ["Martin Short", "Catherine O'Hara", "Dave Thomas", "John Candy", "Rick Moranis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22940   Expand SCTV Network 90   (1981) User Score Overview After a successful Canadian run as Second City TV on Global and SCTV on CBC, the cast packed up and moved to America (theoretically) when NBC offered them a timeslot under the title SCTV Network 90. With them, they brought their unique, quirky characters, their personalities, and the shows they had appeared on. Dick Blasucci had begun writing for the cast in their second series, SCTV, and joined them here, serving as a recurring straight man for the characters. Tony Rosato and Robin Duke wrote scripts at the beginning of the show as they had before, until quickly leaving to write and perform for Saturday Night Live. The appeal of SCTV Network 90, however, doesn't only come from the writing, but from the sheer wit of its legendary stars. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Short Catherine O'Hara Dave Thomas John Candy Rick Moranis Full Cast & Crew Last Season Season 5 1983 | 6 Episodes Season 5 of SCTV Network 90 premiered on January 28, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1970-09-25 The Partridge Family 5.5    1976-09-21 Second City Television 8.0    1968-09-17 Julia 6.3    1948-06-20 The Ed Sullivan Show 6.6    1987-01-18 Degrassi Junior High 7.5    1984-10-03 Charles in Charge 5.1    1970-09-24 The Odd Couple 7.1    1989-10-24 The Kids in the Hall 7.7  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Comedy Keywords sketch comedy Content Score 86 Almost there... Top Contributors 8 Banana 6 Steve 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}