{"link": "https://www.themoviedb.org/tv/71492?language=en", "title": "Loaded", "resume": "Four friends who become multi-millionaires when they sell their video game company for a clean £246 million and overnight, the four friends are transformed from \"people who play games\" to \"serious players in the game...\" - or are they?", "rate": 64, "genre": ["Drama", "Comedy"], "cast": ["Jim Howick", "Samuel Anderson", "Jonny Sweet", "Nick Helm", "Mary McCormack"], "character": ["Josh", "Leon", "Ewan", "Watto", "Casey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71492   Expand Loaded   (2017) User Score  Play Trailer Overview Four friends who become multi-millionaires when they sell their video game company for a clean £246 million and overnight, the four friends are transformed from \"people who play games\" to \"serious players in the game...\" - or are they? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Howick Josh Samuel Anderson Leon Jonny Sweet Ewan Nick Helm Watto Mary McCormack Casey Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Loaded premiered on May  8, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Loaded now on AMC in the U.S.  Any recommendations? Open 3 by  lmao7 Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2014-10-28 The Missing 7.0    2015-01-15 The Man in the High Castle 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.channel4.com/programmes/loaded Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 23 Elizabeth Jennings 5 Mervan jp 5 juan perez J 4 JohnBordello  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}