{"link": "https://www.themoviedb.org/tv/68071?language=en", "title": "ALL OUT!!", "resume": "In rugby, there is no ace striker, there is no number four batter, so who is the star of the team?  The story begins at school entrance ceremony of Kanagawa High School where Kenji Gion, a small but gutsy go-getter joins the rugby club. He joins with his classmate, Iwashimizu, who has a complicated past and sub-captain Hachiouji, who always takes good care of his Club members. Lastly, there is Captain Sekizan, who has overwhelming powers but keeps his cards close to his chest. With such differences in both personality and physical performance, the team must learn to work and grow together so they can become the best.", "rate": 57, "genre": ["Animation", "Comedy"], "cast": ["Shouya Chiba", "Adachi Yuto"], "character": ["Kenji Gion (voice)", "Sumiaki Iwashimizu (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68071   Expand ALL OUT!!   (2016) User Score  Play Trailer Overview In rugby, there is no ace striker, there is no number four batter, so who is the star of the team?  The story begins at school entrance ceremony of Kanagawa High School where Kenji Gion, a small but gutsy go-getter joins the rugby club. He joins with his classmate, Iwashimizu, who has a complicated past and sub-captain Hachiouji, who always takes good care of his Club members. Lastly, there is Captain Sekizan, who has overwhelming powers but keeps his cards close to his chest. With such differences in both personality and physical performance, the team must learn to work and grow together so they can become the best. Featured Crew Kenichi Shimizu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shouya Chiba Kenji Gion (voice) Adachi Yuto Sumiaki Iwashimizu (voice) Full Cast & Crew Last Season Season 1 2016 | 25 Episodes Season 1 of ALL OUT!! premiered on October  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2017-07-04 Tsuredure Children 8.0    2016-07-08 Alderamin on the Sky 7.4    2016-07-09 91 Days 7.3    2016-01-11 Grimgar of Fantasy and Ash 7.2  Facts Original Name  オールアウト!! Status  Returning Series Networks - Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Keywords sport rugby anime Content Score 71 Just a little bit more... Top Contributors M 18 Migi 16 iliass guendouz 14 ioneakatzuki z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}