{"link": "https://www.themoviedb.org/tv/886?language=en", "title": "Pope John Paul II", "resume": "The life of the remarkable man who passed away after an extraordinary 26 year reign, and whose papal odyssey encompassed more than 120 countries and earned him the reputation of an international fighter for freedom.", "rate": 65, "genre": ["Drama"], "cast": ["Cary Elwes", "James Cromwell", "Ben Gazzara", "Christopher Lee", "Giuliano Gemma"], "character": ["Young Karol Wojtyla", "Cardinal Adam Sapieha", "Kardinal Agostino Casaroli", "Kardinal Stefan Wyszyński", "Dr. Joaquín Navarro-Valls"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 886   Expand Pope John Paul II   (2005) User Score Overview The life of the remarkable man who passed away after an extraordinary 26 year reign, and whose papal odyssey encompassed more than 120 countries and earned him the reputation of an international fighter for freedom. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cary Elwes Young Karol Wojtyla James Cromwell Cardinal Adam Sapieha Ben Gazzara Kardinal Agostino Casaroli Christopher Lee Kardinal Stefan Wyszyński Giuliano Gemma Dr. Joaquín Navarro-Valls Full Cast & Crew Last Season Miniseries 2005 | 2 Episodes Season 1 of Pope John Paul II premiered on December  4, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Pope John Paul II. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  100m Homepage   http://www.luxvide.it/en/pope-john-paul-ii-66.html Genres Drama Keywords pope biography religion miniseries Content Score 71 Just a little bit more... Top Contributors TB 20 TMDb Bot 19 Banana R 11 Rebecca 2 fireknob  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}