{"link": "https://www.themoviedb.org/tv/10840?language=en", "title": "Stuart Little: The Animated Series", "resume": "Stuart Little: The Animated Series is an American animated television series, loosely based on the E. B. White children's book Stuart Little and more based on the live action movie adaptations. It was produced by Red Wagon Productions and Sony Pictures Television for the HBO Family digital cable television channel, and aired for just one 13-episode season in 2003.", "rate": 30, "genre": ["Animation"], "cast": ["David Kaufman", "Quinton Flynn", "Myles Jeffrey", "Jennifer Hale", "Dee Bradley Baker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10840   Expand Stuart Little: The Animated Series   (2003) User Score Overview Stuart Little: The Animated Series is an American animated television series, loosely based on the E. B. White children's book Stuart Little and more based on the live action movie adaptations. It was produced by Red Wagon Productions and Sony Pictures Television for the HBO Family digital cable television channel, and aired for just one 13-episode season in 2003. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Kaufman Quinton Flynn Myles Jeffrey Jennifer Hale Dee Bradley Baker Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Stuart Little: The Animated Series premiered on March  1, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Stuart Little: The Animated Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.stuartlittletv.com Genres Animation Keywords mouse based on children's book Content Score 71 Just a little bit more... Top Contributors R 3 Rebecca s 3 speedycars D 2 Daniel 2 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}