{"link": "https://www.themoviedb.org/tv/3813?language=en", "title": "Little Mosque on the Prairie", "resume": "Little Mosque on the Prairie is a Canadian sitcom that aired on CBC, created by Zarqa Nawaz and produced by WestWind Pictures. It was filmed in Toronto, Ontario and Indian Head, Saskatchewan. The series was selected and showcased at the 2009 Dawn Breakers International Film Festival in Zurich.\nOn April 2, 2012, the series finale to Little Mosque on the Prairie aired on the CBC. In May 2012, Hulu announced it would begin airing the series under the name Little Mosque in summer 2012. The series will make its U.S. syndication debut on Pivot beginning in August 2013.", "rate": 75, "genre": ["Comedy"], "cast": ["Brandon Firla"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3813   Expand Little Mosque on the Prairie   (2007) User Score Overview Little Mosque on the Prairie is a Canadian sitcom that aired on CBC, created by Zarqa Nawaz and produced by WestWind Pictures. It was filmed in Toronto, Ontario and Indian Head, Saskatchewan. The series was selected and showcased at the 2009 Dawn Breakers International Film Festival in Zurich. On April 2, 2012, the series finale to Little Mosque on the Prairie aired on the CBC. In May 2012, Hulu announced it would begin airing the series under the name Little Mosque in summer 2012. The series will make its U.S. syndication debut on Pivot beginning in August 2013. Featured Crew Zarqa Nawaz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brandon Firla Full Cast & Crew Last Season Season 6 2012 | 11 Episodes Season 6 of Little Mosque on the Prairie premiered on January  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2010-09-23 Outsourced 6.7    2010-09-28 No Ordinary Family 6.1    2008-10-03 Sanctuary 6.8    2015-09-22 Scream Queens 6.3    2009-09-24 FlashForward 6.9    2004-10-03 Desperate Housewives 6.6    2005-09-20 My Name Is Earl 7.2    2006-07-18 Eureka 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.cbc.ca/littlemosque/ Genres Comedy Keywords small town canada muslim arab sitcom Content Score 64 We're so close, yet so far. Top Contributors 8 Banana 3 Nuno Filipe de Vilhena Santos w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}