{"link": "https://www.themoviedb.org/tv/288?language=en", "title": "¡Mucha Lucha!", "resume": "¡Mucha Lucha! is an American/Canadian animated television series that premiered on Kids' WB on August 17, 2002. It was created by Eddie Mort and Lili Chin and produced by Warner Bros. Animation. It is the first animated television series created with Adobe Flash, a program often used for Internet cartoons. The show was also seen on Teletoon in Canada, CITV and Kix! in the UK, and Cartoon Network worldwide.\nThe show is set in a town centered around Lucha libre and is essentially about the adventures of three children, Rikochet, The Flea and Buena Girl, as they struggle through the Foremost World-Renowned International School of Lucha, where they study.", "rate": 65, "genre": ["Comedy", "Animation"], "cast": ["Jason Marsden", "Candi Milo", "Kimberly Brooks"], "character": ["Rikochet (voice)", "The Flea (voice)", "Buena Girl (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 288   Expand ¡Mucha Lucha!   (2002) User Score Overview ¡Mucha Lucha! is an American/Canadian animated television series that premiered on Kids' WB on August 17, 2002. It was created by Eddie Mort and Lili Chin and produced by Warner Bros. Animation. It is the first animated television series created with Adobe Flash, a program often used for Internet cartoons. The show was also seen on Teletoon in Canada, CITV and Kix! in the UK, and Cartoon Network worldwide. The show is set in a town centered around Lucha libre and is essentially about the adventures of three children, Rikochet, The Flea and Buena Girl, as they struggle through the Foremost World-Renowned International School of Lucha, where they study. Featured Crew Eddie Mort Creator Lili Chin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Marsden Rikochet (voice) Candi Milo The Flea (voice) Kimberly Brooks Buena Girl (voice) Full Cast & Crew Last Season Season 3 2004 | 17 Episodes Season 3 of ¡Mucha Lucha! premiered on September 11, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ¡Mucha Lucha!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Animation Keywords mexico kids Content Score 64 We're so close, yet so far. Top Contributors 15 Banana T 3 TVPlayerLatino 3 Rafaelasauani 3 Robson Guedes Vieira  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}