{"link": "https://www.themoviedb.org/tv/42208?language=en", "title": "Reef Doctors", "resume": "Running the remote Hope Island Clinic, Sam Stewart is an accomplished doctor, who with her team, looks after the residents of all the neighbouring islands, as well as the holidaymakers and thrill seekers who visit the area. Not only a GP, Sam is a single mother with a free spirit and a determination – who has an unusual hobby: venom.", "rate": 0, "genre": ["Drama"], "cast": ["Lisa McCune", "Richard Brancatisano", "Rohan Nichol", "Susan Hoecke", "Andrew Ryan"], "character": ["Sam Stewart", "Rick D'Alessandro", "Toby McGrath", "Freya Klein", "Gus Cochrane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42208   Expand Reef Doctors   (2013) User Score  Play Trailer Overview Running the remote Hope Island Clinic, Sam Stewart is an accomplished doctor, who with her team, looks after the residents of all the neighbouring islands, as well as the holidaymakers and thrill seekers who visit the area. Not only a GP, Sam is a single mother with a free spirit and a determination – who has an unusual hobby: venom. Featured Crew Jonathan M. Shiff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa McCune Sam Stewart Richard Brancatisano Rick D'Alessandro Rohan Nichol Toby McGrath Susan Hoecke Freya Klein Andrew Ryan Gus Cochrane Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Reef Doctors premiered on June  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Reef Doctors. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  43m Homepage   https://tenplay.com.au/channel-eleven/reef-doctors Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 38 United600 s 3 speedycars 3 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}