{"link": "https://www.themoviedb.org/tv/69193?language=en", "title": "Fan Service", "resume": "Gray Haddock, Kerry Shawcross, Miles Luna, and their friends discuss the latest news, trailers, and episodes from the world of Anime.", "rate": 0, "genre": ["Talk"], "cast": ["Kerry Shawcross", "Yssa Badiola", "Gray Haddock", "Austin Hardwicke", "Cole Gallian"], "character": ["Self", "Self", "Self", "Self", "Self"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69193   Expand Fan Service   (2016) User Score Overview Gray Haddock, Kerry Shawcross, Miles Luna, and their friends discuss the latest news, trailers, and episodes from the world of Anime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kerry Shawcross Self Yssa Badiola Self Gray Haddock Self Austin Hardwicke Self Cole Gallian Self Full Cast & Crew Last Season 2017 2017 | 37 Episodes Season 2 of Fan Service premiered on February 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fan Service. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  75m Homepage   http://roosterteeth.com/show/fan-service Genres Talk Keywords podcast anime Content Score 86 Almost there... Top Contributors S 101 Spekular  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}