{"link": "https://www.themoviedb.org/tv/2580?language=en", "title": "Stargate Infinity", "resume": "Stargate Infinity is an American animated science fiction television series and part of Metro-Goldwyn-Mayer's Stargate franchise, but is not considered official Stargate canon. The show was created by Eric Lewald and Michael Maliani, as a spin-off series of Stargate SG-1 created by Brad Wright and Jonathan Glassner after the release of Stargate. The cartoon had a low viewership rating and poor reception; it was canceled after one season. Co-produced by MGM Television and DIC Entertainment and directed by Will Meugniot.\nThe story arc of Stargate Infinity follows Gus Bonner being framed for opening the Stargate for alien enemies in a future version of Stargate Command. Bonner escapes with a group of fresh recruits through the Stargate. The team can not return to Earth before they have cleared their names. The show was cancelled before any of its major plots could be resolved. The story unfolds when the members of the team encounters different alien races from other planets.", "rate": 48, "genre": ["Animation"], "cast": ["Dale Wilson", "Tifanie Christun", "Kathleen Barr", "Mark Hildreth", "Mackenzie Gray"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2580   Expand Stargate Infinity   (2002) User Score Overview Stargate Infinity is an American animated science fiction television series and part of Metro-Goldwyn-Mayer's Stargate franchise, but is not considered official Stargate canon. The show was created by Eric Lewald and Michael Maliani, as a spin-off series of Stargate SG-1 created by Brad Wright and Jonathan Glassner after the release of Stargate. The cartoon had a low viewership rating and poor reception; it was canceled after one season. Co-produced by MGM Television and DIC Entertainment and directed by Will Meugniot. The story arc of Stargate Infinity follows Gus Bonner being framed for opening the Stargate for alien enemies in a future version of Stargate Command. Bonner escapes with a group of fresh recruits through the Stargate. The team can not return to Earth before they have cleared their names. The show was cancelled before any of its major plots could be resolved. The story unfolds when the members of the team encounters different alien races from other planets. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dale Wilson Tifanie Christun Kathleen Barr Mark Hildreth Mackenzie Gray Full Cast & Crew Last Season Stargate: infinity season 1 2002 | 26 Episodes Season 1 of Stargate Infinity premiered on September 14, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1994-03-05 Weird Science 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cjar.com/cj_shows_stargate.php Genres Animation Keywords space travel Content Score 86 Almost there... Top Contributors z 5 zurman1 3 rtentser D 2 Daniel 2 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}