{"link": "https://www.themoviedb.org/tv/38960?language=en", "title": "The Quick Draw McGraw Show", "resume": "The Quick Draw McGraw Show is the third cartoon television production created by Hanna-Barbera, starring an anthropomorphic cartoon horse named Quick Draw McGraw following their success with The Ruff & Reddy Show and The Huckleberry Hound Show. The show debuted in syndication in the fall of 1959, sponsored by Kellogg's. Voice actor Daws Butler performed the lead character, Quick Draw. The series featured 3 cartoons per episode, one each by Quick Draw McGraw & Baba Looey, father and son dog duo Augie Doggie & Doggie Daddy and cat and mouse detectives Snooper & Blabber.\nMichael Maltese crafted most of the episode stories. Screen Gems originally syndicated the series, followed later by Rhodes Productions, Taft H-B Program Sales, Worldvision Enterprises, then Turner Broadcasting, and now Warner Bros. Television. Currently, the show is aired on the Cartoon Network's sister channel, Boomerang, the Canadian station Teletoon Retro and occasionally on the Infinity channel, broadcasting in the Middle East.", "rate": 68, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38960   Expand The Quick Draw McGraw Show   (1959) User Score Overview The Quick Draw McGraw Show is the third cartoon television production created by Hanna-Barbera, starring an anthropomorphic cartoon horse named Quick Draw McGraw following their success with The Ruff & Reddy Show and The Huckleberry Hound Show. The show debuted in syndication in the fall of 1959, sponsored by Kellogg's. Voice actor Daws Butler performed the lead character, Quick Draw. The series featured 3 cartoons per episode, one each by Quick Draw McGraw & Baba Looey, father and son dog duo Augie Doggie & Doggie Daddy and cat and mouse detectives Snooper & Blabber. Michael Maltese crafted most of the episode stories. Screen Gems originally syndicated the series, followed later by Rhodes Productions, Taft H-B Program Sales, Worldvision Enterprises, then Turner Broadcasting, and now Warner Bros. Television. Currently, the show is aired on the Cartoon Network's sister channel, Boomerang, the Canadian station Teletoon Retro and occasionally on the Infinity channel, broadcasting in the Middle East. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1959 | 2 Episodes Season 1 of The Quick Draw McGraw Show premiered on September 29, 1959. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Quick Draw McGraw Show. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 10 Robson Guedes Vieira 2 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}