{"link": "https://www.themoviedb.org/tv/64533?language=en", "title": "Strikers", "resume": "Two brothers, one shared dream - that of becoming a professional football player. When one is selected to play for a top football club, he discovers the glamourous yet deceitful world of top class football. The other brother's football dream is shattered, and he must find another way to make something of his life. Both the brothers and their family will find out that there's a price to be paid for success. Will their love for each other turn out to be stronger than the call of money and fame?", "rate": 0, "genre": ["Drama"], "cast": ["Oscar Willems", "Joren Seldeslachts", "Gökhan Girginol", "Frances Lefebure", "Junior Bright"], "character": ["Dennis Moerman", "Alan Moerman", "Ibrahim", "Lisa", "Jemaine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64533   Expand Strikers   (2015) User Score Overview Two brothers, one shared dream - that of becoming a professional football player. When one is selected to play for a top football club, he discovers the glamourous yet deceitful world of top class football. The other brother's football dream is shattered, and he must find another way to make something of his life. Both the brothers and their family will find out that there's a price to be paid for success. Will their love for each other turn out to be stronger than the call of money and fame? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oscar Willems Dennis Moerman Joren Seldeslachts Alan Moerman Gökhan Girginol Ibrahim Frances Lefebure Lisa Junior Bright Jemaine Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Strikers premiered on March 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Strikers. You can help by rating TV shows you've seen. Facts Original Name  Spitsbroers Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  45m, 40m Homepage   http://vtm.be/spitsbroers Genres Drama Keywords soccer Content Score 86 Almost there... Top Contributors 31 johanboskamp 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}