{"link": "https://www.themoviedb.org/tv/2117?language=en", "title": "The Flying Nun", "resume": "The Flying Nun is an American sitcom produced by Screen Gems for ABC based on the 1965 book The Fifteenth Pelican, by Tere Rios. It starred Sally Field as Sister Bertrille. The series originally ran on ABC from September 7, 1967, to April 3, 1970, producing 82 episodes, including a one-hour pilot episode.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Alejandro Rey", "Sally Field", "Marge Redmond", "Madeleine Sherwood", "Naomi Stevens"], "character": ["Sister Bertrille"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2117   Expand The Flying Nun   (1967) User Score Overview The Flying Nun is an American sitcom produced by Screen Gems for ABC based on the 1965 book The Fifteenth Pelican, by Tere Rios. It starred Sally Field as Sister Bertrille. The series originally ran on ABC from September 7, 1967, to April 3, 1970, producing 82 episodes, including a one-hour pilot episode. Featured Crew Marie Teresa Ríos Creator Bernard Slade Creator Harry Ackerman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Alejandro Rey Sally Field Sister Bertrille Marge Redmond Madeleine Sherwood Naomi Stevens Full Cast & Crew Last Season Season 3 1969 | 26 Episodes Season 3 of The Flying Nun premiered on September 17, 1969. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Sister Bertrille: Happy Birthday Sally Field! Open 0 by wonder2wonder\n      \n     th e  director of the  show Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   1967-09-10 Gentle Ben 5.0    1970-09-25 The Partridge Family 5.5    1972-10-19 Colditz 9.0    1972-09-17 Anna and the King 5.0    1960-09-29 My Three Sons 6.0    1964-09-24 Daniel Boone 5.9    1966-09-12 Family Affair 5.4    1949-09-15 The Lone Ranger 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors TB 1 TMDb Bot 1 janar 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}