{"link": "https://www.themoviedb.org/tv/26338?language=en", "title": "Tavis Smiley", "resume": "Tavis Smiley features a unique mix of news and pop culture to combine for one thought-provoking and entertaining program. A hybrid of news, issues and entertainment, it features interviews with artists, activists, newsmakers, politicians and everyday people.\nSince its first season, the show has won four NAACP Image Awards for \"Outstanding Television, News, Talk, or Information (Series or Special).\"\nTaped at KCET studios, Tavis Smiley is the first West Coast talk show for PBS and is produced by The Smiley Group Inc./TS Media Inc. in association with KCET/Hollywood.", "rate": 85, "genre": ["Talk", "News"], "cast": ["Tavis Smiley"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26338   Expand Tavis Smiley   (2004) User Score Overview Tavis Smiley features a unique mix of news and pop culture to combine for one thought-provoking and entertaining program. A hybrid of news, issues and entertainment, it features interviews with artists, activists, newsmakers, politicians and everyday people. Since its first season, the show has won four NAACP Image Awards for \"Outstanding Television, News, Talk, or Information (Series or Special).\" Taped at KCET studios, Tavis Smiley is the first West Coast talk show for PBS and is produced by The Smiley Group Inc./TS Media Inc. in association with KCET/Hollywood. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tavis Smiley Himself - Host Full Cast & Crew Last Season Season 11 2013 | 129 Episodes Season 11 of Tavis Smiley premiered on December 23, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tavis Smiley. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  News Original Language  English Runtime  30m Homepage   http://www.pbs.org/wnet/tavissmiley/ Genres Talk News Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 17 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}