{"link": "https://www.themoviedb.org/tv/66038?language=en", "title": "Les Kassos", "resume": "The crisis saves nobody. Even not the characters of our childhood. To  such a point that some people of them even became socially disadvantaged  persons. Fortunately for them, all is not lost and a brave social  worker decided to deal with their case. Come in his office and assist  its confidential interviews with Aspegix and Grodebilix, Zizimir, Sandy,  Proumfs, Mr Patatos, Marius and Gigi, the Tortoises Tramps and all  Kassos which suffer in the biggest indifference.", "rate": 100, "genre": ["Comedy"], "cast": ["Jeanne Chartier", "Thierry Simon", "Guillaume Darnault", "Baptiste Lorber", "Kevin Razy"], "character": ["Leya Sodo / Sandy / Les Proumpfs / Hello Kiki / Petit Prince / Edouard Mama / Ariel / Mei / Pimprenelle / Alice / Hard E.T. / Ondine", "Dark Papy / Les Canards Jr.", "Les Canards Jr. / Muldor / Les Proumpfs / Papy Fougasse / Monsieur Man / Les Daltonne / Pedro / Lapin du Métro / Edouard / Porkypute / Ptiripou / Rouge Roger / Yu Gi Uno / Vegueta / Le Marchand de sable / James", "Froton / Wilson / Rose Roger", "Charles Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66038   Expand Les Kassos   (2013) User Score Overview The crisis saves nobody. Even not the characters of our childhood. To  such a point that some people of them even became socially disadvantaged  persons. Fortunately for them, all is not lost and a brave social  worker decided to deal with their case. Come in his office and assist  its confidential interviews with Aspegix and Grodebilix, Zizimir, Sandy,  Proumfs, Mr Patatos, Marius and Gigi, the Tortoises Tramps and all  Kassos which suffer in the biggest indifference. Featured Crew Balak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeanne Chartier Leya Sodo / Sandy / Les Proumpfs / Hello Kiki / Petit Prince / Edouard Mama / Ariel / Mei / Pimprenelle / Alice / Hard E.T. / Ondine Thierry Simon Dark Papy / Les Canards Jr. Guillaume Darnault Les Canards Jr. / Muldor / Les Proumpfs / Papy Fougasse / Monsieur Man / Les Daltonne / Pedro / Lapin du Métro / Edouard / Porkypute / Ptiripou / Rouge Roger / Yu Gi Uno / Vegueta / Le Marchand de sable / James Baptiste Lorber Froton / Wilson / Rose Roger Kevin Razy Charles Lee Full Cast & Crew Last Season Season 3 2016 | 16 Episodes Season 3 of Les Kassos premiered on March 17, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Les Kassos. You can help by rating TV shows you've seen. Facts Status  In Production Networks Certification  - Type  Scripted Original Language  French Runtime  2m Homepage   https://www.youtube.com/user/LesKassosCanal Genres Comedy Keywords social worker Content Score 93 Almost there... Top Contributors w 68 wremy 4 floofl TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}