{"link": "https://www.themoviedb.org/tv/42506?language=en", "title": "The Mystic Archives of Dantalian", "resume": "The Mystic Archives of Dantalian is a Japanese light novel series written by Gakuto Mikumo and illustrated by G-Yuusuke. The series started serialization in Kadokawa Shoten's light novel magazine The Sneaker on February 29, 2008. A manga adaptation by Chako Abeno started serialization in Kadokawa Shoten's shōnen manga magazine Shōnen Ace on March 26, 2010. Another manga adaptation by Monaco Sena started serialization in Kadokawa Shoten's seinen manga magazine Comp Ace on March 26, 2010. A 12-episode anime adaptation by GAINAX aired between July and October, 2011.", "rate": 77, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": ["Miyuki Sawashiro", "Daisuke Ono", "Kana Hanazawa", "Masayuki Katou", "Ami Koshimizu"], "character": ["Dalian", "Hugh Anthony Disward", "Hugh Anthony Disward", "Hal Kamhout", "Flamberge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42506   Expand The Mystic Archives of Dantalian   (2011) User Score Overview The Mystic Archives of Dantalian is a Japanese light novel series written by Gakuto Mikumo and illustrated by G-Yuusuke. The series started serialization in Kadokawa Shoten's light novel magazine The Sneaker on February 29, 2008. A manga adaptation by Chako Abeno started serialization in Kadokawa Shoten's shōnen manga magazine Shōnen Ace on March 26, 2010. Another manga adaptation by Monaco Sena started serialization in Kadokawa Shoten's seinen manga magazine Comp Ace on March 26, 2010. A 12-episode anime adaptation by GAINAX aired between July and October, 2011. Featured Crew Uemura Yutaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyuki Sawashiro Dalian Daisuke Ono Hugh Anthony Disward Kana Hanazawa Hugh Anthony Disward Masayuki Katou Hal Kamhout Ami Koshimizu Flamberge Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of The Mystic Archives of Dantalian premiered on July 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Mystic Archives of Dantalian. You can help by rating TV shows you've seen. Facts Original Name  ダンタリアンの書架 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 yoshizuka 3 Oriknox 3 Jenazad m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}