{"link": "https://www.themoviedb.org/tv/14656?language=en", "title": "Law of the Plainsman", "resume": "Law of the Plainsman is a Western television series starring Michael Ansara that aired on the NBC television network from October 1, 1959, until May 5, 1960. The character of Native American U.S. Marshal Sam Buckhart was introduced in two episodes of the popular ABC Western television series The Rifleman starring Chuck Connors as Lucas McCain.\nLaw of the Plainsman is distinctive and unique in that it was one of the few television programs that featured a Native American as the lead character, a bold move for U.S.network television at that time. Ansara had earlier appeared in the series Broken Arrow, having portrayed the Apache chief, Cochise. Ansara, however, was not Native American but of Syrian descent.\nAnsara played Sam Buckhart, an Apache Indian who saved the life of a U.S. Cavalry officer after an Indian ambush. When the officer died, he left Sam money that was used for an education at private schools and Harvard University. After school, he returned to New Mexico where he became a Deputy Marshal working for Marshal Andy Morrison. He lived in a boarding house run by Martha Commager. The only other continuing character was 8-year old Tess Logan, an orphan who had been rescued by Buckhart. Robert Harland, later of Target: The Corruptors! starred in seven episodes as Deputy Billy Lordan. Wayne Rogers, who went on to star in another Four Star western, Stagecoach West, and later, MAS*H, also played deputy Lordan in several episodes.", "rate": 0, "genre": ["Western"], "cast": ["Michael Ansara", "Robert Harland", "Dayton Lummis", "Gina Gillespie", "Nora Marlowe"], "character": ["Deputy U.S. Marshal Sam Buckhart", "Deputy Billy Lordan", "Marshal Andy Morrison", "Tess", "Martha Commager"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14656   Expand Law of the Plainsman   (1959) User Score Overview Law of the Plainsman is a Western television series starring Michael Ansara that aired on the NBC television network from October 1, 1959, until May 5, 1960. The character of Native American U.S. Marshal Sam Buckhart was introduced in two episodes of the popular ABC Western television series The Rifleman starring Chuck Connors as Lucas McCain. Law of the Plainsman is distinctive and unique in that it was one of the few television programs that featured a Native American as the lead character, a bold move for U.S.network television at that time. Ansara had earlier appeared in the series Broken Arrow, having portrayed the Apache chief, Cochise. Ansara, however, was not Native American but of Syrian descent. Ansara played Sam Buckhart, an Apache Indian who saved the life of a U.S. Cavalry officer after an Indian ambush. When the officer died, he left Sam money that was used for an education at private schools and Harvard University. After school, he returned to New Mexico where he became a Deputy Marshal working for Marshal Andy Morrison. He lived in a boarding house run by Martha Commager. The only other continuing character was 8-year old Tess Logan, an orphan who had been rescued by Buckhart. Robert Harland, later of Target: The Corruptors! starred in seven episodes as Deputy Billy Lordan. Wayne Rogers, who went on to star in another Four Star western, Stagecoach West, and later, M A S*H, also played deputy Lordan in several episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Ansara Deputy U.S. Marshal Sam Buckhart Robert Harland Deputy Billy Lordan Dayton Lummis Marshal Andy Morrison Gina Gillespie Tess Nora Marlowe Martha Commager Full Cast & Crew Last Season Season 1 1959 | 30 Episodes Season 1 of Law of the Plainsman premiered on October  1, 1959. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Law of the Plainsman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Keywords new mexico native american u.s. marshal wild west 19th century Content Score 86 Almost there... Top Contributors 16 Banana 2 lineker 1 t0by S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}