{"link": "https://www.themoviedb.org/tv/68598?language=en", "title": "Holiday Baking Championship", "resume": "The search to find the greatest holiday baker begins as amateur bakers enter the kitchen, where they show off their family traditions and superb baking skills. To survive the challenges from week to week, they must prove their abilities in front of our tough-love judges.", "rate": 80, "genre": ["Family", "Reality"], "cast": ["Bobby Deen", "Duff Goldman", "Nancy Fuller", "Lorraine Pascale", "Jason Smith"], "character": ["Himself - Host", "Himself - Judge & Pastry Chef", "Herself - Judge", "Herself - Judge", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68598   Expand Holiday Baking Championship   (2014) User Score  Play Trailer Overview The search to find the greatest holiday baker begins as amateur bakers enter the kitchen, where they show off their family traditions and superb baking skills. To survive the challenges from week to week, they must prove their abilities in front of our tough-love judges. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Bobby Deen Himself - Host Duff Goldman Himself - Judge & Pastry Chef Nancy Fuller Herself - Judge Lorraine Pascale Herself - Judge Jason Smith Himself Full Cast & Crew Last Season Season 3 2016 | 8 Episodes View All Seasons Social Reviews  1 Discussions  0 A review by lmao7  10.0 Written by  lmao7  on February 15, 2017 new holiday tradition! it's just so festive to watch and you get Christmas feels. very cheerful competition, just can't help but root for someone to win. Read All Reviews Media Most Popular Videos  3 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Holiday Baking Championship. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.foodnetwork.com/shows/holiday-baking-championship Genres Family Reality Keywords holiday thanksgiving food dessert baking christmas cooking show cooking competition Content Score 93 Almost there... Top Contributors 111 lmao7 m 7 melianasaputri 5 Elizabeth Jennings s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}