{"link": "https://www.themoviedb.org/tv/2040?language=en", "title": "Spitting Image", "resume": "Spitting Image is an award winning British satirical puppet show, created by Peter Fluck, Roger Law and Martin Lambie-Nairn. The series was produced by Spitting Image Productions for Central Independent Television over 18 series which aired on the ITV from 1984 to 1996. The series was nominated and won numerous awards during its run including 10 BAFTA Awards, including one for editing in 1989, and even won two Emmy Awards in 1985 and 1986 in the Popular Arts Category.\nThe series featured puppet caricatures of celebrities famous during the 1980s and 1990s, including British Prime Minister Margaret Thatcher and fellow Tory politicians, American president Ronald Reagan, and the British Royal Family. The Series was the first to caricature the Queen mother.\nThe series was axed in 1996, after viewing figures declined. ITV had plans for a new series in 2006, but these were scrapped after a dispute over Ant & Dec puppets used to host the reviews \"Best Ever Spitting Image\", which were created against Roger Law's wishes.", "rate": 79, "genre": ["Comedy"], "cast": ["Chris Barrie", "Jon Glover", "Hugh Dennis", "Martin P. Robinson", "Kate Robbins"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2040   Expand Spitting Image   (1984) User Score Overview Spitting Image is an award winning British satirical puppet show, created by Peter Fluck, Roger Law and Martin Lambie-Nairn. The series was produced by Spitting Image Productions for Central Independent Television over 18 series which aired on the ITV from 1984 to 1996. The series was nominated and won numerous awards during its run including 10 BAFTA Awards, including one for editing in 1989, and even won two Emmy Awards in 1985 and 1986 in the Popular Arts Category. The series featured puppet caricatures of celebrities famous during the 1980s and 1990s, including British Prime Minister Margaret Thatcher and fellow Tory politicians, American president Ronald Reagan, and the British Royal Family. The Series was the first to caricature the Queen mother. The series was axed in 1996, after viewing figures declined. ITV had plans for a new series in 2006, but these were scrapped after a dispute over Ant & Dec puppets used to host the reviews \"Best Ever Spitting Image\", which were created against Roger Law's wishes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Barrie Jon Glover Hugh Dennis Martin P. Robinson Kate Robbins Full Cast & Crew Last Season Season 12 1996 | 7 Episodes Season 12 of Spitting Image premiered on January 14, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1987-03-09 French & Saunders 7.4    1978-02-24 Going Straight 7.3    1994-07-04 Room 101 5.9    1986-05-01 Bread 7.4    2005-02-21 Masterchef Goes Large 4.8    1987-09-26 ChuckleVision 6.3    1993-09-21 The Smell of Reeves and Mortimer 7.7    1989-11-08 Byker Grove 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords satire sketch comedy british humour Content Score 86 Almost there... Top Contributors O 5 Ozbourne TB 2 TMDb Bot a 1 arhasy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}