{"link": "https://www.themoviedb.org/tv/2891?language=en", "title": "What Not to Wear", "resume": "What Not to Wear was an American makeover reality television show based on a British show of the same name. The program premiered in 2003 and aired on TLC in the United States and Canada. It also aired on Discovery Travel & Living Europe, on People+Arts in Spain as ¡No te lo pongas!, and in Portugal and Brazil as Esquadrão da Moda. Foreign versions of show air in Mexico, Colombia, Argentina and Italy. What Not to Wear was hosted by Stacy London and Clinton Kelly. On March 6, 2013, TLC announced that the tenth season of What Not to Wear would be the last.", "rate": 50, "genre": [], "cast": ["Stacy London", "Clinton Kelly", "Carmindy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2891   Expand What Not to Wear   (2003) User Score Overview What Not to Wear was an American makeover reality television show based on a British show of the same name. The program premiered in 2003 and aired on TLC in the United States and Canada. It also aired on Discovery Travel & Living Europe, on People+Arts in Spain as ¡No te lo pongas!, and in Portugal and Brazil as Esquadrão da Moda. Foreign versions of show air in Mexico, Colombia, Argentina and Italy. What Not to Wear was hosted by Stacy London and Clinton Kelly. On March 6, 2013, TLC announced that the tenth season of What Not to Wear would be the last. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stacy London Clinton Kelly Carmindy Full Cast & Crew Last Season Season 10 2013 | 17 Episodes Season 10 of What Not to Wear premiered on January  3, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M What were your favorite parts of the show? Open 1 by  marshjes Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2010-12-29 Extreme Couponing 3.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 52m Homepage   http://www.tlc.discovery.com/fansites/whatnottowear/whatnottowear.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors z 5 zurman1 c 3 coyote69  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}