{"link": "https://www.themoviedb.org/tv/32608?language=en", "title": "Ancient Aliens", "resume": "Did intelligent beings from outer space visit Earth thousands of years ago? From the age of the dinosaurs to ancient Egypt, from early cave drawings to continued mass sightings in the US, each episode gives historic depth to the questions, speculations, provocative controversies, first-hand accounts and grounded theories surrounding this age old debate.", "rate": 63, "genre": ["Documentary", "Mystery"], "cast": ["Giorgio A. Tsoukalos", "Robert Clotworthy"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32608   Expand Ancient Aliens   (2010) User Score  Play Trailer Overview Did intelligent beings from outer space visit Earth thousands of years ago? From the age of the dinosaurs to ancient Egypt, from early cave drawings to continued mass sightings in the US, each episode gives historic depth to the questions, speculations, provocative controversies, first-hand accounts and grounded theories surrounding this age old debate. Featured Crew Kevin Burns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  7 Images Backdrops  6 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Giorgio A. Tsoukalos Robert Clotworthy Narrator Full Cast & Crew Current Season Season 13 2018 | 6 Episodes Season 13 of Ancient Aliens premiered on April 27, 2018. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply There are no discussions for Ancient Aliens. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  7 Recommendations   2007-06-06 Destination Truth 7.6    2014-02-28 Hangar 1: The UFO Files 6.6    1993-04-21 Walker, Texas Ranger 5.0    2012-03-27 NASA's Unexplained Files 7.7    2015-01-17 Monsters and Mysteries in America 5.8    Richard Hammond's Journey to ... 7.7    2011-06-27 Doomsday Preppers 4.5    1999-09-06 Loose Women 2.5  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  120m, 60m Homepage   http://www.history.com/shows/ancient-aliens Genres Documentary Mystery Keywords history ancient astronaut ancient aliens theory ufo conspiracy paranormal show Content Score 71 Just a little bit more... Top Contributors 53 waaw S 24 Samara 23 Banana 22 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}