{"link": "https://www.themoviedb.org/tv/34113?language=en", "title": "Shrine of the Morning Mist", "resume": "Shrine of the Morning Mist is a Japanese manga written and illustrated by Hiroki Ugawa. The manga was serialized in Shōnen Gahōsha's Young King Ours. The manga is licensed in North America by Tokyopop and in Australia and New Zealand by Madman Entertainment. The manga was adapted into an anime series, directed by Yuji Moriyama. The anime was licensed in North America by Media Blasters.\nIt tells the story of Yuzu Hieda, a high school freshman and one of three sisters, all of whom are miko at the local Shinto shrine. When her childhood love returns, it is discovered that dark gods have a great interest in him and Yuzu is recruited to gather fellow female students into a \"Miko Council\" to fight off a full-scale mystic assault. The priestesses have talismans which focus their powers and are used when attacking the dark kami.", "rate": 0, "genre": ["Animation"], "cast": ["Megumi Hayashibara", "Yoko Sasaki", "Nanae Katō", "Kaoru Morota", "Takahiro Mizushima"], "character": ["Kurako Hieda", "Yukie Uranami", "Chika Yurikasa", "Seiko Rikiishi", "Tadahiro Amatsu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34113   Expand Shrine of the Morning Mist   (2002) User Score Overview Shrine of the Morning Mist is a Japanese manga written and illustrated by Hiroki Ugawa. The manga was serialized in Shōnen Gahōsha's Young King Ours. The manga is licensed in North America by Tokyopop and in Australia and New Zealand by Madman Entertainment. The manga was adapted into an anime series, directed by Yuji Moriyama. The anime was licensed in North America by Media Blasters. It tells the story of Yuzu Hieda, a high school freshman and one of three sisters, all of whom are miko at the local Shinto shrine. When her childhood love returns, it is discovered that dark gods have a great interest in him and Yuzu is recruited to gather fellow female students into a \"Miko Council\" to fight off a full-scale mystic assault. The priestesses have talismans which focus their powers and are used when attacking the dark kami. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Hayashibara Kurako Hieda Yoko Sasaki Yukie Uranami Nanae Katō Chika Yurikasa Kaoru Morota Seiko Rikiishi Takahiro Mizushima Tadahiro Amatsu Full Cast & Crew Last Season Season 1 2002 | 26 Episodes Season 1 of Shrine of the Morning Mist premiered on July  4, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Shrine of the Morning Mist. You can help by rating TV shows you've seen. Facts Original Name  朝霧の巫女 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  15m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 10 BrerFox 4 seboseboss 3 Oriknox m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}