{"link": "https://www.themoviedb.org/tv/74831?language=en", "title": "Judge vs. Judge", "resume": "Judge Lee Jung-Joo presides at the Seoul District Court. She sometimes swears at shameless defendants with unspeakable words. Judge Sa Ui-Hyun is assigned to the judgement bench with Judge Lee Jung-Joo. Sa Ui-Hyun is well known for his excellent use of the law and his conscience to reach verdicts.\nLee Jung-Joo fights against a huge power who framed her older brother for murder and killed him.", "rate": 51, "genre": ["Drama"], "cast": ["Yeon Woo-jin", "Park Eun Bin", "Dong Ha", "Na Hae-ryung", "Lee Deok-hwa "], "character": ["Sa Ui-Hyun", "Lee Jung-Joo", "Do Han-Joon", "Jin Se-Ra", "Do Jin-Myung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74831   Expand Judge vs. Judge   (2017) User Score Overview Judge Lee Jung-Joo presides at the Seoul District Court. She sometimes swears at shameless defendants with unspeakable words. Judge Sa Ui-Hyun is assigned to the judgement bench with Judge Lee Jung-Joo. Sa Ui-Hyun is well known for his excellent use of the law and his conscience to reach verdicts. Lee Jung-Joo fights against a huge power who framed her older brother for murder and killed him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeon Woo-jin Sa Ui-Hyun Park Eun Bin Lee Jung-Joo Dong Ha Do Han-Joon Na Hae-ryung Jin Se-Ra Lee Deok-hwa  Do Jin-Myung Full Cast & Crew Current Season Season 1 2017 | 32 Episodes Season 1 of Judge vs. Judge premiered on November 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Judge vs. Judge. You can help by rating TV shows you've seen. Facts Original Name  이판사판 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://programs.sbs.co.kr/drama/judgevsjudge Genres Drama Keywords legal Content Score 86 Almost there... Top Contributors M 57 Maria180493 5 Elizabeth Jennings 2 sansalayne R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}