{"link": "https://www.themoviedb.org/tv/3035?language=en", "title": "He-Man and the Masters of the Universe", "resume": "He-Man and the Masters of the Universe is an American animated television series. Developed for television by Michael Halperin, who created the original series, it was animated by Mike Young Productions. It served as an update of the 1980s series of the same name, produced to coincide with Mattel's revival of the Masters of the Universe franchise eleven years after its previous attempt. The series made its premiere on Cartoon Network's Toonami on August 16, 2002.\nUnlike the previous He-Man series, set on the futuristic planet of Primus, this version sought to return to the roots of the storyline and provide broader explorations never reached in the first series, including origins for each character, and some first time animated debuts of familiar toyline faces. The series also brought back several writers from the original series, such as Larry DiTillio.\nThe remake is noted for the many similarities it shares with the original. For example, it has an homage intro to the 1980s version's intro speech but in this version, Prince Adam is interrupted by an explosion and invasion by Skeletor and his henchmen. Prince Adam transforms into He-Man when he says \"By the power of Grayskull... I have the power!\". It also features \"scene change\" sequences, but only the one involving the Sword of Power was taken from the Filmation series; all the others were created for this series, and the sequences occur less frequently than on the previous series.", "rate": 67, "genre": ["Action", "Adventure", "Animation"], "cast": ["Brian Dobson", "Lisa Ann Beley", "Michael Donovan", "Kathleen Barr", "Garry Chalk"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3035   Expand He-Man and the Masters of the Universe   (2002) User Score Overview He-Man and the Masters of the Universe is an American animated television series. Developed for television by Michael Halperin, who created the original series, it was animated by Mike Young Productions. It served as an update of the 1980s series of the same name, produced to coincide with Mattel's revival of the Masters of the Universe franchise eleven years after its previous attempt. The series made its premiere on Cartoon Network's Toonami on August 16, 2002. Unlike the previous He-Man series, set on the futuristic planet of Primus, this version sought to return to the roots of the storyline and provide broader explorations never reached in the first series, including origins for each character, and some first time animated debuts of familiar toyline faces. The series also brought back several writers from the original series, such as Larry DiTillio. The remake is noted for the many similarities it shares with the original. For example, it has an homage intro to the 1980s version's intro speech but in this version, Prince Adam is interrupted by an explosion and invasion by Skeletor and his henchmen. Prince Adam transforms into He-Man when he says \"By the power of Grayskull... I have the power!\". It also features \"scene change\" sequences, but only the one involving the Sword of Power was taken from the Filmation series; all the others were created for this series, and the sequences occur less frequently than on the previous series. Featured Crew Donald F. Glut Creator Mattel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Dobson Lisa Ann Beley Michael Donovan Kathleen Barr Garry Chalk Full Cast & Crew Last Season (2002) season 2 2003 | 13 Episodes Season 2 of He-Man and the Masters of the Universe premiered on October 18, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2011-07-29 ThunderCats 6.4    1983-09-05 He-Man and the Masters of the Universe 7.1    1991-08-11 Doug 7.0    1991-09-08 Darkwing Duck 7.3    1994-10-24 Gargoyles 8.0    1997-07-07 Johnny Bravo 6.6    1983-09-10 Inspector Gadget 6.6    1995-01-29 Hercules: The Legendary Journeys 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords sword and planet Content Score 93 Almost there... Top Contributors C 6 CroCop 5 Marr 🇳🇱 3 danimados a 2 ajaconis83  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}