{"link": "https://www.themoviedb.org/tv/39322?language=en", "title": "Kavak Yelleri", "resume": "Kavak Yelleri is a Turkish youth drama television series produced by TIMS Productions. It was broadcast on Kanal D from 2007 to 2011.\nThe series follows a group of friends growing up in the small town of Urla and afterwards in İstanbul when they move there. The main characters since the start are Aslı Zeybek, Deniz Akça, Mine Seven and Efe Kaygısız. Su and Güven Karakuş were introduced in later episodes.\nThe theme song of the series is 'Hele Bi Gel' by the band Pinhani.", "rate": 40, "genre": ["Comedy", "Drama", "Family"], "cast": ["Pelin Karahan", "Daghan Kulegec", "Ibrahim Kendirci", "Aslı Enver", "Sarp Apak"], "character": ["Aslı Zeybek", "Efe Kaygısız", "Deniz Akça", "Mine Ergun", "Güven Karakuş"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39322   Expand Kavak Yelleri   (2007) User Score Overview Kavak Yelleri is a Turkish youth drama television series produced by TIMS Productions. It was broadcast on Kanal D from 2007 to 2011. The series follows a group of friends growing up in the small town of Urla and afterwards in İstanbul when they move there. The main characters since the start are Aslı Zeybek, Deniz Akça, Mine Seven and Efe Kaygısız. Su and Güven Karakuş were introduced in later episodes. The theme song of the series is 'Hele Bi Gel' by the band Pinhani. Featured Crew Timur Savcı Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pelin Karahan Aslı Zeybek Daghan Kulegec Efe Kaygısız Ibrahim Kendirci Deniz Akça Aslı Enver Mine Ergun Sarp Apak Güven Karakuş Full Cast & Crew Last Season Season 5 2011 | 10 Episodes Season 5 of Kavak Yelleri premiered on May 31, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kavak Yelleri. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  100m Homepage   http://www.kavakyelleri.tv/ Genres Comedy Drama Family Keywords based on tv series youth Content Score 93 Almost there... Top Contributors 81 purplelammashta b 10 bluwy s 6 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}