{"link": "https://www.themoviedb.org/tv/1269?language=en", "title": "Spider-Man and His Amazing Friends", "resume": "Spider-Man and His Amazing Friends is an American animated television series produced by Marvel Productions starring established Marvel Comics characters Spider-Man and Iceman and an original character, Firestar. As a trio called the Spider-Friends, they fought against various villains.", "rate": 65, "genre": ["Action", "Adventure", "Animation", "Family", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1269   Expand Spider-Man and His Amazing Friends   (1981) User Score Overview Spider-Man and His Amazing Friends is an American animated television series produced by Marvel Productions starring established Marvel Comics characters Spider-Man and Iceman and an original character, Firestar. As a trio called the Spider-Friends, they fought against various villains. Featured Crew Stan Lee Creator Steve Ditko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1983 | 8 Episodes Season 3 of Spider-Man and His Amazing Friends premiered on September 17, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2003-07-11 Spider-Man: The New Animated Series 6.5    1979-09-22 Spider-Woman 6.7    1999-10-02 Spider-Man Unlimited 6.5    1967-09-09 Spider-Man 7.9    1982-09-18 The Incredible Hulk 8.2    Silver Surfer: The Animated Series 7.7    1991-09-14 Captain N and the New Super Mario World 4.7    1977-02-10 The New Adventures of Batman 6.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Action & Adventure Animation Family Sci-Fi & Fantasy Keywords superhero based on comic iceman Content Score 64 We're so close, yet so far. Top Contributors 15 Banana 13 Dragonfly17 z 5 zurman1 4 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}