{"link": "https://www.themoviedb.org/tv/62997?language=en", "title": "Dr. Jeff: Rocky Mountain Vet", "resume": "There's no such thing as \"a regular day\" at Denver's Planned Pethood Plus veterinary clinic. For 80,000-plus clients and their pets, the clinic and its maverick ER vet Dr. Jeff Young represent one last hope and possibly the difference between life and death.", "rate": 38, "genre": ["Reality"], "cast": ["Jeff Young"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62997   Expand Dr. Jeff: Rocky Mountain Vet   (2015) User Score  Play Trailer Overview There's no such thing as \"a regular day\" at Denver's Planned Pethood Plus veterinary clinic. For 80,000-plus clients and their pets, the clinic and its maverick ER vet Dr. Jeff Young represent one last hope and possibly the difference between life and death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Young Himself Full Cast & Crew Last Season Season 3 2017 | 2 Episodes Season 3 of Dr. Jeff: Rocky Mountain Vet premiered on February  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dr. Jeff: Rocky Mountain Vet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.animalplanet.com/tv-shows/dr-jeff-rocky-mountain-vet/ Genres Reality Keywords veterinarian animal denver colorado veterinary clinic helping animals Content Score 64 We're so close, yet so far. Top Contributors 26 Elizabeth Jennings LC 4 Legit Corporation 4 tigru89 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}