{"link": "https://www.themoviedb.org/tv/66786?language=en", "title": "Timeless", "resume": "A mysterious criminal steals a secret state-of-the-art time machine, intent on destroying America as we know it by changing the past. Our only hope is an unexpected team: a scientist, a soldier and a history professor, who must use the machine's prototype to travel back in time to critical events. While they must make every effort not to affect the past themselves, they must also stay one step ahead of this dangerous fugitive. But can this handpicked team uncover the mystery behind it all and end his destruction before it's too late?", "rate": 70, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Abigail Spencer", "Matt Lanter", "Malcolm Barrett", "Goran Visnjic", "Claudia Doumit"], "character": ["Lucy Preston", "Wyatt Logan", "Rufus Carlin", "Garcia Flynn", "Jiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66786   Expand Timeless   (2016) User Score  Play Trailer Overview A mysterious criminal steals a secret state-of-the-art time machine, intent on destroying America as we know it by changing the past. Our only hope is an unexpected team: a scientist, a soldier and a history professor, who must use the machine's prototype to travel back in time to critical events. While they must make every effort not to affect the past themselves, they must also stay one step ahead of this dangerous fugitive. But can this handpicked team uncover the mystery behind it all and end his destruction before it's too late? Featured Crew Eric Kripke Creator Shawn Ryan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  18 Content Issues  1 Images Backdrops  12 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Abigail Spencer Lucy Preston Matt Lanter Wyatt Logan Malcolm Barrett Rufus Carlin Goran Visnjic Garcia Flynn Claudia Doumit Jiya Full Cast & Crew Current Season Season 2 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  19 Subject Status Replies Last Reply This is ridiculous Open 4 by  GForce59 El Ministerio del Tiempo Open 2 by  GForce59 p renewed? Open 6 by  GForce59 Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  11 Recommendations   2016-10-05 Frequency 7.3    2016-10-17 Travelers 7.5    2016-01-14 Colony 6.8    2016-09-27 Aftermath 6.1    2016-09-23 Van Helsing 5.6    2017-07-12 Salvation 6.5    2016-01-13 Second Chance 6.5    2016-09-23 MacGyver 5.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.nbc.com/timeless Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords time travel time machine history Content Score 100 Yes! Looking good! Top Contributors p 48 plumpro 27 Elizabeth Jennings 20 Imzadi 13 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}