{"link": "https://www.themoviedb.org/tv/65873?language=en", "title": "Mis adorables vecinos", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 100, "genre": ["Comedy"], "cast": ["Francis Lorenzo", "Paz Padilla", "Miriam Díaz-Aroca", "Juanjo Cucalón", "Daniela Costa"], "character": ["Ernesto Sandoval", "Dolores \"Loli\" Mingo", "Claudia Valladares Roig", "Mariano Sánchez", "Aitana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65873   Expand Mis adorables vecinos   (2004) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Pablo Barrera Creator Manuel Ríos San Martín Creator Manuel Valdivia Creator Nacho Cabana Creator César Vidal Creator Chus Vallejo Creator Guillermo Fernández Groizard Creator Sandra Gallego Creator César Rodríguez Blanco Creator Caridad Fernández Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Francis Lorenzo Ernesto Sandoval Paz Padilla Dolores \"Loli\" Mingo Miriam Díaz-Aroca Claudia Valladares Roig Juanjo Cucalón Mariano Sánchez Daniela Costa Aitana Full Cast & Crew Last Season Season 4 2006 | 18 Episodes Season 4 of Mis adorables vecinos premiered on January  8, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mis adorables vecinos. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  70m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 71 United600 z 12 zurman1 5 NEOhidra p 4 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}