{"link": "https://www.themoviedb.org/tv/41322?language=en", "title": "Pandemic", "resume": "The bird flu virus spreads through Los Angeles as a doctor from the CDC races to find a vaccine.\nPandemic is a 2007 Hallmark Channel original mini-series with an ensemble cast. It premiered on Saturday, May 26, 2007 at 8:00 PM as part of Hallmark Channel's \"Uncharted Adventures\" weekend. It is now available on DVD through Hallmark Entertainment.", "rate": 48, "genre": ["Drama"], "cast": ["Tiffani Thiessen", "French Stewart", "Faye Dunaway", "Eric Roberts", "Vincent Spano"], "character": ["Dr. Kayla Martin", "Dr. Carl Ratner", "Governor Lillian Schaefer", "Mayor Richard Dellasandro", "Troy Whitlock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41322   Expand Pandemic   (2007) User Score  Play Trailer Overview The bird flu virus spreads through Los Angeles as a doctor from the CDC races to find a vaccine. Pandemic is a 2007 Hallmark Channel original mini-series with an ensemble cast. It premiered on Saturday, May 26, 2007 at 8:00 PM as part of Hallmark Channel's \"Uncharted Adventures\" weekend. It is now available on DVD through Hallmark Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tiffani Thiessen Dr. Kayla Martin French Stewart Dr. Carl Ratner Faye Dunaway Governor Lillian Schaefer Eric Roberts Mayor Richard Dellasandro Vincent Spano Troy Whitlock Full Cast & Crew Last Season season 1 2007 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  7 Recommendations   1985-03-07 Miss Marple: A Pocketful of Rye 6.8    1987-01-25 Miss Marple: At Bertram's Hotel 6.7    1987-02-08 Miss Marple: Nemesis 7.5    1987-01-11 Miss Marple: Sleeping Murder 7.0    2009-07-26 The Storm 4.0    2001-09-26 Star Trek: Enterprise 7.4    1995-01-16 Star Trek: Voyager 7.8  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords quarantine miniseries pandemic Content Score 93 Almost there... Top Contributors TB 61 TMDb Bot R 6 Rebecca 2 Deano A 1 Amoebiuss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}