{"link": "https://www.themoviedb.org/tv/42154?language=en", "title": "World War II In HD Colour", "resume": "World War II In HD Colour is a 13-episode television documentary miniseries recounting the events of World War II narrated by Robert Powell. The show covers the Western Front, Eastern Front, and the Pacific War. It is on syndication in America on the Military Channel. This series is in full color, combining both original and colorized footage.", "rate": 87, "genre": ["Documentary", "Reality", "War", "Politics"], "cast": ["Adolf Hitler", "Robert Powell", "Winston Churchill", "Franklin D. Roosevelt", "Joseph Stalin"], "character": ["Himself", "Narrator", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42154   Expand World War II In HD Colour   (2009) User Score Overview World War II In HD Colour is a 13-episode television documentary miniseries recounting the events of World War II narrated by Robert Powell. The show covers the Western Front, Eastern Front, and the Pacific War. It is on syndication in America on the Military Channel. This series is in full color, combining both original and colorized footage. Featured Crew Jonathan Martin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adolf Hitler Himself Robert Powell Narrator Winston Churchill Himself Franklin D. Roosevelt Himself Joseph Stalin Himself Full Cast & Crew Last Season Season 5 2013 | 2 Episodes Season 5 of World War II In HD Colour premiered on January 29, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply n \"The Lancaster was the finest heavy bomber of the war\" Ep 7 Open 0 by nanonta\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2010-09-09 Nikita 7.0    2003-08-05 The O.C. 6.9    2007-09-19 Gossip Girl 6.3    2014-03-09 Cosmos: A Spacetime Odyssey 8.2  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  50m Homepage   http://worldmediarights.com/production/world-war-two-in-hd-colour/ Genres Documentary Reality War & Politics Keywords world war ii history miniseries Content Score 100 Yes! Looking good! Top Contributors 74 Apollo 9 MadLane d 7 dune2000 5 abernaolao  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}