{"link": "https://www.themoviedb.org/tv/79864?language=en", "title": "Joe Pera Talks with You", "resume": "A teacher in Michigan's Upper Peninsula explores subject matters such as pancakes, blueberries, eggs, toast, sausage, bacon, English muffins, coffee, orange juice, maple syrup, waffles, cornbread, and strawberries.", "rate": 100, "genre": ["Comedy"], "cast": ["Joe Pera", "Sophia Battinus", "Jo Scott", "Robert Swafford", "Conner O'Malley"], "character": ["Joe Pera", "Kelsey Melsky", "Sue Melsky", "Groomsman #1", "Mike Melsky"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79864   Expand Joe Pera Talks with You   (2018) User Score  Play Trailer Overview A teacher in Michigan's Upper Peninsula explores subject matters such as pancakes, blueberries, eggs, toast, sausage, bacon, English muffins, coffee, orange juice, maple syrup, waffles, cornbread, and strawberries. Featured Crew Joe Pera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  5 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Pera Joe Pera Sophia Battinus Kelsey Melsky Jo Scott Sue Melsky Robert Swafford Groomsman #1 Conner O'Malley Mike Melsky Full Cast & Crew Current Season Season 1 2018 | 9 Episodes Season 1 of Joe Pera Talks with You premiered on May 20, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  6 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Joe Pera Talks with You. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.adultswim.com/videos/joe-pera-talks-with-you/ Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors g 56 gfrcsd 10 tigru89 7 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}