{"link": "https://www.themoviedb.org/tv/77516?language=en", "title": "The Lawyer", "resume": "Frank Nordling is a young and exceptionally promising defense lawyer. When Frank learns the truth behind his parents' death, his whole world unravels. As children, Frank and his sister Sara witnessed their parents die in an explosion caused by a car bomb. As Frank finds out, they were murdered by one of the leaders in Copenhagen's criminal underworld, Thomas Waldman. In order to avenge his parents Frank must infiltrate Waldman's organization and become his personal lawyer and trusted confidant. To avoid putting those close to him in danger, Frank has to keep up appearances and play the game. But can he handle it? Is it worth the price? And who's really tricking whom?", "rate": 0, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Alexander Karim", "Malin Buska", "Thomas Bo Larsen", "Nicolaj Kopernikus", "Sara Hjort Ditlevsen"], "character": ["Frank Nordling", "Sara Khalil", "Thomas Waldman", "Svend-Erik Wisén", "Therese Waldman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77516   Expand The Lawyer   (2018) User Score Overview Frank Nordling is a young and exceptionally promising defense lawyer. When Frank learns the truth behind his parents' death, his whole world unravels. As children, Frank and his sister Sara witnessed their parents die in an explosion caused by a car bomb. As Frank finds out, they were murdered by one of the leaders in Copenhagen's criminal underworld, Thomas Waldman. In order to avenge his parents Frank must infiltrate Waldman's organization and become his personal lawyer and trusted confidant. To avoid putting those close to him in danger, Frank has to keep up appearances and play the game. But can he handle it? Is it worth the price? And who's really tricking whom? Featured Crew David Berron Creator Geir Henning Hopland Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Karim Frank Nordling Malin Buska Sara Khalil Thomas Bo Larsen Thomas Waldman Nicolaj Kopernikus Svend-Erik Wisén Sara Hjort Ditlevsen Therese Waldman Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of The Lawyer premiered on February 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Lawyer. You can help by rating TV shows you've seen. Facts Original Name  Advokaten Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  50m Homepage  - Genres Crime Drama Mystery Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors C 25 CyberScream F 5 FCIK D 4 Destr0y 3 Eline TV  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}