{"link": "https://www.themoviedb.org/tv/39269?language=en", "title": "Scandal", "resume": "Everyone has secrets and Olivia Pope has dedicated her life to protecting and defending the public images of the elite by keeping those secrets under wraps. Pope and her team are at the top of their game when it comes to getting the job done for their clients, but it becomes apparent that these \"gladiators in suits,\" who specialize in fixing the lives of other people, have trouble fixing those closest at hand -- their own.", "rate": 67, "genre": ["Drama"], "cast": ["Kerry Washington", "Darby Stanchfield", "Tony Goldwyn", "Bellamy Young", "Jeff Perry"], "character": ["Olivia Pope", "Abby Whelan", "President Fitzgerald Grant", "Mellie Grant", "Cyrus Beene"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39269   Expand Scandal   (2012) User Score  Play Trailer Overview Everyone has secrets and Olivia Pope has dedicated her life to protecting and defending the public images of the elite by keeping those secrets under wraps. Pope and her team are at the top of their game when it comes to getting the job done for their clients, but it becomes apparent that these \"gladiators in suits,\" who specialize in fixing the lives of other people, have trouble fixing those closest at hand -- their own. Featured Crew Shonda Rhimes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  36 Content Issues  2 Images Backdrops  14 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kerry Washington Olivia Pope Darby Stanchfield Abby Whelan Tony Goldwyn President Fitzgerald Grant Bellamy Young Mellie Grant Jeff Perry Cyrus Beene Full Cast & Crew Current Season Season 7 2017 | 18 Episodes Season 7 of Scandal premiered on October  4, 2017. View All Seasons Social Reviews  0 Discussions  38 Subject Status Replies Last Reply Official - ABC and Shonda Rhimes agree Season 7 will be the final season Open 17 by  Poetist \"15 things about Scandal that make no sense\" Open 1 by  Sideshow Bob e Miles Bennett Dyson Open 18 by  danithang Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  13 Recommendations   2014-09-25 How to Get Away with Murder 7.4    2015-09-27 Quantico 5.9    2014-09-21 Madam Secretary 6.4    2013-01-30 The Americans 7.7    2009-09-22 The Good Wife 7.2    2011-09-21 Revenge 6.9    2012-08-13 Major Crimes 6.7    2009-10-23 White Collar 7.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.abc.go.com/shows/scandal Genres Drama Keywords washington d.c. white house politics fixer Content Score 100 Yes! Looking good! Top Contributors 43 lineker 39 Banana 37 niqo19 22 Gabriel W. Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}