{"link": "https://www.themoviedb.org/tv/4130?language=en", "title": "The Detectives", "resume": "The absurd adventures of two defective detectives, who - despite unbelievable incompetence - somehow manage to solve their cases (or be nearby when the cases are solved) and retain their jobs.", "rate": 71, "genre": ["Comedy"], "cast": ["Robert Powell", "George Sewell", "Jasper Carrott"], "character": ["Dave Briggs", "Superintendent Cottam", "Bob Louis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4130   Expand The Detectives   (1993) User Score Overview The absurd adventures of two defective detectives, who - despite unbelievable incompetence - somehow manage to solve their cases (or be nearby when the cases are solved) and retain their jobs. Featured Crew Jasper Carrott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Powell Dave Briggs George Sewell Superintendent Cottam Jasper Carrott Bob Louis Full Cast & Crew Last Season Season 5 1997 | 6 Episodes Season 5 of The Detectives premiered on January 14, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Detectives. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1977-04-12 Citizen Smith 7.6    1984-01-29 Ever Decreasing Circles 6.5    1986-09-01 Brush Strokes 7.8    1983-09-22 Just Good Friends 6.4    1974-09-02 Rising Damp 7.8    1986-01-14 Boon 4.8    1993-09-21 The Smell of Reeves and Mortimer 7.7    1981-12-24 The Kenny Everett Television Show 7.0  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://bbc.co.uk/comedy/thedetectives/ Genres Comedy Keywords spoof police detective spin off sitcom british humour Content Score 64 We're so close, yet so far. Top Contributors N 34 Notamymerrick 26 Banana 5 kcdh R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}