{"link": "https://www.themoviedb.org/tv/919?language=en", "title": "Charlie Rose", "resume": "Charlie Rose is an American television interview show, with Charlie Rose as executive producer, executive editor, and host. The show is syndicated on PBS and is owned by Charlie Rose, LLC. Rose interviews thinkers, writers, politicians, athletes, entertainers, businesspersons, leaders, scientists, and other newsmakers.\nThe show premiered on September 30, 1991. It is presented by WNET, where it first aired as a local program.\nFunding for the show is primarily provided by donations from various corporations and charitable foundations. The show has been criticized for not disclosing the list of donors even if the show is considered \"public\" broadcasting.\nIn 2007, the video archive of past interviews was added to the website for free viewing. In a partnership with Google, nearly 4000 hours of video was added to Google Video including complete hour-long episodes as they originally aired. The videos are now unavailable after Google Video shut down.", "rate": 85, "genre": ["Talk"], "cast": ["Charlie Rose"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 919   Expand Charlie Rose   (1991) User Score Overview Charlie Rose is an American television interview show, with Charlie Rose as executive producer, executive editor, and host. The show is syndicated on PBS and is owned by Charlie Rose, LLC. Rose interviews thinkers, writers, politicians, athletes, entertainers, businesspersons, leaders, scientists, and other newsmakers. The show premiered on September 30, 1991. It is presented by WNET, where it first aired as a local program. Funding for the show is primarily provided by donations from various corporations and charitable foundations. The show has been criticized for not disclosing the list of donors even if the show is considered \"public\" broadcasting. In 2007, the video archive of past interviews was added to the website for free viewing. In a partnership with Google, nearly 4000 hours of video was added to Google Video including complete hour-long episodes as they originally aired. The videos are now unavailable after Google Video shut down. Featured Crew Charlie Rose Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Rose Full Cast & Crew Last Season Season 18 2010 | 5 Episodes Season 18 of Charlie Rose premiered on January  1, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Charlie Rose. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 56m Homepage   http://www.charlierose.com/home Genres Talk Keywords current affairs Content Score 71 Just a little bit more... Top Contributors 6 amian123 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}