{"link": "https://www.themoviedb.org/tv/61918?language=en", "title": "Gossip Girl: Acapulco", "resume": "Sofía López-Haro returns unexpectedly to Acapulco after leaving mysteriously the year before. Her best friend, Bárbara Fuenmayor, angry that she has always been forced to live in Sofía's shadow, is not happy with her return, especially after discovering that before leaving Acapulco, Sofía had slept with her boyfriend, Nico.", "rate": 80, "genre": ["Drama"], "cast": ["Sofía Sisniega", "Okairy Giner", "Diego Amozurrutia", "Jon-Michael Ecker", "Macarena Achaga"], "character": ["Sofía López-Haro", "Bárbara Fuenmayor", "Daniel Parra", "Nicolás 'Nico' de la Vega", "Jenny Parra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61918   Expand Gossip Girl: Acapulco   (2013) User Score Overview Sofía López-Haro returns unexpectedly to Acapulco after leaving mysteriously the year before. Her best friend, Bárbara Fuenmayor, angry that she has always been forced to live in Sofía's shadow, is not happy with her return, especially after discovering that before leaving Acapulco, Sofía had slept with her boyfriend, Nico. Featured Crew Stephanie Savage Creator Josh Schwartz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sofía Sisniega Sofía López-Haro Okairy Giner Bárbara Fuenmayor Diego Amozurrutia Daniel Parra Jon-Michael Ecker Nicolás 'Nico' de la Vega Macarena Achaga Jenny Parra Full Cast & Crew Last Season Season 1 2013 | 25 Episodes Season 1 of Gossip Girl: Acapulco premiered on August  5, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gossip Girl: Acapulco. You can help by rating TV shows you've seen. Facts Status  Cancelled Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  40m Homepage  - Genres Drama Keywords gossip Content Score 93 Almost there... Top Contributors V 33 Vaine 8 Elizabeth Jennings CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}