{"link": "https://www.themoviedb.org/tv/3418?language=en", "title": "Dark Season", "resume": "Dark Season is a British science-fiction television serial for adolescents, screened on BBC1 in late 1991. Comprising six twenty-five minute episodes, the two linked three-part stories tell the adventures of three teenagers and their battle to save their school and their classmates from the actions of the sinister Mr Eldritch. It was the first television drama to be written by Russell T Davies, and is also noteworthy for co-starring a young Kate Winslet in her first major television role.", "rate": 0, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kate Winslet", "Ben Chandler", "Victoria Lambert", "Brigit Forsyth", "Grant Parsons"], "character": ["Reet", "Thomas", "Marcie Hatter", "Miss Maitland", "Mr. Eldritch"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3418   Expand Dark Season   (1991) User Score Overview Dark Season is a British science-fiction television serial for adolescents, screened on BBC1 in late 1991. Comprising six twenty-five minute episodes, the two linked three-part stories tell the adventures of three teenagers and their battle to save their school and their classmates from the actions of the sinister Mr Eldritch. It was the first television drama to be written by Russell T Davies, and is also noteworthy for co-starring a young Kate Winslet in her first major television role. Featured Crew Russell T. Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Winslet Reet Ben Chandler Thomas Victoria Lambert Marcie Hatter Brigit Forsyth Miss Maitland Grant Parsons Mr. Eldritch Full Cast & Crew Last Season Season 1 1991 | 6 Episodes Season 1 of Dark Season premiered on November 14, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dark Season. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords mind control high school nazi mystery world domination Content Score 93 Almost there... Top Contributors N 46 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}