{"link": "https://www.themoviedb.org/tv/68400?language=en", "title": "Nazotokine", "resume": "Tokine Amino works as a secretary for TEN2, an advertising agency. One day while cleaning the conference room, she is surrounded in light and finds she can't leave the room until she solves a puzzle. It seems a creature named Hacchin is a being from another dimension called Quizn. He is interested in the intellectual pleasure that happens when someone solves a puzzles or uncovers a mystery. And he has his sight set on Tokine Amino.", "rate": 40, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68400   Expand Nazotokine   (2016) User Score  Play Trailer Overview Tokine Amino works as a secretary for TEN2, an advertising agency. One day while cleaning the conference room, she is surrounded in light and finds she can't leave the room until she solves a puzzle. It seems a creature named Hacchin is a being from another dimension called Quizn. He is interested in the intellectual pleasure that happens when someone solves a puzzles or uncovers a mystery. And he has his sight set on Tokine Amino. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Kaito x Ansa 2017 | 1 Episode Season 2 of Nazotokine premiered on July 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nazotokine. You can help by rating TV shows you've seen. Facts Original Name  ナゾトキネ Status  In Production Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://nazotokine.com/ Genres Comedy Animation Keywords fantasy animation Content Score 64 We're so close, yet so far. Top Contributors 24 iliass guendouz 4 Despair-Paradise 3 sp1ti m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}