{"link": "https://www.themoviedb.org/tv/33728?language=en", "title": "Renkin 3-kyū Magical? Pokān", "resume": "Renkin 3-kyū Magical? Pokān is an anime series that tells the story of the everyday life of four princesses from the Netherworld who are oblivious to the happenings in everyday life in the human world. The name of the anime is often shortened to Magipoka. The opening sequence of the anime is deceptive to the viewer as it is not apparent that the anime's genre is comedy.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Momoko Saito", "Aya Hirano", "Satomi Akesaka", "Hitomi Nabatame", "Nomico"], "character": ["Uma", "Pachira", "Aiko", "Liru", "Keimie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33728   Expand Renkin 3-kyū Magical? Pokān   (2006) User Score Overview Renkin 3-kyū Magical? Pokān is an anime series that tells the story of the everyday life of four princesses from the Netherworld who are oblivious to the happenings in everyday life in the human world. The name of the anime is often shortened to Magipoka. The opening sequence of the anime is deceptive to the viewer as it is not apparent that the anime's genre is comedy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Momoko Saito Uma Aya Hirano Pachira Satomi Akesaka Aiko Hitomi Nabatame Liru Nomico Keimie Full Cast & Crew Last Season Renkin 3-kyū magical ? pokān season 1 — | 12 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Renkin 3-kyū Magical? Pokān. You can help by rating TV shows you've seen. Facts Original Name  錬金3級 まじかる?ぽか〜ん Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors G 20 G_90 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}