{"link": "https://www.themoviedb.org/tv/4306?language=en", "title": "Oliver Beene", "resume": "Oliver Beene is an American sitcom that premiered on Fox on March 9, 2003. The show was created by Howard Gewirtz. Set in 1962 and 1963, the show chronicled the trials and tribulations of the 11-to-12-year-old Oliver Beene, in first person perspective. Oliver Beene's other main characters are his parents Jerry and Charlotte Beene, his brother Ted Beene, and his two friends Joyce and Michael. The narrator, an older Oliver reflecting on his experience, is voiced by David Cross. Often in episodes, the story is interrupted by flashbacks and flash-forwards.", "rate": 90, "genre": ["Comedy"], "cast": ["Grant Shaud", "Grant Rosenmeyer", "Andrew Lawrence", "Daveigh Chase", "Wendy Makkena"], "character": ["Tayler 'Ted' Mark Beene", "Joyce"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4306   Expand Oliver Beene   (2003) User Score Overview Oliver Beene is an American sitcom that premiered on Fox on March 9, 2003. The show was created by Howard Gewirtz. Set in 1962 and 1963, the show chronicled the trials and tribulations of the 11-to-12-year-old Oliver Beene, in first person perspective. Oliver Beene's other main characters are his parents Jerry and Charlotte Beene, his brother Ted Beene, and his two friends Joyce and Michael. The narrator, an older Oliver reflecting on his experience, is voiced by David Cross. Often in episodes, the story is interrupted by flashbacks and flash-forwards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Grant Shaud Grant Rosenmeyer Andrew Lawrence Tayler 'Ted' Mark Beene Daveigh Chase Joyce Wendy Makkena Full Cast & Crew Last Season Season 2 2004 | 16 Episodes Season 2 of Oliver Beene premiered on February  4, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oliver Beene. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords retro family sitcom 1960s Content Score 86 Almost there... Top Contributors 9 Banana s 3 speedycars PS 2 P. Snoopy 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}