{"link": "https://www.themoviedb.org/tv/68100?language=en", "title": "Touken Ranbu: Hanamaru", "resume": "The year is 2205. The \"historical revisionists\" have begun attacks on the past in their plot to change history. The Saniwa, who have been charged with protecting history, can imbue life into objects. Strongest among these are the Tōken Danshi. The story centers around their cheerful lives.", "rate": 68, "genre": ["Action", "Adventure", "Animation"], "cast": ["Mitsushiro Ichiki", "Toshiki Masuda"], "character": ["Yamatonokami Yasusada (大和守安定)", "Kashuu Kiyomitsu (加州清光)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68100   Expand Touken Ranbu: Hanamaru   (2016) User Score Overview The year is 2205. The \"historical revisionists\" have begun attacks on the past in their plot to change history. The Saniwa, who have been charged with protecting history, can imbue life into objects. Strongest among these are the Tōken Danshi. The story centers around their cheerful lives. Featured Crew Takashi Naoya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitsushiro Ichiki Yamatonokami Yasusada (大和守安定) Toshiki Masuda Kashuu Kiyomitsu (加州清光) Full Cast & Crew Current Season Season 2 2018 | 12 Episodes Season 2 of Touken Ranbu: Hanamaru premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2016-04-07 Bungo Stray Dogs 7.3    2016-07-08 Alderamin on the Sky 7.4    2014-07-05 Barakamon 7.3    2016-10-06 Yuri!!! on Ice 8.3    2016-01-16 Ajin 6.4  Facts Original Name  刀剣乱舞-花丸- Status  Returning Series Networks Nitteleplus Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://touken-hanamaru.jp/ Genres Action & Adventure Animation Keywords fantasy bishounen Content Score 64 We're so close, yet so far. Top Contributors 17 neonime 13 iliass guendouz 10 Elizabeth Jennings m 7 marcelo_RS  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}