{"link": "https://www.themoviedb.org/tv/18526?language=en", "title": "Real Rescues", "resume": "Real Rescues is a British documentary broadcast on BBC One exploring the daily work of the emergency services aired since 15 October 2007. Real Rescues is at the heart of the action with the emergency services of Hampshire including the police, fire, ambulance, coastguard and lifeboat crews. A majority of the footage has been shot around Portsmouth and Fareham. Reruns are on Watch and CBS Reality.\nIn the later series, other counties from across the UK began to be featured. Other emergency services, such as mountain rescue and animal rescue, were also featured.", "rate": 0, "genre": [], "cast": ["Nick Knowles"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18526   Expand Real Rescues   (2007) User Score Overview Real Rescues is a British documentary broadcast on BBC One exploring the daily work of the emergency services aired since 15 October 2007. Real Rescues is at the heart of the action with the emergency services of Hampshire including the police, fire, ambulance, coastguard and lifeboat crews. A majority of the footage has been shot around Portsmouth and Fareham. Reruns are on Watch and CBS Reality. In the later series, other counties from across the UK began to be featured. Other emergency services, such as mountain rescue and animal rescue, were also featured. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Knowles Full Cast & Crew Last Season Season 9 2013 | 16 Episodes Season 9 of Real Rescues premiered on March 11, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Real Rescues. You can help by rating TV shows you've seen. Facts Status  Returning Series Network BBC Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.bbc.co.uk/programmes/b00k4gd7 Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}