{"link": "https://www.themoviedb.org/tv/117?language=en", "title": "The Dreamstone", "resume": "The Dreamstone is a British animated television series that ran for 4 series of 13 episodes each between 1990 and 1995. The original concept and artwork were created by Michael Jupp who would later create another cartoon show Bimble's Bucket. The series was produced by FilmFair as a Central production for ITV. In 1996 Filmfair was bought from the Caspian Group by the Canadian company Cinar, then it became Cookie Jar Entertainment, but then it became part of DHX Media. This resulted in DHX's ownership of the first two series, while a company called Dreamstone Productions Ltd. retain the ownership of the third and fourth series.\nThe Dreamstone is set in an alternative world called the 'Sleeping World,' and concerns itself principally with the struggle between good, and evil.", "rate": 90, "genre": ["Family", "Animation"], "cast": ["Leonard Whiting", "Melvyn Hayes", "Peter Craze", "Gary Martin", "Anthony Jackson"], "character": ["Urpgor (voice)", "Frizz (voice)", "Narrator", "Zordrak (voice)", "Nug (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 117   Expand The Dreamstone   (1990) User Score Overview The Dreamstone is a British animated television series that ran for 4 series of 13 episodes each between 1990 and 1995. The original concept and artwork were created by Michael Jupp who would later create another cartoon show Bimble's Bucket. The series was produced by FilmFair as a Central production for ITV. In 1996 Filmfair was bought from the Caspian Group by the Canadian company Cinar, then it became Cookie Jar Entertainment, but then it became part of DHX Media. This resulted in DHX's ownership of the first two series, while a company called Dreamstone Productions Ltd. retain the ownership of the third and fourth series. The Dreamstone is set in an alternative world called the 'Sleeping World,' and concerns itself principally with the struggle between good, and evil. Featured Crew Michael Jupp Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leonard Whiting Urpgor (voice) Melvyn Hayes Frizz (voice) Peter Craze Narrator Gary Martin Zordrak (voice) Anthony Jackson Nug (voice) Full Cast & Crew Last Season Season 4 1995 | 13 Episodes Season 4 of The Dreamstone premiered on January  3, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Dreamstone. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Family Animation Keywords good vs evil dream parallel world Content Score 79 Pump it up! We're close now. Top Contributors 19 Banana c 10 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}