{"link": "https://www.themoviedb.org/tv/34071?language=en", "title": "Hem till Midgård", "resume": "Hem till Midgård is a Swedish sit-com which ran on TV4 in Sweden during 2003. It is currently being re-run on TV4 Komedi. The name is a pun of the classic Swedish TV series Hem till byn as well as Emmerdale which is known as Hem till gården in Sweden.\nThe series was created and written by Per Simonsson, Fredde Granberg, Johan Petersson and Stefan Roos. The later three also starred in the show. In total 2 seasons of 12 episodes each were produced before the show was canceled.", "rate": 60, "genre": ["Comedy", "Action", "Adventure"], "cast": ["Rolf Skoglund", "Fredde Granberg", "Stefan Roos", "Johan Petersson", "Marko Lehtosalo"], "character": ["Lill-Snorre", "Halvdan", "Runar", "Tyke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34071   Expand Hem till Midgård   (2003) User Score Overview Hem till Midgård is a Swedish sit-com which ran on TV4 in Sweden during 2003. It is currently being re-run on TV4 Komedi. The name is a pun of the classic Swedish TV series Hem till byn as well as Emmerdale which is known as Hem till gården in Sweden. The series was created and written by Per Simonsson, Fredde Granberg, Johan Petersson and Stefan Roos. The later three also starred in the show. In total 2 seasons of 12 episodes each were produced before the show was canceled. Featured Crew Johan Petersson Creator Fredde Granberg Creator Stefan Roos Creator Per Simonsson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rolf Skoglund Fredde Granberg Lill-Snorre Stefan Roos Halvdan Johan Petersson Runar Marko Lehtosalo Tyke Full Cast & Crew Last Season Season 2 — | 12 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hem till Midgård. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}