{"link": "https://www.themoviedb.org/tv/44163?language=en", "title": "Broken Blade", "resume": "In the continent of Cruzon, an impending war between the Kingdom of Krisna and the nation of Athens is brimming. The people of this land are able to use quartz for whatever purpose they desire. Yet one person, Rygart Arrow, is not. He is an \"un-sorcerer,\" a person unable to use quartz. But this characteristic will enable him to pilot an ancient Golem, one strong enough to put up a fight against the invading army of Athens.", "rate": 55, "genre": ["Animation", "Drama"], "cast": ["Soichiro Hoshi", "Chiwa Saito", "Marina Inoue", "Minoru Shiraishi", "Tomoya Kawai"], "character": ["Rygart Arrow", "Sigyn Erster", "Narvi", "Nile", "Loggin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44163   Expand Broken Blade   (2014) User Score Overview In the continent of Cruzon, an impending war between the Kingdom of Krisna and the nation of Athens is brimming. The people of this land are able to use quartz for whatever purpose they desire. Yet one person, Rygart Arrow, is not. He is an \"un-sorcerer,\" a person unable to use quartz. But this characteristic will enable him to pilot an ancient Golem, one strong enough to put up a fight against the invading army of Athens. Featured Crew Tetsuro Amino Creator Nobuyoshi Habara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soichiro Hoshi Rygart Arrow Chiwa Saito Sigyn Erster Marina Inoue Narvi Minoru Shiraishi Nile Tomoya Kawai Loggin Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Broken Blade premiered on April  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2012-04-07 Kuroko's Basketball 7.9    2012-12-03 Guilty Crown 7.4    2004-04-24 Wolf's Rain 6.6  Facts Original Name  ブレイク ブレイド Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://breakblade.jp/ Genres Animation Drama Keywords based on manga anime comic meteor Content Score 93 Almost there... Top Contributors 23 benf45 18 Elizabeth Jennings 16 sp1ti m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}