{"link": "https://www.themoviedb.org/tv/38919?language=en", "title": "Happily Divorced", "resume": "Happily Divorced is an American sitcom created by Fran Drescher and Peter Marc Jacobson. Inspired by their experiences, the series, which became TV Land's third original scripted series following Hot in Cleveland and Retired at 35, ran from June 15, 2011, to February 13, 2013, and revolves around a Los Angeles florist who finds out her husband of 18 years is gay. Happily Divorced was canceled on August 23, 2013.", "rate": 57, "genre": ["Comedy"], "cast": ["Valente Rodriguez", "Fran Drescher", "John Michael Higgins", "Robert Walden", "Tichina Arnold"], "character": ["Cesar", "Fran Lovett", "Peter Lovett", "Glenn Newman", "Judi Mann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38919   Expand Happily Divorced   (2011) User Score  Play Trailer Overview Happily Divorced is an American sitcom created by Fran Drescher and Peter Marc Jacobson. Inspired by their experiences, the series, which became TV Land's third original scripted series following Hot in Cleveland and Retired at 35, ran from June 15, 2011, to February 13, 2013, and revolves around a Los Angeles florist who finds out her husband of 18 years is gay. Happily Divorced was canceled on August 23, 2013. Featured Crew Fran Drescher Creator Peter Marc Jacobson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Valente Rodriguez Cesar Fran Drescher Fran Lovett John Michael Higgins Peter Lovett Robert Walden Glenn Newman Tichina Arnold Judi Mann Full Cast & Crew Last Season Season 2 2012 | 24 Episodes Season 2 of Happily Divorced premiered on March  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations   2010-03-14 Sons of Tucson 7.0    2010-09-22 The Defenders 7.0    2007-10-15 Samantha Who? 6.5    2010-06-16 Hot in Cleveland 6.8    2016-03-15 Crowded 6.4    2013-10-03 The Millers 4.9    2015-09-29 The Grinder 6.6    2012-09-26 The Neighbors 6.3  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.tvland.com/shows/happily-divorced Genres Comedy Keywords los angeles dating lgbt ex-husband ex-wife relationship sitcom Content Score 100 Yes! Looking good! Top Contributors 29 Banana 5 NEOhidra 4 waaw e 3 error666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}