{"link": "https://www.themoviedb.org/tv/60932?language=en", "title": "Almost Royal", "resume": "Almost Royal is a tale of two young British aristocrats on their first trip around the United States, interacting with real-life Americans. Currently 50th and 51st in line to the throne, siblings George and Poppy Carlton are the latest Brits on the scene.", "rate": 65, "genre": ["Comedy"], "cast": ["Ed Gamble", "Amy Hoggart", "Gemma Whelan"], "character": ["Georgie Carlton", "Poppy Carlton", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60932   Expand Almost Royal   (2014) User Score Overview Almost Royal is a tale of two young British aristocrats on their first trip around the United States, interacting with real-life Americans. Currently 50th and 51st in line to the throne, siblings George and Poppy Carlton are the latest Brits on the scene. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ed Gamble Georgie Carlton Amy Hoggart Poppy Carlton Gemma Whelan Narrator Full Cast & Crew Last Season Season 2 2016 | 8 Episodes Season 2 of Almost Royal premiered on January 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2013-10-10 Once Upon a Time in Wonderland 6.1    2010-03-02 Parenthood 6.9    2016-07-17 Vice Principals 6.8    2012-10-11 Beauty and the Beast 5.7    2015-11-30 Superstore 6.7    2012-12-06 A Young Doctor's Notebook 6.8    2014-04-20 Salem 7.3    2015-06-21 The Brink 6.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbcamerica.com/almost-royal/ Genres Comedy Keywords aristocrat Content Score 56 We're so close, yet so far. Top Contributors 31 Elizabeth Jennings 5 Banana z 4 zurman1 2 awkwardmeow  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}