{"link": "https://www.themoviedb.org/tv/6066?language=en", "title": "Verano azul", "resume": "Verano azul was a famous Spanish television show directed by Antonio Mercero that first aired in 1981. It tells of the adventures of a group of youngsters between ages 9 and 17, while on summer vacation in Nerja, a small town on the Mediterranean Costa del Sol, Andalusia, in Southern Spain. The series, with 19 episodes that drew up to 20 million viewers in Spain, has been re-run almost every summer since then. It has left a deep impact over several generations of viewers and has become part of Spain's common cultural memory. It was also broadcast in Latin America, Portugal, France and some Slavic countries like Yugoslavia, Bulgaria, Poland and Czechoslovakia.\nThe show was produced by the Spanish state broadcaster TVE, and it was originally broadcast on its then main channel TVE1 from October 11, 1981 to February 14, 1982.", "rate": 86, "genre": ["Comedy"], "cast": ["Antonio Ferrandis", "María Garralón", "Juanjo Artero", "Gerardo Garrido", "Cristina Torres"], "character": ["Chanquete", "Julia", "Javi", "Quique", "Desi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6066   Expand Verano azul   (1981) User Score Overview Verano azul was a famous Spanish television show directed by Antonio Mercero that first aired in 1981. It tells of the adventures of a group of youngsters between ages 9 and 17, while on summer vacation in Nerja, a small town on the Mediterranean Costa del Sol, Andalusia, in Southern Spain. The series, with 19 episodes that drew up to 20 million viewers in Spain, has been re-run almost every summer since then. It has left a deep impact over several generations of viewers and has become part of Spain's common cultural memory. It was also broadcast in Latin America, Portugal, France and some Slavic countries like Yugoslavia, Bulgaria, Poland and Czechoslovakia. The show was produced by the Spanish state broadcaster TVE, and it was originally broadcast on its then main channel TVE1 from October 11, 1981 to February 14, 1982. Featured Crew Antonio Mercero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonio Ferrandis Chanquete María Garralón Julia Juanjo Artero Javi Gerardo Garrido Quique Cristina Torres Desi Full Cast & Crew Last Season Season 1 1981 | 19 Episodes Season 1 of Verano azul premiered on October 11, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Verano azul. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors I 24 Iyasuh 10 Elizabeth Jennings K 6 Karuki s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}