{"link": "https://www.themoviedb.org/tv/12260?language=en", "title": "Cromartie High School", "resume": "Folks, meet Takashi Kamiyama. Enrolled at Cromartie High, where everybody is a delinquent, Kamiyama is apparently the only non-delinquent in the school. Logically, therefore, he must be the toughest in his class—by the rather twisted logic that only a really tough rabbit would lie down with lions. Thus begins a story that parodies every cliché of tough-guy anime that you've ever heard of, and some you haven't. Oh, and Freddie Mercury is in it, too.", "rate": 65, "genre": ["Animation", "Comedy"], "cast": ["Takahiro Sakurai", "Megumi Hayashibara", "Mika Kanai", "Norio Wakamoto", "Akio Suyama"], "character": ["Takashi Kamiyama", "Maeda's Mother", "Beta Mechazawa", "Shinichi Mechazawa", "Hokuto no kobun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12260   Expand Cromartie High School   (2003) User Score Overview Folks, meet Takashi Kamiyama. Enrolled at Cromartie High, where everybody is a delinquent, Kamiyama is apparently the only non-delinquent in the school. Logically, therefore, he must be the toughest in his class—by the rather twisted logic that only a really tough rabbit would lie down with lions. Thus begins a story that parodies every cliché of tough-guy anime that you've ever heard of, and some you haven't. Oh, and Freddie Mercury is in it, too. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takahiro Sakurai Takashi Kamiyama Megumi Hayashibara Maeda's Mother Mika Kanai Beta Mechazawa Norio Wakamoto Shinichi Mechazawa Akio Suyama Hokuto no kobun Full Cast & Crew Last Season Season 1 2003 | 26 Episodes Season 1 of Cromartie High School premiered on October  3, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Cromartie High School. You can help by rating TV shows you've seen. Facts Original Name  魁!! クロマティ高校 Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  26m Homepage   http://www.starchild.co.jp/special/kurokou/ Genres Animation Comedy Keywords delinquent based on manga shounen anime Content Score 86 Almost there... Top Contributors 19 sp1ti R 5 Rebecca t 4 tmdb46417706 3 RubeensVinicius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}