{"link": "https://www.themoviedb.org/tv/63418?language=en", "title": "Code Black", "resume": "Inspired by the award-winning documentary, this medical drama is set in the busiest and most notorious ER in the nation where the extraordinary staff confront a challenged system in order to protect their ideals and the patients who need them the most.", "rate": 68, "genre": ["Drama"], "cast": ["Marcia Gay Harden", "Luis Guzmán", "Benjamin Hollingsworth", "Harry M. Ford", "William Allen Young"], "character": ["Leanne Rorish", "Jesse Salander", "Mario Savetti", "Angus Leighton", "Rollie Guthrie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63418   Expand Code Black   (2015) User Score  Play Trailer Overview Inspired by the award-winning documentary, this medical drama is set in the busiest and most notorious ER in the nation where the extraordinary staff confront a challenged system in order to protect their ideals and the patients who need them the most. Featured Crew Michael Seitzman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marcia Gay Harden Leanne Rorish Luis Guzmán Jesse Salander Benjamin Hollingsworth Mario Savetti Harry M. Ford Angus Leighton William Allen Young Rollie Guthrie Full Cast & Crew Current Season Season 3 2018 | 13 Episodes Season 3 of Code Black premiered on April 25, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Is this called \"Code Black\" because blacks are in charge? Open 1 by  LoveliiLara Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2017-01-25 Mary Kills People 7.5    2016-06-08 Power Monkeys 7.0    2017-03-01 Chicago Justice 4.8    2012-08-13 Major Crimes 6.7    2011-06-06 Injustice 7.3    2017-10-01 Ten Days in the Valley 6.0    2015-11-17 Chicago Med 6.7    2016-12-07 Shut Eye 6.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/code-black/ Genres Drama Keywords nurse hospital doctor emergency room medical drama Content Score 100 Yes! Looking good! Top Contributors 46 Elizabeth Jennings m 15 misfit_noel 13 Banana c 8 castacasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}