{"link": "https://www.themoviedb.org/tv/63198?language=en", "title": "Assembly", "resume": "Jin Sang Pil is elected as a member of the national assembly. Prior to becoming a national assembly member, he worked as a welder in a shipyard. He is simple, brave and righteous, but his work as a national assembly member is poor. With the help of his aid Choi In Kyung, Jin Sang Pil is able to become a honorable national assembly member.", "rate": 45, "genre": ["Drama"], "cast": ["Jung Jae-young", "Song Yun-ah", "Ok Taec-yeon", "Jang Hyun-sung", "Son Byung-ho"], "character": ["Jin Sang-pil", "Choi In-kyung", "Kim Kyu-hwan", "Baek Do-hyun", "Bae Dal-soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63198   Expand Assembly   (2015) User Score Overview Jin Sang Pil is elected as a member of the national assembly. Prior to becoming a national assembly member, he worked as a welder in a shipyard. He is simple, brave and righteous, but his work as a national assembly member is poor. With the help of his aid Choi In Kyung, Jin Sang Pil is able to become a honorable national assembly member. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Jae-young Jin Sang-pil Song Yun-ah Choi In-kyung Ok Taec-yeon Kim Kyu-hwan Jang Hyun-sung Baek Do-hyun Son Byung-ho Bae Dal-soo Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Assembly premiered on July 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Assembly. You can help by rating TV shows you've seen. Facts Original Name  어셈블리 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/assembly/ Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors M 44 Maria180493 z 5 zurman1 4 Elizabeth Jennings 4 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}