{"link": "https://www.themoviedb.org/tv/36901?language=en", "title": "Glass Home", "resume": "Glass Home is a Bulgarian drama series created by bTV. It's a family drama and the executive producers are Dimityr Mitovski and Dimityr Gochev from \"Camera OOD\". It airs in bTV's primetime. Some of Bulgaria's most famous actors star in the series, which is directed by Viktor Bojinov and Petar Rusev.", "rate": 45, "genre": ["Drama", "Family"], "cast": ["Stefan Danailov", "Kalin Vrachanski", "Boyko Krastanov", "Elena Petrova", "Georgi Kadurin"], "character": ["Dimitar Kasabov", "Kamen Kasabov", "Dani", "Boryana Kasabova", "Hristo Atanasov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36901   Expand Glass Home   (2010) User Score Overview Glass Home is a Bulgarian drama series created by bTV. It's a family drama and the executive producers are Dimityr Mitovski and Dimityr Gochev from \"Camera OOD\". It airs in bTV's primetime. Some of Bulgaria's most famous actors star in the series, which is directed by Viktor Bojinov and Petar Rusev. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stefan Danailov Dimitar Kasabov Kalin Vrachanski Kamen Kasabov Boyko Krastanov Dani Elena Petrova Boryana Kasabova Georgi Kadurin Hristo Atanasov Full Cast & Crew Last Season Season 5 2012 | 9 Episodes Season 5 of Glass Home premiered on April 16, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Glass Home. You can help by rating TV shows you've seen. Facts Original Name  Стъклен дом Status  Ended Network Certification  - Type  Scripted Original Language  Bulgarian Runtime  90m, 70m Homepage   http://www.btv.bg/seriali/glass-home/ Genres Drama Family Keywords criminal Content Score 86 Almost there... Top Contributors t 60 tmdb38202327 7 NEOhidra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}