{"link": "https://www.themoviedb.org/tv/71485?language=en", "title": "Hospital People", "resume": "Set in a fictional hospital, this mockumentary follows the lives of porters, hospital radio DJs, chaplains and managers asking who exactly are all these people, and should any of them be remotely near a hospital?", "rate": 65, "genre": ["Comedy"], "cast": ["Tom Binns", "Janine Duvitski"], "character": ["Susan Mitchell / Father Kenny / Ivan Brackenbury / Ian D Montfort", "Mrs. Leydon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71485   Expand Hospital People   (2017) User Score Overview Set in a fictional hospital, this mockumentary follows the lives of porters, hospital radio DJs, chaplains and managers asking who exactly are all these people, and should any of them be remotely near a hospital? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Binns Susan Mitchell / Father Kenny / Ivan Brackenbury / Ian D Montfort Janine Duvitski Mrs. Leydon Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Hospital People premiered on April 21, 2017. View All Seasons Social Reviews  1 Discussions  0 D A review by Dan_Tebasco  7.0 Written by  Dan_Tebasco  on May 25, 2017 Pretty entertaining tv series in the veins of THE OFFICE but taking place in a hospital instead, and not quite as dark in tone. Worth checking out for sure. Read All Reviews Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hospital People. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b08nf1xp Genres Comedy Keywords northern england mockumentary yorkshire hospital british humour Content Score 56 We're so close, yet so far. Top Contributors 23 Bendik O 4 Ozbourne 2 Elizabeth Jennings a 2 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}