{"link": "https://www.themoviedb.org/tv/6758?language=en", "title": "Nick Arcade", "resume": "Nick Arcade is an American children's game show created by James Bethea and Karim Miteff and hosted by Phil Moore, with Andrea Lively announcing, that aired on Nickelodeon in 1992, airing originally during weekend afternoons, with reruns airing until September 28, 1997. It was taped at Nickelodeon Studios at Universal Studios Florida in Orlando. Its tagline is The Place Where No Game Goes on Play.\nIn Nick Arcade, two teams of contestants played two initial trivia rounds, with the winner advancing to the \"Video Zone\" to play against the virtual \"Video Game Wizard\" of the day.\nThe show's format combined video game trivia with contestant-interactive virtual reality. The virtual reality games were designed by Bethea and Miteff for Bethea/Miteff Productions and programmed by Curt Toumainian for Saddleback/Live Studios and Dean Friedman. The show was the first in America to regularly intermix live action with animation using a bluescreen.", "rate": 75, "genre": [], "cast": ["Phil Moore"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6758   Expand Nick Arcade   (1992) User Score Overview Nick Arcade is an American children's game show created by James Bethea and Karim Miteff and hosted by Phil Moore, with Andrea Lively announcing, that aired on Nickelodeon in 1992, airing originally during weekend afternoons, with reruns airing until September 28, 1997. It was taped at Nickelodeon Studios at Universal Studios Florida in Orlando. Its tagline is The Place Where No Game Goes on Play. In Nick Arcade, two teams of contestants played two initial trivia rounds, with the winner advancing to the \"Video Zone\" to play against the virtual \"Video Game Wizard\" of the day. The show's format combined video game trivia with contestant-interactive virtual reality. The virtual reality games were designed by Bethea and Miteff for Bethea/Miteff Productions and programmed by Curt Toumainian for Saddleback/Live Studios and Dean Friedman. The show was the first in America to regularly intermix live action with animation using a bluescreen. Featured Crew James Bethea Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Moore Full Cast & Crew Last Season Season 4 — | 15 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nick Arcade. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}