{"link": "https://www.themoviedb.org/tv/7173?language=en", "title": "Fated to Love You", "resume": "Fated to Love You, also known as You're My Destiny, Sticky Note Girl or Destiny Love, is a 2008 Taiwanese drama starring Joe Chen, Ethan Juan, Baron Chen and Bianca Bai. It was produced by Sanlih E-Television and directed by Chen Ming Zhang with location filming in Taiwan, Hong Kong and Shanghai. It holds the record for the highest average single-episode rating at 10.91 with a peak at 13.64 for episode 20 broadcast on 27 July 2008, and broke the previous record held by The Prince Who Turns Into a Frog.\nThe series was first broadcast in Taiwan on free-to-air Taiwan Television from 16 March 2008 to 24 August 2008, every Sunday at 22:00 and cable TV Sanlih E-Television from 22 March 2008 to 30 August 2008, every Saturday at 21:00.\nFated to Love You was nominated in 2008 for six awards at the 43rd Golden Bell Awards, Taiwan. It was awarded the 2008 Best Television Series and Best Marketing Programme.\nFated to Love You is now aired on Saturday's on Hawaii's KIKU Television at 8:00.", "rate": 73, "genre": ["Drama", "Comedy"], "cast": ["Ethan Juan", "Joe Chen", "Chu-he Chen", "Bianca Bai", "Lin Mei-hsiu"], "character": ["Ji Cun Xi", "Chen Xin Yi", "Dylan", "Anna", "Chen Lin Xi Shi / Mama Sang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7173   Expand Fated to Love You   (2008) User Score Overview Fated to Love You, also known as You're My Destiny, Sticky Note Girl or Destiny Love, is a 2008 Taiwanese drama starring Joe Chen, Ethan Juan, Baron Chen and Bianca Bai. It was produced by Sanlih E-Television and directed by Chen Ming Zhang with location filming in Taiwan, Hong Kong and Shanghai. It holds the record for the highest average single-episode rating at 10.91 with a peak at 13.64 for episode 20 broadcast on 27 July 2008, and broke the previous record held by The Prince Who Turns Into a Frog. The series was first broadcast in Taiwan on free-to-air Taiwan Television from 16 March 2008 to 24 August 2008, every Sunday at 22:00 and cable TV Sanlih E-Television from 22 March 2008 to 30 August 2008, every Saturday at 21:00. Fated to Love You was nominated in 2008 for six awards at the 43rd Golden Bell Awards, Taiwan. It was awarded the 2008 Best Television Series and Best Marketing Programme. Fated to Love You is now aired on Saturday's on Hawaii's KIKU Television at 8:00. Featured Crew Chen Ming Zhang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ethan Juan Ji Cun Xi Joe Chen Chen Xin Yi Chu-he Chen Dylan Bianca Bai Anna Lin Mei-hsiu Chen Lin Xi Shi / Mama Sang Full Cast & Crew Last Season Season 1 2008 | 24 Episodes Season 1 of Fated to Love You premiered on March 16, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fated to Love You. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   2017-09-04 Argon 6.8    2011-08-08 Birdie Buddy 7.7    2016-11-21 White Nights 8.0    2016-03-23 Click your Heart 7.0  Facts Original Name  命中注定我愛你 Status  Ended Network TTV Main Channel Certification  - Type  Scripted Original Language  Chinese Runtime  90m Homepage   http://www.ttv.com.tw/drama08/destinylove/index.htm Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors L 9 Luoman M 6 Maria180493 5 janar N 4 Nosirus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}