{"link": "https://www.themoviedb.org/tv/77701?language=en", "title": "Persona 5 the Animation", "resume": "Ren Amamiya is about to enter his second year after transferring to Shujin Academy in Tokyo. Following a particular incident, his Persona awakens, and together with his friends, they form the “Phantom Thieves of Hearts” to reform hearts of corrupt adults by stealing the source of their distorted desires. Meanwhile, bizarre and inexplicable crimes have been popping up one after another… Living an ordinary high school life in Tokyo during the day, the group maneuvers the metropolitan city as Phantom Thieves after hours. Let the curtain rise for this grand, picaresque story!", "rate": 80, "genre": ["Animation"], "cast": ["Soichiro Hoshi", "Jun Fukuyama", "Tomokazu Sugita", "Ikue Otani", "Rina Satou"], "character": ["Akechi, Goro", "Amamiya, Ren", "Kitagawa, Yusuke", "Morgana", "Niijima, Makoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77701   Expand Persona 5 the Animation   (2018) User Score Overview Ren Amamiya is about to enter his second year after transferring to Shujin Academy in Tokyo. Following a particular incident, his Persona awakens, and together with his friends, they form the “Phantom Thieves of Hearts” to reform hearts of corrupt adults by stealing the source of their distorted desires. Meanwhile, bizarre and inexplicable crimes have been popping up one after another… Living an ordinary high school life in Tokyo during the day, the group maneuvers the metropolitan city as Phantom Thieves after hours. Let the curtain rise for this grand, picaresque story! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soichiro Hoshi Akechi, Goro Jun Fukuyama Amamiya, Ren Tomokazu Sugita Kitagawa, Yusuke Ikue Otani Morgana Rina Satou Niijima, Makoto Full Cast & Crew Current Season Season 1 2018 | 24 Episodes Season 1 of Persona 5 the Animation premiered on April  8, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Persona 5 the Animation. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Persona 5 the Animation. You can help by rating TV shows you've seen. Facts Original Name  PERSONA5 the Animation Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.aniplex.co.jp/p5a/ Genres Animation Keywords fantasy supernatural adventure based on video game anime Content Score 86 Almost there... Top Contributors 30 Aubi 12 sp1ti 12 RubeensVinicius 8 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}