{"link": "https://www.themoviedb.org/tv/74451?language=en", "title": "RUSH: Inspired by Battlefield", "resume": "Rush is based from the popular video game series Battlefield, from Swedish game developers DICE. The name comes from a battlefield unique mode in which the player must locate and destroy/defend two objectives.", "rate": 0, "genre": ["War", "Politics", "Action", "Adventure", "Drama"], "cast": ["Jeff Harig", "Rozycki Jeremy", "Beau Kojima", "Zack Lessner", "Brak Little"], "character": ["Wheatley", "Militant", "Militant", "Drake", "Cpt. William Tyson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74451   Expand RUSH: Inspired by Battlefield   (2016) User Score  Play Trailer Overview Rush is based from the popular video game series Battlefield, from Swedish game developers DICE. The name comes from a battlefield unique mode in which the player must locate and destroy/defend two objectives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Harig Wheatley Rozycki Jeremy Militant Beau Kojima Militant Zack Lessner Drake Brak Little Cpt. William Tyson Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of RUSH: Inspired by Battlefield premiered on September 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on RUSH: Inspired by Battlefield. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   https://www.go90.com/shows/6OUajs7gAwT Genres War & Politics Action & Adventure Drama Keywords miniseries based on video game Content Score 93 Almost there... Top Contributors G 52 Gonçalo 12 Banana TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}