{"link": "https://www.themoviedb.org/tv/3127?language=en", "title": "Jem", "resume": "Using a holographic computer she inherited from her father, Jerrica Benton turns herself and her pals into pop-music group Jem and the Holograms.", "rate": 57, "genre": ["Animation", "Sci-Fi", "Fantasy", "Kids"], "cast": ["Cathianne Blore", "Samantha Paris", "Cindy McGee", "Samantha Newark", "Michael Sheehan"], "character": ["Kimber Benton / Aja Leith (voice)", "Roxy (voice)", "Shana Elmsford (voice)", "Jerrica Benton (voice)", "Rio Pacheco (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3127   Expand Jem   (1985) User Score Overview Using a holographic computer she inherited from her father, Jerrica Benton turns herself and her pals into pop-music group Jem and the Holograms. Featured Crew Christy Marx Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Cathianne Blore Kimber Benton / Aja Leith (voice) Samantha Paris Roxy (voice) Cindy McGee Shana Elmsford (voice) Samantha Newark Jerrica Benton (voice) Michael Sheehan Rio Pacheco (voice) Full Cast & Crew Last Season Season 3 1987 | 39 Episodes Season 3 of Jem premiered on September 21, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Jem. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  7m, 22m Homepage  - Genres Animation Sci-Fi & Fantasy Kids Keywords music Content Score 100 Yes! Looking good! Top Contributors 106 Marr 🇳🇱 R 6 Rebecca c 4 chloris77 V 3 Vito_MCE  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}