{"link": "https://www.themoviedb.org/tv/39034?language=en", "title": "How to Rock", "resume": "How to Rock is an American teen sitcom that ran on Nickelodeon from February 4 to December 8, 2012. It stars Cymphonique Miller as Kacey Simon. The series is based on the 2011 book, How to Rock Braces and Glasses by Meg Haston published by Little, Brown Books For Young Readers and Alloy Entertainment. The series was officially green-lit on May 23, 2011 with a 20-episode production order, later increased to 26. Two of the ordered episodes were merged into a special episode so 25 episodes actually aired. The series began filming in August 2011. It is the first television sitcom to be produced by Alloy Entertainment. The first promo aired with Merry Christmas, Drake & Josh on December 10, 2011. It was confirmed by the series showrunner David M. Israel on August 26, 2012 that How to Rock would not be returning for a second season.", "rate": 10, "genre": ["Comedy"], "cast": ["Samantha Boscarino", "Cymphonique Miller", "Max Schneider", "Lulu Antariksa", "Halston Sage"], "character": ["Molly Garfunkel", "Kacey Simon", "Zander Robbins", "Stevie Baskara", "Grace King"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39034   Expand How to Rock   (2012) User Score Overview How to Rock is an American teen sitcom that ran on Nickelodeon from February 4 to December 8, 2012. It stars Cymphonique Miller as Kacey Simon. The series is based on the 2011 book, How to Rock Braces and Glasses by Meg Haston published by Little, Brown Books For Young Readers and Alloy Entertainment. The series was officially green-lit on May 23, 2011 with a 20-episode production order, later increased to 26. Two of the ordered episodes were merged into a special episode so 25 episodes actually aired. The series began filming in August 2011. It is the first television sitcom to be produced by Alloy Entertainment. The first promo aired with Merry Christmas, Drake & Josh on December 10, 2011. It was confirmed by the series showrunner David M. Israel on August 26, 2012 that How to Rock would not be returning for a second season. Featured Crew Jim O'Doherty Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samantha Boscarino Molly Garfunkel Cymphonique Miller Kacey Simon Max Schneider Zander Robbins Lulu Antariksa Stevie Baskara Halston Sage Grace King Full Cast & Crew Last Season Season 1 2012 | 26 Episodes Season 1 of How to Rock premiered on February  4, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Stevie: Happy Birthday Lulu Antariksa! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on How to Rock. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.nick.com/shows/how-to-rock Genres Comedy Keywords aspiring singer teenager Content Score 93 Almost there... Top Contributors j 15 jackielam1997 s 3 speedycars l 2 lucybenson 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}