{"link": "https://www.themoviedb.org/tv/2640?language=en", "title": "Spider-Man", "resume": "Spider-Man is a Japanese live-action television series produced by Toei Company, loosely based on Marvel's Spider-Man character. The series lasted 41 episodes, which aired on the Wednesday 19:30 JST time slot of Tokyo Channel 12 from May 17, 1978, to March 14, 1979. A theatrical episode was also shown in the Toei Manga Matsuri film festival on July 22, 1978. From March 5 to December 24, 2009, Marvel uploaded English subtitled versions of all 41 episodes and the movie on their official website.\nWhile Toei's version of the character wore the same costume as his Marvel counterpart, the show's storyline and the origin of the character's powers deviated completely from the source material. In addition to fighting by himself, this incarnation of Spider-Man also piloted a giant robot known as Leopardon, which he would summon to thwart off enlarged versions of the show's monsters. Toei would adopt the giant robot concept in subsequent incarnations of their own Super Sentai franchise.", "rate": 100, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Shinji Tôdô", "Mitsuo Andô", "Yukie Kagawa", "Hirofumi Koga", "Tōru Ōhira"], "character": ["Takuya Yamashiro / Spider-Man", "Professor Monster", "Amazoness", "Spider-Man's suit actor", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2640   Expand Spider-Man   (1978) User Score  Play Trailer Overview Spider-Man is a Japanese live-action television series produced by Toei Company, loosely based on Marvel's Spider-Man character. The series lasted 41 episodes, which aired on the Wednesday 19:30 JST time slot of Tokyo Channel 12 from May 17, 1978, to March 14, 1979. A theatrical episode was also shown in the Toei Manga Matsuri film festival on July 22, 1978. From March 5 to December 24, 2009, Marvel uploaded English subtitled versions of all 41 episodes and the movie on their official website. While Toei's version of the character wore the same costume as his Marvel counterpart, the show's storyline and the origin of the character's powers deviated completely from the source material. In addition to fighting by himself, this incarnation of Spider-Man also piloted a giant robot known as Leopardon, which he would summon to thwart off enlarged versions of the show's monsters. Toei would adopt the giant robot concept in subsequent incarnations of their own Super Sentai franchise. Featured Crew Stan Lee Creator Steve Ditko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Shinji Tôdô Takuya Yamashiro / Spider-Man Mitsuo Andô Professor Monster Yukie Kagawa Amazoness Hirofumi Koga Spider-Man's suit actor Tōru Ōhira Narrator Full Cast & Crew Last Season Season 1 1978 | 1 Episode Season 1 of Spider-Man premiered on May 17, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Spider-Man. You can help by rating TV shows you've seen. Facts Original Name  スパイダーマン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords based on comic giant robot tokusatsu Content Score 100 Yes! Looking good! Top Contributors 24 J. R 5 Rebecca 5 tgaddis TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}