{"link": "https://www.themoviedb.org/tv/62223?language=en", "title": "The Late Late Show with James Corden", "resume": "Once Craig Ferguson retires, James Corden will be taking over The Late Late Show. The show is a late night talk show that interviews celebrities and has its own bits. And of course, it's all hosted by James Corden.", "rate": 47, "genre": ["Talk"], "cast": ["James Corden", "Reggie Watts"], "character": ["Himself - Host", "Himself - Bandleader"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62223   Expand The Late Late Show with James Corden   (2015) User Score  Play Trailer Overview Once Craig Ferguson retires, James Corden will be taking over The Late Late Show. The show is a late night talk show that interviews celebrities and has its own bits. And of course, it's all hosted by James Corden. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Corden Himself - Host Reggie Watts Himself - Bandleader Full Cast & Crew Last Season Season 4 — | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2014-12-02 Late Night with Seth Meyers 5.6    1982-02-01 Late Night with David Letterman 7.2    2014-02-17 The Tonight Show Starring Jimmy Fallon 6.0    2005-01-03 The Late Late Show with Craig Ferguson 7.5    2009-12-03 Jersey Shore 2.8    1992-05-25 The Tonight Show with Jay Leno 5.0    2012-08-08 Here Comes Honey Boo Boo 1.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  40m Homepage   http://www.cbs.com/shows/late-late-show/ Genres Talk Keywords talk show late night Content Score 64 We're so close, yet so far. Top Contributors TB 30 TMDb Bot 26 Elizabeth Jennings 11 MarkSweeney 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}