{"link": "https://www.themoviedb.org/tv/68871?language=en", "title": "The Romance of the Condor Heroes", "resume": "While escaping from a tortured experience under Quan Zhen Sect's Zhao Zhi Jing, the trouble-maker Yang Guo meets the girl who will become his martial arts master and eventually the love of his life: Xiao Long Nu. Their story moves along filled with adventures, betrayal, and love. This is the newest version of Jin Yong's \"Return of the Condor Heroes\" by the famous director Yu Zheng. Sequel to The Legend of Condor Heroes and a prequel of sorts to The Heavenly Sword and Dragon Sabre. The story concerns the adventures of Yang Guo, an orphaned boy in a mid-13th Century China.", "rate": 0, "genre": ["Drama"], "cast": ["Chen Xiao", "Michelle Chen", "Mao Xiao Tong", "Elvis Han", "Zong Feng Yan"], "character": ["Yang Guo / Yang Kang", "Xiao Long Nu", "Guo Fu", "Wu Xiu Wen", "Ou Yang Feng"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68871   Expand The Romance of the Condor Heroes   (2014) User Score Overview While escaping from a tortured experience under Quan Zhen Sect's Zhao Zhi Jing, the trouble-maker Yang Guo meets the girl who will become his martial arts master and eventually the love of his life: Xiao Long Nu. Their story moves along filled with adventures, betrayal, and love. This is the newest version of Jin Yong's \"Return of the Condor Heroes\" by the famous director Yu Zheng. Sequel to The Legend of Condor Heroes and a prequel of sorts to The Heavenly Sword and Dragon Sabre. The story concerns the adventures of Yang Guo, an orphaned boy in a mid-13th Century China. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chen Xiao Yang Guo / Yang Kang Michelle Chen Xiao Long Nu Mao Xiao Tong Guo Fu Elvis Han Wu Xiu Wen Zong Feng Yan Ou Yang Feng Full Cast & Crew Last Season Season 1 2014 | 54 Episodes Season 1 of The Romance of the Condor Heroes premiered on December  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Romance of the Condor Heroes. You can help by rating TV shows you've seen. Facts Original Name  神雕侠侣 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china romance wuxia Content Score 86 Almost there... Top Contributors M 36 Maria180493 TB 2 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}