{"link": "https://www.themoviedb.org/tv/72507?language=en", "title": "Clean Freak! Aoyama-kun", "resume": "The handsome young soccer genius named Aoyama is a Japan representative. His play style is \"cleanliness\". He doesn't tackle and doesn't head the ball. If he's doing a throw-in, he'll only do it if he's wearing gloves.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Anzu Haruno", "Ryotaro Okiayu", "Mai Nakahara", "Tomokazu Seki", "Namikawa Daisuke"], "character": ["Moka Gotou (voice)", "Aoyama-kun (voice)", "Mio Odagiri (voice)", "Kaoru Zaizen (voice)", "Tsubasa Umeya (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72507   Expand Clean Freak! Aoyama-kun   (2017) User Score Overview The handsome young soccer genius named Aoyama is a Japan representative. His play style is \"cleanliness\". He doesn't tackle and doesn't head the ball. If he's doing a throw-in, he'll only do it if he's wearing gloves. Featured Crew Kazuya Ichikawa Creator Taku Sakamoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anzu Haruno Moka Gotou (voice) Ryotaro Okiayu Aoyama-kun (voice) Mai Nakahara Mio Odagiri (voice) Tomokazu Seki Kaoru Zaizen (voice) Namikawa Daisuke Tsubasa Umeya (voice) Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Clean Freak! Aoyama-kun premiered on July  3, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Clean Freak! Aoyama-kun. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Clean Freak! Aoyama-kun. You can help by rating TV shows you've seen. Facts Original Name  潔癖男子！青山くん Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://kda-anime.com/ Genres Animation Comedy Keywords sport soccer seinen anime Content Score 93 Almost there... Top Contributors 20 sp1ti C 14 Chintaran D 13 Destr0y J 11 JessicaBeatriz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}