{"link": "https://www.themoviedb.org/tv/69787?language=en", "title": "Sayang Papa Saya Tak", "resume": "The story about Raisya, a young girl who is spontaneous, rude and mercenary. Raisya who refused to continue their studies, desperate to escape from the orphanage occupied and began working as a nanny in a family house Farish. Experiences growing up in care homes Budi making it efficient in managing Qalish, young Farish who guard you.\nEfficiency and sincerity Raisya keep touching Qalish old mother Farish, madam Rogayah then arranged so Farish Raisya married. Farish depressed since the death of his ex-wife's love, has been urged by her mother to marry for the sake of future Raisya Qalish. Raisya also agreed to marry the remuneration of RM100,000. Labelled as a mercenary by the husband himself was close to the hearts Raisya because more important is its contribution to Rumah Budi care.", "rate": 0, "genre": ["Drama"], "cast": ["Seri Aileen", "Sweet Qismina", "Hisyam Hamid", "Emma Maembong", "Aida Rahim"], "character": ["Qalish", "Fathiya", "Farish", "Raisya", "Puan Rogayah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69787   Expand Sayang Papa Saya Tak   (2017) User Score Overview The story about Raisya, a young girl who is spontaneous, rude and mercenary. Raisya who refused to continue their studies, desperate to escape from the orphanage occupied and began working as a nanny in a family house Farish. Experiences growing up in care homes Budi making it efficient in managing Qalish, young Farish who guard you. Efficiency and sincerity Raisya keep touching Qalish old mother Farish, madam Rogayah then arranged so Farish Raisya married. Farish depressed since the death of his ex-wife's love, has been urged by her mother to marry for the sake of future Raisya Qalish. Raisya also agreed to marry the remuneration of RM100,000. Labelled as a mercenary by the husband himself was close to the hearts Raisya because more important is its contribution to Rumah Budi care. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seri Aileen Qalish Sweet Qismina Fathiya Hisyam Hamid Farish Emma Maembong Raisya Aida Rahim Puan Rogayah Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Sayang Papa Saya Tak premiered on January  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sayang Papa Saya Tak. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Astro Ria Certification  - Type  Scripted Original Language  Malay Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors v 25 vplaytv  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}