{"link": "https://www.themoviedb.org/tv/64036?language=en", "title": "Moon River", "resume": "The day Ming Xiao Xi transferred to her new school, she got herself into a fight with the most popular kids in school, who also happened to be the most arrogant, devilish pretty boys in school. Before she knew it, she became public enemy number 1. But, nothing can defeat this outgoing martial artist. She can handle any punches coming her way.", "rate": 80, "genre": ["Comedy", "Romance"], "cast": ["Pets Tseng", "Zi Hong", "Evan Ma", "Bernice Tsai", "Xu Kai Cheng"], "character": ["Ming Xiao Xi", "Mu Liu Bing", "Feng Jian Che", "Dong Hao Xue", "Dong Hao Nan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64036   Expand Moon River   (2015) User Score Overview The day Ming Xiao Xi transferred to her new school, she got herself into a fight with the most popular kids in school, who also happened to be the most arrogant, devilish pretty boys in school. Before she knew it, she became public enemy number 1. But, nothing can defeat this outgoing martial artist. She can handle any punches coming her way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pets Tseng Ming Xiao Xi Zi Hong Mu Liu Bing Evan Ma Feng Jian Che Bernice Tsai Dong Hao Xue Xu Kai Cheng Dong Hao Nan Full Cast & Crew Last Season Season 1 2015 | 30 Episodes Season 1 of Moon River premiered on September  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Moon River. You can help by rating TV shows you've seen. Facts Original Name  明若曉溪 Status  Ended Network GTV Variety Show Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.gtv.com.tw/Program/S051520150909U/ Genres Comedy Romance Keywords taiwanese Content Score 86 Almost there... Top Contributors M 24 Maria180493 8 Charles s 3 sheva_vitali W 1 WonderfulError  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}