{"link": "https://www.themoviedb.org/tv/15215?language=en", "title": "Brooklyn South", "resume": "Brooklyn South is an American ensemble police drama series that aired on CBS for only one season during the 1997–98 television season. The series was co-created by Steven Bochco, Bill Clark, David Milch and William M. Finkelstein. Bochco is the creator of many well-known police dramas such as Hill Street Blues and NYPD Blue. Milch was Bochco's co-creator for NYPD Blue. Finkelstein and Clark both also worked on NYPD Blue.\nThe series attempted to create a setting of a gritty, realistic police station similar to that of NYPD Blue, but differed by focusing on the uniformed police officers rather than the detectives. The pilot of Brooklyn South was noted as the first TV-MA rated episode on broadcast television.", "rate": 93, "genre": ["Drama"], "cast": ["Jon Tenney", "Titus Welliver", "Klea Scott", "Richard T. Jones", "Dylan Walsh"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15215   Expand Brooklyn South   (1997) User Score  Play Trailer Overview Brooklyn South is an American ensemble police drama series that aired on CBS for only one season during the 1997–98 television season. The series was co-created by Steven Bochco, Bill Clark, David Milch and William M. Finkelstein. Bochco is the creator of many well-known police dramas such as Hill Street Blues and NYPD Blue. Milch was Bochco's co-creator for NYPD Blue. Finkelstein and Clark both also worked on NYPD Blue. The series attempted to create a setting of a gritty, realistic police station similar to that of NYPD Blue, but differed by focusing on the uniformed police officers rather than the detectives. The pilot of Brooklyn South was noted as the first TV-MA rated episode on broadcast television. Featured Crew Steven Bochco Creator David Milch Creator William M. Finkelstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Tenney Titus Welliver Klea Scott Richard T. Jones Dylan Walsh Full Cast & Crew Last Season Season 1 1997 | 22 Episodes Season 1 of Brooklyn South premiered on September 22, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   1999-09-23 Third Watch 7.5    1991-09-20 Step by Step 6.1    1993-09-21 NYPD Blue 6.5    2010-09-24 Blue Bloods 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords new york police police officer police precinct Content Score 86 Almost there... Top Contributors 11 Banana PS 1 P. Snoopy TB 1 TMDb Bot VM 1 Vaishnav MK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}