{"link": "https://www.themoviedb.org/tv/53594?language=en", "title": "Kotoura-san", "resume": "Haruka, a girl who suffers during her childhood due to her ability  to read people's mind, is starting her high-school life in a new  school. When she transferred in, she feels that her life will be the  same as ever, but then she meets Manabe, a guy who always think about  erotic things, and a club consisting of people who aren't afraid of her  ability. With Manabe and her clubmates around, her gloomy life slowly  start to bloom and enjoyable.", "rate": 60, "genre": ["Comedy", "Drama", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53594   Expand Kotoura-san   (2013) User Score Overview Haruka, a girl who suffers during her childhood due to her ability  to read people's mind, is starting her high-school life in a new  school. When she transferred in, she feels that her life will be the  same as ever, but then she meets Manabe, a guy who always think about  erotic things, and a club consisting of people who aren't afraid of her  ability. With Manabe and her clubmates around, her gloomy life slowly  start to bloom and enjoyable. Featured Crew Masahiko Ohta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Kotoura-san premiered on January 11, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kotoura-san. You can help by rating TV shows you've seen. Facts Original Name  琴浦さん Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.kotourasan.com/ Genres Comedy Drama Animation Keywords anime based on 4-koma Content Score 64 We're so close, yet so far. Top Contributors 9 sp1ti 7 Dreamtaker 5 seboseboss 3 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}