{"link": "https://www.themoviedb.org/tv/33036?language=en", "title": "Memphis Beat", "resume": "Memphis Beat is an American drama series that debuted on TNT on June 22, 2010 and ended on August 16, 2011. Memphis Beat was officially canceled on October 14, 2011.", "rate": 61, "genre": ["Action", "Adventure", "Drama", "Comedy"], "cast": ["Celia Weston", "Alfre Woodard", "Jason Lee", "Abraham Benrubi", "Sam Hennings"], "character": ["Paula Ann Hendricks", "Lieutenant Tanya Rice", "Detective Dwight Hendricks", "Sgt. JC Lightfoot", "Detective Charles 'Whitehead' White"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33036   Expand Memphis Beat   (2010) User Score Overview Memphis Beat is an American drama series that debuted on TNT on June 22, 2010 and ended on August 16, 2011. Memphis Beat was officially canceled on October 14, 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  14 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Celia Weston Paula Ann Hendricks Alfre Woodard Lieutenant Tanya Rice Jason Lee Detective Dwight Hendricks Abraham Benrubi Sgt. JC Lightfoot Sam Hennings Detective Charles 'Whitehead' White Full Cast & Crew Last Season Season 2 2011 | 10 Episodes Season 2 of Memphis Beat premiered on June 14, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Memphis Beat. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  14 Posters  4 Recommendations   2015-01-25 Sons of Liberty 5.7    1998-01-15 Louis Theroux's Weird Weekends 8.5    2011-06-01 Franklin & Bash 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m, 42m Homepage   http://www.tnt.tv/series/memphisbeat/ Genres Action & Adventure Drama Comedy Keywords southern usa tennessee memphis police detective Content Score 86 Almost there... Top Contributors 29 Banana s 3 speedycars w 3 webmaster 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}