{"link": "https://www.themoviedb.org/tv/72277?language=en", "title": "My Lover's Secret", "resume": "Lead character Rei Okumori was in his last year of middle school when he killed his father to protect his mother from domestic violence. Rei and his mother Shoko buried the corpse in the yard, dumped the father's favorite car in the ocean, and staged everything to look like a missing person case. Just like that, Rei's crime became a \"secret\" between only him and his mother. He decides he doesn't need any friends or a girlfriend and lives under the radar without forming deep relationships with anyone.\nRei works tirelessly to become a lawyer--a dream that is the only meaning he finds in life. Shoko blames herself for being the reason her son has to bear a heavy burden for life and wishes from the bottom of her heart that he will be happy.\nEight years after the murder, Rei meets Sawa Tachibana, an innocent girl who attends the same law school and dreams of becoming a prosecutor. Sawa is a flash of light that enters the darkness in which Rei has walked all these years. They fall in love and Rei obliges his mother and girlfriend's wish that they get married. Just when Rei and Sawa decide to get married, someone who knows the \"secret\" begins to send eerie messages.", "rate": 0, "genre": ["Drama", "Mystery"], "cast": ["Sota Fukushi", "Haruna Kawaguchi", "Honami Suzuki", "Keisuke Horibe", "Ken'ichi Endô"], "character": ["Rei Okumori", "Sawa Tachibana", "Akiko Okumori", "Kosuke Okumori", "Hiroaki Tachibana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72277   Expand My Lover's Secret   (2017) User Score Overview Lead character Rei Okumori was in his last year of middle school when he killed his father to protect his mother from domestic violence. Rei and his mother Shoko buried the corpse in the yard, dumped the father's favorite car in the ocean, and staged everything to look like a missing person case. Just like that, Rei's crime became a \"secret\" between only him and his mother. He decides he doesn't need any friends or a girlfriend and lives under the radar without forming deep relationships with anyone. Rei works tirelessly to become a lawyer--a dream that is the only meaning he finds in life. Shoko blames herself for being the reason her son has to bear a heavy burden for life and wishes from the bottom of her heart that he will be happy. Eight years after the murder, Rei meets Sawa Tachibana, an innocent girl who attends the same law school and dreams of becoming a prosecutor. Sawa is a flash of light that enters the darkness in which Rei has walked all these years. They fall in love and Rei obliges his mother and girlfriend's wish that they get married. Just when Rei and Sawa decide to get married, someone who knows the \"secret\" begins to send eerie messages. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sota Fukushi Rei Okumori Haruna Kawaguchi Sawa Tachibana Honami Suzuki Akiko Okumori Keisuke Horibe Kosuke Okumori Ken'ichi Endô Hiroaki Tachibana Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of My Lover's Secret premiered on July 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on My Lover's Secret. You can help by rating TV shows you've seen. Facts Original Name  愛してたって、秘密はある Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.ntv.co.jp/aishitetatte/ Genres Drama Mystery Keywords japan Content Score 86 Almost there... Top Contributors M 31 Maria180493 24 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}