{"link": "https://www.themoviedb.org/tv/8068?language=en", "title": "Shaka Zulu", "resume": "Shaka Zulu is a 1986 television serial directed by William C. Faure and written by Joshua Sinclair for the South African Broadcasting Corporation. It is based on the story of Shaka, king of the Zulu nation from 1816 to 1828, and the writings of the British traders who dealt with him. It aired in the U.S. in syndication. Harmony Gold USA partly funded Shaka Zulu in spite of economic sanctions. The series consisted of 10 episodes approximately 50 minutes each in length. The series was based on Sinclair's novel of the same name.", "rate": 63, "genre": ["Drama"], "cast": ["Robert Powell", "Gordon Jackson", "Kenneth Griffith", "Edward Fox", "Christopher Lee"], "character": ["Dr. Henry Fynn", "Prof. Bramston", "Zacharias Abrahams", "Lt. Francis Farewell", "Lord Bathurst"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8068   Expand Shaka Zulu   (1986) User Score Overview Shaka Zulu is a 1986 television serial directed by William C. Faure and written by Joshua Sinclair for the South African Broadcasting Corporation. It is based on the story of Shaka, king of the Zulu nation from 1816 to 1828, and the writings of the British traders who dealt with him. It aired in the U.S. in syndication. Harmony Gold USA partly funded Shaka Zulu in spite of economic sanctions. The series consisted of 10 episodes approximately 50 minutes each in length. The series was based on Sinclair's novel of the same name. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Robert Powell Dr. Henry Fynn Gordon Jackson Prof. Bramston Kenneth Griffith Zacharias Abrahams Edward Fox Lt. Francis Farewell Christopher Lee Lord Bathurst Full Cast & Crew Last Season Season 1 1986 | 11 Episodes Season 1 of Shaka Zulu premiered on October 24, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   1997-09-25 Veronica's Closet 3.8    1964-09-19 Flipper 4.6  Facts Status  Ended Network TV1 Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Drama Keywords africa chief tribe rise and fall miniseries camp zulu Content Score 93 Almost there... Top Contributors TB 30 TMDb Bot w 3 webmaster s 3 speedycars 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}