{"link": "https://www.themoviedb.org/tv/45624?language=en", "title": "Swallow the Sun", "resume": "Jung-woo was abandoned by his birth parents when he was a baby and became friends with Soo-hyun, who became his sweetheart. After rescuing Chairman Jang, he is adopted by him and becomes a bodyguard to the chairman’s son. Jung-woo is reunited with Soo-hyun at Tae-hyuk’s school but even though Soo-hyun loves him, she chooses Tae-hyuk who offers to help her achieve her dream career. So both Tae-hyuk and Soo-hyun go to USA for their studies. Jung-woo is eventually betrayed by Chairman Jang but he is called to Las Vegas by Jackson Lee, a military buddy, who offers him an opportunity to rebuild his life. In Las Vegas, Jung-woo meets Soo-hyun and Tae-hyuk by coincidence. In his line of work as a private bodyguard, Jung-woo saves the life of the king of a small African nation and is asked by the king to rescue his son from the rebels in return for rights to a diamond mine. So Jung-woo heads to Africa, risking his life to claim the mine. Meanwhile, Tae-hyuk and Soo-hyun return to Seogwipo city on Jeju island at Chairman Jang’s request. Tae-hyuk is put in charge of managing a hotel there while Soo-hyun becomes the head of event planning. After gaining control of the diamond mine in African, Jung-woo returns to Jeju and engages in a struggle against chairman Jang and Tae-hyuk… He learns a shocking secret that shakes the foundation of his very existence.", "rate": 70, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ji Sung", "Sung Yu-ri", "Lee Wan", "Jun Kwang-ryul", "So Yi-hyun"], "character": ["Kim Jung-wo", "Lee Soo-hyun", "Jang Tae-hyuk", "Jang Min-ho / Kim Il-hwan", "Yoo Mi-ran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45624   Expand Swallow the Sun   (2009) User Score Overview Jung-woo was abandoned by his birth parents when he was a baby and became friends with Soo-hyun, who became his sweetheart. After rescuing Chairman Jang, he is adopted by him and becomes a bodyguard to the chairman’s son. Jung-woo is reunited with Soo-hyun at Tae-hyuk’s school but even though Soo-hyun loves him, she chooses Tae-hyuk who offers to help her achieve her dream career. So both Tae-hyuk and Soo-hyun go to USA for their studies. Jung-woo is eventually betrayed by Chairman Jang but he is called to Las Vegas by Jackson Lee, a military buddy, who offers him an opportunity to rebuild his life. In Las Vegas, Jung-woo meets Soo-hyun and Tae-hyuk by coincidence. In his line of work as a private bodyguard, Jung-woo saves the life of the king of a small African nation and is asked by the king to rescue his son from the rebels in return for rights to a diamond mine. So Jung-woo heads to Africa, risking his life to claim the mine. Meanwhile, Tae-hyuk and Soo-hyun return to Seogwipo city on Jeju island at Chairman Jang’s request. Tae-hyuk is put in charge of managing a hotel there while Soo-hyun becomes the head of event planning. After gaining control of the diamond mine in African, Jung-woo returns to Jeju and engages in a struggle against chairman Jang and Tae-hyuk… He learns a shocking secret that shakes the foundation of his very existence. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Sung Kim Jung-wo Sung Yu-ri Lee Soo-hyun Lee Wan Jang Tae-hyuk Jun Kwang-ryul Jang Min-ho / Kim Il-hwan So Yi-hyun Yoo Mi-ran Full Cast & Crew Last Season Season 1 2009 | 25 Episodes Season 1 of Swallow the Sun premiered on July  9, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Swallow the Sun. You can help by rating TV shows you've seen. Facts Original Name  태양을 삼켜라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/sol Genres Action & Adventure Drama Keywords korea Content Score 86 Almost there... Top Contributors N 18 Nightowl.Kr M 17 Maria180493 CM 8 Cherche Moi 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}