{"link": "https://www.themoviedb.org/tv/2910?language=en", "title": "Big Shots", "resume": "Four friends are at the top of their game...until the women in their lives enter the room. Lines between boardroom and bedroom blur when these competitive but dysfunctional CEOs take refuge in their friendship, discussing business, confiding secrets, seeking advice and supporting each other through life's surprising twists and turns.", "rate": 80, "genre": ["Drama"], "cast": ["Dylan McDermott", "Christopher Titus", "Joshua Malina", "Paige Turco", "Michael Vartan"], "character": ["Duncan Collinsworth", "Brody Johns", "Karl Mixworthy", "Lisbeth", "James Walker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2910   Expand Big Shots   (2007) User Score  Play Trailer Overview Four friends are at the top of their game...until the women in their lives enter the room. Lines between boardroom and bedroom blur when these competitive but dysfunctional CEOs take refuge in their friendship, discussing business, confiding secrets, seeking advice and supporting each other through life's surprising twists and turns. Featured Crew Jon Harmon Feldman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dylan McDermott Duncan Collinsworth Christopher Titus Brody Johns Joshua Malina Karl Mixworthy Paige Turco Lisbeth Michael Vartan James Walker Full Cast & Crew Last Season Season 1 2007 | 11 Episodes Season 1 of Big Shots premiered on September 27, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Big Shots. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/primetime/bigshots/index Genres Drama Keywords business wealthy ceo Content Score 100 Yes! Looking good! Top Contributors 11 Banana R 6 Rebecca z 4 zurman1 w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}