{"link": "https://www.themoviedb.org/tv/33862?language=en", "title": "To the Ends of the Earth", "resume": "From Nobel Laureate William Golding's (Lord of the Flies) epic sea-voyage trilogy comes the story of an ambitious British aristocrat, humbled by the lives of his fellow passengers, as he embarks on an ocean voyage for Australia where he is to be an official in the colonial government.", "rate": 59, "genre": ["Drama"], "cast": ["Sam Neill", "Benedict Cumberbatch", "Victoria Hamilton", "Daniel Evans", "Jared Harris"], "character": ["Mr. Prettiman", "Edmund Talbot", "Miss Granham", "Parson Colley", "Captain Anderson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33862   Expand To the Ends of the Earth   (2005) User Score  Play Trailer Overview From Nobel Laureate William Golding's (Lord of the Flies) epic sea-voyage trilogy comes the story of an ambitious British aristocrat, humbled by the lives of his fellow passengers, as he embarks on an ocean voyage for Australia where he is to be an official in the colonial government. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Neill Mr. Prettiman Benedict Cumberbatch Edmund Talbot Victoria Hamilton Miss Granham Daniel Evans Parson Colley Jared Harris Captain Anderson Full Cast & Crew Last Season Season 1 2005 | 3 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for To the Ends of the Earth. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  0 Posters  3 Recommendations   2004-11-11 Blackpool 7.8    2005-03-23 Casanova 7.3    2012-08-24 Parade's End 6.7    2014-10-02 Gracepoint 6.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords australia miniseries sea voyage Content Score 79 Pump it up! We're close now. Top Contributors 25 rudely_murray TB 15 TMDb Bot 13 Steve 4 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}