{"link": "https://www.themoviedb.org/tv/2147?language=en", "title": "The Torkelsons", "resume": "The Torkelsons is an American sitcom which aired on the NBC television network from September 21, 1991 to June 6, 1993. Produced by Walt Disney Television, the series starred Connie Ray, Olivia Burnette and William Schallert. For the second season, the series was retooled and renamed Almost Home. The series lasted a total of two seasons, consisting of 33 episodes.", "rate": 85, "genre": ["Comedy"], "cast": ["Lee Norris", "Olivia Burnette", "Connie Ray", "Brittany Murphy"], "character": ["Molly Morgan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2147   Expand The Torkelsons   (1991) User Score Overview The Torkelsons is an American sitcom which aired on the NBC television network from September 21, 1991 to June 6, 1993. Produced by Walt Disney Television, the series starred Connie Ray, Olivia Burnette and William Schallert. For the second season, the series was retooled and renamed Almost Home. The series lasted a total of two seasons, consisting of 33 episodes. Featured Crew Lynn Montgomery Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Norris Olivia Burnette Connie Ray Brittany Murphy Molly Morgan Full Cast & Crew Last Season Season 2 1993 | 13 Episodes Season 2 of The Torkelsons premiered on February  6, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Torkelsons. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords big family suburb single mother sitcom Content Score 79 Pump it up! We're close now. Top Contributors 17 Banana T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}