{"link": "https://www.themoviedb.org/tv/13841?language=en", "title": "Noble House", "resume": "Noble House is an American television miniseries that was produced and broadcast by NBC in 1988. Based upon the novel Noble House by James Clavell, it features a large cast headlined by Pierce Brosnan as business tycoon Ian Dunross and was directed by Gary Nelson. However, due to time restrictions, several of the many subplots from the book were removed.\nThis is NBC's second miniseries adaptation of a Clavell novel, the first being 1980's Shōgun. Both take place in the same fictional universe with Noble House featuring connections to Shōgun and another Clavell work, Tai-Pan.\nFor the miniseries, the timeframe of the novel was changed; Clavell's original novel takes place in the early 1960s, but the miniseries was updated to the 1980s. The building prominently displayed and used as Struan's is Jardine House.", "rate": 61, "genre": ["Drama"], "cast": ["Pierce Brosnan", "John Rhys-Davies", "Ben Masters", "Deborah Raffin", "Nancy Kwan"], "character": ["Ian Dunross", "Quillan Gornt", "Linc Bartlett", "Casey Tcholok", "Claudia Chen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13841   Expand Noble House   (1988) User Score Overview Noble House is an American television miniseries that was produced and broadcast by NBC in 1988. Based upon the novel Noble House by James Clavell, it features a large cast headlined by Pierce Brosnan as business tycoon Ian Dunross and was directed by Gary Nelson. However, due to time restrictions, several of the many subplots from the book were removed. This is NBC's second miniseries adaptation of a Clavell novel, the first being 1980's Shōgun. Both take place in the same fictional universe with Noble House featuring connections to Shōgun and another Clavell work, Tai-Pan. For the miniseries, the timeframe of the novel was changed; Clavell's original novel takes place in the early 1960s, but the miniseries was updated to the 1980s. The building prominently displayed and used as Struan's is Jardine House. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierce Brosnan Ian Dunross John Rhys-Davies Quillan Gornt Ben Masters Linc Bartlett Deborah Raffin Casey Tcholok Nancy Kwan Claudia Chen Full Cast & Crew Last Season Season 1 1988 | 4 Episodes Season 1 of Noble House premiered on February 21, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1988-11-13 War and Remembrance 7.8    1983-02-06 The Winds of War 7.0    1980-09-15 Shogun 7.5    1978-04-16 Holocaust 7.6    1988-10-11 Jack the Ripper 7.1    1979-09-10 Tinker Tailor Soldier Spy 7.7    1984-12-25 Fanny and Alexander 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  360m Homepage  - Genres Drama Keywords china miniseries british colonial business tycoon Content Score 86 Almost there... Top Contributors TB 24 TMDb Bot 6 Banana w 3 webmaster M 2 Maximilian2000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}