{"link": "https://www.themoviedb.org/tv/47640?language=en", "title": "The Strain", "resume": "A high concept thriller that tells the story of Dr. Ephraim Goodweather, the head of the Center for Disease Control Canary Team in New York City. He and his team are called upon to investigate a mysterious viral outbreak with hallmarks of an ancient and evil strain of vampirism. As the strain spreads, Eph, his team, and an assembly of everyday New Yorkers, wage war for the fate of humanity itself.", "rate": 66, "genre": ["Science", "Fiction", "Drama", "Mystery"], "cast": ["Corey Stoll", "David Bradley", "Kevin Durand", "Jonathan Hyde", "Richard Sammel"], "character": ["Dr. Ephraim Goodweather", "Professor Abraham Setrakian", "Vasiliy Fet", "Eldritch Palmer", "Thomas Eichorst"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47640   Expand The Strain   (2014) User Score  Play Trailer Overview A high concept thriller that tells the story of Dr. Ephraim Goodweather, the head of the Center for Disease Control Canary Team in New York City. He and his team are called upon to investigate a mysterious viral outbreak with hallmarks of an ancient and evil strain of vampirism. As the strain spreads, Eph, his team, and an assembly of everyday New Yorkers, wage war for the fate of humanity itself. Featured Crew Guillermo del Toro Creator Carlton Cuse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  0 Images Backdrops  23 Posters  22 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corey Stoll Dr. Ephraim Goodweather David Bradley Professor Abraham Setrakian Kevin Durand Vasiliy Fet Jonathan Hyde Eldritch Palmer Richard Sammel Thomas Eichorst Full Cast & Crew Last Season Season 4 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply Season 1 and 2 were good, Season 3 was watchable ... but holy crap, Season 4 was really terrible. Open 1 by  olliethecat o Oh Dutch....... you let the cat out of the bag!!!!!!!!!  Possible spoilers Open 11 by  Nubyan A good series that is gone .... Open 5 by  larz9 Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  22 Recommendations   2013-09-16 Sleepy Hollow 6.4    2014-01-10 Helix 6.4    2014-05-11 Penny Dreadful 7.4    2013-06-24 Under the Dome 6.2    2015-05-14 Wayward Pines 6.5    2011-06-19 Falling Skies 6.4    2014-07-09 Extant 6.1    2011-10-05 American Horror Story 7.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  44m, 50m, 57m, 70m, 39m Homepage   http://www.fxnetworks.com/thestrain Genres Science Fiction Drama Mystery Keywords outbreak survival disease vampirism virus Content Score 100 Yes! Looking good! Top Contributors 88 Elizabeth Jennings 41 Travis Bell 22 Claudio Sanhueza 20 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}