{"link": "https://www.themoviedb.org/tv/76530?language=en", "title": "Price Of Passion", "resume": "Ferhat is a hitman working for his criminal uncle. Aslı is a young and idealistic doctor. One day, their roads crossed in the most unexpected way, Aslı is forced to operate on a man that Ferhat had shot. Then, Aslı had to marry with Ferhat to save her life. In the world of corrupt relationships and ambition of power, this two opposite people will get along through time and get closer to each other. However, Ferhat’s lifestyle is too dark to live an innocent love story. Wİll Ferhat and Aslı live happily ever after against all dangers waiting for them?", "rate": 70, "genre": ["Drama", "Action", "Adventure"], "cast": ["Ibrahim Celikkol", "Birce Akalay", "Muhammet Uzuner", "Arzu Gamze Kılınç", "Ece Dizdar"], "character": ["Ferhat Aslan", "Aslı Çınar", "Namık Emirhan", "Yeter Aslan", "İdil Yaman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76530   Expand Price Of Passion   (2017) User Score Overview Ferhat is a hitman working for his criminal uncle. Aslı is a young and idealistic doctor. One day, their roads crossed in the most unexpected way, Aslı is forced to operate on a man that Ferhat had shot. Then, Aslı had to marry with Ferhat to save her life. In the world of corrupt relationships and ambition of power, this two opposite people will get along through time and get closer to each other. However, Ferhat’s lifestyle is too dark to live an innocent love story. Wİll Ferhat and Aslı live happily ever after against all dangers waiting for them? Featured Crew Eylem Canpolat Creator Sema Ergenekon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ibrahim Celikkol Ferhat Aslan Birce Akalay Aslı Çınar Muhammet Uzuner Namık Emirhan Arzu Gamze Kılınç Yeter Aslan Ece Dizdar İdil Yaman Full Cast & Crew Current Season Season 1 2017 | 19 Episodes Season 1 of Price Of Passion premiered on October 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Price Of Passion. You can help by rating TV shows you've seen. Facts Original Name  Siyah Beyaz Aşk Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   https://www.kanald.com.tr/siyah-beyaz-ask/ Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 36 İlkiny 33 purplelammashta 2 Elizabeth Jennings 1 moviefars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}