{"link": "https://www.themoviedb.org/tv/68502?language=en", "title": "Little Women: Dallas", "resume": "Follow the adventures of a group of young, vibrant little women living in Dallas. People often stare, but it's not because they're little, it's because they can command a room. The show centers around the ladies' real lives and features true tension and tenderness between a group of loyal - and sometimes disloyal - friends.", "rate": 70, "genre": ["Reality"], "cast": ["Asta Young", "Amanda Loy", "Tiffani Chance", "Caylea Woodbury", "Bri Barlup"], "character": ["Herself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68502   Expand Little Women: Dallas   (2016) User Score Overview Follow the adventures of a group of young, vibrant little women living in Dallas. People often stare, but it's not because they're little, it's because they can command a room. The show centers around the ladies' real lives and features true tension and tenderness between a group of loyal - and sometimes disloyal - friends. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Asta Young Herself Amanda Loy Herself Tiffani Chance Herself Caylea Woodbury Herself Bri Barlup Herself Full Cast & Crew Current Season Season 2 2017 | 11 Episodes Season 2 of Little Women: Dallas premiered on October  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Little Women: Dallas. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  42m Homepage   http://www.mylifetime.com/shows/little-women-dallas Genres Reality Keywords women dallas little people Content Score 86 Almost there... Top Contributors 29 Elizabeth Jennings 28 Banana DM 7 Derex Murder Ⓞ 5 Ⓞcim™  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}