{"link": "https://www.themoviedb.org/tv/65165?language=en", "title": "Shark", "resume": "A major wildlife series on the sharks of the world with over thirty species filmed, showing how they hunt, intricate social lives, courtship, growing up and the threats they face.", "rate": 85, "genre": ["Documentary"], "cast": ["Helena Holmes", "Paul McGann"], "character": ["Scuba diver", "Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65165   Expand Shark   (2015) User Score Overview A major wildlife series on the sharks of the world with over thirty species filmed, showing how they hunt, intricate social lives, courtship, growing up and the threats they face. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Helena Holmes Scuba diver Paul McGann Himself - Narrator Full Cast & Crew Last Season Miniseries 2015 | 3 Episodes Season 1 of Shark premiered on May  6, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Shark. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Shark. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification NR Meaning No rating information Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p02n7s0d Genres Documentary Keywords ocean shark nature nature documentary Content Score 56 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings TB 18 TMDb Bot a 14 archambeaud H 5 H@w-to-kiLL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}