{"link": "https://www.themoviedb.org/tv/61499?language=en", "title": "Marry Me", "resume": "Six years ago, Annie and Jake bonded over their mutual love of nachos and they've been inseparable ever since. Now, after returning from a romantic two-week island vacation, Jake’s all set to pop the question. Before he can ask, though, Annie lets loose on Jake for his inability to commit. She was expecting him to “put a ring on it” in paradise and now Jake’s perfect proposal is ruined. Not wanting to spend the next 60 years talking about that mess of a proposal, Jake and Annie decide to hold off on the engagement until they can do it right. Yet if history tells us anything, it’s when we really want things to go right that they all tend to go wrong. The only thing we know for sure is these two are destined to be together whether they can get it together or not.", "rate": 59, "genre": ["Comedy"], "cast": ["Casey Wilson", "Ken Marino", "John Gemberling", "Sarah Wright", "Tymberlee Hill"], "character": ["Annie", "Jake", "Gil", "Dennah", "Kay"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61499   Expand Marry Me   (2014) User Score  Play Trailer Overview Six years ago, Annie and Jake bonded over their mutual love of nachos and they've been inseparable ever since. Now, after returning from a romantic two-week island vacation, Jake’s all set to pop the question. Before he can ask, though, Annie lets loose on Jake for his inability to commit. She was expecting him to “put a ring on it” in paradise and now Jake’s perfect proposal is ruined. Not wanting to spend the next 60 years talking about that mess of a proposal, Jake and Annie decide to hold off on the engagement until they can do it right. Yet if history tells us anything, it’s when we really want things to go right that they all tend to go wrong. The only thing we know for sure is these two are destined to be together whether they can get it together or not. Featured Crew David Caspe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Wilson Annie Ken Marino Jake John Gemberling Gil Sarah Wright Dennah Tymberlee Hill Kay Full Cast & Crew Last Season Season 1 2014 | 18 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Marry Me. You can help by rating TV shows you've seen. Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nbc.com/marry-me Genres Comedy Keywords friendship female protagonist group of friends lgbt marriage engagement interracial couple Content Score 100 Yes! Looking good! Top Contributors 30 CouchTater 26 Elizabeth Jennings k 13 khedron h 3 heisenbeerg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}