{"link": "https://www.themoviedb.org/tv/8100?language=en", "title": "Spender", "resume": "Jimmy Nail plays tough cop Spender, forced to return to his native Newcastle after a failed undercover operation in London. He uses tough and unconventional methods to tackle the criminal underworld, but he must also deal with the friends, enemies and family he left behind, and never expected to return to. Sammy Johnson played Spender's sidekick Stick, while Denise Welch played Spender's wife.", "rate": 80, "genre": ["Drama"], "cast": ["Jimmy Nail", "Sammy Johnson", "Berwick Kaler", "Denise Welch", "Tony McAnaney"], "character": ["Spender", "Stick", "DS Dan Boyd", "Frances Spender", "Keith Moreland"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8100   Expand Spender   (1991) User Score Overview Jimmy Nail plays tough cop Spender, forced to return to his native Newcastle after a failed undercover operation in London. He uses tough and unconventional methods to tackle the criminal underworld, but he must also deal with the friends, enemies and family he left behind, and never expected to return to. Sammy Johnson played Spender's sidekick Stick, while Denise Welch played Spender's wife. Featured Crew Ian La Frenais Creator Jimmy Nail Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Nail Spender Sammy Johnson Stick Berwick Kaler DS Dan Boyd Denise Welch Frances Spender Tony McAnaney Keith Moreland Full Cast & Crew Last Season Season 3 1993 | 7 Episodes Season 3 of Spender premiered on January  5, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Spender. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords northern england detective newcastle upon tyne Content Score 93 Almost there... Top Contributors 13 Markxist O 6 Ozbourne R 3 Rebecca 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}