{"link": "https://www.themoviedb.org/tv/60844?language=en", "title": "Baby Steps", "resume": "Eiichirō Maruo (nicknamed \"Ei-chan\" for his grades being straight \"A\") is an honor student, bookworm, and is not interested in anything other than studying. In order to solve his problem of lacking physical strength, he enrolled a tennis school and soon found the fascinating side of tennis. Being a tennis newbie lacking physical strength, he supplement his shortcomings with his excellent observing and analyzing skills.", "rate": 85, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60844   Expand Baby Steps   (2014) User Score Overview Eiichirō Maruo (nicknamed \"Ei-chan\" for his grades being straight \"A\") is an honor student, bookworm, and is not interested in anything other than studying. In order to solve his problem of lacking physical strength, he enrolled a tennis school and soon found the fascinating side of tennis. Being a tennis newbie lacking physical strength, he supplement his shortcomings with his excellent observing and analyzing skills. Featured Crew Masahiko Murata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 25 Episodes Season 1 of Baby Steps premiered on April  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Baby Steps. You can help by rating TV shows you've seen. Facts Original Name  ベイビーステップ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords tennis anime Content Score 64 We're so close, yet so far. Top Contributors 30 benf45 M 18 Migi 6 Elizabeth Jennings 4 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}