{"link": "https://www.themoviedb.org/tv/10980?language=en", "title": "Have Gun – Will Travel", "resume": "Have Gun – Will Travel is an American Western television series that aired on CBS from 1957 through 1963. It was rated number three or number four in the Nielsen ratings every year of its first four seasons. It was one of the few television shows to spawn a successful radio version. The radio series debuted November 23, 1958.\nThe television show is presently shown on the Encore-Western channel.\nHave Gun – Will Travel was created by Sam Rolfe and Herb Meadow and produced by Frank Pierson, Don Ingalls, Robert Sparks, and Julian Claman. There were 225 episodes of the TV series, 24 written by Gene Roddenberry. Other contributors included Bruce Geller, Harry Julian Fink, Don Brinkley and Irving Wallace. Andrew McLaglen directed 101 episodes and 19 were directed by series star Richard Boone.", "rate": 83, "genre": ["Western", "Action", "Adventure"], "cast": ["Richard Boone"], "character": ["Paladin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10980   Expand Have Gun – Will Travel   (1957) User Score Overview Have Gun – Will Travel is an American Western television series that aired on CBS from 1957 through 1963. It was rated number three or number four in the Nielsen ratings every year of its first four seasons. It was one of the few television shows to spawn a successful radio version. The radio series debuted November 23, 1958. The television show is presently shown on the Encore-Western channel. Have Gun – Will Travel was created by Sam Rolfe and Herb Meadow and produced by Frank Pierson, Don Ingalls, Robert Sparks, and Julian Claman. There were 225 episodes of the TV series, 24 written by Gene Roddenberry. Other contributors included Bruce Geller, Harry Julian Fink, Don Brinkley and Irving Wallace. Andrew McLaglen directed 101 episodes and 19 were directed by series star Richard Boone. Featured Crew Herb Meadow Creator Sam Rolfe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Boone Paladin Full Cast & Crew Last Season Season 6 1962 | 32 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply T So I was watching Maverick Open 2 by  Moon Doggie \"A Proof of Love\" episode (1961) Open 0 by PT 100\n      \n     'The Brothers' episode is derivative of 'Revenge' episode Open 1 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   1968-09-24 The Mod Squad 6.3    1965-01-24 Branded 8.3    1963-09-29 My Favorite Martian 5.4    1965-09-14 Please Don't Eat the Daisies 7.0    1966-09-12 Family Affair 5.4    1968-01-09 It Takes a Thief 7.4    1958-09-23 Sea Hunt 6.8    1957-09-18 Wagon Train 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Western Action & Adventure Keywords wild west gunfighter post civil war 19th century Content Score 64 We're so close, yet so far. Top Contributors 21 Banana w 3 webmaster 2 Steve 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}