{"link": "https://www.themoviedb.org/tv/3003?language=en", "title": "The Cramp Twins", "resume": "The Cramp Twins is a British-American animated series created by cartoonist Brian Wood. The show was produced in association with Cartoon Network Europe. It is about Lucien Cramp and Wayne Cramp, not-so identical twins who live with their hygiene-obsessed mother and their Western-obsessed father in the fictional town of Soap City. Wayne and Lucien's personalities clash, and they rarely get along. Wayne has a friend called Dirty Joe, who owns a dump, and neighbour Wendy Winkle has a crush on him, but he hates her. Wayne's and Lucien's teacher is Miss. Hillary Hissy. Lucien's friends include environment-friendly Tony Parsons and Mari and Luke Harrison.\nSeason one premiered in the UK in September 2001 on Cartoon Network and on February 2, 2002 on CBBC on BBC One respectively and has reached high popularity with children. Season one ended on 21 June 2002. A second season premiered in Autumn 2003. Season 2 finished in 2003. Season 3 started in 2004 and ended in 2005. Season 4 began in 2006 and ended that same year but still airing in the UK. The show is currently licensed to Cartoon Network. It also showed in some parts of Africa", "rate": 50, "genre": ["Animation", "Comedy"], "cast": ["Ian James Corlett", "Tom Kenny", "Cathy Weseluck", "Tabitha St. Germain", "Nicole Oliver"], "character": ["Horace Cramp (voice)", "Wayne Cramp (voice)", "Miss Hilary Hissy (voice)", "Mari Phelps (voice)", "Dorothy Cramp (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3003   Expand The Cramp Twins   (2002) User Score Overview The Cramp Twins is a British-American animated series created by cartoonist Brian Wood. The show was produced in association with Cartoon Network Europe. It is about Lucien Cramp and Wayne Cramp, not-so identical twins who live with their hygiene-obsessed mother and their Western-obsessed father in the fictional town of Soap City. Wayne and Lucien's personalities clash, and they rarely get along. Wayne has a friend called Dirty Joe, who owns a dump, and neighbour Wendy Winkle has a crush on him, but he hates her. Wayne's and Lucien's teacher is Miss. Hillary Hissy. Lucien's friends include environment-friendly Tony Parsons and Mari and Luke Harrison. Season one premiered in the UK in September 2001 on Cartoon Network and on February 2, 2002 on CBBC on BBC One respectively and has reached high popularity with children. Season one ended on 21 June 2002. A second season premiered in Autumn 2003. Season 2 finished in 2003. Season 3 started in 2004 and ended in 2005. Season 4 began in 2006 and ended that same year but still airing in the UK. The show is currently licensed to Cartoon Network. It also showed in some parts of Africa Featured Crew Brian Wood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian James Corlett Horace Cramp (voice) Tom Kenny Wayne Cramp (voice) Cathy Weseluck Miss Hilary Hissy (voice) Tabitha St. Germain Mari Phelps (voice) Nicole Oliver Dorothy Cramp (voice) Full Cast & Crew Last Season Season 4 2006 | 6 Episodes Season 4 of The Cramp Twins premiered on July  8, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2002-12-06 Codename: Kids Next Door 6.5    1997-09-16 Cow and Chicken 6.4    1998-11-18 The Powerpuff Girls 7.0    1999-11-12 Courage the Cowardly Dog 7.6    1996-04-28 Dexter's Laboratory 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors L 21 Leah p 6 przemotco 3 Elizabeth Jennings w 3 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}