{"link": "https://www.themoviedb.org/tv/30191?language=en", "title": "The Outsider", "resume": "The Outsider was the story of David Ross, a go-it-alone private investigator who's always where the action is. Darren McGavin played Ross, a man living in an off-beat, always-dangerous world. The series aired for one season on NBC and was a precursor of sorts to The Rockford Files in that it featured a loner private detective who had previously done time in prison for a crime he didn't commit and who never quite fit into a rapidly changing environment.", "rate": 0, "genre": ["Drama"], "cast": ["Darren McGavin"], "character": ["David Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30191   Expand The Outsider   (1968) User Score Overview The Outsider was the story of David Ross, a go-it-alone private investigator who's always where the action is. Darren McGavin played Ross, a man living in an off-beat, always-dangerous world. The series aired for one season on NBC and was a precursor of sorts to The Rockford Files in that it featured a loner private detective who had previously done time in prison for a crime he didn't commit and who never quite fit into a rapidly changing environment. Featured Crew Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Darren McGavin David Ross Full Cast & Crew Last Season Season 1 1968 | 26 Episodes Season 1 of The Outsider premiered on September 18, 1968. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Outsider. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords private investigator los angeles ex-con Content Score 64 We're so close, yet so far. Top Contributors 9 Banana 7 Elizabeth Jennings 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}