{"link": "https://www.themoviedb.org/tv/7669?language=en", "title": "Julie Lescaut", "resume": "Julie Lescaut is a French-language police television series. It has been distributed since 1992 on TF1, La Une-RTBF and TSR; the show remains active as of 2010. It details the investigations of detective Julie Lescaut and her team. The show is aired in various other languages, including German, Japanese, Catalan, Persian, and Czech.", "rate": 43, "genre": ["Drama"], "cast": ["Mouss Diouf", "Véronique Genest"], "character": ["Julie Lescaut"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7669   Expand Julie Lescaut   (1992) User Score Overview Julie Lescaut is a French-language police television series. It has been distributed since 1992 on TF1, La Une-RTBF and TSR; the show remains active as of 2010. It details the investigations of detective Julie Lescaut and her team. The show is aired in various other languages, including German, Japanese, Catalan, Persian, and Czech. Featured Crew Alexis Lecaye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mouss Diouf Véronique Genest Julie Lescaut Full Cast & Crew Last Season Season 22 2014 | 4 Episodes Season 22 of Julie Lescaut premiered on February  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Julie Lescaut. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  90m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 34 Simon V. s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}