{"link": "https://www.themoviedb.org/tv/4589?language=en", "title": "Arrested Development", "resume": "The story of a wealthy family that lost everything, and the one son who had no choice but to keep them all together.", "rate": 82, "genre": ["Comedy"], "cast": ["Jason Bateman", "Portia de Rossi", "Will Arnett", "Michael Cera", "Alia Shawkat"], "character": ["Michael Bluth", "Lindsay Bluth Fünke", "Gob Bluth", "George Michael Bluth", "Maeby Fünke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4589   Expand Arrested Development   (2003) User Score  Play Trailer Overview The story of a wealthy family that lost everything, and the one son who had no choice but to keep them all together. Featured Crew Mitchell Hurwitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  8 Images Backdrops  19 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Bateman Michael Bluth Portia de Rossi Lindsay Bluth Fünke Will Arnett Gob Bluth Michael Cera George Michael Bluth Alia Shawkat Maeby Fünke Full Cast & Crew Current Season Season 5 2018 | 8 Episodes View All Seasons Social Reviews  0 Discussions  17 Subject Status Replies Last Reply Is Anyone Watching Season 5 Open 1 by  Benedict Boy Open 0 by shallowhal\n      \n     m My favorite show of all time Open 4 by  rudely_murray Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  15 Recommendations   2005-08-04 It's Always Sunny in Philadelphia 8.2    2009-04-09 Parks and Recreation 7.9    2009-09-17 Community 7.9    2005-03-24 The Office 8.0    2006-10-11 30 Rock 7.1    2001-07-09 The Office 8.1    1989-07-05 Seinfeld 8.2    1999-09-25 Freaks and Geeks 8.2  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   https://www.netflix.com/title/70140358 Genres Comedy Keywords prison narration dysfunctional family sexual humor family relationships mockumentary fake documentary orange county california Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings 24 Travis Bell k 13 khedron 10 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}