{"link": "https://www.themoviedb.org/tv/72977?language=en", "title": "Negotiator", "resume": "Dou Qiao is a genius negotiator who is the star of the US-China Business Council. Male lead Xie Xiaofei also works as a negotiator, but is actually the sole heir of a wealthy Chinese-American corporation who wants nothing to do with the family business. He vents his frustrations on Dou Qiao, though their bickering relationship soon takes a romantic turn. The couple separates after Dou Qiao discovers the Xie Family had a hand in her parents’ deaths, only to meet several years later as negotiators of rival firms.", "rate": 63, "genre": ["Drama"], "cast": ["Yang Mi", "Huang Zitao", "Dylan Kuo", "Nikita Mao", "Zhu Xu Dan"], "character": ["Tong Wei", "Xie Xiao Fei", "Qin Tian Yu", "Xia Shan Shan", "Shang Bi Chen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72977   Expand Negotiator   (2018) User Score Overview Dou Qiao is a genius negotiator who is the star of the US-China Business Council. Male lead Xie Xiaofei also works as a negotiator, but is actually the sole heir of a wealthy Chinese-American corporation who wants nothing to do with the family business. He vents his frustrations on Dou Qiao, though their bickering relationship soon takes a romantic turn. The couple separates after Dou Qiao discovers the Xie Family had a hand in her parents’ deaths, only to meet several years later as negotiators of rival firms. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yang Mi Tong Wei Huang Zitao Xie Xiao Fei Dylan Kuo Qin Tian Yu Nikita Mao Xia Shan Shan Zhu Xu Dan Shang Bi Chen Full Cast & Crew Current Season Season 1 2018 | 41 Episodes Season 1 of Negotiator premiered on February  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Negotiator. You can help by rating TV shows you've seen. Facts Original Name  谈判官 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/5755023795 Genres Drama Keywords china romance Content Score 86 Almost there... Top Contributors M 44 Maria180493 2 Otgoo TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}