{"link": "https://www.themoviedb.org/tv/43288?language=en", "title": "Beck: Mongolian Chop Squad", "resume": "Koyuki Tanaka was feeling the rut, though he’s only a teenager. Between the sheltered and stifling grind of school and the girls that spend their time not noticing him… Every day was just another day of being a total nobody. Enter Ryusuke: a local rock n’ roller haunted by a shady reputation. Together they form Beck, a dynamic band that just might be the salvation of the stagnant music scene. Sure, it’s going to take hard work and obsession to make it, but there’s something special in the sound. If the guys can stay true to their vision, the world awaits. Music can change your life, sometimes against your will. Just remember… When it’s live, anything can happen.", "rate": 79, "genre": ["Animation", "Drama"], "cast": ["Namikawa Daisuke", "Kenji Nojima", "Miho Saiki", "Shintarou Oohata", "Tooru Nara"], "character": ["Yukio Tanaka / Koyuki (voice)", "Taira (voice)", "Maho Minami (voice)", "Chiba (voice)", "Yuji Sakurai (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43288   Expand Beck: Mongolian Chop Squad   (2004) User Score Overview Koyuki Tanaka was feeling the rut, though he’s only a teenager. Between the sheltered and stifling grind of school and the girls that spend their time not noticing him… Every day was just another day of being a total nobody. Enter Ryusuke: a local rock n’ roller haunted by a shady reputation. Together they form Beck, a dynamic band that just might be the salvation of the stagnant music scene. Sure, it’s going to take hard work and obsession to make it, but there’s something special in the sound. If the guys can stay true to their vision, the world awaits. Music can change your life, sometimes against your will. Just remember… When it’s live, anything can happen. Featured Crew Harold Sakuishi Creator Osamu Kobayashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Namikawa Daisuke Yukio Tanaka / Koyuki (voice) Kenji Nojima Taira (voice) Miho Saiki Maho Minami (voice) Shintarou Oohata Chiba (voice) Tooru Nara Yuji Sakurai (voice) Full Cast & Crew Last Season Beck: Mongolian Chop Squad 2004 | 26 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations   2009-04-03 K-ON! 7.5    2003-04-19 Texhnolyze 6.8    2012-04-06 Accel World 7.3    2003-11-03 Great Teacher Onizuka 8.4    2012-10-04 BTOOOM! 6.3    2004-04-03 Danny Phantom 6.5    2007-04-01 Gurren Lagann 7.9    2001-10-10 Hellsing 7.2  Facts Original Name  ベック Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.beck.ne.jp/ Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 24 tmdb983464 A 5 Ammonswhitewater J 5 JohnyB0y 5 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}