{"link": "https://www.themoviedb.org/tv/66958?language=en", "title": "Orange", "resume": "One day, Naho Takamiya receives a letter written to herself from ten years in the future. As Naho reads on, the letter recites the exact events of the day, including the transfer of a new student into her class named Kakeru Naruse. The Naho from ten years later repeatedly states that she has many regrets, and she wants to fix these by making sure the Naho from the past can make the right decisions—especially regarding Kakeru. What's more shocking is that she discovers that ten years later, Kakeru will no longer be with them. Future Naho asks her to watch over him closely.", "rate": 75, "genre": ["Animation", "Drama", "Soap"], "cast": ["Makoto Furukawa", "Kana Hanazawa", "Seiichirou Yamashita", "Kazuyuki Okitsu", "Natsumi Takamori"], "character": ["Hiroto Suwa (voice)", "Naho Takamiya (voice)", "Kakeru Naruse (voice)", "Saku Hagita (voice)", "Azusa Murasaka (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66958   Expand Orange   (2016) User Score  Play Trailer Overview One day, Naho Takamiya receives a letter written to herself from ten years in the future. As Naho reads on, the letter recites the exact events of the day, including the transfer of a new student into her class named Kakeru Naruse. The Naho from ten years later repeatedly states that she has many regrets, and she wants to fix these by making sure the Naho from the past can make the right decisions—especially regarding Kakeru. What's more shocking is that she discovers that ten years later, Kakeru will no longer be with them. Future Naho asks her to watch over him closely. Featured Crew Hiroshi Hamazaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Makoto Furukawa Hiroto Suwa (voice) Kana Hanazawa Naho Takamiya (voice) Seiichirou Yamashita Kakeru Naruse (voice) Kazuyuki Okitsu Saku Hagita (voice) Natsumi Takamori Azusa Murasaka (voice) Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Orange premiered on July  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2016-07-02 ReLIFE 7.0    2016-07-09 Hitori no Shita: The Outcast 6.0    2017-04-04 The Royal Tutor 7.7    2012-10-07 Say \"I love you.\" 7.6    2011-07-08 No. 6 7.5    2016-07-04 The Disastrous Life of Saiki K. 7.5    2016-04-08 Shonen Maid 6.0    2017-01-06 Fuuka 7.3  Facts Original Name  オレンジ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.orange-anime.com/ Genres Animation Drama Soap Keywords romance school shoujo anime Content Score 100 Yes! Looking good! Top Contributors 26 Steinholf 13 karaa z 10 zurman1 8 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}