{"link": "https://www.themoviedb.org/tv/615?language=en", "title": "Futurama", "resume": "The adventures of a late-20th-century New York City pizza delivery boy, Philip J. Fry, who, after being unwittingly cryogenically frozen for one thousand years, finds employment at Planet Express, an interplanetary delivery company in the retro-futuristic 31st century.", "rate": 82, "genre": ["Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Billy West", "John DiMaggio", "Katey Sagal", "Phil LaMarr", "Lauren Tom"], "character": ["Fry / Professor Farnsworth / Zoidberg / Zapp Brannigan (voice)", "Bender (voice)", "Leela (voice)", "Hermes Conrad (voice)", "Amy Wong (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 615   Expand Futurama   (1999) User Score  Play Trailer Overview The adventures of a late-20th-century New York City pizza delivery boy, Philip J. Fry, who, after being unwittingly cryogenically frozen for one thousand years, finds employment at Planet Express, an interplanetary delivery company in the retro-futuristic 31st century. Featured Crew Matt Groening Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  14 Images Backdrops  26 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy West Fry / Professor Farnsworth / Zoidberg / Zapp Brannigan (voice) John DiMaggio Bender (voice) Katey Sagal Leela (voice) Phil LaMarr Hermes Conrad (voice) Lauren Tom Amy Wong (voice) Full Cast & Crew Last Season Original Air Date Original Air Date DVD Order (DVD) Digital Order (Digital) Production Order (Production) Season 7 2012 | 26 Episodes Season 7 of Futurama premiered on June 20, 2012. View All Seasons Social Reviews  0 Discussions  20 Subject Status Replies Last Reply S Fry believes he was a robot Open 1 by  Patrick E. Abe S Lucy Liu in I dated a robot Open 1 by  Patrick E. Abe S Rosewell that ends well Open 1 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  1 Backdrops  26 Posters  7 Recommendations   1997-08-13 South Park 7.8    2001-10-02 Scrubs 7.7    2005-02-06 American Dad! 6.2    1989-12-17 The Simpsons 7.1    1999-01-31 Family Guy 6.5    2000-01-09 Malcolm in the Middle 7.5    2005-09-20 My Name Is Earl 7.2    1997-01-12 King of the Hill 7.1  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.comedycentral.com/shows/futurama Genres Animation Comedy Drama Sci-Fi & Fantasy Keywords future artificial intelligence mutant space travel adult humor parody mad scientist alien social satire spaceship space distant future robot alcoholic adult animation delivery service alien world amazon women space hero strange science time paradox anabiosis blernsball intelligent monkeys Content Score 100 Yes! Looking good! Top Contributors 201 Elizabeth Jennings 139 rtentser r 126 rocman 110 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}