{"link": "https://www.themoviedb.org/tv/12712?language=en", "title": "Jonas", "resume": "Jonas, previously promoted as \"J.O.N.A.S.\", is a Disney Channel Original Series created by Roger S. H. Schulman and Michael Curtis, starring the Jonas Brothers.\nThe brothers appear as the \"Lucas Brothers\", the three members of the fictional band \"JONAS\" who try to live a normal life in the face of stardom. The pilot was filmed in 2007 but because of the 2007–2008 Writers Guild of America strike, the series was put on hold. The original shooting date had been set in January 2008, but was pushed back to September 2008.The series premiered on Disney Channel on May 2, 2009, and became available on demand starting April 25, 2009.\nJONAS is the first Disney Channel Original Series (DCOS) since Phil of the Future not to be filmed before a live studio audience or to have a laugh track. The series was the first on the network premiere on a Saturday night, part of a deliberate strategy by Disney to open up the night to original programming and compete with Nickelodeon's traditional dominance of the evening. The series is set in New Jersey and shot at Hollywood Center Studios.", "rate": 43, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Kevin Jonas", "Joe Jonas", "Nick Jonas", "Chelsea Kane", "Nicole Gale Anderson"], "character": ["Kevin Lucas", "Joe Lucas", "Nick Lucas", "Stella Malone", "Macy Misa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12712   Expand Jonas   (2009) User Score  Play Trailer Overview Jonas, previously promoted as \"J.O.N.A.S.\", is a Disney Channel Original Series created by Roger S. H. Schulman and Michael Curtis, starring the Jonas Brothers. The brothers appear as the \"Lucas Brothers\", the three members of the fictional band \"JONAS\" who try to live a normal life in the face of stardom. The pilot was filmed in 2007 but because of the 2007–2008 Writers Guild of America strike, the series was put on hold. The original shooting date had been set in January 2008, but was pushed back to September 2008.The series premiered on Disney Channel on May 2, 2009, and became available on demand starting April 25, 2009. JONAS is the first Disney Channel Original Series (DCOS) since Phil of the Future not to be filmed before a live studio audience or to have a laugh track. The series was the first on the network premiere on a Saturday night, part of a deliberate strategy by Disney to open up the night to original programming and compete with Nickelodeon's traditional dominance of the evening. The series is set in New Jersey and shot at Hollywood Center Studios. Featured Crew Michael Curtis Creator Roger S.H. Schulman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Jonas Kevin Lucas Joe Jonas Joe Lucas Nick Jonas Nick Lucas Chelsea Kane Stella Malone Nicole Gale Anderson Macy Misa Full Cast & Crew Last Season Season 2 - Jonas L.A. 2010 | 13 Episodes Season 2 of Jonas premiered on June 20, 2010. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Stella: Happy Birthday Chelsea Kane! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jonas. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 25m, 22m Homepage   http://tv.disney.go.com/disneychannel/jonas/index.html Genres Action & Adventure Comedy Keywords teenager music band Content Score 100 Yes! Looking good! Top Contributors i 8 ideald 7 DarkMan 2 Victor 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}