{"link": "https://www.themoviedb.org/tv/7810?language=en", "title": "My Husband's Woman", "resume": "My Husband's Woman is a 2007 South Korean television series starring Kim Hee-ae, Bae Jong-ok, and Kim Sang-joong. It aired on SBS from April 2 to July 19, 2007 on Mondays and Tuesdays at 21:55 for 24 episodes.\nWritten by renowned TV scribe Kim Soo-hyun in her no-nonsense yet provocative style, the TV series explores the intimate and painful ordeal of women on both sides of the story behind an extramarital affair, delving into the minds of the betrayed and the betrayer.\nIt was the second highest-rated Korean drama of 2007, and won Kim Hee-ae the Grand Prize at the 2007 SBS Drama Awards.", "rate": 80, "genre": ["Drama"], "cast": ["Bae Jong-ok"], "character": ["Kim Ji-soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7810   Expand My Husband's Woman   (2007) User Score Overview My Husband's Woman is a 2007 South Korean television series starring Kim Hee-ae, Bae Jong-ok, and Kim Sang-joong. It aired on SBS from April 2 to July 19, 2007 on Mondays and Tuesdays at 21:55 for 24 episodes. Written by renowned TV scribe Kim Soo-hyun in her no-nonsense yet provocative style, the TV series explores the intimate and painful ordeal of women on both sides of the story behind an extramarital affair, delving into the minds of the betrayed and the betrayer. It was the second highest-rated Korean drama of 2007, and won Kim Hee-ae the Grand Prize at the 2007 SBS Drama Awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bae Jong-ok Kim Ji-soo Full Cast & Crew Last Season Season 1 — | 24 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Husband's Woman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors N 13 Nightowl.Kr 4 lareina123 2 Elizabeth Jennings t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}