{"link": "https://www.themoviedb.org/tv/56401?language=en", "title": "King & Maxwell", "resume": "Sean King and Michelle Maxwell aren't your typical pair of private investigators. As discredited Secret Service agents, their unique skills often give them a leg up on suspects and conventional law enforcement. He's charming and always one step ahead of the game; she's a fearless force to be reckoned with. As a team, they're unstoppable.", "rate": 64, "genre": ["Crime", "Drama"], "cast": ["Jon Tenney", "Rebecca Romijn", "Ryan Hurst", "Michael O'Keefe", "Chris Butler"], "character": ["Sean King", "Michelle Maxwell", "Edgar Roy", "Frank Rigby", "Darius Carter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56401   Expand King & Maxwell   (2013) User Score Overview Sean King and Michelle Maxwell aren't your typical pair of private investigators. As discredited Secret Service agents, their unique skills often give them a leg up on suspects and conventional law enforcement. He's charming and always one step ahead of the game; she's a fearless force to be reckoned with. As a team, they're unstoppable. Featured Crew Shane Brennan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Tenney Sean King Rebecca Romijn Michelle Maxwell Ryan Hurst Edgar Roy Michael O'Keefe Frank Rigby Chris Butler Darius Carter Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of King & Maxwell premiered on June 10, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2012-10-04 Hunted 7.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Crime Drama Keywords washington d.c. private investigator private detective detective agency Content Score 93 Almost there... Top Contributors 25 United600 17 Banana L 6 Lemmy_6 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}