{"link": "https://www.themoviedb.org/tv/4015?language=en", "title": "Commander in Chief", "resume": "Commander in Chief is an American drama television series that focused on the fictional administration and family of Mackenzie Allen, the first female President of the United States, who ascends to the post from the Vice Presidency after the death of the sitting President from a sudden cerebral aneurysm.\nThe series began broadcasting on ABC on Tuesday, September 27, 2005, at 9 p.m. Eastern Time, although most countries outside North America began screening the series in mid-2006.\nThe show was #1 on Tuesday nights until FOX's American Idol started in January. The show was also the #1 new show of the season until CBS' Criminal Minds surpassed it. Its major competitor in the 9:00 p.m. timeslot was FOX's House, which aired after American Idol.\nThe series was created by American director Rod Lurie, director of the films The Contender and Deterrence and may have been inspired by The West Wing, a popular political drama on rival NBC.\nThe network replaced Lurie with Steven Bochco as show runner, but declining ratings brought about a hiatus, a timeslot change and ultimately cancellation.", "rate": 71, "genre": ["Drama"], "cast": ["Geena Davis", "Donald Sutherland", "Harry Lennix", "Kyle Secor", "Ever Carradine"], "character": ["Mackenzie Allen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4015   Expand Commander in Chief   (2005) User Score  Play Trailer Overview Commander in Chief is an American drama television series that focused on the fictional administration and family of Mackenzie Allen, the first female President of the United States, who ascends to the post from the Vice Presidency after the death of the sitting President from a sudden cerebral aneurysm. The series began broadcasting on ABC on Tuesday, September 27, 2005, at 9 p.m. Eastern Time, although most countries outside North America began screening the series in mid-2006. The show was #1 on Tuesday nights until FOX's American Idol started in January. The show was also the #1 new show of the season until CBS' Criminal Minds surpassed it. Its major competitor in the 9:00 p.m. timeslot was FOX's House, which aired after American Idol. The series was created by American director Rod Lurie, director of the films The Contender and Deterrence and may have been inspired by The West Wing, a popular political drama on rival NBC. The network replaced Lurie with Steven Bochco as show runner, but declining ratings brought about a hiatus, a timeslot change and ultimately cancellation. Featured Crew Rod Lurie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Geena Davis Mackenzie Allen Donald Sutherland Harry Lennix Kyle Secor Ever Carradine Full Cast & Crew Last Season Season 1 2005 | 18 Episodes Season 1 of Commander in Chief premiered on September 27, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   1995-09-23 JAG 6.6    2014-09-21 Madam Secretary 6.4    2006-09-20 Jericho 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Drama Keywords usa president politics female politician usa politics Content Score 100 Yes! Looking good! Top Contributors 5 Banana z 5 zurman1 5 galani w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}