{"link": "https://www.themoviedb.org/tv/72606?language=en", "title": "Pure Brews America", "resume": "Visit the most wonderful microbreweries and brewpubs and meet the talented people that are the driving force behind the unique and delicious beers being produced. They share with us stories, successes, failures, and maybe even a secret or two about how they make the magic happen.", "rate": 0, "genre": ["Documentary"], "cast": ["Shannon Long"], "character": ["Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72606   Expand Pure Brews America   (2015) User Score Overview Visit the most wonderful microbreweries and brewpubs and meet the talented people that are the driving force behind the unique and delicious beers being produced. They share with us stories, successes, failures, and maybe even a secret or two about how they make the magic happen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shannon Long Herself - Host Full Cast & Crew Last Season Season 3 2017 | 8 Episodes Season 3 of Pure Brews America premiered on July  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pure Brews America. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://purebrewsamerica.com Genres Documentary Keywords beer brewery Content Score 56 We're so close, yet so far. Top Contributors d 31 dshill5 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}