{"link": "https://www.themoviedb.org/tv/66185?language=en", "title": "The Story of God with Morgan Freeman", "resume": "Morgan Freeman presents his quest in order to find how most religions perceive life after death, what different civilizations thought about the act of creation and other big questions that mankind has continuously asked.", "rate": 71, "genre": ["Documentary"], "cast": ["Morgan Freeman"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66185   Expand The Story of God with Morgan Freeman   (2016) User Score  Play Trailer Overview Morgan Freeman presents his quest in order to find how most religions perceive life after death, what different civilizations thought about the act of creation and other big questions that mankind has continuously asked. Featured Crew Morgan Freeman Creator Lori McCreary Creator Frank Kosa Creator Kelly Mendelsohn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morgan Freeman Presenter Full Cast & Crew Last Season Season 2 2017 | 3 Episodes Season 2 of The Story of God with Morgan Freeman premiered on January 16, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Proof Of God Open 0 by Asharah\n      \n     Joan Osborne - What If God Was One Of Us Open 0 by Asharah\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2012-10-01 Roba 7.5    2015-04-20 StarTalk with Neil deGrasse Tyson 6.9    2005-01-11 Auschwitz: The Nazis and the Final Solution 8.4    2012-09-13 Stephen Hawking's Grand Design 7.3    2015-06-19 Killjoys 6.7    2016-09-23 Van Helsing 5.6  Facts Status  Returning Series Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Documentary Original Language  English Runtime  45m Homepage   http://channel.nationalgeographic.com/the-story-of-god-with-morgan-freeman/ Genres Documentary Keywords scientific study religion Content Score 71 Just a little bit more... Top Contributors 29 Goffred0 BD 7 Ben Drury 7 Curacao86 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}