{"link": "https://www.themoviedb.org/tv/64489?language=en", "title": "No Activity", "resume": "No Activity is a unique and hilarious comedy that follows the nightly exploits of our boys and girls in blue, and their shady criminal counterparts, through an unfolding kidnapping investigation.\nTruth is, being a cop or a crook is nowhere near as exciting as Hollywood would have us believe. Long nights with nothing to do but watch and wait, and spin a yarn or two... or, in the case of these over-caffeinated, sleep-deprived souls, share way too much information about themselves, opine on matters far beyond their qualifications, and discuss topics that most would agree are strictly NSFW.", "rate": 80, "genre": ["Comedy"], "cast": ["Patrick Brammall", "Darren Gilshenan", "Harriet Dyer", "Genevieve Morris"], "character": ["Detective Hendy", "Detective Stokes", "April", "Carol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64489   Expand No Activity   (2015) User Score  Play Trailer Overview No Activity is a unique and hilarious comedy that follows the nightly exploits of our boys and girls in blue, and their shady criminal counterparts, through an unfolding kidnapping investigation. Truth is, being a cop or a crook is nowhere near as exciting as Hollywood would have us believe. Long nights with nothing to do but watch and wait, and spin a yarn or two... or, in the case of these over-caffeinated, sleep-deprived souls, share way too much information about themselves, opine on matters far beyond their qualifications, and discuss topics that most would agree are strictly NSFW. Featured Crew Trent O'Donnell Creator Patrick Brammall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Brammall Detective Hendy Darren Gilshenan Detective Stokes Harriet Dyer April Genevieve Morris Carol Full Cast & Crew Last Season Season 2 2016 | 6 Episodes Season 2 of No Activity premiered on October 26, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2016-06-08 Power Monkeys 7.0    2006-01-01 In Justice 6.8    2013-09-05 The Guilty 7.0    2015-04-15 The Delivery Man 6.5    2011-05-02 Case Sensitive 5.4    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.noactivity.com.au/ Genres Comedy Keywords australia police spoof Content Score 100 Yes! Looking good! Top Contributors 27 isavedtheday 20 Elizabeth Jennings 7 United600 _ 4 _Anarchist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}