{"link": "https://www.themoviedb.org/tv/1477?language=en", "title": "Sheep in the Big City", "resume": "Sheep in the Big City is an American animated television series which ran on Cartoon Network for two seasons, from November 17, 2000, to April 7, 2002. The series' pilot first premiered as part of Cartoon Network's \"Cartoon Cartoon Summer\" on August 18, 2000.\nCreated by Mo Willems, the bulk of the show follows a runaway sheep, Sheep, in its new life in \"the Big City\". It also features several unrelated sketches and shorts, similar to The Rocky & Bullwinkle Show. With an emphasis on more \"sophisticated\" humor, using multiple forms of rhetoric from the characters to the plots, it was more popular with older audiences. It was also unusual in featuring many comic references to film-making and television broadcasting.\nAt the time, the premiere of Sheep in the Big City was the highest-rated premiere for a Cartoon Network original series.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Ruth Buzzi", "Stephanie D'Abruzzo", "Fran Brill", "Jerry Nelson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1477   Expand Sheep in the Big City   (2000) User Score Overview Sheep in the Big City is an American animated television series which ran on Cartoon Network for two seasons, from November 17, 2000, to April 7, 2002. The series' pilot first premiered as part of Cartoon Network's \"Cartoon Cartoon Summer\" on August 18, 2000. Created by Mo Willems, the bulk of the show follows a runaway sheep, Sheep, in its new life in \"the Big City\". It also features several unrelated sketches and shorts, similar to The Rocky & Bullwinkle Show. With an emphasis on more \"sophisticated\" humor, using multiple forms of rhetoric from the characters to the plots, it was more popular with older audiences. It was also unusual in featuring many comic references to film-making and television broadcasting. At the time, the premiere of Sheep in the Big City was the highest-rated premiere for a Cartoon Network original series. Featured Crew Mo Willems Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ruth Buzzi Stephanie D'Abruzzo Fran Brill Jerry Nelson Full Cast & Crew Last Season Season 2 2001 | 13 Episodes Season 2 of Sheep in the Big City premiered on December  2, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2001-06-08 Time Squad 6.4    2008-10-03 The Secret Saturdays 3.8    1999-11-12 Mike, Lu & Og 3.3    2005-05-30 The Life and Times of Juniper Lee 4.2    2002-07-12 Whatever Happened to... Robot Jones? 6.5    1996-09-21 Mortal Kombat: Defenders of the Realm 5.0    2005-12-26 My Gym Partner's a Monkey 5.0    2005-07-08 Camp Lazlo 5.6  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 2 TheOneManBoxOffice A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}