{"link": "https://www.themoviedb.org/tv/693?language=en", "title": "Desperate Housewives", "resume": "Desperate Housewives is an American television comedy-drama-mystery series created by Marc Cherry and produced by ABC Studios and Cherry Productions. It aired Sundays at 9 P.M. Eastern/8 P.M. Central, on ABC from October 3, 2004, until May 13, 2012. Executive producer Cherry served as showrunner. Other executive producers since the fourth season included Bob Daily, George W. Perkins, John Pardee, Joey Murphy, David Grossman, and Larry Shaw.\nThe main setting of the show was Wisteria Lane, a street in the fictional American town of 'Fairview' in the fictional 'Eagle State'. The show followed the lives of a group of women as seen through the eyes of a dead neighbor who committed suicide in the very first episode. The storyline covers thirteen years of the women's lives over eight seasons, set between the years 2004–2008, and later 2013–2017. They worked through domestic struggles and family life, while facing the secrets, crimes and mysteries hidden behind the doors of their — at the surface — beautiful and seemingly perfect suburban neighborhood.\nThe show featured an ensemble cast, headed by Teri Hatcher as Susan Mayer, Felicity Huffman as Lynette Scavo, Marcia Cross as Bree Van de Kamp, and Eva Longoria as Gabrielle Solis. Brenda Strong narrated the show as the deceased Mary Alice Young, appearing sporadically in flashbacks or dream sequences.", "rate": 66, "genre": ["Mystery", "Drama", "Comedy"], "cast": ["Felicity Huffman", "Eva Longoria", "Teri Hatcher", "Marcia Cross", "Brenda Strong"], "character": ["Lynette Scavo", "Gabrielle Solis", "Susan Delfino", "Bree Van de Kamp", "Mary Alice Young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 693   Expand Desperate Housewives   (2004) User Score  Play Trailer Overview Desperate Housewives is an American television comedy-drama-mystery series created by Marc Cherry and produced by ABC Studios and Cherry Productions. It aired Sundays at 9 P.M. Eastern/8 P.M. Central, on ABC from October 3, 2004, until May 13, 2012. Executive producer Cherry served as showrunner. Other executive producers since the fourth season included Bob Daily, George W. Perkins, John Pardee, Joey Murphy, David Grossman, and Larry Shaw. The main setting of the show was Wisteria Lane, a street in the fictional American town of 'Fairview' in the fictional 'Eagle State'. The show followed the lives of a group of women as seen through the eyes of a dead neighbor who committed suicide in the very first episode. The storyline covers thirteen years of the women's lives over eight seasons, set between the years 2004–2008, and later 2013–2017. They worked through domestic struggles and family life, while facing the secrets, crimes and mysteries hidden behind the doors of their — at the surface — beautiful and seemingly perfect suburban neighborhood. The show featured an ensemble cast, headed by Teri Hatcher as Susan Mayer, Felicity Huffman as Lynette Scavo, Marcia Cross as Bree Van de Kamp, and Eva Longoria as Gabrielle Solis. Brenda Strong narrated the show as the deceased Mary Alice Young, appearing sporadically in flashbacks or dream sequences. Featured Crew Marc Cherry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  50 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felicity Huffman Lynette Scavo Eva Longoria Gabrielle Solis Teri Hatcher Susan Delfino Marcia Cross Bree Van de Kamp Brenda Strong Mary Alice Young Full Cast & Crew Last Season Season 8 2011 | 23 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Susan & Bree Open 1 by  Melanie w Porter Scavo: Happy Birthday Charlie Carver! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  50 Posters  13 Recommendations   1998-06-06 Sex and the City 5.5    2006-09-28 Ugly Betty 5.5    1994-09-19 ER 6.9    2005-09-23 Ghost Whisperer 5.6    2003-07-22 Nip/Tuck 6.9    2002-09-23 CSI: Miami 5.8    1997-09-08 Ally McBeal 5.9    2006-09-25 Heroes 6.9  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/shows/desperate-housewives Genres Mystery Drama Comedy Keywords secret housewife female friendship neighbor Content Score 100 Yes! Looking good! Top Contributors 114 Banana D 24 Daniel md 14 movie dino S 13 Sergey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}