{"link": "https://www.themoviedb.org/tv/30916?language=en", "title": "Imagination Movers", "resume": "Imagination Movers is a Live-action Pre-school television series that premiered on September 6, 2008 on Disney Channel. The program was originally part of the Playhouse Disney daily block intended for preschoolers. On February 14, 2011, it was moved to the Disney Junior block, serving as Playhouse Disney's replacement.\nThe Imagination Movers TV series is based on the format and music of the New Orleans based music group Imagination Movers who both act and are co-executive-producers of the show.\nOn May 30, 2011, it was announced that the series will end after the remaining episodes of the third season have aired, though the band itself will continue and is open to doing other projects.\nOn November 28, 2011 the Movers ran an announcement on official Facebook page implying that they have been given the green light to air more new episodes of the show in 2012.", "rate": 45, "genre": ["Comedy"], "cast": ["Kath Soucie"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30916   Expand Imagination Movers   (2008) User Score Overview Imagination Movers is a Live-action Pre-school television series that premiered on September 6, 2008 on Disney Channel. The program was originally part of the Playhouse Disney daily block intended for preschoolers. On February 14, 2011, it was moved to the Disney Junior block, serving as Playhouse Disney's replacement. The Imagination Movers TV series is based on the format and music of the New Orleans based music group Imagination Movers who both act and are co-executive-producers of the show. On May 30, 2011, it was announced that the series will end after the remaining episodes of the third season have aired, though the band itself will continue and is open to doing other projects. On November 28, 2011 the Movers ran an announcement on official Facebook page implying that they have been given the green light to air more new episodes of the show in 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kath Soucie Full Cast & Crew Last Season Season 3 2011 | 23 Episodes Season 3 of Imagination Movers premiered on October 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Imagination Movers. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 Alexandre Oliveira 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}