{"link": "https://www.themoviedb.org/tv/18798?language=en", "title": "Waybuloo", "resume": "Waybuloo is a pre-school British and Canadian children's television series originally created by Dan Good and Absolutely Cuckoo. It was commissioned by Michael Carrington at the BBC, and first aired on CBeebies in May 2009. The 100-episode show was Head-Written by Marc Seal, filmed by the Foundation in Glasgow and animated and directed by Gallus Entertainment for Decode Entertainment. Post production, including audio, sound design & editing is done by Platform Post Production. in Toronto. Line produced by Matt Porter and the series producer is Simon Spencer, part of the independent company, RDF Media's subsidiary The Foundation. The program makers describe it as \"...a philosophy for a happy life, and is like nothing children will have ever seen before\".\nWaybuloo is set in the land of Nara. The main characters are the four Piplings, 3D CGI animated creatures with large heads and eyes, placed on a filmed background, with the second half of each twenty-minute show featuring human children.\nThe Piplings practise yogo, a gentle form of exercise similar to yoga. so that the viewers and their parents can participate.\nIt was the second show by DHX Media to use live-action with the CGI animation. The program makers describe it as \"...a philosophy for a happy life, and is like nothing adults will have ever seen before\". In 2012 a new shorter version of Waybuloo was released with narration to much criticism. The negative feedback was so strong, CBeebies decided to pull the show in favor of the original version on the very next night.", "rate": 10, "genre": ["Animation"], "cast": ["Oliver Dillon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18798   Expand Waybuloo   (2009) User Score Overview Waybuloo is a pre-school British and Canadian children's television series originally created by Dan Good and Absolutely Cuckoo. It was commissioned by Michael Carrington at the BBC, and first aired on CBeebies in May 2009. The 100-episode show was Head-Written by Marc Seal, filmed by the Foundation in Glasgow and animated and directed by Gallus Entertainment for Decode Entertainment. Post production, including audio, sound design & editing is done by Platform Post Production. in Toronto. Line produced by Matt Porter and the series producer is Simon Spencer, part of the independent company, RDF Media's subsidiary The Foundation. The program makers describe it as \"...a philosophy for a happy life, and is like nothing children will have ever seen before\". Waybuloo is set in the land of Nara. The main characters are the four Piplings, 3D CGI animated creatures with large heads and eyes, placed on a filmed background, with the second half of each twenty-minute show featuring human children. The Piplings practise yogo, a gentle form of exercise similar to yoga. so that the viewers and their parents can participate. It was the second show by DHX Media to use live-action with the CGI animation. The program makers describe it as \"...a philosophy for a happy life, and is like nothing adults will have ever seen before\". In 2012 a new shorter version of Waybuloo was released with narration to much criticism. The negative feedback was so strong, CBeebies decided to pull the show in favor of the original version on the very next night. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oliver Dillon Full Cast & Crew Last Season Season 3 2011 | 50 Episodes Season 3 of Waybuloo premiered on April  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Waybuloo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  19m, 20m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}