{"link": "https://www.themoviedb.org/tv/66659?language=en", "title": "Backstage", "resume": "A group of “very talented” teenagers sing, dance, and perform their way to the top at the famous Keaton School of the Arts! From the disappointments of failure, to the new friendships and crowning achievements, being a student at Keaton means you're on the path to becoming a star!", "rate": 70, "genre": ["Drama", "Family"], "cast": ["Alyssa Trask", "Aviva Mongillo", "Josh Bogert", "Devyn Nekoda"], "character": ["Carly Catto", "Alya Kendrick", "Miles Lennox", "Vanessa Morita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66659   Expand Backstage   (2016) User Score  Play Trailer Overview A group of “very talented” teenagers sing, dance, and perform their way to the top at the famous Keaton School of the Arts! From the disappointments of failure, to the new friendships and crowning achievements, being a student at Keaton means you're on the path to becoming a star! Featured Crew Lara Azzopardi Creator Jennifer Pertsch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alyssa Trask Carly Catto Aviva Mongillo Alya Kendrick Josh Bogert Miles Lennox Devyn Nekoda Vanessa Morita Full Cast & Crew Last Season Season 2 2017 | 1 Episode Season 2 of Backstage premiered on August 28, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Miles Lennox: Happy Birthday Josh Bogert! Open 0 by wonder2wonder\n      \n     w Bianca: Happy Birthday Julia Tomasone! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Backstage. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  30m, 25m Homepage   http://www.family.ca/shows/backstage/ Genres Drama Family Keywords dance music high school dance dance school Content Score 100 Yes! Looking good! Top Contributors A 25 Alexandria ☂ 15 ☂ 13 Elizabeth Jennings s 2 selajames  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}