{"link": "https://www.themoviedb.org/tv/61171?language=en", "title": "Marriage, Not Dating", "resume": "A romantic comedy about a man who doesn't want to get married and a woman who has no luck in marriage prospect. Gong Ki Tae is a successful bachelor who keeps getting pressured by his family to settle down. He then comes up with a plan to introduce Joo Jang Mi, whom he thinks will never be approved by his family.", "rate": 100, "genre": ["Comedy"], "cast": ["Yeon Woo-jin", "Min Han Groo", "Jung Jin-woon", "Han Sun-hwa", "Heo Jung-min"], "character": ["Gong Ki-tae", "Joo Jang-mi", "Han Yeo-reum", "Kang Se-ah", "Lee Hoon-dong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61171   Expand Marriage, Not Dating   (2014) User Score Overview A romantic comedy about a man who doesn't want to get married and a woman who has no luck in marriage prospect. Gong Ki Tae is a successful bachelor who keeps getting pressured by his family to settle down. He then comes up with a plan to introduce Joo Jang Mi, whom he thinks will never be approved by his family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeon Woo-jin Gong Ki-tae Min Han Groo Joo Jang-mi Jung Jin-woon Han Yeo-reum Han Sun-hwa Kang Se-ah Heo Jung-min Lee Hoon-dong Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Marriage, Not Dating premiered on July  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Marriage, Not Dating. You can help by rating TV shows you've seen. Facts Original Name  연애 말고 결혼 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/marry Genres Comedy Keywords korea Content Score 93 Almost there... Top Contributors M 43 Maria180493 5 part-mozi t 4 tmdb38202327 CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}