{"link": "https://www.themoviedb.org/tv/873?language=en", "title": "Columbo", "resume": "Columbo is a friendly, verbose, disheveled-looking police detective who is consistently underestimated by his suspects. Despite his unprepossessing appearance and apparent absentmindedness, he shrewdly solves all of his cases and secures all evidence needed for indictment. His formidable eye for detail and meticulously dedicated approach often become clear to the killer only late in the storyline.", "rate": 80, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Peter Falk"], "character": ["Columbo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 873   Expand Columbo   (1971) User Score Overview Columbo is a friendly, verbose, disheveled-looking police detective who is consistently underestimated by his suspects. Despite his unprepossessing appearance and apparent absentmindedness, he shrewdly solves all of his cases and secures all evidence needed for indictment. His formidable eye for detail and meticulously dedicated approach often become clear to the killer only late in the storyline. Featured Crew William Link Creator Richard Levinson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  33 Images Backdrops  7 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Falk Columbo Full Cast & Crew Last Season Original Air Date Original Air Date DVD Order (DVD) French DVDs (DVD) Season 13 1995 | 5 Episodes Season 13 of Columbo premiered on November  2, 1995. View All Seasons Social Reviews  0 Discussions  36 Subject Status Replies Last Reply Cancellation Open 1 by  Halberstram Great writing and casting Open 1 by  Notamymerrick S5E6 \"Last Salute to the Commodore\" Open 1 by  Notamymerrick Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  12 Recommendations   1976-03-21 Charlie's Angels 5.9    1984-09-30 Murder, She Wrote 6.5    1981-11-24 Simon & Simon 6.6    1985-09-29 MacGyver 7.3    1982-10-01 Remington Steele 6.9    1989-03-26 Quantum Leap 7.6    1982-09-26 Knight Rider 6.5    1995-09-04 Xena: Warrior Princess 6.7  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  75m, 90m Homepage  - Genres Crime Drama Mystery Keywords cigar cigar smoking murder police detective homicide detective columbo Content Score 64 We're so close, yet so far. Top Contributors 102 Banana 91 Steve N 53 Notamymerrick m 35 miro22  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}