{"link": "https://www.themoviedb.org/tv/72518?language=en", "title": "Saiyuki Reload Blast", "resume": "Humans and yokai, science and magic... all exist side-by-side on a peaceful continent free of all order and regulation, widely known as \"Shangri-La.\" The balance there was shattered when the Minus Wave caused all the yokai on the continent to rampage, an event known as the \"Calamity.\" Continuing their journey west to stop Gyumaoh's resurrection experiments, the root of all the evil on the continent, the Three Aspects are finally drawing closer to India. But the closer they get, the more pronounced the influence of the Calamity becomes, and the more intense their battles become.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72518   Expand Saiyuki Reload Blast   (2017) User Score Overview Humans and yokai, science and magic... all exist side-by-side on a peaceful continent free of all order and regulation, widely known as \"Shangri-La.\" The balance there was shattered when the Minus Wave caused all the yokai on the continent to rampage, an event known as the \"Calamity.\" Continuing their journey west to stop Gyumaoh's resurrection experiments, the root of all the evil on the continent, the Three Aspects are finally drawing closer to India. But the closer they get, the more pronounced the influence of the Calamity becomes, and the more intense their battles become. Featured Crew Kazuya Minekura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Saiyuki Reload Blast. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Saiyuki Reload Blast. You can help by rating TV shows you've seen. Facts Original Name  最遊記RELOAD BLAST Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.saiyuki-rb.jp/ Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords supernatural demon folklore josei Content Score 64 We're so close, yet so far. Top Contributors D 21 Destr0y 12 Elizabeth Jennings 9 sp1ti 7 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}