{"link": "https://www.themoviedb.org/tv/61285?language=en", "title": "James May's Cars of the People", "resume": "Top Gear's James May presents this 3 part series which takes a look at the 'peoples car'. Covering every form of cars for the masses - from the Beetle to the Kei Car, May looks at the many forms of people's car, their origins and their effect on history. Each episode covers a particular theme; these being cars from dictatorships, microcars and the dream cars we aspire to.", "rate": 86, "genre": ["Documentary"], "cast": ["James May"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61285   Expand James May's Cars of the People   (2014) User Score Overview Top Gear's James May presents this 3 part series which takes a look at the 'peoples car'. Covering every form of cars for the masses - from the Beetle to the Kei Car, May looks at the many forms of people's car, their origins and their effect on history. Each episode covers a particular theme; these being cars from dictatorships, microcars and the dream cars we aspire to. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James May Himself - Presenter Full Cast & Crew Last Season Season 2 2016 | 3 Episodes Season 2 of James May's Cars of the People premiered on January 24, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2010-10-31 James May's Man Lab 8.0    2002-10-20 Top Gear 7.5    2016-11-18 The Grand Tour 7.8  Facts Status  Ended Network Certification  - Type  Documentary Original Language  Ukrainian Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b0467lbh Genres Documentary Keywords automobile car Content Score 56 We're so close, yet so far. Top Contributors 15 Elizabeth Jennings 11 Steve Y 7 YRV m 2 morrison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}