{"link": "https://www.themoviedb.org/tv/5439?language=en", "title": "Eurotrash", "resume": "Eurotrash is a 30-minute magazine-format programme in English, presented by Antoine de Caunes and Jean-Paul Gaultier and produced by Rapido Television. It was shown in the United Kingdom on Channel 4 from 1993 and was a late-night comical review of weird and wonderful topics from around the world. The show averaged around a 20 percent audience share, pulling in around 2-3 million viewers each week. Channel 4's Slot Average for Eurotrash's broadcast time is around 900,000 viewers, making the show an important hit for the channel.\nIt ran for 16 series until 2007, making it one of the UK's longest running late-night entertainment shows. Channel 4 infrequently re-runs the series and repeats can be found on the Comedy Central Channel and Livingit, and on 3e in Ireland. Series 1 is also now available on 4oD. After more than 10 years of broadcast, the show built up a substantial following and Eurotrash has around 15 million fans, and various fan sites.\nAll intellectual property rights to the series are now controlled by the production company, Rapido Television.", "rate": 75, "genre": ["Comedy"], "cast": ["Adriana Sklenaříková", "Emily Booth", "Kate Robbins", "Jean Paul Gaultier", "Antoine de Caunes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5439   Expand Eurotrash   (1993) User Score Overview Eurotrash is a 30-minute magazine-format programme in English, presented by Antoine de Caunes and Jean-Paul Gaultier and produced by Rapido Television. It was shown in the United Kingdom on Channel 4 from 1993 and was a late-night comical review of weird and wonderful topics from around the world. The show averaged around a 20 percent audience share, pulling in around 2-3 million viewers each week. Channel 4's Slot Average for Eurotrash's broadcast time is around 900,000 viewers, making the show an important hit for the channel. It ran for 16 series until 2007, making it one of the UK's longest running late-night entertainment shows. Channel 4 infrequently re-runs the series and repeats can be found on the Comedy Central Channel and Livingit, and on 3e in Ireland. Series 1 is also now available on 4oD. After more than 10 years of broadcast, the show built up a substantial following and Eurotrash has around 15 million fans, and various fan sites. All intellectual property rights to the series are now controlled by the production company, Rapido Television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adriana Sklenaříková Emily Booth Kate Robbins Jean Paul Gaultier Antoine de Caunes Full Cast & Crew Last Season Season 2 1994 | 1 Episode Season 2 of Eurotrash premiered on April  8, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Eurotrash. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.channel4.com/eurotrash Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors m 2 martell 1 lineker 1 Naveed  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}