{"link": "https://www.themoviedb.org/tv/38920?language=en", "title": "The Tripods", "resume": "The Tripods is a television adaptation of John Christopher's The Tripods series of novels. It was jointly produced by the BBC in the United Kingdom and the Seven Network in Australia. The music soundtrack was written by Ken Freeman.\nSeries one of The Tripods, broadcast in 1984, which had 13 half-hour episodes written by the well-known author of many radio plays Alick Rowe, covers the first book, The White Mountains; the 12-episode second series covers The City of Gold and Lead. Although a television script had been written for the third series, it never went into production.\nThe first series was released on both VHS and DVD. The BBC released Tripods - The Complete Series 1 & 2 on DVD in March 2009.\nThe series introduced several minor changes from the book, notably the shape of the Masters and Tripods, which have tentacles in the book, gravity inside the Golden City was increased artificially, which is not mentioned in the TV series; the introduction of \"cognoscs\", spiritual life-forms vastly superior to the Masters themselves; and more other main characters, including love interests for both Will and Beanpole. The original texts have few female characters. John Christopher was asked about this for an interview on Wordcandy, replying that at the time of writing the series, it was generally accepted that girls would read books with boy main characters, but not vice versa. He also stated that he felt the addition of an entire family of girls to the TV series was somewhat \"over the top\". The series is also notable for featuring non-humanoid aliens, which was uncommon at the time.", "rate": 75, "genre": [], "cast": ["John Woodvine", "Charlotte Long", "Cindy Shelley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38920   Expand The Tripods   (1984) User Score Overview The Tripods is a television adaptation of John Christopher's The Tripods series of novels. It was jointly produced by the BBC in the United Kingdom and the Seven Network in Australia. The music soundtrack was written by Ken Freeman. Series one of The Tripods, broadcast in 1984, which had 13 half-hour episodes written by the well-known author of many radio plays Alick Rowe, covers the first book, The White Mountains; the 12-episode second series covers The City of Gold and Lead. Although a television script had been written for the third series, it never went into production. The first series was released on both VHS and DVD. The BBC released Tripods - The Complete Series 1 & 2 on DVD in March 2009. The series introduced several minor changes from the book, notably the shape of the Masters and Tripods, which have tentacles in the book, gravity inside the Golden City was increased artificially, which is not mentioned in the TV series; the introduction of \"cognoscs\", spiritual life-forms vastly superior to the Masters themselves; and more other main characters, including love interests for both Will and Beanpole. The original texts have few female characters. John Christopher was asked about this for an interview on Wordcandy, replying that at the time of writing the series, it was generally accepted that girls would read books with boy main characters, but not vice versa. He also stated that he felt the addition of an entire family of girls to the TV series was somewhat \"over the top\". The series is also notable for featuring non-humanoid aliens, which was uncommon at the time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Woodvine Charlotte Long Cindy Shelley Full Cast & Crew Last Season Season 2 1985 | 12 Episodes Season 2 of The Tripods premiered on September  7, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Tripods. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.bbc.co.uk/cult/classic/tripods/index.shtml Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 4 Gothico M 2 Maximilian2000 M 2 Munky711  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}