{"link": "https://www.themoviedb.org/tv/10106?language=en", "title": "Hong Kong Phooey", "resume": "Hong Kong Phooey is a 16-episode Hanna-Barbera animated series that first aired on ABC Saturday morning from September 7, 1974 to December 21, 1974. It was a parody of kung fu shows and movies of the time.\nThe main character Hong Kong Phooey is a clownishly clumsy secret alter ego of Penrod \"Penry\" Pooch, working at a police station as a \"mild-mannered\" janitor under the glare of Sergeant Flint. He transforms himself into Hong Kong Phooey upon running into a magic filing cabinet despite always getting stuck - and unstuck by his cat Spot - and once transformed, gets equipped with the \"Phooeymobile\" vehicle that transforms itself into a boat, a plane, or a telephone booth depending on the circumstances. He fights crime relying on his copy of The Hong Kong Book of Kung Fu, but he succeeds only thanks to his cat Spot who provides a solution to the challenges or they are solved by himself as result of a comically unintended side effect of his conscious efforts. Background was designed by Lorraine Andrina and Richard Khim.", "rate": 68, "genre": ["Animation", "Comedy"], "cast": ["Scatman Crothers", "Joe E. Ross", "Don Messick", "John Stephenson", "Paul Winchell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10106   Expand Hong Kong Phooey   (1974) User Score Overview Hong Kong Phooey is a 16-episode Hanna-Barbera animated series that first aired on ABC Saturday morning from September 7, 1974 to December 21, 1974. It was a parody of kung fu shows and movies of the time. The main character Hong Kong Phooey is a clownishly clumsy secret alter ego of Penrod \"Penry\" Pooch, working at a police station as a \"mild-mannered\" janitor under the glare of Sergeant Flint. He transforms himself into Hong Kong Phooey upon running into a magic filing cabinet despite always getting stuck - and unstuck by his cat Spot - and once transformed, gets equipped with the \"Phooeymobile\" vehicle that transforms itself into a boat, a plane, or a telephone booth depending on the circumstances. He fights crime relying on his copy of The Hong Kong Book of Kung Fu, but he succeeds only thanks to his cat Spot who provides a solution to the challenges or they are solved by himself as result of a comically unintended side effect of his conscious efforts. Background was designed by Lorraine Andrina and Richard Khim. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scatman Crothers Joe E. Ross Don Messick John Stephenson Paul Winchell Full Cast & Crew Last Season Season 1 1974 | 22 Episodes Season 1 of Hong Kong Phooey premiered on September  7, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1973-09-25 Police Story 6.4    1968-09-14 Wacky Races 7.1    1968-09-07 The Banana Splits Adventure Hour 7.2    1966-09-10 Space Ghost and Dino Boy 7.2    1977-09-10 Scooby's All-Star Laff-A-Lympics 8.5    1984-01-06 Blue Thunder 6.3    1975-04-04 The Good Life 7.0    1967-09-09 The Herculoids 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hanna-barbera.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 minhus 1 Robson Guedes Vieira  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}