{"link": "https://www.themoviedb.org/tv/66203?language=en", "title": "Soy Luna", "resume": "Luna leads a happy life in Mexico where she enjoys skating. Her life change overnight when a wealthy woman offers Luna's parents a job in Argentina and also to pay an elite school for Luna. Luna and her family moves to Argentina. She should start a new life, makes new friends, but soon she discovers the Jam & Roller, a rollerskating club, where she can not only prove her talent on wheels, but also on the stage singing. And that's not all, Luna is adopted and her parents have never kept her adoption a secret. However, Luna is suddenly overtaken by her past after moving to Argentina.", "rate": 51, "genre": ["Soap", "Kids"], "cast": ["Karol Sevilla", "Ruggero Pasquarelli", "Valentina Zenere", "Michael Ronda", "Carolina Kopelioff"], "character": ["Luna Valente", "Matteo Balsano", "Ámbar Smith", "Simón Álvarez", "Nina Simonetti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66203   Expand Soy Luna   (2016) User Score Overview Luna leads a happy life in Mexico where she enjoys skating. Her life change overnight when a wealthy woman offers Luna's parents a job in Argentina and also to pay an elite school for Luna. Luna and her family moves to Argentina. She should start a new life, makes new friends, but soon she discovers the Jam & Roller, a rollerskating club, where she can not only prove her talent on wheels, but also on the stage singing. And that's not all, Luna is adopted and her parents have never kept her adoption a secret. However, Luna is suddenly overtaken by her past after moving to Argentina. Featured Crew Jorge Edelstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karol Sevilla Luna Valente Ruggero Pasquarelli Matteo Balsano Valentina Zenere Ámbar Smith Michael Ronda Simón Álvarez Carolina Kopelioff Nina Simonetti Full Cast & Crew Current Season Season 3 2018 | 30 Episodes Season 3 of Soy Luna premiered on April 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Soy Luna. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://disneychannel.disney.com.br/sou-luna Genres Soap Kids Keywords music family telenovela Content Score 93 Almost there... Top Contributors L 100 LukasGen v 42 vt70000 t 31 tmdb26343698 C 15 Conspirance  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}