{"link": "https://www.themoviedb.org/tv/72041?language=en", "title": "Record of Lodoss War: Chronicles of the Heroic Knight", "resume": "Five years after the death of the Emperor of Marmo in the War of Heroes, Parn is now the Free Knight of Lodoss, he and his old allies now famous through the land. However, the Emperor's right-hand-man, Ashram, seeks the Scepter of Domination to re-unify Lodoss under his former leader's banner. Meanwhile, beyond his attempts at conquest lies a more sinister force beginning to set the stage for the resurrection of the goddess of death and destruction...", "rate": 88, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kenji Nojima", "Chie Ishibashi", "Nobutoshi Hayashi", "Shiho Niiyama", "Jouji Nakata"], "character": ["Spark (voice)", "Little Neese  (voice)", "Parn (voice)", "Deedlit (voice)", "King Kashue (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72041   Expand Record of Lodoss War: Chronicles of the Heroic Knight   (1998) User Score Overview Five years after the death of the Emperor of Marmo in the War of Heroes, Parn is now the Free Knight of Lodoss, he and his old allies now famous through the land. However, the Emperor's right-hand-man, Ashram, seeks the Scepter of Domination to re-unify Lodoss under his former leader's banner. Meanwhile, beyond his attempts at conquest lies a more sinister force beginning to set the stage for the resurrection of the goddess of death and destruction... Featured Crew Ryo Mizuno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenji Nojima Spark (voice) Chie Ishibashi Little Neese  (voice) Nobutoshi Hayashi Parn (voice) Shiho Niiyama Deedlit (voice) Jouji Nakata King Kashue (voice) Full Cast & Crew Last Season Season 1 1998 | 27 Episodes Season 1 of Record of Lodoss War: Chronicles of the Heroic Knight premiered on April  1, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Record of Lodoss War: Chronicles of the Heroic Knight. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Record of Lodoss War: Chronicles of the Heroic Knight. You can help by rating TV shows you've seen. Facts Original Name  ロードス島戦記 英雄騎士伝 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  620m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords swordplay magic dragon high fantasy Content Score 93 Almost there... Top Contributors q 93 quincunx_ai E 8 Enigma19 8 Marr 🇳🇱 s 7 sinano  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}