{"link": "https://www.themoviedb.org/tv/7388?language=en", "title": "Hollyoaks Later", "resume": "Hollyoaks Later is a British television spin-off of the Channel 4 television series Hollyoaks. The series began in 2008 and since then has become an annual event for the soap. The series returns every September and takes place over five consecutive nights on E4. As the title suggests, the late night series allows for more sexual content, ' edgier ' storylines and stronger language.", "rate": 0, "genre": ["Drama"], "cast": ["Wallis Day"], "character": ["Holly Cunningham"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7388   Expand Hollyoaks Later   (2008) User Score Overview Hollyoaks Later is a British television spin-off of the Channel 4 television series Hollyoaks. The series began in 2008 and since then has become an annual event for the soap. The series returns every September and takes place over five consecutive nights on E4. As the title suggests, the late night series allows for more sexual content, ' edgier ' storylines and stronger language. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wallis Day Holly Cunningham Full Cast & Crew Last Season Season 6 2013 | 5 Episodes Season 6 of Hollyoaks Later premiered on October  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hollyoaks Later. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.e4.com/hollyoakslater/ Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors L 14 Leah K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}