{"link": "https://www.themoviedb.org/tv/2332?language=en", "title": "L.A. Heat", "resume": "L.A. Heat is an American action series starring Wolf Larson and Steven Williams as Los Angeles police detectives, in the tradition of films like Lethal Weapon. The series aired on TNT from March 15, 1999.", "rate": 95, "genre": ["Action", "Adventure"], "cast": ["Renee Tenison", "Steven Williams", "Wolf Larson", "Sugar Ray Leonard", "Kenneth Tigar"], "character": ["Benny Lewis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2332   Expand L.A. Heat   (1999) User Score Overview L.A. Heat is an American action series starring Wolf Larson and Steven Williams as Los Angeles police detectives, in the tradition of films like Lethal Weapon. The series aired on TNT from March 15, 1999. Featured Crew Joseph Merhi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Renee Tenison Steven Williams Wolf Larson Sugar Ray Leonard Benny Lewis Kenneth Tigar Full Cast & Crew Last Season Season 2 1999 | 22 Episodes Season 2 of L.A. Heat premiered on April 20, 1999. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Amazing Open 0 by Irina\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on L.A. Heat. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 4 speedycars 3 Pandawan R 2 Rebecca 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}