{"link": "https://www.themoviedb.org/tv/1995?language=en", "title": "Gimme Gimme Gimme", "resume": "Linda La Hughes (Kathy Burke) shares a flat with Tom Farrell (James Dreyfus). Linda is overweight, loudmouthed and not particularly attractive. She thinks she's gorgeous and irrestible, however. She's also sex mad and obsessed with men. Tom is an aspiring actor. He's got an agent, but finds it difficult to get parts. He doesn't like Linda much, in spite of (or perhaps because of) the fact that they share a flat. She isn't completely comfortable with his homosexuality, perhaps because she finds it difficult to live with a man who doesn't find her sexually attractive.", "rate": 70, "genre": ["Comedy"], "cast": ["Kathy Burke", "James Dreyfus", "Beth Goddard", "Rosalind Knight", "Brian Bovell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1995   Expand Gimme Gimme Gimme   (1999) User Score Overview Linda La Hughes (Kathy Burke) shares a flat with Tom Farrell (James Dreyfus). Linda is overweight, loudmouthed and not particularly attractive. She thinks she's gorgeous and irrestible, however. She's also sex mad and obsessed with men. Tom is an aspiring actor. He's got an agent, but finds it difficult to get parts. He doesn't like Linda much, in spite of (or perhaps because of) the fact that they share a flat. She isn't completely comfortable with his homosexuality, perhaps because she finds it difficult to live with a man who doesn't find her sexually attractive. Featured Crew Jonathan Harvey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathy Burke James Dreyfus Beth Goddard Rosalind Knight Brian Bovell Full Cast & Crew Last Season Series 3 2001 | 6 Episodes Season 3 of Gimme Gimme Gimme premiered on November  2, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1998-11-12 Dinnerladies 6.4    1994-11-10 The Vicar of Dibley 7.3    1971-04-10 The Two Ronnies 9.0    1982-11-02 The Comic Strip Presents 7.0    1976-02-20 Open All Hours 7.7    1974-09-05 Porridge 8.3    2004-02-16 The Catherine Tate Show 5.5    1974-09-02 Rising Damp 7.8  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  25m, 30m, 29m Homepage   http://www.bbc.co.uk/programmes/b006xyhv Genres Comedy Keywords sex sexual obsession surreal double entendre sitcom camp humour actor british humour flatmates Content Score 93 Almost there... Top Contributors O 13 Ozbourne R 9 Rebecca 4 kcdh E 2 Elky  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}