{"link": "https://www.themoviedb.org/tv/2692?language=en", "title": "My Wife and Kids", "resume": "My Wife and Kids is an American television family sitcom that ran on ABC from March 28, 2001 until May 17, 2005. Produced by Touchstone Television, it starred Damon Wayans and Tisha Campbell-Martin, and centers on the character of Michael Kyle, a loving husband and modern-day patriarch who rules his household with a unique and distinct parenting style. As he teaches his three children some of life's lessons, he does so with his own brand of humor. Wayans and veteran television writer/producer Don Reo co-created and executive produced the series.", "rate": 66, "genre": ["Comedy"], "cast": ["Damon Wayans", "Tisha Campbell-Martin", "George O. Gore II", "Jennifer Freeman", "Parker McKenna Posey"], "character": ["Michael Kyle", "Janet 'Jay' Kyle", "Michael Kyle Jr.", "Claire Kyle", "Kady Kyle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2692   Expand My Wife and Kids   (2001) User Score  Play Trailer Overview My Wife and Kids is an American television family sitcom that ran on ABC from March 28, 2001 until May 17, 2005. Produced by Touchstone Television, it starred Damon Wayans and Tisha Campbell-Martin, and centers on the character of Michael Kyle, a loving husband and modern-day patriarch who rules his household with a unique and distinct parenting style. As he teaches his three children some of life's lessons, he does so with his own brand of humor. Wayans and veteran television writer/producer Don Reo co-created and executive produced the series. Featured Crew Damon Wayans Creator Don Reo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Damon Wayans Michael Kyle Tisha Campbell-Martin Janet 'Jay' Kyle George O. Gore II Michael Kyle Jr. Jennifer Freeman Claire Kyle Parker McKenna Posey Kady Kyle Full Cast & Crew Last Season Season 5 2004 | 26 Episodes Season 5 of My Wife and Kids premiered on September 21, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Michael Kyle: Happy Birthday Damon Wayans! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  6 Recommendations   2005-09-22 Everybody Hates Chris 7.0    2001-07-12 Night Visions 6.6    2006-09-28 Ugly Betty 5.5    2001-10-03 According to Jim 5.8    1987-09-16 Wiseguy 7.2    The Horror at 37,000 Feet 4.0    1992-07-20 Bananas in Pyjamas 3.3    1996-04-28 Dexter's Laboratory 7.3  Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  30m, 23m Homepage  - Genres Comedy Keywords connecticut family black family sitcom life lessons black sitcom Content Score 100 Yes! Looking good! Top Contributors c 47 courtneysmith86 e 26 eriick_munhoz F 10 Fede993 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}