{"link": "https://www.themoviedb.org/tv/13084?language=en", "title": "Night Man", "resume": "Night Man is an American action/adventure/sci-fi series that aired in syndication from September 15, 1997 to May 17, 1999. The series is loosely based on a comic book published by Malibu Comics and was created by Steve Englehart and developed for television by Glen A. Larson.\nIt stars Matt McColm as the title character, a superhero whose real name was Johnny Domino, a saxophonist. Englehart would write three episodes of the series. Night Man is also one of the few series to cross over with characters from Larson's previous series: in the episode \"Manimal\", Johnny allies with Professor Jonathan Chase, the star of the short-lived 1980s' series Manimal.", "rate": 50, "genre": ["Action", "Adventure"], "cast": ["Earl Holliman", "Jayne Heitmeyer", "Felecia M. Bell", "Matt McColm", "Kim Coates"], "character": ["Kieran Keyes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13084   Expand Night Man   (1997) User Score Overview Night Man is an American action/adventure/sci-fi series that aired in syndication from September 15, 1997 to May 17, 1999. The series is loosely based on a comic book published by Malibu Comics and was created by Steve Englehart and developed for television by Glen A. Larson. It stars Matt McColm as the title character, a superhero whose real name was Johnny Domino, a saxophonist. Englehart would write three episodes of the series. Night Man is also one of the few series to cross over with characters from Larson's previous series: in the episode \"Manimal\", Johnny allies with Professor Jonathan Chase, the star of the short-lived 1980s' series Manimal. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Earl Holliman Jayne Heitmeyer Felecia M. Bell Matt McColm Kim Coates Kieran Keyes Full Cast & Crew Last Season Season 2 1998 | 22 Episodes Season 2 of Night Man premiered on October 11, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Night Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 5 zurman1 4 Joe Carson R 3 Rebecca p 1 pedrol1981  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}