{"link": "https://www.themoviedb.org/tv/62896?language=en", "title": "Acusados", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 43, "genre": [], "cast": ["Blanca Portillo", "José Coronado", "Daniel Grao", "Alejo Sauras", "Aitor Mazo"], "character": ["Rosa Ballester Alonso", "Joaquín de la Torre", "Jorge Vega", "Pablo", "Ricardo Díaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62896   Expand Acusados   (2009) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Darío Madrona Creator Xosé Morais Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Blanca Portillo Rosa Ballester Alonso José Coronado Joaquín de la Torre Daniel Grao Jorge Vega Alejo Sauras Pablo Aitor Mazo Ricardo Díaz Full Cast & Crew Last Season Season 2 2010 | 13 Episodes Season 2 of Acusados premiered on January 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Acusados. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  85m, 75m, 90m, 80m Homepage   http://www.telecinco.es/acusados/ Genres No genres have been added. Keywords fire judge politician murder judgment lawyer corrupt politician police investigation female judge Content Score 79 Pump it up! We're close now. Top Contributors 55 prm96 z 5 zurman1 3 rtentser CM 2 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}