{"link": "https://www.themoviedb.org/tv/21510?language=en", "title": "White Collar", "resume": "Neal Caffrey, a con man, forger and thief, is captured after a three-year game of cat and mouse with the FBI. With only months left serving a four-year sentence, he escapes to look for Kate, his girlfriend. Peter Burke, the FBI agent who initially captured Caffrey, finds and returns him to prison. This time, Caffrey proposes a deal with the FBI, as part of a work-release program. After some hesitation, Burke agrees, and thus begins this unconventional arrangement where Caffrey helps Burke apprehend white collar criminals.", "rate": 79, "genre": ["Crime", "Drama"], "cast": ["Tim DeKay", "Matt Bomer", "Willie Garson", "Tiffani Thiessen", "Marsha Thomason"], "character": ["Peter Burke", "Neal Caffrey", "Mozzie", "Elizabeth Burke", "Diana Barrigan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21510   Expand White Collar   (2009) User Score  Play Trailer Overview Neal Caffrey, a con man, forger and thief, is captured after a three-year game of cat and mouse with the FBI. With only months left serving a four-year sentence, he escapes to look for Kate, his girlfriend. Peter Burke, the FBI agent who initially captured Caffrey, finds and returns him to prison. This time, Caffrey proposes a deal with the FBI, as part of a work-release program. After some hesitation, Burke agrees, and thus begins this unconventional arrangement where Caffrey helps Burke apprehend white collar criminals. Featured Crew Jeff Eastin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  33 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim DeKay Peter Burke Matt Bomer Neal Caffrey Willie Garson Mozzie Tiffani Thiessen Elizabeth Burke Marsha Thomason Diana Barrigan Full Cast & Crew Last Season Season 6 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Neal: Happy Birthday Matt Bomer! Open 0 by wonder2wonder\n      \n     c Baby Burke Open 0 by cdonorab\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  33 Posters  13 Recommendations   2007-06-28 Burn Notice 7.3    2009-01-21 Lie to Me 7.4    2007-09-24 Chuck 7.7    2008-09-23 The Mentalist 7.3    2008-12-07 Leverage 7.2    2006-03-05 Numb3rs 6.5    2012-07-09 Perception 6.7    2009-03-08 Castle 7.3  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m, 40m Homepage   http://www.usanetwork.com/series/whitecollar/ Genres Crime Drama Keywords new york fbi con man art thief ex-con gentleman thief white collar criminal forger criminal consultant Content Score 100 Yes! Looking good! Top Contributors 63 Banana M 27 Manu 15 Elizabeth Jennings 13 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}