{"link": "https://www.themoviedb.org/tv/2164?language=en", "title": "The Marvel Super Heroes", "resume": "The Marvel Super Heroes is an American and Canadian-made animated television series starring five comic-book superheroes from Marvel Comics. It was first syndicated, on U.S. television, in 1966.\nProduced by Grantray-Lawrence Animation, headed by Grant Simmons, Ray Patterson and Robert Lawrence, it was an umbrella series of five segments, each approximately seven minutes long, broadcast on local television stations that aired the show at different times. The series ran initially as a half-hour program made up of three seven-minute segments of a single superhero, separated by a short description of one of the other four heroes. It has also been broadcast as a mixture of various heroes in a half-hour timeslot, and as individual segments as filler or within a children's TV program.\nThe segments, and their original rotations, were:\n⁕Monday: Captain America\n⁕Tuesday: The Invincible Iron Man\n⁕Wednesday: The Incredible Hulk\n⁕Thursday: The Mighty Thor\n⁕Friday: Prince Namor the Sub-Mariner", "rate": 78, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy", "Kids"], "cast": ["Chris Wiggins", "John Vernon", "Paul Soles"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2164   Expand The Marvel Super Heroes   (1966) User Score Overview The Marvel Super Heroes is an American and Canadian-made animated television series starring five comic-book superheroes from Marvel Comics. It was first syndicated, on U.S. television, in 1966. Produced by Grantray-Lawrence Animation, headed by Grant Simmons, Ray Patterson and Robert Lawrence, it was an umbrella series of five segments, each approximately seven minutes long, broadcast on local television stations that aired the show at different times. The series ran initially as a half-hour program made up of three seven-minute segments of a single superhero, separated by a short description of one of the other four heroes. It has also been broadcast as a mixture of various heroes in a half-hour timeslot, and as individual segments as filler or within a children's TV program. The segments, and their original rotations, were: ⁕Monday: Captain America ⁕Tuesday: The Invincible Iron Man ⁕Wednesday: The Incredible Hulk ⁕Thursday: The Mighty Thor ⁕Friday: Prince Namor the Sub-Mariner Featured Crew Jack Kirby Creator Stan Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Wiggins John Vernon Paul Soles Full Cast & Crew Last Season Season 1 1966 | 66 Episodes Season 1 of The Marvel Super Heroes premiered on September  5, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Marvel Super Heroes. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage   http://marvel.com Genres Animation Action & Adventure Sci-Fi & Fantasy Kids Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors OB 45 Omkar Balgobin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}