{"link": "https://www.themoviedb.org/tv/43322?language=en", "title": "Code-E", "resume": "Code-E is a Japanese anime television series animated by Studio DEEN. It is based on an original concept by Ichiro Sakaki and directed by Toshiyuki Katō. The first season consists of twelve episodes and first aired in Japan on July 3, 2007 to September 23, 2007. A second season titled Mission-E began airing in July 2008. A new lead character named Maori Kimizuka will be joining Chinami in the sequel.", "rate": 50, "genre": ["Animation"], "cast": ["Risa Mizuno", "Kaori Nazuka", "Hiroshi Kamiya", "Mai Hashimoto"], "character": ["Adol Brinberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43322   Expand Code-E   (2007) User Score Overview Code-E is a Japanese anime television series animated by Studio DEEN. It is based on an original concept by Ichiro Sakaki and directed by Toshiyuki Katō. The first season consists of twelve episodes and first aired in Japan on July 3, 2007 to September 23, 2007. A second season titled Mission-E began airing in July 2008. A new lead character named Maori Kimizuka will be joining Chinami in the sequel. Featured Crew Ichiro Sakaki Creator Toshiyuki Kato Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Risa Mizuno Kaori Nazuka Hiroshi Kamiya Adol Brinberg Mai Hashimoto Full Cast & Crew Last Season Season 2 2008 | 12 Episodes Season 2 of Code-E premiered on July  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Code-E. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords anime japon Content Score 93 Almost there... Top Contributors 15 Levi Seguel 3 seboseboss m 3 magoozin M 1 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}