{"link": "https://www.themoviedb.org/tv/3000?language=en", "title": "AfterMASH", "resume": "AfterMASH is an American situation comedy that aired on CBS from September 26, 1983, to December 11, 1984. A spin-off of the series MASH, the show takes place immediately following the end of the Korean War and chronicles the adventures of three characters from the original series: Colonel Potter, Klinger and Father Mulcahy. MASH supporting cast-member Kellye Nakahara joined them, albeit off-camera, as the voice of the hospital's public address system. Rosalind Chao rounded out the starring cast as Soon-Lee Klinger, a Korean refugee whom Klinger met, fell in love with and married in the MAS*H series finale \"Goodbye, Farewell and Amen.\"\nAfterMASH premiered in the fall of 1983 in the same Monday night 9:00 P.M. EST. time slot as its predecessor MAS*H. It finished 10th out of all network shows for the 1983-1984 season according to Nielsen Media Research television ratings. For its second season CBS moved the show to Tuesday nights at 8:00 EST., opposite NBC's top ten hit The A-Team, and launched a marketing campaign featuring illustrations by Sanford Kossin of Max Klinger in a nurse's uniform, shaving off Mr. T's signature mohawk, theorizing that AfterMASH would take a large portion of The A-Team's audience. The theory, however, was proven wrong. In fact, the exact opposite occurred, as AfterMASH's ratings plummeted to near the bottom of the television rankings and the show was canceled nine episodes into its second season, while The A-Team continued until 1987, with 97 episodes.", "rate": 30, "genre": ["Comedy"], "cast": ["Harry Morgan", "Jamie Farr", "William Christopher", "Rosalind Chao", "David Ackroyd"], "character": ["Sherman T. Potter", "Max Klinger", "Father Mulcahy", "Soon-Lee Klinger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3000   Expand AfterMASH   (1983) User Score Overview AfterMASH is an American situation comedy that aired on CBS from September 26, 1983, to December 11, 1984. A spin-off of the series M A S H, the show takes place immediately following the end of the Korean War and chronicles the adventures of three characters from the original series: Colonel Potter, Klinger and Father Mulcahy. M A S H supporting cast-member Kellye Nakahara joined them, albeit off-camera, as the voice of the hospital's public address system. Rosalind Chao rounded out the starring cast as Soon-Lee Klinger, a Korean refugee whom Klinger met, fell in love with and married in the M A S*H series finale \"Goodbye, Farewell and Amen.\" AfterMASH premiered in the fall of 1983 in the same Monday night 9:00 P.M. EST. time slot as its predecessor M A S*H. It finished 10th out of all network shows for the 1983-1984 season according to Nielsen Media Research television ratings. For its second season CBS moved the show to Tuesday nights at 8:00 EST., opposite NBC's top ten hit The A-Team, and launched a marketing campaign featuring illustrations by Sanford Kossin of Max Klinger in a nurse's uniform, shaving off Mr. T's signature mohawk, theorizing that AfterMASH would take a large portion of The A-Team's audience. The theory, however, was proven wrong. In fact, the exact opposite occurred, as AfterMASH's ratings plummeted to near the bottom of the television rankings and the show was canceled nine episodes into its second season, while The A-Team continued until 1987, with 97 episodes. Featured Crew Larry Gelbart Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Harry Morgan Sherman T. Potter Jamie Farr Max Klinger William Christopher Father Mulcahy Rosalind Chao Soon-Lee Klinger David Ackroyd Full Cast & Crew Last Season Season 2 1984 | 9 Episodes Season 2 of AfterMASH premiered on September 23, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply B Old Soviet documents prove North Korea actually began the Korean War Open 0 by Benton12\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on AfterMASH. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords hospital military veterans hospital sitcom korean war veteran Content Score 93 Almost there... Top Contributors 11 Banana 5 DarkMan TB 2 TMDb Bot d 1 dho4765  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}