{"link": "https://www.themoviedb.org/tv/3936?language=en", "title": "Tom and Jerry", "resume": "Tom and Jerry is a series of theatrical animated cartoon films created by William Hanna and Joseph Barbera for Metro-Goldwyn-Mayer, centering on a rivalry between a cat and a mouse whose chases include slapstick comedy.", "rate": 77, "genre": ["Animation", "Comedy", "Kids"], "cast": ["Dick Beals", "Daws Butler", "George O'Hanlon", "June Foray", "Mel Blanc"], "character": ["Spike"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3936   Expand Tom and Jerry   (1940) User Score Overview Tom and Jerry is a series of theatrical animated cartoon films created by William Hanna and Joseph Barbera for Metro-Goldwyn-Mayer, centering on a rivalry between a cat and a mouse whose chases include slapstick comedy. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  8 Posters  20 Videos Trailers  0 Teasers  0 Clips  2 Featurettes  0 Opening Credits  0 Top Billed Cast Dick Beals Daws Butler Spike George O'Hanlon June Foray Mel Blanc Full Cast & Crew Last Season Season 3 1961 | 47 Episodes Season 1960 of Tom and Jerry premiered on September  7, 1961. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Tom and Jerry. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  8 Posters  20 Recommendations   1960-09-30 The Flintstones 7.0    2003-04-01 Walking with Cavemen 7.7    1949-09-16 The Road Runner Show 8.0    1999-01-04 Ed, Edd n Eddy 7.0    1987-09-18 DuckTales 7.6    1976-09-04 The Duchess of Duke Street 7.7    1979-09-22 Scooby-Doo and Scrappy-Doo 7.0    1964-12-18 The Pink Panther Show 7.0  Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  10m Homepage  - Genres Animation Comedy Kids Keywords rivalry cat and mouse cartoon cat cartoon mouse Content Score 100 Yes! Looking good! Top Contributors 33 Banana B 12 Boxi88 10 waaw S 9 SHADE02  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}