{"link": "https://www.themoviedb.org/tv/43209?language=en", "title": "Super Dimension Century Orguss", "resume": "Super Dimension Century Orguss is an anime science fiction series. It inspired an OVA sequel series called Super Dimension Century Orguss 02. Orguss was the second part of The Super Dimension trilogy from Big West, preceded by The Super Dimension Fortress Macross and then followed by The Super Dimension Cavalry Southern Cross.\nOrguss was originally planned as the third season of Robotech in the United States like as the two others Super Dimension series were used for the two first seasons. Instead, the anime Genesis Climber Mospeada was used as the third segment of Robotech. Additionally, these three series are not sequels, prequels, or even in the same story universe as one another. They do share \"The Super Dimension\" moniker in their titles and were presented by Big West. That was the only connection that each of the Super Dimension shows had with each other.\nOf the Orguss' 35 episodes, only 17 of them were available in English in dub-only format in the early 1990s on video tape from U.S. Renditions, before the majority of the company's shows were bought up by Manga Entertainment. Manga Entertainment did however release Orguss 02 on both video tape and DVD.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Kumiko Takizawa", "Chika Sakamoto", "Sanae Miyuki", "Sho Hayami", "Run Sasaki"], "character": ["Shaya Thoov", "Lieea", "Mome", "Kei Katsuragi", "Mimsy Laaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43209   Expand Super Dimension Century Orguss   (1983) User Score Overview Super Dimension Century Orguss is an anime science fiction series. It inspired an OVA sequel series called Super Dimension Century Orguss 02. Orguss was the second part of The Super Dimension trilogy from Big West, preceded by The Super Dimension Fortress Macross and then followed by The Super Dimension Cavalry Southern Cross. Orguss was originally planned as the third season of Robotech in the United States like as the two others Super Dimension series were used for the two first seasons. Instead, the anime Genesis Climber Mospeada was used as the third segment of Robotech. Additionally, these three series are not sequels, prequels, or even in the same story universe as one another. They do share \"The Super Dimension\" moniker in their titles and were presented by Big West. That was the only connection that each of the Super Dimension shows had with each other. Of the Orguss' 35 episodes, only 17 of them were available in English in dub-only format in the early 1990s on video tape from U.S. Renditions, before the majority of the company's shows were bought up by Manga Entertainment. Manga Entertainment did however release Orguss 02 on both video tape and DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kumiko Takizawa Shaya Thoov Chika Sakamoto Lieea Sanae Miyuki Mome Sho Hayami Kei Katsuragi Run Sasaki Mimsy Laaz Full Cast & Crew Last Season The  season 2 1993 | 6 Episodes Season 2 of Super Dimension Century Orguss premiered on December  5, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Super Dimension Century Orguss. You can help by rating TV shows you've seen. Facts Original Name  超時空世紀オーガス Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 7 tmdb983464 4 BrerFox 3 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}