{"link": "https://www.themoviedb.org/tv/6132?language=en", "title": "The Power of Nightmares", "resume": "Examines how politicians have used our fears to increase their power and control over society.", "rate": 85, "genre": ["Documentary"], "cast": ["Gilles Kepel", "Melvin Goodman", "Stephen Holmes", "William Kristol", "Michael Ledeen"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6132   Expand The Power of Nightmares   (2004) User Score  Play Trailer Overview Examines how politicians have used our fears to increase their power and control over society. Featured Crew Adam Curtis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gilles Kepel Himself Melvin Goodman Himself Stephen Holmes Himself William Kristol Himself Michael Ledeen Himself Full Cast & Crew Last Season Miniseries 2004 | 3 Episodes Season 1 of The Power of Nightmares premiered on October 19, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  8 Recommendations   2002-03-17 The Century of the Self 8.2    2007-03-11 The Trap: What Happened to Our Dream of Freedom 0.0    2006-08-21 When the Levees Broke: A Requiem in Four Acts 7.0    1992-06-11 Pandora's Box 9.0    2011-05-23 All Watched Over by Machines of Loving Grace 8.3    1995-03-15 The Living Dead 7.5    1998-12-01 Comedy Central Presents 6.8    1994-01-19 The Day Today 8.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://news.bbc.co.uk/1/hi/programmes/3755686.stm Genres Documentary Keywords terrorism Content Score 100 Yes! Looking good! Top Contributors TB 34 TMDb Bot 7 Banana 4 rhazman 2 Life as Fiction  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}