{"link": "https://www.themoviedb.org/tv/10851?language=en", "title": "Slings and Arrows", "resume": "Slings and Arrows is a Canadian TV series set at the fictional New Burbage Festival, a Shakespearean festival similar to the real-world Stratford Festival. The program stars Paul Gross, Stephen Ouimette and Martha Burns.\nThe blackly comic series first aired on Canada's Movie Central and The Movie Network channels in 2003, and received acclaim in the United States when it was shown on the Sundance Channel two years later. Three seasons of six episodes each were filmed in total, with the final season airing in Canada in the summer of 2006 and in the United States in early 2007.\nSlings and Arrows was created and written by former The Kids in the Hall member Mark McKinney, playwright and actress Susan Coyne, and comedian Bob Martin. All three appear in the series as well. The entire series was directed by Peter Wellington.", "rate": 76, "genre": ["Drama", "Comedy"], "cast": ["Martha Burns", "Steven Ouimette", "Paul Gross", "Mark McKinney", "Don McKellar"], "character": ["Ellen Fanshaw", "Oliver Welles", "Geoffrey Tennant"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10851   Expand Slings and Arrows   (2003) User Score Overview Slings and Arrows is a Canadian TV series set at the fictional New Burbage Festival, a Shakespearean festival similar to the real-world Stratford Festival. The program stars Paul Gross, Stephen Ouimette and Martha Burns. The blackly comic series first aired on Canada's Movie Central and The Movie Network channels in 2003, and received acclaim in the United States when it was shown on the Sundance Channel two years later. Three seasons of six episodes each were filmed in total, with the final season airing in Canada in the summer of 2006 and in the United States in early 2007. Slings and Arrows was created and written by former The Kids in the Hall member Mark McKinney, playwright and actress Susan Coyne, and comedian Bob Martin. All three appear in the series as well. The entire series was directed by Peter Wellington. Featured Crew Bob Martin Creator Susan Coyne Creator Mark McKinney Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martha Burns Ellen Fanshaw Steven Ouimette Oliver Welles Paul Gross Geoffrey Tennant Mark McKinney Don McKellar Full Cast & Crew Last Season Slings & arrows season 3 2006 | 6 Episodes Season 3 of Slings and Arrows premiered on July 24, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2007-04-22 Kingdom 7.0    1999-04-07 Strangers with Candy 7.0    2007-03-12 The Riches 7.6    2009-09-21 Accidentally on Purpose 4.8    2011-09-13 Ringer 5.9    1999-02-23 Queer as Folk 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 45m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}