{"link": "https://www.themoviedb.org/tv/13537?language=en", "title": "The Restless Gun", "resume": "The Restless Gun is an American western television series that appeared on NBC between 1957 and 1959, with John Payne in the role of Vint Bonner, a wandering cowboy in the era after the American Civil War. A skilled gunfighter, Bonner is an idealistic person who prefers peaceful resolutions of conflict wherever possible. He is gregarious, intelligent, and public-spirited. The half-hour black-and-white program aired seventy-eight episodes. Jeanne Bates appeared in varying roles with Payne in five episodes of The Restless Gun.\nThe Restless Gun theme song begins: \"I ride with the wind, my eyes on the sun, and my hand on my restless gun...\" The song composer is probably Paul Dunlap, credited as the primary series composer, but could have been contributed to by either of the two other series composers, Dave Kahn and Stanley Wilson, also. Two versions are currently posted on YouTube, but neither posting lists any composer or performance credits.", "rate": 0, "genre": ["Western", "Drama"], "cast": ["John Payne", "Jeanne Bates"], "character": ["Vint Bonner", "Anna Ritter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13537   Expand The Restless Gun   (1957) User Score  Play Trailer Overview The Restless Gun is an American western television series that appeared on NBC between 1957 and 1959, with John Payne in the role of Vint Bonner, a wandering cowboy in the era after the American Civil War. A skilled gunfighter, Bonner is an idealistic person who prefers peaceful resolutions of conflict wherever possible. He is gregarious, intelligent, and public-spirited. The half-hour black-and-white program aired seventy-eight episodes. Jeanne Bates appeared in varying roles with Payne in five episodes of The Restless Gun. The Restless Gun theme song begins: \"I ride with the wind, my eyes on the sun, and my hand on my restless gun...\" The song composer is probably Paul Dunlap, credited as the primary series composer, but could have been contributed to by either of the two other series composers, Dave Kahn and Stanley Wilson, also. Two versions are currently posted on YouTube, but neither posting lists any composer or performance credits. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Payne Vint Bonner Jeanne Bates Anna Ritter Full Cast & Crew Last Season Season 2 1959 | 37 Episodes Season 2 of The Restless Gun premiered on June 22, 1959. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Restless Gun. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Western Drama Keywords texas wild west 19th century Content Score 64 We're so close, yet so far. Top Contributors 18 Banana 3 Steve TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}