{"link": "https://www.themoviedb.org/tv/4556?language=en", "title": "Scrubs", "resume": "In the unreal world of Sacred Heart Hospital, John \"J.D\" Dorian learns the ways of medicine, friendship and life.", "rate": 78, "genre": ["Drama", "Comedy"], "cast": ["Zach Braff", "Donald Faison", "John C. McGinley", "Eliza Coupe", "Kerry Bishé"], "character": ["John 'J.D.' Dorian", "Christopher Turk", "Perry Cox", "Denise Mahoney", "Lucy Bennett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4556   Expand Scrubs   (2001) User Score  Play Trailer Overview In the unreal world of Sacred Heart Hospital, John \"J.D\" Dorian learns the ways of medicine, friendship and life. Featured Crew Bill Lawrence Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  42 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zach Braff John 'J.D.' Dorian Donald Faison Christopher Turk John C. McGinley Perry Cox Eliza Coupe Denise Mahoney Kerry Bishé Lucy Bennett Full Cast & Crew Last Season Season 9 2009 | 13 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Dr. Elliot Reid: Happy Birthday Sarah Chalke! Open 0 by wonder2wonder\n      \n     w J.D: Happy Birthday Zach Braff! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  42 Posters  14 Recommendations   1999-03-28 Futurama 8.2    2009-09-17 Community 7.9    2005-09-19 How I Met Your Mother 7.4    2000-01-09 Malcolm in the Middle 7.5    2005-09-20 My Name Is Earl 7.2    2003-09-22 Two and a Half Men 6.2    1989-07-05 Seinfeld 8.2    1998-08-23 That '70s Show 7.4  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  24m Homepage   http://abcstudiosmedianet.com/web/showpage/showpage.aspx?program_id=002668&type=lead Genres Drama Comedy Keywords friendship hospital doctor medical student sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors T 286 Tim 162 United600 14 Travis Bell 13 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}