{"link": "https://www.themoviedb.org/tv/41293?language=en", "title": "Simsala Grimm", "resume": "SimsalaGrimm is a German television series, consisting of stories based on fairy tales by Grimm Brothers, Hans Christian Anderson and other notable authors.", "rate": 80, "genre": ["Animation"], "cast": ["Bert Franzke", "Jörg Stuttmann", "Hubertus von Lerchenfeld"], "character": ["Erzähler", "Doc Croc", "Yoyo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41293   Expand Simsala Grimm   (1999) User Score Overview SimsalaGrimm is a German television series, consisting of stories based on fairy tales by Grimm Brothers, Hans Christian Anderson and other notable authors. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bert Franzke Erzähler Jörg Stuttmann Doc Croc Hubertus von Lerchenfeld Yoyo Full Cast & Crew Last Season Season 3 2010 | 26 Episodes Season 3 of Simsala Grimm premiered on December  6, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Simsala Grimm. You can help by rating TV shows you've seen. Facts Original Name  SimsalaGrimm Status  Ended Network Certification  - Type  Reality Original Language  German Runtime  25m Homepage  - Genres Animation Keywords fairy tale Content Score 56 We're so close, yet so far. Top Contributors S 22 Samara 14 Smigorevich 3 tkozyrski 1 ngsmonteiro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}