{"link": "https://www.themoviedb.org/tv/67283?language=en", "title": "Samurai Sensei", "resume": "Takechi Hanpeita, a samurai from Bakumatsu period time-travels 150 years to modern day Japan.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Ryo Nishikido", "Ryunosuke Kamiki", "Manami Higa", "Ryusei Fujii", "Yuina Kuroshima"], "character": ["Takechi Hanpeita", "Sakamoto Ryoma", "Haruka Saeki", "Toranosuke Saeki", "Sachiko Akagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67283   Expand Samurai Sensei   (2015) User Score Overview Takechi Hanpeita, a samurai from Bakumatsu period time-travels 150 years to modern day Japan. Featured Crew Hisashi Kimura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryo Nishikido Takechi Hanpeita Ryunosuke Kamiki Sakamoto Ryoma Manami Higa Haruka Saeki Ryusei Fujii Toranosuke Saeki Yuina Kuroshima Sachiko Akagi Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Samurai Sensei premiered on October 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Samurai Sensei. You can help by rating TV shows you've seen. Facts Original Name  サムライせんせい Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  48m Homepage   http://www.tv-asahi.co.jp/samuraisensei/ Genres Comedy Drama Keywords japan time travel historical figure samurai era Content Score 93 Almost there... Top Contributors 36 thirstyhippo t 5 taxigps n 2 newSami  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}