{"link": "https://www.themoviedb.org/tv/62773?language=en", "title": "God Eater", "resume": "In the early 2050s, unknown life forms called “Oracle cells” begin their uncontrolled consumption of all life on Earth. Their ravenous appetite and remarkable adaptability earn them first dread, then awe, and finally the name “aragami”. In the face of an enemy completely immune to conventional weapons, urban civilization collapses, and each day humanity is driven further and further toward extinction. One single ray of hope remains for humanity. Following the development of “God Arcs”—living weapons which incorporate Oracle cells—their wielders are organized into an elite force.", "rate": 64, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Ryuuichi Kijima", "Hiroaki Hirata", "Kazuya Nakai", "Sayaka Ohara", "Daisuke Sakaguchi"], "character": ["Lenka Utsugi (voice)", "Rindou Amamiya (voice)", "Soma Schiksal (voice)", "Sakuya Tachibana (voice)", "Kouta Fujiki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62773   Expand God Eater   (2015) User Score Overview In the early 2050s, unknown life forms called “Oracle cells” begin their uncontrolled consumption of all life on Earth. Their ravenous appetite and remarkable adaptability earn them first dread, then awe, and finally the name “aragami”. In the face of an enemy completely immune to conventional weapons, urban civilization collapses, and each day humanity is driven further and further toward extinction. One single ray of hope remains for humanity. Following the development of “God Arcs”—living weapons which incorporate Oracle cells—their wielders are organized into an elite force. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryuuichi Kijima Lenka Utsugi (voice) Hiroaki Hirata Rindou Amamiya (voice) Kazuya Nakai Soma Schiksal (voice) Sayaka Ohara Sakuya Tachibana (voice) Daisuke Sakaguchi Kouta Fujiki (voice) Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of God Eater premiered on July 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2015-07-02 Gangsta. 7.2    2013-04-07 Gargantia on the Verdurous Planet 6.8    2016-04-08 Kabaneri of the Iron Fortress 6.4    2015-07-05 Charlotte 6.8    2016-04-04 Re:ZERO -Starting Life in Another World- 7.4  Facts Original Name  ゴッドイーター Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://anime.godeater.jp/en/ Genres Animation Sci-Fi & Fantasy Keywords japan supernatural post-apocalyptic demon militarism Content Score 86 Almost there... Top Contributors 73 Marr 🇳🇱 Q 29 QBCreature 19 Elizabeth Jennings 9 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}