{"link": "https://www.themoviedb.org/tv/13706?language=en", "title": "Dans une galaxie près de chez vous", "resume": "Dans une galaxie près de chez vous is a Quebec French language television series that aired on Canal Famille from 1998 to 2001, and a movie of the same name, released in 2004. The second movie, Dans une galaxie près de chez vous 2, has been released on April 18, 2008. It is a humorous sci-fi parody.", "rate": 60, "genre": ["Comedy", "Family", "Sci-Fi", "Fantasy"], "cast": ["Guy Jodoin", "Claude Legault", "Stéphane Crête", "Didier Lucien", "Sylvie Moreau"], "character": ["Capitaine Charles Patenaude", "Flavien Bouchard", "Brad Spitfire", "Bob Dieudonné-Marcelin", "Valence Leclerc"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13706   Expand Dans une galaxie près de chez vous   (1998) User Score Overview Dans une galaxie près de chez vous is a Quebec French language television series that aired on Canal Famille from 1998 to 2001, and a movie of the same name, released in 2004. The second movie, Dans une galaxie près de chez vous 2, has been released on April 18, 2008. It is a humorous sci-fi parody. Featured Crew Claude Legault Creator Pierre-Yves Bernard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Jodoin Capitaine Charles Patenaude Claude Legault Flavien Bouchard Stéphane Crête Brad Spitfire Didier Lucien Bob Dieudonné-Marcelin Sylvie Moreau Valence Leclerc Full Cast & Crew Last Season Season 4 2001 | 13 Episodes Season 4 of Dans une galaxie près de chez vous premiered on September  2, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dans une galaxie près de chez vous. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  30m Homepage   https://unis.ca/dans-une-galaxie-pres-de-chez-vous Genres Comedy Family Sci-Fi & Fantasy Keywords future space alien planet planet space exploration Content Score 93 Almost there... Top Contributors 34 Guipat 25 Banana P 3 Provencal 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}