{"link": "https://www.themoviedb.org/tv/58761?language=en", "title": "Answer Me 1994", "resume": "Generation Y, meet Generation X: on the heels of the success of Answer Me 1997, ‘90s nostalgia continues with a series set in 1994. Journey with a group of high schoolers as they discover the now legendary—then new—K-pop group Seo Taiji and the Boys, as well as the Korean Basketball League, \"new\" technology, and grungy fashion trends. Sometimes you’ve just got to look to your past in order to appreciate the present. Every generation is sure to find something to love in this field trip back into time!", "rate": 84, "genre": ["Comedy"], "cast": ["Go Ara", "Jung Woo", "Yoo Yeon-seok", "Kim Sung-kyun", "Son Ho-jun"], "character": ["Sung Na-jung", "Sseu Re Ki \"Trash\"", "Chil Bong Yi", "Sam Chun Po", "Haitai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58761   Expand Answer Me 1994   (2013) User Score Overview Generation Y, meet Generation X: on the heels of the success of Answer Me 1997, ‘90s nostalgia continues with a series set in 1994. Journey with a group of high schoolers as they discover the now legendary—then new—K-pop group Seo Taiji and the Boys, as well as the Korean Basketball League, \"new\" technology, and grungy fashion trends. Sometimes you’ve just got to look to your past in order to appreciate the present. Every generation is sure to find something to love in this field trip back into time!  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Go Ara Sung Na-jung Jung Woo Sseu Re Ki \"Trash\" Yoo Yeon-seok Chil Bong Yi Kim Sung-kyun Sam Chun Po Son Ho-jun Haitai Full Cast & Crew Last Season Season 1 2013 | 21 Episodes Season 1 of Answer Me 1994 premiered on October 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2012-08-18 Panda and Hedgehog 6.0    2011-09-05 Zig and Sharko 5.3    2014-10-13 Tomorrow's Cantabile 7.3    2014-03-17 Secret Love Affair 7.8    2012-07-24 Reply 1997 8.5    2013-11-28 Let's Eat 7.8    2012-02-05 Glitter Force 6.3    2013-03-25 Max Steel 4.8  Facts Original Name  응답하라 1994 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  80m Homepage   http://program.interest.me/tvn/reply1994 Genres Comedy Keywords friendship korea school 1990s Content Score 93 Almost there... Top Contributors M 87 Maria180493 7 Kyuhwan Kim N 5 Nightowl.Kr 5 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}