{"link": "https://www.themoviedb.org/tv/13455?language=en", "title": "Tales from the Cryptkeeper", "resume": "Tales from the Cryptkeeper is an animated series aimed at children made by Nelvana Limited, PeaceArch Entertainment, kaBOOM! Entertainment and Warner Bros. Television Animation. It was shown on TVO and ABC, and is still shown near Halloween on Teletoon. It was based on the live-action television show, Tales from the Crypt, which aired concurrently on HBO. Being directed at children, Tales From the Cryptkeeper was significantly milder than the live-action HBO version.\nThe series was cancelled on December 10, 1994. In 1999, the show returned to the air as New Tales from the Cryptkeeper. The animation was different from that of the previous episodes.", "rate": 72, "genre": ["Animation", "Comedy", "Kids", "Sci-Fi", "Fantasy"], "cast": ["John Kassir", "David Hemblen", "Marc Donato", "Tara Strong"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13455   Expand Tales from the Cryptkeeper   (1993) User Score Overview Tales from the Cryptkeeper is an animated series aimed at children made by Nelvana Limited, PeaceArch Entertainment, kaBOOM! Entertainment and Warner Bros. Television Animation. It was shown on TVO and ABC, and is still shown near Halloween on Teletoon. It was based on the live-action television show, Tales from the Crypt, which aired concurrently on HBO. Being directed at children, Tales From the Cryptkeeper was significantly milder than the live-action HBO version. The series was cancelled on December 10, 1994. In 1999, the show returned to the air as New Tales from the Cryptkeeper. The animation was different from that of the previous episodes. Featured Crew Libby Hinson Creator Ben Joseph Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Kassir David Hemblen Marc Donato Tara Strong Full Cast & Crew Last Season Season 3 1999 | 13 Episodes Season 3 of Tales from the Cryptkeeper premiered on September  9, 1999. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply S Season three was more about the message Open 0 by Strannger18\n      \n     S The vault keeper vs the witch Open 0 by Strannger18\n      \n     S Myth Conception Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1989-09-09 Beetlejuice 7.2    1990-09-10 Captain Planet and the Planeteers 5.9  Facts Status  Ended Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Comedy Kids Sci-Fi & Fantasy Keywords based on comic based on tv series horror anthology Content Score 93 Almost there... Top Contributors 27 TheOneManBoxOffice 7 DaRKeN58 z 5 zurman1 5 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}