{"link": "https://www.themoviedb.org/tv/753?language=en", "title": "The Scarlet Pimpernel", "resume": "A series of television drama programmes loosely based on Baroness Emmuska Orczy's series of novels, set in 1793 during the French Revolution. It stars Richard E. Grant as the hero, Sir Percy Blakeney, and his eponymous alter ego. The first series also starred Elizabeth McGovern as his wife Marguerite and Martin Shaw as the Pimpernel's archrival, Paul Chauvelin. Robespierre was played by Ronan Vibert. It was filmed in the Czech Republic and scored by a Czech composer, Michal Pavlíček.", "rate": 50, "genre": ["Drama", "Action", "Adventure"], "cast": ["Elizabeth McGovern", "Martin Shaw", "Richard E. Grant", "Anthony Green", "Ronan Vibert"], "character": ["Citizen Chauvelin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 753   Expand The Scarlet Pimpernel   (1999) User Score Overview A series of television drama programmes loosely based on Baroness Emmuska Orczy's series of novels, set in 1793 during the French Revolution. It stars Richard E. Grant as the hero, Sir Percy Blakeney, and his eponymous alter ego. The first series also starred Elizabeth McGovern as his wife Marguerite and Martin Shaw as the Pimpernel's archrival, Paul Chauvelin. Robespierre was played by Ronan Vibert. It was filmed in the Czech Republic and scored by a Czech composer, Michal Pavlíček. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth McGovern Martin Shaw Citizen Chauvelin Richard E. Grant Anthony Green Ronan Vibert Full Cast & Crew Last Season Season 2 2000 | 3 Episodes Season 2 of The Scarlet Pimpernel premiered on October 18, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Scarlet Pimpernel. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Drama Action & Adventure Keywords french revolution alter ego vigilante period drama 18th century Content Score 86 Almost there... Top Contributors z 15 zurman1 14 Banana c 6 chispy D 6 Daxwoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}