{"link": "https://www.themoviedb.org/tv/68764?language=en", "title": "First Love", "resume": "They say absence makes the heart grow fonder. Zuo Zai Jun, Zheng Lei and Ning Xiao Meng were good friends in college. In fact, both Zai Jun and Lei were in love with Xiao Meng. But Xiao Meng left for the United States to further her studies, and Zai Jun and Lei lost touch with her for eight years. During that time, the men raised Xiao Meng’s daughter, Miao Miao, whom Xiao Meng left behind. But when Xiao Meng suddenly returns after eight years and wants her daughter back, will her reappearance reignite the the emotional rivaly between Zai Jun and Lei?", "rate": 0, "genre": ["Drama"], "cast": ["Hawick Lau", "Guli Nazha", "Sun Yizhou"], "character": ["Zu Zai Jun", "Ning Xiao Meng", "Zheng Lei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68764   Expand First Love   (2016) User Score Overview They say absence makes the heart grow fonder. Zuo Zai Jun, Zheng Lei and Ning Xiao Meng were good friends in college. In fact, both Zai Jun and Lei were in love with Xiao Meng. But Xiao Meng left for the United States to further her studies, and Zai Jun and Lei lost touch with her for eight years. During that time, the men raised Xiao Meng’s daughter, Miao Miao, whom Xiao Meng left behind. But when Xiao Meng suddenly returns after eight years and wants her daughter back, will her reappearance reignite the the emotional rivaly between Zai Jun and Lei? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hawick Lau Zu Zai Jun Guli Nazha Ning Xiao Meng Sun Yizhou Zheng Lei Full Cast & Crew Last Season Season 1 2016 | 42 Episodes Season 1 of First Love premiered on May  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on First Love. You can help by rating TV shows you've seen. Facts Original Name  柠檬初上 Status  Ended Network JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china romance Content Score 56 We're so close, yet so far. Top Contributors M 25 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}