{"link": "https://www.themoviedb.org/tv/62504?language=en", "title": "Black Work", "resume": "'Black Work' is the story of Jo Gillespie, a woman who's husband is shot dead in the line of action, in his job as a undercover cop. Jo, a police officer herself soon has to confront issues in her marriage and family life in order to discover who really killed her husband.", "rate": 68, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Sheridan Smith", "Matthew McNulty", "Douglas Henshall", "James Foster", "Sharon Duce"], "character": ["Jo Gillespie", "DC Jack Clark", "DCS Hepburn", "Glover"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62504   Expand Black Work   (2015) User Score  Play Trailer Overview 'Black Work' is the story of Jo Gillespie, a woman who's husband is shot dead in the line of action, in his job as a undercover cop. Jo, a police officer herself soon has to confront issues in her marriage and family life in order to discover who really killed her husband. Featured Crew Tom Mullens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sheridan Smith Jo Gillespie Matthew McNulty DC Jack Clark Douglas Henshall DCS Hepburn James Foster Glover Sharon Duce Full Cast & Crew Last Season Season 1 2015 | 3 Episodes Season 1 of Black Work premiered on June 21, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2015-06-08 Stonemouth 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   https://www.itv.com/itvplayer/black-work Genres Crime Drama Mystery Keywords police undercover miniseries Content Score 100 Yes! Looking good! Top Contributors TB 43 TMDb Bot 18 Elizabeth Jennings 13 Banana t 11 tmdb48730457  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}