{"link": "https://www.themoviedb.org/tv/28007?language=en", "title": "The Agatha Christie Hour", "resume": "This ten episode program was based on ten short stories written by Agatha Christie but with wide-ranging themes. Some were romances, some had supernatural themes and a couple were adventures. The common link was that all came from the talented pen of Agatha Christie, all were entertaining and each drama was carefully crafted and well cast with many of Britain's best known actors of the time represented.", "rate": 60, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Angela Easterling", "Christopher Wren", "Maurice Denham", "Michael Aldridge", "Osmund Bullock"], "character": ["Miss Lemon", "Annette's Attendant", "Parker Pyne", "Dr. Lavington", "George Rowland"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28007   Expand The Agatha Christie Hour   (1982) User Score Overview This ten episode program was based on ten short stories written by Agatha Christie but with wide-ranging themes. Some were romances, some had supernatural themes and a couple were adventures. The common link was that all came from the talented pen of Agatha Christie, all were entertaining and each drama was carefully crafted and well cast with many of Britain's best known actors of the time represented. Featured Crew T.R. Bowen Creator William Corlett Creator Freda Kelsall Creator John Bryden Rodgers Creator Gerald Savory Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angela Easterling Miss Lemon Christopher Wren Annette's Attendant Maurice Denham Parker Pyne Michael Aldridge Dr. Lavington Osmund Bullock George Rowland Full Cast & Crew Last Season Season 1 1982 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Agatha Christie Hour. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tvshowsondvd.com/shows/Agatha-Christie-Hour/9750 Genres Action & Adventure Drama Mystery Keywords based on novel or book supernatural anthology criminal Content Score 93 Almost there... Top Contributors 72 CouchTater 28 Elizabeth Jennings z 21 zoroman2017 h 5 hanyny  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}