{"link": "https://www.themoviedb.org/tv/21805?language=en", "title": "The Naked Chef", "resume": "The Naked Chef was a BBC Two television cooking programme starring Jamie Oliver. It originally ran for three seasons plus three subsequent Christmas specials, and was produced by Optomen Television for the BBC. The show was Oliver's television debut, and was noted for its use of jumpy, close-up camera work, and the presenter's \"Mockney\" dialect and relaxed style—for example, Oliver would tear up herbs rather than chopping.\nThe programme was credited with inspiring men to cook due to Oliver's \"blokey\" approach.\nEach episode was notionally based around a social situation or event in Oliver's life, such as a hen night or babysitting his cousins.", "rate": 100, "genre": [], "cast": ["Jamie Oliver"], "character": ["The Naked Chef"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21805   Expand The Naked Chef   (1999) User Score Overview The Naked Chef was a BBC Two television cooking programme starring Jamie Oliver. It originally ran for three seasons plus three subsequent Christmas specials, and was produced by Optomen Television for the BBC. The show was Oliver's television debut, and was noted for its use of jumpy, close-up camera work, and the presenter's \"Mockney\" dialect and relaxed style—for example, Oliver would tear up herbs rather than chopping. The programme was credited with inspiring men to cook due to Oliver's \"blokey\" approach. Each episode was notionally based around a social situation or event in Oliver's life, such as a hen night or babysitting his cousins. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Oliver The Naked Chef Full Cast & Crew Last Season Season 3 2001 | 8 Episodes Season 3 of The Naked Chef premiered on October 16, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Naked Chef. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors W 5 Wiruss 3 Fludogenerator 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}