{"link": "https://www.themoviedb.org/tv/33765?language=en", "title": "My Little Pony: Friendship Is Magic", "resume": "\"Get your muzzle out of those books and make some friends!\" That's what Princess Celestia tells Twilight Sparkle. She may be the smartest unicorn in Equestria, but Twilight Sparkle gets an \"incomplete\" in friendship. There's more to life than learning magic, after all -- so she goes to Ponyville on a mission to make friends. There she meets five special ponies who take her on exciting adventures and teach her the most powerful magic of all ... the magic of friendship!", "rate": 61, "genre": ["Animation", "Comedy", "Family", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Tara Strong", "Andrea Libman", "Ashleigh Ball", "Tabitha St. Germain", "Cathy Weseluck"], "character": ["Twilight Sparkle (voice)", "Pinkie Pie / Fluttershy (voice)", "Rainbow Dash / Applejack (voice)", "Rarity / Princess Luna / Granny Smith / Mrs. Cake (voice)", "Spike / Mayor Mare (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33765   Expand My Little Pony: Friendship Is Magic   (2010) User Score  Play Trailer Overview \"Get your muzzle out of those books and make some friends!\" That's what Princess Celestia tells Twilight Sparkle. She may be the smartest unicorn in Equestria, but Twilight Sparkle gets an \"incomplete\" in friendship. There's more to life than learning magic, after all -- so she goes to Ponyville on a mission to make friends. There she meets five special ponies who take her on exciting adventures and teach her the most powerful magic of all ... the magic of friendship! Featured Crew Lauren Faust Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  23 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tara Strong Twilight Sparkle (voice) Andrea Libman Pinkie Pie / Fluttershy (voice) Ashleigh Ball Rainbow Dash / Applejack (voice) Tabitha St. Germain Rarity / Princess Luna / Granny Smith / Mrs. Cake (voice) Cathy Weseluck Spike / Mayor Mare (voice) Full Cast & Crew Current Season Season 8 2018 | 26 Episodes Season 8 of My Little Pony: Friendship Is Magic premiered on March 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  23 Posters  12 Recommendations   2013-10-18 The Birthday Boys 7.1    2010-10-15 The Adventures of Chuck and Friends 6.0    2008-09-01 Sid the Science Kid 6.1    2015-01-10 My Sunshine 7.4    2015-09-12 Goldie & Bear 5.4    2012-02-18 Transformers: Rescue Bots 6.8    2011-09-05 Zig and Sharko 5.3    2007-09-03 Super Why! 5.7  Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.hasbrostudios.com/shows/page/title/my-little-pony Genres Animation Comedy Family Kids Sci-Fi & Fantasy Keywords friendship magic pony rainbow kids unicorn Content Score 100 Yes! Looking good! Top Contributors 125 Josh Dudley 102 Elizabeth Jennings 50 boy0815 26 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}