{"link": "https://www.themoviedb.org/tv/12511?language=en", "title": "Then Came Bronson", "resume": "Then Came Bronson is an American adventure/drama television series starring Michael Parks that aired on NBC from 1969 to 1970, and was produced by MGM Television. The series, created by Denne Bart Petitclerc, began with a movie pilot on Monday, March 24, 1969. The series was approved for one year and began its first run on September 17, 1969. The pilot was also released in Europe as a feature film.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Michael Parks"], "character": ["Jim Bronson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12511   Expand Then Came Bronson   (1969) User Score Overview Then Came Bronson is an American adventure/drama television series starring Michael Parks that aired on NBC from 1969 to 1970, and was produced by MGM Television. The series, created by Denne Bart Petitclerc, began with a movie pilot on Monday, March 24, 1969. The series was approved for one year and began its first run on September 17, 1969. The pilot was also released in Europe as a feature film. Featured Crew Denne Bart Petitclerc Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Parks Jim Bronson Full Cast & Crew Last Season Season 1 1969 | 26 Episodes Season 1 of Then Came Bronson premiered on September 17, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Then Came Bronson. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Action & Adventure Drama Keywords vagabond good deed traveller Content Score 64 We're so close, yet so far. Top Contributors 17 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}