{"link": "https://www.themoviedb.org/tv/34517?language=en", "title": "The Vanilla Ice Project", "resume": "The Vanilla Ice Project is an American reality documentary television series on the DIY Network. It is hosted by handyman and rapper Rob Van Winkle a.k.a. Vanilla Ice who has experience with home improvement and flipping since the 1990s buying houses in his early twenties and getting more into home improvement starting in 1998. Season 2 of The Vanilla Ice Project premiered on January 21, 2012 and features a new house and more up-to-date and state-of-the-art improvements. To mark the premiere, Vanilla Ice posted live Tweets during the show on Twitter, answering fan questions and commenting on the show. Due to the success of the show, Vanilla Ice launched a training course that aims to help others succeed at real estate investing.\nIn addition to winning the Telly Award, the Factual Entertainment Award and Hermes Platinum Press Award, Season One of \"The Vanilla Ice Project\" was selected as a finalist for the Cable Fax Awards.", "rate": 60, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34517   Expand The Vanilla Ice Project   (2010) User Score  Play Trailer Overview The Vanilla Ice Project is an American reality documentary television series on the DIY Network. It is hosted by handyman and rapper Rob Van Winkle a.k.a. Vanilla Ice who has experience with home improvement and flipping since the 1990s buying houses in his early twenties and getting more into home improvement starting in 1998. Season 2 of The Vanilla Ice Project premiered on January 21, 2012 and features a new house and more up-to-date and state-of-the-art improvements. To mark the premiere, Vanilla Ice posted live Tweets during the show on Twitter, answering fan questions and commenting on the show. Due to the success of the show, Vanilla Ice launched a training course that aims to help others succeed at real estate investing. In addition to winning the Telly Award, the Factual Entertainment Award and Hermes Platinum Press Award, Season One of \"The Vanilla Ice Project\" was selected as a finalist for the Cable Fax Awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2016 | 9 Episodes Season 6 of The Vanilla Ice Project premiered on April 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Vanilla Ice Project. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   www.diynetwork.com/shows/the-vanilla-ice-project Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors d 6 dhappyone a 2 apung21 EL 2 Erica L Thompson 1 Obong Squad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}