{"link": "https://www.themoviedb.org/tv/39958?language=en", "title": "Bent", "resume": "Bent is an American romantic comedy television series that ran on NBC from March 21 to April 4, 2012. The series was created by Tad Quill and stars Amanda Peet as a recently divorced lawyer and David Walton as the irresponsible general contractor hired to remodel her kitchen. Supporting roles are played by Jeffrey Tambor, Margo Harshman, and Joey King. On May 11, 2012, NBC cancelled the sitcom.", "rate": 66, "genre": ["Comedy"], "cast": ["Jeffrey Tambor", "Amanda Peet", "David Walton", "Margo Harshman", "Joey King"], "character": ["Walt Riggins", "Alex Meyers", "Pete Riggins", "Screwsie", "Charlie Meyers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39958   Expand Bent   (2012) User Score Overview Bent is an American romantic comedy television series that ran on NBC from March 21 to April 4, 2012. The series was created by Tad Quill and stars Amanda Peet as a recently divorced lawyer and David Walton as the irresponsible general contractor hired to remodel her kitchen. Supporting roles are played by Jeffrey Tambor, Margo Harshman, and Joey King. On May 11, 2012, NBC cancelled the sitcom. Featured Crew Tad Quill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Tambor Walt Riggins Amanda Peet Alex Meyers David Walton Pete Riggins Margo Harshman Screwsie Joey King Charlie Meyers Full Cast & Crew Last Season Season 1 2012 | 6 Episodes Season 1 of Bent premiered on March 21, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2012-08-12 Animal Practice 4.7    2011-01-12 Off the Map 6.9    2012-09-25 Ben and Kate 5.9    2013-09-23 Trophy Wife 5.7    2011-09-14 Up All Night 6.2    2012-08-08 Go On 6.2    2014-09-30 Manhattan Love Story 6.2    2012-09-24 Partners 5.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  21m Homepage   http://www.nbc.com/bent/ Genres Comedy Keywords bachelor womanizer single mother blue collar worker sitcom Content Score 93 Almost there... Top Contributors 22 Banana z 10 zurman1 h 3 heisenbeerg 3 colonelgrant  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}