{"link": "https://www.themoviedb.org/tv/4538?language=en", "title": "Nightmare Cafe", "resume": "Nightmare Cafe is a short-lived American telefantasy program which aired on NBC for an abridged first season from January to April 1992. While the overall tone of the program was that of a mystical fantasy, it frequently incorporated elements of dark humor, horror, and even outright comedy. A total of six episodes were produced before low ratings led to its cancellation. The series has subsequently been shown on the Sci Fi Channel as part of their Series Collection. The series began showing on NBC Universal's horror and suspense-themed cable channel, Chiller in March 2009.", "rate": 45, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Jack Coleman", "Lindsay Frost", "Robert Englund"], "character": ["Frank Nolan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4538   Expand Nightmare Cafe   (1992) User Score Overview Nightmare Cafe is a short-lived American telefantasy program which aired on NBC for an abridged first season from January to April 1992. While the overall tone of the program was that of a mystical fantasy, it frequently incorporated elements of dark humor, horror, and even outright comedy. A total of six episodes were produced before low ratings led to its cancellation. The series has subsequently been shown on the Sci Fi Channel as part of their Series Collection. The series began showing on NBC Universal's horror and suspense-themed cable channel, Chiller in March 2009. Featured Crew Wes Craven Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Coleman Frank Nolan Lindsay Frost Robert Englund Full Cast & Crew Last Season Season 1 1992 | 6 Episodes Season 1 of Nightmare Cafe premiered on January 29, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Nightmare Cafe. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Sci-Fi & Fantasy Keywords teleportation restaurant second chance good deed Content Score 64 We're so close, yet so far. Top Contributors 9 Banana 3 Zlogorek 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}