{"link": "https://www.themoviedb.org/tv/61814?language=en", "title": "Spy", "resume": "The fictional story begins after the execution of real-life North Korean general Jang Sung-taek. One day an order comes down from North Korea, reactivating erstwhile spy Park Hye-rim who has spent decades in South Korea as an ordinary housewife. She is given the mission to turn and bring in her own son, Kim Seonu. Cool-headed, quick-witted genius Seonu is an information analyst on North Korea working for the NIS. His girlfriend Yoon-jin is a tour guide for Chinese tourists who cannot speak Chinese, and they fell in love when Seonu helped her translate. Hye-rim is suddenly forced to choose between her son and country, and risks her life to see the choice through.", "rate": 75, "genre": ["Drama"], "cast": ["Kim Jae-joong", "Bae Jong-ok", "Yu Oh-seong", "Ko Sung-hee", "Chae Soo-bin"], "character": ["Kim Seon-woo", "Park Hye-rim", "Hwang Ki-chul", "Lee Yoon-jin", "Jo Soo-yeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61814   Expand Spy   (2015) User Score Overview The fictional story begins after the execution of real-life North Korean general Jang Sung-taek. One day an order comes down from North Korea, reactivating erstwhile spy Park Hye-rim who has spent decades in South Korea as an ordinary housewife. She is given the mission to turn and bring in her own son, Kim Seonu. Cool-headed, quick-witted genius Seonu is an information analyst on North Korea working for the NIS. His girlfriend Yoon-jin is a tour guide for Chinese tourists who cannot speak Chinese, and they fell in love when Seonu helped her translate. Hye-rim is suddenly forced to choose between her son and country, and risks her life to see the choice through. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Jae-joong Kim Seon-woo Bae Jong-ok Park Hye-rim Yu Oh-seong Hwang Ki-chul Ko Sung-hee Lee Yoon-jin Chae Soo-bin Jo Soo-yeon Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Spy premiered on January  9, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Spy. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Spy. You can help by rating TV shows you've seen. Facts Original Name  스파이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://www.kbs.co.kr/drama/spy2015/ Genres Drama Keywords korea Content Score 93 Almost there... Top Contributors M 42 Maria180493 5 Elizabeth Jennings t 5 tmdb983464 l 4 llluqiang  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}