{"link": "https://www.themoviedb.org/tv/13669?language=en", "title": "Decoy", "resume": "Decoy is a groundbreaking American crime drama television series created for syndication and initially broadcast from October 14, 1957 to July 7, 1958, with thirty-nine 30-minute black-and-white episodes. It was the first American police series with a female protagonist. Many Decoy episodes are in the public domain.", "rate": 0, "genre": ["Drama"], "cast": ["Beverly Garland"], "character": ["Casey Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13669   Expand Decoy   (1957) User Score Overview Decoy is a groundbreaking American crime drama television series created for syndication and initially broadcast from October 14, 1957 to July 7, 1958, with thirty-nine 30-minute black-and-white episodes. It was the first American police series with a female protagonist. Many Decoy episodes are in the public domain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Beverly Garland Casey Jones Full Cast & Crew Last Season Season 1 1957 | 39 Episodes Season 1 of Decoy premiered on October 14, 1957. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Decoy. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors B 1 Bob k 1 karina_petrova  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}