{"link": "https://www.themoviedb.org/tv/68123?language=en", "title": "Deep Water", "resume": "Detectives Tori Lustigman and Nick Manning are assigned a brutal murder case in Bondi, where they begin to uncover mounting evidence to suggest the killing is connected to a spate of unexplained deaths, \"suicides\" and disappearances throughout the 80s and 90s. Haunted by the disappearance of her teenage brother, Tori's fascination with the case soon turns to fixation. When more ritualistic murders occur with the same bizarre signature, Tori and Nick will need to put their relationships, their careers and their lives on the line to finally reveal the truth.", "rate": 62, "genre": ["Crime", "Drama"], "cast": ["Noah Taylor", "Yael Stone", "William McInnes", "Jeremy Lindsay Taylor", "Craig McLachlan"], "character": ["as Detective Nick Manning", "as Detective Tori Lustigman", "Inspector Peel", "Oscar Taylor", "Kyle 'Hammers' Hampton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68123   Expand Deep Water   (2016) User Score  Play Trailer Overview Detectives Tori Lustigman and Nick Manning are assigned a brutal murder case in Bondi, where they begin to uncover mounting evidence to suggest the killing is connected to a spate of unexplained deaths, \"suicides\" and disappearances throughout the 80s and 90s. Haunted by the disappearance of her teenage brother, Tori's fascination with the case soon turns to fixation. When more ritualistic murders occur with the same bizarre signature, Tori and Nick will need to put their relationships, their careers and their lives on the line to finally reveal the truth. Featured Crew Shawn Seet Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  7 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noah Taylor as Detective Nick Manning Yael Stone as Detective Tori Lustigman William McInnes Inspector Peel Jeremy Lindsay Taylor Oscar Taylor Craig McLachlan Kyle 'Hammers' Hampton Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Deep Water premiered on October  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  10 Posters  7 Recommendations   2016-09-30 The Level 6.5  Facts Status  Ended Network Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Miniseries Original Language  English Runtime  55m Homepage   http://www.sbs.com.au/programs/deep-water Genres Crime Drama Keywords murder serial killer miniseries Content Score 100 Yes! Looking good! Top Contributors TB 50 TMDb Bot 23 Elizabeth Jennings s 14 sindirahardian z 13 zyck  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}