{"link": "https://www.themoviedb.org/tv/11129?language=en", "title": "S.W.A.T.", "resume": "S.W.A.T. is an American action/crime drama series about the adventures of a Special Weapons And Tactics team operating in an unidentified California city. A spin-off of The Rookies, the series aired on ABC from February 1975 to April 1976.\nLike The Rookies, S.W.A.T. was produced by Aaron Spelling and Leonard Goldberg.", "rate": 59, "genre": ["Action", "Adventure", "Drama"], "cast": ["Robert Urich", "Steve Forrest", "Mark Shera", "Rod Perry", "James Coleman"], "character": ["Officer Jim Street", "Officer T.J. McCabe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11129   Expand S.W.A.T.   (1975) User Score Overview S.W.A.T. is an American action/crime drama series about the adventures of a Special Weapons And Tactics team operating in an unidentified California city. A spin-off of The Rookies, the series aired on ABC from February 1975 to April 1976. Like The Rookies, S.W.A.T. was produced by Aaron Spelling and Leonard Goldberg. Featured Crew Robert Hamner Creator Lee Stanley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  1 Top Billed Cast Robert Urich Officer Jim Street Steve Forrest Mark Shera Rod Perry James Coleman Officer T.J. McCabe Full Cast & Crew Last Season Season 2 1975 | 25 Episodes Season 2 of S.W.A.T. premiered on September 13, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  3 Posters  2 Recommendations   1965-09-15 I Spy 6.9    1966-09-08 Tarzan 5.5    1954-10-15 The Adventures of Rin Tin Tin 6.5    1970-09-16 McCloud 7.0    1973-01-28 Barnaby Jones 8.0    1951-12-16 Dragnet 7.0    1959-10-15 The Untouchables 8.2    1968-01-09 It Takes a Thief 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 6 lineker 5 Steve S 3 Shady12 i 3 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}