{"link": "https://www.themoviedb.org/tv/34833?language=en", "title": "Betterman", "resume": "Betterman is a Japanese anime television series which began airing in 1999. It was created by Sunrise's internal \"Studio 7\" under the direction of Yoshitomo Yonetani. Betterman uses heavily Jungian symbolism and themes, such as Animus.\nThe series was translated into English by The Ocean Group in Vancouver, British Columbia at their Blue Water Studios facility in Calgary, Alberta.", "rate": 0, "genre": ["Animation"], "cast": ["Kappei Yamaguchi", "Takehito Koyasu", "Chafurin", "Chafurin", "Houko Kuwashima"], "character": ["Keita Aono", "Betterman Lamia", "Akamatsu", "Shigeru Akamatsu", "Chandy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34833   Expand Betterman   (1999) User Score Overview Betterman is a Japanese anime television series which began airing in 1999. It was created by Sunrise's internal \"Studio 7\" under the direction of Yoshitomo Yonetani. Betterman uses heavily Jungian symbolism and themes, such as Animus. The series was translated into English by The Ocean Group in Vancouver, British Columbia at their Blue Water Studios facility in Calgary, Alberta. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kappei Yamaguchi Keita Aono Takehito Koyasu Betterman Lamia Chafurin Akamatsu Chafurin Shigeru Akamatsu Houko Kuwashima Chandy Full Cast & Crew Last Season Season 1 2003 | 26 Episodes Season 1 of Betterman premiered on February 10, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Betterman. You can help by rating TV shows you've seen. Facts Original Name  ベターマン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 9 BrerFox 3 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}