{"link": "https://www.themoviedb.org/tv/8616?language=en", "title": "Total Drama Action", "resume": "After losing a chance to win a million dollars, campers from \"Total Drama Island\" get a second chance to win a million dollars through movie-oriented challenges for the next 6 weeks.", "rate": 57, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama"], "cast": ["Megan Fahlenbock", "Adam Greydon Reid", "Kristin Fairlie", "Drew Nelson", "Dan Petronijevic"], "character": ["Gwen", "Justin", "Bridgette", "Duncan", "Geoff"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8616   Expand Total Drama Action   (2009) User Score Overview After losing a chance to win a million dollars, campers from \"Total Drama Island\" get a second chance to win a million dollars through movie-oriented challenges for the next 6 weeks. Featured Crew Jennifer Pertsch Creator Tom McGillis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megan Fahlenbock Gwen Adam Greydon Reid Justin Kristin Fairlie Bridgette Drew Nelson Duncan Dan Petronijevic Geoff Full Cast & Crew Last Season Season 1 2009 | 26 Episodes Season 1 of Total Drama Action premiered on January 11, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2007-07-08 Total Drama Island 6.2  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.totaldramaaction.com/ Genres Action & Adventure Animation Comedy Drama Keywords competition sequel Content Score 93 Almost there... Top Contributors 12 Banana 8 bloodgangsta 5 lineker w 4 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}