{"link": "https://www.themoviedb.org/tv/64975?language=en", "title": "The Supervet", "resume": "Dr. Noel Fitzpatrick is one of England's top veterinarians. \"Supervet\" showcases Fitzpatrick and his staff treating hard-to-cure ailments with innovative care and surgical techniques. The program gives the often-emotional stories of pets, owners and the passionate team that pushes boundaries of medicine to save animals from life-threatening conditions. Nicknamed the Bionic Vet, Fitzpatrick employs more than 100 people at his neurosurgery/orthopedic clinic in Surrey, England.", "rate": 90, "genre": ["Reality"], "cast": ["Padraig Egan", "Noel Fitzpatrick", "Philippa Mackie", "Hannah Prince", "Sarah Fleming"], "character": ["Himself - Veterinary Surgeon (as Padraig)", "Himself - Veterinary Surgeon (as Noel)", "Herself - Veterinary Nurse (as Philippa)", "Herself - Veterinary Nurse (as Hannah)", "Herself - Veterinary Intern (as Sarah)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64975   Expand The Supervet   (2014) User Score Overview Dr. Noel Fitzpatrick is one of England's top veterinarians. \"Supervet\" showcases Fitzpatrick and his staff treating hard-to-cure ailments with innovative care and surgical techniques. The program gives the often-emotional stories of pets, owners and the passionate team that pushes boundaries of medicine to save animals from life-threatening conditions. Nicknamed the Bionic Vet, Fitzpatrick employs more than 100 people at his neurosurgery/orthopedic clinic in Surrey, England. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Padraig Egan Himself - Veterinary Surgeon (as Padraig) Noel Fitzpatrick Himself - Veterinary Surgeon (as Noel) Philippa Mackie Herself - Veterinary Nurse (as Philippa) Hannah Prince Herself - Veterinary Nurse (as Hannah) Sarah Fleming Herself - Veterinary Intern (as Sarah) Full Cast & Crew Last Season Season 9 2017 | 11 Episodes Season 9 of The Supervet premiered on April 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Supervet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  47m Homepage   http://www.thesupervet.com/ Genres Reality Keywords veterinarian Content Score 71 Just a little bit more... Top Contributors O 54 Omniavincitamor 18 janar R 5 Rebecca 4 Markxist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}