{"link": "https://www.themoviedb.org/tv/60554?language=en", "title": "Star Wars Rebels", "resume": "Set between the events of Star Wars: Episodes III and IV, the story unfolds during a dark time when the evil Galactic Empire is tightening its grip of power on the galaxy. Imperial forces have occupied a remote planet and are ruining the lives of its people. The motley but clever crew of the starship Ghost — cowboy Jedi Kanan, ace pilot Hera, street-smart teenager Ezra, the “muscle” Zeb, warrior firebrand Sabine, and cantankerous old astromech droid Chopper — is among a select few who are brave enough to stand against the Empire. Together, they will face threatening new villains, encounter colorful adversaries, embark on thrilling adventures, and become heroes with the power to ignite a rebellion.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Freddie Prinze Jr.", "David Oyelowo", "Taylor Gray", "Vanessa Marshall", "Tiya Sircar"], "character": ["Kanan Jarrus (voice)", "Agent Kallus (voice)", "Ezra Bridger (voice)", "Hera Syndulla (voice)", "Sabine Wren (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60554   Expand Star Wars Rebels   (2014) User Score  Play Trailer Overview Set between the events of Star Wars: Episodes III and IV, the story unfolds during a dark time when the evil Galactic Empire is tightening its grip of power on the galaxy. Imperial forces have occupied a remote planet and are ruining the lives of its people. The motley but clever crew of the starship Ghost — cowboy Jedi Kanan, ace pilot Hera, street-smart teenager Ezra, the “muscle” Zeb, warrior firebrand Sabine, and cantankerous old astromech droid Chopper — is among a select few who are brave enough to stand against the Empire. Together, they will face threatening new villains, encounter colorful adversaries, embark on thrilling adventures, and become heroes with the power to ignite a rebellion. Featured Crew Simon Kinberg Creator Dave Filoni Creator Carrie Beck Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  16 Images Backdrops  8 Posters  23 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Freddie Prinze Jr. Kanan Jarrus (voice) David Oyelowo Agent Kallus (voice) Taylor Gray Ezra Bridger (voice) Vanessa Marshall Hera Syndulla (voice) Tiya Sircar Sabine Wren (voice) Full Cast & Crew Current Season Season 4 2017 | 15 Episodes View All Seasons Social Reviews  0 Discussions  25 Subject Status Replies Last Reply Thrawn is ruining this show Open 0 by revengine\n      \n     'Through Imperial Eyes' - one of the best episodes Open 1 by  revengine So, they start focusing on Sabine... Open 2 by  manfromatlantis Go to Discussions Media Most Popular Videos  2 Backdrops  8 Posters  23 Recommendations   2008-10-03 Star Wars: The Clone Wars 7.4    2011-11-11 Green Lantern: The Animated Series 7.2    2011-07-29 ThunderCats 6.4    2003-11-07 Star Wars: Clone Wars 6.7    2012-04-01 Marvel's Ultimate Spider-Man 6.6    2013-03-23 Monsters vs. Aliens 5.0    1994-10-01 WildC.A.T.s 4.7    2011-09-19 Kung Fu Panda: Legends of Awesomeness 6.7  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  25m Homepage   http://disneyxd.disney.com/star-wars-rebels Genres Action & Adventure Animation Keywords space opera Content Score 100 Yes! Looking good! Top Contributors 66 Elizabeth Jennings 34 Travis Bell h 26 helmy 25 Jorge Torre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}