{"link": "https://www.themoviedb.org/tv/78835?language=en", "title": "Speakerine", "resume": "July 1962. Christine Beauval, star speaker of the RTF, is a fulfilled woman who leads her life as a wife and mother, as well as an ambitious professional career. But in the spotlight, when she should speak, her body suddenly falls, bloody. A few days earlier, her husband Pierre was appointed head of Mondovision by his friend Eric Jauffret, Minister of Information.", "rate": 100, "genre": ["Drama"], "cast": ["Anne-Sophie Soldaïni", "Baptiste Carrion-Weiss", "Marie Gillain", "Guillaume de Tonquédec", "Grégory Fitoussi"], "character": ["Colette Beauval", "Jean-Claude Beauval", "Christine Beauval", "Pierre Beauval", "Eric Jauffret"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78835   Expand Speakerine   (2018) User Score Overview July 1962. Christine Beauval, star speaker of the RTF, is a fulfilled woman who leads her life as a wife and mother, as well as an ambitious professional career. But in the spotlight, when she should speak, her body suddenly falls, bloody. A few days earlier, her husband Pierre was appointed head of Mondovision by his friend Eric Jauffret, Minister of Information. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne-Sophie Soldaïni Colette Beauval Baptiste Carrion-Weiss Jean-Claude Beauval Marie Gillain Christine Beauval Guillaume de Tonquédec Pierre Beauval Grégory Fitoussi Eric Jauffret Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Speakerine premiered on April 16, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Speakerine. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Speakerine. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Scripted Original Language  French Runtime  52m Homepage   https://www.france.tv/france-2/speakerine/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 30 michael47 5 Kelian n 3 nykolas1981 2 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}