{"link": "https://www.themoviedb.org/tv/1012?language=en", "title": "That Peter Kay Thing", "resume": "That Peter Kay Thing is a series of six spoof documentaries shown on Channel 4 in January 1999. Set in and around Bolton, these follows the lives of different characters and stars Peter Kay as the subject of each documentary. All of the episodes display Kay's penchant for nostalgic humour and unsympathetic lead characters. The series was narrated by Andrew Sachs. Many of the plot lines were based around actual events from Kay's life. At least six of the characters appear in the spin-off series Peter Kay's Phoenix Nights.", "rate": 64, "genre": ["Comedy"], "cast": ["Neil Fitzmaurice", "Paddy McGuinness", "Toby Foster", "Mark Jackson", "Jo Enright"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1012   Expand That Peter Kay Thing   (2000) User Score Overview That Peter Kay Thing is a series of six spoof documentaries shown on Channel 4 in January 1999. Set in and around Bolton, these follows the lives of different characters and stars Peter Kay as the subject of each documentary. All of the episodes display Kay's penchant for nostalgic humour and unsympathetic lead characters. The series was narrated by Andrew Sachs. Many of the plot lines were based around actual events from Kay's life. At least six of the characters appear in the spin-off series Peter Kay's Phoenix Nights. Featured Crew Peter Kay Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Fitzmaurice Paddy McGuinness Toby Foster Mark Jackson Jo Enright Full Cast & Crew Last Season Season 1 2000 | 7 Episodes Season 1 of That Peter Kay Thing premiered on January 12, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for That Peter Kay Thing. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2002-11-14 Harry Hill's TV Burp 7.2    1995-08-12 Soccer AM 5.0    1989-11-08 Byker Grove 6.3    1990-09-27 Rab C. Nesbitt 7.1    1971-04-10 The Two Ronnies 9.0    1998-11-12 Dinnerladies 6.4    A Question of Sport 6.5    1987-01-07 Filthy Rich & Catflap 6.7  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords reality spoof mockumentary british comedy british humour fly-on-the-wall Content Score 79 Pump it up! We're close now. Top Contributors a 8 alexmate 5 Banana O 3 Ozbourne 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}