{"link": "https://www.themoviedb.org/tv/6070?language=en", "title": "Oliver's Twist", "resume": "Oliver's Twist is a television series featuring chef Jamie Oliver, the name of the programme is a pun on the title of Charles Dickens' novel Oliver Twist. Following the popularity of his first TV series, The Naked Chef, he began producing Oliver's Twist to be aired outside the UK. The show became a success, being aired in over 70 countries and helping to establish Oliver's global popularity.", "rate": 100, "genre": [], "cast": ["Jamie Oliver"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6070   Expand Oliver's Twist   (2002) User Score Overview Oliver's Twist is a television series featuring chef Jamie Oliver, the name of the programme is a pun on the title of Charles Dickens' novel Oliver Twist. Following the popularity of his first TV series, The Naked Chef, he began producing Oliver's Twist to be aired outside the UK. The show became a success, being aired in over 70 countries and helping to establish Oliver's global popularity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Oliver Full Cast & Crew Last Season Season 1 2002 | 26 Episodes Season 1 of Oliver's Twist premiered on May 14, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oliver's Twist. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords kitchen food recipe Content Score 50 Still needs a little work. Top Contributors 3 Drek s 2 sheva_vitali K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}