{"link": "https://www.themoviedb.org/tv/61063?language=en", "title": "Isan Gentleman", "resume": "Prim’s father is accused of doing something wrong and is put in jail. He was like a governor of a small town. This town was not really ruled by the governor but by this big mob guy. Prim’s dad was in the way so he wanted to get rid of him. Warit becomes the new governor. Prim pretends to be a boy and becomes a worker at Warit’s house. He’s not really fond of gay people so he makes sure that she’s not gay cause to him she looks like a girl. She tells him that she is the unlawful son of the governor and wants his help to help her dad get out of jail. He agrees to help by getting closer to Best the mob guys daughter. He also finds himself falling in love with Prim in form of a boy so he thinks that he’s becoming a gay. Finally he accepts it and tells her[in form of a boy] that he loves her and they become a couple. He wants her to have a sex change. Anyway he married Best to get closer to the truth. Until in the end Best and her father die. Prim’s dad is let out and he finds out that she’s a girl. He is mad that she lied but he still thinks about her. She comes to him and tries to get his forgiveness but he brushed her off. She gets on the bus in disappointment. He realizes that he needs her and rides his motorcycle and stops it in front of her bus. She thought that the bus hit him and begins to cry. Then out of the ditch he came walking towards her and they hug.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Prima Bhunjaroeun", "Warit Sirisantana", "Chanidapa Pongsilpipat", "Thana Chatborirak", "Pichetchai Pholdee"], "character": ["Saleen/Yang", "Jed", "Yodying"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61063   Expand Isan Gentleman   (2013) User Score Overview Prim’s father is accused of doing something wrong and is put in jail. He was like a governor of a small town. This town was not really ruled by the governor but by this big mob guy. Prim’s dad was in the way so he wanted to get rid of him. Warit becomes the new governor. Prim pretends to be a boy and becomes a worker at Warit’s house. He’s not really fond of gay people so he makes sure that she’s not gay cause to him she looks like a girl. She tells him that she is the unlawful son of the governor and wants his help to help her dad get out of jail. He agrees to help by getting closer to Best the mob guys daughter. He also finds himself falling in love with Prim in form of a boy so he thinks that he’s becoming a gay. Finally he accepts it and tells her[in form of a boy] that he loves her and they become a couple. He wants her to have a sex change. Anyway he married Best to get closer to the truth. Until in the end Best and her father die. Prim’s dad is let out and he finds out that she’s a girl. He is mad that she lied but he still thinks about her. She comes to him and tries to get his forgiveness but he brushed her off. She gets on the bus in disappointment. He realizes that he needs her and rides his motorcycle and stops it in front of her bus. She thought that the bus hit him and begins to cry. Then out of the ditch he came walking towards her and they hug. Featured Crew Cubic Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Prima Bhunjaroeun Saleen/Yang Warit Sirisantana Jed Chanidapa Pongsilpipat Yodying Thana Chatborirak Pichetchai Pholdee Full Cast & Crew Last Season Season 1 2013 | 31 Episodes Season 1 of Isan Gentleman premiered on June  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Isan Gentleman. You can help by rating TV shows you've seen. Facts Original Name  ผู้ดีอีสาน Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  55m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 38 Crip TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}