{"link": "https://www.themoviedb.org/tv/30688?language=en", "title": "Meister Eder und sein Pumuckl", "resume": "Pumuckl is a Kobold from a German radio play series for children. He is a descendant of the Klabautermänner. He is invisible to people around him except for the master carpenter Eder with whom Pumuckl lives.\nPumuckl was invented by Ellis Kaut for a radio play series of the Bavarian Radio in 1961. Later on it was turned into a very successful TV series. Three movies and a musical also deal with the adventures of the little kobold.\nPumuckl is one of the most popular characters in children's entertainment in Germany and several generations have now grown up with the cheeky but funny little Kobold.", "rate": 66, "genre": ["Kids", "Family"], "cast": ["Gustl Bayrhammer", "Hans Clarin", "Toni Berger", "Erni Singerl"], "character": ["Meister Eder", "Pumuckl (Voice)", "Mechanikermeister Toni Schmitt", "Frau Eichinger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30688   Expand Meister Eder und sein Pumuckl   (1982) User Score Overview Pumuckl is a Kobold from a German radio play series for children. He is a descendant of the Klabautermänner. He is invisible to people around him except for the master carpenter Eder with whom Pumuckl lives. Pumuckl was invented by Ellis Kaut for a radio play series of the Bavarian Radio in 1961. Later on it was turned into a very successful TV series. Three movies and a musical also deal with the adventures of the little kobold. Pumuckl is one of the most popular characters in children's entertainment in Germany and several generations have now grown up with the cheeky but funny little Kobold. Featured Crew Ulrich König Creator Ellis Kaut Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gustl Bayrhammer Meister Eder Hans Clarin Pumuckl (Voice) Toni Berger Mechanikermeister Toni Schmitt Erni Singerl Frau Eichinger Full Cast & Crew Last Season Season 2 1988 | 26 Episodes Season 2 of Meister Eder und sein Pumuckl premiered on October  1, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1971-03-07 Die Sendung mit der Maus 6.4    1981-02-14 Wanna bet, that..? 3.2    1980-01-08 The Wonderful Adventures of Nils 6.8    1981-10-09 Dogtanian and the Three Muskehounds 6.5    1960-11-14 Popeye the Sailor 5.8    1964-12-18 The Pink Panther Show 7.0    1966-09-17 Mission: Impossible 7.3    1964-09-24 The Munsters 7.1  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  German Runtime  25m Homepage  - Genres Kids Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 25 Samara V 23 Vivo M 17 Mec!as B 12 Boxi88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}