{"link": "https://www.themoviedb.org/tv/65617?language=en", "title": "Choco Bank", "resume": "Choco Bank is about a guy named Kim Eun Haeng, who is a college graduate entering the workforce. His father made sure he had a lucky start in life by giving him a name that meant money. Eun Haeng (meaning Bank in Korean) will deal with the concerns many in their 20s struggle with when they start working for the very first time.And a girl named Ha Cho Co who is getting ready to start a business. The story plays out as the two meet and finds out more about the financial service industry.", "rate": 80, "genre": ["Comedy", "Romance"], "cast": ["Kai", "Park Eun Bin", "Yeon Jun-seok", "Lee Il-hwa"], "character": ["Kim Eun-haeng", "Ha Cho-co", "Bae Dal-su", "Eun-haeng's mother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65617   Expand Choco Bank   (2016) User Score Overview Choco Bank is about a guy named Kim Eun Haeng, who is a college graduate entering the workforce. His father made sure he had a lucky start in life by giving him a name that meant money. Eun Haeng (meaning Bank in Korean) will deal with the concerns many in their 20s struggle with when they start working for the very first time.And a girl named Ha Cho Co who is getting ready to start a business. The story plays out as the two meet and finds out more about the financial service industry. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kai Kim Eun-haeng Park Eun Bin Ha Cho-co Yeon Jun-seok Bae Dal-su Lee Il-hwa Eun-haeng's mother Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Choco Bank premiered on February 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Choco Bank. You can help by rating TV shows you've seen. Facts Original Name  초코 뱅크 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  10m Homepage   http://tvcast.naver.com/chocobank/ Genres Comedy Romance Keywords korea Content Score 71 Just a little bit more... Top Contributors M 28 Maria180493 z 10 zurman1 5 Elizabeth Jennings 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}