{"link": "https://www.themoviedb.org/tv/35576?language=en", "title": "Vermist", "resume": "Vermist is a Dutch language crime drama produced by Belgian broadcaster VT4 and Netherlands production company Eyeworks. It is broadcast on VT4 and a French language version—Urgence disparitions—is shown by W9.\nBased on the characters and background of the successful Flemish film Vermist, the first episode was broadcast on March 25, 2008. A second season was broadcast in 2010.", "rate": 100, "genre": ["Drama"], "cast": ["Stan Van Samang", "Joke Devynck", "Kevin Janssens", "Axel Daeseleire", "Catherine Kools"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35576   Expand Vermist   (2008) User Score Overview Vermist is a Dutch language crime drama produced by Belgian broadcaster VT4 and Netherlands production company Eyeworks. It is broadcast on VT4 and a French language version—Urgence disparitions—is shown by W9. Based on the characters and background of the successful Flemish film Vermist, the first episode was broadcast on March 25, 2008. A second season was broadcast in 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stan Van Samang Joke Devynck Kevin Janssens Axel Daeseleire Catherine Kools Full Cast & Crew Last Season Season 4 2012 | 10 Episodes Season 4 of Vermist premiered on September 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Vermist. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.vt4.be/vermist/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Elizabeth Jennings 1 Maretoh N 1 Nada2007  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}