{"link": "https://www.themoviedb.org/tv/2930?language=en", "title": "Blue Murder", "resume": "Blue Murder is a Canadian crime drama television series, featuring stories that reflected the turbulence of urban life and the crimes that make headlines. The Blue Murder squad members were an elite group of big-city investigators out to solve some of the city's most complicated and riveting crimes.", "rate": 30, "genre": ["Drama", "Action", "Adventure"], "cast": ["Jeremy Ratchford", "Maria del Mar", "Mimi Kuzyk", "Joel S. Keller", "Benz Antoine"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2930   Expand Blue Murder   (2001) User Score Overview Blue Murder is a Canadian crime drama television series, featuring stories that reflected the turbulence of urban life and the crimes that make headlines. The Blue Murder squad members were an elite group of big-city investigators out to solve some of the city's most complicated and riveting crimes. Featured Crew Steve Lucas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Ratchford Maria del Mar Mimi Kuzyk Joel S. Keller Benz Antoine Full Cast & Crew Last Season Season 4 2004 | 13 Episodes Season 4 of Blue Murder premiered on April 21, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blue Murder. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Action & Adventure Keywords canada toronto police detective murder investigation Content Score 93 Almost there... Top Contributors 8 Banana 1 Steve 1 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}