{"link": "https://www.themoviedb.org/tv/64280?language=en", "title": "From Five To Nine", "resume": "Junko Sakuraba dreams of working in New York, but she currently works as an English conversation teacher. She's about to have her 29th birthday. Junko Sakuraba works hard to achieve her dream, but New York seem far away. She has also not dated in a long time.\nJunko Sakuraba attends a funeral held at a temple. During the funeral, she makes a mistake and throws ashes onto a monk chanting a sutra. She feels apologetic and embarrassment.\nLater, Junko Sakuraba's family deceives her into going on a blind date. The man she meets on the blind date is Takane Hoshikawa. Her date is the monk whom she accidentally threw ashes on.", "rate": 98, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Tomohisa Yamashita", "Satomi Ishihara", "Yuki Furukawa", "Kei Tanaka", "Rin Takanashi"], "character": ["Takane Hoshikawa", "Junko Sakuraba", "Satoshi Mishima", "Makoto Kiyomiya", "Momoe Yamabuchi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64280   Expand From Five To Nine   (2015) User Score Overview Junko Sakuraba dreams of working in New York, but she currently works as an English conversation teacher. She's about to have her 29th birthday. Junko Sakuraba works hard to achieve her dream, but New York seem far away. She has also not dated in a long time. Junko Sakuraba attends a funeral held at a temple. During the funeral, she makes a mistake and throws ashes onto a monk chanting a sutra. She feels apologetic and embarrassment. Later, Junko Sakuraba's family deceives her into going on a blind date. The man she meets on the blind date is Takane Hoshikawa. Her date is the monk whom she accidentally threw ashes on. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomohisa Yamashita Takane Hoshikawa Satomi Ishihara Junko Sakuraba Yuki Furukawa Satoshi Mishima Kei Tanaka Makoto Kiyomiya Rin Takanashi Momoe Yamabuchi Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of From Five To Nine premiered on October 12, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Excellent Show! Open 0 by kenjisan\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on From Five To Nine. You can help by rating TV shows you've seen. Facts Original Name  5→9～私に恋したイケメンすぎるお坊さん～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.fujitv.co.jp/5ji9ji/index.html Genres Comedy Drama Romance Keywords japan Content Score 86 Almost there... Top Contributors M 34 Maria180493 17 Charles z 15 zurman1 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}