{"link": "https://www.themoviedb.org/tv/32776?language=en", "title": "Detroit 1-8-7", "resume": "Detroit 1-8-7 is an American police procedural series about Detroit's leading homicide unit, created by Jason Richman for ABC. It features an ensemble cast of actors including Michael Imperioli and James McDaniel. The series originally ran on ABC from September 21, 2010 to March 20, 2011.\nThe show's executive producer, David Zabel stated, \"This is a crime show but we will explore various nooks and crannies in the communities and within that context there's a lot of opportunity to see what's positive in the city and see what's heroic about the people fighting for what’s best for the city of Detroit.\"\nThe 1-8-7 of the title is a specific reference to the California Penal Code designation for homicide, which has become a slang term for murder. The Michigan Penal Code designations for the various forms of homicide begin at 750.\nOn May 13, 2011, Detroit 1-8-7 was canceled by ABC. With the cancellation, series creator Jason Richman has said he is pursuing options for the series to continue on cable television, also stating that chances for the move are \"slim\".\nThe DVD set for the series was released on August 30, 2011.", "rate": 72, "genre": ["Drama"], "cast": ["Michael Imperioli", "Jon Michael Hill", "James McDaniel", "Shaun Majumder", "Natalie Martinez"], "character": ["Det. Louis Fitch", "Det. Damon Washington", "Sgt. Jesse Longford", "Det. Aman Mahajan", "Det. Ariana Sanchez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32776   Expand Detroit 1-8-7   (2010) User Score Overview Detroit 1-8-7 is an American police procedural series about Detroit's leading homicide unit, created by Jason Richman for ABC. It features an ensemble cast of actors including Michael Imperioli and James McDaniel. The series originally ran on ABC from September 21, 2010 to March 20, 2011. The show's executive producer, David Zabel stated, \"This is a crime show but we will explore various nooks and crannies in the communities and within that context there's a lot of opportunity to see what's positive in the city and see what's heroic about the people fighting for what’s best for the city of Detroit.\" The 1-8-7 of the title is a specific reference to the California Penal Code designation for homicide, which has become a slang term for murder. The Michigan Penal Code designations for the various forms of homicide begin at 750. On May 13, 2011, Detroit 1-8-7 was canceled by ABC. With the cancellation, series creator Jason Richman has said he is pursuing options for the series to continue on cable television, also stating that chances for the move are \"slim\". The DVD set for the series was released on August 30, 2011. Featured Crew Jason Richman Creator David Hoberman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Imperioli Det. Louis Fitch Jon Michael Hill Det. Damon Washington James McDaniel Sgt. Jesse Longford Shaun Majumder Det. Aman Mahajan Natalie Martinez Det. Ariana Sanchez Full Cast & Crew Last Season Season 1 2010 | 18 Episodes Season 1 of Detroit 1-8-7 premiered on September 21, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2007-03-15 Raines 7.3    2009-04-08 The Unusuals 7.7    2010-05-19 The Good Guys 7.9    2011-02-07 The Chicago Code 7.3    2010-07-11 The Glades 6.3    2011-01-20 Fairly Legal 5.8    2014-07-27 Manhattan 7.3    2010-06-24 Rookie Blue 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.abc.go.com/shows/detroit-1-8-7 Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 3 speedycars w 3 webmaster 2 Marr 🇳🇱 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}