{"link": "https://www.themoviedb.org/tv/60573?language=en", "title": "Silicon Valley", "resume": "In the high-tech gold rush of modern Silicon Valley, the people most qualified to succeed are the least capable of handling success. Partially inspired by Mike Judge’s own experiences as a Silicon Valley engineer in the late ‘80s, Silicon Valley is an American sitcom that centers around six programmers who are living together and trying to make it big in the Silicon Valley.", "rate": 79, "genre": ["Comedy"], "cast": ["Thomas Middleditch", "Zach Woods", "Kumail Nanjiani", "Martin Starr", "Amanda Crew"], "character": ["Richard Hendriks", "Donald 'Jared' Dunn", "Dinesh Chugtai", "Bertram Gilfoyle", "Monica Hall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60573   Expand Silicon Valley   (2014) User Score  Play Trailer Overview In the high-tech gold rush of modern Silicon Valley, the people most qualified to succeed are the least capable of handling success. Partially inspired by Mike Judge’s own experiences as a Silicon Valley engineer in the late ‘80s, Silicon Valley is an American sitcom that centers around six programmers who are living together and trying to make it big in the Silicon Valley. Featured Crew Mike Judge Creator Alec Berg Creator Dave Krinsky Creator John Altschuler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  1 Images Backdrops  16 Posters  21 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Middleditch Richard Hendriks Zach Woods Donald 'Jared' Dunn Kumail Nanjiani Dinesh Chugtai Martin Starr Bertram Gilfoyle Amanda Crew Monica Hall Full Cast & Crew Current Season Season 5 2018 | 8 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply this season has been terrible Open 5 by  Bloodshot77 N Season 5 to release on 25th March! Open 0 by Neeraj\n      \n     Will the guys of Pied Piper ever become successful and wealthy? Open 7 by  Markoff Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  21 Recommendations   2003-11-02 Arrested Development 8.2    2009-04-09 Parks and Recreation 7.9    2009-09-17 Community 7.9    2014-04-15 Fargo 8.2    2015-02-08 Better Call Saul 8.1    2012-04-22 Veep 7.2    2015-05-27 Mr. Robot 7.8    2013-02-01 House of Cards 8.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m Homepage   http://www.hbo.com/silicon-valley Genres Comedy Keywords computer nerd silicon valley startup programmer Content Score 100 Yes! Looking good! Top Contributors 103 Elizabeth Jennings 37 Travis Bell 22 niqo19 a 13 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}