{"link": "https://www.themoviedb.org/tv/34868?language=en", "title": "Shirt tales", "resume": "Shirt tales is an American animated series that aired on NBC from September 18, 1982 to January 21, 1984. The series featured animal characters, created in 1980 by greeting card designer Janet Elizabeth Manco, that were among Hallmark Cards' best sellers at the time.", "rate": 0, "genre": ["Family", "Animation"], "cast": ["Herb Vigran", "Ronnie Schell", "Nancy Cartwright", "Bob Ogle", "Fred Travalena"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34868   Expand Shirt tales   (1982) User Score Overview Shirt tales is an American animated series that aired on NBC from September 18, 1982 to January 21, 1984. The series featured animal characters, created in 1980 by greeting card designer Janet Elizabeth Manco, that were among Hallmark Cards' best sellers at the time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Herb Vigran Ronnie Schell Nancy Cartwright Bob Ogle Fred Travalena Full Cast & Crew Last Season Season 1 1982 | 27 Episodes Season 1 of Shirt tales premiered on September 18, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shirt tales. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Keywords park fighting crime Content Score 93 Almost there... Top Contributors 9 Banana TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}