{"link": "https://www.themoviedb.org/tv/53347?language=en", "title": "The \"Hentai\" Prince and the Stony Cat", "resume": "Yōto Yokodera is a perverted schoolboy who is unable to express his true feelings freely. After hearing about the wish-granting Stony Cat, he decides to try and make an offering to lose his facade, only to meet Tsukiko who wishes instead to be more discreet with her feelings to become more adultlike. Who'd have thought the rumors of the wish-granting Stony Cat turns out to be true; transferring the facade that Yōto wishes to lose into a classmate who needs it more and making it difficult for Tsukiko to show even the slightest of emotions on her face. Being on the same boat, they both search for ways to remedy the situation.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["Yuuki Kaji", "Yui Ogura", "Kaori Ishihara", "Yukari Tamura", "Aimi Terakawa"], "character": ["Yōto Yokodera (voice)", "Tsukiko Tsutsukakushi (voice)", "Azusa Azuki (voice)", "Tsukushi Tsutsukakushi (voice)", "Emanuella ''Emi'' Porlallora (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53347   Expand The \"Hentai\" Prince and the Stony Cat   (2013) User Score Overview Yōto Yokodera is a perverted schoolboy who is unable to express his true feelings freely. After hearing about the wish-granting Stony Cat, he decides to try and make an offering to lose his facade, only to meet Tsukiko who wishes instead to be more discreet with her feelings to become more adultlike. Who'd have thought the rumors of the wish-granting Stony Cat turns out to be true; transferring the facade that Yōto wishes to lose into a classmate who needs it more and making it difficult for Tsukiko to show even the slightest of emotions on her face. Being on the same boat, they both search for ways to remedy the situation. Featured Crew Sou Sagara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuki Kaji Yōto Yokodera (voice) Yui Ogura Tsukiko Tsutsukakushi (voice) Kaori Ishihara Azusa Azuki (voice) Yukari Tamura Tsukushi Tsutsukakushi (voice) Aimi Terakawa Emanuella ''Emi'' Porlallora (voice) Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of The \"Hentai\" Prince and the Stony Cat premiered on April 12, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The \"Hentai\" Prince and the Stony Cat. You can help by rating TV shows you've seen. Facts Original Name  変態王子と笑わない猫 Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.henneko.jp/ Genres Animation Comedy Keywords based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 52 CrewMdk d 34 desert188 t 12 themacguffinman 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}