{"link": "https://www.themoviedb.org/tv/590?language=en", "title": "SWAT Kats: The Radical Squadron", "resume": "SWAT Kats: The Radical Squadron is animated television series created by Christian Tremblay and Yvon Tremblay and produced by Hanna-Barbera and Turner Program Services. The series takes place in the fictional metropolis of Megakat City, which is populated entirely by anthropomorphic felines who are just like people, known as \"kats\". The titular SWAT Kats are two vigilante pilots who possess a state-of-the-art fighter jet with an array of weaponry. Throughout the series, they face various villains as well as Megakat City's militarized police force, the Enforcers.\nThe show originally premiered and ran on TBS's syndication block The Funtastic World of Hanna-Barbera from 1993 to 1995. Every episode of the series was directed by Robert Alvarez. The bulk of the series was written by either Glenn Leopold or Lance Falk. Jim Stenstrum contributed two episodes, while David Ehrman, Von Williams, Eric Clark, Mark Saraceni and Jim Katz all contributed one episode each. There were a total of twenty-five finished episodes and a special episode, that features a report on the SWAT Kats and of all their missions and gadgets as well as three unfinished episodes and two episodes still in the concept stage. The show re-aired on Cartoon Network and Boomerang.", "rate": 78, "genre": ["Animation", "Action", "Adventure"], "cast": ["Charlie Adler", "Gary Owens", "Tress MacNeille", "Candi Milo", "Jim Cummings"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 590   Expand SWAT Kats: The Radical Squadron   (1993) User Score Overview SWAT Kats: The Radical Squadron is animated television series created by Christian Tremblay and Yvon Tremblay and produced by Hanna-Barbera and Turner Program Services. The series takes place in the fictional metropolis of Megakat City, which is populated entirely by anthropomorphic felines who are just like people, known as \"kats\". The titular SWAT Kats are two vigilante pilots who possess a state-of-the-art fighter jet with an array of weaponry. Throughout the series, they face various villains as well as Megakat City's militarized police force, the Enforcers. The show originally premiered and ran on TBS's syndication block The Funtastic World of Hanna-Barbera from 1993 to 1995. Every episode of the series was directed by Robert Alvarez. The bulk of the series was written by either Glenn Leopold or Lance Falk. Jim Stenstrum contributed two episodes, while David Ehrman, Von Williams, Eric Clark, Mark Saraceni and Jim Katz all contributed one episode each. There were a total of twenty-five finished episodes and a special episode, that features a report on the SWAT Kats and of all their missions and gadgets as well as three unfinished episodes and two episodes still in the concept stage. The show re-aired on Cartoon Network and Boomerang. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Charlie Adler Gary Owens Tress MacNeille Candi Milo Jim Cummings Full Cast & Crew Last Season Season 2 1994 | 13 Episodes Season 2 of SWAT Kats: The Radical Squadron premiered on September 10, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   1982-09-18 The Incredible Hulk 8.2    1979-09-22 Spider-Woman 6.7    1996-09-08 The Incredible Hulk 6.3    1990-09-10 Captain Planet and the Planeteers 5.9    1994-09-10 The Tick 7.7    1967-09-09 Spider-Man 7.9    1981-09-12 Spider-Man and His Amazing Friends 6.7    2000-09-23 Static Shock 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 Atanas m 3 magoozin TB 1 TMDb Bot b 1 bisono2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}