{"link": "https://www.themoviedb.org/tv/13252?language=en", "title": "Superhuman Samurai Syber-Squad", "resume": "Superhuman Samurai Syber-Squad is an American television series. It was produced by Tsuburaya Productions, Ultracom and DIC Entertainment, with distribution by All American Television, and ran for one season from September 12, 1994 to April 11, 1995 in syndication, as well as on ABC. It was an adaptation of the Japanese tokusatsu series Denkou Choujin Gridman which was produced by Tsuburaya Productions. The series was originally going to be named PowerBoy but was renamed Superhuman Samurai Syber-Squad to avoid confusion with Saban Entertainment's Mighty Morphin Power Rangers.\nThe series development mirrored the creative construct established earlier with the Teenage Mutant Ninja Turtles. The master toy licensee -- Playmates Toys—funded the series, interpolated American development via toy licensing rights, and did a commercial buy-in on the Fox Network, where Haim Saban had established a kids block of time with other programs like \"Power Rangers.\" Playmates called upon the development team at DIC. DIC, Pangea and Playmates' marketing group created an ensemble of character names, traits and profiles, which were spun into a most ambiguous series offering. More than anything else, this was a quick-to-market slam dunk to capitalize on the upsurge in popularity of imported Japanese monster-robot shows which could be adapted with new, regionalized live-action footage.", "rate": 70, "genre": [], "cast": ["Matthew Lawrence", "Kath Soucie", "Troy Slaten", "Tim Curry", "Neil Ross"], "character": ["Kilokahn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13252   Expand Superhuman Samurai Syber-Squad   (1994) User Score Overview Superhuman Samurai Syber-Squad is an American television series. It was produced by Tsuburaya Productions, Ultracom and DIC Entertainment, with distribution by All American Television, and ran for one season from September 12, 1994 to April 11, 1995 in syndication, as well as on ABC. It was an adaptation of the Japanese tokusatsu series Denkou Choujin Gridman which was produced by Tsuburaya Productions. The series was originally going to be named PowerBoy but was renamed Superhuman Samurai Syber-Squad to avoid confusion with Saban Entertainment's Mighty Morphin Power Rangers. The series development mirrored the creative construct established earlier with the Teenage Mutant Ninja Turtles. The master toy licensee -- Playmates Toys—funded the series, interpolated American development via toy licensing rights, and did a commercial buy-in on the Fox Network, where Haim Saban had established a kids block of time with other programs like \"Power Rangers.\" Playmates called upon the development team at DIC. DIC, Pangea and Playmates' marketing group created an ensemble of character names, traits and profiles, which were spun into a most ambiguous series offering. More than anything else, this was a quick-to-market slam dunk to capitalize on the upsurge in popularity of imported Japanese monster-robot shows which could be adapted with new, regionalized live-action footage. Featured Crew Jymn Magon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Lawrence Kath Soucie Troy Slaten Tim Curry Kilokahn Neil Ross Full Cast & Crew Last Season Season 2 2003 | 6 Episodes Season 2 of Superhuman Samurai Syber-Squad premiered on September  3, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t I loved this as a kid. Open 0 by tmdb27030640\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Superhuman Samurai Syber-Squad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}