{"link": "https://www.themoviedb.org/tv/30692?language=en", "title": "Jane Doe", "resume": "Jane Doe is the name of a series of nine TV mystery movies released by the Hallmark Channel between 2005 and 2008, and now appearing regularly on the Hallmark Movie Channel. While on the Hallmark Channel, it was broadcast in rotation with the movie series McBride, Murder 101, and Mystery Woman, under the umbrella title Hallmark Channel Mystery Wheel.\nIn the series, created by Dean Hargrove, Lea Thompson stars as Cathy Davis, a soccer mom who is secretly Jane Doe, an agent for the federal \"Central Security Agency\". The films focus on her efforts to keep her lives separate while solving mysteries.", "rate": 0, "genre": ["Drama"], "cast": ["Lea Thompson", "Joe Penny", "Zack Shada", "William R. Moses"], "character": ["Cathy Davis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30692   Expand Jane Doe   (2005) User Score Overview Jane Doe is the name of a series of nine TV mystery movies released by the Hallmark Channel between 2005 and 2008, and now appearing regularly on the Hallmark Movie Channel. While on the Hallmark Channel, it was broadcast in rotation with the movie series McBride, Murder 101, and Mystery Woman, under the umbrella title Hallmark Channel Mystery Wheel. In the series, created by Dean Hargrove, Lea Thompson stars as Cathy Davis, a soccer mom who is secretly Jane Doe, an agent for the federal \"Central Security Agency\". The films focus on her efforts to keep her lives separate while solving mysteries. Featured Crew Dean Hargrove Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lea Thompson Cathy Davis Joe Penny Zack Shada William R. Moses Full Cast & Crew Last Season Season 2 2006 | 5 Episodes Season 2 of Jane Doe premiered on January 14, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jane Doe. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://www.hallmarkchannel.com/publish/consumer/home/shows/jane_doe_vanishing.html Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors r 4 retibika 3 Elizabeth Jennings BA 3 Barbara Ann O'Leary i 1 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}