{"link": "https://www.themoviedb.org/tv/4208?language=en", "title": "UFO Files", "resume": "UFO Files is an American television series that was produced from 2004 to 2007 for The History Channel. The program covers the phenomena of unidentified flying and submerged objects, close encounters with alleged extraterrestrial life, and alleged military and government cover-up conspiracies.\nIn 2008, a following series called UFO Hunters premiered on the same channel.", "rate": 78, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4208   Expand UFO Files   (2004) User Score Overview UFO Files is an American television series that was produced from 2004 to 2007 for The History Channel. The program covers the phenomena of unidentified flying and submerged objects, close encounters with alleged extraterrestrial life, and alleged military and government cover-up conspiracies. In 2008, a following series called UFO Hunters premiered on the same channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2005 | 42 Episodes Season 1 of UFO Files premiered on November 21, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply g Anyone else watch this back then? Open 0 by gspgreases\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on UFO Files. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.history.com/search.do?action Genres Documentary Keywords ufo conspiracy paranormal show Content Score 56 We're so close, yet so far. Top Contributors 4 Banana w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}