{"link": "https://www.themoviedb.org/tv/12297?language=en", "title": "The Sleepover Club", "resume": "The Sleepover Club is a series of children's books by authors Rose Impey, Fiona Cummings, Narinder Dhami, Sue Mongredien, Jana Hunter, Harriet Castor and Angie Bates. It has also been adapted into a children's television programme. While the books were set in Cuddington, Leicester, England, the television show was set in the fictional Australian beachside suburb of Crescent Bay . The books revolve around five young girls who are part of a club in which they sleepover at each other's houses at least once a week. The television series do not portray the same stories as the books.\nThe girls' names are Francesca \"Frankie\" Thomas, Rosie Cartwright, Felicity \"Fliss\" Sidebotham, Lyndsey \"Lyndz\" Collins and Laura \"Kenny\" McKenzie. Their rivals are two, snobbish girls in their class named Emma Hughes and Emily Berryman. This pair are also referred to as the Gruesome Twosome. Their rivals are also 3 dumb boys, A.K.A the M&M'S They frequently try to embarrass the Sleepover Club, get them into trouble, or ruin their plans and fun. There are 54 books:\n⁕The Sleepover Club at Frankie’s\n⁕The Sleepover Club at Lyndsey’s\n⁕The Sleepover Club at Felicity’s", "rate": 0, "genre": ["Drama", "Comedy", "Family"], "cast": ["Emanuelle Bains", "Katie Nazer-Hennings", "Morgan Griffin", "Rachel Watson", "Monique Williams"], "character": ["Madeline 'Maddy' Leigh", "Brooke Webster", "Charlotte 'Charlie' Anderson", "Tayla Kane", "Jessica 'Jess' Philips"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12297   Expand The Sleepover Club   (2003) User Score Overview The Sleepover Club is a series of children's books by authors Rose Impey, Fiona Cummings, Narinder Dhami, Sue Mongredien, Jana Hunter, Harriet Castor and Angie Bates. It has also been adapted into a children's television programme. While the books were set in Cuddington, Leicester, England, the television show was set in the fictional Australian beachside suburb of Crescent Bay . The books revolve around five young girls who are part of a club in which they sleepover at each other's houses at least once a week. The television series do not portray the same stories as the books. The girls' names are Francesca \"Frankie\" Thomas, Rosie Cartwright, Felicity \"Fliss\" Sidebotham, Lyndsey \"Lyndz\" Collins and Laura \"Kenny\" McKenzie. Their rivals are two, snobbish girls in their class named Emma Hughes and Emily Berryman. This pair are also referred to as the Gruesome Twosome. Their rivals are also 3 dumb boys, A.K.A the M&M'S They frequently try to embarrass the Sleepover Club, get them into trouble, or ruin their plans and fun. There are 54 books: ⁕The Sleepover Club at Frankie’s ⁕The Sleepover Club at Lyndsey’s ⁕The Sleepover Club at Felicity’s Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emanuelle Bains Madeline 'Maddy' Leigh Katie Nazer-Hennings Brooke Webster Morgan Griffin Charlotte 'Charlie' Anderson Rachel Watson Tayla Kane Monique Williams Jessica 'Jess' Philips Full Cast & Crew Last Season Season 2 2006 | 26 Episodes Season 2 of The Sleepover Club premiered on October  2, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Sleepover Club. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Comedy Family Keywords australia beach female friendship teenager Content Score 71 Just a little bit more... Top Contributors 16 Banana s 3 speedycars 1 ReggieRocket 1 Apollo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}