{"link": "https://www.themoviedb.org/tv/41891?language=en", "title": "Xuan-Yuan Sword: Scar of Sky", "resume": "Can they put their differences aside for the greater good? Chen Jing Chou is a playful, childish descendant of the Chen Dynasty. Yu Wen Tuo is the descendant of the rival Northern Zhou Dynasty who is on a mission to recover his fallen empire. When Jing Chou’s shifu (master) is placed into a frozen limbo by Satan, Jing Chou and Wen Tuo join forces to hunt down 10 mystical weapons that can close the Gates of Hell and banish the evil demons from the human world. Joining them on this epic journey are Tuo Ba Yu’er and Du Gu Ning Ke. Can the bickering group put their personal feelings aside for the good of humanity?", "rate": 0, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Hu Ge", "Jiang Jinfu", "Tiffany Tang", "Liu Shishi", "Guli Nazha"], "character": ["Yuwen Tuo / Jian Chi", "Chen Jing Chou", "Dugu Ningke", "Tuoba Yu Er", "Yu Xiao Xue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41891   Expand Xuan-Yuan Sword: Scar of Sky   (2012) User Score Overview Can they put their differences aside for the greater good? Chen Jing Chou is a playful, childish descendant of the Chen Dynasty. Yu Wen Tuo is the descendant of the rival Northern Zhou Dynasty who is on a mission to recover his fallen empire. When Jing Chou’s shifu (master) is placed into a frozen limbo by Satan, Jing Chou and Wen Tuo join forces to hunt down 10 mystical weapons that can close the Gates of Hell and banish the evil demons from the human world. Joining them on this epic journey are Tuo Ba Yu’er and Du Gu Ning Ke. Can the bickering group put their personal feelings aside for the good of humanity? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hu Ge Yuwen Tuo / Jian Chi Jiang Jinfu Chen Jing Chou Tiffany Tang Dugu Ningke Liu Shishi Tuoba Yu Er Guli Nazha Yu Xiao Xue Full Cast & Crew Last Season Season 1 2012 | 36 Episodes Season 1 of Xuan-Yuan Sword: Scar of Sky premiered on July  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Xuan-Yuan Sword: Scar of Sky. You can help by rating TV shows you've seen. Facts Original Name  轩辕剑之天之痕 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords china romance xianxia Content Score 86 Almost there... Top Contributors M 42 Maria180493 3 lemonlyman TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}