{"link": "https://www.themoviedb.org/tv/6894?language=en", "title": "I Love the '70s", "resume": "I Love the '70s is a decade nostalgia television mini-series produced by VH-1. The series is based on a BBC series of the same name. It examines the pop culture of the 1970s, using footage from the era, along with \"Where Are They Now?\" interviews with celebrities from the decade. Additionally, the show features comedians poking fun at the kitchiness of what was popular. The first episode of the series, I Love 1970, premiered on August 18, 2003. A sequel, I Love the '70s: Volume 2, appeared in the United States on VH-1 beginning on 10 July 2006.", "rate": 80, "genre": ["Documentary"], "cast": ["Hal Sparks", "Cameron Diaz", "Brian Unger", "Dannah Phirman", "David Cassidy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6894   Expand I Love the '70s   (2003) User Score Overview I Love the '70s is a decade nostalgia television mini-series produced by VH-1. The series is based on a BBC series of the same name. It examines the pop culture of the 1970s, using footage from the era, along with \"Where Are They Now?\" interviews with celebrities from the decade. Additionally, the show features comedians poking fun at the kitchiness of what was popular. The first episode of the series, I Love 1970, premiered on August 18, 2003. A sequel, I Love the '70s: Volume 2, appeared in the United States on VH-1 beginning on 10 July 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hal Sparks Cameron Diaz Brian Unger Dannah Phirman David Cassidy Full Cast & Crew Last Season Season 1 2003 | 10 Episodes Season 1 of I Love the '70s premiered on August 18, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Love the '70s. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.vh1.com/shows/dyn/i_love_the_70s/series.jhtml Genres Documentary Keywords 1970s nostalgia Content Score 86 Almost there... Top Contributors 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}