{"link": "https://www.themoviedb.org/tv/66977?language=en", "title": "Black As", "resume": "Off beat, off track and online... go bush with the Black As boys as they venture into the wilds of Arnhem Land, hunting for adventure and a good feed.", "rate": 30, "genre": ["Comedy", "Documentary", "Action", "Adventure"], "cast": ["Jerome Lilypiyana", "Joseph Smith", "Dino Wanybarrnga", "Chico Wanybarrnga"], "character": ["Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66977   Expand Black As   (2016) User Score  Play Trailer Overview Off beat, off track and online... go bush with the Black As boys as they venture into the wilds of Arnhem Land, hunting for adventure and a good feed. Featured Crew Buddhi Lokuge Creator Joseph Smith Creator Chico Wanybarrnga Creator Dino Wanybarrnga Creator Jerome Lilypiyana Creator David Batty Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerome Lilypiyana Himself Joseph Smith Himself Dino Wanybarrnga Himself Chico Wanybarrnga Himself Full Cast & Crew Last Season Series 1 2016 | 24 Episodes Season 1 of Black As premiered on July  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Black As. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Documentary Original Language  English Runtime  5m Homepage   http://blackas.com.au/ Genres Comedy Documentary Action & Adventure Keywords hunting australian aboriginal Content Score 100 Yes! Looking good! Top Contributors 57 United600 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}