{"link": "https://www.themoviedb.org/tv/72701?language=en", "title": "Teacher Oh Soon Nam", "resume": "This TV show revolves around Oh Soon Nam, a teacher at a traditional Korean school called Jeokhyeonjae where she nurtures students’ aspirations like a friend. Soon Nam is also married to the sole descendant of a head family clan that comes with heavy responsibilities. Then tragedy strikes her. Soon Nam embarks on an investigation to punish the people behind these injustices, and finds that she must choose between revenge and values she has lived by all her life. Always thinking of loved ones, she transforms into a person that people admire for her strength and perseverance in the face of adversity.", "rate": 75, "genre": ["Drama", "Soap"], "cast": ["Park Shi-Eun", "Goo Bon-Seung", "Sul Jung Hwan", "Han Soo-yeon", "Jang Seung-jo"], "character": ["Oh Soon Nam", "Kang Du Mul", "Kang Ungil", "Hwang Se-hui", "Cha Yu-Min"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72701   Expand Teacher Oh Soon Nam   (2017) User Score Overview This TV show revolves around Oh Soon Nam, a teacher at a traditional Korean school called Jeokhyeonjae where she nurtures students’ aspirations like a friend. Soon Nam is also married to the sole descendant of a head family clan that comes with heavy responsibilities. Then tragedy strikes her. Soon Nam embarks on an investigation to punish the people behind these injustices, and finds that she must choose between revenge and values she has lived by all her life. Always thinking of loved ones, she transforms into a person that people admire for her strength and perseverance in the face of adversity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Shi-Eun Oh Soon Nam Goo Bon-Seung Kang Du Mul Sul Jung Hwan Kang Ungil Han Soo-yeon Hwang Se-hui Jang Seung-jo Cha Yu-Min Full Cast & Crew Last Season Season 1 2017 | 64 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Teacher Oh Soon Nam. You can help by rating TV shows you've seen. Facts Original Name  훈장 오순남 Status  In Production Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://content.mbc.co.kr/program/drama/2997383_64285.html Genres Drama Soap Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors B 44 Boateys 11 Elizabeth Jennings d 4 daphie TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}