{"link": "https://www.themoviedb.org/tv/5370?language=en", "title": "Reeling in the Years", "resume": "Reeling in the Years is an Irish historical documentary series broadcast in Ireland by RTÉ. Each episode, approximately 25 minutes long, looks back at the news and events of a particular year, from 1962 to 2009. The programme uses news archive footage, along with subtitles as the means of narration, to recount notable Irish and international events of the time. Music from the particular year is also played over the footage, with occasional scenes of live performances or music videos, generally by an Irish artist. Each decade takes at least eight months to make.\nThe programme runs on RTÉ without advertisements during it. The theme tune for the series comes from Steely Dan's 1972 hit \"Reelin' In the Years\". The series was voted \"most popular home-produced TV programme ever\" in a poll of Ireland's Top 100 television programmes conducted by the RTÉ Guide in 2008. In 2008, a DVD entitled Reeling in the 80s was released for the Irish market, with follow-up DVDs Reeling in the 90s and Reeling in the 70s released in 2009 and 2010, respectively.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5370   Expand Reeling in the Years   (1999) User Score Overview Reeling in the Years is an Irish historical documentary series broadcast in Ireland by RTÉ. Each episode, approximately 25 minutes long, looks back at the news and events of a particular year, from 1962 to 2009. The programme uses news archive footage, along with subtitles as the means of narration, to recount notable Irish and international events of the time. Music from the particular year is also played over the footage, with occasional scenes of live performances or music videos, generally by an Irish artist. Each decade takes at least eight months to make. The programme runs on RTÉ without advertisements during it. The theme tune for the series comes from Steely Dan's 1972 hit \"Reelin' In the Years\". The series was voted \"most popular home-produced TV programme ever\" in a poll of Ireland's Top 100 television programmes conducted by the RTÉ Guide in 2008. In 2008, a DVD entitled Reeling in the 80s was released for the Irish market, with follow-up DVDs Reeling in the 90s and Reeling in the 70s released in 2009 and 2010, respectively. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2010 | 10 Episodes Season 5 of Reeling in the Years premiered on October 17, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Reeling in the Years. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.rte.ie/tv/reelingintheyears/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}