{"link": "https://www.themoviedb.org/tv/4487?language=en", "title": "Models Inc.", "resume": "Models Inc. is an American prime time soap opera that aired on the Fox television network during the 1994-1995 television season. It is the third series in the Beverly Hills, 90210 franchise. The series was created by Charles Pratt, Jr. and Frank South, and executive produced by Aaron Spelling, Charles Pratt, Jr., Frank South, and E. Duke Vincent.", "rate": 66, "genre": ["Soap", "Drama"], "cast": ["Linda Gray", "Cameron Daddo", "David Goldsmith", "Teresa Hill", "Carrie-Anne Moss"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4487   Expand Models Inc.   (1994) User Score Overview Models Inc. is an American prime time soap opera that aired on the Fox television network during the 1994-1995 television season. It is the third series in the Beverly Hills, 90210 franchise. The series was created by Charles Pratt, Jr. and Frank South, and executive produced by Aaron Spelling, Charles Pratt, Jr., Frank South, and E. Duke Vincent. Featured Crew Charles Pratt, Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Linda Gray Cameron Daddo David Goldsmith Teresa Hill Carrie-Anne Moss Full Cast & Crew Last Season Season 1 1994 | 29 Episodes Season 1 of Models Inc. premiered on June 29, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Loved it! Open 2 by  Stratego! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Models Inc.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Soap Drama Keywords los angeles fashion model Content Score 93 Almost there... Top Contributors 7 Banana a 3 asusar i 3 ismax935 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}