{"link": "https://www.themoviedb.org/tv/3111?language=en", "title": "Operation Good Guys", "resume": "Operation Good Guys is a British mockumentary, a fly-on-the-wall documentary series about an elite police unit's bid to snare one of Britain's most powerful crime lords. It was first screened on BBC Two from 1997 - 2000. Blurring the line between fact and fiction, it witnesses, on camera, the total breakdown, professionally and personally, of the Operation Good Guys team. Throughout the operation, The 'Good Guys' have an unfortunate habit of embroiling into their calamitous world some of the country's best-known celebrities, from actors and footballers, to TV presenters and even the odd ex-convict.\nIt was created by Ray Burdis and co written by Ray Burdis, Hugo Blick and Dominic Anciano, although much of the dialogue was improvised by the actors.\nThe series utilised the concept of a mock documentary capturing the truths of a workplace four years before the notion reached fame in The Office. However, this mockumentary style was watered down slightly when a laugh track was added for the second and third series.\nThe series was awarded the Silver Rose for Best Sitcom and the Prix de la Presse, voted for by the International Press, at the Montreux Golden Rose Festival.", "rate": 80, "genre": ["Comedy"], "cast": ["Ray Burdis", "Kim Taylforth", "Perry Benson", "Mark Burdis"], "character": ["Bones", "Mark Kemp"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3111   Expand Operation Good Guys   (1997) User Score Overview Operation Good Guys is a British mockumentary, a fly-on-the-wall documentary series about an elite police unit's bid to snare one of Britain's most powerful crime lords. It was first screened on BBC Two from 1997 - 2000. Blurring the line between fact and fiction, it witnesses, on camera, the total breakdown, professionally and personally, of the Operation Good Guys team. Throughout the operation, The 'Good Guys' have an unfortunate habit of embroiling into their calamitous world some of the country's best-known celebrities, from actors and footballers, to TV presenters and even the odd ex-convict. It was created by Ray Burdis and co written by Ray Burdis, Hugo Blick and Dominic Anciano, although much of the dialogue was improvised by the actors. The series utilised the concept of a mock documentary capturing the truths of a workplace four years before the notion reached fame in The Office. However, this mockumentary style was watered down slightly when a laugh track was added for the second and third series. The series was awarded the Silver Rose for Best Sitcom and the Prix de la Presse, voted for by the International Press, at the Montreux Golden Rose Festival. Featured Crew Dominic Anciano Creator Ray Burdis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Ray Burdis Kim Taylforth Perry Benson Bones Mark Burdis Mark Kemp Full Cast & Crew Last Season Season 3 2000 | 6 Episodes Season 3 of Operation Good Guys premiered on July  7, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Operation Good Guys. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords mockumentary british humour workplace comedy Content Score 100 Yes! Looking good! Top Contributors J 4 JorgeGonzalez3 O 3 Ozbourne R 3 Rebecca TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}