{"link": "https://www.themoviedb.org/tv/61602?language=en", "title": "Cumbia Ninja", "resume": "In a major slum called La Colina, young idealist Hache and his friends will confront the drug dealers who control the neighborhood. They will succeed with the help of music, an old Chinese ninja master and a mythical character who also lives in La Colina. Simultaneously, Juana will find shelter there as she runs away from her family's assassins.", "rate": 75, "genre": ["Drama"], "cast": ["Ricardo Abarca", "Brenda Asnicar", "Nicolás Rincón"], "character": ["Hache", "Nieves /Juana Carabajal", "Chopín"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61602   Expand Cumbia Ninja   (2013) User Score Overview In a major slum called La Colina, young idealist Hache and his friends will confront the drug dealers who control the neighborhood. They will succeed with the help of music, an old Chinese ninja master and a mythical character who also lives in La Colina. Simultaneously, Juana will find shelter there as she runs away from her family's assassins. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricardo Abarca Hache Brenda Asnicar Nieves /Juana Carabajal Nicolás Rincón Chopín Full Cast & Crew Last Season Season 2 2014 | 16 Episodes Season 2 of Cumbia Ninja premiered on October  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cumbia Ninja. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage   http://www.foxplay.com/ar/show/9153-cumbia-ninja Genres Drama Keywords music teenager Content Score 56 We're so close, yet so far. Top Contributors V 21 Vaine 7 CouchTater z 5 zurman1 CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}