{"link": "https://www.themoviedb.org/tv/79342?language=en", "title": "Ms. Hammurabi", "resume": "Park Cha O Reum works as a rookie judge. She is in her mid-20's and follows \"an eye for an eye\" principle. She does not accept prejudice or blindly follow authority. Dealing with cases, she and her colleagues, including Im Ba-Reun, grow as persons.", "rate": 60, "genre": ["Drama"], "cast": ["Go Ara", "L", "Sung Dong-il", "Ryu Deok-hwan", "Lee Elijah"], "character": ["Park Cha O Reum", "Im Ba-Reun", "Han Se-Sang", "Jung Bo-Wang", "Lee Do-Yeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79342   Expand Ms. Hammurabi   (2018) User Score Overview Park Cha O Reum works as a rookie judge. She is in her mid-20's and follows \"an eye for an eye\" principle. She does not accept prejudice or blindly follow authority. Dealing with cases, she and her colleagues, including Im Ba-Reun, grow as persons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Go Ara Park Cha O Reum L Im Ba-Reun Sung Dong-il Han Se-Sang Ryu Deok-hwan Jung Bo-Wang Lee Elijah Lee Do-Yeon Full Cast & Crew Current Season Season 1 2018 | 16 Episodes Season 1 of Ms. Hammurabi premiered on May 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Ms. Hammurabi. You can help by rating TV shows you've seen. Facts Original Name  미스 함무라비 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.co.kr/hammurabi Genres Drama Keywords law Content Score 86 Almost there... Top Contributors M 36 Maria180493 h 4 huestory 2 Otgoo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}