{"link": "https://www.themoviedb.org/tv/66362?language=en", "title": "Tutur Tinular", "resume": "Tutur Tinular is an Indonesian historical-drama TV series, produced by Genta Buana Pitaloka (now Genta Buana Paramita. It was first aired on ANTV in October 25,1997 (Season 1) and Indosiar in 1999 (Season 2).", "rate": 100, "genre": ["Action", "Adventure", "War", "Politics"], "cast": ["Hadi Leo", "Dian Sitoresmi", "Febriyanti", "Bambang Suryo", "Henri Hendarto"], "character": ["Lembu Sora", "Nini Ragarunting", "Gayatri", "Arya Wiraraja", "Kudamerta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66362   Expand Tutur Tinular   (1997) User Score  Play Trailer Overview Tutur Tinular is an Indonesian historical-drama TV series, produced by Genta Buana Pitaloka (now Genta Buana Paramita. It was first aired on ANTV in October 25,1997 (Season 1) and Indosiar in 1999 (Season 2). Featured Crew Genta Buana Paramita Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Hadi Leo Lembu Sora Dian Sitoresmi Nini Ragarunting Febriyanti Gayatri Bambang Suryo Arya Wiraraja Henri Hendarto Kudamerta Full Cast & Crew Last Season Season 2 — | 14 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tutur Tinular. You can help by rating TV shows you've seen. Facts Status  Ended Networks Indosiar Certification  - Type  Scripted Original Language  Indonesian Runtime  60m Homepage  - Genres Action & Adventure War & Politics Keywords china castle jungle java Content Score 100 Yes! Looking good! Top Contributors MI 129 Mulyo Irwanto TB 4 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}