{"link": "https://www.themoviedb.org/tv/78194?language=en", "title": "Cybergirl of the Year", "resume": "Meet the Playboy models who have risen during the last decade with interviews, behind-the-scenes footage and glamour videos.", "rate": 100, "genre": ["Reality", "Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78194   Expand Cybergirl of the Year   (2018) User Score  Play Trailer Overview Meet the Playboy models who have risen during the last decade with interviews, behind-the-scenes footage and glamour videos. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Cybergirl of the Year premiered on March 14, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  18 Posters  10 Recommendations We don't have enough data to suggest any TV shows based on Cybergirl of the Year. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Reality Original Language  English Runtime  25m Homepage   http://www.playboy.tv/shows/videos/54941/cybergirl-of-the-year/ Genres Reality Documentary Keywords photo shoot glamour models Content Score 64 We're so close, yet so far. Top Contributors t 68 tmdb79519466 5 Elizabeth Jennings 1 Emily Stross a 1 aditia01  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}