{"link": "https://www.themoviedb.org/tv/1054?language=en", "title": "The Young and the Restless", "resume": "The rivalries, romances, hopes and fears of the residents of the fictional Midwestern metropolis, Genoa City. The lives and loves of a wide variety of characters mingle through the generations, dominated by the Newman, Abbott, Baldwin and Winters families.", "rate": 45, "genre": ["Soap"], "cast": ["Doug Davidson", "Tammin Sursok", "Sean Young", "Linden Ashby", "Camryn Grimes"], "character": ["Paul Williams", "Colleen Carlton", "Meggie McClaine", "Cameron Kirsten", "Cassie Newman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1054   Expand The Young and the Restless   (1973) User Score Overview The rivalries, romances, hopes and fears of the residents of the fictional Midwestern metropolis, Genoa City. The lives and loves of a wide variety of characters mingle through the generations, dominated by the Newman, Abbott, Baldwin and Winters families. Featured Crew William J. Bell Creator Lee Phillip Bell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Doug Davidson Paul Williams Tammin Sursok Colleen Carlton Sean Young Meggie McClaine Linden Ashby Cameron Kirsten Camryn Grimes Cassie Newman Full Cast & Crew Last Season Season 45 2017 | 215 Episodes Season 45 of The Young and the Restless premiered on September  1, 2017. View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply c The cover up is always worse than the crime Open 0 by cflr\n      \n     Who's migrated from IMDB? Open 18 by  bratface Gregg Rickkart Open 9 by  Congamondram Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   2010-06-16 Hot in Cleveland 6.8    1996-09-16 Judge Judy 5.0    1978-04-02 Dallas 6.1    2012-08-13 Major Crimes 6.7    2014-09-24 black-ish 7.0    2009-09-22 The Good Wife 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cbs.com/shows/the_young_and_the_restless/ Genres Soap Keywords soap opera Content Score 93 Almost there... Top Contributors 37 Elizabeth Jennings r 19 rodin c 16 castacasta P 15 PEKA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}