{"link": "https://www.themoviedb.org/tv/21766?language=en", "title": "Hero Corp", "resume": "Hero Corp is a French comedic science fiction TV show that has aired 30 episodes over 2 seasons, beginning in October 2008 on the cable channel Comédie!. In July 2009 it began broadcasting on France 4. The show was created by and stars Simon Astier, previously seen in the Kaamelott TV show. In August 2012, France 4 announced that the show will come back for a third season, airing in 2013.", "rate": 69, "genre": ["Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["François Podetti", "Etienne Fague", "Aurore Pourteyron", "Sébastien Lalanne", "Arnaud Joyet"], "character": ["Burt « Acid Man »/ « Captain Shampooing »/ « Tornado »", "Mique, fils du maire", "Jennifer", "Doug « Sérum »", "Stan « Mental »"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21766   Expand Hero Corp   (2008) User Score Overview Hero Corp is a French comedic science fiction TV show that has aired 30 episodes over 2 seasons, beginning in October 2008 on the cable channel Comédie!. In July 2009 it began broadcasting on France 4. The show was created by and stars Simon Astier, previously seen in the Kaamelott TV show. In August 2012, France 4 announced that the show will come back for a third season, airing in 2013. Featured Crew Simon Astier Creator Sébastien Lalanne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast François Podetti Burt « Acid Man »/ « Captain Shampooing »/ « Tornado » Etienne Fague Mique, fils du maire Aurore Pourteyron Jennifer Sébastien Lalanne Doug « Sérum » Arnaud Joyet Stan « Mental » Full Cast & Crew Last Season Season 5 2017 | 8 Episodes Season 5 of Hero Corp premiered on May 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations   2013-01-18 Lazy Company 6.3    2002-10-27 Caméra Café 6.8    2005-01-03 Kaamelott 8.0    1998-10-24 H 7.6    1999-10-11 A Guy, a Girl 6.0    1996-09-19 The Pretender 7.3    1992-10-03 Highlander: The Series 6.9    2005-08-28 Rome 8.2  Facts Status  Ended Networks Certification 16 Meaning Not recommended for children under 16. Not allowed air before 10:30 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  French Runtime  25m Homepage   http://www.hero-corp.com/ Genres Sci-Fi & Fantasy Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors h 69 herlock60 t 21 tmdb18595655 17 Calidigy s 7 sdupuis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}