{"link": "https://www.themoviedb.org/tv/61304?language=en", "title": "Nouvelle adresse", "resume": "Nathalie Lapointe is in her early forties, a single mother of three with a successful career as columnist at a major newspaper. Just as she’s starting to think she might be able to pay more attention to her own needs, she gets terrible news: the cancer from which she recovered two years previously is back. How can she break the news to her kids? How can the family plan for the future with this sword of Damocles hanging over them?\nDespite the shock, life goes on. Nathalie must cope with evolving circumstances at the paper as well as at home. She wonders if she can allow herself to fall in love with her daughters’ school principal. As for her children, they must deal with their own teenage life challenges, all the while knowing that their mother may soon be gone. Nathalie’s best friend and neighbor is particularly hard-hit by the news: she’s already suffering from her husband’s infidelity and from the absence of her son, who is overseas. Nathalie’s misfortune also has a powerful effect on her three siblings. They must re-think their priorities at a time when all three are facing crucial choices in their emotional and professional lives. For Nathalie’s parents Janine and Gérard, her illness makes no sense. How do you face the very real possibility that your child will die before you?", "rate": 0, "genre": ["Drama"], "cast": ["Macha Grenon", "Antoine Pilon", "Marguerite Bouchard", "Jade Charbonneau", "Jean-François Pichette"], "character": ["Nathalie A. Lapointe", "Émile Lapointe", "Léa Lapointe", "Romy Lapointe", "Laurent Lapointe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61304   Expand Nouvelle adresse   (2014) User Score Overview Nathalie Lapointe is in her early forties, a single mother of three with a successful career as columnist at a major newspaper. Just as she’s starting to think she might be able to pay more attention to her own needs, she gets terrible news: the cancer from which she recovered two years previously is back. How can she break the news to her kids? How can the family plan for the future with this sword of Damocles hanging over them? Despite the shock, life goes on. Nathalie must cope with evolving circumstances at the paper as well as at home. She wonders if she can allow herself to fall in love with her daughters’ school principal. As for her children, they must deal with their own teenage life challenges, all the while knowing that their mother may soon be gone. Nathalie’s best friend and neighbor is particularly hard-hit by the news: she’s already suffering from her husband’s infidelity and from the absence of her son, who is overseas. Nathalie’s misfortune also has a powerful effect on her three siblings. They must re-think their priorities at a time when all three are facing crucial choices in their emotional and professional lives. For Nathalie’s parents Janine and Gérard, her illness makes no sense. How do you face the very real possibility that your child will die before you? Featured Crew Richard Blaimert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Macha Grenon Nathalie A. Lapointe Antoine Pilon Émile Lapointe Marguerite Bouchard Léa Lapointe Jade Charbonneau Romy Lapointe Jean-François Pichette Laurent Lapointe Full Cast & Crew Last Season Season 3 2015 | 10 Episodes Season 3 of Nouvelle adresse premiered on September 14, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Nouvelle adresse. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  44m Homepage   http://nouvelleadresse.radio-canada.ca/ Genres Drama Keywords quebec cancer single mother téléroman Content Score 93 Almost there... Top Contributors 40 Banana x 6 xNRJx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}