{"link": "https://www.themoviedb.org/tv/61536?language=en", "title": "The People's Couch", "resume": "Bravo's The People’s Couch is based on the UK show, Gogglebox, The People’s Couch features real people watching and commenting on popular shows and news from the past week. The series will focus on the Fall television season by showcasing avid TV watchers in their homes, as they laugh, cry, talk, gasp, and scream at their TVs watching the network’s new and returning shows. Each episode will feature the same homes — whether it is a group of sorority sisters doing their nails or grandparents watching with their technology-obsessed grandchildren.", "rate": 43, "genre": ["Reality"], "cast": ["Samuel Marcus"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61536   Expand The People's Couch   (2013) User Score Overview Bravo's The People’s Couch is based on the UK show, Gogglebox, The People’s Couch features real people watching and commenting on popular shows and news from the past week. The series will focus on the Fall television season by showcasing avid TV watchers in their homes, as they laugh, cry, talk, gasp, and scream at their TVs watching the network’s new and returning shows. Each episode will feature the same homes — whether it is a group of sorority sisters doing their nails or grandparents watching with their technology-obsessed grandchildren. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samuel Marcus Himself Full Cast & Crew Last Season Season 4 2015 | 8 Episodes Season 4 of The People's Couch premiered on October  6, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The People's Couch. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.bravotv.com/the-peoples-couch Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 24 Elizabeth Jennings s 8 soulcandybt m 2 mamurs EL 1 Erica L Thompson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}