{"link": "https://www.themoviedb.org/tv/13865?language=en", "title": "Edge of Darkness", "resume": "Yorkshire detective Ronald Craven is haunted by the murder of his daughter and begins his own investigation into her death.", "rate": 84, "genre": ["Crime", "Drama"], "cast": ["Ian McNeice", "Tim McInnerny", "Joanne Whalley", "Bob Peck", "Joe Don Baker"], "character": ["Harcourt", "Terry Shields", "Emma Craven", "Thomas Craven", "Darius Jedburgh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13865   Expand Edge of Darkness   (1985) User Score Overview Yorkshire detective Ronald Craven is haunted by the murder of his daughter and begins his own investigation into her death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian McNeice Harcourt Tim McInnerny Terry Shields Joanne Whalley Emma Craven Bob Peck Thomas Craven Joe Don Baker Darius Jedburgh Full Cast & Crew Last Season Miniseries 1985 | 6 Episodes Season 1 of Edge of Darkness premiered on November  3, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  7 Recommendations   1967-07-08 Callan 6.0    1996-01-15 Our Friends in the North 8.5    1988-06-19 A Very British Coup 8.1    1987-11-04 A Perfect Spy 5.5    1996-04-28 Karaoke 7.4    1982-09-20 Smiley's People 7.9    1990-01-04 One Foot in the Grave 7.5    1983-09-30 Manimal 6.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b048vwd8 Genres Crime Drama Keywords daughter northern england politics detective father yorkshire murder thriller conspiracy miniseries death Content Score 86 Almost there... Top Contributors a 15 anne_f_ 13 Banana O 10 Ozbourne TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}