{"link": "https://www.themoviedb.org/tv/67171?language=en", "title": "Yutori-chan", "resume": "The story centres around Yutori-chan, a high school girl assigned to a part-time job in the marketing team of a medium-sized toy company called Popuu. There, she deal with the generation gaps that separate her from Tsumekomi-chan and Dankai-san.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Aoi Yuki", "Kana Hanazawa", "Akeno Watanabe"], "character": ["Yutori Tanaka (voice)", "Shiori Tsumekomichi (voice)", "Reiko Dankain (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67171   Expand Yutori-chan   (2010) User Score Overview The story centres around Yutori-chan, a high school girl assigned to a part-time job in the marketing team of a medium-sized toy company called Popuu. There, she deal with the generation gaps that separate her from Tsumekomi-chan and Dankai-san. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aoi Yuki Yutori Tanaka (voice) Kana Hanazawa Shiori Tsumekomichi (voice) Akeno Watanabe Reiko Dankain (voice) Full Cast & Crew Last Season Season 1 2010 | 25 Episodes Season 1 of Yutori-chan premiered on March 16, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yutori-chan. You can help by rating TV shows you've seen. Facts Original Name  ゆとりちゃん Status  Ended Network Anime One Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  3m Homepage   http://yutori-chan.jp/ Genres Animation Comedy Keywords workplace marketing slice of life generation gap Content Score 56 We're so close, yet so far. Top Contributors 48 Marr 🇳🇱 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}