{"link": "https://www.themoviedb.org/tv/66017?language=en", "title": "Diriliş: Ertuğrul", "resume": "Ertuğrul Bey and the Knights Templar in the 13th century Alba and step and step with the struggle against brutal Mongols depicts the process of establishing the Ottoman principality.", "rate": 73, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["Engin Altan Düzyatan", "Nurettin Sönmez", "Fahri Öztezcan", "Kaan Taşaner", "Hülya Darcan"], "character": ["Ertuğrul", "Bamsı Beyrek", "İlyas Fakih", "Gündoğdu", "Hayme Ana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66017   Expand Diriliş: Ertuğrul   (2014) User Score Overview Ertuğrul Bey and the Knights Templar in the 13th century Alba and step and step with the struggle against brutal Mongols depicts the process of establishing the Ottoman principality. Featured Crew Mehmet Bozdağ Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Engin Altan Düzyatan Ertuğrul Nurettin Sönmez Bamsı Beyrek Fahri Öztezcan İlyas Fakih Kaan Taşaner Gündoğdu Hülya Darcan Hayme Ana Full Cast & Crew Current Season Season 4 2017 | 28 Episodes Season 4 of Diriliş: Ertuğrul premiered on October 25, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for Diriliş: Ertuğrul. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Diriliş: Ertuğrul. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   http://www.trt1.com.tr/diziler/dirilis-ertugrul Genres Action & Adventure Drama War & Politics Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 110 mehmet s 20 saidmahmoud 13 Elizabeth Jennings R 11 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}