{"link": "https://www.themoviedb.org/tv/70455?language=en", "title": "The King in Love", "resume": "Set during the Goryeo dynasty, Won, crown prince, has a sweet appearance hiding a lust for conquest. He is best friends with Rin, an elegant man of royal descent and Won's bodyguard. When beautiful San, the sole daughter of the wealthiest man in the nation, enters the lives of the two young men, the three at first become friends but a tragic romance ensues afterwards. Based on the novel of the same name by Kim Yi-Ryung.", "rate": 54, "genre": ["Drama"], "cast": ["Yim Si-wan", "Im Yoona", "Hong Jong-hyun", "Park Hwan-Hee", "Oh Min-seok"], "character": ["Wang Won", "Eun San", "Wang Rin", "Wang Dan", "Song In"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70455   Expand The King in Love   (2017) User Score  Play Trailer Overview Set during the Goryeo dynasty, Won, crown prince, has a sweet appearance hiding a lust for conquest. He is best friends with Rin, an elegant man of royal descent and Won's bodyguard. When beautiful San, the sole daughter of the wealthiest man in the nation, enters the lives of the two young men, the three at first become friends but a tragic romance ensues afterwards. Based on the novel of the same name by Kim Yi-Ryung. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yim Si-wan Wang Won Im Yoona Eun San Hong Jong-hyun Wang Rin Park Hwan-Hee Wang Dan Oh Min-seok Song In Full Cast & Crew Last Season Season 1 2017 | 40 Episodes Season 1 of The King in Love premiered on July 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  14 Recommendations   2015-03-18 Angry Mom 8.3  Facts Original Name  왕은 사랑한다 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  30m Homepage   http://www.imbc.com/broad/tv/drama/kinginlove Genres Drama Keywords based on novel or book love triangle royal family romance korea historical historical drama goryeo Content Score 93 Almost there... Top Contributors M 62 Maria180493 39 RainingBullets 6 koreacpv 5 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}