{"link": "https://www.themoviedb.org/tv/70643?language=en", "title": "A Foreign Love Affair", "resume": "The young leader of the Oomi group, Ranmaru, was forced to marry Kaoru, the daughter from another group. The couple went to Italy, and had their wedding on a ship. However, neither of them actually liked the marriage, and Ranmaru was kicked out by his newlywed wife Kaoru on their first night. Al (Alberto), an Italian man on the ship, took an interest in Ranmaru, and the story revolves around the romance between the two men, Ranmaru and Al.", "rate": 100, "genre": ["Animation"], "cast": ["Junichi Suwabe", "Kentaro Ito", "Ryotaro Okiayu", "Yuki Kaida", "Tomoko Kawakami"], "character": ["Albert Valentino", "Ranmaru Oumi", "Ryuuji Gondou", "Kaoru Oumi", "Kaoru Oumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70643   Expand A Foreign Love Affair   (2007) User Score  Play Trailer Overview The young leader of the Oomi group, Ranmaru, was forced to marry Kaoru, the daughter from another group. The couple went to Italy, and had their wedding on a ship. However, neither of them actually liked the marriage, and Ranmaru was kicked out by his newlywed wife Kaoru on their first night. Al (Alberto), an Italian man on the ship, took an interest in Ranmaru, and the story revolves around the romance between the two men, Ranmaru and Al. Featured Crew Ayano Yamane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junichi Suwabe Albert Valentino Kentaro Ito Ranmaru Oumi Ryotaro Okiayu Ryuuji Gondou Yuki Kaida Kaoru Oumi Tomoko Kawakami Kaoru Oumi Full Cast & Crew Last Season Season 1 2007 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Foreign Love Affair. You can help by rating TV shows you've seen. Facts Original Name  Ikoku Irokoi Romantan Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  27m Homepage  - Genres Animation Keywords yakuza romantic comedy yaoi Content Score 100 Yes! Looking good! Top Contributors M 42 Mailoneso TB 3 TMDb Bot 2 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}