{"link": "https://www.themoviedb.org/tv/64127?language=en", "title": "Exo Next Door", "resume": "Ji Yeon-hee is an extremely shy, introverted 23-year-old girl with zero dating experience and a tendency to blush when talking to someone she likes. One day, four young men move into the house right next door to Yeon-hee's home, and to her surprise, they turn out to be Chanyeol, D.O, Baekhyun and Sehun from her favorite boy band Exo, who are looking to lay low for a while. They hire her to clean their house part-time during the winter vacation and that's when Yeon-hee found out that Chanyeol was her long lost childhood friend and crush \"Chan\" and is the grandson of the house owner. As the story goes on, Yeon-hee soon becomes involved in a love triangle with Chanyeol and D.O.", "rate": 87, "genre": ["Comedy", "Drama"], "cast": ["Park Chanyeol", "Moon Ga-young", "Doh Kyung-soo", "Byun Baek-hyun", "Oh Se-hun"], "character": ["Chanyeol", "Ji Yeon-hee", "D.O", "Baekhyun", "Sehun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64127   Expand Exo Next Door   (2015) User Score Overview Ji Yeon-hee is an extremely shy, introverted 23-year-old girl with zero dating experience and a tendency to blush when talking to someone she likes. One day, four young men move into the house right next door to Yeon-hee's home, and to her surprise, they turn out to be Chanyeol, D.O, Baekhyun and Sehun from her favorite boy band Exo, who are looking to lay low for a while. They hire her to clean their house part-time during the winter vacation and that's when Yeon-hee found out that Chanyeol was her long lost childhood friend and crush \"Chan\" and is the grandson of the house owner. As the story goes on, Yeon-hee soon becomes involved in a love triangle with Chanyeol and D.O. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Chanyeol Chanyeol Moon Ga-young Ji Yeon-hee Doh Kyung-soo D.O Byun Baek-hyun Baekhyun Oh Se-hun Sehun Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Exo Next Door premiered on April  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2010-07-11 Running Man 8.6  Facts Original Name  우리 옆집에 엑소가 산다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage   http://tvcast.naver.com/lineexonextdoor Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors t 38 tmdb38202327 14 Charles z 10 zurman1 M 8 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}