{"link": "https://www.themoviedb.org/tv/14733?language=en", "title": "Rich Man, Poor Man", "resume": "Based on the best-selling 1969 novel by Irwin Shaw, the series follows the divergent career courses of the impoverished German American Jordache brothers.", "rate": 72, "genre": ["Drama"], "cast": ["Peter Strauss", "Nick Nolte", "Susan Blakely", "Ed Asner", "Dorothy McGuire"], "character": ["Rudy Jordache", "Tom Jordache", "Julie Prescott", "Axel Jordache", "Mary Jordache"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14733   Expand Rich Man, Poor Man   (1976) User Score Overview Based on the best-selling 1969 novel by Irwin Shaw, the series follows the divergent career courses of the impoverished German American Jordache brothers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Strauss Rudy Jordache Nick Nolte Tom Jordache Susan Blakely Julie Prescott Ed Asner Axel Jordache Dorothy McGuire Mary Jordache Full Cast & Crew Last Season Rich Man, Poor Man Book II 1976 | 22 Episodes Season 2 of Rich Man, Poor Man premiered on September 21, 1976. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Anyone else here watch this back when it originally aired? Open 0 by genplant29\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rich Man, Poor Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords sibling relationship based on novel or book immigrant family Content Score 86 Almost there... Top Contributors 60 Marr 🇳🇱 m 8 movienator i 3 ismax935 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}