{"link": "https://www.themoviedb.org/tv/70420?language=en", "title": "Legend Quest", "resume": "When an evil force threatens his village, a gifted teen who can talk to ghosts puts his skills to good use, one legend at a time.", "rate": 77, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70420   Expand Legend Quest   (2017) User Score Overview When an evil force threatens his village, a gifted teen who can talk to ghosts puts his skills to good use, one legend at a time. Featured Crew Ernie Altbacker Creator Jose C. Garcia de Letona Creator James Krieg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Legend Quest premiered on February 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Legend Quest. You can help by rating TV shows you've seen. Facts Original Name  Las Leyendas Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  25m Homepage   https://www.netflix.com/title/80081863 Genres Animation Kids Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 15 Elizabeth Jennings k 7 karina_petrova r 5 rufotheone 5 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}