{"link": "https://www.themoviedb.org/tv/10676?language=en", "title": "The Upside Down Show", "resume": "The Upside Down Show, was a Logie Award winning show featuring Shane Dundas and David Collins that airs on Noggin, Nick Jr. Australia and ABC Australia. On the show they play brothers who live together in a strange house with a variety of unusual rooms. The show premiered on Nick Jr. Australia in August 2006 and on Noggin US on 16 October 2006, with 13 episodes developed by the highly acclaimed Sesame Workshop. The Sesame Workshop logo used on this show can only be seen on Noggin.\nInitial views of The Upside Down Show were disappointing, as it failed to match the views of Play With Me Sesame and Caillou during the 2006-2007 season. The show's début was criticized as being similar to Ernie and Bert.\nOn 27 December 2006, in a New York Post interview, Shane Dundas expressed doubts about the return of the show for a second season.\nOn 1 June 2007, the Umbilical Brothers announced on their website that Nickelodeon/Noggin USA were not interested in a third season of The Upside Down Show, despite its success. In 2007, the show won the Creative Craft Daytime Emmy Award for Main Title Design and a Parents' Choice Award Silver Honor for Television.", "rate": 0, "genre": ["Comedy"], "cast": ["Amanda Bishop", "Mat McCoy"], "character": ["Mrs. Foil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10676   Expand The Upside Down Show   (2005) User Score Overview The Upside Down Show, was a Logie Award winning show featuring Shane Dundas and David Collins that airs on Noggin, Nick Jr. Australia and ABC Australia. On the show they play brothers who live together in a strange house with a variety of unusual rooms. The show premiered on Nick Jr. Australia in August 2006 and on Noggin US on 16 October 2006, with 13 episodes developed by the highly acclaimed Sesame Workshop. The Sesame Workshop logo used on this show can only be seen on Noggin. Initial views of The Upside Down Show were disappointing, as it failed to match the views of Play With Me Sesame and Caillou during the 2006-2007 season. The show's début was criticized as being similar to Ernie and Bert. On 27 December 2006, in a New York Post interview, Shane Dundas expressed doubts about the return of the show for a second season. On 1 June 2007, the Umbilical Brothers announced on their website that Nickelodeon/Noggin USA were not interested in a third season of The Upside Down Show, despite its success. In 2007, the show won the Creative Craft Daytime Emmy Award for Main Title Design and a Parents' Choice Award Silver Honor for Television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Bishop Mrs. Foil Mat McCoy Full Cast & Crew Last Season Season 2 2008 | 2 Episodes Season 2 of The Upside Down Show premiered on October  9, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Upside Down Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}