{"link": "https://www.themoviedb.org/tv/57760?language=en", "title": "Big School", "resume": "A comedy about a dysfunctional staff room, unrequited love and interactive whiteboards set in an urban secondary school. Chemistry teacher Mr. Church is hopelessly in love with the school's new French teacher, who in turn is being chased by a lothario gym teacher.", "rate": 63, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57760   Expand Big School   (2013) User Score  Play Trailer Overview A comedy about a dysfunctional staff room, unrequited love and interactive whiteboards set in an urban secondary school. Chemistry teacher Mr. Church is hopelessly in love with the school's new French teacher, who in turn is being chased by a lothario gym teacher. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2014 | 6 Episodes Season 2 of Big School premiered on August 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2008-09-28 Little Britain USA 6.3    2010-12-25 Come Fly With Me 6.6    2011-02-25 Friday Night Dinner 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b04g6pq3 Genres Comedy Keywords school teaching british humour Content Score 64 We're so close, yet so far. Top Contributors 8 Elizabeth Jennings 3 kexag31a s 3 speedycars O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}