{"link": "https://www.themoviedb.org/tv/17760?language=en", "title": "The Last Place on Earth", "resume": "The Last Place on Earth is a 1985 Central Television seven part serial, written by Trevor Griffiths based on the book Scott and Amundsen by Roland Huntford. The book is an exploration of the expeditions of Captain Robert F. Scott and his Norwegian rival in polar exploration, Roald Amundsen in their attempts to reach the South Pole.\nThe series ran for seven episodes and starred a wide range of UK and Norwegian character actors as well as featuring some famous names, such as Max von Sydow, Richard Wilson, Sylvester McCoy and Pat Roach. It also featured performances early in their careers by Bill Nighy and Hugh Grant.\nSubsequently Huntford's book was republished under the same name. The book put forth the point of view that Amundsen's success in reaching the South Pole was abetted by much superior planning, whereas errors by Scott ultimately resulted in the death of him and his companions.", "rate": 60, "genre": ["Drama"], "cast": ["Martin Shaw", "Stephen Moore", "Max von Sydow", "Pat Roach", "Bill Nighy"], "character": ["Captain R. F. Scott", "Dr. 'Bill' Wilson", "Fridtjof Nansen", "PO Evans", "Cecil Meares"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17760   Expand The Last Place on Earth   (1985) User Score Overview The Last Place on Earth is a 1985 Central Television seven part serial, written by Trevor Griffiths based on the book Scott and Amundsen by Roland Huntford. The book is an exploration of the expeditions of Captain Robert F. Scott and his Norwegian rival in polar exploration, Roald Amundsen in their attempts to reach the South Pole. The series ran for seven episodes and starred a wide range of UK and Norwegian character actors as well as featuring some famous names, such as Max von Sydow, Richard Wilson, Sylvester McCoy and Pat Roach. It also featured performances early in their careers by Bill Nighy and Hugh Grant. Subsequently Huntford's book was republished under the same name. The book put forth the point of view that Amundsen's success in reaching the South Pole was abetted by much superior planning, whereas errors by Scott ultimately resulted in the death of him and his companions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Shaw Captain R. F. Scott Stephen Moore Dr. 'Bill' Wilson Max von Sydow Fridtjof Nansen Pat Roach PO Evans Bill Nighy Cecil Meares Full Cast & Crew Last Season Season 1 1985 | 7 Episodes Season 1 of The Last Place on Earth premiered on February 18, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Last Place on Earth. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 31 Murnau t 9 tothod PS 3 P. Snoopy k 1 kluder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}