{"link": "https://www.themoviedb.org/tv/18505?language=en", "title": "Queens Supreme", "resume": "Queens Supreme is an American courtroom dramedy television series which aired on CBS in January 2003. The series starred Oliver Platt in his first major television role as New York judge Jack Moran who, with his equally eccentric and colorful as colleagues, preside over court cases as the real-life Queens Supreme Court in Long Island City, Queens. The series had a strong cast and considerable financial backing, especially from Julia Roberts's Shoelace Productions, Spelling Television and Revolution Studios, however poor ratings forced its cancellation after three episodes.\nThe idea for the series came about when two New York attorneys, twin brothers Dan and Peter Thomas, were discussing courtroom stories based on their shared experiences in Queens while on a plane flight to California in 2001. One of the passengers, a Hollywood producer, was sitting next to them and mentioned that they could be the basis for a television series. Indeed, the producer brought the idea to screenwriter Kevin Fox who later successfully pitched it to CBS. Fox was initially hesitant in becoming involved, feeling there were too many courtroom dramas already, but agreed after spending time at the New York Supreme Court himself.", "rate": 5, "genre": ["Comedy", "Drama"], "cast": ["Robert Loggia", "Oliver Platt", "Annabella Sciorra", "L. Scott Caldwell", "Kyra Sedgwick"], "character": ["Judge Kim Vicidomini", "Quinn Coleman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18505   Expand Queens Supreme   (2003) User Score Overview Queens Supreme is an American courtroom dramedy television series which aired on CBS in January 2003. The series starred Oliver Platt in his first major television role as New York judge Jack Moran who, with his equally eccentric and colorful as colleagues, preside over court cases as the real-life Queens Supreme Court in Long Island City, Queens. The series had a strong cast and considerable financial backing, especially from Julia Roberts's Shoelace Productions, Spelling Television and Revolution Studios, however poor ratings forced its cancellation after three episodes. The idea for the series came about when two New York attorneys, twin brothers Dan and Peter Thomas, were discussing courtroom stories based on their shared experiences in Queens while on a plane flight to California in 2001. One of the passengers, a Hollywood producer, was sitting next to them and mentioned that they could be the basis for a television series. Indeed, the producer brought the idea to screenwriter Kevin Fox who later successfully pitched it to CBS. Fox was initially hesitant in becoming involved, feeling there were too many courtroom dramas already, but agreed after spending time at the New York Supreme Court himself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Loggia Oliver Platt Annabella Sciorra Judge Kim Vicidomini L. Scott Caldwell Kyra Sedgwick Quinn Coleman Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Queens Supreme premiered on January 10, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Queens Supreme. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbs.com/primetime/queens_supreme/ Genres Comedy Drama Keywords judge long island courtroom courtroom drama Content Score 71 Just a little bit more... Top Contributors 7 Banana T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}