{"link": "https://www.themoviedb.org/tv/21272?language=en", "title": "Doomed Megalopolis", "resume": "Doomed Megalopolis is a supernatural/dark fantasy anime. It is an adaptation of the historical fantasy novel Teito Monogatari by Hiroshi Aramata. The anime is darker, more violent and sexualized than any previous adaptations of the novel; an artistic decision probably inspired by the financial success of the OVA Legend of the Overfiend. Like its live-action predecessor, Tokyo: The Last Megalopolis, the anime is only an adaptation of the first 1/3rd of the original novel.\nIt was released by Toei in 1991 as a 4-part OVA. In 1995, ADV Films gained the rights to the anime and released it on a four-volume cassette series in the US, under the title Doomed Megalopolis. In 2001, ADV re-released the entire series on a 2-Disc DVD edition. However, this release did not have the original Japanese soundtrack or any special features. Eventually, ADV gathered the rights to the original Japanese voices, and in 2003, re-released an enhanced version entitled Doomed Megalopolis: Special Edition, wherein the Japanese language option was available and bonus features, such as interviews and documentaries were added.", "rate": 0, "genre": ["Animation"], "cast": ["Keiko Han", "Kenichi Ogata", "Kyusaku Shimada", "Takaya Hashi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21272   Expand Doomed Megalopolis   (1991) User Score Overview Doomed Megalopolis is a supernatural/dark fantasy anime. It is an adaptation of the historical fantasy novel Teito Monogatari by Hiroshi Aramata. The anime is darker, more violent and sexualized than any previous adaptations of the novel; an artistic decision probably inspired by the financial success of the OVA Legend of the Overfiend. Like its live-action predecessor, Tokyo: The Last Megalopolis, the anime is only an adaptation of the first 1/3rd of the original novel. It was released by Toei in 1991 as a 4-part OVA. In 1995, ADV Films gained the rights to the anime and released it on a four-volume cassette series in the US, under the title Doomed Megalopolis. In 2001, ADV re-released the entire series on a 2-Disc DVD edition. However, this release did not have the original Japanese soundtrack or any special features. Eventually, ADV gathered the rights to the original Japanese voices, and in 2003, re-released an enhanced version entitled Doomed Megalopolis: Special Edition, wherein the Japanese language option was available and bonus features, such as interviews and documentaries were added. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keiko Han Kenichi Ogata Kyusaku Shimada Takaya Hashi Full Cast & Crew Last Season Season 1 1991 | 4 Episodes Season 1 of Doomed Megalopolis premiered on September 27, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Doomed Megalopolis. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}