{"link": "https://www.themoviedb.org/tv/31199?language=en", "title": "Valemont", "resume": "Valemont is a supernatural American television miniseries on MTV that premiered on September 21, 2009. Two episodes premiered on Tuesdays during The Hills and The City. For six consecutive weeks, two and a half minute episodes of Valemont premiered in the commercial pods directly preceding The Hills and following The City. The concluding 23 episodes of the series were made available online at MTV.com and on V Cast Video from Verizon Wireless, along with other bonus footage.", "rate": 10, "genre": ["Mystery", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Eric Balfour", "Kristen Hager", "Dillon Casey", "Jessica Parker Kennedy", "Nikki Blonsky"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31199   Expand Valemont   (2009) User Score Overview Valemont is a supernatural American television miniseries on MTV that premiered on September 21, 2009. Two episodes premiered on Tuesdays during The Hills and The City. For six consecutive weeks, two and a half minute episodes of Valemont premiered in the commercial pods directly preceding The Hills and following The City. The concluding 23 episodes of the series were made available online at MTV.com and on V Cast Video from Verizon Wireless, along with other bonus footage. Featured Crew Christian Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Balfour Kristen Hager Dillon Casey Jessica Parker Kennedy Nikki Blonsky Full Cast & Crew Last Season Season 1 2009 | 35 Episodes Season 1 of Valemont premiered on September 29, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Valemont. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  3m Homepage   http://www.mtv.com/shows/valemont/series.jhtml Genres Mystery Sci-Fi & Fantasy Drama Keywords undercover vampire college miniseries suspicious death Content Score 93 Almost there... Top Contributors 12 Banana p 7 pierrejean75 b 6 binesum s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}