{"link": "https://www.themoviedb.org/tv/4630?language=en", "title": "The Fairly OddParents", "resume": "The Fairly OddParents is an American animated television series created by Butch Hartman for Nickelodeon. The series revolves around Timmy Turner, a 10-year old boy who is granted two fairy godparents named Cosmo and Wanda. The series started out as cartoon segments that ran from September 4, 1998 to March 23, 2001 on Oh Yeah! Cartoons and was later picked up as a series. The series is produced by Frederator Studios and, as of season 6, Billionfold, Inc. For the first four seasons, it was distributed outside the United States by the Canadian company, Nelvana International.\nHaving aired for more than 16 years, The Fairly OddParents is the longest-running fantasy TV series in American television history, and currently stands as Nickelodeon's second longest-running animated series (behind SpongeBob SquarePants).", "rate": 68, "genre": ["Animation", "Comedy", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Daran Norris", "Carlos Alazraqui", "Grey DeLisle", "Jim Ward", "Gary LeRoi Gray"], "character": ["Cosmo (voice)", "Denzel Q. Crocker (voice)", "Vicky (voice)", "Chet Ubetcha (voice)", "A.J. (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4630   Expand The Fairly OddParents   (2001) User Score Overview The Fairly OddParents is an American animated television series created by Butch Hartman for Nickelodeon. The series revolves around Timmy Turner, a 10-year old boy who is granted two fairy godparents named Cosmo and Wanda. The series started out as cartoon segments that ran from September 4, 1998 to March 23, 2001 on Oh Yeah! Cartoons and was later picked up as a series. The series is produced by Frederator Studios and, as of season 6, Billionfold, Inc. For the first four seasons, it was distributed outside the United States by the Canadian company, Nelvana International. Having aired for more than 16 years, The Fairly OddParents is the longest-running fantasy TV series in American television history, and currently stands as Nickelodeon's second longest-running animated series (behind SpongeBob SquarePants). Featured Crew Butch Hartman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Daran Norris Cosmo (voice) Carlos Alazraqui Denzel Q. Crocker (voice) Grey DeLisle Vicky (voice) Jim Ward Chet Ubetcha (voice) Gary LeRoi Gray A.J. (voice) Full Cast & Crew Last Season Season 10 2016 | 2 Episodes Season 10 of The Fairly OddParents premiered on January 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   1998-11-18 The Powerpuff Girls 7.0    2002-07-20 The Adventures of Jimmy Neutron: Boy Genius 6.1    1991-08-11 Rugrats 7.1    1996-10-07 Hey Arnold! 6.8    1996-04-28 Dexter's Laboratory 7.3    2004-04-03 Danny Phantom 6.5    1999-05-01 SpongeBob SquarePants 6.8    1997-09-13 Recess 6.8  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nick.com/shows/fairly-oddparents Genres Animation Comedy Kids Sci-Fi & Fantasy Keywords fairy wish kids Content Score 100 Yes! Looking good! Top Contributors 132 Banana 13 niqo19 m 12 mode2 CM 11 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}