{"link": "https://www.themoviedb.org/tv/4565?language=en", "title": "I'll Fly Away", "resume": "I'll Fly Away is an American drama television series set during the late 1950s and early 1960s, in an unspecified Southern U.S. state. It aired on NBC from 1991 to 1993 and starred Regina Taylor as Lilly Harper, a black housekeeper for the family of district attorney Forrest Bedford, whose name is an ironic reference to Nathan Bedford Forrest, the founder of the Ku Klux Klan. As the show progressed, Lilly became increasingly involved in the Civil Rights Movement, with events eventually drawing in Forrest as well.\nI'll Fly Away won two 1992 Emmy Awards, and 23 nominations in total. It won three Humanitas Prizes, two Golden Globe Awards, two NAACP Image Awards for Outstanding Drama Series, and a Peabody Award. However, the series was never a ratings blockbuster, and it was canceled by NBC in 1993, despite widespread protests by critics and viewer organizations.\nAfter the program's cancellation, a two-hour movie, I'll Fly Away: Then and Now, was produced, in order to resolve dangling storylines from Season 2, and provide the series with a true finale. The movie aired on October 11, 1993 on PBS. Its major storyline closely paralleled the true story of the 1955 murder of Emmett Till in Money, Mississippi. Thereafter, PBS began airing repeats of the original episodes, ceasing after one complete showing of the entire series.", "rate": 70, "genre": ["Drama"], "cast": ["Jeremy London", "Regina Taylor", "Kathryn Harrold", "Sam Waterston", "Peter Simmons"], "character": ["Nathaniel 'Nathan' Bedford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4565   Expand I'll Fly Away   (1991) User Score Overview I'll Fly Away is an American drama television series set during the late 1950s and early 1960s, in an unspecified Southern U.S. state. It aired on NBC from 1991 to 1993 and starred Regina Taylor as Lilly Harper, a black housekeeper for the family of district attorney Forrest Bedford, whose name is an ironic reference to Nathan Bedford Forrest, the founder of the Ku Klux Klan. As the show progressed, Lilly became increasingly involved in the Civil Rights Movement, with events eventually drawing in Forrest as well. I'll Fly Away won two 1992 Emmy Awards, and 23 nominations in total. It won three Humanitas Prizes, two Golden Globe Awards, two NAACP Image Awards for Outstanding Drama Series, and a Peabody Award. However, the series was never a ratings blockbuster, and it was canceled by NBC in 1993, despite widespread protests by critics and viewer organizations. After the program's cancellation, a two-hour movie, I'll Fly Away: Then and Now, was produced, in order to resolve dangling storylines from Season 2, and provide the series with a true finale. The movie aired on October 11, 1993 on PBS. Its major storyline closely paralleled the true story of the 1955 murder of Emmett Till in Money, Mississippi. Thereafter, PBS began airing repeats of the original episodes, ceasing after one complete showing of the entire series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy London Nathaniel 'Nathan' Bedford Regina Taylor Kathryn Harrold Sam Waterston Peter Simmons Full Cast & Crew Last Season Season 3 1993 | 1 Episode Season 3 of I'll Fly Away premiered on October 11, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I'll Fly Away. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords southern usa civil rights movement  racism period drama housekeeper district attorney 1950s domestic worker Content Score 71 Just a little bit more... Top Contributors 11 Banana 2 Elizabeth Jennings s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}