{"link": "https://www.themoviedb.org/tv/37731?language=en", "title": "Mr. Young", "resume": "Mr. Young is a Canadian comedy series that premiered on March 1, 2011 on YTV. The series is shot in front of a live audience in Burnaby, British Columbia. The series was created by Dan Signer, and stars Brendan Meyer, Matreya Fedor and Gig Morton as attendants of Finnegan High School. Further main cast includes Kurt Ostlund, Emily Tennant, and Milo Shandel.", "rate": 72, "genre": ["Comedy"], "cast": ["Brendan Meyer", "Gig Morton", "Matreya Fedor", "Paula Shaw", "Raugi Yu"], "character": ["Adam Young", "Derby", "Echo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37731   Expand Mr. Young   (2011) User Score Overview Mr. Young is a Canadian comedy series that premiered on March 1, 2011 on YTV. The series is shot in front of a live audience in Burnaby, British Columbia. The series was created by Dan Signer, and stars Brendan Meyer, Matreya Fedor and Gig Morton as attendants of Finnegan High School. Further main cast includes Kurt Ostlund, Emily Tennant, and Milo Shandel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brendan Meyer Adam Young Gig Morton Derby Matreya Fedor Echo Paula Shaw Raugi Yu Full Cast & Crew Last Season Season 3 2012 | 24 Episodes Season 3 of Mr. Young premiered on December 12, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Adam: Happy Birthday Brendan Meyer! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2016-04-01 Wild Catch / Chasing Monsters 8.7    2014-04-26 Worst Year of My Life, Again! 7.3    2013-10-26 Verliefd op Ibiza 6.0    2017-03-17 Julie's Greenroom 7.8  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.ytv.com/shows/97/mr-young/ Genres Comedy Keywords high school child prodigy teenager Content Score 86 Almost there... Top Contributors 9 DarkMan 3 Banana 3 lscofield s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}