{"link": "https://www.themoviedb.org/tv/65320?language=en", "title": "Shame", "resume": "The story of a young teenager group, born 1999, and a pupil on Hartvig Nissens upper secondary school in Oslo, and her friends and their life, troubles, scandals and every day life. Which of the members represented changes per season.", "rate": 63, "genre": ["Comedy", "Drama"], "cast": ["Iman Meskini", "Ulrikke Falch", "Josefine Frida Pettersen", "Lisa Teige", "Ina Svenningsdal"], "character": ["Sana Bakkoush", "Vilde Hellerud Lien", "Noora Amalie Sætre", "Eva Kviig Mohn", "Chris Berg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65320   Expand Shame   (2015) User Score  Play Trailer Overview The story of a young teenager group, born 1999, and a pupil on Hartvig Nissens upper secondary school in Oslo, and her friends and their life, troubles, scandals and every day life. Which of the members represented changes per season. Featured Crew Julie Andem Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  16 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Iman Meskini Sana Bakkoush Ulrikke Falch Vilde Hellerud Lien Josefine Frida Pettersen Noora Amalie Sætre Lisa Teige Eva Kviig Mohn Ina Svenningsdal Chris Berg Full Cast & Crew Last Season Season 4: Sana 2017 | 10 Episodes Season 4 of Shame premiered on April 13, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply S I treated first 3 seasons as a guilty pleasure... Open 1 by  MirrorMask Go to Discussions Media Most Popular Videos  2 Backdrops  16 Posters  5 Recommendations   2012-10-22 RuPaul's Drag Race All Stars 8.7    2016-10-16 Eyewitness 7.4    2015-10-06 Chewing Gum 7.0    2017-03-27 Harlots 6.9    2017-08-12 DuckTales 7.2    2017-04-28 Dear White People 5.9    2016-07-17 Vice Principals 6.8    2016-02-19 Love 7.4  Facts Original Name  Skam Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Norwegian Runtime  25m Homepage   http://skam.p3.no/ Genres Comedy Drama Keywords high school friendship muslim norway teenager teenage sexuality lgbt oslo norway teen drama Content Score 100 Yes! Looking good! Top Contributors 95 Bendik 34 Banana 27 Idasf 27 nbuzovskiy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}