{"link": "https://www.themoviedb.org/tv/60245?language=en", "title": "By Any Means", "resume": "By Any Means follows a clandestine unit living on the edge and playing the criminal elite at their own game, existing in the grey area between the letter of the law and true justice.", "rate": 70, "genre": ["Drama"], "cast": ["Warren Brown", "Shelley Conn", "Elliot Knight", "Gina McKee", "Andrew-Lee Potts"], "character": ["Jack Quinn", "Jessica Jones", "Charlie", "Helen Barlow", "Thomas Tomkins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60245   Expand By Any Means   (2013) User Score  Play Trailer Overview By Any Means follows a clandestine unit living on the edge and playing the criminal elite at their own game, existing in the grey area between the letter of the law and true justice. Featured Crew Tony Jordan Creator Richard Lazarus Creator James Payne Creator Jeff Povey Creator Richard Zajdlic Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Warren Brown Jack Quinn Shelley Conn Jessica Jones Elliot Knight Charlie Gina McKee Helen Barlow Andrew-Lee Potts Thomas Tomkins Full Cast & Crew Last Season Season 1 2013 | 6 Episodes Season 1 of By Any Means premiered on September 22, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2014-01-09 Spies of Warsaw 7.2    2013-01-04 Zen 7.7    2011-06-05 Case Histories 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b03bvtk4 Genres Drama Keywords england vigilante clandestine Content Score 100 Yes! Looking good! Top Contributors 20 Elizabeth Jennings e 3 error666 3 Zlogorek 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}