{"link": "https://www.themoviedb.org/tv/73032?language=en", "title": "Shall I Compare You To a Spring Day", "resume": "A coming-of-age story about young love and brotherhood among a group of young adults who lived during the revolutionary times in Beijing.", "rate": 10, "genre": ["Drama"], "cast": ["Zhou Dongyu", "Zhang Yishan", "You Jing Ru", "Chen Yi Long"], "character": ["Xiao Hong", "Qiu Shui", "Zhao Ying Nan", "Gu Ming / Xiao Bai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73032   Expand Shall I Compare You To a Spring Day   (2017) User Score Overview A coming-of-age story about young love and brotherhood among a group of young adults who lived during the revolutionary times in Beijing. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhou Dongyu Xiao Hong Zhang Yishan Qiu Shui You Jing Ru Zhao Ying Nan Chen Yi Long Gu Ming / Xiao Bai Full Cast & Crew Last Season Season 1 2017 | 40 Episodes Season 1 of Shall I Compare You To a Spring Day premiered on July 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Shall I Compare You To a Spring Day. You can help by rating TV shows you've seen. Facts Original Name  春风十里，不如你 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  42m Homepage  - Genres Drama Keywords romance coming of age Content Score 86 Almost there... Top Contributors M 20 Maria180493 l 18 lovejohncn 16 Elizabeth Jennings 3 mikeglay  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}