{"link": "https://www.themoviedb.org/tv/70317?language=en", "title": "Initial D: Second Stage", "resume": "Following his victory over RedSuns leader Ryosuke Takahashi, AE86 driver Takumi Fujiwara is challenged by the Lancer EVO-based \"Emperor,\" a group known for taking decals of racing teams they defeat, cutting them up and placing them on their cars like a fighter plane kill board. Takumi's undefeated streak is on the line as his AE86 is virtually no match against the more powerful and more agile four-wheel-drive EVOs of the Emperor team.", "rate": 85, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Shin'ichirou Miki", "Unsho Ishizuka", "Mitsuo Iwata", "Ayako Kawasumi", "Kazuki Yao"], "character": ["Takumi Fujiwara", "Bunta Fujiwara", "Itsuki Takeuchi", "Natsuki Mogi", "Koichiro Iketani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70317   Expand Initial D: Second Stage   (1999) User Score Overview Following his victory over RedSuns leader Ryosuke Takahashi, AE86 driver Takumi Fujiwara is challenged by the Lancer EVO-based \"Emperor,\" a group known for taking decals of racing teams they defeat, cutting them up and placing them on their cars like a fighter plane kill board. Takumi's undefeated streak is on the line as his AE86 is virtually no match against the more powerful and more agile four-wheel-drive EVOs of the Emperor team. Featured Crew Shuichi Shigeno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Shin'ichirou Miki Takumi Fujiwara Unsho Ishizuka Bunta Fujiwara Mitsuo Iwata Itsuki Takeuchi Ayako Kawasumi Natsuki Mogi Kazuki Yao Koichiro Iketani Full Cast & Crew Last Season Season 1 1999 | 13 Episodes Season 1 of Initial D: Second Stage premiered on October 14, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Initial D: Second Stage. You can help by rating TV shows you've seen. Facts Original Name  頭文字D Second Stage Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Comedy Keywords sports car racing car drifting car drag racing car tuning anime Content Score 100 Yes! Looking good! Top Contributors 69 MrRadical G 10 Giaten 4 seboseboss TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}