{"link": "https://www.themoviedb.org/tv/70897?language=en", "title": "Ingobernable", "resume": "The First Lady of Mexico has big plans to improve conditions for the country. As she starts to lose faith in her husband, President Diego Nava, she finds herself at a crossroad where she will need to find a way to deal with a great challenge.", "rate": 70, "genre": ["Drama", "Crime"], "cast": ["Kate del Castillo", "Marco Treviño", "Eréndira Ibarra", "Alberto Guerra", "Erik Hayser"], "character": ["Emilia Urquiza", "General Agustín Aguirre", "Ana Vargas-West", "Canek Lagos", "President Diego Nava"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70897   Expand Ingobernable   (2017) User Score Overview The First Lady of Mexico has big plans to improve conditions for the country. As she starts to lose faith in her husband, President Diego Nava, she finds herself at a crossroad where she will need to find a way to deal with a great challenge. Featured Crew Rodrigo Ordoñez Creator Luis Gamboa Creator Fernanda Eguiarte Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate del Castillo Emilia Urquiza Marco Treviño General Agustín Aguirre Eréndira Ibarra Ana Vargas-West Alberto Guerra Canek Lagos Erik Hayser President Diego Nava Full Cast & Crew Last Season Season 1 2017 | 15 Episodes Season 1 of Ingobernable premiered on March 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ingobernable. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  Spanish; Castilian Runtime  40m Homepage   https://www.netflix.com/title/80066429 Genres Drama Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors MP 8 Mr. Peanutbutter Y 6 YJ s 6 shiff7 6 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}