{"link": "https://www.themoviedb.org/tv/10004?language=en", "title": "The Yellow Rose", "resume": "The Yellow Rose is an American television series. It was broadcast on the NBC network during the 1983-1984 season. It was produced by Paul Freeman.\nThe series was at least partly inspired by the more coltish elements of the soap opera Dallas, and dealt with the intrigues of the Texas-based ranch-owning Champion family. The show's cast included Sam Elliott, David Soul, Edward Albert, Cybill Shepherd, Chuck Connors, Noah Beery, Jr., Ken Curtis, Robin Wright and Jane Russell. The Yellow Rose was canceled after one season of twenty-two episodes.\nIn the summer of 1990, the series was rerun again on NBC along with the short-lived Bret Maverick starring James Garner.", "rate": 0, "genre": ["Soap", "Drama"], "cast": ["Noah Beery, Jr.", "Edward Albert", "David Soul", "Ken Curtis", "Chuck Connors"], "character": ["Luther Dillard", "Quisto Champion", "Roy Champion", "Hoyt Coryell", "Jeb Hollister"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10004   Expand The Yellow Rose   (1983) User Score Overview The Yellow Rose is an American television series. It was broadcast on the NBC network during the 1983-1984 season. It was produced by Paul Freeman. The series was at least partly inspired by the more coltish elements of the soap opera Dallas, and dealt with the intrigues of the Texas-based ranch-owning Champion family. The show's cast included Sam Elliott, David Soul, Edward Albert, Cybill Shepherd, Chuck Connors, Noah Beery, Jr., Ken Curtis, Robin Wright and Jane Russell. The Yellow Rose was canceled after one season of twenty-two episodes. In the summer of 1990, the series was rerun again on NBC along with the short-lived Bret Maverick starring James Garner. Featured Crew Doru Năstase Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noah Beery, Jr. Luther Dillard Edward Albert Quisto Champion David Soul Roy Champion Ken Curtis Hoyt Coryell Chuck Connors Jeb Hollister Full Cast & Crew Last Season Season 1 1983 | 22 Episodes Season 1 of The Yellow Rose premiered on October  2, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Yellow Rose. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords southern usa texas ranch Content Score 79 Pump it up! We're close now. Top Contributors 14 Banana 4 DimaShow 3 Zlogorek 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}