{"link": "https://www.themoviedb.org/tv/61225?language=en", "title": "Matador", "resume": "Matador chronicles the unlikely rise of Tony \"Matador\" Bravo, a popular soccer star who comes to be known as much for his playboy antics off the field as his dynamic moves on it. But what his fans and family don't realize is that it's all a cover—in truth, he is a skilled covert operative executing missions for a little-known branch of the CIA. “Matador” has the kind of fame and notoriety that affords him access to powerful circles of corruption and villainy. But, in balancing the dueling roles in which he's been cast, he will be forced to confront the question of his true identity… and it is this mission which will prove to be his most dangerous.", "rate": 55, "genre": ["Action", "Adventure", "Crime"], "cast": ["Gabriel Luna", "Nicky Whelan", "Neil Hopkins", "Tanc Sade", "Alfred Molina"], "character": ["Tony Bravo", "Annie Mason", "Noah Peacott", "Alec Holester", "Andrés Galan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61225   Expand Matador   (2014) User Score Overview Matador chronicles the unlikely rise of Tony \"Matador\" Bravo, a popular soccer star who comes to be known as much for his playboy antics off the field as his dynamic moves on it. But what his fans and family don't realize is that it's all a cover—in truth, he is a skilled covert operative executing missions for a little-known branch of the CIA. “Matador” has the kind of fame and notoriety that affords him access to powerful circles of corruption and villainy. But, in balancing the dueling roles in which he's been cast, he will be forced to confront the question of his true identity… and it is this mission which will prove to be his most dangerous. Featured Crew Roberto Orci Creator Andrew Orci Creator Dan Dworkin Creator Jay Beattie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabriel Luna Tony Bravo Nicky Whelan Annie Mason Neil Hopkins Noah Peacott Tanc Sade Alec Holester Alfred Molina Andrés Galan Full Cast & Crew Last Season Season 1 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2015-01-27 Stalker 5.8    2014-07-09 Extant 6.1    2013-04-22 Rectify 7.6    2011-07-11 Alphas 6.5    2013-10-17 Reign 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.elreynetwork.com/#/originals/matador Genres Action & Adventure Crime Keywords undercover soccer dea agent Content Score 93 Almost there... Top Contributors 21 lineker 20 Elizabeth Jennings 14 CouchTater C 9 Cataloguer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}