{"link": "https://www.themoviedb.org/tv/25791?language=en", "title": "Good Advice", "resume": "Good Advice is an American situation comedy series that aired for two seasons on CBS from 1993 to 1994. It was co-created and executive produced by Danny Jacobson and Norma Safford Vela; and starred Shelley Long and Treat Williams. The Show was a hit, but it was cancelled because Long had suffered health problems that made her unable to film any new episodes for a long period of time.", "rate": 0, "genre": ["Comedy"], "cast": ["Shelley Long", "Treat Williams", "Teri Garr", "George Wyner", "Ross Malinger"], "character": ["Susan DeRuzza", "Jack Harold", "Paige Turner", "Artie Cohen", "Michael DeRuzza"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25791   Expand Good Advice   (1993) User Score Overview Good Advice is an American situation comedy series that aired for two seasons on CBS from 1993 to 1994. It was co-created and executive produced by Danny Jacobson and Norma Safford Vela; and starred Shelley Long and Treat Williams. The Show was a hit, but it was cancelled because Long had suffered health problems that made her unable to film any new episodes for a long period of time. Featured Crew Danny Jacobson Creator Norma Safford Vela Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shelley Long Susan DeRuzza Treat Williams Jack Harold Teri Garr Paige Turner George Wyner Artie Cohen Ross Malinger Michael DeRuzza Full Cast & Crew Last Season Season 2 1994 | 13 Episodes Season 2 of Good Advice premiered on May 23, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Good Advice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords therapist writer divorce divorce lawyer marriage counselor sitcom Content Score 79 Pump it up! We're close now. Top Contributors 19 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}