{"link": "https://www.themoviedb.org/tv/77288?language=en", "title": "Rivals Forever - The Sneaker Battle", "resume": "The life and struggle of the Dassler brothers. Founders of the brands of Adidas and Puma.", "rate": 67, "genre": ["Drama", "Family"], "cast": ["Christian Friedel", "Hanno Koffler", "Hannah Herzsprung", "Alina Levshin", "Ted Otis"], "character": ["Adi Dassler", "Rudi Dassler", "Friedl Dassler", "Käthe Dassler", "Captain Rollins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77288   Expand Rivals Forever - The Sneaker Battle   (2017) User Score Overview The life and struggle of the Dassler brothers. Founders of the brands of Adidas and Puma. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Friedel Adi Dassler Hanno Koffler Rudi Dassler Hannah Herzsprung Friedl Dassler Alina Levshin Käthe Dassler Ted Otis Captain Rollins Full Cast & Crew Last Season Miniseries 2017 | 2 Episodes Season 1 of Rivals Forever - The Sneaker Battle premiered on April 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Rivals Forever - The Sneaker Battle. You can help by rating TV shows you've seen. Facts Original Name  Die Dasslers Status  Ended Networks Certification 6 Meaning Can be aired at any time. Type  Miniseries Original Language  German Runtime  173m Homepage   http://www.daserste.de/unterhaltung/film/die-dasslers/index.html Genres Drama Family Keywords biography miniseries Content Score 93 Almost there... Top Contributors TB 58 TMDb Bot 23 Sergiojamon R 22 Rebecca 5 davidsc99  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}