{"link": "https://www.themoviedb.org/tv/13336?language=en", "title": "Auto-B-Good", "resume": "Auto-B-Good is an American animated series. The series features short stories set in the fictional City of Auto, in which all the citizens are cars. The program is designed to teach children lessons in moral character and values. Auto-B-Good was produced by Wet Cement Productions, a Minnesota-based animation studio. In 2005 it won an Emmy award for graphics/animation in the non-news category and also was the recipient of three Telly Awards and three Aurora Awards. In 2006, Auto-B-Good won 4 more Emmy Awards for Audio/Post Production, Musical Composition/Arrangement, Graphic Arts and Animation, Children/Youth Program Feature/Segment/Special.", "rate": 0, "genre": ["Animation"], "cast": ["Len Goodman", "Kim Kivens", "Sabrina Crews", "Heidi Fellner", "Charles Hubbell"], "character": ["Professor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13336   Expand Auto-B-Good   (2000) User Score Overview Auto-B-Good is an American animated series. The series features short stories set in the fictional City of Auto, in which all the citizens are cars. The program is designed to teach children lessons in moral character and values. Auto-B-Good was produced by Wet Cement Productions, a Minnesota-based animation studio. In 2005 it won an Emmy award for graphics/animation in the non-news category and also was the recipient of three Telly Awards and three Aurora Awards. In 2006, Auto-B-Good won 4 more Emmy Awards for Audio/Post Production, Musical Composition/Arrangement, Graphic Arts and Animation, Children/Youth Program Feature/Segment/Special. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Len Goodman Professor Kim Kivens Sabrina Crews Heidi Fellner Charles Hubbell Full Cast & Crew Last Season Auto b good season 1 2000 | 37 Episodes Season 1 of Auto-B-Good premiered on January  1, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Auto-B-Good. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  26m Homepage   http://www.autobgood.com/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 tkozyrski  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}