{"link": "https://www.themoviedb.org/tv/1890?language=en", "title": "Roughnecks: Starship Troopers Chronicles", "resume": "Roughnecks: Starship Troopers Chronicles is a CGI animated television series, based on the novel by Robert A. Heinlein and the 1997 film adaptation. The film's director, Paul Verhoeven, served as executive producer. It follows the exploits of the Mobile Infantry squad, \"Razak's Roughnecks,\" during the SICON–Bugs War between a newly united humanity and an extraterrestrial race, known as the \"Bugs,\" also sometimes referred to as Arachnids. The show focuses mainly on the Roughnecks' missions, rather than addressing the larger war.\nThe show was geared towards an adult-oriented science fiction audience without being too violent, mature or controversial for the Saturday morning age group. The series aired for one season on BKN beginning in August 1999 and in syndication in the United States and Canada. It was later picked up by the Sci-Fi Channel in the US and Teletoon in Canada. The entire series is available to be streamed on Netflix and Crackle in the US, along with several Minisodes. Despite its short run, the series developed a cult following.\nThe show combines elements of Verhoeven's film and the original novel, such as the extraterrestrial race known as the Skinnies, powered armor suits and drop pods. The series also adds some original elements, while omitting the political aspects of the original work and film.", "rate": 60, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Rider Strong", "Irene Bedard", "Steve Staley", "Neil Patrick Harris", "James Horan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1890   Expand Roughnecks: Starship Troopers Chronicles   (1999) User Score Overview Roughnecks: Starship Troopers Chronicles is a CGI animated television series, based on the novel by Robert A. Heinlein and the 1997 film adaptation. The film's director, Paul Verhoeven, served as executive producer. It follows the exploits of the Mobile Infantry squad, \"Razak's Roughnecks,\" during the SICON–Bugs War between a newly united humanity and an extraterrestrial race, known as the \"Bugs,\" also sometimes referred to as Arachnids. The show focuses mainly on the Roughnecks' missions, rather than addressing the larger war. The show was geared towards an adult-oriented science fiction audience without being too violent, mature or controversial for the Saturday morning age group. The series aired for one season on BKN beginning in August 1999 and in syndication in the United States and Canada. It was later picked up by the Sci-Fi Channel in the US and Teletoon in Canada. The entire series is available to be streamed on Netflix and Crackle in the US, along with several Minisodes. Despite its short run, the series developed a cult following. The show combines elements of Verhoeven's film and the original novel, such as the extraterrestrial race known as the Skinnies, powered armor suits and drop pods. The series also adds some original elements, while omitting the political aspects of the original work and film. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rider Strong Irene Bedard Steve Staley Neil Patrick Harris James Horan Full Cast & Crew Last Season Season 1 1999 | 36 Episodes Season 1 of Roughnecks: Starship Troopers Chronicles premiered on August 30, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Roughnecks: Starship Troopers Chronicles. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 5 arpbob s 3 speedycars 3 Farkas Tibor TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}