{"link": "https://www.themoviedb.org/tv/63499?language=en", "title": "Classroom Crisis", "resume": "Humanity has successfully colonized all the planets in the Solar System, with intentions to continue into new frontiers. Individuals live stable lives in these colonies, including young high school students living in 4th Tokyo on Mars. Two of these students are Iris Shirazaki and Mizuki Sera. Iris is finishing her last year of high school while studying to be a test pilot while her friend Mizuki also works as a mechanic on the aircraft. Her own brother, Kaito, oversees Mizuki and Iris as their homeroom teacher and program director.", "rate": 75, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Shiina Natsukawa", "Yuuma Uchida", "Ari Ozawa", "Showtaro Morikubo", "Sora Amamiya"], "character": ["Aki Kaminagaya", "Nagisa Kiryū", "Mizuki Sera", "Kaito Sera", "Iris Shirasaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63499   Expand Classroom Crisis   (2015) User Score Overview Humanity has successfully colonized all the planets in the Solar System, with intentions to continue into new frontiers. Individuals live stable lives in these colonies, including young high school students living in 4th Tokyo on Mars. Two of these students are Iris Shirazaki and Mizuki Sera. Iris is finishing her last year of high school while studying to be a test pilot while her friend Mizuki also works as a mechanic on the aircraft. Her own brother, Kaito, oversees Mizuki and Iris as their homeroom teacher and program director. Featured Crew MONTWO Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shiina Natsukawa Aki Kaminagaya Yuuma Uchida Nagisa Kiryū Ari Ozawa Mizuki Sera Showtaro Morikubo Kaito Sera Sora Amamiya Iris Shirasaki Full Cast & Crew Last Season Season 1 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Classroom Crisis. You can help by rating TV shows you've seen. Facts Original Name  クラスルーム☆クライシス Status  Ended Networks Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.classroom-crisis.com/ Genres Animation Comedy Drama Keywords high school mars space travel corporate thriller anime Content Score 93 Almost there... Top Contributors 68 miryoku 13 Elizabeth Jennings 11 Ailurus Fulgens 10 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}