{"link": "https://www.themoviedb.org/tv/63951?language=en", "title": "Perfect Couple", "resume": "During the Ming Dynasty, Yu Qi Lin came to the capital with her foster mother’s token, alone. She ran into arrogant young master Jin Yuan Bao, son of the Jin family. Yu Qi Ling accidentally marries Jin Yuan Bao under a false identity. Luckily, she was saved by Gu Chang Feng and coincidentally learned that his mother was the only insider who knew her foster mother was framed back then. With truth coming out, Madam Jin finally came to her senses, and the Jin family took Yu Qi Ling in again.", "rate": 100, "genre": ["Comedy"], "cast": ["Tiffany Tang", "Wallace Huo", "Vivian Wu", "Huang Ming"], "character": ["Yu Qi Ling", "Jin Yuan Bao", "Madam Jin", "Gu Chang Feng"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63951   Expand Perfect Couple   (2014) User Score Overview During the Ming Dynasty, Yu Qi Lin came to the capital with her foster mother’s token, alone. She ran into arrogant young master Jin Yuan Bao, son of the Jin family. Yu Qi Ling accidentally marries Jin Yuan Bao under a false identity. Luckily, she was saved by Gu Chang Feng and coincidentally learned that his mother was the only insider who knew her foster mother was framed back then. With truth coming out, Madam Jin finally came to her senses, and the Jin family took Yu Qi Ling in again. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tiffany Tang Yu Qi Ling Wallace Huo Jin Yuan Bao Vivian Wu Madam Jin Huang Ming Gu Chang Feng Full Cast & Crew Last Season Season 1 2014 | 45 Episodes Season 1 of Perfect Couple premiered on April 21, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Perfect Couple. You can help by rating TV shows you've seen. Facts Original Name  金玉良缘 Status  Ended Network JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 28 Maria180493 5 Elizabeth Jennings 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}