{"link": "https://www.themoviedb.org/tv/57273?language=en", "title": "The Red Road", "resume": "Lines will be crossed when tragedy forces two men, a mesmerizing ex-con and an embattled local cop, to face the secrets of their past. As these two men find themselves increasingly compromised by one another, the lives of both quickly unravel.", "rate": 68, "genre": ["Drama"], "cast": ["Martin Henderson", "Jason Momoa", "Julianne Nicholson", "Allie Gonino", "Tom Sizemore"], "character": ["Harold Jensen", "Philip Kopus", "Jean Jensen", "Rachel Jensen", "Jack Kopus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57273   Expand The Red Road   (2014) User Score  Play Trailer Overview Lines will be crossed when tragedy forces two men, a mesmerizing ex-con and an embattled local cop, to face the secrets of their past. As these two men find themselves increasingly compromised by one another, the lives of both quickly unravel. Featured Crew Aaron Guzikowski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Henderson Harold Jensen Jason Momoa Philip Kopus Julianne Nicholson Jean Jensen Allie Gonino Rachel Jensen Tom Sizemore Jack Kopus Full Cast & Crew Last Season Season 2 2015 | 6 Episodes Season 2 of The Red Road premiered on April  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations   2006-10-10 Intelligence 8.3    2015-05-25 Texas Rising 6.4    2006-03-07 The Unit 7.1    2016-01-21 Baskets 7.2    2012-09-25 Brickleberry 7.0    2015-03-05 American Crime 6.6    2014-03-10 Believe 6.3    2015-10-13 River 7.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.sundance.tv/series/the-red-road Genres Drama Keywords sheriff native american hit-and-run cover-up Content Score 100 Yes! Looking good! Top Contributors 29 Travis Bell 25 Elizabeth Jennings S 6 Shady12 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}