{"link": "https://www.themoviedb.org/tv/57646?language=en", "title": "Master's Sun", "resume": "Joo Joong-won is the arrogant, greedy CEO of Kingdom, a  conglomerate that includes a supermall and a hotel. \"Ghost whisperer”  Tae Gong-shil, is a misunderstood outcast who can't keep a  boyfriend or a job since a near death experience left her seeing needy  ghosts. She feels compelled to help them resolve their earthly issues so  they can move on to the afterlife... and he feels compelled to think  she's crazy. Soon their lives merge into a complicated web of hijinx,  misunderstandings, and... yes, love.", "rate": 83, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["So Ji-sub", "Gong Hyo-jin", "Seo In Guk", "Kim Yoo-ri", "Hwang Sun-hee"], "character": ["Joo Jоong-won", "Tae Gong-shil", "Kang Woo", "Tae Yi-ryung", "Hanna Brown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57646   Expand Master's Sun   (2013) User Score Overview Joo Joong-won is the arrogant, greedy CEO of Kingdom, a  conglomerate that includes a supermall and a hotel. \"Ghost whisperer”  Tae Gong-shil, is a misunderstood outcast who can't keep a  boyfriend or a job since a near death experience left her seeing needy  ghosts. She feels compelled to help them resolve their earthly issues so  they can move on to the afterlife... and he feels compelled to think  she's crazy. Soon their lives merge into a complicated web of hijinx,  misunderstandings, and... yes, love. Featured Crew Hong Mi Ran Creator Hong Jeong Eun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast So Ji-sub Joo Jоong-won Gong Hyo-jin Tae Gong-shil Seo In Guk Kang Woo Kim Yoo-ri Tae Yi-ryung Hwang Sun-hee Hanna Brown Full Cast & Crew Last Season Season 1 2013 | 17 Episodes Season 1 of Master's Sun premiered on August  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  5 Recommendations   2014-08-07 Surplus Princess 7.5    2010-03-31 Personal Taste 7.4    2015-11-16 Oh My Venus 7.8    2014-07-23 It's Okay, That's Love 9.3    2013-08-05 Good Doctor 8.6    2012-05-30 Bridal Mask 9.5    2015-01-07 Kill Me, Heal Me 8.7    2015-07-03 Oh My Ghostess 7.9  Facts Original Name  주군의 태양 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Korean Runtime  63m Homepage   http://tv.sbs.co.kr/juguntaeyang/ Genres Comedy Sci-Fi & Fantasy Keywords medium romance korea ghost communicating with the dead Content Score 93 Almost there... Top Contributors M 37 Maria180493 29 Marr 🇳🇱 17 Elizabeth Jennings S 14 Siyra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}