{"link": "https://www.themoviedb.org/tv/1651?language=en", "title": "Fantastic Four", "resume": "Fantastic Four is an animated series produced by Hanna-Barbera Productions and the first animated series based on Marvel's comic book series Fantastic Four. The program, featuring character designs by Alex Toth, aired on ABC from 1967 to 1970. It lasted for 20 episodes, with repeat episodes airing on ABC until the network cancelled the program. It was also rerun as part of the continuing series Hanna-Barbera's World of Super Adventure.\nThrough a series of transactions, Disney currently holds the rights to the majority of Marvel's 1960s-1990s animated output. However, the 1967-1968 Fantastic Four was produced by Hanna-Barbera, whose library is now owned by Time Warner, making the series one of only a handful of Marvel-related TV projects not owned by Disney. Time Warner is also the owner of Marvel's biggest competitor, DC Comics, as well as the owner of New Line Cinema, which produced a movie trilogy based on another Marvel superhero, Blade.", "rate": 70, "genre": ["Animation", "Action", "Adventure"], "cast": ["Jo Ann Pflug", "Jack DeLeon", "Gerald Mohr", "Paul Frees"], "character": ["Invisible Girl (voice)", "The Human Torch (voice)", "Mr. Fantastic (voice)", "The Thing (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1651   Expand Fantastic Four   (1967) User Score Overview Fantastic Four is an animated series produced by Hanna-Barbera Productions and the first animated series based on Marvel's comic book series Fantastic Four. The program, featuring character designs by Alex Toth, aired on ABC from 1967 to 1970. It lasted for 20 episodes, with repeat episodes airing on ABC until the network cancelled the program. It was also rerun as part of the continuing series Hanna-Barbera's World of Super Adventure. Through a series of transactions, Disney currently holds the rights to the majority of Marvel's 1960s-1990s animated output. However, the 1967-1968 Fantastic Four was produced by Hanna-Barbera, whose library is now owned by Time Warner, making the series one of only a handful of Marvel-related TV projects not owned by Disney. Time Warner is also the owner of Marvel's biggest competitor, DC Comics, as well as the owner of New Line Cinema, which produced a movie trilogy based on another Marvel superhero, Blade. Featured Crew Jack Kirby Creator Stan Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Ann Pflug Invisible Girl (voice) Jack DeLeon The Human Torch (voice) Gerald Mohr Mr. Fantastic (voice) Paul Frees The Thing (voice) Full Cast & Crew Last Season Season 1 1967 | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Fantastic Four. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Action & Adventure Keywords superhero based on comic fantastic four Content Score 93 Almost there... Top Contributors 22 Banana D 2 Daniel J 1 Joserudeboy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}