{"link": "https://www.themoviedb.org/tv/70901?language=en", "title": "Reverse", "resume": "Kazuhisa Fukase graduated from a prestigious university, but he leads a boring life. His only strength is making delicious coffee. Whenever he makes coffee, he is reminded of his friend Yoshiki Hirosawa. He was friends with Yoshiki Hirosawa back in their university days, but Yoshiki Hirosawa died on a snowboarding trip 10 years ago.\nOne day, he meets Mihoko Ochi at a coffee shop. He is strongly attracted to her.\nKazuhisa Fukase goes to a professor’s retirement celebration at a university. There, he meets Kosuke Asai who went snowboarding with Yoshiki Hirosawa on that fateful trip. Journalist Toshio Ogasawara also appears there. He has been investigating Yoshiki Hirosawa's death.", "rate": 0, "genre": ["Mystery"], "cast": ["Tatsuya Fujiwara", "Erika Toda", "Yuta Tamamori", "Teppei Koike", "Takahiro Miura"], "character": ["Kazuhisa Fukase", "Mihoko Ochi", "Kosuke Asai", "Yoshiki Hirosawa", "Takaaki Murai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70901   Expand Reverse   (2017) User Score Overview Kazuhisa Fukase graduated from a prestigious university, but he leads a boring life. His only strength is making delicious coffee. Whenever he makes coffee, he is reminded of his friend Yoshiki Hirosawa. He was friends with Yoshiki Hirosawa back in their university days, but Yoshiki Hirosawa died on a snowboarding trip 10 years ago. One day, he meets Mihoko Ochi at a coffee shop. He is strongly attracted to her. Kazuhisa Fukase goes to a professor’s retirement celebration at a university. There, he meets Kosuke Asai who went snowboarding with Yoshiki Hirosawa on that fateful trip. Journalist Toshio Ogasawara also appears there. He has been investigating Yoshiki Hirosawa's death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tatsuya Fujiwara Kazuhisa Fukase Erika Toda Mihoko Ochi Yuta Tamamori Kosuke Asai Teppei Koike Yoshiki Hirosawa Takahiro Miura Takaaki Murai Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Reverse premiered on April 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Reverse. You can help by rating TV shows you've seen. Facts Original Name  リバース Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.tbs.co.jp/reverse_tbs/ Genres Mystery Keywords japan Content Score 86 Almost there... Top Contributors M 35 Maria180493 k 8 keror0 4 Elizabeth Jennings c 3 cgbsmy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}