{"link": "https://www.themoviedb.org/tv/74906?language=en", "title": "History of the Eagles", "resume": "Alison Ellwood’s intimate, meticulously crafted patchwork of rare archival material, concert footage, and unseen home movies explores the evolution and enduring popularity of one of America’s truly defining bands.", "rate": 76, "genre": ["Documentary"], "cast": ["Don Henley", "Glenn Frey", "Timothy B. Schmit", "Joe Walsh", "David Geffen"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74906   Expand History of the Eagles   (2013) User Score Overview Alison Ellwood’s intimate, meticulously crafted patchwork of rare archival material, concert footage, and unseen home movies explores the evolution and enduring popularity of one of America’s truly defining bands. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Henley Himself Glenn Frey Himself Timothy B. Schmit Himself Joe Walsh Himself David Geffen Himself Full Cast & Crew Last Season Miniseries 2013 | 2 Episodes Season 1 of History of the Eagles premiered on February 15, 2013. View All Seasons Social Reviews  1 Discussions  0 A review by Grant English  7.0 Written by  Grant English  on November  4, 2014 At over 3 hours long (187 minutes), the film delivers the history of The Eagles primarily from the perspectives of the founding members and unquestionable leaders of the band – Don Henley and Glen Frey. Along the way, we get treated to both archival footage, concert footage, archival interviews as well as current interviews with former bandmates. We hear from jilted bandmates, abandoned producers and record labels. Linda Ronstadt, Jackson Brown, and Bob Seger all make appearances as well. What is great about the film are the ugly parts.  We get to see the egos clash, the drug use, the alc...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2015-04-05 Sinatra: All or Nothing at All 7.2    1983-05-01 V 7.3    2015-08-16 Show Me a Hero 7.2    2008-03-16 John Adams 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 120m Homepage   http://www.historyoftheeagles.com Genres Documentary Keywords music woman director Content Score 86 Almost there... Top Contributors TB 25 TMDb Bot 25 Banana S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}