{"link": "https://www.themoviedb.org/tv/1736?language=en", "title": "Complete Savages", "resume": "Complete Savages is an American sitcom that was broadcast on ABC from September 2004 to June 2005. It was part of ABC's final TGIF comedy line-up. The show was created by Mike Scully and Julie Thacker and executive produced by Mel Gibson. It was cancelled after its first season due to low ratings.", "rate": 54, "genre": ["Comedy"], "cast": ["Keith Carradine", "Erik von Detten", "Andrew Eiden", "Shaun Sipos", "Evan Ellingson"], "character": ["Nick Savage", "Chris Savage", "Sam Savage", "Jack Savage", "Kyle Savage"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1736   Expand Complete Savages   (2004) User Score Overview Complete Savages is an American sitcom that was broadcast on ABC from September 2004 to June 2005. It was part of ABC's final TGIF comedy line-up. The show was created by Mike Scully and Julie Thacker and executive produced by Mel Gibson. It was cancelled after its first season due to low ratings. Featured Crew Mike Scully Creator Julie Thacker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith Carradine Nick Savage Erik von Detten Chris Savage Andrew Eiden Sam Savage Shaun Sipos Jack Savage Evan Ellingson Kyle Savage Full Cast & Crew Last Season Season 1 2004 | 19 Episodes Season 1 of Complete Savages premiered on September 24, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Complete Savages. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  English Runtime  30m, 20m Homepage  - Genres Comedy Keywords sibling relationship teenager family single father sitcom Content Score 93 Almost there... Top Contributors 19 United600 19 Banana B 5 Boxi88 a 3 adltata  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}