{"link": "https://www.themoviedb.org/tv/4399?language=en", "title": "Dixon of Dock Green", "resume": "Created by Ted Willis. Dixon of Dock Green was a BBC television series following the activities of police officers at a fictional Metropolitan Police station in the East End of London from 1955 to 1976. Some episodes were later remade as a BBC radio series in 2005 and 2006.", "rate": 0, "genre": ["Drama"], "cast": ["Jack Warner", "Peter Byrne", "jeanette hutchinson", "Moira Mannion", "Arthur Rigby"], "character": ["PC George Dixon", "Andy Crawford", "Mary Crawford", "WP Sgt. Grace Millard", "Station Sgt. Flint"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4399   Expand Dixon of Dock Green   (1955) User Score Overview Created by Ted Willis. Dixon of Dock Green was a BBC television series following the activities of police officers at a fictional Metropolitan Police station in the East End of London from 1955 to 1976. Some episodes were later remade as a BBC radio series in 2005 and 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Warner PC George Dixon Peter Byrne Andy Crawford jeanette hutchinson Mary Crawford Moira Mannion WP Sgt. Grace Millard Arthur Rigby Station Sgt. Flint Full Cast & Crew Last Season Season 22 1976 | 8 Episodes Season 22 of Dixon of Dock Green premiered on March 13, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dixon of Dock Green. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 8 DanDare 4 Markxist 2 Zlogorek R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}