{"link": "https://www.themoviedb.org/tv/2765?language=en", "title": "The Good Life", "resume": "The Good Life is a British sitcom produced by the BBC that ran from 1975 to 1978. It was written by Bob Larbey and John Esmonde. In 2004, it came 9th in Britain's Best Sitcom. In the United States, it aired on various PBS stations under the title Good Neighbors.", "rate": 70, "genre": ["Comedy"], "cast": ["Richard Briers", "Penelope Keith", "Paul Eddington", "Reginald Marsh", "Felicity Kendal"], "character": ["Tom Good", "Margo Leadbetter", "Jerry Leadbetter", "Andrew / Sir", "Barbara Good"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2765   Expand The Good Life   (1975) User Score Overview The Good Life is a British sitcom produced by the BBC that ran from 1975 to 1978. It was written by Bob Larbey and John Esmonde. In 2004, it came 9th in Britain's Best Sitcom. In the United States, it aired on various PBS stations under the title Good Neighbors. Featured Crew Esmonde and Larbey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Briers Tom Good Penelope Keith Margo Leadbetter Paul Eddington Jerry Leadbetter Reginald Marsh Andrew / Sir Felicity Kendal Barbara Good Full Cast & Crew Last Season (uk) season 4 1977 | 8 Episodes Season 4 of The Good Life premiered on April 10, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1979-09-30 To the Manor Born 7.1    1984-01-29 Ever Decreasing Circles 6.5    1978-11-10 Butterflies 6.9    1965-07-22 Till Death Us Do Part 7.2    1976-02-20 Open All Hours 7.7    1974-09-02 Rising Damp 7.8    1991-01-03 The Brittas Empire 7.1    1962-01-04 Steptoe and Son 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords upper class sitcom self sufficient british humour Content Score 93 Almost there... Top Contributors M 10 MAthePA O 6 Ozbourne f 4 ftlocation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}