{"link": "https://www.themoviedb.org/tv/709?language=en", "title": "Robot Chicken", "resume": "Robot Chicken is an American stop-motion claymation comedy television series created and executive produced by Seth Green and Matthew Senreich along with co-head writers Douglas Goldstein and Tom Root. The writers, especially Green, also provide many of the voices. Senreich, Goldstein and Root were formerly writers for the popular action figure hobbyist magazine ToyFare, which has won an Annie Award and three Emmy Awards.", "rate": 72, "genre": ["Animation", "Comedy"], "cast": ["Seth Green", "Matthew Senreich", "Breckin Meyer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 709   Expand Robot Chicken   (2005) User Score  Play Trailer Overview Robot Chicken is an American stop-motion claymation comedy television series created and executive produced by Seth Green and Matthew Senreich along with co-head writers Douglas Goldstein and Tom Root. The writers, especially Green, also provide many of the voices. Senreich, Goldstein and Root were formerly writers for the popular action figure hobbyist magazine ToyFare, which has won an Annie Award and three Emmy Awards. Featured Crew Seth Green Creator Matthew Senreich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  12 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seth Green Matthew Senreich Breckin Meyer Full Cast & Crew Current Season Season 9 2017 | 17 Episodes Season 9 of Robot Chicken premiered on December 17, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply H Is S08E07 a special? Open 0 by Haravikk\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  3 Recommendations   2000-12-30 Aqua Teen Hunger Force 7.2    2009-09-27 The Cleveland Show 5.2    1997-01-12 King of the Hill 7.1    1991-08-11 The Ren & Stimpy Show 7.2    2000-12-30 Harvey Birdman, Attorney at Law 7.7    2006-08-06 Metalocalypse 6.9    2004-11-07 Squidbillies 6.2    1994-04-15 Space Ghost Coast to Coast 8.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  15m, 10m Homepage   http://www.adultswim.com/shows/robot-chicken/index.html Genres Animation Comedy Keywords parody sketch comedy adult animation Content Score 71 Just a little bit more... Top Contributors 33 Banana A 29 AnthonyAtkins232 SC 10 Stephen Cotton b 8 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}