{"link": "https://www.themoviedb.org/tv/62839?language=en", "title": "The Secret Life of Marilyn Monroe", "resume": "A chronicle of Marilyn Monroe's family life and how she succeeded in hiding her most intimate secrets.", "rate": 68, "genre": ["Drama"], "cast": ["Kelli Garner", "Susan Sarandon", "Emily Watson", "Jeffrey Dean Morgan", "Eva Amurri Martino"], "character": ["Marilyn Monroe", "Gladys Mortenson", "Grace McKee", "Joe DiMaggio", "Young Gladys"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62839   Expand The Secret Life of Marilyn Monroe   (2015) User Score  Play Trailer Overview A chronicle of Marilyn Monroe's family life and how she succeeded in hiding her most intimate secrets. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelli Garner Marilyn Monroe Susan Sarandon Gladys Mortenson Emily Watson Grace McKee Jeffrey Dean Morgan Joe DiMaggio Eva Amurri Martino Young Gladys Full Cast & Crew Last Season Season 1 2015 | 2 Episodes Season 1 of The Secret Life of Marilyn Monroe premiered on May 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   The Pumpkin Eater 8.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://www.mylifetime.com/movies/the-secret-life-of-marilyn-monroe Genres Drama Keywords celebrity marilyn monroe miniseries woman director famous mental disorders lifetime Content Score 93 Almost there... Top Contributors TB 34 TMDb Bot 18 Banana 9 Elizabeth Jennings RS 6 Ras Scrath Marley  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}