{"link": "https://www.themoviedb.org/tv/43230?language=en", "title": "Hime-chan's Ribbon", "resume": "Erika, the princess of the Magic Kingdom has come to Earth in  order to find a human girl who looks just like her. That girl turns out  to be Himeko Nonohara, a tomboy's tomboy. Erika must give Himeko a  magical item she has created in order to prove her worth as a successor  to the crown. Himeko must test this item, a hair ribbon that allows her  to transform into any other person she sees, to see if it is worthy. The  series follows Himeko's adventures and her budding romance with Daichi,  the boy who discovers her secret.", "rate": 0, "genre": ["Animation"], "cast": ["Akiko Yajima", "Chika Sakamoto", "Chisa Yokoyama", "Kazue Ikura", "Mika Doi"], "character": ["Masako", "Masshi", "Yumeko Nonohara", "Pokota", "Erika's Mother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43230   Expand Hime-chan's Ribbon   (1992) User Score Overview Erika, the princess of the Magic Kingdom has come to Earth in  order to find a human girl who looks just like her. That girl turns out  to be Himeko Nonohara, a tomboy's tomboy. Erika must give Himeko a  magical item she has created in order to prove her worth as a successor  to the crown. Himeko must test this item, a hair ribbon that allows her  to transform into any other person she sees, to see if it is worthy. The  series follows Himeko's adventures and her budding romance with Daichi,  the boy who discovers her secret. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiko Yajima Masako Chika Sakamoto Masshi Chisa Yokoyama Yumeko Nonohara Kazue Ikura Pokota Mika Doi Erika's Mother Full Cast & Crew Last Season Season 1 — | 61 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hime-chan's Ribbon. You can help by rating TV shows you've seen. Facts Original Name  姫ちゃんのリボン Status  Ended Networks - Certification  - Type  Scripted Original Language  Abkhazian Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 6 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}