{"link": "https://www.themoviedb.org/tv/65334?language=en", "title": "Miraculous: Tales of Ladybug & Cat Noir", "resume": "Normal high school kids by day, protectors of Paris by night! Miraculous follows the heroic adventures of Marinette and Adrien as they transform into Ladybug and Cat Noir and set out to capture akumas, creatures responsible for turning the people of Paris into villains. But neither hero knows the other’s true identity – or that they’re classmates!", "rate": 79, "genre": ["Action", "Adventure", "Animation", "Family", "Kids"], "cast": ["Anouck Hautbois", "Thierry Kazazian", "Benjamin Bollen", "Marie Nonnenmacher"], "character": ["Marinette Dupain-Cheng (voice)", "Plagg (voice)", "Adrien Agreste (voice)", "Tikki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65334   Expand Miraculous: Tales of Ladybug & Cat Noir   (2015) User Score  Play Trailer Overview Normal high school kids by day, protectors of Paris by night! Miraculous follows the heroic adventures of Marinette and Adrien as they transform into Ladybug and Cat Noir and set out to capture akumas, creatures responsible for turning the people of Paris into villains. But neither hero knows the other’s true identity – or that they’re classmates! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anouck Hautbois Marinette Dupain-Cheng (voice) Thierry Kazazian Plagg (voice) Benjamin Bollen Adrien Agreste (voice) Marie Nonnenmacher Tikki (voice) Full Cast & Crew Current Season Original Air Date Original Air Date EBS1 Order (Original Air Date) Netflix Order (Digital) Télé-Québec Order (TV) Season 2 2017 | 18 Episodes Season 2 of Miraculous: Tales of Ladybug & Cat Noir premiered on October 26, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Your favorite episodes? Open 0 by RainingBullets\n      \n     Tell me your side in the love square! Open 0 by RainingBullets\n      \n     Which language do you prefer? Open 0 by RainingBullets\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   2015-01-10 My Sunshine 7.4    2011-09-05 Zig and Sharko 5.3    2015-09-12 Goldie & Bear 5.4    2012-02-05 Glitter Force 6.3    2014-02-23 Griselda Blanco: The Black Widow 6.2    2013-03-25 Max Steel 4.8  Facts Original Name  Miraculous, les aventures de Ladybug et Chat Noir Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  French Runtime  22m Homepage   http://www.miraculousladybug.com/ Genres Action & Adventure Animation Family Kids Keywords france paris magic superhero romance interracial romance female protagonist magical girl teen superhero Content Score 93 Almost there... Top Contributors 95 Banana 77 RainingBullets D 20 DaRepairMan g 14 gxribeiro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}