{"link": "https://www.themoviedb.org/tv/31526?language=en", "title": "Ancient Discoveries", "resume": "Ancient Discoveries was a television series that premiered on December 21, 2003, on The History Channel. The program focused on ancient technologies. The show's theme was that many inventions which are thought to be modern have ancient roots or in some cases may have been lost and then reinvented. The program was a follow-up to a special originally broadcast in 2005 which focused on technologies from the Ancient Roman era such as the Antikythera mechanism and inventors such as Heron of Alexandria. Episodes of the regular series expanded to cover other areas such as Egypt, China and East Asia, and the Islamic world.\nAncient Discoveries was made for The History Channel by Wild Dream Films based in Cardiff in the UK. Much of the filming was done on location across the world. The series used contributions from archaeologists and other experts, footage of historical sites and artifacts, computer generated reconstructions and dramatized reconstructions along with experiments and tests on reconstructed artifacts.", "rate": 85, "genre": ["Documentary"], "cast": ["Sean Barrett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31526   Expand Ancient Discoveries   (2003) User Score Overview Ancient Discoveries was a television series that premiered on December 21, 2003, on The History Channel. The program focused on ancient technologies. The show's theme was that many inventions which are thought to be modern have ancient roots or in some cases may have been lost and then reinvented. The program was a follow-up to a special originally broadcast in 2005 which focused on technologies from the Ancient Roman era such as the Antikythera mechanism and inventors such as Heron of Alexandria. Episodes of the regular series expanded to cover other areas such as Egypt, China and East Asia, and the Islamic world. Ancient Discoveries was made for The History Channel by Wild Dream Films based in Cardiff in the UK. Much of the filming was done on location across the world. The series used contributions from archaeologists and other experts, footage of historical sites and artifacts, computer generated reconstructions and dramatized reconstructions along with experiments and tests on reconstructed artifacts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sean Barrett Full Cast & Crew Last Season Season 6 2009 | 14 Episodes Season 6 of Ancient Discoveries premiered on November  5, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  15 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ancient Discoveries. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.history.com/minisites/ancientdiscoveries/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 tyutyutyu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}