{"link": "https://www.themoviedb.org/tv/21313?language=en", "title": "Ankahi", "resume": "Ankahi was a popular Urdu drama serial broadcast by Pakistan Television Corporation in 1982. The drama was written by the legendary Haseena Moin and directed by the talented Shoaib Mansoor and Mohsin Ali.The drama serial featured a huge ensemble star cast including legends such as Shehnaz Sheikh, Shakeel, Javed Sheikh, Saleem Nasir, Jamshed Ansari, Behroze Sabzwari, Badar Khalil, Qazi Wajid, Azra Mansoor, Khalid Nizami, Arshad Mahmood, Tabasum Farooqui and Faisal Ansari. The drama has achieved cult status and is popular to this day. The DVD's of Ankahi are still in demand. An Indian film called Chal Mere Bhai was an unofficial remake of Ankahi.", "rate": 0, "genre": ["Comedy", "Drama", "Family"], "cast": ["Faisal Bilal", "Shakeel", "Badar Khalil", "Saleem Nasir", "Jamshed Ansari"], "character": ["Jibran", "Taimoor", "Sana's Aunt", "Sana's maamun (uncle)", "Timmy, Sana's neighbour"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21313   Expand Ankahi User Score Overview Ankahi was a popular Urdu drama serial broadcast by Pakistan Television Corporation in 1982. The drama was written by the legendary Haseena Moin and directed by the talented Shoaib Mansoor and Mohsin Ali.The drama serial featured a huge ensemble star cast including legends such as Shehnaz Sheikh, Shakeel, Javed Sheikh, Saleem Nasir, Jamshed Ansari, Behroze Sabzwari, Badar Khalil, Qazi Wajid, Azra Mansoor, Khalid Nizami, Arshad Mahmood, Tabasum Farooqui and Faisal Ansari. The drama has achieved cult status and is popular to this day. The DVD's of Ankahi are still in demand. An Indian film called Chal Mere Bhai was an unofficial remake of Ankahi. Featured Crew Hasina Moin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Faisal Bilal Jibran Shakeel Taimoor Badar Khalil Sana's Aunt Saleem Nasir Sana's maamun (uncle) Jamshed Ansari Timmy, Sana's neighbour Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  In Production Network Pakistan Television Network Certification  - Type  Scripted Original Language  Urdu Runtime  50m Homepage  - Genres Comedy Drama Family Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors i 45 imrann25 i 3 imran25  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}