{"link": "https://www.themoviedb.org/tv/2384?language=en", "title": "Knight Rider", "resume": "Michael Long, an undercover police officer, is shot while investigating a case and left for dead by his assailants. He is rescued by Wilton Knight, a wealthy, dying millionaire and inventor who arranges life-saving surgery, including a new face and a new identity--that of Michael Knight. Michael is then given a special computerized and indestructible car called the Knight Industries Two Thousand (nicknamed KITT), and a mission: apprehend criminals who are beyond the reach of the law. The series depicts Michael's exploits as he and KITT battle the forces of evil on behalf of the Foundation for Law and Government.", "rate": 67, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["David Hasselhoff", "Edward Mulhare", "William Daniels", "Patricia McPherson", "Rebecca Holden"], "character": ["Michael Knight", "Devon Miles", "K.I.T.T.", "Bonnie Barstow", "April Curtis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2384   Expand Knight Rider   (1982) User Score  Play Trailer Overview Michael Long, an undercover police officer, is shot while investigating a case and left for dead by his assailants. He is rescued by Wilton Knight, a wealthy, dying millionaire and inventor who arranges life-saving surgery, including a new face and a new identity--that of Michael Knight. Michael is then given a special computerized and indestructible car called the Knight Industries Two Thousand (nicknamed KITT), and a mission: apprehend criminals who are beyond the reach of the law. The series depicts Michael's exploits as he and KITT battle the forces of evil on behalf of the Foundation for Law and Government. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  8 Posters  13 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast David Hasselhoff Michael Knight Edward Mulhare Devon Miles William Daniels K.I.T.T. Patricia McPherson Bonnie Barstow Rebecca Holden April Curtis Full Cast & Crew Last Season Season 4 1985 | 22 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Michael: Happy Birthday David Hasselhoff! Open 0 by wonder2wonder\n      \n     the  cyclon sound Open 1 by  Moonglum9 Davis Hhasselhof Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  8 Posters  13 Recommendations   1983-01-23 The A-Team 6.9    1985-09-29 MacGyver 7.3    1986-09-22 ALF 6.9    1989-04-23 Baywatch 5.0    1980-12-11 Magnum, P.I. 7.1    1985-03-03 Moonlighting 7.2    1976-03-21 Charlie's Angels 5.9    1984-09-16 Miami Vice 7.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.nbc.com/classic-tv/knight-rider-classic Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords ex-cop vigilante car Content Score 100 Yes! Looking good! Top Contributors 65 TonAngel M 40 MAthePA 28 Elizabeth Jennings 26 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}