{"link": "https://www.themoviedb.org/tv/7198?language=en", "title": "The Night Shift", "resume": "Næturvaktin, (The Night Shift), revolves around the lives of three employees working at the Shell petrol station in Laugavegur, Reykjavík. The three man night shift is made up of eccentric supervisor Georg Bjarnfreðarson, a committed Marxist, vegan, who has an admiration for everything Swedish. Ólafur Ragnar, a regular employee and a simple, well-meaning guy who dreams of fame and wealth. And Daníel Sævarsson, who after dropping out of medical school joins the team.\nWhat the three men don't know is due to this job how profoundly their lives will be forever linked.", "rate": 0, "genre": ["Comedy"], "cast": ["Pétur Jóhann Sigfússon", "Jörundur Ragnarsson", "Jón Gnarr"], "character": ["Ólafur Ragnar Hannesson", "Daníel Sævarsson", "Georg Bjarnfreðarson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7198   Expand The Night Shift   (2007) User Score  Play Trailer Overview Næturvaktin, (The Night Shift), revolves around the lives of three employees working at the Shell petrol station in Laugavegur, Reykjavík. The three man night shift is made up of eccentric supervisor Georg Bjarnfreðarson, a committed Marxist, vegan, who has an admiration for everything Swedish. Ólafur Ragnar, a regular employee and a simple, well-meaning guy who dreams of fame and wealth. And Daníel Sævarsson, who after dropping out of medical school joins the team. What the three men don't know is due to this job how profoundly their lives will be forever linked. Featured Crew Ragnar Bragason Creator Jón Gnarr Creator Pétur Jóhann Sigfússon Creator Jörundur Ragnarsson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pétur Jóhann Sigfússon Ólafur Ragnar Hannesson Jörundur Ragnarsson Daníel Sævarsson Jón Gnarr Georg Bjarnfreðarson Full Cast & Crew Last Season Season 1 2007 | 12 Episodes Season 1 of The Night Shift premiered on September 16, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Night Shift. You can help by rating TV shows you've seen. Facts Original Name  Næturvaktin Status  Ended Network Certification  - Type  Scripted Original Language  Icelandic Runtime  25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors h 19 hollyt9 Z 6 ZaZam R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}