{"link": "https://www.themoviedb.org/tv/12442?language=en", "title": "The Mumbly Cartoon Show", "resume": "The Mumbly Cartoon Show was a Saturday morning cartoon produced by Hanna-Barbera Productions featuring the titular Mumbly, a cartoon dog. The show aired on ABC from 1976–1977.", "rate": 50, "genre": ["Animation"], "cast": ["John Stephenson", "Don Messick"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12442   Expand The Mumbly Cartoon Show   (1976) User Score Overview The Mumbly Cartoon Show was a Saturday morning cartoon produced by Hanna-Barbera Productions featuring the titular Mumbly, a cartoon dog. The show aired on ABC from 1976–1977. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Stephenson Don Messick Full Cast & Crew Last Season Mumbly season 1 1976 | 16 Episodes Season 1 of The Mumbly Cartoon Show premiered on June  1, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Mumbly Cartoon Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  English Runtime  7m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 12 Robson Guedes Vieira 2 Elizabeth Jennings 2 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}