{"link": "https://www.themoviedb.org/tv/4454?language=en", "title": "Will & Grace", "resume": "Will Truman and Grace Adler are best friends living in New York, and when Grace's engagement falls apart, she moves in with Will. Together, along with their friends, they go through the trials of dating, sex, relationships and their careers, butting heads at times but ultimately supporting one another while exchanging plenty of witty banter along the way.", "rate": 66, "genre": ["Comedy"], "cast": ["Eric McCormack", "Debra Messing", "Sean Hayes", "Megan Mullally"], "character": ["Will Truman", "Grace Adler", "Jack McFarland", "Karen Walker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4454   Expand Will & Grace   (1998) User Score  Play Trailer Overview Will Truman and Grace Adler are best friends living in New York, and when Grace's engagement falls apart, she moves in with Will. Together, along with their friends, they go through the trials of dating, sex, relationships and their careers, butting heads at times but ultimately supporting one another while exchanging plenty of witty banter along the way. Featured Crew Max Mutchnick Creator David Kohan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  15 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric McCormack Will Truman Debra Messing Grace Adler Sean Hayes Jack McFarland Megan Mullally Karen Walker Full Cast & Crew Last Season Season 8 2005 | 24 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply There are no discussions for Will & Grace. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  13 Recommendations   1997-09-24 Dharma & Greg 5.9    1992-09-23 Mad About You 6.0    1996-09-13 Everybody Loves Raymond 6.3    1993-09-16 Frasier 7.7    1996-09-17 Spin City 7.0    1997-03-04 Just Shoot Me! 6.4    1996-01-09 3rd Rock from the Sun 7.3    1997-09-08 Ally McBeal 5.9  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   https://nbc.com/will-and-grace-original Genres Comedy Keywords new york dating gay man lgbt sitcom Content Score 100 Yes! Looking good! Top Contributors 38 Banana 22 Elizabeth Jennings t 18 theusedversion c 11 courtneysmith86  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}