{"link": "https://www.themoviedb.org/tv/30920?language=en", "title": "Russell Howard's Good News", "resume": "Russell Howard offers his unique perspective on the big stories dominating all of our news outlets, from online and print to broadcast, as well as picking up on those sometimes overlooked things. He uses clips, sketches and studio guests to look at things that have made him smile during the week.", "rate": 82, "genre": ["Comedy", "News"], "cast": ["Russell Howard"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30920   Expand Russell Howard's Good News   (2009) User Score Overview Russell Howard offers his unique perspective on the big stories dominating all of our news outlets, from online and print to broadcast, as well as picking up on those sometimes overlooked things. He uses clips, sketches and studio guests to look at things that have made him smile during the week. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russell Howard Himself - Presenter Full Cast & Crew Last Season Season 10 2015 | 9 Episodes Season 10 of Russell Howard's Good News premiered on October 22, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Russell Howard's Good News. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   1994-07-04 Room 101 5.9    1979-03-24 Tales of the Unexpected 6.8    2005-06-05 Mock the Week 7.0  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00phwkz Genres Comedy News Keywords news british humour Content Score 56 We're so close, yet so far. Top Contributors 19 Elizabeth Jennings O 6 Ozbourne TB 1 TMDb Bot 1 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}