{"link": "https://www.themoviedb.org/tv/35016?language=en", "title": "House of Anubis", "resume": "House of Anubis is a jointly Nickelodeon British, American, and Belgian mystery television series based on the Dutch-Belgian television series Het Huis Anubis aired in the Netherlands and Belgium. The series was created by Hans Bourlon and Gert Verhulst and premiered on Nickelodeon on New Year's Day 2011 in the United States and on 25 February 2011 in the United Kingdom. The series is the first Nickelodeon series to be filmed overseas, the first soap opera created by Nickelodeon and the channel's first soap opera aimed at children and teenagers. As of 25 February, the program will be broadcast on TeenNick. The show has since concluded its third season and as of 28 September 2013 Nickelodeon has not announced a fourth season.", "rate": 90, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Brad Kavanagh", "Nathalia Ramos", "Alex Sawyer", "Klariza Clayton", "Eugene Simon"], "character": ["Fabian Rutter", "Nina Martin", "Alfie Lewis", "Joy Mercer", "Jerome Clark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35016   Expand House of Anubis   (2011) User Score  Play Trailer Overview House of Anubis is a jointly Nickelodeon British, American, and Belgian mystery television series based on the Dutch-Belgian television series Het Huis Anubis aired in the Netherlands and Belgium. The series was created by Hans Bourlon and Gert Verhulst and premiered on Nickelodeon on New Year's Day 2011 in the United States and on 25 February 2011 in the United Kingdom. The series is the first Nickelodeon series to be filmed overseas, the first soap opera created by Nickelodeon and the channel's first soap opera aimed at children and teenagers. As of 25 February, the program will be broadcast on TeenNick. The show has since concluded its third season and as of 28 September 2013 Nickelodeon has not announced a fourth season. Featured Crew Hans Bourlon Creator Gert Verhulst Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brad Kavanagh Fabian Rutter Nathalia Ramos Nina Martin Alex Sawyer Alfie Lewis Klariza Clayton Joy Mercer Eugene Simon Jerome Clark Full Cast & Crew Last Season Season 3 2013 | 41 Episodes Season 3 of House of Anubis premiered on January  3, 2013. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Fabian: Happy Birtday Brad Kavanagh! Open 0 by wonder2wonder\n      \n     w KT: Happy Birthday Alexandra Shipp! Open 0 by wonder2wonder\n      \n     w Nina: Happy Birthday Nathalia Ramos! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  1 Recommendations   2006-03-24 Hannah Montana 5.0    2010-03-27 Victorious 7.1    2010-08-17 Melissa & Joey 6.2    2004-01-11 Drake & Josh 7.1    2007-09-08 iCarly 6.3    2012-06-20 Baby Daddy 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.nick.com/shows/house-of-anubis Genres Mystery Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors w 4 webmaster k 4 kotsku s 3 speedycars 2 marxc88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}