{"link": "https://www.themoviedb.org/tv/16591?language=en", "title": "Galapagos", "resume": "The history of these beautiful Islands from their creation as uprising lava to their being studied by Darwin to their modern day inhabitants.", "rate": 65, "genre": ["Documentary"], "cast": ["Tilda Swinton"], "character": ["Herself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16591   Expand Galapagos   (2006) User Score  Play Trailer Overview The history of these beautiful Islands from their creation as uprising lava to their being studied by Darwin to their modern day inhabitants. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  21 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tilda Swinton Herself - Presenter Full Cast & Crew Last Season Miniseries 2006 | 3 Episodes Season 1 of Galapagos premiered on September 26, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  21 Posters  16 Recommendations   2008-05-11 Wild China 8.2  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b007y9vn Genres Documentary Keywords miniseries nature documentary galapagos Content Score 64 We're so close, yet so far. Top Contributors TB 38 TMDb Bot l 15 lining2808 13 Elizabeth Jennings m 12 migue_lillo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}