{"link": "https://www.themoviedb.org/tv/486?language=en", "title": "Captain Scarlet and the Mysterons", "resume": "Captain Scarlet and the Mysterons, often referred to as Captain Scarlet, is a 1960s British science-fiction television series produced by the Century 21 Productions company of Gerry and Sylvia Anderson, John Read and Reg Hill. First broadcast on ATV Midlands from September 1967 to May 1968, it has since been transmitted in more than 40 other countries, including the United States, Australia, New Zealand and Japan. Characters are presented as marionette puppets alongside scale model sets and special effects in a filming technique that the Andersons termed \"Supermarionation\". This technology incorporated solenoid motors as a means of synchronising the puppet's lip movements with pre-recorded dialogue.\nSet in 2068, Captain Scarlet presents the hostilities between Earth and a race of Martians known as the Mysterons. After human astronauts attack their city on Mars, the vengeful Mysterons declare war on Earth, initiating a series of reprisals that are countered by Spectrum, a worldwide security organisation. Spectrum boasts the extraordinary abilities of its primary agent, Captain Scarlet. During the events of the pilot episode, Scarlet acquires the Mysteron healing power of \"retro-metabolism\" and is thereafter considered to be virtually \"indestructible\", being able to recover fully from injuries that would normally be fatal.", "rate": 84, "genre": ["Action", "Adventure", "Animation"], "cast": ["Ed Bishop", "Donald Gray", "Francis Matthews", "Cy Grant", "Lois Maxwell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 486   Expand Captain Scarlet and the Mysterons   (1967) User Score Overview Captain Scarlet and the Mysterons, often referred to as Captain Scarlet, is a 1960s British science-fiction television series produced by the Century 21 Productions company of Gerry and Sylvia Anderson, John Read and Reg Hill. First broadcast on ATV Midlands from September 1967 to May 1968, it has since been transmitted in more than 40 other countries, including the United States, Australia, New Zealand and Japan. Characters are presented as marionette puppets alongside scale model sets and special effects in a filming technique that the Andersons termed \"Supermarionation\". This technology incorporated solenoid motors as a means of synchronising the puppet's lip movements with pre-recorded dialogue. Set in 2068, Captain Scarlet presents the hostilities between Earth and a race of Martians known as the Mysterons. After human astronauts attack their city on Mars, the vengeful Mysterons declare war on Earth, initiating a series of reprisals that are countered by Spectrum, a worldwide security organisation. Spectrum boasts the extraordinary abilities of its primary agent, Captain Scarlet. During the events of the pilot episode, Scarlet acquires the Mysteron healing power of \"retro-metabolism\" and is thereafter considered to be virtually \"indestructible\", being able to recover fully from injuries that would normally be fatal. Featured Crew Gerry Anderson Creator Sylvia Anderson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ed Bishop Donald Gray Francis Matthews Cy Grant Lois Maxwell Full Cast & Crew Last Season Season 1 1967 | 32 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations   1964-10-04 Stingray 6.5    1968-09-29 Joe 90 7.8    1965-09-30 Thunderbirds 8.1    1975-01-02 The Sweeney 6.4    1996-09-08 The Incredible Hulk 6.3    1967-09-09 Spider-Man 7.9    1968-09-14 Wacky Races 7.1    2008-02-07 Ashes to Ashes 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 7 Rebecca J 4 JeePeCe 1 gazzario1971  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}