{"link": "https://www.themoviedb.org/tv/1523?language=en", "title": "Chef!", "resume": "Chef! is a British situation comedy starring Lenny Henry that aired as twenty episodes over three series from 1993 to 1996 on the BBC. The show was created and primarily written by Peter Tilbury based on an idea from Lenny Henry and produced for the BBC by Henry's production company, Crucial Films.", "rate": 79, "genre": ["Comedy"], "cast": ["Lenny Henry", "Roger Griffiths", "Caroline Lee-Johnson", "Claire Skinner", "Gary Bakewell"], "character": ["Gareth Blackstock", "Everton Stonehead", "Janice Blackstock", "Lucinda", "Donald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1523   Expand Chef!   (1993) User Score Overview Chef! is a British situation comedy starring Lenny Henry that aired as twenty episodes over three series from 1993 to 1996 on the BBC. The show was created and primarily written by Peter Tilbury based on an idea from Lenny Henry and produced for the BBC by Henry's production company, Crucial Films. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lenny Henry Gareth Blackstock Roger Griffiths Everton Stonehead Caroline Lee-Johnson Janice Blackstock Claire Skinner Lucinda Gary Bakewell Donald Full Cast & Crew Last Season Season 3 1996 | 6 Episodes Season 3 of Chef! premiered on November 25, 1996. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Chef: Happy Birthday Lenny Henry! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2003-09-26 Joan of Arcadia 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/chef/ Genres Comedy Keywords cook workplace sitcom british humour workplace comedy Content Score 86 Almost there... Top Contributors w 14 wonder2wonder O 10 Ozbourne T 1 Torq00 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}