{"link": "https://www.themoviedb.org/tv/4238?language=en", "title": "The King of Queens", "resume": "Three's definitely a crowd for parcel post deliveryman Doug Heffernan (Kevin James), whose newly widowed father-in-law, Arthur (Jerry Stiller), has moved in with him and his wife, Carrie (Leah Remini). Doug's no longer the king of his domain -- the renovated basement that houses his beloved supersized TV set -- let alone the king of Queens, where he lives. Can they all just get along?", "rate": 67, "genre": ["Comedy"], "cast": ["Kevin James", "Leah Remini", "Victor Williams", "Jerry Stiller", "Patton Oswalt"], "character": ["Doug Heffernan", "Carrie Heffernan", "Deacon Palmer", "Arthur Spooner", "Spence Olchin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4238   Expand The King of Queens   (2001) User Score Overview Three's definitely a crowd for parcel post deliveryman Doug Heffernan (Kevin James), whose newly widowed father-in-law, Arthur (Jerry Stiller), has moved in with him and his wife, Carrie (Leah Remini). Doug's no longer the king of his domain -- the renovated basement that houses his beloved supersized TV set -- let alone the king of Queens, where he lives. Can they all just get along? Featured Crew Michael J. Weithorn Creator David Litt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  19 Images Backdrops  11 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin James Doug Heffernan Leah Remini Carrie Heffernan Victor Williams Deacon Palmer Jerry Stiller Arthur Spooner Patton Oswalt Spence Olchin Full Cast & Crew Last Season Season 9 2006 | 13 Episodes Season 9 of The King of Queens premiered on December  6, 2006. View All Seasons Social Reviews  0 Discussions  26 Subject Status Replies Last Reply w S8E14 \"Apartment Complex\" Open 0 by wonder2wonder\n      \n     w Doug and Carrie Open 3 by  gspgreases T Great Show Open 2 by  gspgreases Go to Discussions Media Most Popular Videos  0 Backdrops  11 Posters  11 Recommendations   1996-09-13 Everybody Loves Raymond 6.3    1996-01-09 3rd Rock from the Sun 7.3    1996-09-17 Spin City 7.0    1987-04-05 Married... with Children 7.4    1998-08-23 That '70s Show 7.4    1993-09-16 Frasier 7.7    2000-01-09 Malcolm in the Middle 7.5    2003-09-22 Two and a Half Men 6.2  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  21m, 22m Homepage   http://www.sonypictures.com/tv/shows/kingofqueens/ Genres Comedy Keywords new york marriage working class in-laws queens new york city sitcom living with parents Content Score 93 Almost there... Top Contributors c 208 courtneysmith86 82 d00ziie s 39 steelman1991 N 34 NeXrom  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}