{"link": "https://www.themoviedb.org/tv/7030?language=en", "title": "For You in Full Blossom", "resume": "Hanazakari no Kimitachi e: Ikemen Paradise, also known as Ike-para, is a Japanese drama produced by Fuji Television and first aired on July 3, 2007. It is based on the comic by Hisaya Nakajo, published in English as Hana-Kimi. Filming locations include the Ryutsu Keizai University.\nA TV Special has already aired with the regular cast reprising their roles. The story starts off half a year after Mizuki's secret of being a girl has revealed. It is near Valentine's Day, and Sano and Nakatsu are talking about the last week of Summer vacation. This is when the story gets back to the last week of Summer holidays, which is between episode 7 and 8. The shooting started on March 19, 2008. A conference was held on September 18, 2008 announcing the completion of the special, subtitled Sotsugyoshiki & 7 to 1/2 wa Special.\nA remake of this drama with an entirely different cast was aired on Fuji Television during the 2011 summer season.", "rate": 60, "genre": ["Drama", "Comedy"], "cast": ["Shun Oguri", "Maki Horikita", "Toma Ikuta", "Hiro Mizushima", "Mitsuomi Takahashi"], "character": ["Izumi Sano", "Mizuki Ashiya", "Shuichi Nakatsu", "Mitsuomi Daikokucho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7030   Expand For You in Full Blossom   (2007) User Score Overview Hanazakari no Kimitachi e: Ikemen Paradise, also known as Ike-para, is a Japanese drama produced by Fuji Television and first aired on July 3, 2007. It is based on the comic by Hisaya Nakajo, published in English as Hana-Kimi. Filming locations include the Ryutsu Keizai University. A TV Special has already aired with the regular cast reprising their roles. The story starts off half a year after Mizuki's secret of being a girl has revealed. It is near Valentine's Day, and Sano and Nakatsu are talking about the last week of Summer vacation. This is when the story gets back to the last week of Summer holidays, which is between episode 7 and 8. The shooting started on March 19, 2008. A conference was held on September 18, 2008 announcing the completion of the special, subtitled Sotsugyoshiki & 7 to 1/2 wa Special. A remake of this drama with an entirely different cast was aired on Fuji Television during the 2011 summer season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shun Oguri Izumi Sano Maki Horikita Mizuki Ashiya Toma Ikuta Shuichi Nakatsu Hiro Mizushima Mitsuomi Takahashi Mitsuomi Daikokucho Full Cast & Crew Last Season Season 1 2007 | 12 Episodes Season 1 of For You in Full Blossom premiered on July  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on For You in Full Blossom. You can help by rating TV shows you've seen. Facts Original Name  花ざかりの君たちへ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://wwwz.fujitv.co.jp/hanakimi Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 6 Aka75 s 4 sheva_vitali 2 handouyahia.zahra@hotmail.com R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}