{"link": "https://www.themoviedb.org/tv/22956?language=en", "title": "Spooks: Code 9", "resume": "Spooks: Code 9 is a counter-intelligence drama series broadcast on BBC Three in 2008.\nThe series was commissioned by BBC Fiction's controller Jane Tranter as a spin-off of their long-running drama Spooks, offering a \"more maverick, younger perspective\" that would attract a 16-24-year-old audience. The series follows a group of six new young MI5 recruits who \"follow a different rule book\". It was produced by the independent production company Kudos and was filmed in and around Leeds and Bradford. The first two episodes were broadcast on BBC Three on 10 August 2008 and repeated on the same channel on 11 August 2008.\nThe decision to relate the new project to the original Spooks was controversial, with actor Georgia Moffett saying “it’s slightly misleading in terms of the word Spooks.” and producer Chris Fry saying \"this is a completely new show. There are no crossover characters or storylines and, most importantly, it is set in a completely new world.\" After the relatively unsuccessful first series, executive producer Karen Wilson claimed that many of the existing cast members were \"contracted for another year\" and outlined themes \"we'd like to explore if we get a second series.\"", "rate": 45, "genre": ["Drama"], "cast": ["Georgia Moffett", "Joanne Froggatt", "Andrew Knott", "Ruta Gedmintas", "Heshima Thompson"], "character": ["Kylie", "Rob", "Jeremy 'Jez' Cook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22956   Expand Spooks: Code 9   (2008) User Score Overview Spooks: Code 9 is a counter-intelligence drama series broadcast on BBC Three in 2008. The series was commissioned by BBC Fiction's controller Jane Tranter as a spin-off of their long-running drama Spooks, offering a \"more maverick, younger perspective\" that would attract a 16-24-year-old audience. The series follows a group of six new young MI5 recruits who \"follow a different rule book\". It was produced by the independent production company Kudos and was filmed in and around Leeds and Bradford. The first two episodes were broadcast on BBC Three on 10 August 2008 and repeated on the same channel on 11 August 2008. The decision to relate the new project to the original Spooks was controversial, with actor Georgia Moffett saying “it’s slightly misleading in terms of the word Spooks.” and producer Chris Fry saying \"this is a completely new show. There are no crossover characters or storylines and, most importantly, it is set in a completely new world.\" After the relatively unsuccessful first series, executive producer Karen Wilson claimed that many of the existing cast members were \"contracted for another year\" and outlined themes \"we'd like to explore if we get a second series.\" Featured Crew David Wolstencroft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Georgia Moffett Kylie Joanne Froggatt Andrew Knott Rob Ruta Gedmintas Heshima Thompson Jeremy 'Jez' Cook Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of Spooks: Code 9 premiered on August 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2002-05-13 Spooks 7.5    1997-10-06 Earth: Final Conflict 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage   http://www.bbc.co.uk/programmes/b00d33bt Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 rudely_murray 4 Elizabeth Jennings w 3 webmaster t 1 thierryj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}