{"link": "https://www.themoviedb.org/tv/40996?language=en", "title": "Medicopter 117 – Jedes Leben zählt", "resume": "Medicopter 117 – Jedes Leben zählt is a German television series.", "rate": 0, "genre": ["Drama"], "cast": ["Serge Falck", "Hanno Pöschl", "Urs Remond", "Gilbert von Sohlern", "Roswitha Meyer"], "character": ["Sanitäter Peter Berger", "Mechaniker Max", "Dr. Mark Harland", "Stützpunktleiter Gunnar E. Höppler", "Dr. Karin Thaler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40996   Expand Medicopter 117 – Jedes Leben zählt   (1998) User Score Overview Medicopter 117 – Jedes Leben zählt is a German television series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Serge Falck Sanitäter Peter Berger Hanno Pöschl Mechaniker Max Urs Remond Dr. Mark Harland Gilbert von Sohlern Stützpunktleiter Gunnar E. Höppler Roswitha Meyer Dr. Karin Thaler Full Cast & Crew Last Season Season 7 2006 | 8 Episodes Season 7 of Medicopter 117 – Jedes Leben zählt premiered on July  6, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Medicopter 117 – Jedes Leben zählt. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification N-7 Meaning Intended for viewers from 7 years old. Type  Scripted Original Language  German Runtime  42m Homepage  - Genres Drama Keywords helicopter pilot rescue team Content Score 86 Almost there... Top Contributors S 62 Samara 7 51 7Bee-NL 8 normanfeltz 4 tigriso1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}