{"link": "https://www.themoviedb.org/tv/63549?language=en", "title": "Love for Rent", "resume": "A waitress named Defne Topal (Elçin Sangu) finds herself in a love game when she needs money to pay off her brother's debt. Defne looks after her grandmother, her young sister and her older brother, because her mother and father left her and her siblings. One day, a man named Ömer İplikçi (Barış Arduç) kisses her abruptly because he wants to save himself from a blind date which his aunt arranged for him. Unbeknownst to Defne and Ömer, Ömer's aunt Neriman (Nergis Kumbasar) saw the kiss. After that, Neriman comes with an offer to Defne to marry and then leave the man she rented her for. Neriman is ready to give 400.000 liras, but Defne only takes the money she needed (200.000 liras) and accepts the offer to save her brother from the people he is indebted to. She starts as an assistant near Ömer İplikçi, unaware of the fact that he is the man who kissed her until she sees him on her first work day.She has 6 months to marry and then leave him. Ömer İplikçi has a work obsession and is generally hard-to-please. But when Defne becomes his assistant, his life changes forever.", "rate": 45, "genre": ["Comedy"], "cast": ["Elçin Sangu", "Barış Arduç", "Salih Bademci", "Müjde Uzman", "Seçkin Özdemir"], "character": ["Defne Topal", "Ömer İplikçi", "Sinan Karakaya", "Seda Berensel", "Pamir Marden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63549   Expand Love for Rent   (2015) User Score  Play Trailer Overview A waitress named Defne Topal (Elçin Sangu) finds herself in a love game when she needs money to pay off her brother's debt. Defne looks after her grandmother, her young sister and her older brother, because her mother and father left her and her siblings. One day, a man named Ömer İplikçi (Barış Arduç) kisses her abruptly because he wants to save himself from a blind date which his aunt arranged for him. Unbeknownst to Defne and Ömer, Ömer's aunt Neriman (Nergis Kumbasar) saw the kiss. After that, Neriman comes with an offer to Defne to marry and then leave the man she rented her for. Neriman is ready to give 400.000 liras, but Defne only takes the money she needed (200.000 liras) and accepts the offer to save her brother from the people he is indebted to. She starts as an assistant near Ömer İplikçi, unaware of the fact that he is the man who kissed her until she sees him on her first work day.She has 6 months to marry and then leave him. Ömer İplikçi has a work obsession and is generally hard-to-please. But when Defne becomes his assistant, his life changes forever. Featured Crew Metin Balekoğlu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  28 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elçin Sangu Defne Topal Barış Arduç Ömer İplikçi Salih Bademci Sinan Karakaya Müjde Uzman Seda Berensel Seçkin Özdemir Pamir Marden Full Cast & Crew Last Season Season 2 2016 | 17 Episodes Season 2 of Love for Rent premiered on September 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  28 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love for Rent. You can help by rating TV shows you've seen. Facts Original Name  Kiralik Ask Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   http://www.startv.com.tr/dizi/kiralik-ask Genres Comedy Keywords love Content Score 100 Yes! Looking good! Top Contributors V 86 Vaine 42 purplelammashta 38 furkanpolat 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}