{"link": "https://www.themoviedb.org/tv/3792?language=en", "title": "Strike It Lucky", "resume": "Strike it Lucky was a popular British television game show from 29 October 1986 to 23 August 1999, originally produced by Thames Television for ITV, and presented by the British comedian Michael Barrymore. It was based on the American show of the same name that aired in 1986.\nIn its formative years, it became well known for the outlandish and often highly eccentric contestants it featured - Barrymore would often spend over 5 minutes talking to them. The introductory footage of the prizes on offer were also noteworthy, often filmed in black-and-white with a slapstick style. In 1987, it was the fifth most watched programme on UK television. The Thames Television version of the show was recorded at Teddington Studios, and later Pinewood Studios.\nFrom 1996, the new version aired under the title Strike it Rich!; this being the title of the short-lived American game show Strike it Rich! on which it was based, and it moved to The London Studios. The reason for the name change was that the show was now being co-produced by LWT with Fremantle, so despite now being owned by the same company as Fremantle, Thames were unwilling to allow LWT use of the original title. There is also the factor that when the show was first exported to the UK, the Independent Broadcasting Authority's prize limits were still in place, and \"Rich\" was probably dropped from the title because of the relatively low value of prizes on offer; by the time it returned as Strike it Rich! the limits had been lifted and it was giving away a substantially higher value of prizes.", "rate": 0, "genre": [], "cast": ["Michael Barrymore"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3792   Expand Strike It Lucky   (1986) User Score Overview Strike it Lucky was a popular British television game show from 29 October 1986 to 23 August 1999, originally produced by Thames Television for ITV, and presented by the British comedian Michael Barrymore. It was based on the American show of the same name that aired in 1986. In its formative years, it became well known for the outlandish and often highly eccentric contestants it featured - Barrymore would often spend over 5 minutes talking to them. The introductory footage of the prizes on offer were also noteworthy, often filmed in black-and-white with a slapstick style. In 1987, it was the fifth most watched programme on UK television. The Thames Television version of the show was recorded at Teddington Studios, and later Pinewood Studios. From 1996, the new version aired under the title Strike it Rich!; this being the title of the short-lived American game show Strike it Rich! on which it was based, and it moved to The London Studios. The reason for the name change was that the show was now being co-produced by LWT with Fremantle, so despite now being owned by the same company as Fremantle, Thames were unwilling to allow LWT use of the original title. There is also the factor that when the show was first exported to the UK, the Independent Broadcasting Authority's prize limits were still in place, and \"Rich\" was probably dropped from the title because of the relatively low value of prizes on offer; by the time it returned as Strike it Rich! the limits had been lifted and it was giving away a substantially higher value of prizes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Barrymore Full Cast & Crew Last Season (uk) season 14 1999 | 12 Episodes Season 14 of Strike It Lucky premiered on June  7, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Strike It Lucky. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}