{"link": "https://www.themoviedb.org/tv/40396?language=en", "title": "The Straits", "resume": "Set among the turquoise waters and lethal wildlife of Australia’s Far  North Queensland and the Torres Strait, The Straits is an exotic, darkly  humorous crime drama.\nThe Montebellos are not your average Australian family. Modern day  smugglers, their family business is transporting drugs into Australia  and guns and exotic wildlife out, making use of ties of blood and  loyalty in the Torres Strait Islands.", "rate": 75, "genre": ["Drama"], "cast": ["Brian Cox", "Rena Owen", "Aaron Fa'aoso", "Jimi Bani", "Firass Dirani"], "character": ["Harry Montebello", "Kitty Montebello", "Noel Montebello", "Marou Montebello", "Gary Montebello"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40396   Expand The Straits   (2012) User Score  Play Trailer Overview Set among the turquoise waters and lethal wildlife of Australia’s Far  North Queensland and the Torres Strait, The Straits is an exotic, darkly  humorous crime drama. The Montebellos are not your average Australian family. Modern day  smugglers, their family business is transporting drugs into Australia  and guns and exotic wildlife out, making use of ties of blood and  loyalty in the Torres Strait Islands. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Cox Harry Montebello Rena Owen Kitty Montebello Aaron Fa'aoso Noel Montebello Jimi Bani Marou Montebello Firass Dirani Gary Montebello Full Cast & Crew Last Season Series 1 2012 | 10 Episodes Season 1 of The Straits premiered on February  2, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Straits. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  55m Homepage   http://www.abc.net.au/tv/thestraits/ Genres Drama Keywords exotic island smuggling drug smuggling gun smuggling Content Score 93 Almost there... Top Contributors 38 United600 s 3 speedycars TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}