{"link": "https://www.themoviedb.org/tv/40143?language=en", "title": "Shaman King", "resume": "Asakura Yoh is a shaman, a person who communicates with ghosts. He enters the Shaman Fight, for whoever wins the tournament gets to commune with the Great Spirit, God . . . that and his fiance Anna wants to be the wife of the Shaman King. Helping him are his friends Manta, Horo Horo, Ryu, and his samurai ghost partner, Amidamaru.\nOnce every 500 years, there's an event called the Shaman Fight, and whoever wins becomes the Shaman King and can use the most powerful spirits ever. Asakura Yoh comes to Tokyo to train and become the Shaman King. Accompanied by many friends, he defeats many enemies along and the way, and gets more friends.\nYoh is a young shaman, one who can see and communicate with spirits. Shaman's also have another power,the ability to unify with spirits and use the spirit's fighting skills. Yoh is training to become the Shaman King, strongest among all Shamans, a title won by winning the Grand Tournament that takes place every 500 years. Helping him are his best friend Morty, a short kid who can also see ghosts, Amidamaru, an old samurai and his spirit partner, and his fiance Ana, a spirit meduim and his trainer. However, another Shaman family is trying to keep Yoh out of the tournament. Along the way he meets a bunch of other misfit ghosts and wannabe Shamans.", "rate": 57, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40143   Expand Shaman King   (2001) User Score Overview Asakura Yoh is a shaman, a person who communicates with ghosts. He enters the Shaman Fight, for whoever wins the tournament gets to commune with the Great Spirit, God . . . that and his fiance Anna wants to be the wife of the Shaman King. Helping him are his friends Manta, Horo Horo, Ryu, and his samurai ghost partner, Amidamaru. Once every 500 years, there's an event called the Shaman Fight, and whoever wins becomes the Shaman King and can use the most powerful spirits ever. Asakura Yoh comes to Tokyo to train and become the Shaman King. Accompanied by many friends, he defeats many enemies along and the way, and gets more friends. Yoh is a young shaman, one who can see and communicate with spirits. Shaman's also have another power,the ability to unify with spirits and use the spirit's fighting skills. Yoh is training to become the Shaman King, strongest among all Shamans, a title won by winning the Grand Tournament that takes place every 500 years. Helping him are his best friend Morty, a short kid who can also see ghosts, Amidamaru, an old samurai and his spirit partner, and his fiance Ana, a spirit meduim and his trainer. However, another Shaman family is trying to keep Yoh out of the tournament. Along the way he meets a bunch of other misfit ghosts and wannabe Shamans. Featured Crew Seiji Mizushima Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2001 | 64 Episodes Season 1 of Shaman King premiered on July  4, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2002-04-04 .hack 6.0    2013-10-05 Log Horizon 7.8    2008-01-08 Spice and Wolf 7.3    2014-07-11 Terror in Resonance 6.7    2014-10-07 Yona of the Dawn 7.5    1995-10-27 Golden Boy 7.3    1996-01-10 Rurouni Kenshin 7.6    1999-03-07 Digimon 6.8  Facts Original Name  シャーマンキング Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors z 10 zurman1 V 7 Vergil365 7 Jaime Neto a 4 agustin270188  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}