{"link": "https://www.themoviedb.org/tv/74559?language=en", "title": "Robinson Island", "resume": "The biggest TV adventure begins! Eighteen brave Czechs fight for two and a half million Czech crowns on the deserted island and the title of the first Czech Robinson. Their hunger, exhaustion, mutual rivalry and cruel nature are in their way.", "rate": 0, "genre": ["Reality"], "cast": ["Ondřej Novotný"], "character": ["moderátor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74559   Expand Robinson Island   (2017) User Score Overview The biggest TV adventure begins! Eighteen brave Czechs fight for two and a half million Czech crowns on the deserted island and the title of the first Czech Robinson. Their hunger, exhaustion, mutual rivalry and cruel nature are in their way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ondřej Novotný moderátor Full Cast & Crew Current Season Season 2 2018 | 32 Episodes Season 2 of Robinson Island premiered on February  5, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Robinson Island. You can help by rating TV shows you've seen. Facts Original Name  Robinsonův ostrov Status  In Production Network Certification  - Type  Reality Original Language  Czech Runtime  - Homepage   http://robinson.nova.cz/ Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 27 gulon I 12 IjaCZECH 5 6 5lucina5 4 ohynek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}