{"link": "https://www.themoviedb.org/tv/60750?language=en", "title": "The Widower", "resume": "Over a thirteen year period, a seemingly mild‐mannered male nurse, Malcolm Webster, set about poisoning and murdering his first wife, attempting to do the same to his second wife and moving on to a further scheme to deceive his third fiancée.", "rate": 68, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Kate Fleetwood", "Federay Holmes", "James Laurenson", "Reece Shearsmith", "Sheridan Smith"], "character": ["Felicity Webster", "Jane Drumm", "Brian Drumm", "Malcolm Webster"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60750   Expand The Widower   (2014) User Score Overview Over a thirteen year period, a seemingly mild‐mannered male nurse, Malcolm Webster, set about poisoning and murdering his first wife, attempting to do the same to his second wife and moving on to a further scheme to deceive his third fiancée. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Fleetwood Felicity Webster Federay Holmes Jane Drumm James Laurenson Brian Drumm Reece Shearsmith Malcolm Webster Sheridan Smith Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of The Widower premiered on March 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2007-04-08 Inspector George Gently 8.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  21m Homepage  - Genres Crime Drama Mystery Keywords murderer widower Content Score 86 Almost there... Top Contributors 37 Elizabeth Jennings TB 16 TMDb Bot 5 Steve 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}