{"link": "https://www.themoviedb.org/tv/64174?language=en", "title": "Love Me If You Dare", "resume": "Getting inside the head of a violent criminal is not easy. But Simon Bo, a brilliant criminal psychologist, has the ability to get into the minds of even the most mysterious and violent criminals. He’s a professor at The University of Maryland and works as an analyst and advisor on the police department’s most violent or difficult cases. With the help of his young assistant, Jenny Jian, Simon delves into the thoughts and intentions of the criminal mind. As the daughter of a veteran police investigator with a deep sense of justice, can Jenny help Simon open up emotionally as they work together to solve crimes?", "rate": 76, "genre": ["Mystery"], "cast": ["Wallace Huo", "Ma Sichun", "Zhang Luyi", "Nick Wang"], "character": ["Simon", "Jenny", "Xie Han", "Li Xunran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64174   Expand Love Me If You Dare   (2015) User Score Overview Getting inside the head of a violent criminal is not easy. But Simon Bo, a brilliant criminal psychologist, has the ability to get into the minds of even the most mysterious and violent criminals. He’s a professor at The University of Maryland and works as an analyst and advisor on the police department’s most violent or difficult cases. With the help of his young assistant, Jenny Jian, Simon delves into the thoughts and intentions of the criminal mind. As the daughter of a veteran police investigator with a deep sense of justice, can Jenny help Simon open up emotionally as they work together to solve crimes? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wallace Huo Simon Ma Sichun Jenny Zhang Luyi Xie Han Nick Wang Li Xunran Full Cast & Crew Last Season Season 1 2015 | 24 Episodes Season 1 of Love Me If You Dare premiered on October 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Love Me If You Dare. You can help by rating TV shows you've seen. Facts Original Name  Love Me, If You Dare Status  Ended Networks Sohu Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Mystery Keywords shanghai love triangle detective police detective Content Score 86 Almost there... Top Contributors M 41 Maria180493 17 Wendy z 10 zurman1 t 7 terencedang  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}