{"link": "https://www.themoviedb.org/tv/32573?language=en", "title": "Strike Back", "resume": "The series follows John Porter, a former British Special Forces soldier, who is drafted back into service by Section 20, a fictional branch of the Secret Intelligence Service.", "rate": 74, "genre": ["Action", "Adventure", "Drama"], "cast": ["Daniel MacPherson", "Alin Sumarwata", "Roxanne McKee", "Warren Brown"], "character": ["Sergeant Samuel Wyatt", "Lance Corporal Gracie Novin", "Captain Natalie Reynolds", "Sergeant Daniel “Mac” Macallister"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32573   Expand Strike Back   (2010) User Score  Play Trailer Overview The series follows John Porter, a former British Special Forces soldier, who is drafted back into service by Section 20, a fictional branch of the Secret Intelligence Service. Featured Crew Chris Ryan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  11 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel MacPherson Sergeant Samuel Wyatt Alin Sumarwata Lance Corporal Gracie Novin Roxanne McKee Captain Natalie Reynolds Warren Brown Sergeant Daniel “Mac” Macallister Full Cast & Crew Current Season Retribution 2017 | 10 Episodes Season 6 of Strike Back premiered on October 31, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Damien Scott Open 2 by  OddRob Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  13 Recommendations   2013-01-11 Banshee 7.9    2013-04-12 Da Vinci's Demons 7.2    2010-06-24 Rookie Blue 7.0    2011-06-19 Falling Skies 6.4    2010-03-16 Justified 7.9    2017-10-01 The Last Post 6.7    2007-06-28 Burn Notice 7.3    2017-09-25 The Brave 6.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   https://www.sky.com/watch/channel/sky-one/strike-back Genres Action Adventure Drama Keywords air force soldier special forces special air service Content Score 100 Yes! Looking good! Top Contributors 184 Travis Bell 31 Elizabeth Jennings AK 24 Avshalom Kor J 18 JesusISyourLIFE  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}