{"link": "https://www.themoviedb.org/tv/43717?language=en", "title": "Cracked", "resume": "The Psych Crimes Unit, a unique team of police detectives and mental health professionals, is tasked with solving bizarre and chilling crimes that cross the boundary between law enforcement and psychological disturbance.", "rate": 63, "genre": ["Crime", "Drama"], "cast": ["David Sutcliffe", "Luisa D'Oliveira", "Dayo Ade", "Karen LeBlanc", "Brooke Nevin"], "character": ["Detective Aidan Black", "Detective Poppy Wisnefski", "Leo Beckett", "Inspector Diane Caligra", "Dr. Clara Malone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43717   Expand Cracked   (2013) User Score  Play Trailer Overview The Psych Crimes Unit, a unique team of police detectives and mental health professionals, is tasked with solving bizarre and chilling crimes that cross the boundary between law enforcement and psychological disturbance. Featured Crew Tracey Forbes Creator Calum de Hartog Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Sutcliffe Detective Aidan Black Luisa D'Oliveira Detective Poppy Wisnefski Dayo Ade Leo Beckett Karen LeBlanc Inspector Diane Caligra Brooke Nevin Dr. Clara Malone Full Cast & Crew Last Season Season 2 2013 | 8 Episodes Season 2 of Cracked premiered on September 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2011-06-05 Case Histories 8.2    2011-06-29 Necessary Roughness 6.6    2011-04-01 CHAOS 6.7    2010-01-06 Republic of Doyle 7.3    2010-08-15 Vexed 7.2    2012-01-12 The Finder 7.6    2007-02-18 Inspector Lewis 7.6  Facts Status  Ended Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbc.ca/cracked/ Genres Crime Drama Keywords canada toronto psychiatrist police detective mental disorders mental health professional Content Score 100 Yes! Looking good! Top Contributors 43 Banana 7 Zlogorek TS 7 Tony S. 5 NEOhidra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}