{"link": "https://www.themoviedb.org/tv/1634?language=en", "title": "Kappa Mikey", "resume": "Kappa Mikey is an American animated sitcom created by Larry Schwarz, who chose 4Kids Entertainment as the worldwide licensing, marketing and official promotional agent of the series. The show is Nicktoons's first original half-hour series, bought during the same period as other Animation Collective series such as Three Delivery and Speed Racer: The Next Generation, as well as Flash shows from other studios, such as Edgar & Ellen and The Secret Show, though the latter was made from BBC. The series premiered on January 6, 2006, as Nickelodeon aired several reruns and premieres as a promotional movement from August 20, 2006 to January 2007. The series is MTV's first global acquisition, and is currently available on iTunes.\nKappa Mikey was marketed as \"the first anime to be produced entirely in the United States\", according to press releases from MTV, Nicktoons Network, and various other sources, as the term anime in English is generally reserved for animation originally produced for the Japanese market. It uses Japanese animation and culture as inspiration for its concept, rather than being \"true\" anime. As a matter of fact, the series is a homage/parody of Japanese anime. On February 16, 2008, during their \"Music Week\", Nicktoons Network aired their first and only original television movie, an hour-long Kappa Mikey musical entitled \"Kappa Karaoke\". Officially, the episode's title is \"The Karaoke Episode\".", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy", "Action", "Adventure"], "cast": ["Carrie Keranen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1634   Expand Kappa Mikey   (2006) User Score Overview Kappa Mikey is an American animated sitcom created by Larry Schwarz, who chose 4Kids Entertainment as the worldwide licensing, marketing and official promotional agent of the series. The show is Nicktoons's first original half-hour series, bought during the same period as other Animation Collective series such as Three Delivery and Speed Racer: The Next Generation, as well as Flash shows from other studios, such as Edgar & Ellen and The Secret Show, though the latter was made from BBC. The series premiered on January 6, 2006, as Nickelodeon aired several reruns and premieres as a promotional movement from August 20, 2006 to January 2007. The series is MTV's first global acquisition, and is currently available on iTunes. Kappa Mikey was marketed as \"the first anime to be produced entirely in the United States\", according to press releases from MTV, Nicktoons Network, and various other sources, as the term anime in English is generally reserved for animation originally produced for the Japanese market. It uses Japanese animation and culture as inspiration for its concept, rather than being \"true\" anime. As a matter of fact, the series is a homage/parody of Japanese anime. On February 16, 2008, during their \"Music Week\", Nicktoons Network aired their first and only original television movie, an hour-long Kappa Mikey musical entitled \"Kappa Karaoke\". Officially, the episode's title is \"The Karaoke Episode\". Featured Crew Larry Schwarz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carrie Keranen Full Cast & Crew Last Season Season 2 2007 | 27 Episodes Season 2 of Kappa Mikey premiered on June  9, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2000-10-25 As Told by Ginger 5.4    2003-08-01 My Life as a Teenage Robot 6.1    2005-07-08 Camp Lazlo 5.6    2007-11-16 Chowder 6.5    2011-05-03 The Amazing World of Gumball 7.7    2007-10-12 Wizards of Waverly Place 6.6    1997-09-13 Recess 6.8    2012-01-31 Key & Peele 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.kappamikey.com/ Genres Sci-Fi & Fantasy Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors s 3 sheva_vitali R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}