{"link": "https://www.themoviedb.org/tv/46824?language=en", "title": "Luna, el misterio de Calenda", "resume": "The judge named Sara has moved to Calenda, along with her teenage daughter, Leire. Her plan to rebuild the family life has been spoiled when her husband disappears. This will be the first of a series of shocking events that will convince the judge that Calenda is not the peaceful place as it seemed to be.", "rate": 0, "genre": ["Action", "Adventure", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Belén Rueda", "Daniel Grao", "Álvaro Cervantes", "Fran Perea", "Marc Martínez"], "character": ["Sara Cruz", "Raúl Pando", "Joel Bernal", "Nacho Castro", "Fernando Bernal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46824   Expand Luna, el misterio de Calenda   (2012) User Score Overview The judge named Sara has moved to Calenda, along with her teenage daughter, Leire. Her plan to rebuild the family life has been spoiled when her husband disappears. This will be the first of a series of shocking events that will convince the judge that Calenda is not the peaceful place as it seemed to be. Featured Crew Daniel Écija Creator Laura Belloso Creator David Bermejo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Belén Rueda Sara Cruz Daniel Grao Raúl Pando Álvaro Cervantes Joel Bernal Fran Perea Nacho Castro Marc Martínez Fernando Bernal Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of Luna, el misterio de Calenda premiered on April 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Luna, el misterio de Calenda. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.antena3.com/series/luna-calenda/ Genres Action & Adventure Drama Mystery Sci-Fi & Fantasy Keywords werewolf Content Score 93 Almost there... Top Contributors 30 prm96 17 Bealua z 8 zurman1 D 4 DracoAn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}