{"link": "https://www.themoviedb.org/tv/1337?language=en", "title": "FX: The Series", "resume": "F/X: The Series is a television series based on the film F/X, starring Cameron Daddo, Christina Cox, Kevin Dobson, Jacqueline Torres, Carrie-Anne Moss and Jason Blicker. It ran for 40 episodes from 1996 through 1998.\nMuch or all of the show was filmed in Toronto, Ontario, Canada. The opening sequence ended with a television crew in the foreground loading trucks, and an enormous advertisement for The Phantom of the Opera, of which a theatrical production was showing in Toronto at the time.", "rate": 60, "genre": ["Drama"], "cast": ["Kevin Dobson", "Cameron Daddo", "Carrie-Anne Moss", "Christina Cox", "Richard Waugh"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1337   Expand FX: The Series   (1996) User Score Overview F/X: The Series is a television series based on the film F/X, starring Cameron Daddo, Christina Cox, Kevin Dobson, Jacqueline Torres, Carrie-Anne Moss and Jason Blicker. It ran for 40 episodes from 1996 through 1998. Much or all of the show was filmed in Toronto, Ontario, Canada. The opening sequence ended with a television crew in the foreground loading trucks, and an enormous advertisement for The Phantom of the Opera, of which a theatrical production was showing in Toronto at the time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Dobson Cameron Daddo Carrie-Anne Moss Christina Cox Richard Waugh Full Cast & Crew Last Season Season 2 1997 | 18 Episodes Season 2 of FX: The Series premiered on September 18, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for FX: The Series. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1999-01-05 Total Recall 2070 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors w 12 wlf M 5 Michal.f 4 Antalysfr d 4 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}