{"link": "https://www.themoviedb.org/tv/9027?language=en", "title": "Rebelde Way", "resume": "Rebelde Way is a Martín Fierro Award—nominated Argentine soap opera created and produced by Cris Morena. It originally aired from 26 May 2002 to 18 December 2003. The series was broadcast in many countries worldwide, including Peru, Germany, Israel, Spain and Uruguay, achieving widespread success. In addition, numerous remakes of Rebelde Way have been made, most notably Rebelde by Mexican Televisa. In 2009, Jennifer Lopez bought the rights for an U.S. adaptation.\nRebelde Way is set in the Elite Way School, a prestigious private boarding high school near Buenos Aires. The students of the school are the members of Argentine wealthiest families, as well as gifted students with scholarships. The series follows the lives of Elite Way students, their parents and their professors, and it also features the regular use of English language and phrases by the upper class. Its central characters are Marizza Pía Spirito, Mía Colucci, Pablo Bustamante and Manuel Aguirre, portrayed by, respectively, Camila Bordonaba, Luisana Lopilato, Benjamín Rojas and Felipe Colombo. The four form a band named Erreway, in order to pursue their dreams. The band enjoyed a great success throughout Latin America, Europe and Israel, selling over 3 million records and achieving several Platinum records. Along with spawning a series of merchandising, Cris Morena Group also released a spin–off movie Erreway: 4 Caminos in 2004.", "rate": 58, "genre": [], "cast": ["Luisana Lopilato", "Felipe Colombo", "Camila Bordonaba", "Benjamín Rojas"], "character": ["Mía Colucci", "Manuel Aguirre", "Marizza Spirito", "Pablo Bustamante"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9027   Expand Rebelde Way User Score Overview Rebelde Way is a Martín Fierro Award—nominated Argentine soap opera created and produced by Cris Morena. It originally aired from 26 May 2002 to 18 December 2003. The series was broadcast in many countries worldwide, including Peru, Germany, Israel, Spain and Uruguay, achieving widespread success. In addition, numerous remakes of Rebelde Way have been made, most notably Rebelde by Mexican Televisa. In 2009, Jennifer Lopez bought the rights for an U.S. adaptation. Rebelde Way is set in the Elite Way School, a prestigious private boarding high school near Buenos Aires. The students of the school are the members of Argentine wealthiest families, as well as gifted students with scholarships. The series follows the lives of Elite Way students, their parents and their professors, and it also features the regular use of English language and phrases by the upper class. Its central characters are Marizza Pía Spirito, Mía Colucci, Pablo Bustamante and Manuel Aguirre, portrayed by, respectively, Camila Bordonaba, Luisana Lopilato, Benjamín Rojas and Felipe Colombo. The four form a band named Erreway, in order to pursue their dreams. The band enjoyed a great success throughout Latin America, Europe and Israel, selling over 3 million records and achieving several Platinum records. Along with spawning a series of merchandising, Cris Morena Group also released a spin–off movie Erreway: 4 Caminos in 2004. Featured Crew Cris Morena Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luisana Lopilato Mía Colucci Felipe Colombo Manuel Aguirre Camila Bordonaba Marizza Spirito Benjamín Rojas Pablo Bustamante Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.rebeldeway.com Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors l 9 lucybenson B 1 Billys,Lo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}