{"link": "https://www.themoviedb.org/tv/787?language=en", "title": "Wycliffe", "resume": "Wycliffe is a British television series, based on W. J. Burley's novels about Detective Superintendent Charles Wycliffe. It was produced by HTV and broadcast on the ITV Network, following a pilot episode on 7 August 1993, between 24 July 1994 and 5 July 1998. The series was filmed in Cornwall, with a production office in Truro. Music for the series was composed by Nigel Hess and was awarded the Royal Television Society award for the best television theme. Wycliffe is played by Jack Shepherd, assisted by DI Doug Kersey and DI Lucy Lane.\nEach episode deals with a murder investigation. In the early series, the stories are adapted from Burley's books and are in classic whodunit style, often with quirky characters and plot elements. In later seasons, the tone becomes more naturalistic and there is more emphasis on internal politics within the police.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Jack Shepherd", "Jimmy Yuill", "Helen Masters", "Aaron Harris", "Lynn Farleigh"], "character": ["Detective Superintendent Wycliffe", "DI Kersey", "DI Lane", "DS Dixon", "Helen Wycliffe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 787   Expand Wycliffe   (1994) User Score Overview Wycliffe is a British television series, based on W. J. Burley's novels about Detective Superintendent Charles Wycliffe. It was produced by HTV and broadcast on the ITV Network, following a pilot episode on 7 August 1993, between 24 July 1994 and 5 July 1998. The series was filmed in Cornwall, with a production office in Truro. Music for the series was composed by Nigel Hess and was awarded the Royal Television Society award for the best television theme. Wycliffe is played by Jack Shepherd, assisted by DI Doug Kersey and DI Lucy Lane. Each episode deals with a murder investigation. In the early series, the stories are adapted from Burley's books and are in classic whodunit style, often with quirky characters and plot elements. In later seasons, the tone becomes more naturalistic and there is more emphasis on internal politics within the police. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Shepherd Detective Superintendent Wycliffe Jimmy Yuill DI Kersey Helen Masters DI Lane Aaron Harris DS Dixon Lynn Farleigh Helen Wycliffe Full Cast & Crew Last Season Season 5 1998 | 6 Episodes Season 5 of Wycliffe premiered on May 17, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Wycliffe. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords england police detective murder investigation Content Score 86 Almost there... Top Contributors 15 Banana m 7 michael47 h 3 herlock60 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}