{"link": "https://www.themoviedb.org/tv/27117?language=en", "title": "Ninja Scroll: The Series", "resume": "Fourteen years after defeating the immortal warrior Himuro Genma and thwarting the Shogun of the Dark's evil plans, Kibagami Jubei continues to roam all over Japan as a masterless swordsman. During his journey, he meets Shigure, a priestess who has never seen the world outside her village. But when a group of demons destroys the village and kills everyone, Jubei becomes a prime target after acquiring the Dragon Jewel — a stone with an unknown origin. Meanwhile, Shigure — along with the monk Dakuan and a young thief named Tsubute — travels to the village of Yagyu. And with two demon clans now hunting down Shigure, Dakuan must once again acquire the services of Jubei to protect the Priestess of Light.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Animation"], "cast": ["Yuzuru Fujimoto", "Rikiya Koyama", "Hideyuki Tanaka", "Houko Kuwashima", "Romi Park"], "character": ["Dakuan (voice)", "Kibagami Jubei (voice)", "Mufu (voice)", "Shigure (voice)", "Tsubute (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27117   Expand Ninja Scroll: The Series   (2003) User Score Overview Fourteen years after defeating the immortal warrior Himuro Genma and thwarting the Shogun of the Dark's evil plans, Kibagami Jubei continues to roam all over Japan as a masterless swordsman. During his journey, he meets Shigure, a priestess who has never seen the world outside her village. But when a group of demons destroys the village and kills everyone, Jubei becomes a prime target after acquiring the Dragon Jewel — a stone with an unknown origin. Meanwhile, Shigure — along with the monk Dakuan and a young thief named Tsubute — travels to the village of Yagyu. And with two demon clans now hunting down Shigure, Dakuan must once again acquire the services of Jubei to protect the Priestess of Light. Featured Crew Tatsuo Satō Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuzuru Fujimoto Dakuan (voice) Rikiya Koyama Kibagami Jubei (voice) Hideyuki Tanaka Mufu (voice) Houko Kuwashima Shigure (voice) Romi Park Tsubute (voice) Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Ninja Scroll: The Series premiered on April 14, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Ninja Scroll: The Series. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ninja Scroll: The Series. You can help by rating TV shows you've seen. Facts Original Name  Ninja Scroll Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 47 Banana 25 yukoff 4 Sergiojamon m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}