{"link": "https://www.themoviedb.org/tv/3590?language=en", "title": "Intrepid Journeys", "resume": "Intrepid Journeys is a New Zealand television series, which screens on TV ONE. Making its debut in 2003, the show focuses on New Zealand \"celebrities\" who travel over to exotic countries to see the country's history, culture and people. It is a multi-award-winning travel series. It is not a “Survivor” style manufactured “challenge” show. It is about meeting real challenges in the real world, travelling to lesser-known places and then getting around the way locals do… by foot, bus and camel.\nAside from being physically challenging, Intrepid Journeys also acts as a conduit to other cultures and countries that may otherwise only be seen on the news when all hell is breaking loose. This series is a chance to get past stereotypes, myths and bad press, to get out into the real world and experience life challenging and changing travel.\nAcross each hour-long episode, Intrepid Journeys follows a celebrity traveller for two weeks in a rough and ready destination. The appeal of the show is two-fold. Aside from seeing a personality rise to a real challenge, there is also the chance to gather real working knowledge and understanding of places, lives, events and happenings foreign to Western culture.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3590   Expand Intrepid Journeys User Score Overview Intrepid Journeys is a New Zealand television series, which screens on TV ONE. Making its debut in 2003, the show focuses on New Zealand \"celebrities\" who travel over to exotic countries to see the country's history, culture and people. It is a multi-award-winning travel series. It is not a “Survivor” style manufactured “challenge” show. It is about meeting real challenges in the real world, travelling to lesser-known places and then getting around the way locals do… by foot, bus and camel. Aside from being physically challenging, Intrepid Journeys also acts as a conduit to other cultures and countries that may otherwise only be seen on the news when all hell is breaking loose. This series is a chance to get past stereotypes, myths and bad press, to get out into the real world and experience life challenging and changing travel. Across each hour-long episode, Intrepid Journeys follows a celebrity traveller for two weeks in a rough and ready destination. The appeal of the show is two-fold. Aside from seeing a personality rise to a real challenge, there is also the chance to gather real working knowledge and understanding of places, lives, events and happenings foreign to Western culture. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 8 2012 | 6 Episodes Season 8 of Intrepid Journeys premiered on May 22, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.tvnz.co.nz/view/tvone_minisite_index_skin/tvone_intrepid_journeys_group/ Genres Documentary Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}