{"link": "https://www.themoviedb.org/tv/46095?language=en", "title": "Uta no Prince-sama", "resume": "With dreams of becoming a composer and someday writing a song for her favorite idol, Haruka enters the Saotome Academy, a prestigious performing arts school. If successful there, she’ll be able to join the Shining Agency after graduation. However, it won’t be so easy when Haruka is already surrounded by potential idols and composers. On top of that, her homeroom teacher is a current idol, the headmaster was a record-breaking singer, and the academy itself is a chaotic place where anything can happen. Which prince of song will be paired up with Haruka?! Uta no Prince Sama is an exciting, coming-of-age romantic comedy that will be like sweet music to your eyes and ears!", "rate": 75, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46095   Expand Uta no Prince-sama   (2011) User Score Overview With dreams of becoming a composer and someday writing a song for her favorite idol, Haruka enters the Saotome Academy, a prestigious performing arts school. If successful there, she’ll be able to join the Shining Agency after graduation. However, it won’t be so easy when Haruka is already surrounded by potential idols and composers. On top of that, her homeroom teacher is a current idol, the headmaster was a record-breaking singer, and the academy itself is a chaotic place where anything can happen. Which prince of song will be paired up with Haruka?! Uta no Prince Sama is an exciting, coming-of-age romantic comedy that will be like sweet music to your eyes and ears! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Uta no☆Prince-sama♪ Maji Love Legend Star 2016 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Uta no Prince-sama. You can help by rating TV shows you've seen. Facts Original Name  うたの☆プリンスさまっ♪ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.utapri.com/ Genres Animation Comedy Keywords romance based on video game shojo reverse harem Content Score 56 We're so close, yet so far. Top Contributors 37 sp1ti 24 Caty Blackcat 8 seboseboss 7 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}