{"link": "https://www.themoviedb.org/tv/30781?language=en", "title": "My Alibi", "resume": "My Alibi is a web television series produced by Take180. The series, consisting of 19 episodes of 180 seconds or under was one of the first series produced by the site, and one of the most well received. The show, like many on the site, took fan submissions and integrated them into each episode.\nThe show was picked up for distribution on Abcfamily.com in February 2009.\nThe series premiered on August 18, 2008, on Take180.com and YouTube, and concluded on February 20, 2009 with each episode averaging around 25,000 views on Take180.com.", "rate": 0, "genre": ["Comedy"], "cast": ["Alison Brie", "Adam Chambers", "Cyrina Fiallo", "Julianna Guill", "Zachary Abel"], "character": ["Rebecca Fuller", "Cy Woods", "Marley Carabell", "Scarlet Hauksson", "Jonah Madigan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30781   Expand My Alibi   (2008) User Score Overview My Alibi is a web television series produced by Take180. The series, consisting of 19 episodes of 180 seconds or under was one of the first series produced by the site, and one of the most well received. The show, like many on the site, took fan submissions and integrated them into each episode. The show was picked up for distribution on Abcfamily.com in February 2009. The series premiered on August 18, 2008, on Take180.com and YouTube, and concluded on February 20, 2009 with each episode averaging around 25,000 views on Take180.com. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alison Brie Rebecca Fuller Adam Chambers Cy Woods Cyrina Fiallo Marley Carabell Julianna Guill Scarlet Hauksson Zachary Abel Jonah Madigan Full Cast & Crew Last Season Season 1 2008 | 19 Episodes Season 1 of My Alibi premiered on August 15, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Alibi. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  3m Homepage   http://www.take180.com/show/My_Alibi/2ci Genres Comedy Keywords high school teen comedy Content Score 71 Just a little bit more... Top Contributors 19 Banana 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}