{"link": "https://www.themoviedb.org/tv/67116?language=en", "title": "Lethal Weapon", "resume": "A slightly unhinged former Navy SEAL lands a job as a police officer in Los Angeles where he's partnered with a veteran detective trying to keep maintain a low stress level in his life.", "rate": 73, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Clayne Crawford", "Damon Wayans", "Jordana Brewster", "Kevin Rahm", "Keesha Sharp"], "character": ["Martin Riggs", "Roger Murtaugh", "Maureen Cahill", "Brooks Avery", "Trish Murtaugh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67116   Expand Lethal Weapon   (2016) User Score  Play Trailer Overview A slightly unhinged former Navy SEAL lands a job as a police officer in Los Angeles where he's partnered with a veteran detective trying to keep maintain a low stress level in his life. Featured Crew Matthew Miller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  0 Images Backdrops  7 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clayne Crawford Martin Riggs Damon Wayans Roger Murtaugh Jordana Brewster Maureen Cahill Kevin Rahm Brooks Avery Keesha Sharp Trish Murtaugh Full Cast & Crew Last Season Season 2 2017 | 22 Episodes View All Seasons Social Reviews  0 Discussions  17 Subject Status Replies Last Reply Just read that the main guy got fired and is being replaced next season with stifler lol Open 1 by  mechajutaro b Finale Open 17 by  LonelyChuck w Family drama Open 1 by  bgirlmagic Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  14 Recommendations   2016-09-23 MacGyver 5.5    2016-09-21 Designated Survivor 7.3    2016-09-20 Bull 6.6    2016-01-25 Lucifer 7.3    2014-09-22 Scorpion 6.7    2016-10-03 Timeless 7.0    2015-09-21 Blindspot 6.3    2016-09-23 Van Helsing 5.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/lethal-weapon Genres Action & Adventure Crime Drama Keywords police detective based on movie buddy cop lapd police procedural Content Score 100 Yes! Looking good! Top Contributors 40 Elizabeth Jennings 27 niqo19 26 Imzadi 24 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}