{"link": "https://www.themoviedb.org/tv/72737?language=en", "title": "18if", "resume": "Haruto Tsukishiro wakes up in a dream world dominated by strange and powerful entities called Witches. To survive, he gets the assistance of research professor Katsumi Kanzaki and a mysterious white-haired girl called Lily. With their help, Haruto must outsmart the witches and find a way to return to the real world.", "rate": 63, "genre": ["Action", "Adventure", "Animation", "Mystery", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72737   Expand 18if   (2017) User Score Overview Haruto Tsukishiro wakes up in a dream world dominated by strange and powerful entities called Witches. To survive, he gets the assistance of research professor Katsumi Kanzaki and a mysterious white-haired girl called Lily. With their help, Haruto must outsmart the witches and find a way to return to the real world. Featured Crew Kouji Morimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of 18if premiered on July  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2016-07-02 First Love Monster 5.7    2017-01-04 Akiba's Trip The Animation 8.8    2015-07-09 Himouto! Umaru-chan 8.6    2017-07-09 A Centaur's Life 8.7    2017-07-04 AHO-GIRL 9.0    2017-07-04 Tsuredure Children 8.0    2016-07-08 Handa-kun 6.7    2017-01-06 Fuuka 7.3  Facts Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://18if.jp Genres Action & Adventure Animation Mystery Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 10 Jenazad 7 Elizabeth Jennings 5 sp1ti 4 Altangerel67  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}