{"link": "https://www.themoviedb.org/tv/75592?language=en", "title": "Keeping  Faith", "resume": "Faith, a small-town Welsh lawyer, is forced to cut short her extended maternity leave when her husband and business partner, Evan, goes missing. As the truth of his actions surface, Faith must fight to protect her family and her sanity.", "rate": 70, "genre": ["Drama", "Mystery"], "cast": ["Eve Myles", "Bradley Freegard", "Mark Lewis Jones", "Hannah Daniel", "Aneirin Hughes"], "character": ["Faith Howells", "Evan Howells", "Steve Baldini", "Cerys Jones", "Tom Howells"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75592   Expand Keeping  Faith   (2017) User Score  Play Trailer Overview Faith, a small-town Welsh lawyer, is forced to cut short her extended maternity leave when her husband and business partner, Evan, goes missing. As the truth of his actions surface, Faith must fight to protect her family and her sanity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eve Myles Faith Howells Bradley Freegard Evan Howells Mark Lewis Jones Steve Baldini Hannah Daniel Cerys Jones Aneirin Hughes Tom Howells Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of Keeping  Faith premiered on November  5, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Solid Open 0 by Steve\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Keeping  Faith. You can help by rating TV shows you've seen. Facts Original Name  Un Bore Mercher Status  Returning Series Network Certification  - Type  Scripted Original Language  Welsh Runtime  50m Homepage   http://www.s4c.cymru/en/drama/un-bore-mercher/ Genres Drama Mystery Keywords lawyer missing person Content Score 93 Almost there... Top Contributors 29 tatergator 20 Elizabeth Jennings s 4 silid 4 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}