{"link": "https://www.themoviedb.org/tv/17836?language=en", "title": "David Copperfield", "resume": "Charles Dickens' haunting semi-autobiographical tale of a boy who is sent away by his stepfather after his mother dies but manages to triumph over incredible adversities.", "rate": 73, "genre": ["Drama"], "cast": ["Michael Elphick", "Zoë Wanamaker", "Ian McKellen", "Bob Hoskins", "Imelda Staunton"], "character": ["Barkis", "Miss Murdstone", "Creakle", "Micawber", "Mrs. Micawber"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17836   Expand David Copperfield   (1999) User Score Overview Charles Dickens' haunting semi-autobiographical tale of a boy who is sent away by his stepfather after his mother dies but manages to triumph over incredible adversities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Elphick Barkis Zoë Wanamaker Miss Murdstone Ian McKellen Creakle Bob Hoskins Micawber Imelda Staunton Mrs. Micawber Full Cast & Crew Last Season Miniseries 1999 | 2 Episodes Season 1 of David Copperfield premiered on December 25, 1999. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for David Copperfield. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2006-09-24 Jane Eyre 7.5    1995-04-21 Father Ted 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/programmes/p00t3hy7 Genres Drama Keywords based on novel or book miniseries period drama charles dickens Content Score 86 Almost there... Top Contributors TB 39 TMDb Bot R 23 Rebecca O 1 Ozbourne 1 Markxist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}