{"link": "https://www.themoviedb.org/tv/61418?language=en", "title": "Jane the Virgin", "resume": "A comedy-drama following a chaste young woman who is accidentally impregnated via artificial insemination as she struggles to inform her devoutly religious family and make the right choices concerning the child. Based on the telenovela \"Juana la virgen.\"", "rate": 65, "genre": ["Comedy", "Drama"], "cast": ["Gina Rodriguez", "Andrea Navedo", "Yael Grobglas", "Justin Baldoni", "Ivonne Coll"], "character": ["Jane Gloriana Villanueva", "Xiomara Gloriana Villanueva", "Petra / Anezka", "Rafael Solano", "Alba Gloriana Villanueva"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61418   Expand Jane the Virgin   (2014) User Score  Play Trailer Overview A comedy-drama following a chaste young woman who is accidentally impregnated via artificial insemination as she struggles to inform her devoutly religious family and make the right choices concerning the child. Based on the telenovela \"Juana la virgen.\" Featured Crew Jennie Snyder Urman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  12 Images Backdrops  8 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gina Rodriguez Jane Gloriana Villanueva Andrea Navedo Xiomara Gloriana Villanueva Yael Grobglas Petra / Anezka Justin Baldoni Rafael Solano Ivonne Coll Alba Gloriana Villanueva Full Cast & Crew Current Season Season 4 2017 | 17 Episodes View All Seasons Social Reviews  0 Discussions  28 Subject Status Replies Last Reply I am floored...Jane the SURPRISE Open 5 by  canima7 w Xo: Happy Birthday Andrea Navedo! Open 0 by wonder2wonder\n      \n     w Jane: Happy Birthday Gina Rodriguez! Open 1 by  Satch_the_man Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  8 Recommendations   2015-10-06 Chewing Gum 7.0    2016-09-19 The Good Place 7.8    2011-06-06 Switched at Birth 6.1    2012-09-25 The Mindy Project 5.6    2014-12-02 Girlfriends' Guide to Divorce 5.1    2015-08-20 Documentary Now! 7.5    2014-09-30 Selfie 6.4    2016-09-21 Speechless 7.5  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  40m Homepage   http://www.cwtv.com/shows/jane-the-virgin Genres Comedy Drama Keywords virgin miami love triangle latinx lead romance pregnancy artificial insemination telenovela suspicious death Content Score 100 Yes! Looking good! Top Contributors 199 janar 111 Banana 47 Elizabeth Jennings 15 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}