{"link": "https://www.themoviedb.org/tv/11080?language=en", "title": "Capital City", "resume": "Capital City was a television show produced by Euston Films which focused on the lives of investment bankers in London living and working on the corporate trading floor for the fictional international bank Shane-Longman.\nDespite its short run in the UK, it was rebroadcast on UKTV Gold as well as a handful of PBS stations in the United States and starred a number of now well known faces.\nThe music for the series was composed by the Colin Towns and enjoyed some success in its own right.", "rate": 100, "genre": ["Drama"], "cast": ["Jason Isaacs", "Douglas Hodge", "Trevyn McDowell", "Rolf Saxon", "John Bowe"], "character": ["Chas Ewell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11080   Expand Capital City   (1989) User Score Overview Capital City was a television show produced by Euston Films which focused on the lives of investment bankers in London living and working on the corporate trading floor for the fictional international bank Shane-Longman. Despite its short run in the UK, it was rebroadcast on UKTV Gold as well as a handful of PBS stations in the United States and starred a number of now well known faces. The music for the series was composed by the Colin Towns and enjoyed some success in its own right. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Isaacs Chas Ewell Douglas Hodge Trevyn McDowell Rolf Saxon John Bowe Full Cast & Crew Last Season Season 2 1990 | 10 Episodes Season 2 of Capital City premiered on October 18, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Capital City. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 kcdh 1 Markxist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}