{"link": "https://www.themoviedb.org/tv/70494?language=en", "title": "Mosaic Japan", "resume": "After being retrenched from his job at a Tokyo securities firm, Tsunezue Riichi decides to return to his hometown to work. He soon lands a job at the company GALAXYZ, a job that his parents highly recommended. GALAXYZ is a newly set up company, with young entrepreneur Kui Yoshiaki at its helm. Unbeknownst to Riichi, the company actually handles AV (Adult Videos i.e. Porn) projects. Even the OL's at the company's premises are actually all aspiring AV actresses. Throughout the entire company, everything is AV-centric, with even filming taking place within the office! Amidst all these, Riichi finds himself fascinated by a sweet charming girl, Momoko, another OL/AV-wannabe...", "rate": 100, "genre": ["Drama"], "cast": ["Kento Nagayama", "Issey Takahashi", "Mao Miyaji", "Momoko Kuroki", "Sakurako Kaoru"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70494   Expand Mosaic Japan   (2014) User Score Overview After being retrenched from his job at a Tokyo securities firm, Tsunezue Riichi decides to return to his hometown to work. He soon lands a job at the company GALAXYZ, a job that his parents highly recommended. GALAXYZ is a newly set up company, with young entrepreneur Kui Yoshiaki at its helm. Unbeknownst to Riichi, the company actually handles AV (Adult Videos i.e. Porn) projects. Even the OL's at the company's premises are actually all aspiring AV actresses. Throughout the entire company, everything is AV-centric, with even filming taking place within the office! Amidst all these, Riichi finds himself fascinated by a sweet charming girl, Momoko, another OL/AV-wannabe... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kento Nagayama Issey Takahashi Mao Miyaji Momoko Kuroki Sakurako Kaoru Full Cast & Crew Last Season Season 1 2014 | 5 Episodes Season 1 of Mosaic Japan premiered on May 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mosaic Japan. You can help by rating TV shows you've seen. Facts Original Name  モザイクジャパン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Drama Keywords adult Content Score 86 Almost there... Top Contributors c 29 ctchim g 3 g6man 3 無情天  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}