{"link": "https://www.themoviedb.org/tv/31700?language=en", "title": "Jyu-Oh-Sei", "resume": "Jyu-Oh-Sei is a Japanese manga series written and illustrated by Natsumi Itsuki. An 11-episode anime adaptation was animated by Bones and premiered April 13, 2006 in Japan as part of Fuji TV's Noitamina programming block.\nOn May 2, 2009, the series made its North American television debut on the FUNimation Channel.", "rate": 100, "genre": ["Animation", "Action", "Adventure"], "cast": ["Shun Oguri", "Kazuya Nakai", "Koichi Domoto", "Minami Takayama", "Romi Park"], "character": ["Third", "Zagi", "Thor", "Rai", "Karim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31700   Expand Jyu-Oh-Sei   (2006) User Score Overview Jyu-Oh-Sei is a Japanese manga series written and illustrated by Natsumi Itsuki. An 11-episode anime adaptation was animated by Bones and premiered April 13, 2006 in Japan as part of Fuji TV's Noitamina programming block. On May 2, 2009, the series made its North American television debut on the FUNimation Channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shun Oguri Third Kazuya Nakai Zagi Koichi Domoto Thor Minami Takayama Rai Romi Park Karim Full Cast & Crew Last Season Jyu oh sei season 1 2006 | 11 Episodes Season 1 of Jyu-Oh-Sei premiered on April 13, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jyu-Oh-Sei. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}