{"link": "https://www.themoviedb.org/tv/51633?language=en", "title": "The Negotiator", "resume": "In a modern society in which violent crimes are on the rise, there is a team that tries to resolve cases without bloodshed. It is the metropolitan police's special team, known by the abbreviation SIT (Special Investigation Team). \nThe SIT doesn't get into action after a case but heads to the site just as a crime is being committed. They are on the front-line of risky missions, facing off against criminals; tenaciously conducting negotiations with criminals. As a result of the rigid police hierarchy that can curb the conduct of negotiators, the SIT is also a male-dominated society controlled with strict discipline. There is one female negotiator, Usagi Reiko, who bravely fights at the frontline. She is isolated in the male world of the SIT but courageously fights against crime as well as her organisation.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Ryoko Yonekura", "Toshio Kakei", "Sousuke Takaoka", "Takashi Sasano", "Kosuke Suzuki"], "character": ["Reiko Usaki", "Seiichiro Kizaki", "Yusuke Amari", "Kohei Sumida", "Kunio Hasebe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51633   Expand The Negotiator   (2008) User Score Overview In a modern society in which violent crimes are on the rise, there is a team that tries to resolve cases without bloodshed. It is the metropolitan police's special team, known by the abbreviation SIT (Special Investigation Team).  The SIT doesn't get into action after a case but heads to the site just as a crime is being committed. They are on the front-line of risky missions, facing off against criminals; tenaciously conducting negotiations with criminals. As a result of the rigid police hierarchy that can curb the conduct of negotiators, the SIT is also a male-dominated society controlled with strict discipline. There is one female negotiator, Usagi Reiko, who bravely fights at the frontline. She is isolated in the male world of the SIT but courageously fights against crime as well as her organisation.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryoko Yonekura Reiko Usaki Toshio Kakei Seiichiro Kizaki Sousuke Takaoka Yusuke Amari Takashi Sasano Kohei Sumida Kosuke Suzuki Kunio Hasebe Full Cast & Crew Last Season Season 02 2009 | 9 Episodes Season 2 of The Negotiator premiered on October 22, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Negotiator. You can help by rating TV shows you've seen. Facts Original Name  交渉人 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  46m Homepage  - Genres Crime Drama Keywords thriller crime Content Score 71 Just a little bit more... Top Contributors A 104 Aka75 CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}