{"link": "https://www.themoviedb.org/tv/141?language=en", "title": "Cheers", "resume": "Cheers is an American sitcom television series that ran for 11 seasons from 1982 to 1993. It was produced by Charles/Burrows/Charles Productions in association with Paramount Network Television for NBC and created by the team of James Burrows, Glen Charles, and Les Charles. The show is set in a bar named Cheers in Boston, Massachusetts, where a group of locals meet to drink, relax, and socialize. The show's theme song, written and performed by Gary Portnoy, and co-written with Judy Hart Angelo, lent its famous refrain, \"Where Everybody Knows Your Name\", as the show's tagline.\nAfter premiering on September 30, 1982, it was nearly canceled during its first season when it ranked last in ratings for its premiere. Cheers, however, eventually became a highly rated television show in the United States, earning a top-ten rating during 8 of its 11 seasons, including one season at #1. The show spent most of its run on NBC's Thursday night \"Must See TV\" lineup. Its widely watched series finale was broadcast on May 20, 1993, and the show's 275 episodes have been successfully syndicated worldwide. Nominated for Outstanding Comedy Series for all eleven of its seasons on the air, it has earned 28 Emmy Awards from a then-record 117 nominations. The character Frasier Crane was featured in his eponymous spin-off show, which later aired up until 2004 and included guest appearances by virtually all of the major and minor Cheers characters.", "rate": 76, "genre": ["Comedy"], "cast": ["Ted Danson", "Kirstie Alley", "Rhea Perlman", "John Ratzenberger", "George Wendt"], "character": ["Sam Malone", "Rebecca Howe", "Carla Tortelli", "Cliff Clavin", "Norm Peterson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 141   Expand Cheers   (1982) User Score  Play Trailer Overview Cheers is an American sitcom television series that ran for 11 seasons from 1982 to 1993. It was produced by Charles/Burrows/Charles Productions in association with Paramount Network Television for NBC and created by the team of James Burrows, Glen Charles, and Les Charles. The show is set in a bar named Cheers in Boston, Massachusetts, where a group of locals meet to drink, relax, and socialize. The show's theme song, written and performed by Gary Portnoy, and co-written with Judy Hart Angelo, lent its famous refrain, \"Where Everybody Knows Your Name\", as the show's tagline. After premiering on September 30, 1982, it was nearly canceled during its first season when it ranked last in ratings for its premiere. Cheers, however, eventually became a highly rated television show in the United States, earning a top-ten rating during 8 of its 11 seasons, including one season at #1. The show spent most of its run on NBC's Thursday night \"Must See TV\" lineup. Its widely watched series finale was broadcast on May 20, 1993, and the show's 275 episodes have been successfully syndicated worldwide. Nominated for Outstanding Comedy Series for all eleven of its seasons on the air, it has earned 28 Emmy Awards from a then-record 117 nominations. The character Frasier Crane was featured in his eponymous spin-off show, which later aired up until 2004 and included guest appearances by virtually all of the major and minor Cheers characters. Featured Crew Glen Charles Creator Les Charles Creator James Burrows Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  0 Images Backdrops  9 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ted Danson Sam Malone Kirstie Alley Rebecca Howe Rhea Perlman Carla Tortelli John Ratzenberger Cliff Clavin George Wendt Norm Peterson Full Cast & Crew Last Season Season 11 1992 | 28 Episodes Season 11 of Cheers premiered on September 24, 1992. View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply PE Now playing for Boston, Gary Portnoy! Open 0 by Patrick E. Abe\n      \n     w Diane: Happy Birthday Shelley Long! Open 1 by  Patrick E. Abe h Which is the best? Open 2 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  7 Recommendations   1993-09-16 Frasier 7.7    1996-09-13 Everybody Loves Raymond 6.3    1996-09-17 Spin City 7.0    1987-04-05 Married... with Children 7.4    1996-01-09 3rd Rock from the Sun 7.3    1984-09-20 The Cosby Show 6.8    1972-09-17 M*A*S*H 7.7    1989-07-05 Seinfeld 8.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Comedy Keywords bar boston sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 34 lineker 27 Elizabeth Jennings 16 BlackDelivery 16 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}