{"link": "https://www.themoviedb.org/tv/12306?language=en", "title": "Tropical Heat", "resume": "Tropical Heat is a Canadian action series produced in cooperation with Mexico and Israel that aired between 1991 and 1993.\nThe plot revolves around private investigator, ex-DEA agent Nick Slaughter who after arriving in the fictional resort town of Key Mariah, Florida and setting up a detective agency there, met up with local tourist agent Sylvie Girard to solve a variety of different cases.\nThe series ran for three seasons totaling 66 episodes. Season one was filmed in Puerto Vallarta, Mexico due to tax breaks the production was eligible for under the North American Free Trade Agreement. Season two was filmed in Eilat, Israel. Season three was filmed in Pretoria, South Africa, with some sequences shot on the Isle of Mauritius.", "rate": 53, "genre": ["Action", "Adventure", "Drama", "Comedy"], "cast": ["Alon Nashman", "Ari Sorko-Ram", "Carolyn Dunn", "Rob Stewart", "Ian Tracey"], "character": ["Rollie", "Sgt. Gregory", "Sylvie Girard", "Nick Slaughter", "Spider Garvin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12306   Expand Tropical Heat   (1991) User Score Overview Tropical Heat is a Canadian action series produced in cooperation with Mexico and Israel that aired between 1991 and 1993. The plot revolves around private investigator, ex-DEA agent Nick Slaughter who after arriving in the fictional resort town of Key Mariah, Florida and setting up a detective agency there, met up with local tourist agent Sylvie Girard to solve a variety of different cases. The series ran for three seasons totaling 66 episodes. Season one was filmed in Puerto Vallarta, Mexico due to tax breaks the production was eligible for under the North American Free Trade Agreement. Season two was filmed in Eilat, Israel. Season three was filmed in Pretoria, South Africa, with some sequences shot on the Isle of Mauritius. Featured Crew Sam Egan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alon Nashman Rollie Ari Sorko-Ram Sgt. Gregory Carolyn Dunn Sylvie Girard Rob Stewart Nick Slaughter Ian Tracey Spider Garvin Full Cast & Crew Last Season Season 3 1992 | 36 Episodes Season 3 of Tropical Heat premiered on September 14, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tropical Heat. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Comedy Keywords florida private investigator detective agency Content Score 93 Almost there... Top Contributors 31 Banana z 5 zurman1 a 4 asusar 3 Stan Smith  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}