{"link": "https://www.themoviedb.org/tv/9428?language=en", "title": "Fancy Lala", "resume": "Fancy Lala, known in Japan as Fancy Lala, the Magic Stage is a magical girl anime series produced by Studio Pierrot in 1998. A two-volume manga adaptation by Rurika Kasuga ran in Ribon. The original designs were created by Akemi Takada, who worked on many of the 80's Studio Pierrot series. The anime series has been licensed for English release by Bandai Entertainment.", "rate": 0, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Shinobu Adachi", "Kappei Yamaguchi", "Omi Minami", "Michiko Neya", "Reiko Ōmori"], "character": ["Pigu", "Taro Yoshida", "Akiru Yuuki", "Mogu", "Fancy Lala"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9428   Expand Fancy Lala   (1998) User Score Overview Fancy Lala, known in Japan as Fancy Lala, the Magic Stage is a magical girl anime series produced by Studio Pierrot in 1998. A two-volume manga adaptation by Rurika Kasuga ran in Ribon. The original designs were created by Akemi Takada, who worked on many of the 80's Studio Pierrot series. The anime series has been licensed for English release by Bandai Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shinobu Adachi Pigu Kappei Yamaguchi Taro Yoshida Omi Minami Akiru Yuuki Michiko Neya Mogu Reiko Ōmori Fancy Lala Full Cast & Crew Last Season Season 1 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Fancy Lala. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}