{"link": "https://www.themoviedb.org/tv/72328?language=en", "title": "HIStory", "resume": "The HIStory webseries has 3 different stories: My Hero, Stay Away From Me and Obsessed, each of them are BL stories.\nMy Hero: Mai Ying Xiong’s girlfriend dies and is reborn in the body of his friend Gu Si Ren.\nStay Away From Me: When their parents get married and leave for a long honeymoon, superstar Cheng Qing moves in with his new stepbrother Feng He. With Meng Meng, his fujoshi best friend, around, dreaming of the perfect BL fanfic, will Feng He be able to stay away from his brother?\nObsessed follows the life of Shao Yi Chen, a man who is reborn and sent back 9 years ago to change his past and future. Will he resist the love of a handsome man Jiang Jing Teng and save his future self, or will he fall for the same men twice and risk his life?", "rate": 0, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72328   Expand HIStory   (2017) User Score Overview The HIStory webseries has 3 different stories: My Hero, Stay Away From Me and Obsessed, each of them are BL stories. My Hero: Mai Ying Xiong’s girlfriend dies and is reborn in the body of his friend Gu Si Ren. Stay Away From Me: When their parents get married and leave for a long honeymoon, superstar Cheng Qing moves in with his new stepbrother Feng He. With Meng Meng, his fujoshi best friend, around, dreaming of the perfect BL fanfic, will Feng He be able to stay away from his brother? Obsessed follows the life of Shao Yi Chen, a man who is reborn and sent back 9 years ago to change his past and future. Will he resist the love of a handsome man Jiang Jing Teng and save his future self, or will he fall for the same men twice and risk his life? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season HIStory 2 2018 | 16 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on HIStory. You can help by rating TV shows you've seen. Facts Status  Returning Series Network CHOCO TV Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Chinese Runtime  20m Homepage  - Genres Drama Keywords romance gay love Content Score 64 We're so close, yet so far. Top Contributors 63 kbogesz 12 gayso 4 lineker t 2 tim90922  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}