{"link": "https://www.themoviedb.org/tv/51006?language=en", "title": "Husband", "resume": "Story of pride of a young noble woman (Pream) who is forced into marriage with a Chinese-Thai business man (Grate) to save her home.\nYing Ai is a royal descendant and a prideful woman. At a young age Ying Ai was taught by her father to hate Jao Sua, a Chinese-Thai business man and a friend of her mothers. Ying Ai also believes that her father's death was caused by Jao Sua. In order to save her home, the Prakardiat Palace, from debt her father left behind, Lady Rattanawalee (Ying Ai's mother) agrees to marry Jao Sua to pay part of the debt. But as matters become more difficult, as her Adopted Uncle Prasit refuses the money from Lady Rattanwalee and claims that the money must come from Ying Ai. In order to get the Palace, Prasit will go as far as to kill Ying Ai to acquire the Palace, forcing Jao Sua to to engage Ying Ai to his youngest son, Ram.\nAs luck would have it Ram refuses the marriage, allowing Rab (who gladly wants to marry Ying Ai) to marry Ying Ai, allowing for Ram's mother to control her son to hate the first wife's children. But after marriage, Ying Ai is put in the middle of the conflict between Jao Sua and her father's past, forcing her to choose between Rab or her father. Will Ying Ai let go about the past and have a happy ending with Rab? Will Lady Rattanawalee finally explain the past to her daughter? Will Ying Ai finally give in to her heart's desire?", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Warintorn Panhakarn", "Ranida Techasit", "Apissada Kreurkongka", "Natwara Wongwasana", "Thanakrit Panichawit"], "character": ["Rab Lin Watanatawakorn", "Rasika Prakakiat (Khunying Ai)", "Surisong Prakardkiatsak (Khun Ying Song / Su)", "Ronglai Lin Watanatawakorn", "Pattawee Prakardkiatsak (Wee)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51006   Expand Husband   (2013) User Score Overview Story of pride of a young noble woman (Pream) who is forced into marriage with a Chinese-Thai business man (Grate) to save her home. Ying Ai is a royal descendant and a prideful woman. At a young age Ying Ai was taught by her father to hate Jao Sua, a Chinese-Thai business man and a friend of her mothers. Ying Ai also believes that her father's death was caused by Jao Sua. In order to save her home, the Prakardiat Palace, from debt her father left behind, Lady Rattanawalee (Ying Ai's mother) agrees to marry Jao Sua to pay part of the debt. But as matters become more difficult, as her Adopted Uncle Prasit refuses the money from Lady Rattanwalee and claims that the money must come from Ying Ai. In order to get the Palace, Prasit will go as far as to kill Ying Ai to acquire the Palace, forcing Jao Sua to to engage Ying Ai to his youngest son, Ram. As luck would have it Ram refuses the marriage, allowing Rab (who gladly wants to marry Ying Ai) to marry Ying Ai, allowing for Ram's mother to control her son to hate the first wife's children. But after marriage, Ying Ai is put in the middle of the conflict between Jao Sua and her father's past, forcing her to choose between Rab or her father. Will Ying Ai let go about the past and have a happy ending with Rab? Will Lady Rattanawalee finally explain the past to her daughter? Will Ying Ai finally give in to her heart's desire?  Featured Crew Maker J Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Warintorn Panhakarn Rab Lin Watanatawakorn Ranida Techasit Rasika Prakakiat (Khunying Ai) Apissada Kreurkongka Surisong Prakardkiatsak (Khun Ying Song / Su) Natwara Wongwasana Ronglai Lin Watanatawakorn Thanakrit Panichawit Pattawee Prakardkiatsak (Wee) Full Cast & Crew Last Season Season 1 2013 | 14 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Husband. You can help by rating TV shows you've seen. Facts Original Name  สามี Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  107m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 48 Crip TB 3 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}