{"link": "https://www.themoviedb.org/tv/17039?language=en", "title": "Emperor Wang Gun", "resume": "Taejo Wang Geon was a 200-episode Korean drama starring Choi Soo Jong in the title role. It became very successful, reaching very high ratings, around 60%.", "rate": 0, "genre": ["War", "Politics", "Drama"], "cast": ["Choi Soo-jong", "Suh In Suk", "Kim Young-chul", "Kim Hye-Ri"], "character": ["Emperor Wang Gun", "Kyun Hwon", "Gung Ye", "Yeon Hwa / Kang Bi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17039   Expand Emperor Wang Gun   (2000) User Score Overview Taejo Wang Geon was a 200-episode Korean drama starring Choi Soo Jong in the title role. It became very successful, reaching very high ratings, around 60%. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Choi Soo-jong Emperor Wang Gun Suh In Suk Kyun Hwon Kim Young-chul Gung Ye Kim Hye-Ri Yeon Hwa / Kang Bi Full Cast & Crew Last Season Emperor wang gun season 1 2000 | 105 Episodes Season 1 of Emperor Wang Gun premiered on April  1, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Emperor Wang Gun. You can help by rating TV shows you've seen. Facts Original Name  태조 왕건 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  47m Homepage  - Genres War & Politics Drama Keywords historical figure period drama historical Content Score 93 Almost there... Top Contributors 28 animerika R 2 RJ_F13 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}