{"link": "https://www.themoviedb.org/tv/72425?language=en", "title": "Restaurant to Another World", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 88, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Junichi Suwabe", "Sumire Uesaka", "Saori Oonishi", "Kiyono Yasuno", "Tomokazu Sugita"], "character": ["Master", "Aletta", "Kuro", "Sara Gold (Menchi-katsu)", "Heinrich Seeleman (Fried prawn)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72425   Expand Restaurant to Another World   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Junpei Inuzuka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junichi Suwabe Master Sumire Uesaka Aletta Saori Oonishi Kuro Kiyono Yasuno Sara Gold (Menchi-katsu) Tomokazu Sugita Heinrich Seeleman (Fried prawn) Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Restaurant to Another World premiered on July  3, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Restaurant to Another World. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2017-07-02 Knight's & Magic 8.5    2017-07-11 In Another World With My Smartphone 9.2    2017-01-06 Fuuka 7.3    2017-07-13 Gamers! 7.8    2006-10-04 Negima!? Magister Negi Magi 5.9    2008-01-03 Rosario + Vampire 9.1    2017-07-04 Tsuredure Children 8.0    2016-07-10 Tales of Zestiria the X 7.7  Facts Original Name  異世界食堂 Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://isekai-shokudo.com/ Genres Animation Sci-Fi & Fantasy Keywords restaurant cuisine based on light novel anime Content Score 93 Almost there... Top Contributors 44 Despair-Paradise 21 sp1ti C 13 Chintaran 4 Zorro1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}