{"link": "https://www.themoviedb.org/tv/62264?language=en", "title": "Ash vs Evil Dead", "resume": "Bruce Campbell reprises his role as Ash Williams, an aging lothario and chainsaw-handed monster hunter who’s spent the last three decades avoiding maturity, and the terrors of the Evil Dead. But when a Deadite plague threatens to destroy all of mankind, he’s forced to face his demons — both metaphorical and literal.", "rate": 78, "genre": ["Action", "Comedy", "Fantasy", "Horror"], "cast": ["Bruce Campbell", "Lucy Lawless", "Ray Santiago", "Dana DeLorenzo", "Arielle O'Neill"], "character": ["Ashley “Ash” Williams", "Ruby Knowby", "Pablo Simon Bolivar", "Kelly Maxwell", "Brandy Barr"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62264   Expand Ash vs Evil Dead   (2015) User Score  Play Trailer Overview Bruce Campbell reprises his role as Ash Williams, an aging lothario and chainsaw-handed monster hunter who’s spent the last three decades avoiding maturity, and the terrors of the Evil Dead. But when a Deadite plague threatens to destroy all of mankind, he’s forced to face his demons — both metaphorical and literal. Featured Crew Sam Raimi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  0 Images Backdrops  19 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce Campbell Ashley “Ash” Williams Lucy Lawless Ruby Knowby Ray Santiago Pablo Simon Bolivar Dana DeLorenzo Kelly Maxwell Arielle O'Neill Brandy Barr Full Cast & Crew Current Season Season 3 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  17 Subject Status Replies Last Reply m Season 3 Ranking Open 3 by  jorgito2001 M Middle Name Open 3 by  Moonglum9 Bv So Season 3 Is It Open 11 by  Xyberfaust Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  12 Recommendations   2015-11-20 Marvel's Jessica Jones 7.6    2014-05-11 Penny Dreadful 7.4    2015-05-14 Wayward Pines 6.5    2015-04-10 Marvel's Daredevil 7.7    2013-04-04 Hannibal 7.7    1993-09-10 The X-Files 8.1    2014-07-13 The Strain 6.6    2016-10-31 Stan Against Evil 6.7  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m, 30m Homepage   https://www.starz.com/series/ashvsevildead Genres Action Comedy Fantasy Horror Keywords horror demon living dead demon hunter Content Score 100 Yes! Looking good! Top Contributors 62 Elizabeth Jennings T 22 TwelveVacancies 18 niqo19 12 .maxx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}