{"link": "https://www.themoviedb.org/tv/8705?language=en", "title": "Virtuality", "resume": "Virtuality is a television pilot co-written by Ronald D. Moore and Michael Taylor and directed by Peter Berg that aired on the Fox network. Since the show was never picked up as a television series, the two-hour pilot episode aired as a movie on June 26, 2009.", "rate": 80, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Jimmi Simpson", "Jose Pablo Cantillo", "Nikolaj Coster-Waldau", "Clea DuVall", "Nelson Lee"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8705   Expand Virtuality   (2009) User Score Overview Virtuality is a television pilot co-written by Ronald D. Moore and Michael Taylor and directed by Peter Berg that aired on the Fox network. Since the show was never picked up as a television series, the two-hour pilot episode aired as a movie on June 26, 2009. Featured Crew Ronald D. Moore Creator Michael Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmi Simpson Jose Pablo Cantillo Nikolaj Coster-Waldau Clea DuVall Nelson Lee Full Cast & Crew Last Season Season 1 2009 | 1 Episode Season 1 of Virtuality premiered on June 26, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Virtuality. You can help by rating TV shows you've seen. Facts Status  Pilot Network Certification  - Type  Scripted Original Language  English Runtime  87m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords spaceship space failed tv pilot space exploration Content Score 93 Almost there... Top Contributors z 15 zurman1 11 Banana 7 janar D 3 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}