{"link": "https://www.themoviedb.org/tv/61894?language=en", "title": "Life Story", "resume": "Presented by David Attenborough, Life Story tells the remarkable and often perilous story of the journey through life. It is a story that unites each of us with every animal on the planet, because we all set out on this journey from the moment we are born. For animals there is just one goal in life – to continue their bloodline in the form of offspring. This series follows that journey through its six crucial stages: first steps, growing up, finding a home, gaining power, winning a mate and succeeding as a parent.", "rate": 82, "genre": ["Documentary"], "cast": ["David Attenborough"], "character": ["Himself - Presenter and Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61894   Expand Life Story   (2014) User Score  Play Trailer Overview Presented by David Attenborough, Life Story tells the remarkable and often perilous story of the journey through life. It is a story that unites each of us with every animal on the planet, because we all set out on this journey from the moment we are born. For animals there is just one goal in life – to continue their bloodline in the form of offspring. This series follows that journey through its six crucial stages: first steps, growing up, finding a home, gaining power, winning a mate and succeeding as a parent. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  25 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Attenborough Himself - Presenter and Narrator Full Cast & Crew Last Season Season 1 2014 | 7 Episodes Season 1 of Life Story premiered on October 23, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  25 Posters  11 Recommendations   1985-02-24 The Boat 8.2    2009-10-11 Life 8.3  Facts Status  Ended Network Certification 18 Meaning Can be aired only from 11:00pm Uhr to 6:00am. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p026vg04 Genres Documentary Keywords elephant lion animal nature nature documentary Content Score 64 We're so close, yet so far. Top Contributors TB 41 TMDb Bot 24 Elizabeth Jennings E 12 Eimer d 11 domdom  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}