{"link": "https://www.themoviedb.org/tv/21730?language=en", "title": "Mobile Suit Gundam Wing", "resume": "Mankind has moved into space. Thousands of people live on giant orbiting space colonies called \"Sides.\" However, the Earth Government, which rules the colonies, is unjust and cruel. A group of revolutionaries builds five robotic weapons called Gundams and plans to send them to Earth to begin their fight for independence. Piloted by five young men, these Gundams carry the hopes and dreams of freedom of the colonists with them as they descend to Earth to begin Operation Meteor!", "rate": 86, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Akiko Yajima", "Toshihiko Seki", "Hikaru Midorikawa", "Ai Orikasa", "Ryuzou Ishino"], "character": ["Relena Darlian", "Duo Maxwell", "Heero Yuy", "Quatre Raberba Winner", "Chang Wufei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21730   Expand Mobile Suit Gundam Wing   (1995) User Score Overview Mankind has moved into space. Thousands of people live on giant orbiting space colonies called \"Sides.\" However, the Earth Government, which rules the colonies, is unjust and cruel. A group of revolutionaries builds five robotic weapons called Gundams and plans to send them to Earth to begin their fight for independence. Piloted by five young men, these Gundams carry the hopes and dreams of freedom of the colonists with them as they descend to Earth to begin Operation Meteor! Featured Crew Hajime Yatate Creator Yoshiyuki Tomino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiko Yajima Relena Darlian Toshihiko Seki Duo Maxwell Hikaru Midorikawa Heero Yuy Ai Orikasa Quatre Raberba Winner Ryuzou Ishino Chang Wufei Full Cast & Crew Last Season Season 1 1995 | 49 Episodes Season 1 of Mobile Suit Gundam Wing premiered on April  7, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam Wing. You can help by rating TV shows you've seen. Facts Original Name  新機動戦記ガンダムW Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.gundam-w.jp/ Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 21 tmdb983464 h 16 heeroyuy176 12 smatster p 8 psy4trik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}