{"link": "https://www.themoviedb.org/tv/57478?language=en", "title": "NASA's Unexplained Files", "resume": "For centuries, mankind has looked to the skies and wondered, \"are we alone in the universe?\" In one month SCIENCE partners with TED and SETI Institute (Search for Extraterrestrial Intelligence), to enlist like-minded individuals everywhere to tackle this defining question with ARE WE ALONE?, a breakthrough multimedia initiative. ARE WE ALONE? is timed to support a major new resource called SETI Live which will empower and mobilize \"citizen scientists\" from all walks of life to join the search for extraterrestrial intelligence.", "rate": 77, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57478   Expand NASA's Unexplained Files   (2012) User Score  Play Trailer Overview For centuries, mankind has looked to the skies and wondered, \"are we alone in the universe?\" In one month SCIENCE partners with TED and SETI Institute (Search for Extraterrestrial Intelligence), to enlist like-minded individuals everywhere to tackle this defining question with ARE WE ALONE?, a breakthrough multimedia initiative. ARE WE ALONE? is timed to support a major new resource called SETI Live which will empower and mobilize \"citizen scientists\" from all walks of life to join the search for extraterrestrial intelligence. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2017 | 8 Episodes Season 5 of NASA's Unexplained Files premiered on April 11, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Oops! Open 0 by Jetfire59\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2014-02-28 Hangar 1: The UFO Files 6.6    2012-01-21 America's Book of Secrets 4.8    2015-01-09 UFOs Declassified 7.3    2014-01-05 The Curse of Oak Island 7.1    2010-04-20 Ancient Aliens 6.4  Facts Status  In Production Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  - Homepage   http://www.sciencechannel.com/tv-shows/are-we-alone/videos/nasas-unexplained-files-something-out-there.htm Genres Documentary Keywords conspiracy theory conspiracy Content Score 64 We're so close, yet so far. Top Contributors 18 Greg L 10 Limitless 9 Elizabeth Jennings w 6 wil001  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}