{"link": "https://www.themoviedb.org/tv/38907?language=en", "title": "Drunken to Love You", "resume": "Love You, is a 2011 Taiwanese drama starring Joseph Chang, Rainie Yang, Kingone Wang, Tiffany Hsu, Alien Huang and Tom Price. It is the second installment of the Fated to Love You trilogy. It started filming in January 2011 and wrapped on 30 April.\nIt was first broadcast in Taiwan on free-to-air Taiwan Television from 17 April 2011, every Sunday at 22:00 and cable TV SET Metro from 23 April 2011, every Saturday at 21:00.\nLove You was nominated in 2011 for four awards at the 46th Golden Bell Awards, including Best Leading Actor in a Television Series for Joseph Chang, Best Directing for a Television Series for Ming-chang Chen and Best Television Series.", "rate": 0, "genre": ["Comedy"], "cast": ["Rainie Yang", "Joseph Chang Hsiao-Chuan", "Huang Hong Sheng", "Tiffany Hsu", "Kingone Wang"], "character": ["Xiao Ru Lin", "Song Jie Xiu", "Di Shuo Huai", "Ai Wei Tang", "Ren Yi Xiang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38907   Expand Drunken to Love You   (2011) User Score Overview Love You, is a 2011 Taiwanese drama starring Joseph Chang, Rainie Yang, Kingone Wang, Tiffany Hsu, Alien Huang and Tom Price. It is the second installment of the Fated to Love You trilogy. It started filming in January 2011 and wrapped on 30 April. It was first broadcast in Taiwan on free-to-air Taiwan Television from 17 April 2011, every Sunday at 22:00 and cable TV SET Metro from 23 April 2011, every Saturday at 21:00. Love You was nominated in 2011 for four awards at the 46th Golden Bell Awards, including Best Leading Actor in a Television Series for Joseph Chang, Best Directing for a Television Series for Ming-chang Chen and Best Television Series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rainie Yang Xiao Ru Lin Joseph Chang Hsiao-Chuan Song Jie Xiu Huang Hong Sheng Di Shuo Huai Tiffany Hsu Ai Wei Tang Kingone Wang Ren Yi Xiang Full Cast & Crew Last Season Season 1 2011 | 18 Episodes Season 1 of Drunken to Love You premiered on April 17, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Drunken to Love You. You can help by rating TV shows you've seen. Facts Original Name  醉後決定愛上你 Status  Ended Network TTV Main Channel Certification  - Type  Scripted Original Language  Chinese Runtime  80m Homepage   http://www.ttv.com.tw/drama11/drunk/index.htm Genres Comedy Keywords taiwanese Content Score 86 Almost there... Top Contributors M 22 Maria180493 CM 4 Cherche Moi 3 lareina123 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}