{"link": "https://www.themoviedb.org/tv/68401?language=en", "title": "Dead Silent", "resume": "A snap of a twig. A rustling leaf. In the woods, myth, urban legend, and horror collide with real-life killers. Transporting viewers into a vortex of dark mystery and psychological terror, each episode tells the true story of a crime set in a desolate location.", "rate": 78, "genre": ["Crime"], "cast": ["Dude Walker"], "character": ["Himself - Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68401   Expand Dead Silent   (2016) User Score  Play Trailer Overview A snap of a twig. A rustling leaf. In the woods, myth, urban legend, and horror collide with real-life killers. Transporting viewers into a vortex of dark mystery and psychological terror, each episode tells the true story of a crime set in a desolate location. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dude Walker Himself - Narrator (voice) Full Cast & Crew Current Season Season 2 2017 | 2 Episodes Season 2 of Dead Silent premiered on October 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   60 Minutes 7.5  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  - Homepage   http://www.investigationdiscovery.com/tv-shows/dead-silent/ Genres Crime Keywords reenactment Content Score 64 We're so close, yet so far. Top Contributors 13 Elizabeth Jennings m 5 melianasaputri TB 3 TMDb Bot 3 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}