{"link": "https://www.themoviedb.org/tv/1762?language=en", "title": "What's with Andy?", "resume": "Andy Larkin isn't like other children. He's not into sports, science or even video games. Andy spends his time mastering the art of being a prankster. In fact, he strives to be the greatest practical joker the world has ever seen. However, Andy's mischievous antics often backfire and he suffers greatly for his art.", "rate": 73, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1762   Expand What's with Andy?   (2001) User Score Overview Andy Larkin isn't like other children. He's not into sports, science or even video games. Andy spends his time mastering the art of being a prankster. In fact, he strives to be the greatest practical joker the world has ever seen. However, Andy's mischievous antics often backfire and he suffers greatly for his art. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2006 | 26 Episodes Season 3 of What's with Andy? premiered on September  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   The Kids from Room 402 8.4    2006-06-03 Galactik Football 8.0    2003-11-01 Tutenstein 6.1    2004-12-18 W.I.T.C.H. 6.6    2003-08-23 Sonic X 5.5    1995-06-18 Life with Louie 5.9    2001-11-03 Totally Spies! 5.6    1975-05-01 The Adventures of Maya the Honey Bee 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cinegroupe.com/whatswithandy Genres Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors p 11 przemotco 7 Elizabeth Jennings 3 Maikkoum 3 mercuriy_v  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}