{"link": "https://www.themoviedb.org/tv/39859?language=en", "title": "Awkward.", "resume": "An irreverent look at the conflict, chaos and humor that defines teenage life through the eyes of 15-year-old Jenna Hamilton whose life begins to change when a simple accident becomes an epic misunderstanding and is blown way out of proportion. Narration in the first-person voice of Jenna's blog posts captures the humor within the struggles and experiences everyone can relate to from their formative years.", "rate": 65, "genre": ["Comedy", "Drama"], "cast": ["Ashley Rickards", "Beau Mirchoff", "Nikki DeLoach", "Jillian Rose Reed", "Brett Davern"], "character": ["Jenna Hamilton", "Matty McKibben", "Lacey Hamilton", "Tamara Kaplan", "Jake Rosati"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39859   Expand Awkward.   (2011) User Score  Play Trailer Overview An irreverent look at the conflict, chaos and humor that defines teenage life through the eyes of 15-year-old Jenna Hamilton whose life begins to change when a simple accident becomes an epic misunderstanding and is blown way out of proportion. Narration in the first-person voice of Jenna's blog posts captures the humor within the struggles and experiences everyone can relate to from their formative years. Featured Crew Lauren Iungerich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  13 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Rickards Jenna Hamilton Beau Mirchoff Matty McKibben Nikki DeLoach Lacey Hamilton Jillian Rose Reed Tamara Kaplan Brett Davern Jake Rosati Full Cast & Crew Last Season Season 5 2015 | 24 Episodes Season 5 of Awkward. premiered on August 31, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply When did this show lose you? Open 2 by  MirrorMask Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  6 Recommendations   2014-04-22 Faking It 5.3    2011-09-28 Suburgatory 6.8    2007-10-15 Samantha Who? 6.5    2015-03-31 Weird Loners 5.8    2011-04-13 Happy Endings 7.3    2011-10-17 Threesome 6.3    2012-04-11 Don't Trust the B---- in Apartment 23 6.7    2012-10-11 Copper 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 20m Homepage   http://www.mtv.com/shows/awkward/series.jhtml Genres Comedy Drama Keywords high school bullying teenager teen comedy aspiring writer teenage romance Content Score 100 Yes! Looking good! Top Contributors 94 seawolf 70 Banana 20 BudsieBuds TB 15 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}