{"link": "https://www.themoviedb.org/tv/2547?language=en", "title": "Afterlife", "resume": "University lecturer Robert Bridge becomes involved in a series of supernatural events surrounding medium Alison Mundy.", "rate": 71, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Lesley Sharp", "Andrew Lincoln", "Anna Wilson-Jones", "Kate Duchêne"], "character": ["Alison Mundy", "Robert Bridge", "Jude Bridge", "Barbara Sinyard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2547   Expand Afterlife   (2005) User Score Overview University lecturer Robert Bridge becomes involved in a series of supernatural events surrounding medium Alison Mundy. Featured Crew Stephen Volk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lesley Sharp Alison Mundy Andrew Lincoln Robert Bridge Anna Wilson-Jones Jude Bridge Kate Duchêne Barbara Sinyard Full Cast & Crew Last Season Season 2 2006 | 8 Episodes Season 2 of Afterlife premiered on September 16, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Good 2005-2006 British supernatural drama series Open 1 by  genplant29 Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2008-11-13 Apparitions 7.9    2004-07-19 The Grid 7.0    2016-06-08 Power Monkeys 7.0    2006-01-01 In Justice 6.8    2011-09-14 Free Agents 4.8    2011-02-03 Marchlands 7.4    1979-09-30 To the Manor Born 7.1    2011-09-13 The Body Farm 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Mystery Sci-Fi & Fantasy Keywords england supernatural medium psychic power psychic skeptic contacting spirits Content Score 93 Almost there... Top Contributors 24 genplant29 19 Banana 5 Elizabeth Jennings w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}