{"link": "https://www.themoviedb.org/tv/41326?language=en", "title": "Freeter, Ie wo Kau", "resume": "Freeter, Ie wo Kau is a Japanese television drama series that aired on Fuji Television and on Kyodo Television in 2010.", "rate": 0, "genre": ["Drama"], "cast": ["Atsuko Asano", "Naoto Takenaka", "Kazunari Ninomiya", "Karina"], "character": ["Seiji Take", "Manami Chiba"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41326   Expand  Freeter, Ie wo Kau   (2010) User Score Overview Freeter, Ie wo Kau is a Japanese television drama series that aired on Fuji Television and on Kyodo Television in 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atsuko Asano Naoto Takenaka Kazunari Ninomiya Seiji Take Karina Manami Chiba Full Cast & Crew Last Season Season 1 2010 | 11 Episodes Season 1 of  Freeter, Ie wo Kau premiered on October 19, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on  Freeter, Ie wo Kau. You can help by rating TV shows you've seen. Facts Original Name  フリーター、家を買う。 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 17 Aka75 5 cs8minty  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}