{"link": "https://www.themoviedb.org/tv/12254?language=en", "title": "Getting By", "resume": "Getting By is an American sitcom that aired on ABC from March 5, 1993 until May 21, 1993, and on NBC from September 21, 1993 until June 18, 1994. The series was created by William Bickley and Michael Warren, who also served as executive producers with Thomas L. Miller and Robert L. Boyett. The final Miller-Boyett series to begin its run under parent studio Lorimar Television, Getting By was folded into Warner Bros. Television for its second season, following Warner Bros.' absortion of Lorimar.\nThe series was initially successful as a part of ABC's TGIF lineup in its first season, but politics between ABC and Miller-Boyett Productions led to the show's switch to NBC in the second season.", "rate": 0, "genre": ["Comedy"], "cast": ["Cindy Williams", "Telma Hopkins", "Deon Richmond", "Merlin Santana"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12254   Expand Getting By   (1993) User Score Overview Getting By is an American sitcom that aired on ABC from March 5, 1993 until May 21, 1993, and on NBC from September 21, 1993 until June 18, 1994. The series was created by William Bickley and Michael Warren, who also served as executive producers with Thomas L. Miller and Robert L. Boyett. The final Miller-Boyett series to begin its run under parent studio Lorimar Television, Getting By was folded into Warner Bros. Television for its second season, following Warner Bros.' absortion of Lorimar. The series was initially successful as a part of ABC's TGIF lineup in its first season, but politics between ABC and Miller-Boyett Productions led to the show's switch to NBC in the second season. Featured Crew Michael Warren Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cindy Williams Telma Hopkins Deon Richmond Merlin Santana Full Cast & Crew Last Season Season 2 1993 | 19 Episodes Season 2 of Getting By premiered on September 21, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Getting By. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage  - Genres Comedy Keywords roommate female friendship single mother sitcom Content Score 79 Pump it up! We're close now. Top Contributors 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}