{"link": "https://www.themoviedb.org/tv/189?language=en", "title": "At Last the 1948 Show", "resume": "At Last the 1948 Show is a satirical TV show made by David Frost's company, Paradine Productions, in association with Rediffusion London. Transmitted on Britain's ITV network during 1967 and 1968, it brought Cambridge Footlights humour to a broader audience.\nThe show starred Tim Brooke-Taylor, Graham Chapman, John Cleese, Marty Feldman and Aimi MacDonald. Cleese and Brooke-Taylor were also the programme editors. The director was Ian Fordyce.", "rate": 81, "genre": ["Comedy"], "cast": ["Graham Chapman", "John Cleese", "Tim Brooke-Taylor", "Marty Feldman", "Aimi MacDonald"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 189   Expand At Last the 1948 Show   (1967) User Score Overview At Last the 1948 Show is a satirical TV show made by David Frost's company, Paradine Productions, in association with Rediffusion London. Transmitted on Britain's ITV network during 1967 and 1968, it brought Cambridge Footlights humour to a broader audience. The show starred Tim Brooke-Taylor, Graham Chapman, John Cleese, Marty Feldman and Aimi MacDonald. Cleese and Brooke-Taylor were also the programme editors. The director was Ian Fordyce. Featured Crew Marty Feldman Creator Graham Chapman Creator John Cleese Creator Tim Brooke-Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Graham Chapman John Cleese Tim Brooke-Taylor Marty Feldman Aimi MacDonald Full Cast & Crew Last Season Season 2 1967 | 7 Episodes Season 2 of At Last the 1948 Show premiered on September 26, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1969-10-05 Monty Python's Flying Circus 8.2    1975-09-19 Fawlty Towers 8.1    1993-09-10 The X-Files 8.1    1994-09-22 Friends 7.8  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords satire sketch comedy british humour Content Score 93 Almost there... Top Contributors 5 Michael O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}