{"link": "https://www.themoviedb.org/tv/61056?language=en", "title": "How to Get Away with Murder", "resume": "A sexy, suspense-driven legal thriller about a group of ambitious law students and their brilliant, mysterious criminal defense professor. They become entangled in a murder plot and will shake the entire university and change the course of their lives.", "rate": 74, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Viola Davis", "Jack Falahee", "Aja Naomi King", "Matt McGorry", "Karla Souza"], "character": ["Annalise Keating", "Connor Walsh", "Michaela Pratt", "Asher Millstone", "Laurel Castillo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61056   Expand How to Get Away with Murder   (2014) User Score  Play Trailer Overview A sexy, suspense-driven legal thriller about a group of ambitious law students and their brilliant, mysterious criminal defense professor. They become entangled in a murder plot and will shake the entire university and change the course of their lives. Featured Crew Peter Nowalk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  9 Images Backdrops  13 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Viola Davis Annalise Keating Jack Falahee Connor Walsh Aja Naomi King Michaela Pratt Matt McGorry Asher Millstone Karla Souza Laurel Castillo Full Cast & Crew Last Season Season 4 2017 | 15 Episodes Season 4 of How to Get Away with Murder premiered on September 28, 2017. View All Seasons Social Reviews  0 Discussions  23 Subject Status Replies Last Reply Actress Karla Souza ('Laurel') apparently expecting Open 0 by genplant29\n      \n     Who wants Connor to cheat? Open 0 by TrentTX\n      \n     C More than before Open 13 by  genplant29 Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  13 Recommendations   2012-04-05 Scandal 6.6    2015-09-27 Quantico 5.9    2013-07-11 Orange Is the New Black 7.4    2015-11-20 Marvel's Jessica Jones 7.6    2013-03-30 Orphan Black 7.6    2009-01-21 Lie to Me 7.4    2011-09-21 Revenge 6.9    2009-10-23 White Collar 7.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/how-to-get-away-with-murder Genres Crime Drama Mystery Keywords philadelphia court case murder lawyer courtroom law student defense attorney law professor murder mystery legal drama Content Score 100 Yes! Looking good! Top Contributors 372 Satai Delenn 343 lineker 198 Marr 🇳🇱 85 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}