{"link": "https://www.themoviedb.org/tv/31731?language=en", "title": "Gunslinger Girl", "resume": "The Social Welfare Agency saves the lives of terminal patients using cybernetic implants. Then it teaches them to kill. After surviving the slaughter of her family, young Henrietta awakens to her new life at the Agency with a rebuilt body and no memory. Teamed with Jose, who is responsible for turning her into the perfect assassin, Henrietta’s been given a second chance—but at what cost?", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31731   Expand Gunslinger Girl   (2003) User Score Overview The Social Welfare Agency saves the lives of terminal patients using cybernetic implants. Then it teaches them to kill. After surviving the slaughter of her family, young Henrietta awakens to her new life at the Agency with a rebuilt body and no memory. Teamed with Jose, who is responsible for turning her into the perfect assassin, Henrietta’s been given a second chance—but at what cost? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Gunslinger Girl: Il Teatrino 2008 | 13 Episodes Season 2 of Gunslinger Girl premiered on January  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations   2013-12-24 Turbo FAST 4.7    2008-04-07 Soul Eater 7.0    2013-04-07 Gargantia on the Verdurous Planet 6.8    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6    2009-04-05 Beyblade: Metal Fusion 3.8    2010-07-05 Highschool of the Dead 7.0  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Drama Keywords assassin italy espionage cyborg based on manga girls with guns child soldier anime Content Score 56 We're so close, yet so far. Top Contributors 160 Marr 🇳🇱 19 Ailurus Fulgens 7 Greg TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}