{"link": "https://www.themoviedb.org/tv/13833?language=en", "title": "The Six Wives of Henry VIII", "resume": "Series of television plays written by six different authors. Each play is a lavish dramatization of the trials and tribulations surrounding Henry and his wives. Keith Michell ties the episodes together with his dignified and magnetic performance as the mighty monarch.", "rate": 76, "genre": ["Drama"], "cast": ["Keith Michell", "Anthony Quayle", "Daniel Moynihan", "Alison Frazer", "Wolfe Morris"], "character": ["Henry VIII of England"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13833   Expand The Six Wives of Henry VIII   (1970) User Score Overview Series of television plays written by six different authors. Each play is a lavish dramatization of the trials and tribulations surrounding Henry and his wives. Keith Michell ties the episodes together with his dignified and magnetic performance as the mighty monarch. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith Michell Henry VIII of England Anthony Quayle Daniel Moynihan Alison Frazer Wolfe Morris Full Cast & Crew Last Season Season 1 1970 | 6 Episodes Season 1 of The Six Wives of Henry VIII premiered on January  1, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   1975-04-01 Edward the Seventh 7.6    1971-02-17 Elizabeth R 8.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords england treason tudors king historical intrigue henry viii tower of london Content Score 86 Almost there... Top Contributors TB 14 TMDb Bot C 6 CABJ R 3 Rebecca 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}