{"link": "https://www.themoviedb.org/tv/76121?language=en", "title": "DARLING in the FRANXX", "resume": "The story is set in the distant future. The land is ruined, and humanity establishes the mobile fort city Plantation. Pilots produced inside Plantation live in Mistilteinn, also know as the \"birdcage.\" Children live there knowing nothing of the outside world or the freedom of the sky. Their lives consist of battling to carry out missions. Their enemies are mysterious giant lifeforms known as Kyouryuu, and the children pilot robots called Franxx to face off against them. For the children, riding the Franxx proves their existence.\nA boy named Hiro is called Code:016, and he was once known as a prodigy. However, he has fallen behind, and his existence seems unnecessary. Not piloting a Franxx is the same as ceasing to exist. One day, a mysterious girl known as \"Zero Two\" appears before him. Two horns grow out of her head.", "rate": 73, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kana Ichinose", "Haruka Tomatsu", "Yuuto Uemura", "Yuuichirou Umehara", "Nanami Yamashita"], "character": ["Ichigo (voice)", "Zero Two (voice)", "Hiro (voice)", "Gorou (voice)", "Miku (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76121   Expand DARLING in the FRANXX   (2018) User Score  Play Trailer Overview The story is set in the distant future. The land is ruined, and humanity establishes the mobile fort city Plantation. Pilots produced inside Plantation live in Mistilteinn, also know as the \"birdcage.\" Children live there knowing nothing of the outside world or the freedom of the sky. Their lives consist of battling to carry out missions. Their enemies are mysterious giant lifeforms known as Kyouryuu, and the children pilot robots called Franxx to face off against them. For the children, riding the Franxx proves their existence. A boy named Hiro is called Code:016, and he was once known as a prodigy. However, he has fallen behind, and his existence seems unnecessary. Not piloting a Franxx is the same as ceasing to exist. One day, a mysterious girl known as \"Zero Two\" appears before him. Two horns grow out of her head. Featured Crew Toshifumi Akai Creator Atsushi Nishigori Creator Naotaka Hayashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Ichinose Ichigo (voice) Haruka Tomatsu Zero Two (voice) Yuuto Uemura Hiro (voice) Yuuichirou Umehara Gorou (voice) Nanami Yamashita Miku (voice) Full Cast & Crew Current Season Season 1 2018 | 24 Episodes Season 1 of DARLING in the FRANXX premiered on January 13, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on DARLING in the FRANXX. You can help by rating TV shows you've seen. Facts Original Name  ダーリン・イン・ザ・フランキス Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://darli-fra.jp Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords romance mecha Content Score 100 Yes! Looking good! Top Contributors 34 Resune 12 sp1ti 12 Mikedeth5 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}