{"link": "https://www.themoviedb.org/tv/65187?language=en", "title": "One More Happy Ending", "resume": "Drama series depicts the story of marriage, remarriage and divorce. Han Mi Mo was once an idol group member, but she now works as a representative of a remarriage consulting business. She gives honest answers to her customers who hope to remarry. Song Soo Hyuk is a divorced man in his thirties with an 11-year-old son. He is a good-looking gossip reporter who looks like he is still in his twenties. He is very good at his job, because his looks and smiles melt the hearts of his interview subjects, and they are very willing to disclose even the deepest secrets. “One More Happy Ending” will deal with the stories of the divorced, who dream of becoming happy one more time.", "rate": 54, "genre": ["Comedy", "Romance"], "cast": ["Jang Na-ra", "Jung Kyung-ho", "Yoo In-na", "Yoo Da-in", "Kwon Yul"], "character": ["Han Mi-Mo", "Song Soo-Hyuk", "Go Dong-Mi", "Baek Da-Jung", "Goo Hae-joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65187   Expand One More Happy Ending   (2016) User Score Overview Drama series depicts the story of marriage, remarriage and divorce. Han Mi Mo was once an idol group member, but she now works as a representative of a remarriage consulting business. She gives honest answers to her customers who hope to remarry. Song Soo Hyuk is a divorced man in his thirties with an 11-year-old son. He is a good-looking gossip reporter who looks like he is still in his twenties. He is very good at his job, because his looks and smiles melt the hearts of his interview subjects, and they are very willing to disclose even the deepest secrets. “One More Happy Ending” will deal with the stories of the divorced, who dream of becoming happy one more time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Na-ra Han Mi-Mo Jung Kyung-ho Song Soo-Hyuk Yoo In-na Go Dong-Mi Yoo Da-in Baek Da-Jung Kwon Yul Goo Hae-joon Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of One More Happy Ending premiered on January 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2016-03-05 Marriage Contract 8.2    2016-04-20 Entertainer 6.0    2016-03-27 Vampire Detective 6.1    2016-01-22 Madame Antoine 6.0  Facts Original Name  한번 더 해피엔딩 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/lovexlove/ Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 44 Maria180493 z 10 zurman1 6 Imzadi 4 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}