{"link": "https://www.themoviedb.org/tv/68070?language=en", "title": "WWW.WORKING!!", "resume": "Daisuke Higashida gets a job at a restaurant because of family financial difficulties, but no one who works there is normal.", "rate": 35, "genre": ["Animation", "Comedy"], "cast": ["Youko Hikasa", "Haruka Tomatsu", "Sora Amamiya", "Yuichi Nakamura"], "character": ["Sayuri Muranushi (村主 さゆり)", "Hana Miyakoshi (宮越 華)", "Shiho Kamakura (鎌倉 志保)", "Daisuke Higashida (東田 大輔)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68070   Expand WWW.WORKING!!   (2016) User Score  Play Trailer Overview Daisuke Higashida gets a job at a restaurant because of family financial difficulties, but no one who works there is normal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Youko Hikasa Sayuri Muranushi (村主 さゆり) Haruka Tomatsu Hana Miyakoshi (宮越 華) Sora Amamiya Shiho Kamakura (鎌倉 志保) Yuichi Nakamura Daisuke Higashida (東田 大輔) Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of WWW.WORKING!! premiered on October  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on WWW.WORKING!!. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://working-www.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 26 ioneakatzuki 12 Elizabeth Jennings C 9 Chintaran 8 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}