{"link": "https://www.themoviedb.org/tv/60574?language=en", "title": "Peaky Blinders", "resume": "A gangster family epic set in 1919 Birmingham, England and centered on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby, who means to move up in the world.", "rate": 82, "genre": ["Drama", "Crime"], "cast": ["Cillian Murphy", "Paul Anderson", "Joe Cole", "Helen McCrory", "Jordan Bolger"], "character": ["Tommy Shelby", "Arthur Shelby", "John Shelby", "Polly Gray", "Isaiah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60574   Expand Peaky Blinders   (2013) User Score  Play Trailer Overview A gangster family epic set in 1919 Birmingham, England and centered on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby, who means to move up in the world. Featured Crew Steven Knight Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  19 Posters  17 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cillian Murphy Tommy Shelby Paul Anderson Arthur Shelby Joe Cole John Shelby Helen McCrory Polly Gray Jordan Bolger Isaiah Full Cast & Crew Current Season Series 4 2017 | 6 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Awesome show! Waiting for Season 4. Open 1 by  lmao7 I started watching this for Tom Hardy's performance Open 5 by  lmao7 Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  17 Recommendations   2015-08-28 Narcos 8.0    2010-09-19 Boardwalk Empire 7.7    2013-02-01 House of Cards 8.2    2014-04-15 Fargo 8.2    2013-01-11 Banshee 7.9    2010-05-04 Luther 7.9    2007-07-19 Mad Men 8.0    2014-08-08 The Knick 7.5  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b045fz8r Genres Drama Crime Keywords england gypsy world war i gangster outlaw drugs horse racing illegal gambling historical drama 1910s birmingham Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings 33 Travis Bell 17 Banana 13 Bendik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}