{"link": "https://www.themoviedb.org/tv/76075?language=en", "title": "Laid-Back Camp", "resume": "While the perfect getaway for most girls her age might be a fancy vacation with their loved ones, Rin Shima's ideal way of spending her days off is camping alone at the base of Mount Fuji. From pitching her tent to gathering firewood, she has always done everything by herself, and has no plans of leaving her little solitary world.\nHowever, what starts off as one of Rin's usual camping sessions somehow ends up as a surprise get-together for two when the lost Nadeshiko Kagamihara is forced to take refuge at her campsite. Originally intending to see the picturesque view of Mount Fuji for herself, Nadeshiko's plans are disrupted when she ends up falling asleep partway to her destination. Alone and with no other choice, she seeks help from the only other person nearby. Despite their hasty introductions, the two girls nevertheless enjoy the chilly night together, eating ramen and conversing while the campfire keeps them warm. And even after Nadeshiko's sister finally picks her up later that night, both girls silently ponder the possibility of another camping trip together.", "rate": 84, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76075   Expand Laid-Back Camp   (2018) User Score  Play Trailer Overview While the perfect getaway for most girls her age might be a fancy vacation with their loved ones, Rin Shima's ideal way of spending her days off is camping alone at the base of Mount Fuji. From pitching her tent to gathering firewood, she has always done everything by herself, and has no plans of leaving her little solitary world. However, what starts off as one of Rin's usual camping sessions somehow ends up as a surprise get-together for two when the lost Nadeshiko Kagamihara is forced to take refuge at her campsite. Originally intending to see the picturesque view of Mount Fuji for herself, Nadeshiko's plans are disrupted when she ends up falling asleep partway to her destination. Alone and with no other choice, she seeks help from the only other person nearby. Despite their hasty introductions, the two girls nevertheless enjoy the chilly night together, eating ramen and conversing while the campfire keeps them warm. And even after Nadeshiko's sister finally picks her up later that night, both girls silently ponder the possibility of another camping trip together. Featured Crew Yoshiaki Kyougoku Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Laid-Back Camp premiered on January  3, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Laid-Back Camp. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2018-01-07 Mitsuboshi Colors 8.0    2018-01-04 Ms. Koizumi Loves Ramen Noodles 7.7    2018-01-12 Hakata Tonkotsu Ramens 8.3    2018-01-12 Beatless 6.0    2018-01-05 Devilman: Crybaby 7.6    2014-10-05 The Seven Deadly Sins 7.9  Facts Original Name  ゆるキャン△ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://yurucamp.jp/ Genres Animation Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors C 12 Chintaran 10 sp1ti 8 Despair-Paradise 5 sekaidown04  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}