{"link": "https://www.themoviedb.org/tv/19141?language=en", "title": "Worzel Gummidge", "resume": "Worzel Gummidge is a children's comedy series, produced by Southern Television for ITV, based on the books by Barbara Euphan Todd. Starting in 1979, the programme starred Jon Pertwee in the title role and ran for four series in the UK until 1981. Channel 4 reprised the show in 1987 as Worzel Gummidge Down Under, which was set in New Zealand.", "rate": 60, "genre": ["Comedy"], "cast": ["Geoffrey Bayldon", "Barbara Windsor", "Bill Maynard", "Lorraine Chase", "Una Stubbs"], "character": ["Saucy Nancy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19141   Expand Worzel Gummidge   (1979) User Score Overview Worzel Gummidge is a children's comedy series, produced by Southern Television for ITV, based on the books by Barbara Euphan Todd. Starting in 1979, the programme starred Jon Pertwee in the title role and ran for four series in the UK until 1981. Channel 4 reprised the show in 1987 as Worzel Gummidge Down Under, which was set in New Zealand. Featured Crew Keith Waterhouse Creator Willis Hall Creator Barbara Euphan Todd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Geoffrey Bayldon Barbara Windsor Saucy Nancy Bill Maynard Lorraine Chase Una Stubbs Full Cast & Crew Last Season Season 6 1989 | 12 Episodes Season 6 of Worzel Gummidge premiered on January 29, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1986-05-01 Bread 7.4    1974-01-03 It Ain't Half Hot Mum 8.0    1998-05-08 Invasion: Earth 5.8    1979-10-29 Only When I Laugh 6.0    1961-10-12 The Morecambe & Wise Show 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords village scarecrow children british humour Content Score 93 Almost there... Top Contributors O 6 Ozbourne S 2 Samara TB 2 TMDb Bot 2 Murnau  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}