{"link": "https://www.themoviedb.org/tv/65186?language=en", "title": "Jericho", "resume": "Yesterday wilderness. Tomorrow civilisation. In the Yorkshire Dales in the 1870s, the shantytown of Jericho is the home of a community that will live, thrive and die in the shadow of the viaduct they’ve been brought together to build.", "rate": 69, "genre": ["Drama"], "cast": ["Jessica Raine", "Hans Matheson", "Clarke Peters", "Lorraine Ashbourne", "Samuel Bottomley"], "character": ["Annie Quaintain", "Johnny Jackson", "Ralph Coates", "Lace Polly", "George Quaintain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65186   Expand Jericho   (2016) User Score  Play Trailer Overview Yesterday wilderness. Tomorrow civilisation. In the Yorkshire Dales in the 1870s, the shantytown of Jericho is the home of a community that will live, thrive and die in the shadow of the viaduct they’ve been brought together to build. Featured Crew Stephen Thompson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Raine Annie Quaintain Hans Matheson Johnny Jackson Clarke Peters Ralph Coates Lorraine Ashbourne Lace Polly Samuel Bottomley George Quaintain Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Jericho premiered on January  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  5 Recommendations   2015-10-10 The Last Kingdom 7.7    2010-09-19 Boardwalk Empire 7.7    2014-08-09 Outlander 7.1  Facts Status  Cancelled Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   https://itvstudios.com/programmes/jericho Genres Drama Keywords england western period drama railroad 19th century Content Score 100 Yes! Looking good! Top Contributors z 18 zyck 16 Imzadi 11 Elizabeth Jennings 8 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}