{"link": "https://www.themoviedb.org/tv/65439?language=en", "title": "Big Order", "resume": "Ten years ago, a child wished for the destruction of the world. Now, a group of people has the ability to grant their wishes depending on their power. They are called \"Order User.\"\nBefore these great people who have the power of \"Order,\" one person excels the most with the ability to rule and conquer the world and turn people into puppets when it is in his jurisdiction. This power belongs to Hoshimiya Eiji, who is also responsible for the destructive phenomena that happened exactly ten years ago.", "rate": 44, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65439   Expand Big Order   (2016) User Score Overview Ten years ago, a child wished for the destruction of the world. Now, a group of people has the ability to grant their wishes depending on their power. They are called \"Order User.\" Before these great people who have the power of \"Order,\" one person excels the most with the ability to rule and conquer the world and turn people into puppets when it is in his jurisdiction. This power belongs to Hoshimiya Eiji, who is also responsible for the destructive phenomena that happened exactly ten years ago. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Big Order premiered on April 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2015-04-03 Food Wars!: Shokugeki no Soma 7.9    2011-04-16 Deadman Wonderland 7.1    2016-04-04 Re:ZERO -Starting Life in Another World- 7.4  Facts Original Name  ビッグオーダー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.future-diary.tv/bo/ Genres Animation Keywords based on manga shounen anime Content Score 56 We're so close, yet so far. Top Contributors 35 sp1ti 6 July z 5 zurman1 4 Motzkiste  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}