{"link": "https://www.themoviedb.org/tv/61160?language=en", "title": "The Lottery", "resume": "Set in a dystopian future when women have stopped having children, \"The Lottery\" reveals a world staring down the barrel of impending extinction. Remarkably, 100 embryos are successfully fertilized and a national lottery is held to decide the surrogates. As conflict, control and mystery over this global crisis unfolds, the government’s interests and power begin to dominate, igniting a highly controversial debate over our fundamental and personal freedom to raise a family.", "rate": 61, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Marley Shelton", "Michael Graziadei ", "Athena Karkanis", "David Alpay", "Martin Donovan"], "character": ["Dr. Alison Lennon", "Kyle Walker", "Vanessa Keller", "James", "Darius Hayes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61160   Expand The Lottery   (2014) User Score Overview Set in a dystopian future when women have stopped having children, \"The Lottery\" reveals a world staring down the barrel of impending extinction. Remarkably, 100 embryos are successfully fertilized and a national lottery is held to decide the surrogates. As conflict, control and mystery over this global crisis unfolds, the government’s interests and power begin to dominate, igniting a highly controversial debate over our fundamental and personal freedom to raise a family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marley Shelton Dr. Alison Lennon Michael Graziadei  Kyle Walker Athena Karkanis Vanessa Keller David Alpay James Martin Donovan Darius Hayes Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of The Lottery premiered on July 20, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2016-04-23 Tomorrow When the War Began 6.2    2015-02-05 Allegiance 7.2    2015-11-27 South of Hell 5.9    1995-09-22 Space: Above and Beyond 6.8    2014-03-16 Crisis 5.9    2012-03-15 Missing 4.4    2011-02-07 Outcasts 6.2    2009-03-03 The Listener 5.3  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.mylifetime.com/shows/the-lottery Genres Drama Sci-Fi & Fantasy Keywords future infertility scientist pandemic Content Score 86 Almost there... Top Contributors 32 Elizabeth Jennings 8 Banana M 6 Maxime84 z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}