{"link": "https://www.themoviedb.org/tv/42972?language=en", "title": "Lagrange: The Flower of Rin-ne", "resume": "Madoka Kyouno, a schoolgirl from Kamogawa, is the sole member of the Jersey Club and always ready to help others out. One day, she is approached by an alien named Lan from the planet Le Garite who asks her to pilot a robotic aircraft to defend mankind against an evil force.\nLagrange: The Flower of Rin-ne is a Japanese anime television series produced by Xebec and Production I.G and directed by Toshimasa Suzuki. The first season aired in Japan between January 8, 2012 and March 24, 2012 while the second season started airing between July 8, 2012 and September 23, 2012 following a recap episode on July 1, 2012. Both seasons have been licensed by Viz Media in North America and Anime on Demand in the United Kingdom. A manga accompaniment began serialization in Square-Enix's Young Gangan magazine from September 2011. A hybrid Blu-ray Disc containing an original video animation and a PlayStation 3 video game was released on August 23, 2012.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Yuichi Nakamura"], "character": ["Villagulio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42972   Expand Lagrange: The Flower of Rin-ne   (2012) User Score Overview Madoka Kyouno, a schoolgirl from Kamogawa, is the sole member of the Jersey Club and always ready to help others out. One day, she is approached by an alien named Lan from the planet Le Garite who asks her to pilot a robotic aircraft to defend mankind against an evil force. Lagrange: The Flower of Rin-ne is a Japanese anime television series produced by Xebec and Production I.G and directed by Toshimasa Suzuki. The first season aired in Japan between January 8, 2012 and March 24, 2012 while the second season started airing between July 8, 2012 and September 23, 2012 following a recap episode on July 1, 2012. Both seasons have been licensed by Viz Media in North America and Anime on Demand in the United Kingdom. A manga accompaniment began serialization in Square-Enix's Young Gangan magazine from September 2011. A hybrid Blu-ray Disc containing an original video animation and a PlayStation 3 video game was released on August 23, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuichi Nakamura Villagulio Full Cast & Crew Last Season Season 2 2012 | 12 Episodes Season 2 of Lagrange: The Flower of Rin-ne premiered on July  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Lagrange: The Flower of Rin-ne. You can help by rating TV shows you've seen. Facts Original Name  輪廻のラグランジェ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://lag-rin.com/ Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 yukoff 5 Dreamtaker m 4 magoozin 3 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}