{"link": "https://www.themoviedb.org/tv/6102?language=en", "title": "Run, Joe, Run", "resume": "Run, Joe, Run was a Saturday morning television program that aired on NBC from 1974 to 1976. It centered around Joe, a German Shepherd in the military's K-9 Corp., and his master, Sergeant Will Corey. One day, during training, Joe was falsely accused of attacking his master, a crime for which the dog would be put to sleep as punishment. However, he escaped before being killed and a $200 bounty was put on his head.\nSgt. Corey believed Joe was innocent and also pursued him, hoping to find Joe before the authorities did. While on the run, Joe helped people he encountered.\nDuring the show's second season, Sgt. Corey, having never found Joe, was called back to duty. Joe then teamed with a hiker, Josh McCoy, and continued to help others, all the while still on the run.\nThe show was considered as a cross between Lassie and The Fugitive. Like The Fugitive, and later, The Incredible Hulk, it centered around a falsely accused person running from authorities and helping out people he meets along the way. The show was produced by William P. D'Angelo Productions, who also produced the NBC young adult drama, Westwind.", "rate": 70, "genre": ["Family"], "cast": ["Arch Whiting", "Chad States"], "character": ["Sergeant Will Corey", "Josh McCoy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6102   Expand Run, Joe, Run   (1974) User Score Overview Run, Joe, Run was a Saturday morning television program that aired on NBC from 1974 to 1976. It centered around Joe, a German Shepherd in the military's K-9 Corp., and his master, Sergeant Will Corey. One day, during training, Joe was falsely accused of attacking his master, a crime for which the dog would be put to sleep as punishment. However, he escaped before being killed and a $200 bounty was put on his head. Sgt. Corey believed Joe was innocent and also pursued him, hoping to find Joe before the authorities did. While on the run, Joe helped people he encountered. During the show's second season, Sgt. Corey, having never found Joe, was called back to duty. Joe then teamed with a hiker, Josh McCoy, and continued to help others, all the while still on the run. The show was considered as a cross between Lassie and The Fugitive. Like The Fugitive, and later, The Incredible Hulk, it centered around a falsely accused person running from authorities and helping out people he meets along the way. The show was produced by William P. D'Angelo Productions, who also produced the NBC young adult drama, Westwind. Featured Crew Richard H. Landau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arch Whiting Sergeant Will Corey Chad States Josh McCoy Full Cast & Crew Last Season Season 2 1975 | 13 Episodes Season 2 of Run, Joe, Run premiered on September  6, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Run, Joe, Run. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Keywords on the run dog Content Score 50 Still needs a little work. Top Contributors 10 Banana 1 lineker 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}