{"link": "https://www.themoviedb.org/tv/7577?language=en", "title": "Doctor at Large", "resume": "Doctor at Large is a British television comedy series based on a set of books by Richard Gordon about the misadventures of a group of newly qualified doctors. The series follows directly from its predecessor Doctor in the House, and was produced by London Weekend Television in 1971.\nWriters for the Doctor at Large episodes were Bill Oddie, Graeme Garden, John Cleese, Graham Chapman, Bernard McKenna, Geoff Rowley, Andy Baker, Jonathan Lynn and David Yallop, as well as George Layton.", "rate": 70, "genre": ["Comedy"], "cast": ["Ernest Clark", "Barry Evans", "Robin Nedwell", "George Layton", "Geoffrey Davies"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7577   Expand Doctor at Large   (1971) User Score Overview Doctor at Large is a British television comedy series based on a set of books by Richard Gordon about the misadventures of a group of newly qualified doctors. The series follows directly from its predecessor Doctor in the House, and was produced by London Weekend Television in 1971. Writers for the Doctor at Large episodes were Bill Oddie, Graeme Garden, John Cleese, Graham Chapman, Bernard McKenna, Geoff Rowley, Andy Baker, Jonathan Lynn and David Yallop, as well as George Layton. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ernest Clark  Barry Evans Robin Nedwell George Layton Geoffrey Davies Full Cast & Crew Last Season Season 1 1971 | 29 Episodes Season 1 of Doctor at Large premiered on February 28, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Doctor at Large. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords doctor private practice sitcom british humour Content Score 71 Just a little bit more... Top Contributors O 5 Ozbourne 1 Banana B 1 BWYoda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}