{"link": "https://www.themoviedb.org/tv/74076?language=en", "title": "Mad Dog", "resume": "Choi Kang-Woo is a former detective, but he now works as a veteran insurance investigator. He leads a team that attempts to reveal insurance fraud cases.", "rate": 77, "genre": ["Crime"], "cast": ["Yoo Ji-tae", "Woo Do-Hwan", "Ryu Hwa-Young", "Hong Soo-hyun", "Jo Jae-yoon"], "character": ["Choi Kang-Woo", "Kim Min-Joon", "Jang Ha-Ri", "Cha Hong-Joo", "Park Soon-Jung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74076   Expand Mad Dog   (2017) User Score Overview Choi Kang-Woo is a former detective, but he now works as a veteran insurance investigator. He leads a team that attempts to reveal insurance fraud cases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Ji-tae Choi Kang-Woo Woo Do-Hwan Kim Min-Joon Ryu Hwa-Young Jang Ha-Ri Hong Soo-hyun Cha Hong-Joo Jo Jae-yoon Park Soon-Jung Full Cast & Crew Current Season Season 1 2017 | 16 Episodes Season 1 of Mad Dog premiered on October 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2017-11-11 Money Flower 8.0    2017-10-09 Witch's Court 9.3    2017-01-16 Introverted Boss 8.7    2017-09-27 While You Were Sleeping 9.0    2017-03-15 Radiant Office 6.9    2017-01-25 Chief Kim 7.5    2017-03-20 The Liar and His Lover 8.3    2017-04-17 My Secret Romance 7.6  Facts Original Name  매드 독 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/maddog/ Genres Crime Keywords korea insurance investigator Content Score 86 Almost there... Top Contributors M 41 Maria180493 6 Elizabeth Jennings 3 sansalayne s 2 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}