{"link": "https://www.themoviedb.org/tv/67673?language=en", "title": "Harley and the Davidsons", "resume": "Based on a true story, \"Harley and the Davidsons\" charts the birth of this iconic bike during a time of great social and technological change beginning at the turn of the 20th century.", "rate": 70, "genre": ["Drama"], "cast": ["Bug Hall", "Michiel Huisman", "Robert Aramayo", "Alex Felton", "Essa O'Shea"], "character": ["Arthur Davidson", "Walter Davidson", "Bill Harley", "Jones", "Clara Beisel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67673   Expand Harley and the Davidsons   (2016) User Score  Play Trailer Overview Based on a true story, \"Harley and the Davidsons\" charts the birth of this iconic bike during a time of great social and technological change beginning at the turn of the 20th century. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bug Hall Arthur Davidson Michiel Huisman Walter Davidson Robert Aramayo Bill Harley Alex Felton Jones Essa O'Shea Clara Beisel Full Cast & Crew Last Season Season 1 2016 | 3 Episodes Season 1 of Harley and the Davidsons premiered on September  4, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Harley and the Davidsons. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Harley and the Davidsons. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  80m Homepage   https://www.discovery.com/tv-shows/harley-and-the-davidsons/ Genres Drama Keywords harley davidson miniseries motorcycle 20th century Content Score 93 Almost there... Top Contributors TB 38 TMDb Bot p 23 plumpro R 18 Rebecca 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}