{"link": "https://www.themoviedb.org/tv/52?language=en", "title": "That '70s Show", "resume": "Crank up the 8-track and flash back to a time when platform shoes and puka shells were all the rage in this hilarious retro-sitcom. For Eric, Kelso, Jackie, Hyde, Donna and Fez, a group of high school teens who spend most of their time hanging out in Eric’s basement, life in the ‘70s isn’t always so groovy. But between trying to figure out the meaning of life, avoiding their parents, and dealing with out-of-control hormones, they’ve learned one thing for sure: they’ll always get by with a little help from their friends.", "rate": 75, "genre": ["Comedy"], "cast": ["Topher Grace", "Laura Prepon", "Mila Kunis", "Danny Masterson", "Ashton Kutcher"], "character": ["Eric Forman", "Donna Pinciotti", "Jackie Burkhart", "Steven Hyde", "Michael Kelso"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52   Expand That '70s Show   (1998) User Score  Play Trailer Overview Crank up the 8-track and flash back to a time when platform shoes and puka shells were all the rage in this hilarious retro-sitcom. For Eric, Kelso, Jackie, Hyde, Donna and Fez, a group of high school teens who spend most of their time hanging out in Eric’s basement, life in the ‘70s isn’t always so groovy. But between trying to figure out the meaning of life, avoiding their parents, and dealing with out-of-control hormones, they’ve learned one thing for sure: they’ll always get by with a little help from their friends. Featured Crew Mark Brazill Creator Terry Turner Creator Bonnie Turner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  8 Images Backdrops  54 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Topher Grace Eric Forman Laura Prepon Donna Pinciotti Mila Kunis Jackie Burkhart Danny Masterson Steven Hyde Ashton Kutcher Michael Kelso Full Cast & Crew Last Season Season 8 2005 | 22 Episodes View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply g Show quietly lasted 8 seasons Open 0 by gspgreases\n      \n     w Favorite character Open 4 by  gspgreases Eric gay? Open 2 by  That 70'sMovieGuy Go to Discussions Media Most Popular Videos  1 Backdrops  54 Posters  13 Recommendations   1990-09-10 The Fresh Prince of Bel-Air 7.3    2000-01-09 Malcolm in the Middle 7.5    1996-09-13 Everybody Loves Raymond 6.3    1996-01-09 3rd Rock from the Sun 7.3    1989-07-05 Seinfeld 8.2    1998-09-21 The King of Queens 6.7    1993-09-16 Frasier 7.7    2005-09-20 My Name Is Earl 7.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m, 24m, 45m Homepage   http://www.that70sshow.com/ Genres Comedy Keywords self-discovery 1970s cannabis retro teenage romance sitcom Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 21 Banana R 14 Rochus 12 hpcodecraft  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}