{"link": "https://www.themoviedb.org/tv/63002?language=en", "title": "Geeks Who Drink", "resume": "Two teams of self-proclaimed \"trivia geeks\" battle it out in rapid-fire quizzes that cover topics from pop culture to science fiction.  Each team consists of three players – a celebrity team captain and two trivia pros.  After three rounds of raucous game-play and (mostly) friendly competition, the winning team will earn bragging rights, a spot on the Geeks Who Drink leader-board and a bevy of prizes to geek out over.", "rate": 0, "genre": [], "cast": ["Zachary Levi"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63002   Expand Geeks Who Drink   (2015) User Score Overview Two teams of self-proclaimed \"trivia geeks\" battle it out in rapid-fire quizzes that cover topics from pop culture to science fiction.  Each team consists of three players – a celebrity team captain and two trivia pros.  After three rounds of raucous game-play and (mostly) friendly competition, the winning team will earn bragging rights, a spot on the Geeks Who Drink leader-board and a bevy of prizes to geek out over. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zachary Levi Himself - Host Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of Geeks Who Drink premiered on July 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Geeks Who Drink. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  23m Homepage   http://www.syfy.com/geekswhodrink Genres No genres have been added. Keywords game show geek drinking trivia Content Score 50 Still needs a little work. Top Contributors 24 Elizabeth Jennings LC 8 Legit Corporation TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}