{"link": "https://www.themoviedb.org/tv/4406?language=en", "title": "The Simple Life", "resume": "The Simple Life is an American reality television series. The series aired from December 2, 2003 to August 5, 2007. The first three seasons aired on Fox, and the final two on E!. The series depicts two wealthy socialites, Paris Hilton and Nicole Richie, as they struggle to do manual, low-paying jobs such as cleaning rooms, farm work, serving meals in fast-food restaurants and working as camp counselors.", "rate": 19, "genre": ["Reality", "Comedy"], "cast": ["Nicole Richie", "Paris Hilton"], "character": ["Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4406   Expand The Simple Life   (2003) User Score Overview The Simple Life is an American reality television series. The series aired from December 2, 2003 to August 5, 2007. The first three seasons aired on Fox, and the final two on E!. The series depicts two wealthy socialites, Paris Hilton and Nicole Richie, as they struggle to do manual, low-paying jobs such as cleaning rooms, farm work, serving meals in fast-food restaurants and working as camp counselors. Featured Crew Mary-Ellis Bunim Creator Jonathan Murray Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicole Richie Herself Paris Hilton Herself Full Cast & Crew Last Season Season 5 2007 | 10 Episodes Season 5 of The Simple Life premiered on May 28, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   2007-03-20 The Whitest Kids U' Know 7.9    2009-01-27 Toddlers & Tiaras 1.1  Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  20m, 30m Homepage  - Genres Reality Comedy Keywords blonde job wealthy fish out of water simpler life Content Score 64 We're so close, yet so far. Top Contributors 19 Banana b 5 bBop87 w 3 webmaster 2 Rug  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}