{"link": "https://www.themoviedb.org/tv/3965?language=en", "title": "My Boys", "resume": "My Boys is an American television sitcom that debuted on November 28, 2006, on TBS. The show deals with a female sports columnist in Chicago, Illinois and the men in her life including her brother and her best friend. The show was canceled by TBS on September 14, 2010, making the fourth season finale, broadcast two days prior, the series finale.", "rate": 20, "genre": ["Comedy"], "cast": ["Jordana Spiro", "Kyle Howard", "Reid Scott", "Michael Bunin", "Jamie Kaler"], "character": ["P.J. Franklin", "Bobby Newman", "Brendan Dorff", "Kenny Moritorri", "Mike Callahan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3965   Expand My Boys   (2006) User Score  Play Trailer Overview My Boys is an American television sitcom that debuted on November 28, 2006, on TBS. The show deals with a female sports columnist in Chicago, Illinois and the men in her life including her brother and her best friend. The show was canceled by TBS on September 14, 2010, making the fourth season finale, broadcast two days prior, the series finale. Featured Crew Betsy Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jordana Spiro P.J. Franklin Kyle Howard Bobby Newman Reid Scott Brendan Dorff Michael Bunin Kenny Moritorri Jamie Kaler Mike Callahan Full Cast & Crew Last Season Season 4 2010 | 9 Episodes Season 4 of My Boys premiered on July 25, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Boys. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.tbs.com/shows/myboys/ Genres Comedy Keywords tomboy sportswriter Content Score 100 Yes! Looking good! Top Contributors 36 United600 5 Amanda s 5 speedycars 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}