{"link": "https://www.themoviedb.org/tv/69286?language=en", "title": "Hand Shakers", "resume": "The anime takes place in Osaka in \"AD20XX,\" and revolves around the Hand Shakers—partners who can summon \"Nimrodes,\" weapons born from their deep psyche by joining hands. In order to grant the pair's wish, the Hand Shakers compete with and fight other Hand Shaker pairs. The top pair will then meet and challenge \"God.\"\n\"They, the receivers of the Revelation of Babel. They, the challengers to God.\nThey, who inevitably throw themselves into battle with their partners. What does God want from them?\nAnd did they want powers exceeding that of Gods? The chosen ones, their souls linked,\njoin hand and hand for the Ziggurat where the fighting shall ensue.\"", "rate": 67, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69286   Expand Hand Shakers   (2017) User Score Overview The anime takes place in Osaka in \"AD20XX,\" and revolves around the Hand Shakers—partners who can summon \"Nimrodes,\" weapons born from their deep psyche by joining hands. In order to grant the pair's wish, the Hand Shakers compete with and fight other Hand Shaker pairs. The top pair will then meet and challenge \"God.\" \"They, the receivers of the Revelation of Babel. They, the challengers to God. They, who inevitably throw themselves into battle with their partners. What does God want from them? And did they want powers exceeding that of Gods? The chosen ones, their souls linked, join hand and hand for the Ziggurat where the fighting shall ensue.\" Featured Crew Shingo Suzuki Creator Kanazawa Hiromichi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Hand Shakers premiered on January 11, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Hand Shakers. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2015-01-04 Absolute Duo 7.6    2017-04-06 Clockwork Planet 6.1    2016-01-08 Divine Gate 5.3    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0    2017-07-12 My First Girlfriend is a Gal 7.4    2017-04-01 The Silver Guardian 6.4    2015-10-03 Chivalry of a Failed Knight 7.9    2017-07-04 Tsuredure Children 8.0  Facts Original Name  ハンドシェイカー Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.project-hs.net/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords anime Content Score 64 We're so close, yet so far. Top Contributors 17 sp1ti Z 17 Zayrus z 15 zurman1 8 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}