{"link": "https://www.themoviedb.org/tv/48068?language=en", "title": "Przyjaciółki", "resume": "Four thirty-something women who met in highschool continue to maintain a strong friendship despite the passing of time. Although very different, they also have much in common, each earnestly trying to find themselves and their place in the world.", "rate": 0, "genre": ["Drama"], "cast": ["Małgorzata Socha", "Joanna Liszowska", "Anita Sokołowska", "Bartek Kasprzykowski"], "character": ["Inga Gruszewska", "Partycja Kochan", "Zuzanna Markiewicz", "Paweł, Anna's husband"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48068   Expand Przyjaciółki   (2012) User Score Overview Four thirty-something women who met in highschool continue to maintain a strong friendship despite the passing of time. Although very different, they also have much in common, each earnestly trying to find themselves and their place in the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Małgorzata Socha Inga Gruszewska Joanna Liszowska Partycja Kochan Anita Sokołowska Zuzanna Markiewicz Bartek Kasprzykowski Paweł, Anna's husband Full Cast & Crew Current Season Season 11 2018 | 12 Episodes Season 11 of Przyjaciółki premiered on March  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Przyjaciółki. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Polish Runtime  45m Homepage   http://www.przyjaciolki.polsat.pl/ Genres Drama Keywords poland Content Score 86 Almost there... Top Contributors s 37 sheva_vitali g 12 grand24 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}