{"link": "https://www.themoviedb.org/tv/14210?language=en", "title": "Polizeiruf 110", "resume": "Polizeiruf 110 is a long-running German language detective television series. The first episode was broadcast 27 June 1971 in the German Democratic Republic, and after the dissolution of Fernsehen der DDR the series was picked up by ARD. It was originally created as a counterpart to the West German series Tatort, and quickly became a public favorite.\nIn contrast with other television crime series, in which killings are practically the primary focus, while Tatort handled homicide cases, the cases handled in the GDR TV's Polizeiruf were more often the more frequent, and less serious, crimes such as domestic violence, extortion, fraud, theft and juvenile delinquency, as well as alcoholism, child abuse and rape. Contrary to Tatort, which concentrated on the primary characters and their private lives, police procedure was the center of attention of Polizeiruf, especially in the earlier episodes. The scriptwriters attached particular importance to representation of the criminal and his state of mind, as well as the context of the crime. Many episodes aimed to teach and enlighten the audience about what does and what doesn't constitute appropriate behaviour and appropriate thought, rather than just to entertain. Polizeiruf was one of the few broadcasts by GDR media in which the real problems and difficulties of the supposedly more advanced socialist society could be displayed and discussed to some extent, albeit in a fictionalized and pedagogicalized environment.", "rate": 52, "genre": ["Crime"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14210   Expand Polizeiruf 110   (1971) User Score Overview Polizeiruf 110 is a long-running German language detective television series. The first episode was broadcast 27 June 1971 in the German Democratic Republic, and after the dissolution of Fernsehen der DDR the series was picked up by ARD. It was originally created as a counterpart to the West German series Tatort, and quickly became a public favorite. In contrast with other television crime series, in which killings are practically the primary focus, while Tatort handled homicide cases, the cases handled in the GDR TV's Polizeiruf were more often the more frequent, and less serious, crimes such as domestic violence, extortion, fraud, theft and juvenile delinquency, as well as alcoholism, child abuse and rape. Contrary to Tatort, which concentrated on the primary characters and their private lives, police procedure was the center of attention of Polizeiruf, especially in the earlier episodes. The scriptwriters attached particular importance to representation of the criminal and his state of mind, as well as the context of the crime. Many episodes aimed to teach and enlighten the audience about what does and what doesn't constitute appropriate behaviour and appropriate thought, rather than just to entertain. Polizeiruf was one of the few broadcasts by GDR media in which the real problems and difficulties of the supposedly more advanced socialist society could be displayed and discussed to some extent, albeit in a fictionalized and pedagogicalized environment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 47 2018 | 3 Episodes Season 47 of Polizeiruf 110 premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Polizeiruf 110. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Polizeiruf 110. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  90m Homepage   http://www.daserste.de/unterhaltung/krimi/polizeiruf-110 Genres Crime Keywords police crime police detective crime investigation Content Score 56 We're so close, yet so far. Top Contributors L 939 Lysator S 99 Samara V 40 VanDeGart 35 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}