{"link": "https://www.themoviedb.org/tv/47144?language=en", "title": "Jo", "resume": "Jo is an English-language French police procedural television series created by Canadian/USA screenwriter René Balcer of Law & Order fame with French writing team Franck Ollivier & Malina Detcheva, known for the mini-series Lost Signs. It is co-produced by the French Atlantique Productions and the Belgian Stromboli Pictures companies in association with broadcast partners TF1, RTBF, Sat.1, ORF and RTS.", "rate": 63, "genre": ["Action", "Adventure", "Crime"], "cast": ["Jean Reno", "Jill Hennessy", "Tom Austen", "Orla Brady", "Heida Reed"], "character": ["Jo St-Clair", "Karyn", "Bayard", "Dormont", "Adele"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47144   Expand Jo   (2013) User Score  Play Trailer Overview Jo is an English-language French police procedural television series created by Canadian/USA screenwriter René Balcer of Law & Order fame with French writing team Franck Ollivier & Malina Detcheva, known for the mini-series Lost Signs. It is co-produced by the French Atlantique Productions and the Belgian Stromboli Pictures companies in association with broadcast partners TF1, RTBF, Sat.1, ORF and RTS. Featured Crew René Balcer Creator Klaus Zimmermann Creator Olivier Bibas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jean Reno Jo St-Clair Jill Hennessy Karyn Tom Austen Bayard Orla Brady Dormont Heida Reed Adele Full Cast & Crew Last Season Season 1 2013 | 8 Episodes Season 1 of Jo premiered on January 17, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Jo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Action & Adventure Crime Keywords paris murder investigation Content Score 100 Yes! Looking good! Top Contributors t 40 tinu88 28 Banana t 27 tmdb45070722 10 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}