{"link": "https://www.themoviedb.org/tv/63785?language=en", "title": "Love Cells", "resume": "A fantasy, romantic comedy about a ′love cell′ cat that looks like a human, Navi teaching love to Ma Dae Choong, who is determined to revive his dying love cells with an extraordinary romance, particularly with top star, Seo Rin.", "rate": 61, "genre": ["Comedy"], "cast": ["Kim Yoo-jung", "Im Seul-ong", "Jo Bo-Ah"], "character": ["Navi", "Park Tae-joon", "Ye Bom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63785   Expand Love Cells   (2014) User Score Overview A fantasy, romantic comedy about a ′love cell′ cat that looks like a human, Navi teaching love to Ma Dae Choong, who is determined to revive his dying love cells with an extraordinary romance, particularly with top star, Seo Rin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Yoo-jung Navi Im Seul-ong Park Tae-joon Jo Bo-Ah Ye Bom Full Cast & Crew Last Season Season 2 2015 | 8 Episodes Season 2 of Love Cells premiered on September 14, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2016-03-21 72 Dangerous Places to Live 6.0    2011-08-08 Birdie Buddy 7.7    2017-09-04 Argon 6.8    2008-03-16 Fated to Love You 7.3    2016-11-21 White Nights 8.0    2016-03-23 Click your Heart 7.0  Facts Original Name  연애세포 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  7m Homepage   http://tvcast.naver.com/lovecell Genres Comedy Keywords korea Content Score 56 We're so close, yet so far. Top Contributors t 45 tmdb38202327 M 8 Maria180493 5 Elizabeth Jennings s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}