{"link": "https://www.themoviedb.org/tv/72312?language=en", "title": "White Deer Plain", "resume": "Set in the eponymous White Deer Village in Shaanxi Province where the two most important families – Bai and Lu – and their sons have always lived together in peace. But the turmoil leads to a fierce struggle for land ownership. A young woman new to the village soon finds herself caught between the two camps. Director Liu Jin uses the story of these two families as a metaphor for the fate of the Chinese people as first Chinese war lords are overrun by Japanese invaders, then civil war follows hot on the heels of the Second World War and finally the victorious Maoists begin waving their red flags. The drama is based off the novel by Chen Zhong Shi.", "rate": 0, "genre": ["War", "Politics", "Drama"], "cast": ["Zhang Jiayi", "He Bing", "Qin Hailu", "Liu Peiqi", "Hongtao Li"], "character": ["Bai Jiaxuan", "Lu Zilin", "Xian Cao", "Zhu Xiansheng", "Lu San"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72312   Expand White Deer Plain   (2017) User Score Overview Set in the eponymous White Deer Village in Shaanxi Province where the two most important families – Bai and Lu – and their sons have always lived together in peace. But the turmoil leads to a fierce struggle for land ownership. A young woman new to the village soon finds herself caught between the two camps. Director Liu Jin uses the story of these two families as a metaphor for the fate of the Chinese people as first Chinese war lords are overrun by Japanese invaders, then civil war follows hot on the heels of the Second World War and finally the victorious Maoists begin waving their red flags. The drama is based off the novel by Chen Zhong Shi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhang Jiayi Bai Jiaxuan He Bing Lu Zilin Qin Hailu Xian Cao Liu Peiqi Zhu Xiansheng Hongtao Li Lu San Full Cast & Crew Last Season Season 1 2017 | 77 Episodes Season 1 of White Deer Plain premiered on April 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on White Deer Plain. You can help by rating TV shows you've seen. Facts Original Name  白鹿原 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres War & Politics Drama Keywords war historical Content Score 86 Almost there... Top Contributors 33 tcx4c70 j 22 jklmo 3 Banana M 2 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}