{"link": "https://www.themoviedb.org/tv/71129?language=en", "title": "Prisoners", "resume": "After a lifetime of mistakes, Linda is sent to serve time in Iceland’s only women’s prison for a vicious assault that leaves her father in a coma. But no-one knows that she harbours a dark secret that could tear her family apart, a secret that could set her free.", "rate": 70, "genre": ["Drama", "Mystery"], "cast": ["Kristín Þóra Haraldsdóttir", "Nína Dögg Filippusdóttir", "Halldóra Geirharðsdóttir", "Kristbjörg Kjeld", "Unnur Ösp Stefánsdóttir"], "character": ["Eyja María", "Ragga", "Valgerður", "Herdís", "Brynja"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71129   Expand Prisoners   (2017) User Score  Play Trailer Overview After a lifetime of mistakes, Linda is sent to serve time in Iceland’s only women’s prison for a vicious assault that leaves her father in a coma. But no-one knows that she harbours a dark secret that could tear her family apart, a secret that could set her free. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristín Þóra Haraldsdóttir Eyja María Nína Dögg Filippusdóttir Ragga Halldóra Geirharðsdóttir Valgerður Kristbjörg Kjeld Herdís Unnur Ösp Stefánsdóttir Brynja Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Prisoners premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Prisoners. You can help by rating TV shows you've seen. Facts Original Name  Fangar Status  Returning Series Network Certification  - Type  Scripted Original Language  Icelandic Runtime  45m Homepage  - Genres Drama Mystery Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors g 31 gardar jp 7 juan perez 4 Elizabeth Jennings d 4 duss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}