{"link": "https://www.themoviedb.org/tv/68342?language=en", "title": "When a Snail Falls in Love", "resume": "Detective Ji Bai and new criminal profiler Xu Xu may seem like an awkward teacher-student pair at first glance, yet they are actually the best partners in the police force, solving one crime after another. Ji Bai slowly falls in love with Xu Xu, yet she is a girl who is as slow as a snail when it comes to love. Just as Xu Xu starts to reciprocate Ji Bai's feelings, the dormant \"Angel's Killer\" reappears.", "rate": 74, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Nick Wang", "Wang Zi Wen", "Zhang Xiao Qian"], "character": ["Ji Bai", "Xu Xu", "Yang Yu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68342   Expand When a Snail Falls in Love   (2016) User Score Overview Detective Ji Bai and new criminal profiler Xu Xu may seem like an awkward teacher-student pair at first glance, yet they are actually the best partners in the police force, solving one crime after another. Ji Bai slowly falls in love with Xu Xu, yet she is a girl who is as slow as a snail when it comes to love. Just as Xu Xu starts to reciprocate Ji Bai's feelings, the dormant \"Angel's Killer\" reappears. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Wang Ji Bai Wang Zi Wen Xu Xu Zhang Xiao Qian Yang Yu Full Cast & Crew Last Season Season 1 2016 | 21 Episodes Season 1 of When a Snail Falls in Love premiered on October 24, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2014-10-13 Tomorrow's Cantabile 7.3    2015-07-22 Diamond Lover 6.9    2016-03-06 Refresh Man 7.0  Facts Original Name  如果蜗牛有爱情 Status  Ended Networks QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  35m Homepage  - Genres Crime Drama Mystery Keywords romance Content Score 56 We're so close, yet so far. Top Contributors M 38 Maria180493 t 10 taxigps 7 Elizabeth Jennings 3 galactica_j  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}