{"link": "https://www.themoviedb.org/tv/56304?language=en", "title": "The Men Who Built America", "resume": "Influential builders, dreamers and believers whose feats transformed the United States, a nation decaying from the inside after the Civil War, into the greatest economic and technological superpower the world had ever seen. The Men Who Built America is the story of a nation at the crossroads and of the people who catapulted it to prosperity.", "rate": 68, "genre": ["Documentary"], "cast": ["Tim Getman", "Michael Chmiel", "David Donahoe", "Ray Reynolds", "Eric Rolland"], "character": ["John D. Rockefeller", "William Vanderbilt", "Cornelius Vanderbilt", "J.P. Morgan (The Elder)", "J.P Morgan (The Younger)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56304   Expand The Men Who Built America   (2012) User Score  Play Trailer Overview Influential builders, dreamers and believers whose feats transformed the United States, a nation decaying from the inside after the Civil War, into the greatest economic and technological superpower the world had ever seen. The Men Who Built America is the story of a nation at the crossroads and of the people who catapulted it to prosperity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Getman John D. Rockefeller Michael Chmiel William Vanderbilt David Donahoe Cornelius Vanderbilt Ray Reynolds J.P. Morgan (The Elder) Eric Rolland J.P Morgan (The Younger) Full Cast & Crew Last Season Season 1 2012 | 4 Episodes Season 1 of The Men Who Built America premiered on October 16, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Men Who Built America. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2007-11-01 Gangland 5.7    2010-12-01 Storage Wars 5.3    2011-01-19 Restaurant: Impossible 5.7    2010-03-07 Wonders of the Solar System 7.6    2011-03-06 Wonders of the Universe 8.2    1999-01-10 The PJs 7.4    1972-09-08 Are You Being Served? 7.0    2014-01-20 Klondike 6.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Documentary Keywords biography history Content Score 93 Almost there... Top Contributors 16 RubG i 13 ionionescu 13 Claudio 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}