{"link": "https://www.themoviedb.org/tv/76179?language=en", "title": "Next of Kin", "resume": "Whip-smart general practitioner Dr. Mona Harcourt lives in London with her political lobbyist husband Guy and her family. When a bomb goes off in London on the same day that her brother, Dr. Kareem Shirani, is abducted in Pakistan, Mona's charmed life is shaken to its core.", "rate": 50, "genre": ["Drama"], "cast": ["Archie Panjabi", "Jack Davenport", "Shabana Azmi", "Navin Chowdhry", "Enzo Cilenti"], "character": ["Dr. Mona Harcourt", "Guy Harcourt", "Mrs. Shirani", "Dr. Kareem Shirani", "DS Joe Townsend"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76179   Expand Next of Kin   (2018) User Score  Play Trailer Overview Whip-smart general practitioner Dr. Mona Harcourt lives in London with her political lobbyist husband Guy and her family. When a bomb goes off in London on the same day that her brother, Dr. Kareem Shirani, is abducted in Pakistan, Mona's charmed life is shaken to its core. Featured Crew Natasha Narayan Creator Paul Rutman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Archie Panjabi Dr. Mona Harcourt Jack Davenport Guy Harcourt Shabana Azmi Mrs. Shirani Navin Chowdhry Dr. Kareem Shirani Enzo Cilenti DS Joe Townsend Full Cast & Crew Current Season Season 1 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Next of Kin. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.mammothscreen.com/mammoth-productions/next-of-kin Genres Drama Keywords kidnapping family relationships marriage problems police surveillance terrorist bombing female doctor counter terrorism brother sister relationship Content Score 100 Yes! Looking good! Top Contributors 116 janar t 14 thehww 6 Elizabeth Jennings 4 Warpath  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}