{"link": "https://www.themoviedb.org/tv/63726?language=en", "title": "Alone", "resume": "Hardcore survivalists are put by themselves in the Vancouver Island wilderness, without camera crews, teams, or producers – on a single mission to stay alive for as long as possible.", "rate": 71, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63726   Expand Alone   (2015) User Score  Play Trailer Overview Hardcore survivalists are put by themselves in the Vancouver Island wilderness, without camera crews, teams, or producers – on a single mission to stay alive for as long as possible. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 5 2018 | 3 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Carleigh Open 0 by cursethedarkness\n      \n     Any Fans Lurking? Open 2 by  laceystew S1-S4: Favorite Players and Things! Open 0 by Daddie0\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2002-03-03 Jeremiah 7.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Reality Original Language  English Runtime  44m Homepage   http://www.history.com/shows/alone Genres Reality Keywords wilderness survival Content Score 64 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings r 6 reza_rizqi TB 6 TMDb Bot 6 Goffred0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}