{"link": "https://www.themoviedb.org/tv/10077?language=en", "title": "Schoolhouse Rock", "resume": "Schoolhouse Rock! is an American interstitial programming series of animated musical educational short films that aired during the Saturday morning children's programming on the U.S. television network ABC. The topics covered included grammar, science, economics, history, mathematics, and civics. The series' original run lasted from 1973 to 1985, and was later revived with both old and new episodes airing from 1993 to 1999. Additional episodes were produced as recently as 2009 for direct-to-video release.", "rate": 82, "genre": ["Animation"], "cast": ["Jack Sheldon", "Bob Dorough", "Lynn Ahrens", "Blossom Dearie", "Essra Mohawk"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10077   Expand Schoolhouse Rock   (1973) User Score Overview Schoolhouse Rock! is an American interstitial programming series of animated musical educational short films that aired during the Saturday morning children's programming on the U.S. television network ABC. The topics covered included grammar, science, economics, history, mathematics, and civics. The series' original run lasted from 1973 to 1985, and was later revived with both old and new episodes airing from 1993 to 1999. Additional episodes were produced as recently as 2009 for direct-to-video release. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Sheldon Bob Dorough Lynn Ahrens Blossom Dearie Essra Mohawk Full Cast & Crew Last Season Earth Rock 2008 | 12 Episodes Season 7 of Schoolhouse Rock premiered on December 31, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1980-11-11 Too Close for Comfort 7.1    1986-09-13 Pee-wee's Playhouse 7.9    1976-01-27 Laverne & Shirley 6.7    1990-04-15 In Living Color 7.5    1980-11-27 Bosom Buddies 6.6    1970-09-24 The Odd Couple 7.1    1988-11-14 Murphy Brown 6.5    1975-01-18 The Jeffersons 6.7  Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  3m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 8 tmdb74402987 D 5 Doramius d 1 daboodah  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}