{"link": "https://www.themoviedb.org/tv/4063?language=en", "title": "Square One Television", "resume": "Square One Television is an American children's television program produced by the Children's Television Workshop to teach mathematics and abstract mathematical concepts to young viewers.\nCreated and broadcast by PBS in the United States from January 26, 1987 to November 6, 1992, the show was intended to address the math crisis among American schoolchildren. After the last episode aired, the show went into reruns until May 6, 1994. The show was revived for the 1995–1996 PBS season as a teacher instruction program, Square One TV Math Talk.\nSquare One was also shown on the U.S. cable television channel Noggin in syndication beginning in 1999, but was removed from its lineup along with other Sesame Workshop shows on May 26, 2003.", "rate": 0, "genre": [], "cast": ["Larry Cedar", "Cynthia Darlow", "Reg E. Cathey", "Joe Howard", "Beverly Leech"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4063   Expand Square One Television   (1987) User Score Overview Square One Television is an American children's television program produced by the Children's Television Workshop to teach mathematics and abstract mathematical concepts to young viewers. Created and broadcast by PBS in the United States from January 26, 1987 to November 6, 1992, the show was intended to address the math crisis among American schoolchildren. After the last episode aired, the show went into reruns until May 6, 1994. The show was revived for the 1995–1996 PBS season as a teacher instruction program, Square One TV Math Talk. Square One was also shown on the U.S. cable television channel Noggin in syndication beginning in 1999, but was removed from its lineup along with other Sesame Workshop shows on May 26, 2003. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry Cedar Cynthia Darlow Reg E. Cathey Joe Howard Beverly Leech Full Cast & Crew Last Season Square one tv season 5 1992 | 35 Episodes Season 5 of Square One Television premiered on September 21, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Square One Television. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.sesameworkshop.org/programs/square_one_tv Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}