{"link": "https://www.themoviedb.org/tv/35006?language=en", "title": "Bill & Ted's Excellent Adventures", "resume": "Bill & Ted's Excellent Adventures is a 1990 spin-off animated television series following the misadventures of two time-travelling slackers as they travel into the distant past and future. It was based on the 1989 film, Bill & Ted's Excellent Adventure and is part of the Bill & Ted franchise.", "rate": 57, "genre": ["Animation", "Comedy"], "cast": ["Evan Richards", "Christopher Kennedy", "Tara Strong", "Rick Overton"], "character": ["Bill S. Preston (voice)", "Ted Logan (voice)", "Mary Jane (voice)", "Rufus (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35006   Expand Bill & Ted's Excellent Adventures   (1990) User Score Overview Bill & Ted's Excellent Adventures is a 1990 spin-off animated television series following the misadventures of two time-travelling slackers as they travel into the distant past and future. It was based on the 1989 film, Bill & Ted's Excellent Adventure and is part of the Bill & Ted franchise. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Evan Richards Bill S. Preston (voice) Christopher Kennedy Ted Logan (voice) Tara Strong Mary Jane (voice) Rick Overton Rufus (voice) Full Cast & Crew Last Season Season 2 1991 | 8 Episodes Season 2 of Bill & Ted's Excellent Adventures premiered on September 14, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1994-12-19 The Head 7.3    1990-09-28 Have I Got News for You 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.billandted.org Genres Animation Comedy Keywords based on movie time traveler Content Score 86 Almost there... Top Contributors 47 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}