{"link": "https://www.themoviedb.org/tv/4179?language=en", "title": "Rick & Steve: The Happiest Gay Couple in All the World", "resume": "Rick & Steve: The Happiest Gay Couple in All the World is an American-Canadian stop motion animated sitcom created by Q. Allan Brocka, who also acts as director. It is a spin off from Brocka's 1999 short film of the same name, and debuted on the LGBT focused Logo network in July 2007 and on the Canadian Teletoon's late-night programming block \"The Detour\" that October. The show premiered in the UK on E4 on 17 September 2008 and in January 2010 on Virgin 17 in France.\nAfter the first season aired, Logo renewed the program for a second season, which debuted on November 11, 2008.\nThe animation of the original Rick & Steve shorts were done using Lego blocks and figures, prompting a lawsuit from the company. Though the series no longer uses Lego blocks, it still draws comparison to both them and those by Playmobil.\nIt is produced by Toronto-based production studio, Cuppa Coffee Studio. Currently, there are no further plans for a third season of Rick & Steve.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Peter Paige", "Laraine Newman", "Alan Cumming", "Lori Alan", "Wilson Cruz"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4179   Expand Rick & Steve: The Happiest Gay Couple in All the World   (2007) User Score Overview Rick & Steve: The Happiest Gay Couple in All the World is an American-Canadian stop motion animated sitcom created by Q. Allan Brocka, who also acts as director. It is a spin off from Brocka's 1999 short film of the same name, and debuted on the LGBT focused Logo network in July 2007 and on the Canadian Teletoon's late-night programming block \"The Detour\" that October. The show premiered in the UK on E4 on 17 September 2008 and in January 2010 on Virgin 17 in France. After the first season aired, Logo renewed the program for a second season, which debuted on November 11, 2008. The animation of the original Rick & Steve shorts were done using Lego blocks and figures, prompting a lawsuit from the company. Though the series no longer uses Lego blocks, it still draws comparison to both them and those by Playmobil. It is produced by Toronto-based production studio, Cuppa Coffee Studio. Currently, there are no further plans for a third season of Rick & Steve. Featured Crew Q. Allan Brocka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Paige Laraine Newman Alan Cumming Lori Alan Wilson Cruz Full Cast & Crew Last Season Season 2 2008 | 8 Episodes Season 2 of Rick & Steve: The Happiest Gay Couple in All the World premiered on November 11, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rick & Steve: The Happiest Gay Couple in All the World. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.happiestgaycouple.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}