{"link": "https://www.themoviedb.org/tv/4194?language=en", "title": "Star Wars: The Clone Wars", "resume": "Yoda, Obi-Wan Kenobi, Anakin Skywalker, Mace Windu and other Jedi Knights lead the Grand Army of the Republic against the droid army of the Separatists.", "rate": 74, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["James Arnold Taylor", "Corey Burton", "Dee Bradley Baker", "Matt Lanter", "Tom Kane"], "character": ["Obi-Wan Kenobi", "Count Dooku", "Clone trooper", "Anakin Skywalker", "Yoda / Wullf Yularen / Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4194   Expand Star Wars: The Clone Wars   (2008) User Score Overview Yoda, Obi-Wan Kenobi, Anakin Skywalker, Mace Windu and other Jedi Knights lead the Grand Army of the Republic against the droid army of the Separatists. Featured Crew George Lucas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  34 Posters  17 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Arnold Taylor Obi-Wan Kenobi Corey Burton Count Dooku Dee Bradley Baker Clone trooper Matt Lanter Anakin Skywalker Tom Kane Yoda / Wullf Yularen / Narrator Full Cast & Crew Last Season Original Air Date Original Air Date Chronological Order (Story Arc) Season 6 2014 | 13 Episodes Season 6 of Star Wars: The Clone Wars premiered on March  7, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Swore that was George Takei Open 0 by movie_nazi\n      \n     Actually not that bad Open 1 by  LastLion Go to Discussions Media Most Popular Videos  0 Backdrops  34 Posters  17 Recommendations   2014-10-13 Star Wars Rebels 6.9    2003-11-07 Star Wars: Clone Wars 6.7    2003-07-19 Teen Titans 7.6    2009-10-02 Stargate Universe 7.1    1960-09-30 The Flintstones 7.0    1987-09-10 Teenage Mutant Ninja Turtles 7.3    2009-01-23 Wolverine and the X-Men 7.0    1999-01-10 Batman Beyond 7.8  Facts Status  Cancelled Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  25m, 30m, 22m Homepage   http://www.starwars.com/tv-shows/star-wars-the-clone-wars Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords space opera Content Score 100 Yes! Looking good! Top Contributors 31 Banana AS 22 Alexandre Simões de Carvalho 22 0Connors 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}