{"link": "https://www.themoviedb.org/tv/60607?language=en", "title": "The After", "resume": "Eight strangers are thrown together by mysterious forces and must help each other survive in a violent world that defies explanation.", "rate": 82, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Aldis Hodge", "Andrew Howard", "Jaina Lee Ortiz", "Arielle Kebbel", "Jason Lewis"], "character": ["D. Love", "McCormick", "Marly", "Tammy", "Gigi's Husband"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60607   Expand The After   (2014) User Score Overview Eight strangers are thrown together by mysterious forces and must help each other survive in a violent world that defies explanation. Featured Crew Chris Carter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aldis Hodge D. Love Andrew Howard McCormick Jaina Lee Ortiz Marly Arielle Kebbel Tammy Jason Lewis Gigi's Husband Full Cast & Crew Last Season Season 1 2014 | 1 Episode Season 1 of The After premiered on February  6, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The After. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2012-09-25 Vegas 7.4    2006-11-02 The State Within 7.8    2011-04-06 Breaking In 5.4    2014-04-28 Prey 7.1    2012-10-04 Hunted 7.1    2005-12-04 Sleeper Cell 7.4    2009-08-02 Defying Gravity 6.6    2016-09-22 Paranoid 6.4  Facts Status  Pilot Network Certification  - Type  Scripted Original Language  English Runtime  53m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords post-apocalyptic failed tv pilot Content Score 79 Pump it up! We're close now. Top Contributors 16 Elizabeth Jennings 15 tulgha 10 Banana l 4 lucybenson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}