{"link": "https://www.themoviedb.org/tv/7407?language=en", "title": "Dennis the Menace and Gnasher", "resume": "Dennis and Gnasher is an animated British TV series based on characters from The Beano comic, It features the daily adventures of the rebellious schoolboy Dennis the Menace and his dog Gnasher.", "rate": 58, "genre": ["Animation"], "cast": ["Richard Pearce", "Kerry Shale", "Gary Martin", "Jill Lidstone", "Sally Grace"], "character": ["Dennis (voice)", "Gnasher (voice)", "Pie-Face (voice)", "Curly (voice)", "Granny (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7407   Expand Dennis the Menace and Gnasher   (1996) User Score Overview Dennis and Gnasher is an animated British TV series based on characters from The Beano comic, It features the daily adventures of the rebellious schoolboy Dennis the Menace and his dog Gnasher. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Pearce Dennis (voice) Kerry Shale Gnasher (voice) Gary Martin Pie-Face (voice) Jill Lidstone Curly (voice) Sally Grace Granny (voice) Full Cast & Crew Last Season Season 2 1998 | 13 Episodes Season 2 of Dennis the Menace and Gnasher premiered on February 13, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dennis the Menace and Gnasher. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Keywords based on comic kids british humour dennis the menace Content Score 86 Almost there... Top Contributors N 46 Notamymerrick 17 Banana TB 2 TMDb Bot O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}