{"link": "https://www.themoviedb.org/tv/1962?language=en", "title": "Erky Perky", "resume": "Erky Perky was an Australian and Canadian animated television program on YTV developed by CCI Entertainment. and Ambience Entertainment. The show was about two bickering, dimwitted insects, Erky and Perky, who live at a hot dog stand, but are accidentally taken to a house. The show focuses on Erky and Perky trying to settle into the house, living with fellow housebugs, and the hunt for food in a very clean kitchen. It was broadcast once on YTV's Big BBQ Blowout on July 1, 2006, as a \"sneak peek\". Another Erky Perky \"sneak peek\" episode was shown on August 30, 2006 during YTV's \"Sneek Peek Week\", before airing regularly on September 7. The show premiered on Toon Disney in the United States on September 4, 2006.\nThe CGI animation was done by the Australian Visual Effects company The LaB Sydney", "rate": 0, "genre": ["Animation"], "cast": ["Neil Crone", "Ron Rubin", "Scott McCord", "Carlos Alazraqui", "Dave Ward"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1962   Expand Erky Perky   (2006) User Score  Play Trailer Overview Erky Perky was an Australian and Canadian animated television program on YTV developed by CCI Entertainment. and Ambience Entertainment. The show was about two bickering, dimwitted insects, Erky and Perky, who live at a hot dog stand, but are accidentally taken to a house. The show focuses on Erky and Perky trying to settle into the house, living with fellow housebugs, and the hunt for food in a very clean kitchen. It was broadcast once on YTV's Big BBQ Blowout on July 1, 2006, as a \"sneak peek\". Another Erky Perky \"sneak peek\" episode was shown on August 30, 2006 during YTV's \"Sneek Peek Week\", before airing regularly on September 7. The show premiered on Toon Disney in the United States on September 4, 2006. The CGI animation was done by the Australian Visual Effects company The LaB Sydney Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Crone Ron Rubin Scott McCord Carlos Alazraqui Dave Ward Full Cast & Crew Last Season Season 2 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Erky Perky. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors TB 1 TMDb Bot 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}