{"link": "https://www.themoviedb.org/tv/66390?language=en", "title": "Gangsta.", "resume": "In the crime-ridden, mafia-governed city of Ergastulum, Worick and Nicolas are two \"handymen\" known as \"Benriya\" who would take any dirty job from either police or mafia -- for a good price. After an assignment from police the two met and later joined by Alex, a former prostitute who got interested in the mysterious background of the team, in particular of Nicolas' abilities.", "rate": 72, "genre": ["Drama", "Action", "Adventure", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66390   Expand Gangsta.   (2015) User Score  Play Trailer Overview In the crime-ridden, mafia-governed city of Ergastulum, Worick and Nicolas are two \"handymen\" known as \"Benriya\" who would take any dirty job from either police or mafia -- for a good price. After an assignment from police the two met and later joined by Alex, a former prostitute who got interested in the mysterious background of the team, in particular of Nicolas' abilities. Featured Crew Shukō Murase Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Gangsta. premiered on July  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2015-07-12 God Eater 6.4    2014-09-26 Terra Formars 5.4    2016-10-07 Drifters 7.4    2015-07-05 Rokka: Braves of the Six Flowers 5.9    2016-04-01 The Lost Village 4.3    2015-10-03 Chivalry of a Failed Knight 7.9    2012-07-06 Campione! 9.0    2013-04-07 Gargantia on the Verdurous Planet 6.8  Facts Original Name  ギャングスタ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Drama Action & Adventure Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors M 22 Manu 7 Elizabeth Jennings z 6 zurman1 5 無情天  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}