{"link": "https://www.themoviedb.org/tv/2746?language=en", "title": "Charlie Jade", "resume": "Charlie Jade is a science fiction television program filmed mainly in Cape Town, South Africa. It stars Jeffrey Pierce in the title role, as a detective from a parallel universe who finds himself trapped in our universe. This is a Canadian and South African co-production filmed in conjunction with CHUM Television and the South African Industrial Development Corporation. The special effects were produced by the Montreal-based company Cinegroupe led by Michel Lemire.\nThe show started in 2004 and was aired on the Canadian Space Channel. It premiered on the Space Channel April 16, 2005 and aired in Eastern Europe, France, Italy, on SABC 3 in South Africa, on Fox Japan, and on AXN in Hong Kong. The show began airing in the United Kingdom in October 2007, on FX. The Sci Fi Channel in the United States premiered the show on June 6, 2008, but after 2 episodes on Friday prime-time, moved it to overnight Mon/Tue.", "rate": 71, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Jeffrey Pierce", "Patricia McKenzie", "Tyrone Benskin", "Michael Filipowich", "Danny Keogh"], "character": ["Charlie Jade", "Reena", "Karl Lubinsky", "01 Boxer", "Julius Galt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2746   Expand Charlie Jade   (2005) User Score Overview Charlie Jade is a science fiction television program filmed mainly in Cape Town, South Africa. It stars Jeffrey Pierce in the title role, as a detective from a parallel universe who finds himself trapped in our universe. This is a Canadian and South African co-production filmed in conjunction with CHUM Television and the South African Industrial Development Corporation. The special effects were produced by the Montreal-based company Cinegroupe led by Michel Lemire. The show started in 2004 and was aired on the Canadian Space Channel. It premiered on the Space Channel April 16, 2005 and aired in Eastern Europe, France, Italy, on SABC 3 in South Africa, on Fox Japan, and on AXN in Hong Kong. The show began airing in the United Kingdom in October 2007, on FX. The Sci Fi Channel in the United States premiered the show on June 6, 2008, but after 2 episodes on Friday prime-time, moved it to overnight Mon/Tue. Featured Crew Chris Roland Creator Robert Wertheimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Pierce Charlie Jade Patricia McKenzie Reena Tyrone Benskin Karl Lubinsky Michael Filipowich 01 Boxer Danny Keogh Julius Galt Full Cast & Crew Last Season Season 1 2005 | 20 Episodes Season 1 of Charlie Jade premiered on April 16, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations   2011-02-07 Outcasts 6.2    2006-10-07 Robin Hood 6.5    1996-09-19 The Pretender 7.3    2008-10-03 Sanctuary 6.8    2010-09-12 Lost Girl 6.7    2011-01-09 The Cape 4.3    2010-09-20 The Event 6.2    2016-01-13 Second Chance 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.charliejade.net Genres Sci-Fi & Fantasy Drama Keywords africa fish out of water police detective parallel world Content Score 93 Almost there... Top Contributors 16 Banana P 4 Petr w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}