{"link": "https://www.themoviedb.org/tv/61222?language=en", "title": "BoJack Horseman", "resume": "Meet the most beloved sitcom horse of the 90s - 20 years later. BoJack Horseman was the star of the hit TV show \"Horsin' Around,\" but today he's washed up, living in Hollywood, complaining about everything, and wearing colorful sweaters.", "rate": 79, "genre": ["Drama", "Comedy", "Animation"], "cast": ["Will Arnett", "Aaron Paul", "Alison Brie", "Amy Sedaris", "Paul F. Tompkins"], "character": ["BoJack Horseman", "Todd Chavez", "Diane Nguyen", "Princess Carolyn", "Mr. Peanutbutter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61222   Expand BoJack Horseman   (2014) User Score  Play Trailer Overview Meet the most beloved sitcom horse of the 90s - 20 years later. BoJack Horseman was the star of the hit TV show \"Horsin' Around,\" but today he's washed up, living in Hollywood, complaining about everything, and wearing colorful sweaters. Featured Crew Raphael Bob-Waksberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  1 Images Backdrops  16 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Arnett BoJack Horseman Aaron Paul Todd Chavez Alison Brie Diane Nguyen Amy Sedaris Princess Carolyn Paul F. Tompkins Mr. Peanutbutter Full Cast & Crew Last Season Season 4 2017 | 12 Episodes Season 4 of BoJack Horseman premiered on September  8, 2017. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply E Compare this to Regular Show and MadMen Open 1 by  Victor Rodrigues What show is \"Horsin' Around\" parodying? Open 0 by movie_nazi\n      \n     Jessica Biel & Zach Braff (Spoiler!) Open 0 by lmao7\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  6 Recommendations   2015-12-18 F is for Family 6.8    2015-11-06 Master of None 8.0    2010-03-17 Ugly Americans 6.9    2009-09-16 Archer 7.9    1999-03-28 Futurama 8.2    2011-01-09 Bob's Burgers 7.7    2010-06-29 Louie 7.7    2003-11-02 Arrested Development 8.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  25m Homepage   http://www.netflix.com/title/70300800 Genres Drama Comedy Animation Keywords depression drug abuse show business roommate horse game show satire cynicism alcoholism sexual humor anthropomorphism speaking horse hollywood washed up star hollywood star existentialism sitcom roommate relationship ghost writer Content Score 100 Yes! Looking good! Top Contributors 39 Elizabeth Jennings 24 Coquelicot 17 Stephen 10 Bendik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}