{"link": "https://www.themoviedb.org/tv/17109?language=en", "title": "Toma Lá, Dá Cá", "resume": "Toma Lá, Dá Cá is a Brazilian television sitcom broadcast by Globo Network on Tuesday nights. The episodes are performed in front of a live audience, in a format very similar to the one of older sitcom Sai de Baixo, also created by Miguel Falabella.", "rate": 0, "genre": ["Comedy"], "cast": ["Adriana Esteves", "Aracy Balabanian", "Débora Bloch", "Juliana Paes", "Cláudia Lira"], "character": ["Celinha", "Suellen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17109   Expand Toma Lá, Dá Cá   (2007) User Score Overview Toma Lá, Dá Cá is a Brazilian television sitcom broadcast by Globo Network on Tuesday nights. The episodes are performed in front of a live audience, in a format very similar to the one of older sitcom Sai de Baixo, also created by Miguel Falabella. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adriana Esteves Celinha Aracy Balabanian Débora Bloch Juliana Paes Suellen Cláudia Lira Full Cast & Crew Last Season Toma lá dá cá season 3 2009 | 32 Episodes Season 3 of Toma Lá, Dá Cá premiered on April 14, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Toma Lá, Dá Cá. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}