{"link": "https://www.themoviedb.org/tv/14362?language=en", "title": "A Woman of Substance", "resume": "A Woman of Substance is a British/American television miniseries, produced in 1984. It is based on the 1979 book of the same name by the author Barbara Taylor Bradford.", "rate": 82, "genre": ["Drama"], "cast": ["Miranda Richardson", "John Mills", "Liam Neeson", "Barry Bostwick", "Jenny Seagrove"], "character": ["Paula McGill Amory", "Henry Rossiter", "Blackie O'Neill", "Maj. Paul McGill", "Young Emma Harte"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14362   Expand A Woman of Substance   (1984) User Score Overview A Woman of Substance is a British/American television miniseries, produced in 1984. It is based on the 1979 book of the same name by the author Barbara Taylor Bradford. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miranda Richardson Paula McGill Amory John Mills Henry Rossiter Liam Neeson Blackie O'Neill Barry Bostwick Maj. Paul McGill Jenny Seagrove Young Emma Harte Full Cast & Crew Last Season Season 3 1988 | 4 Episodes Season 3 of A Woman of Substance premiered on November 13, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on A Woman of Substance. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  290m, 120m Homepage  - Genres Drama Keywords jealousy england career woman assault inheritance female protagonist heiress security lifetime Content Score 86 Almost there... Top Contributors TB 36 TMDb Bot 13 Banana i 3 ismax935 t 2 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}