{"link": "https://www.themoviedb.org/tv/65712?language=en", "title": "Dimension W", "resume": "Humanity has found a way to achieve infinite energy by using coils to draw it from the fourth plane: dimension \"W\". With the production of coils having been monopolized by the New Tesla energy company, freelance collectors are hired to find and remove any illegal, unofficial coils.\nThis is the story of collector Kyōma, who also happens to have a huge hatred towards coils. During one of his missions he stumbles upon a female android that perceives herself as being human, leading the two to enter an unlikely partnership.", "rate": 67, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Daisuke Ono", "Reina Ueda", "Akira Ishida", "Yuichi Nakamura", "Kimiko Saito"], "character": ["Kyōma Mabuchi (voice)", "Mira Yurizaki (voice)", "Albert Schumann (voice)", "Loser (voice)", "Marie (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65712   Expand Dimension W   (2016) User Score  Play Trailer Overview Humanity has found a way to achieve infinite energy by using coils to draw it from the fourth plane: dimension \"W\". With the production of coils having been monopolized by the New Tesla energy company, freelance collectors are hired to find and remove any illegal, unofficial coils. This is the story of collector Kyōma, who also happens to have a huge hatred towards coils. During one of his missions he stumbles upon a female android that perceives herself as being human, leading the two to enter an unlikely partnership. Featured Crew Yuji Iwahara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  2 Teasers  1 Clips  2 Featurettes  7 Opening Credits  1 Top Billed Cast Daisuke Ono Kyōma Mabuchi (voice) Reina Ueda Mira Yurizaki (voice) Akira Ishida Albert Schumann (voice) Yuichi Nakamura Loser (voice) Kimiko Saito Marie (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  13 Backdrops  3 Posters  1 Recommendations   2016-04-07 And you thought there is never a girl online? 7.6    2016-07-02 First Love Monster 5.7    2016-01-08 Divine Gate 5.3    2016-01-08 Dagashi Kashi 6.3    2015-10-03 Chivalry of a Failed Knight 7.9    2012-07-06 Aesthetica of a Rogue Hero 7.1    2013-03-31 Date a Live 7.9    2016-01-16 Ajin 6.4  Facts Original Name  ディメンションW Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://dimension-w.net/ Genres Animation Drama Sci-Fi & Fantasy Keywords android dystopia mercenary anime technocracy Content Score 100 Yes! Looking good! Top Contributors 65 liteignited M 19 Migi 18 Optic z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}