{"link": "https://www.themoviedb.org/tv/62123?language=en", "title": "Féminin/Féminin", "resume": "If The L Word was written in 2014, filtered through the satirical lens of Girls (replete with dancing to Icona Pop’s “I Love It” in a club) and set in Québec, you’d have Féminin/Féminin. \nA type of docu-dramatic comedy, straddling both documentary and fiction, Féminin/Féminin delves into the lives of six 20-something friends—lesbian, bisexual, and, yes, even straight—as they “live and love” in Montreal.", "rate": 65, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62123   Expand Féminin/Féminin   (2014) User Score Overview If The L Word was written in 2014, filtered through the satirical lens of Girls (replete with dancing to Icona Pop’s “I Love It” in a club) and set in Québec, you’d have Féminin/Féminin.  A type of docu-dramatic comedy, straddling both documentary and fiction, Féminin/Féminin delves into the lives of six 20-something friends—lesbian, bisexual, and, yes, even straight—as they “live and love” in Montreal. Featured Crew Chloé Robichaud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 8 Episodes Season 2 of Féminin/Féminin premiered on February 13, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Féminin/Féminin. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  French Runtime  - Homepage   http://femininfeminin.com Genres Drama Keywords canada montreal lesbian relationship lesbian lgbt young adult Content Score 64 We're so close, yet so far. Top Contributors 58 Banana 13 Elizabeth Jennings 4 Pauline TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}