{"link": "https://www.themoviedb.org/tv/67231?language=en", "title": "Barman", "resume": "Alex Lachance is a retired actor turned barman. When he became the owner of a tavern, he thought he’d get back to the real world and quiet anonymity. He didn’t expect that his bar would become a hangout for celebrities looking for a sympathetic ear with their gin tonic & lemon. Barman consists of twelve intertwining mini-sagas, both absurd and touching, brought to life through cameos from Québec artists. It’s a chronicle of the daily life of a guy who got out of showbiz only to find that showbiz wasn’t ready to let him go.", "rate": 0, "genre": ["Comedy"], "cast": ["Martin Laroche", "Vincent Fafard", "Sonia Cordeau"], "character": ["Alexandre Lachance", "Sébastien Bruno-Beaudoin", "Myriam Lapierre"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67231   Expand Barman   (2016) User Score  Play Trailer Overview Alex Lachance is a retired actor turned barman. When he became the owner of a tavern, he thought he’d get back to the real world and quiet anonymity. He didn’t expect that his bar would become a hangout for celebrities looking for a sympathetic ear with their gin tonic & lemon. Barman consists of twelve intertwining mini-sagas, both absurd and touching, brought to life through cameos from Québec artists. It’s a chronicle of the daily life of a guy who got out of showbiz only to find that showbiz wasn’t ready to let him go. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Laroche Alexandre Lachance Vincent Fafard Sébastien Bruno-Beaudoin Sonia Cordeau Myriam Lapierre Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Barman premiered on March 31, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Barman. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  6m, 5m Homepage   http://ici.radio-canada.ca/tele/barman Genres Comedy Keywords bar quebec celebrity Content Score 64 We're so close, yet so far. Top Contributors 30 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}