{"link": "https://www.themoviedb.org/tv/68378?language=en", "title": "The Silent Valley", "resume": "Filip and Horia are two teenagers who seem like two usual friends, but after they spend the night in Horia's cabin, they discover their mutual attraction and they engage in an affair. After a car stops by the cabin, the two realize that they've become witnesses to a multiple homicide. Being afraid that by confessing, their relationshop will surface, the two choose to remain silent, but their secret will become harder and harder to keep and they'll find themselves in a frightening series of events.", "rate": 83, "genre": ["Crime", "Drama"], "cast": ["Vlad Balan", "Theodor Șoptelea", "Adrian Păduraru", "Alexandra Fasolă", "Alina Berzunțeanu"], "character": ["Horia Diaconu", "Filip Zamfir", "Radu Diaconu", "Camelia Bădoi", "Liliana Diaconu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68378   Expand The Silent Valley   (2016) User Score Overview Filip and Horia are two teenagers who seem like two usual friends, but after they spend the night in Horia's cabin, they discover their mutual attraction and they engage in an affair. After a car stops by the cabin, the two realize that they've become witnesses to a multiple homicide. Being afraid that by confessing, their relationshop will surface, the two choose to remain silent, but their secret will become harder and harder to keep and they'll find themselves in a frightening series of events. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vlad Balan Horia Diaconu Theodor Șoptelea Filip Zamfir Adrian Păduraru Radu Diaconu Alexandra Fasolă Camelia Bădoi Alina Berzunțeanu Liliana Diaconu Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of The Silent Valley premiered on October 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Silent Valley. You can help by rating TV shows you've seen. Facts Original Name  Valea mută Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Romanian Runtime  60m Homepage   http://www.hbo.ro/series/valea-muta Genres Crime Drama Keywords organized crime crime lgbt Content Score 86 Almost there... Top Contributors c 37 count_vertigo 21 Elizabeth Jennings z 10 zurman1 O2 9 Onadio 212  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}