{"link": "https://www.themoviedb.org/tv/46596?language=en", "title": "School 2013", "resume": "School 2013 is a 2012 South Korean television series starring Jang Nara, Choi Daniel, Lee Jong-suk and Kim Woo-bin. The teen drama depicts the struggles and dilemmas that modern-day Korean youth face, such as bullying, student suicides, school violence, deteriorating teacher-student relations, private tutoring and other real-life high school issues, all within the confines of one small classroom at Seung Ri High School.\nIt is the fifth installment of KBS's \"School\" series which aired from 1999 through 2002. It aired on KBS2 from December 3, 2012 to January 28, 2013 on Mondays and Tuesdays at 21:55 for 16 episodes.", "rate": 85, "genre": ["Drama"], "cast": ["Lee Jong-suk", "Kim Woo-bin", "Jang Na-ra", "Choi Daniel", "Park Se-young"], "character": ["Go Nam Soon", "Park Heung Soo", "Jung In Jae", "Kang Se Chan", "Song Ha Kyung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46596   Expand School 2013   (2012) User Score  Play Trailer Overview School 2013 is a 2012 South Korean television series starring Jang Nara, Choi Daniel, Lee Jong-suk and Kim Woo-bin. The teen drama depicts the struggles and dilemmas that modern-day Korean youth face, such as bullying, student suicides, school violence, deteriorating teacher-student relations, private tutoring and other real-life high school issues, all within the confines of one small classroom at Seung Ri High School. It is the fifth installment of KBS's \"School\" series which aired from 1999 through 2002. It aired on KBS2 from December 3, 2012 to January 28, 2013 on Mondays and Tuesdays at 21:55 for 16 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jong-suk Go Nam Soon Kim Woo-bin Park Heung Soo Jang Na-ra Jung In Jae Choi Daniel Kang Se Chan Park Se-young Song Ha Kyung Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of School 2013 premiered on December  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2014-05-05 Doctor Stranger 7.3    2012-05-30 Bridal Mask 9.5    2014-07-23 It's Okay, That's Love 9.3    2010-08-30 Sungkyunkwan Scandal 7.7    2011-01-03 Dream High 7.5    2013-12-09 The Prime Minister and I 7.1    2010-03-31 Personal Taste 7.4    2010-11-13 Secret Garden 8.2  Facts Original Name  학교 2013 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/school/ Genres Drama Keywords korea school Content Score 93 Almost there... Top Contributors M 28 Maria180493 t 5 tmdb38202327 z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}