{"link": "https://www.themoviedb.org/tv/65261?language=en", "title": "La querida del Centauro", "resume": "\"La querida del Centauro\" chronicles the life of Yolanda, an attractive and intelligent prisoner, that becomes the mistress of one of the most important drug traffickers of Mexico, Benedictino García, alias \"El Centauro\". This relationship, which inside the prison will give much power to Yolanda, will end up becoming her worst nightmare when she manages to be released thanks to Gerardo, a shrewd detective whose last years have been dedicated to the fight against drug trafficking. With El Centauro in hiding, Gerardo decides to use Yolanda as bait in an operation that will take them to the hiding place of El Centauro.", "rate": 80, "genre": ["Crime", "Drama"], "cast": ["Ludwika Paleta"], "character": ["El Centauro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65261   Expand La querida del Centauro   (2016) User Score Overview \"La querida del Centauro\" chronicles the life of Yolanda, an attractive and intelligent prisoner, that becomes the mistress of one of the most important drug traffickers of Mexico, Benedictino García, alias \"El Centauro\". This relationship, which inside the prison will give much power to Yolanda, will end up becoming her worst nightmare when she manages to be released thanks to Gerardo, a shrewd detective whose last years have been dedicated to the fight against drug trafficking. With El Centauro in hiding, Gerardo decides to use Yolanda as bait in an operation that will take them to the hiding place of El Centauro. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ludwika Paleta El Centauro Full Cast & Crew Last Season Season 2 2017 | 1 Episode Season 2 of La querida del Centauro premiered on April 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La querida del Centauro. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Spanish; Castilian Runtime  48m, 45m Homepage   http://www.telemundo.com/novelas/la-querida-del-centauro Genres Crime Drama Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors b 25 blackscorpion 13 Elizabeth Jennings z 10 zurman1 j 2 jacobwstiana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}