{"link": "https://www.themoviedb.org/tv/68634?language=en", "title": "D-Frag!", "resume": "Kazama Kenji likes to believe he is something of a delinquent. Moreover, others seem to like to agree that he is. Of course, Kenji's gang finds their way to a group of four not-so-normal girls—Chitose, Sakura, Minami and Roka—and all at once, whatever reputation he may have is nothing compared to the outrageous behavior of the girls. Shanghaied into joining their club, what will happen to his everyday life from that point on?", "rate": 80, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68634   Expand D-Frag!   (2014) User Score Overview Kazama Kenji likes to believe he is something of a delinquent. Moreover, others seem to like to agree that he is. Of course, Kenji's gang finds their way to a group of four not-so-normal girls—Chitose, Sakura, Minami and Roka—and all at once, whatever reputation he may have is nothing compared to the outrageous behavior of the girls. Shanghaied into joining their club, what will happen to his everyday life from that point on? Featured Crew Tomoya Haruno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of D-Frag! premiered on January  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2007-10-02 Bamboo Blade 9.5    2011-07-07 Mayo Chiki! 9.5    2005-01-06 Ah! My Goddess 9.0    2017-07-13 Gamers! 7.8    2017-04-02 Alice & Zouroku 7.7    2017-07-12 My First Girlfriend is a Gal 7.4    2011-01-08 Freezing 7.4    2017-04-04 Akashic Records of Bastard Magic Instructor 9.0  Facts Original Name  ディーふらぐ! Status  Ended Networks - Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.d-fragments.net/ Genres Animation Comedy Keywords high school rivalry based on manga game design anime Content Score 64 We're so close, yet so far. Top Contributors 11 CrewMdk w 9 whitetigerx8 9 Ailurus Fulgens m 7 maruino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}