{"link": "https://www.themoviedb.org/tv/68548?language=en", "title": "Apostle", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 51, "genre": ["War", "Politics", "Mystery", "Drama"], "cast": ["Andrey Smirnov", "Andrei Gusev", "Yuriy Nazarov", "Aleksandr Novin", "Mikhail Fedorovskiy"], "character": ["Arkadiy Andreevich Istomin, of Peter and of Pavel father", "Geldrih", "Demin", "Mashka", "Sergei Istomin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68548   Expand Apostle   (2008) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrey Smirnov Arkadiy Andreevich Istomin, of Peter and of Pavel father Andrei Gusev Geldrih Yuriy Nazarov Demin Aleksandr Novin Mashka Mikhail Fedorovskiy Sergei Istomin Full Cast & Crew Last Season Season 1 2008 | 12 Episodes Season 1 of Apostle premiered on April  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  3 Recommendations   1973-08-11 Seventeen Moments of Spring 7.5  Facts Original Name  Апостол Status  Ended Network Certification  - Type  Miniseries Original Language  Russian Runtime  55m Homepage  - Genres War & Politics Mystery Drama Keywords miniseries Content Score 79 Pump it up! We're close now. Top Contributors TB 40 TMDb Bot 36 West@ R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}