{"link": "https://www.themoviedb.org/tv/34067?language=en", "title": "Someday's Dreamers", "resume": "Someday's Dreamers is a manga written by Norie Yamada and illustrated by Kumichi Yoshizuki. It was serialized in Kadokawa Shoten's Comic Dragon magazine from May 2002 to January 2003 and was later collected in two bound volumes. In 2006, Tokyopop released the manga in the United States under the name Someday's Dreamers.\nSomeday's Dreamers was also adapted into an anime series that was produced by J.C.Staff under the direction of Masami Shimoda. It is loosely based on the storyline of the first manga series with new characters added to the story. It ran for a total of 12 episodes on TV Asahi and was later licensed by Geneon Entertainment USA. However, due to the closure of Geneon USA, the series has been relicensed by Sentai Filmworks.\nAnother story set in the same universe, Someday's Dreamers: Spellbound, written and drawn by the same author and illustrator, was serialized in Kadokawa Shoten's Comic Dragon Age. It ran from December 2003 to February 2006 and was later released in five bound volumes. In 2006, Tokyopop released the manga in the United States under the name Someday's Dreamers: Spellbound.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Sanae Kobayashi", "Aoi Miyazaki", "Akiko Hiramatsu", "Akeno Watanabe", "Junichi Suwabe"], "character": ["Haru Kikuchi", "Yume Kikuchi", "Milinda", "Angela Charon Brooks", "Masami Oyamada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34067   Expand Someday's Dreamers   (2003) User Score Overview Someday's Dreamers is a manga written by Norie Yamada and illustrated by Kumichi Yoshizuki. It was serialized in Kadokawa Shoten's Comic Dragon magazine from May 2002 to January 2003 and was later collected in two bound volumes. In 2006, Tokyopop released the manga in the United States under the name Someday's Dreamers. Someday's Dreamers was also adapted into an anime series that was produced by J.C.Staff under the direction of Masami Shimoda. It is loosely based on the storyline of the first manga series with new characters added to the story. It ran for a total of 12 episodes on TV Asahi and was later licensed by Geneon Entertainment USA. However, due to the closure of Geneon USA, the series has been relicensed by Sentai Filmworks. Another story set in the same universe, Someday's Dreamers: Spellbound, written and drawn by the same author and illustrator, was serialized in Kadokawa Shoten's Comic Dragon Age. It ran from December 2003 to February 2006 and was later released in five bound volumes. In 2006, Tokyopop released the manga in the United States under the name Someday's Dreamers: Spellbound. Featured Crew Norie Yamada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanae Kobayashi Haru Kikuchi Aoi Miyazaki Yume Kikuchi Akiko Hiramatsu Milinda Akeno Watanabe Angela Charon Brooks Junichi Suwabe Masami Oyamada Full Cast & Crew Last Season Season 2 2008 | 12 Episodes Season 2 of Someday's Dreamers premiered on July  2, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Someday's Dreamers. You can help by rating TV shows you've seen. Facts Original Name  魔法遣いに大切なこと Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 TheDerpMan s 7 sinano R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}