{"link": "https://www.themoviedb.org/tv/20101?language=en", "title": "Android Kikaider", "resume": "Android Kikaider: The Animation, the anime adaptation of the Japanese superhero Kikaider, was produced by Sony Animation and broadcast on Kids Station from October 16, 2000 to January 8, 2001, with a total of 13 episodes. The anime followed more of the manga, with a darker nature of Jiro's reason to exist.\nIt was followed by the OVA 4-episode sequel called. Kikaider 01: The Animation.\nAn OVA special came with the Kikaider 01 DVD called The boy with the Guitar: Kikaider vs Inazuman which teamed Kikaider with Inazuman, another superhero created by Shotaro Ishinomori. It was based on the manga chapter of Inazuman called The boy with the Guitar.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Tomokazu Seki", "Yui Horie", "Yumiko Kobayashi", "Keaton Yamada", "Etsuko Kozakura"], "character": ["Kikaider", "Mitsuko Kômyôji", "Masaru Kômyôji", "Hanpei Hattori", "Etsuko Sarutobi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20101   Expand Android Kikaider   (2000) User Score Overview Android Kikaider: The Animation, the anime adaptation of the Japanese superhero Kikaider, was produced by Sony Animation and broadcast on Kids Station from October 16, 2000 to January 8, 2001, with a total of 13 episodes. The anime followed more of the manga, with a darker nature of Jiro's reason to exist. It was followed by the OVA 4-episode sequel called. Kikaider 01: The Animation. An OVA special came with the Kikaider 01 DVD called The boy with the Guitar: Kikaider vs Inazuman which teamed Kikaider with Inazuman, another superhero created by Shotaro Ishinomori. It was based on the manga chapter of Inazuman called The boy with the Guitar. Featured Crew Shotaro Ishinomori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomokazu Seki Kikaider Yui Horie Mitsuko Kômyôji Yumiko Kobayashi Masaru Kômyôji Keaton Yamada Hanpei Hattori Etsuko Kozakura Etsuko Sarutobi Full Cast & Crew Last Season Season 1 2000 | 13 Episodes Season 1 of Android Kikaider premiered on October 16, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Android Kikaider. You can help by rating TV shows you've seen. Facts Original Name  人造人間キカイダー Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 Renato t 5 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}