{"link": "https://www.themoviedb.org/tv/16386?language=en", "title": "The Beast", "resume": "FBI agent Charles Barker applies controversial techniques in his attempts to bring criminals to justice, which often border on illegal and unsettle his uninitiated partner, Ellis Dove. Over the course of the first season, Barker is investigated by fellow FBI agents for alleged misconduct. Dove's loyalty to his partner is challenged when internal affairs agent Ray Beaumont (Larry Gilliard) approaches him to gain information. Shortly thereafter, Dove learns of darker secrets in Barker's past.", "rate": 70, "genre": ["Drama"], "cast": ["Patrick Swayze", "Travis Fimmel", "Kevin J. O'Connor", "Lindsay Pulsipher", "Lawrence Gilliard Jr."], "character": ["Charles Barker", "Ellis Dove", "Harry Conrad", "Rose Lawrence", "Ray Beaumont"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16386   Expand The Beast   (2009) User Score Overview FBI agent Charles Barker applies controversial techniques in his attempts to bring criminals to justice, which often border on illegal and unsettle his uninitiated partner, Ellis Dove. Over the course of the first season, Barker is investigated by fellow FBI agents for alleged misconduct. Dove's loyalty to his partner is challenged when internal affairs agent Ray Beaumont (Larry Gilliard) approaches him to gain information. Shortly thereafter, Dove learns of darker secrets in Barker's past. Featured Crew Vincent Angell Creator William Rotko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Swayze Charles Barker Travis Fimmel Ellis Dove Kevin J. O'Connor Harry Conrad Lindsay Pulsipher Rose Lawrence Lawrence Gilliard Jr. Ray Beaumont Full Cast & Crew Last Season Season 1 2009 | 13 Episodes Season 1 of The Beast premiered on January 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1998-09-15 Ultraviolet 0.0    2004-07-21 Rescue Me 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.aetv.com/the-beast/about/index.jsp Genres Drama Keywords undercover agent fbi undercover cop rookie cop crime investigation Content Score 93 Almost there... Top Contributors 18 Travis Bell 7 Banana z 6 zurman1 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}