{"link": "https://www.themoviedb.org/tv/2024?language=en", "title": "The People's Court", "resume": "The People's Court is an American arbitration-based reality court show currently presided over by retired Florida State Circuit Court Judge Marilyn Milian. Milian, the show's longest-reigning arbiter, handles small claims disputes in a simulated courtroom set.\nThe People's Court is the first court show to use binding arbitration, introducing the format into the genre in 1981. The system has been duplicated by most of the show's successors in the judicial genre. Moreover, The People's Court is the first popular, long-running reality in the judicial genre. It was preceded only by a few short-lived realities in the genre; these short-lived predecessors were only loosely related to judicial proceedings, except for one: Parole took footage from real-life courtrooms holding legal proceedings. Prior to The People's Court, the vast majority of TV courtroom shows used actors, and recreated or fictional cases. Among examples of these types of court shows include Famous Jury Trials and Your Witness.\nThe People's Court has had two contrasting lives. The show's first life was presided over solely by former Los Angeles County Superior Court Judge Joseph Wapner. His tenure lasted from the show's debut on September 14, 1981, until May 21, 1993, when the show was cancelled due to low ratings. This left the show with a total of 2,484 ½-hour episodes and 12 seasons. The show was taped in Los Angeles during its first life. After being cancelled, reruns aired until September 9, 1994.", "rate": 90, "genre": ["Reality", "Crime"], "cast": ["Marilyn Milian", "Douglas McIntosh", "Harvey Levin", "Curt Chaplin"], "character": ["Judge", "Bailiff", "Host and Legal Reporter", "In-Court Reporter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2024   Expand The People's Court User Score Overview The People's Court is an American arbitration-based reality court show currently presided over by retired Florida State Circuit Court Judge Marilyn Milian. Milian, the show's longest-reigning arbiter, handles small claims disputes in a simulated courtroom set. The People's Court is the first court show to use binding arbitration, introducing the format into the genre in 1981. The system has been duplicated by most of the show's successors in the judicial genre. Moreover, The People's Court is the first popular, long-running reality in the judicial genre. It was preceded only by a few short-lived realities in the genre; these short-lived predecessors were only loosely related to judicial proceedings, except for one: Parole took footage from real-life courtrooms holding legal proceedings. Prior to The People's Court, the vast majority of TV courtroom shows used actors, and recreated or fictional cases. Among examples of these types of court shows include Famous Jury Trials and Your Witness. The People's Court has had two contrasting lives. The show's first life was presided over solely by former Los Angeles County Superior Court Judge Joseph Wapner. His tenure lasted from the show's debut on September 14, 1981, until May 21, 1993, when the show was cancelled due to low ratings. This left the show with a total of 2,484 ½-hour episodes and 12 seasons. The show was taped in Los Angeles during its first life. After being cancelled, reruns aired until September 9, 1994. Featured Crew John Masterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marilyn Milian Judge Douglas McIntosh Bailiff Harvey Levin Host and Legal Reporter Curt Chaplin In-Court Reporter Full Cast & Crew Last Season Season 18 — | 126 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Topics I would prefer not to see anymore Open 3 by  There-Can-Be-Only-One Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Returning Series Network Broadcast Syndication Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  44m Homepage   http://peoplescourt.com/ Genres Reality Crime Keywords court court show Content Score 86 Almost there... Top Contributors F 61 FrankTMDB 8 Banana 7 TheOneManBoxOffice 2 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}