{"link": "https://www.themoviedb.org/tv/1358?language=en", "title": "At the Threshold of an Era", "resume": "At the Threshold of an Era was a Hong Kong epic drama series broadcast by TVB Jade Channel from October 11, 1999 to December 18, 1999 and March 13, 2000 to May 26, 2000, and was extensively promoted by TVB as its cross-milliennium, one-hundred-episode-long epic. The series composed of two parts, with a gap in between the airing.\nThe entire series took place in a continuing flashback, with one of the main characters pondering the trials and tribulations he went through while riding on a train in the \"green city\" he developed.", "rate": 0, "genre": ["Drama"], "cast": ["Ada Choi", "Maggie Shiu", "Liza Wang", "Kenix Kwok", "Roger Kwok"], "character": ["Ling Tin", "Tina Pang", "Liza Fong", "Ivy Sum", "Ma Chi Keung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1358   Expand At the Threshold of an Era   (1999) User Score Overview At the Threshold of an Era was a Hong Kong epic drama series broadcast by TVB Jade Channel from October 11, 1999 to December 18, 1999 and March 13, 2000 to May 26, 2000, and was extensively promoted by TVB as its cross-milliennium, one-hundred-episode-long epic. The series composed of two parts, with a gap in between the airing. The entire series took place in a continuing flashback, with one of the main characters pondering the trials and tribulations he went through while riding on a train in the \"green city\" he developed. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ada Choi Ling Tin Maggie Shiu Tina Pang Liza Wang Liza Fong Kenix Kwok Ivy Sum Roger Kwok Ma Chi Keung Full Cast & Crew Last Season Season 2 2001 | 56 Episodes Season 2 of At the Threshold of an Era premiered on April 20, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on At the Threshold of an Era. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 syaofox p 3 pcmonkeyzjy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}