{"link": "https://www.themoviedb.org/tv/76690?language=en", "title": "Sinatra: All or Nothing at All", "resume": "An up-close and personal examination of the life, music and career of the legendary entertainer. Told in his own words from hours of archived interviews, along with commentary from those closest to him, the documentary weaves the music and images from Sinatra’s life together with rarely seen footage of his famous 1971 “Retirement Concert” in Los Angeles. The film’s narrative is shaped by Sinatra’s song choices for that concert, which Gibney interprets as the singer’s personal guide through his own life.", "rate": 72, "genre": ["Documentary"], "cast": ["Frank Sinatra", "Gina Gershon", "Christine Baranski", "Vincent D'Onofrio"], "character": ["Himself (archive footage)", "Voice Of Ava Gardner", "Voice Of Ruth Berle", "Voice Of Dean Elson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76690   Expand Sinatra: All or Nothing at All   (2015) User Score Overview An up-close and personal examination of the life, music and career of the legendary entertainer. Told in his own words from hours of archived interviews, along with commentary from those closest to him, the documentary weaves the music and images from Sinatra’s life together with rarely seen footage of his famous 1971 “Retirement Concert” in Los Angeles. The film’s narrative is shaped by Sinatra’s song choices for that concert, which Gibney interprets as the singer’s personal guide through his own life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Sinatra Himself (archive footage) Gina Gershon Voice Of Ava Gardner Christine Baranski Voice Of Ruth Berle Vincent D'Onofrio Voice Of Dean Elson Full Cast & Crew Last Season Miniseries 2015 | 2 Episodes Season 1 of Sinatra: All or Nothing at All premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2013-02-15 History of the Eagles 7.6    2012-01-08 House of Lies 6.4    2004-07-18 Entourage 7.1    2014-01-12 True Detective 8.1    2013-02-01 House of Cards 8.2    1989-07-05 Seinfeld 8.2    2015-08-28 Narcos 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.hbo.com/documentaries/sinatra-all-or-nothing-at-all#/ Genres Documentary Keywords biography miniseries frank sinatra Content Score 86 Almost there... Top Contributors TB 23 TMDb Bot R 18 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}