{"link": "https://www.themoviedb.org/tv/64347?language=en", "title": "Amachan", "resume": "Amachan is the 88th 2013 NHK asadora written by Kankuro Kudo (Tiger and Dragon, Unobore Deka). It's about Amano Aki (Nounen Rena), a 16 year old girl from Tokyo who goes to her mother's former home in Sodegahama, a fishing village in Kitasanriku, Iwate prefecture for the summer break. She falls in love with the sea and its people, and decides to stay on to become an Ama (women divers who fetch clams and sea urchins for tourists) just like her grandmother, Natsu (Miyamoto Nobuko). Her decision is welcomed wholeheartedly by Natsu and the other locals. However, her mother Haruko (Koizumi Kyoko) does not like the idea at first. She has a strained relationship with Natsu, and her extreme dislike of the sea, diving and the countryside is one of the reasons why she left her hometown 24 years ago. Eventually, she decides to stay in Sodegahama with Aki, considering that she is contemplating on getting a divorce anyway and does not want to go back to her husband in Tokyo. She also notices that it might be good for Aki for she seems livelier and happier in Kitasanriku than in Tokyo. The road towards becoming a full-fledged Ama-san is tough for Aki as she encounters tests and hurdles. One day, a video of her as an Ama gets uploaded in the city's tourism website, transforming an ordinary high school girl into an overnight Internet sensation. Suddenly she is called upon to use this opportunity to attract tourists to a city suffering from depopulation.", "rate": 0, "genre": [], "cast": ["Non", "Ai Hashimoto", "Kyoko Koizumi", "Hiroko Yakushimaru", "Kasumi Arimura"], "character": ["Aki Amano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64347   Expand Amachan   (2013) User Score Overview Amachan is the 88th 2013 NHK asadora written by Kankuro Kudo (Tiger and Dragon, Unobore Deka). It's about Amano Aki (Nounen Rena), a 16 year old girl from Tokyo who goes to her mother's former home in Sodegahama, a fishing village in Kitasanriku, Iwate prefecture for the summer break. She falls in love with the sea and its people, and decides to stay on to become an Ama (women divers who fetch clams and sea urchins for tourists) just like her grandmother, Natsu (Miyamoto Nobuko). Her decision is welcomed wholeheartedly by Natsu and the other locals. However, her mother Haruko (Koizumi Kyoko) does not like the idea at first. She has a strained relationship with Natsu, and her extreme dislike of the sea, diving and the countryside is one of the reasons why she left her hometown 24 years ago. Eventually, she decides to stay in Sodegahama with Aki, considering that she is contemplating on getting a divorce anyway and does not want to go back to her husband in Tokyo. She also notices that it might be good for Aki for she seems livelier and happier in Kitasanriku than in Tokyo. The road towards becoming a full-fledged Ama-san is tough for Aki as she encounters tests and hurdles. One day, a video of her as an Ama gets uploaded in the city's tourism website, transforming an ordinary high school girl into an overnight Internet sensation. Suddenly she is called upon to use this opportunity to attract tourists to a city suffering from depopulation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Non Aki Amano Ai Hashimoto Kyoko Koizumi Hiroko Yakushimaru Kasumi Arimura Full Cast & Crew Last Season Season 1 2013 | 156 Episodes Season 1 of Amachan premiered on April  1, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amachan. You can help by rating TV shows you've seen. Facts Original Name  あまちゃん Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www1.nhk.or.jp/amachan/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 32 m17 J 3 J-MovieBoi A 2 Aka75 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}