{"link": "https://www.themoviedb.org/tv/10964?language=en", "title": "Team Knight Rider", "resume": "Team Knight Rider is a syndicated television series that was adapted from the Knight Rider franchise and ran between 1997 and 1998. TKR was created by writer/producers Rick Copp and David A. Goodman, based on the original series created by Glen A. Larson, who was an executive producer. TKR was produced by Gil Wadsworth and Scott McAboy and was distributed by Universal Domestic Television and ran only a single season of 22 one-hour episodes before it was canceled due to poor ratings.\nThe story is about a new team of high-tech crime fighters assembled by the Foundation for Law and Government who follow in the tracks of the legendary Michael Knight and his supercar KITT. Instead of \"one man making a difference\", there are now five team members who each has a computerized talking vehicle counterpart. Like the original duo, TKR goes after notorious criminals who operate \"above the law\" – from spies and assassins, to terrorists and drug dealers. The final episode of the season, and series, featured the reappearance of Michael Knight, seen only from behind, at the very end.", "rate": 67, "genre": ["Action", "Adventure", "Drama"], "cast": ["Nia Vardalos", "John Kassir", "Tom Kane", "Kerrigan Mahan", "Nick Wechsler"], "character": ["Kevin \"Trek\" Sanders"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10964   Expand Team Knight Rider   (1997) User Score Overview Team Knight Rider is a syndicated television series that was adapted from the Knight Rider franchise and ran between 1997 and 1998. TKR was created by writer/producers Rick Copp and David A. Goodman, based on the original series created by Glen A. Larson, who was an executive producer. TKR was produced by Gil Wadsworth and Scott McAboy and was distributed by Universal Domestic Television and ran only a single season of 22 one-hour episodes before it was canceled due to poor ratings. The story is about a new team of high-tech crime fighters assembled by the Foundation for Law and Government who follow in the tracks of the legendary Michael Knight and his supercar KITT. Instead of \"one man making a difference\", there are now five team members who each has a computerized talking vehicle counterpart. Like the original duo, TKR goes after notorious criminals who operate \"above the law\" – from spies and assassins, to terrorists and drug dealers. The final episode of the season, and series, featured the reappearance of Michael Knight, seen only from behind, at the very end. Featured Crew Glen A. Larson Creator David A. Goodman Creator Rick Copp Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nia Vardalos John Kassir Tom Kane Kerrigan Mahan Nick Wechsler Kevin \"Trek\" Sanders Full Cast & Crew Last Season Season 1 1997 | 22 Episodes Season 1 of Team Knight Rider premiered on October  6, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1994-01-02 Viper 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords artificial intelligence vigilante car Content Score 93 Almost there... Top Contributors 11 Banana d 8 denis 4 Elizabeth Jennings 3 rtker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}