{"link": "https://www.themoviedb.org/tv/56219?language=en", "title": "Drunk History", "resume": "Historical reenactments from A-list talent as told by inebriated storytellers. A unique take on the familiar and less familiar people and events from America’s great past as great moments in history are retold with unforgettable results.", "rate": 69, "genre": ["Comedy"], "cast": ["Derek Waters"], "character": ["Himself - Host / Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56219   Expand Drunk History   (2013) User Score  Play Trailer Overview Historical reenactments from A-list talent as told by inebriated storytellers. A unique take on the familiar and less familiar people and events from America’s great past as great moments in history are retold with unforgettable results. Featured Crew Derek Waters Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Waters Himself - Host / Various Characters Full Cast & Crew Current Season Season 5 2018 | 13 Episodes Season 5 of Drunk History premiered on January 23, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2012-02-20 The Bleak Old Shop of Stuff 6.7    2013-04-19 Alpha House 7.3    2010-06-28 Huge 5.5    2011-10-17 Threesome 6.3    2012-01-31 Key & Peele 7.2    2007-08-06 Drunk History 6.6    2013-08-05 Quick Draw 6.3    2013-10-21 @midnight 5.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/drunk-history Genres Comedy Keywords history drunk american history Content Score 71 Just a little bit more... Top Contributors 39 Elizabeth Jennings b 8 basher t 8 tmdb45070722 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}