{"link": "https://www.themoviedb.org/tv/61247?language=en", "title": "Secret State", "resume": "Secret State explores the relationship between a democratically elected government, big business and the banks.", "rate": 73, "genre": ["Drama"], "cast": ["Gabriel Byrne", "Ralph Ineson", "Charles Dance", "Jamie Sives", "Gina McKee"], "character": ["Tom Dawkins", "Sgt. Wrigglesworth", "John Hodder", "Lee Foulds", "Ellis Kane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61247   Expand Secret State   (2012) User Score  Play Trailer Overview Secret State explores the relationship between a democratically elected government, big business and the banks. Featured Crew Ed Fraiman Creator Robert Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabriel Byrne Tom Dawkins Ralph Ineson Sgt. Wrigglesworth Charles Dance John Hodder Jamie Sives Lee Foulds Gina McKee Ellis Kane Full Cast & Crew Last Season Season 1 2012 | 4 Episodes Season 1 of Secret State premiered on November  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2013-05-10 Life of Crime 6.0    2014-02-16 Quirke 5.9    2006-11-02 The State Within 7.8    2013-01-04 Zen 7.7    2012-12-06 Transporter: The Series 5.5    1997-05-09 Jonathan Creek 7.7    2012-06-26 Line of Duty 8.0    2007-07-24 Damages 7.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage   http://www.channel4.com/programmes/secret-state Genres Drama Keywords politics conspiracy miniseries Content Score 100 Yes! Looking good! Top Contributors 18 Steve TB 15 TMDb Bot 13 Banana 12 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}