{"link": "https://www.themoviedb.org/tv/62486?language=en", "title": "Penn Zero: Part-Time Hero", "resume": "Penn Zero is not your average kid - every day he's zapped into another dimension with his friends to save the world.", "rate": 73, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Animation", "Comedy"], "cast": ["Thomas Middleditch", "Tania Gunadi", "Adam Devine", "Alfred Molina", "Larry Wilmore"], "character": ["Penn Zero", "Sashi Kobayashi", "Boone Wiseman", "Rippen", "Larry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62486   Expand Penn Zero: Part-Time Hero   (2014) User Score Overview Penn Zero is not your average kid - every day he's zapped into another dimension with his friends to save the world. Featured Crew Jared Bush Creator Sam Levine Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Thomas Middleditch Penn Zero Tania Gunadi Sashi Kobayashi Adam Devine Boone Wiseman Alfred Molina Rippen Larry Wilmore Larry Full Cast & Crew Last Season Season 1 2014 | 37 Episodes Season 1 of Penn Zero: Part-Time Hero premiered on December  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations   2015-03-28 Harvey Beaks 6.3  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  - Homepage   http://disneyxd.disney.com/penn-zero Genres Sci-Fi & Fantasy Action & Adventure Animation Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 26 Max the Movie Guy TB 5 TMDb Bot 4 bgiesing 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}