{"link": "https://www.themoviedb.org/tv/18352?language=en", "title": "The Garfield Show", "resume": "The Garfield Show is a French/American CGI animated television series that premiered in France on France 3 on December 22, 2008. English-language episodes started airing on Boomerang UK on May 5, 2009. It premiered in the United States on Cartoon Network on November 2, 2009, at 3:00pm. It also aired on YTV in Canada. However, it was taken off the air on May 30, 2011, for a hiatus and returned on September 6, 2011. The show was taken off the schedule in Canada once again on December 23, 2011.\nBased on the American comic strip, Garfield, the series is executive produced by Garfield creator, Jim Davis, and co-written and voice directed by Mark Evanier, who also wrote most of the episodes for the Garfield and Friends series. Returning from Garfield and Friends are the voice actors Julie Payne and Gregg Berger. Frank Welker replaces the late Lorenzo Music as the voice of Garfield, and Thom Huge, as the voice of Jon Arbuckle, is replaced by Wally Wingert. Also returning is David Lander, reprising his role as Doc Boy from the earlier Garfield prime-time special A Garfield Christmas Special. The show is produced by Dargaud Media and Paws Inc. The show is directed by Philippe Vidal and the music is done by Laurent Bertaud and Jean-Christophe Prudhomme.", "rate": 27, "genre": ["Animation", "Comedy"], "cast": ["Jason Marsden", "Frank Welker", "Gregg Berger", "Wally Wingert", "Julie Payne"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18352   Expand The Garfield Show   (2009) User Score Overview The Garfield Show is a French/American CGI animated television series that premiered in France on France 3 on December 22, 2008. English-language episodes started airing on Boomerang UK on May 5, 2009. It premiered in the United States on Cartoon Network on November 2, 2009, at 3:00pm. It also aired on YTV in Canada. However, it was taken off the air on May 30, 2011, for a hiatus and returned on September 6, 2011. The show was taken off the schedule in Canada once again on December 23, 2011. Based on the American comic strip, Garfield, the series is executive produced by Garfield creator, Jim Davis, and co-written and voice directed by Mark Evanier, who also wrote most of the episodes for the Garfield and Friends series. Returning from Garfield and Friends are the voice actors Julie Payne and Gregg Berger. Frank Welker replaces the late Lorenzo Music as the voice of Garfield, and Thom Huge, as the voice of Jon Arbuckle, is replaced by Wally Wingert. Also returning is David Lander, reprising his role as Doc Boy from the earlier Garfield prime-time special A Garfield Christmas Special. The show is produced by Dargaud Media and Paws Inc. The show is directed by Philippe Vidal and the music is done by Laurent Bertaud and Jean-Christophe Prudhomme. Featured Crew Jim Davis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Marsden Frank Welker Gregg Berger Wally Wingert Julie Payne Full Cast & Crew Last Season Season 3 2012 | 48 Episodes Season 3 of The Garfield Show premiered on September  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Garfield Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 11m Homepage   http://www.thegarfieldshow.com/ Genres Animation Comedy Keywords animation 3d Content Score 93 Almost there... Top Contributors 10 Maikkoum 7 t0by C 3 ClaudeH e 3 error666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}