{"link": "https://www.themoviedb.org/tv/12334?language=en", "title": "Clocking Off", "resume": "How much do you know about the person working next to you? From the outside, life at Mackintosh Textiles appears to run smoothly, but in a community with so many secrets to hide, things are far from straightforward. In six powerful, self-contained dramas, everyday life is fractured by tumultuous marriages, snatched passions, disappearing husbands and gang harassment.", "rate": 0, "genre": ["Drama"], "cast": ["David Morrissey", "Christopher Eccleston", "Philip Glenister", "Jason Merrells", "Siobhan Finneran"], "character": ["James 'Jim' Calvert", "James 'Mack' Mackintosh", "Martin Leach", "Julie O'Neill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12334   Expand Clocking Off   (2000) User Score Overview How much do you know about the person working next to you? From the outside, life at Mackintosh Textiles appears to run smoothly, but in a community with so many secrets to hide, things are far from straightforward. In six powerful, self-contained dramas, everyday life is fractured by tumultuous marriages, snatched passions, disappearing husbands and gang harassment. Featured Crew Paul Abbott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Morrissey Christopher Eccleston James 'Jim' Calvert Philip Glenister James 'Mack' Mackintosh Jason Merrells Martin Leach Siobhan Finneran Julie O'Neill Full Cast & Crew Last Season Season 4 2003 | 6 Episodes Season 4 of Clocking Off premiered on March  2, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Clocking Off. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  55m, 60m Homepage   https://www.bbc.co.uk/programmes/p00yrrxg Genres Drama Keywords factory worker factory northern england working class Content Score 93 Almost there... Top Contributors O 6 Ozbourne 4 kcdh R 4 Rebecca N 3 Noloter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}