{"link": "https://www.themoviedb.org/tv/71763?language=en", "title": "Alex, Inc.", "resume": "A brilliant radio journalist, husband, and father of two is about to do something crazy — quit his job and start his own company. He quickly discovers it’s going to be a lot harder than he thought.", "rate": 60, "genre": ["Comedy"], "cast": ["Zach Braff", "Tiya Sircar", "Hillary Anne Matthews", "Michael Imperioli", "Elisha Henig"], "character": ["Alex Schuman", "Rooni Schuman", "Deirdre", "Eddie", "Ben Schuman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71763   Expand Alex, Inc.   (2018) User Score  Play Trailer Overview A brilliant radio journalist, husband, and father of two is about to do something crazy — quit his job and start his own company. He quickly discovers it’s going to be a lot harder than he thought. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zach Braff Alex Schuman Tiya Sircar Rooni Schuman Hillary Anne Matthews Deirdre Michael Imperioli Eddie Elisha Henig Ben Schuman Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Alex, Inc. premiered on March 28, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply a Is this show any good? Open 2 by  acontributor Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Alex, Inc.. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://abc.go.com/shows/alex-inc Genres Comedy Keywords podcast Content Score 93 Almost there... Top Contributors 36 Elizabeth Jennings 11 Gabriel W. Almeida 7 Banana D 4 David1886  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}