{"link": "https://www.themoviedb.org/tv/61256?language=en", "title": "P. E. Teacher", "resume": "Retired mobster tries to get back in business by making friends with the kid of his ex-boss. To do so, he must became PE teacher in kid's school.", "rate": 63, "genre": ["Comedy"], "cast": ["Dmitriy Nagiev", "Alexandr Gordon", "Anastasiya Panina", "Polina Grenc", "Vladimir Sychev"], "character": ["Олег Евгеньевич Фомин (Фома)", "Виктор Николаевич Мамаев (Мамай)", "Татьяна Александровна Чернышова", "Александра Мамаева", "Алексей (Псих)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61256   Expand P. E. Teacher   (2014) User Score Overview Retired mobster tries to get back in business by making friends with the kid of his ex-boss. To do so, he must became PE teacher in kid's school. Featured Crew Sergey Sentsov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dmitriy Nagiev Олег Евгеньевич Фомин (Фома) Alexandr Gordon Виктор Николаевич Мамаев (Мамай) Anastasiya Panina Татьяна Александровна Чернышова Polina Grenc Александра Мамаева Vladimir Sychev Алексей (Псих) Full Cast & Crew Current Season Season 4 2017 | 16 Episodes Season 4 of P. E. Teacher premiered on October  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2010-11-08 Реальные пацаны 7.5    2008-08-25 Универ 4.3    2006-11-04 Our Russia 3.7    2010-03-29 Interny 5.7    2009-11-16 Воронины 5.3    School 5.4    2012-10-22 The Kitchen 8.0    2006-03-08 Happy Together 4.0  Facts Original Name  Физрук Status  Ended Network Certification  - Type  Scripted Original Language  Russian Runtime  25m Homepage   http://fizruk.tnt-online.ru/ Genres Comedy Keywords high school teacher mobster high school teacher sitcom Content Score 93 Almost there... Top Contributors 33 West@ DA 13 Dmitry A. Kuznetsov G 10 G_Keeper 9 mrtextortexel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}