{"link": "https://www.themoviedb.org/tv/4667?language=en", "title": "Andy Barker, P.I.", "resume": "Andy Barker, P.I. is an American detective sitcom starring Andy Richter produced and broadcast by NBC, and co-starring Tony Hale, Marshall Manesh, Harve Presnell and Clea Lewis.\nRichter plays Andy Barker, a certified public accountant who reluctantly becomes a private investigator after he is mistaken for the former office tenant, a private eye, now retired. Andy develops a taste for solving cases, assisted by the former P.I., a film buff owner of the downstairs video store, a surveillance-expert restaurateur and, as time goes on, his wife.\nThe show was produced for one season, and was scheduled to run a six-episode, five-week course starting Thursday, March 15, 2007 on NBC. However, the series was cancelled and removed from the Thursday lineup after the fourth episode aired. The final two episodes aired on Saturday, April 14. The series now airs on Universal HD.", "rate": 75, "genre": ["Mystery", "Comedy"], "cast": ["Marshall Manesh", "Harve Presnell", "Andy Richter", "Clea Lewis", "Tony Hale"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4667   Expand Andy Barker, P.I.   (2007) User Score Overview Andy Barker, P.I. is an American detective sitcom starring Andy Richter produced and broadcast by NBC, and co-starring Tony Hale, Marshall Manesh, Harve Presnell and Clea Lewis. Richter plays Andy Barker, a certified public accountant who reluctantly becomes a private investigator after he is mistaken for the former office tenant, a private eye, now retired. Andy develops a taste for solving cases, assisted by the former P.I., a film buff owner of the downstairs video store, a surveillance-expert restaurateur and, as time goes on, his wife. The show was produced for one season, and was scheduled to run a six-episode, five-week course starting Thursday, March 15, 2007 on NBC. However, the series was cancelled and removed from the Thursday lineup after the fourth episode aired. The final two episodes aired on Saturday, April 14. The series now airs on Universal HD. Featured Crew Conan O'Brien Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marshall Manesh Harve Presnell Andy Richter Clea Lewis Tony Hale Full Cast & Crew Last Season Season 1 2007 | 6 Episodes Season 1 of Andy Barker, P.I. premiered on March 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2010-09-21 Running Wilde 6.8    2010-09-28 No Ordinary Family 6.1    2009-03-18 Better Off Ted 7.7    2009-09-24 FlashForward 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m Homepage   http://www.nbc.com/Andy_Barker_PI/ Genres Mystery Comedy Keywords private investigator sitcom Content Score 93 Almost there... Top Contributors 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}