{"link": "https://www.themoviedb.org/tv/27813?language=en", "title": "MoonPhase", "resume": "Paranormal photographer Kouhei stumbles into the arms of Hazuki, a vampire beauty who has waited for years to be freed from a forgotten castle. Unwilling to part with her unwitting hero, the petite vamp follows Kouhei home and starts causing trouble. But domestic disorder is the least of Kouhei’s problems. With dark forces gathering, he’s about to enter a world he can’t begin to comprehend!", "rate": 73, "genre": ["Animation", "Comedy"], "cast": ["Chiwa Saito", "Hiroshi Kamiya"], "character": ["Hazuki (voice)", "Kouhei Morioka (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27813   Expand MoonPhase   (2004) User Score Overview Paranormal photographer Kouhei stumbles into the arms of Hazuki, a vampire beauty who has waited for years to be freed from a forgotten castle. Unwilling to part with her unwitting hero, the petite vamp follows Kouhei home and starts causing trouble. But domestic disorder is the least of Kouhei’s problems. With dark forces gathering, he’s about to enter a world he can’t begin to comprehend! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chiwa Saito Hazuki (voice) Hiroshi Kamiya Kouhei Morioka (voice) Full Cast & Crew Last Season Season 1 2004 | 25 Episodes Season 1 of MoonPhase premiered on October  5, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on MoonPhase. You can help by rating TV shows you've seen. Facts Original Name  月詠～MOON PHASE～ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.jvcmusic.co.jp/flyingdog/tsukuyomi Genres Animation Comedy Keywords vampire anthropomorphism based on manga spellcasting anime human vampire relationship Content Score 56 We're so close, yet so far. Top Contributors 72 Marr 🇳🇱 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}