{"link": "https://www.themoviedb.org/tv/4155?language=en", "title": "Game On", "resume": "A 1990s flat-share sitcom which, in its tales of the sexual adventures and misadventures of three twenty-somethings living under the same roof, featured more than a dash of crudity. Matthew, a wealthy, workshy landlord who, because of a strange phobia, never leaves the flat. Martin and Matthew have been friends since schooldays and Mandy's connection is by way of her best friend Claudia, Martin's sister.  Mandy is a bright young woman who wants to better herself and is tired of being treated as a sex object, yet she still tends to find herself jumping into bed with inappropriate men.  Both Matthew and Martin are obsessed with sex but neither is conspicuously successful in the field.", "rate": 71, "genre": ["Comedy"], "cast": ["Samantha Womack", "Neil Stuke", "Crispin Bonham-Carter", "Tracy Keating", "Matthew Cottle"], "character": ["Amanda 'Mandy' Wilkins", "Matthew Norman Malone", "Archie Glenister", "Clare Monahan", "Martin Henson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4155   Expand Game On   (1995) User Score Overview A 1990s flat-share sitcom which, in its tales of the sexual adventures and misadventures of three twenty-somethings living under the same roof, featured more than a dash of crudity. Matthew, a wealthy, workshy landlord who, because of a strange phobia, never leaves the flat. Martin and Matthew have been friends since schooldays and Mandy's connection is by way of her best friend Claudia, Martin's sister.  Mandy is a bright young woman who wants to better herself and is tired of being treated as a sex object, yet she still tends to find herself jumping into bed with inappropriate men.  Both Matthew and Martin are obsessed with sex but neither is conspicuously successful in the field. Featured Crew Andrew Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samantha Womack Amanda 'Mandy' Wilkins Neil Stuke Matthew Norman Malone Crispin Bonham-Carter Archie Glenister Tracy Keating Clare Monahan Matthew Cottle Martin Henson Full Cast & Crew Last Season Season 3 1998 | 6 Episodes Season 3 of Game On premiered on January  2, 1998. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Mandy: Happy Birthday Samantha Womack! Open 0 by wonder2wonder\n      \n     Samantha Janus/Womack Open 0 by krashd\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1991-01-03 The Mary Whitehouse Experience 8.0    1995-09-14 They Think It's All Over 7.3    1985-09-01 In Sickness and in Health 7.9    1989-11-16 Maid Marian and Her Merry Men 7.3    1986-01-14 Boon 4.8    1993-12-27 Shooting Stars 6.7    1993-11-18 Goodnight Sweetheart 8.2    1974-09-02 Rising Damp 7.8  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://bbc.co.uk/comedy/gameon/ Genres Comedy Keywords london england sex flat sexual humor agoraphobia sitcom british humour flatmates Content Score 93 Almost there... Top Contributors 30 Banana O 14 Ozbourne z 4 zurman1 R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}