{"link": "https://www.themoviedb.org/tv/1934?language=en", "title": "Meerkat Manor", "resume": "Meerkat Manor is a British television programme produced by Oxford Scientific Films for Animal Planet International that premiered in September 2005 and ran for four series until its cancellation in August 2008. Blending more traditional animal documentary style footage with dramatic narration, the series told the story of the Whiskers, one of more than a dozen families of meerkats in the Kalahari Desert being studied as part of the Kalahari Meerkat Project, a long-term field study into the ecological causes and evolutionary consequences of the cooperative nature of meerkats. The original programme was narrated by Bill Nighy, with the narration redubbed by Mike Goldman for the Australian airings and Sean Astin for the American broadcasts. The fourth series, subtitled The Next Generation, saw Stockard Channing replacing Astin as the narrator in the American dubbing.\nMeerkat Manor premiered in the United Kingdom on 12 September 2005, and the first 13-episode series concluded on 24 October 2005. With the success of the programme in the United Kingdom, Animal Planet started broadcasting it on its national channels in Australia, Canada, and the US. It has since been rebroadcast in more than 160 other countries. The fourth, and final, series aired initially in the United States from 6 June 2008 to 22 August 2008; it aired in the United Kingdom in April 2009. In August 2009, it was reported that the programme had been cancelled.", "rate": 83, "genre": ["Documentary", "Drama"], "cast": ["Bill Nighy", "Stockard Channing", "Sean Astin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1934   Expand Meerkat Manor   (2005) User Score Overview Meerkat Manor is a British television programme produced by Oxford Scientific Films for Animal Planet International that premiered in September 2005 and ran for four series until its cancellation in August 2008. Blending more traditional animal documentary style footage with dramatic narration, the series told the story of the Whiskers, one of more than a dozen families of meerkats in the Kalahari Desert being studied as part of the Kalahari Meerkat Project, a long-term field study into the ecological causes and evolutionary consequences of the cooperative nature of meerkats. The original programme was narrated by Bill Nighy, with the narration redubbed by Mike Goldman for the Australian airings and Sean Astin for the American broadcasts. The fourth series, subtitled The Next Generation, saw Stockard Channing replacing Astin as the narrator in the American dubbing. Meerkat Manor premiered in the United Kingdom on 12 September 2005, and the first 13-episode series concluded on 24 October 2005. With the success of the programme in the United Kingdom, Animal Planet started broadcasting it on its national channels in Australia, Canada, and the US. It has since been rebroadcast in more than 160 other countries. The fourth, and final, series aired initially in the United States from 6 June 2008 to 22 August 2008; it aired in the United Kingdom in April 2009. In August 2009, it was reported that the programme had been cancelled. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Nighy Stockard Channing Sean Astin Full Cast & Crew Last Season Season 4 2008 | 13 Episodes Season 4 of Meerkat Manor premiered on June  6, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  2 Recommendations   2007-09-19 Kitchen Nightmares 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage   http://www.discoverychannel.co.uk/animalplanet/meerkat_manor/ Genres Documentary Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}