{"link": "https://www.themoviedb.org/tv/61658?language=en", "title": "The Field of Blood", "resume": "Adaptation of Denise Mina's thriller set in 1982. When the story of a murder has huge implications for her family, newspaper copy boy Paddy Meehan battles prejudices to get to the truth. As she inches closer to revealing the truth, her investigations place her in mortal danger.", "rate": 50, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Jayd Johnson", "David Morrissey", "Kelsey Griffin", "Bronagh Gallagher", "Matt Costello"], "character": ["Paddy Meehan", "Murray Devlin", "Mary Ann Meehan", "Trisha Meehan", "Con Meehan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61658   Expand The Field of Blood   (2011) User Score  Play Trailer Overview Adaptation of Denise Mina's thriller set in 1982. When the story of a murder has huge implications for her family, newspaper copy boy Paddy Meehan battles prejudices to get to the truth. As she inches closer to revealing the truth, her investigations place her in mortal danger. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jayd Johnson Paddy Meehan David Morrissey Murray Devlin Kelsey Griffin Mary Ann Meehan Bronagh Gallagher Trisha Meehan Matt Costello Con Meehan Full Cast & Crew Last Season Series 2 2013 | 2 Episodes Season 2 of The Field of Blood premiered on August  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   1992-12-06 A Touch of Frost 7.9    1997-05-09 Jonathan Creek 7.7  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b037z2yj Genres Crime Drama Mystery Keywords scotland glasgow journalism 1980s Content Score 93 Almost there... Top Contributors 23 Steve 20 Elizabeth Jennings 11 Banana 5 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}