{"link": "https://www.themoviedb.org/tv/80186?language=en", "title": "The Taoism Grandmaster", "resume": "It has been foretold over three thousand years ago that the apocalypse is impending and that one Taoist grandmaster will emerge to save the world. To give the people a fighting chance, the immortals have gathered a team of gifted individuals in search for the sacred shield.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80186   Expand The Taoism Grandmaster   (2018) User Score Overview It has been foretold over three thousand years ago that the apocalypse is impending and that one Taoist grandmaster will emerge to save the world. To give the people a fighting chance, the immortals have gathered a team of gifted individuals in search for the sacred shield. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 20 Episodes Season 1 of The Taoism Grandmaster premiered on May 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Taoism Grandmaster. You can help by rating TV shows you've seen. Facts Original Name  玄门大师 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  47m Homepage   http://www.iqiyi.com/a_19rrha4rz5.html Genres Action & Adventure Drama Keywords martial arts Content Score 56 We're so close, yet so far. Top Contributors l 25 lic 10 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}