{"link": "https://www.themoviedb.org/tv/3482?language=en", "title": "Beautiful People", "resume": "Beautiful People is an American drama television series about a family that moves from New Mexico to The Big Apple to make a fresh start on their lives. The series aired on the ABC Family Network from August 8, 2005, to April 24, 2006, lasting sixteen episodes. Its executive producer was Paul Stupin, who played the same role for Dawson's Creek. Both Daphne Zuniga and Torrey DeVitto later appeared on the fifth and sixth season of One Tree Hill as major recurring roles, although they never shared any screen time.", "rate": 53, "genre": ["Drama"], "cast": ["Sarah Foret", "Torrey DeVitto", "Daphne Zuniga", "Ricky Mabe", "Jackson Rathbone"], "character": ["Sophie Kerr", "Karen Kerr", "Lynn Kerr", "Gideon Lustig", "Nicholas Fiske"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3482   Expand Beautiful People   (2005) User Score Overview Beautiful People is an American drama television series about a family that moves from New Mexico to The Big Apple to make a fresh start on their lives. The series aired on the ABC Family Network from August 8, 2005, to April 24, 2006, lasting sixteen episodes. Its executive producer was Paul Stupin, who played the same role for Dawson's Creek. Both Daphne Zuniga and Torrey DeVitto later appeared on the fifth and sixth season of One Tree Hill as major recurring roles, although they never shared any screen time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Foret Sophie Kerr Torrey DeVitto Karen Kerr Daphne Zuniga Lynn Kerr Ricky Mabe Gideon Lustig Jackson Rathbone Nicholas Fiske Full Cast & Crew Last Season Season 1 2005 | 16 Episodes Season 1 of Beautiful People premiered on August  8, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beautiful People. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage   http://www.sonypictures.com/homevideo/beautifulpeople-thecompleteseries/index.html Genres Drama Keywords high school new york single mother teen drama Content Score 86 Almost there... Top Contributors 20 Banana a 4 asusar b 4 bugfix s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}