{"link": "https://www.themoviedb.org/tv/2357?language=en", "title": "Edgemont", "resume": "Edgemont is a Canadian television series that aired from 2001 to 2005. It revolved around the everyday dealings of teenagers in Edgemont, a fictitious suburb of Vancouver, British Columbia.\nThe 30-minute show delved into the lives of students at McKinley High School. The plots contained romance, intrigue, jealousy, and all the other elements associated with the adolescent and secondary school scene. They also explored various social issues, such as racism and homosexuality.\nEdgemont debuted January 4, 2001, on CBC Television, and aired its final episode on July 21, 2005. There were a total of 70 episodes during its five-season run; the fifth season was shown commercial-free on the CBC. The series was created by Ian Weir, who also served as executive producer along with Michael Chechik. It was shot in the basement of the CBC Studios in Downtown Vancouver.\nThe program became moderately successful in Canada, including Quebec where the series has been dubbed in French, and also aired in the United States on the Fox Family Channel. Today reruns air in the U.S. on some local stations, and nationally it airs Sunday mornings on Me-TV, as part of the network's E/I-mandated programming. It also aired in several other countries, including France.", "rate": 68, "genre": ["Drama"], "cast": ["Dominic Zamprogna", "Grace Park", "P. J. Prinsloo", "Kristin Kreuk", "Sarah Lind"], "character": ["Shannon Ng", "Laurel Yeung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2357   Expand Edgemont   (2001) User Score Overview Edgemont is a Canadian television series that aired from 2001 to 2005. It revolved around the everyday dealings of teenagers in Edgemont, a fictitious suburb of Vancouver, British Columbia. The 30-minute show delved into the lives of students at McKinley High School. The plots contained romance, intrigue, jealousy, and all the other elements associated with the adolescent and secondary school scene. They also explored various social issues, such as racism and homosexuality. Edgemont debuted January 4, 2001, on CBC Television, and aired its final episode on July 21, 2005. There were a total of 70 episodes during its five-season run; the fifth season was shown commercial-free on the CBC. The series was created by Ian Weir, who also served as executive producer along with Michael Chechik. It was shot in the basement of the CBC Studios in Downtown Vancouver. The program became moderately successful in Canada, including Quebec where the series has been dubbed in French, and also aired in the United States on the Fox Family Channel. Today reruns air in the U.S. on some local stations, and nationally it airs Sunday mornings on Me-TV, as part of the network's E/I-mandated programming. It also aired in several other countries, including France. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dominic Zamprogna Grace Park Shannon Ng P. J. Prinsloo Kristin Kreuk Laurel Yeung Sarah Lind Full Cast & Crew Last Season Season 5 2005 | 13 Episodes Season 5 of Edgemont premiered on April 28, 2005. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Least favorite and favorite couple? Open 0 by MirrorMask\n      \n     Kristin Kreuk Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Edgemont. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.edgemont.tv/ Genres Drama Keywords high school vancouver teen drama teen social issues Content Score 86 Almost there... Top Contributors 8 Banana s 3 speedycars w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}