{"link": "https://www.themoviedb.org/tv/15082?language=en", "title": "Summer Heights High", "resume": "Summer Heights High is an Australian television mockumentary series written by and starring Chris Lilley. It is a parody of high-school life epitomised by its three protagonists: effeminate and megalomaniacal \"Director of Performing Arts\" Mr G; self-absorbed, privileged teenager Ja'mie King; and disobedient, vulgar Tongan student Jonah Takalua. All played by Lilley, the characters never interact. It lampoons Australian high school life and many aspects of the human condition and is filmed in a documentary style, with non-actors playing supporting characters.\nFollowing a similar format to Lilley's previous series, We Can Be Heroes: Finding The Australian of the Year, Lilley plays multiple characters in the show. Filmed in Melbourne at Brighton Secondary College, the series premiered on 5 September 2007 at 9:30 pm on ABC TV and continued for eight weekly episodes until 24 October 2007. Each episode was also released as a weekly podcast directly after its screening via both the official website and through any RSS podcast client in either WMV or MPEG-4.\nSummer Heights High was a massive ratings success for the Australian Broadcasting Corporation, and was met with mostly positive critical reaction. In 2008, the series won a Logie Award for Most Popular Light Entertainment/Comedy Program.", "rate": 74, "genre": ["Comedy"], "cast": ["Chris Lilley", "David Lennie", "Asolima Tauti", "Asolima Tauati", "Iro Utaifeau"], "character": ["Ja'mie / ...", "Doug Peterson", "Leon", "Joseph"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15082   Expand Summer Heights High   (2007) User Score  Play Trailer Overview Summer Heights High is an Australian television mockumentary series written by and starring Chris Lilley. It is a parody of high-school life epitomised by its three protagonists: effeminate and megalomaniacal \"Director of Performing Arts\" Mr G; self-absorbed, privileged teenager Ja'mie King; and disobedient, vulgar Tongan student Jonah Takalua. All played by Lilley, the characters never interact. It lampoons Australian high school life and many aspects of the human condition and is filmed in a documentary style, with non-actors playing supporting characters. Following a similar format to Lilley's previous series, We Can Be Heroes: Finding The Australian of the Year, Lilley plays multiple characters in the show. Filmed in Melbourne at Brighton Secondary College, the series premiered on 5 September 2007 at 9:30 pm on ABC TV and continued for eight weekly episodes until 24 October 2007. Each episode was also released as a weekly podcast directly after its screening via both the official website and through any RSS podcast client in either WMV or MPEG-4. Summer Heights High was a massive ratings success for the Australian Broadcasting Corporation, and was met with mostly positive critical reaction. In 2008, the series won a Logie Award for Most Popular Light Entertainment/Comedy Program. Featured Crew Chris Lilley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Lilley Ja'mie / ... David Lennie Doug Peterson Asolima Tauti Asolima Tauati Leon Iro Utaifeau Joseph Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Summer Heights High premiered on September  5, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply 10 years, unreal! Open 0 by Dave\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2011-05-11 Angry Boys 6.5    2014-05-07 Jonah From Tonga 6.6    2013-10-30 Ja'mie: Private School Girl 6.7    2013-01-16 Kroll Show 7.1    2008-09-28 The Life & Times of Tim 7.6    2008-01-04 Between Two Ferns with Zach Galifianakis 8.1    1994-11-04 Harry Enfield and Chums 7.8    1998-11-09 Big Train 7.5  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  30m, 27m Homepage   http://www.abc.net.au/tv/summerheightshigh/ Genres Comedy Keywords high school breakdance graffiti australian musical down syndrome attention deficit hyperactivity disorder (adhd) teacher school dog public school sitcom polynesian breakdancing tonga queen bee drama teacher ritalin popular girl bitch Content Score 100 Yes! Looking good! Top Contributors TB 75 TMDb Bot 3 Banana s 3 speedycars M 2 MAthePA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}