{"link": "https://www.themoviedb.org/tv/69796?language=en", "title": "KLEM", "resume": "A man who works for the tax authorities ends up becoming friends with a dangerous criminal after their daughters become best friends and he accidentally saves his life", "rate": 70, "genre": ["Drama"], "cast": ["Jacob Derwig", "Georgina Verbaan", "Barry Atsma", "Marie-Mae van Zuilen", "Yenthe Bos"], "character": ["Marius Milner", "Kitty van Mook", "Hugo Warmond", "Laura Warmond", "Suzan Warmond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69796   Expand KLEM   (2017) User Score Overview A man who works for the tax authorities ends up becoming friends with a dangerous criminal after their daughters become best friends and he accidentally saves his life Featured Crew Frank Ketelaar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jacob Derwig Marius Milner Georgina Verbaan Kitty van Mook Barry Atsma Hugo Warmond Marie-Mae van Zuilen Laura Warmond Yenthe Bos Suzan Warmond Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of KLEM premiered on January 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on KLEM. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  50m Homepage   http://programma.vara.nl/klem Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors BH 42 Barkruk Henkie 8 Erik Groenhuijzen a 6 andre.meulemans 6 sissing  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}