{"link": "https://www.themoviedb.org/tv/40290?language=en", "title": "MasterChef", "resume": "This hit cooking competition series sees award-winning chef Gordon Ramsay and other celebrity chefs put a group of contestants through a series of challenges and elimination rounds, in order to turn one home cook into a culinary master.", "rate": 69, "genre": ["Reality"], "cast": ["Gordon Ramsay"], "character": ["Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40290   Expand MasterChef   (2010) User Score  Play Trailer Overview This hit cooking competition series sees award-winning chef Gordon Ramsay and other celebrity chefs put a group of contestants through a series of challenges and elimination rounds, in order to turn one home cook into a culinary master. Featured Crew Franc Roddam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  11 Images Backdrops  10 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gordon Ramsay Himself - Judge Full Cast & Crew Current Season Season 9 2018 | 7 Episodes Season 9 of MasterChef premiered on May 30, 2018. View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply There are no discussions for MasterChef. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  8 Recommendations   2005-05-30 Hell's Kitchen 6.3    2011-09-21 The X Factor 4.4    2001-09-05 The Amazing Race 6.4    2004-01-08 The Celebrity Apprentice 4.2    2011-01-19 Restaurant: Impossible 5.7    2005-07-20 So You Think You Can Dance 6.5    2004-04-27 Ramsay's Kitchen Nightmares 7.0    1958-09-06 Wanted: Dead or Alive 7.6  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  80m, 42m Homepage   http://www.fox.com/masterchef/ Genres Reality Keywords competition cooking cooking competition Content Score 71 Just a little bit more... Top Contributors 63 Elizabeth Jennings f 29 ferdinalmarkok TB 25 TMDb Bot a 8 amazonkodi4  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}