{"link": "https://www.themoviedb.org/tv/76468?language=en", "title": "Miss Marple: At Bertram's Hotel", "resume": "There's a murder at the elegant hotel where Miss Marple is staying and international adventurer Bess Sedgwick is the prime suspect.", "rate": 67, "genre": ["Drama", "Crime"], "cast": ["Joan Hickson", "Caroline Blakiston", "James Cossins", "Joan Greenwood", "George Baker"], "character": ["Miss Jane Marple", "Bess Sedgwick", "Colonel Luscombe", "Selina Hazy", "Chief Inspector Fred Davy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76468   Expand Miss Marple: At Bertram's Hotel   (1987) User Score Overview There's a murder at the elegant hotel where Miss Marple is staying and international adventurer Bess Sedgwick is the prime suspect. Featured Crew Agatha Christie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joan Hickson Miss Jane Marple Caroline Blakiston Bess Sedgwick James Cossins Colonel Luscombe Joan Greenwood Selina Hazy George Baker Chief Inspector Fred Davy Full Cast & Crew Last Season Miniseries 1987 | 2 Episodes Season 1 of Miss Marple: At Bertram's Hotel premiered on January 25, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   1987-01-11 Miss Marple: Sleeping Murder 7.0    1985-03-07 Miss Marple: A Pocketful of Rye 6.8    1985-02-21 Miss Marple: The Moving Finger 7.7    1987-02-08 Miss Marple: Nemesis 7.5    1984-12-26 Miss Marple: The Body in the Library 6.7    1985-02-28 Miss Marple: A Murder Is Announced 5.7    1994-10-03 Space Precinct 6.0    1997-05-18 Wyrd Sisters 6.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://www.bbc.co.uk/programmes/b00glldq Genres Drama Crime Keywords based on novel or book detective amateur detective miniseries woman director Content Score 93 Almost there... Top Contributors TB 45 TMDb Bot 22 Banana z 9 zoroman1975  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}