{"link": "https://www.themoviedb.org/tv/70468?language=en", "title": "The Dragon Dentist", "resume": "he story takes place in Dragon Country. Nonoko is a newly appointed dentist and her mission is to protect the dragon, the guardian of the country, from tooth-cavity bacteria.\nOne day, amid increasingly fierce battles with the neighboring country, Nonoko finds on the dragon's tooth an unconscious boy soldier from the enemy country. His name is Bell, and he has been resurrected from inside the tooth by the dragon—a supernatural phenomenon that legend says occurs before a major disaster. As Nonoko and Bell go through a series of fierce battles, they eventually learn to accept their fate.", "rate": 10, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Suzuki Matsuo", "Nobuhiko Okamoto", "Megumi Hayashibara", "Kouichi Yamadera", "Fumika Shimizu"], "character": ["Salvatore Bianco (voice)", "Bell (voice)", "Shibana (voice)", "Godo (voice)", "Nonoko Kishii (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70468   Expand The Dragon Dentist   (2017) User Score  Play Trailer Overview he story takes place in Dragon Country. Nonoko is a newly appointed dentist and her mission is to protect the dragon, the guardian of the country, from tooth-cavity bacteria. One day, amid increasingly fierce battles with the neighboring country, Nonoko finds on the dragon's tooth an unconscious boy soldier from the enemy country. His name is Bell, and he has been resurrected from inside the tooth by the dragon—a supernatural phenomenon that legend says occurs before a major disaster. As Nonoko and Bell go through a series of fierce battles, they eventually learn to accept their fate. Featured Crew Kazuya Tsurumaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Suzuki Matsuo Salvatore Bianco (voice) Nobuhiko Okamoto Bell (voice) Megumi Hayashibara Shibana (voice) Kouichi Yamadera Godo (voice) Fumika Shimizu Nonoko Kishii (voice) Full Cast & Crew Last Season Season 1 2017 | 2 Episodes Season 1 of The Dragon Dentist premiered on February 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Dragon Dentist. You can help by rating TV shows you've seen. Facts Original Name  龍の歯医者 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  46m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 27 Mikedeth5 a 11 asura766 W 9 Wingman 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}