{"link": "https://www.themoviedb.org/tv/61816?language=en", "title": "The Slap", "resume": "A family drama that explodes from one small incident where a man slaps another couple's misbehaving child. This seemingly minor domestic dispute pulls the family apart, exposes long-held secrets, and ignites a lawsuit that challenges the core values of all who are pulled into it.", "rate": 58, "genre": ["Drama"], "cast": ["Peter Sarsgaard", "Thandie Newton", "Zachary Quinto", "Uma Thurman", "Brian Cox"], "character": ["Hector", "Aisha", "Harry", "Anouk", "Manolis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61816   Expand The Slap   (2015) User Score  Play Trailer Overview A family drama that explodes from one small incident where a man slaps another couple's misbehaving child. This seemingly minor domestic dispute pulls the family apart, exposes long-held secrets, and ignites a lawsuit that challenges the core values of all who are pulled into it. Featured Crew Walter F. Parkes Creator Jon Robin Baitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Sarsgaard Hector Thandie Newton Aisha Zachary Quinto Harry Uma Thurman Anouk Brian Cox Manolis Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of The Slap premiered on February 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2015-08-25 Public Morals 7.5    2016-06-26 Roadies 5.7    2015-01-11 Togetherness 6.0    2013-02-19 Cult 4.2    2006-09-24 Brothers and Sisters 6.8    2014-09-26 Transparent 6.7    2015-03-05 American Crime 6.6    2015-05-28 Aquarius 6.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  - Homepage   http://www.nbc.com/the-slap Genres Drama Keywords miniseries domestic violence Content Score 100 Yes! Looking good! Top Contributors 20 Elizabeth Jennings 18 Steve z 6 zurman1 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}