{"link": "https://www.themoviedb.org/tv/12983?language=en", "title": "In de gloria", "resume": "In de gloria was a Flemish sketch comedy show by Jan Eelen that ran on the Canvas television station in the period 2000–2002. It ran for 2 seasons, each containing 10 episodes. The show featured fictitious television reports presented as if they were real. In De Gloria was a satire on reality television and human interest programs featuring ordinary people, portrayed by the cast. The title translates to \"in the glory\".", "rate": 87, "genre": ["Comedy"], "cast": ["Wim Opbrouck", "Sien Eggers", "Frank Focketyn", "Kris Focketyn", "An Miller"], "character": ["Kris Vermaelen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12983   Expand In de gloria   (2000) User Score Overview In de gloria was a Flemish sketch comedy show by Jan Eelen that ran on the Canvas television station in the period 2000–2002. It ran for 2 seasons, each containing 10 episodes. The show featured fictitious television reports presented as if they were real. In De Gloria was a satire on reality television and human interest programs featuring ordinary people, portrayed by the cast. The title translates to \"in the glory\". Featured Crew Jan Eelen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wim Opbrouck Sien Eggers Frank Focketyn Kris Focketyn Kris Vermaelen An Miller Full Cast & Crew Last Season Season 2 2001 | 10 Episodes Season 2 of In de gloria premiered on February 23, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2009-01-01 Van Vlees en Bloed 8.6    2012-04-29 Quiz Me Quick 8.8    2004-01-31 The Island 8.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  30m Homepage   http://www.indegloria.be Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 14 timmie87 3 jonabeer 2 Ward Muylaert  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}