{"link": "https://www.themoviedb.org/tv/68373?language=en", "title": "Eyewitness", "resume": "Two 15 year old boys secretly meet up in the forest, only to witness a blood bath. They are seen, but escape trying to keep this as a secret, both in fear of the perpetrator and that their secret is revealed.", "rate": 87, "genre": ["Drama", "Crime"], "cast": ["Kim Sørensen", "Yngve Berven", "Ingjerd Egeberg", "Reidar Sørensen", "Bjørn Skagestad"], "character": ["Olle", "André", "Elisabeth", "President Sixers", "Svend"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68373   Expand Eyewitness   (2014) User Score  Play Trailer Overview Two 15 year old boys secretly meet up in the forest, only to witness a blood bath. They are seen, but escape trying to keep this as a secret, both in fear of the perpetrator and that their secret is revealed. Featured Crew Jarl Emsell Larsen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Sørensen Olle Yngve Berven André Ingjerd Egeberg Elisabeth Reidar Sørensen President Sixers Bjørn Skagestad Svend Full Cast & Crew Last Season Season 1 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Eyewitness. You can help by rating TV shows you've seen. Facts Original Name  Øyevitne Status  Ended Network Certification  - Type  Miniseries Original Language  Norwegian Runtime  60m Homepage   https://tv.nrk.no/serie/oeyevitne Genres Drama Crime Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors TB 14 TMDb Bot 14 brunnogama 10 Bendik o 7 olgenia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}