{"link": "https://www.themoviedb.org/tv/38179?language=en", "title": "Ross Kemp: Extreme World", "resume": "Ross Kemp travels around the world talking to people involved in illicit trades, locals who have been affected by violence and hardship, and the authorities who are attempting to combat the problems. In each episode he attempts to establish contacts within the groups in order to get close to the ringleaders.", "rate": 82, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38179   Expand Ross Kemp: Extreme World   (2011) User Score  Play Trailer Overview Ross Kemp travels around the world talking to people involved in illicit trades, locals who have been affected by violence and hardship, and the authorities who are attempting to combat the problems. In each episode he attempts to establish contacts within the groups in order to get close to the ringleaders. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2016 | 5 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Ross Kemp: Extreme World. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1995-01-29 Hercules: The Legendary Journeys 6.3  Facts Status  Returning Series Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords travel social issues Content Score 64 We're so close, yet so far. Top Contributors 8 Banana JB 6 Josef Brychta r 4 rhlagrwl42 b 2 bobo33  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}