{"link": "https://www.themoviedb.org/tv/32710?language=en", "title": "Mr. Sunshine", "resume": "Ben Donovan is a self-involved manager of a second-rate San Diego sports arena who begins to re-evaluate his life on his 40th birthday. Working alongside him is his boss and arena owner, Crystal--attractive, powerful and highly erratic; Alice--the cute, tomboyish marketing director and Ben's friend with benefits; Alonzo--a former basketball player, handsome and unbelievably happy; Ben's assistant, Heather--pretty, sweet, but terrifying because she once lit a boyfriend on fire; Crystal's son, Roman--sweet-faced, clueless and Ben's newest employee; and a hapless operations crew whom Ben refers to collectively as the \"Steves.\"", "rate": 65, "genre": ["Comedy"], "cast": ["Matthew Perry", "Andrea Anders", "Allison Janney", "James Lesure", "Portia Doubleday"], "character": ["Ben Donovan", "Alice", "Crystal Cohen", "Alonzo", "Heather"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32710   Expand Mr. Sunshine   (2011) User Score  Play Trailer Overview Ben Donovan is a self-involved manager of a second-rate San Diego sports arena who begins to re-evaluate his life on his 40th birthday. Working alongside him is his boss and arena owner, Crystal--attractive, powerful and highly erratic; Alice--the cute, tomboyish marketing director and Ben's friend with benefits; Alonzo--a former basketball player, handsome and unbelievably happy; Ben's assistant, Heather--pretty, sweet, but terrifying because she once lit a boyfriend on fire; Crystal's son, Roman--sweet-faced, clueless and Ben's newest employee; and a hapless operations crew whom Ben refers to collectively as the \"Steves.\" Featured Crew Matthew Perry Creator Marc Firek Creator Alex Barnow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Perry Ben Donovan Andrea Anders Alice Allison Janney Crystal Cohen James Lesure Alonzo Portia Doubleday Heather Full Cast & Crew Last Season (2011) Season 1 2011 | 13 Episodes Season 1 of Mr. Sunshine premiered on February  9, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  8 Recommendations   2007-03-19 Wilfred 7.8    2013-01-16 Kroll Show 7.1    2013-01-17 Newsreaders 7.6    1984-02-26 Spitting Image 7.8    2011-07-21 NTSF:SD:SUV:: 6.3    1987-03-09 French & Saunders 7.4    2008-09-24 Gary Unmarried 5.1    2006-09-18 Studio 60 on the Sunset Strip 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.abc.go.com/shows/mr-sunshine Genres Comedy Keywords arena san diego sports arena workplace comedy Content Score 100 Yes! Looking good! Top Contributors 7 isavedtheday 6 Simon V. 5 Banana s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}