{"link": "https://www.themoviedb.org/tv/79008?language=en", "title": "Luis Miguel: The Series", "resume": "The series dramatizes the life story of Mexican superstar singer Luis Miguel, who has captivated audiences in Latin America and beyond for decades.", "rate": 90, "genre": ["Drama"], "cast": ["Diego Boneta", "Óscar Jaenada", "Juan Pablo Zurita", "César Bordón", "Anna Favella"], "character": ["Luis Miguel", "Luis Rey", "Alex", "Hugo López", "Marcela"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79008   Expand Luis Miguel: The Series   (2018) User Score  Play Trailer Overview The series dramatizes the life story of Mexican superstar singer Luis Miguel, who has captivated audiences in Latin America and beyond for decades. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diego Boneta Luis Miguel Óscar Jaenada Luis Rey Juan Pablo Zurita Alex César Bordón Hugo López Anna Favella Marcela Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Luis Miguel: The Series premiered on April 22, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Luis Miguel: The Series. You can help by rating TV shows you've seen. Facts Original Name  Luis Miguel: La Serie Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  Spanish; Castilian Runtime  50m Homepage   http://www.telemundo.com/series-y-novelas/luis-miguel-la-serie Genres Drama Keywords fictionalized biography spanish singer Content Score 93 Almost there... Top Contributors 28 Mikedeth5 11 Elizabeth Jennings 8 Punk 2 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}