{"link": "https://www.themoviedb.org/tv/84?language=en", "title": "Mega64", "resume": "Mega64 is a low-budget series of comedy skits centered on video games created by Rocco Botte, Derrick Acosta and Shawn Chatfield. Originally conceived to be a public-access television show, the five episodes produced were later released on DVD as Mega64 Version 1 in 2004.\nAs of July 2012, two further DVDs have been released in 2006 and 2010 respectively titled Version 2 and Version 3 with six episodes apiece as well as two further DVDs comprising sketches and commercials the group has produced for gaming companies and websites including Ubisoft and IGN. Special editions of both Versions 1 and 2 were also released in 2008 and 2011 respectively.\nThe Mega64 team are also responsible for the Gamedays event at Disneyland, a now annual event started in 2011. The event serves as both a meet and greet for the crew and fans and also as a popular event to explore the secrets of Disneyland, of which the members of Mega64 are renowned fans.", "rate": 0, "genre": ["Comedy"], "cast": ["Derrick Acosta", "Rocco Botte", "Shawn Chatfield"], "character": ["Horatio", "Dr. Poque", "Marcus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 84   Expand Mega64   (2004) User Score Overview Mega64 is a low-budget series of comedy skits centered on video games created by Rocco Botte, Derrick Acosta and Shawn Chatfield. Originally conceived to be a public-access television show, the five episodes produced were later released on DVD as Mega64 Version 1 in 2004. As of July 2012, two further DVDs have been released in 2006 and 2010 respectively titled Version 2 and Version 3 with six episodes apiece as well as two further DVDs comprising sketches and commercials the group has produced for gaming companies and websites including Ubisoft and IGN. Special editions of both Versions 1 and 2 were also released in 2008 and 2011 respectively. The Mega64 team are also responsible for the Gamedays event at Disneyland, a now annual event started in 2011. The event serves as both a meet and greet for the crew and fans and also as a popular event to explore the secrets of Disneyland, of which the members of Mega64 are renowned fans. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derrick Acosta Horatio Rocco Botte Dr. Poque Shawn Chatfield Marcus Full Cast & Crew Last Season Season 5 — | 6 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mega64. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mega64.com/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 viapicante J 1 Jenn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}