{"link": "https://www.themoviedb.org/tv/51036?language=en", "title": "Killer Women", "resume": "Of all the notorious lawmen that ever patrolled the violent frontier, none are more storied than ballsy and badass Molly Parker, one of the first women to join the Texas Rangers.", "rate": 48, "genre": ["Western", "Drama"], "cast": ["Marc Blucas", "Tricia Helfer", "Alex Fernandez", "Marta Milans", "Michael Trucco"], "character": ["Dan Winston", "Molly Parker", "Lt. Luis Zea", "Becca Parker", "Billy Parker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51036   Expand Killer Women   (2014) User Score  Play Trailer Overview Of all the notorious lawmen that ever patrolled the violent frontier, none are more storied than ballsy and badass Molly Parker, one of the first women to join the Texas Rangers. Featured Crew Hannah Shakespeare Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Blucas Dan Winston Tricia Helfer Molly Parker Alex Fernandez Lt. Luis Zea Marta Milans Becca Parker Michael Trucco Billy Parker Full Cast & Crew Last Season Season 1 2014 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Marc Blucas! Open 0 by Columbusbuck\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2007-03-15 Raines 7.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://abc.go.com/shows/killer-women Genres Western Drama Keywords texas ranger female cop crime investigation Content Score 100 Yes! Looking good! Top Contributors 15 desoto 7 Banana 6 BudsieBuds R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}