{"link": "https://www.themoviedb.org/tv/2287?language=en", "title": "Batman", "resume": "Batman is a 1960s American live action television series, based on the DC comic book character of the same name. It stars Adam West as Batman and Burt Ward as Robin — two crime-fighting heroes who defend Gotham City. It aired on ABC for three seasons from January 12, 1966 to March 14, 1968. The show was aired twice weekly for its first two seasons, resulting in the production of a total of 120 episodes.", "rate": 71, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Adam West", "Burt Ward", "Alan Napier", "Neil Hamilton", "Stafford Repp"], "character": ["Batman", "Robin", "Alfred Pennyworth", "Comissioner James Gordon", "Chief Miles O'Hara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2287   Expand Batman   (1966) User Score Overview Batman is a 1960s American live action television series, based on the DC comic book character of the same name. It stars Adam West as Batman and Burt Ward as Robin — two crime-fighting heroes who defend Gotham City. It aired on ABC for three seasons from January 12, 1966 to March 14, 1968. The show was aired twice weekly for its first two seasons, resulting in the production of a total of 120 episodes. Featured Crew William Dozier Creator Bob Kane Creator Lorenzo Semple Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  3 Images Backdrops  22 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Adam West Batman Burt Ward Robin Alan Napier Alfred Pennyworth Neil Hamilton Comissioner James Gordon Stafford Repp Chief Miles O'Hara Full Cast & Crew Last Season Season 3 1967 | 26 Episodes Season 3 of Batman premiered on September 14, 1967. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply l Eli Wallach as Mr. Freeze Open 3 by  Knixon K Alfred, and Batgirl's secret identity Open 1 by  lima-2 w Robin: Happy Birthday Burt Ward! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  22 Posters  6 Recommendations   1964-09-17 Bewitched 7.1    1964-09-24 The Munsters 7.1    1976-09-18 The Muppet Show 7.8    1965-09-18 I Dream of Jeannie 7.1    1964-09-26 Gilligan's Island 6.6    1978-03-10 The Incredible Hulk 6.4    1960-09-30 The Flintstones 7.0    1964-09-22 The Man from U.N.C.L.E. 7.2  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Comedy Keywords gotham city dc comics superhero based on comic super power campy Content Score 100 Yes! Looking good! Top Contributors p 60 praetorian 18 Banana 16 jgcllp@gmail.com 11 Renato  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}