{"link": "https://www.themoviedb.org/tv/37939?language=en", "title": "The Phantom", "resume": "Chris Moore is shocked to learn that he was adopted and is actually the son of The Phantom, a caped crime fighter. He joins the Phantom team in the jungles of Bengalla to train in martial arts and combat, and emerges as the next Phantom.", "rate": 49, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Ryan Carnes", "Sandrine Holt", "Cameron Goodman", "Isabella Rossellini", "Cas Anvar"], "character": ["Chris Moore/Kit Walker", "Guran", "Renny Davidson", "Dr. Bella Lithia", "Raatib Anvar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37939   Expand The Phantom   (2009) User Score  Play Trailer Overview Chris Moore is shocked to learn that he was adopted and is actually the son of The Phantom, a caped crime fighter. He joins the Phantom team in the jungles of Bengalla to train in martial arts and combat, and emerges as the next Phantom. Featured Crew Daniel Knauf, Charles Knauf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  16 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Carnes Chris Moore/Kit Walker Sandrine Holt Guran Cameron Goodman Renny Davidson Isabella Rossellini Dr. Bella Lithia Cas Anvar Raatib Anvar Full Cast & Crew Last Season Season 1 2009 | 2 Episodes Season 1 of The Phantom premiered on December 22, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  16 Posters  7 Recommendations   2005-03-27 Colditz 6.3    2007-09-26 Bionic Woman 5.5    1996-09-19 The Pretender 7.3    2008-03-04 New Amsterdam 7.5    2006-06-26 Kyle XY 7.0    2005-09-19 Surface 6.6    2004-12-13 Legend of Earthsea 5.7    1982-10-01 Remington Steele 6.9  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.syfy.com/phantom/ Genres Action & Adventure Crime Drama Keywords superhero based on comic vigilante miniseries Content Score 100 Yes! Looking good! Top Contributors TB 43 TMDb Bot 38 Banana 15 wrjte51 10 ludoa12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}