{"link": "https://www.themoviedb.org/tv/14249?language=en", "title": "Mistresses", "resume": "Follows the lives of four female friends and their involvement in an array of marital and extramarital relationships.", "rate": 60, "genre": ["Drama"], "cast": ["Sarah Parish", "Sharon Small", "Shelley Conn", "Raza Jaffrey", "Patrick Baladi"], "character": ["Dr. Katie Roden", "Trudi Malloy", "Jessica", "Hari", "Patrick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14249   Expand Mistresses   (2008) User Score Overview Follows the lives of four female friends and their involvement in an array of marital and extramarital relationships. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Parish Dr. Katie Roden Sharon Small Trudi Malloy Shelley Conn Jessica Raza Jaffrey Hari Patrick Baladi Patrick Full Cast & Crew Last Season Season 3 2010 | 4 Episodes Season 3 of Mistresses premiered on August  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations   2010-10-12 Lip Service 6.6    2005-06-07 Sugar Rush 7.8  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/drama/mistresses Genres Drama Keywords infidelity sex female friendship relationship thirty something affair Content Score 86 Almost there... Top Contributors 15 Banana L 6 Lomata z 5 zurman1 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}