{"link": "https://www.themoviedb.org/tv/4474?language=en", "title": "Out of Practice", "resume": "Out of Practice is an American situation comedy that was produced by Paramount Network Television and originally broadcast on sister company CBS from September 19, 2005 to March 29, 2006. With producers Joe Keenan and Christopher Lloyd at the helm, the show was about a family of five doctors who had little in common and usually did not get along. CBS officially cancelled it on May 17, 2006, at its upfront presentation.", "rate": 67, "genre": ["Comedy"], "cast": ["Jennifer Tilly", "Paula Marshall", "Christopher Gorham", "Ty Burrell", "Stockard Channing"], "character": ["Crystal", "Benjamin Barnes", "Dr. Oliver Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4474   Expand Out of Practice   (2005) User Score Overview Out of Practice is an American situation comedy that was produced by Paramount Network Television and originally broadcast on sister company CBS from September 19, 2005 to March 29, 2006. With producers Joe Keenan and Christopher Lloyd at the helm, the show was about a family of five doctors who had little in common and usually did not get along. CBS officially cancelled it on May 17, 2006, at its upfront presentation. Featured Crew Joe Keenan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Tilly Crystal Paula Marshall Christopher Gorham Benjamin Barnes Ty Burrell Dr. Oliver Barnes Stockard Channing Full Cast & Crew Last Season Season 1 2005 | 22 Episodes Season 1 of Out of Practice premiered on September 19, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Out of Practice. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Out of Practice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords doctor family sitcom family profession Content Score 93 Almost there... Top Contributors 11 Banana s 3 speedycars R 2 Rebecca 2 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}