{"link": "https://www.themoviedb.org/tv/62449?language=en", "title": "Missing Noir M", "resume": "Gil Soo-Hyun is extremely intelligent. At the age of 10, he attended Harvard University. After graduating there, he decided to work at the FBI and worked there for 10 years. Afterwards, he decided to come back to South Korea. He now works as the leader of the Special Missing Persons Unit. The unit deals with about 1% of special missing cases involving violent crimes. His appearance borders on perfection, but he holds a secret. Detective Oh Dae-Young joins the Special Missing Persons Unit. He has worked as a detective for 20 years and he has an obsession in observing the law. He is known as a master of missing person cases.", "rate": 85, "genre": ["Action", "Crime", "Thriller"], "cast": ["Kim Kang-woo", "Park Hee-soon", "Jo Bo-Ah", "Kim Kyu-chul", "Park So-hyun"], "character": ["Gil Soo-hyun", "Oh Dae-young", "Jin Seo-joon", "Park Jung-do", "Kang Joo-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62449   Expand Missing Noir M   (2015) User Score  Play Trailer Overview Gil Soo-Hyun is extremely intelligent. At the age of 10, he attended Harvard University. After graduating there, he decided to work at the FBI and worked there for 10 years. Afterwards, he decided to come back to South Korea. He now works as the leader of the Special Missing Persons Unit. The unit deals with about 1% of special missing cases involving violent crimes. His appearance borders on perfection, but he holds a secret. Detective Oh Dae-Young joins the Special Missing Persons Unit. He has worked as a detective for 20 years and he has an obsession in observing the law. He is known as a master of missing person cases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Kang-woo Gil Soo-hyun Park Hee-soon Oh Dae-young Jo Bo-Ah Jin Seo-joon Kim Kyu-chul Park Jung-do Park So-hyun Kang Joo-young Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Missing Noir M premiered on March 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Missing Noir M. You can help by rating TV shows you've seen. Facts Original Name  실종느와르 M Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/ocn/m2015 Genres Action Crime Thriller Keywords korea Content Score 93 Almost there... Top Contributors M 28 Maria180493 t 13 tmdb38202327 s 4 sheva_vitali d 4 daphie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}