{"link": "https://www.themoviedb.org/tv/5195?language=en", "title": "DumbLand", "resume": "DumbLand is a series of eight crudely animated shorts written, directed, and voiced by director David Lynch in 2002. The shorts were originally released on the Internet through Lynch's website, and were released as a DVD in 2005. The total running time of all eight shorts combined is approximately a half hour.\nThe series details the daily routines of a dull-witted white trash man. The man lives in a house along with his frazzled wife and squeaky-voiced child, both of whom are nameless as is the man in the shows. Lynch's website, however, identifies the male character by the name Randy and the child by the name Sparky. The wife is not named.\nThe style of the series is intentionally crude both in terms of presentation and content, with limited animation.", "rate": 68, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5195   Expand DumbLand   (2002) User Score Overview DumbLand is a series of eight crudely animated shorts written, directed, and voiced by director David Lynch in 2002. The shorts were originally released on the Internet through Lynch's website, and were released as a DVD in 2005. The total running time of all eight shorts combined is approximately a half hour. The series details the daily routines of a dull-witted white trash man. The man lives in a house along with his frazzled wife and squeaky-voiced child, both of whom are nameless as is the man in the shows. Lynch's website, however, identifies the male character by the name Randy and the child by the name Sparky. The wife is not named. The style of the series is intentionally crude both in terms of presentation and content, with limited animation. Featured Crew David Lynch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries 2002 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  6 Recommendations   1993-01-08 Hotel Room 7.1    1992-06-20 On the Air 9.4    2010-09-06 Mad 4.4    2011-07-03 Penguindrum 7.8    2015-01-05 Yurikuma Arashi 7.7    2007-11-16 Chowder 6.5    2000-12-21 The Brak Show 7.0    1997-04-02 Revolutionary Girl Utena 9.4  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 9 TMDb Bot 4 Rafael Diaz 2 CinephileConfessor 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}