{"link": "https://www.themoviedb.org/tv/1381?language=en", "title": "Life Is Wild", "resume": "Life Is Wild is an American television serial drama adapted by Michael Rauch, George Faber and Charlie Pattinson from the popular British drama Wild at Heart. The show is about a New York veterinarian who moves his second wife and their two sets of children to a South African game reserve run by his former father-in-law.\nProduced by CBS Paramount Network Television, Warner Bros. Television, and Company Pictures, the series was officially green-lit by The CW and given a thirteen-episode order on May 15, 2007. The series premiered on October 7, 2007, and aired every Sunday night at 8:00PM Eastern/7:00PM Central, following a repeat of Aliens in America. In Canada on the pay TV channel E! as a mid-season replacement. In Europe on pay TV in the United Kingdom on the Hallmark Channel and Greece on August 1, 2011 on Skai TV. In South America on the pay TV Warner Channel. In New Zealand weekdays during the 2009 Christmas holiday period on TV3 in a daytime slot.\nThe show was canceled in February 2008 due to low ratings.", "rate": 0, "genre": ["Drama"], "cast": ["Mary Mouser", "D.W. Moffett", "Stephanie Niznik", "Andrew St. John", "Leah Pipes"], "character": ["Mia Weller", "Danny Clarke", "Jo Weller-Clarke", "Jesse Weller", "Katie Clarke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1381   Expand Life Is Wild   (2007) User Score Overview Life Is Wild is an American television serial drama adapted by Michael Rauch, George Faber and Charlie Pattinson from the popular British drama Wild at Heart. The show is about a New York veterinarian who moves his second wife and their two sets of children to a South African game reserve run by his former father-in-law. Produced by CBS Paramount Network Television, Warner Bros. Television, and Company Pictures, the series was officially green-lit by The CW and given a thirteen-episode order on May 15, 2007. The series premiered on October 7, 2007, and aired every Sunday night at 8:00PM Eastern/7:00PM Central, following a repeat of Aliens in America. In Canada on the pay TV channel E! as a mid-season replacement. In Europe on pay TV in the United Kingdom on the Hallmark Channel and Greece on August 1, 2011 on Skai TV. In South America on the pay TV Warner Channel. In New Zealand weekdays during the 2009 Christmas holiday period on TV3 in a daytime slot. The show was canceled in February 2008 due to low ratings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Mouser Mia Weller D.W. Moffett Danny Clarke Stephanie Niznik Jo Weller-Clarke Andrew St. John Jesse Weller Leah Pipes Katie Clarke Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of Life Is Wild premiered on October  7, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Life Is Wild. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cwtv.com/shows/life-is-wild Genres Drama Keywords africa veterinarian south africa remake living abroad blended family Content Score 86 Almost there... Top Contributors 8 Banana w 7 wonder2wonder w 3 webmaster T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}