{"link": "https://www.themoviedb.org/tv/70908?language=en", "title": "The Kennedys: After Camelot", "resume": "Picking up where the Emmy-winning miniseries The Kennedys left off, The Kennedys – After Camelot provides a fascinating look into the modern era of America’s royal family. Based on the best-selling book of the same name by J. Randy Taraborrelli.", "rate": 23, "genre": ["Drama"], "cast": ["Katie Holmes", "Matthew Perry", "Diana Hardcastle", "Kristin Booth", "Kristen Hager"], "character": ["Jackie Kennedy Onassis", "Ted Kennedy", "Rose Kennedy", "Ethel Kennedy", "Joan Kennedy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70908   Expand The Kennedys: After Camelot   (2017) User Score Overview Picking up where the Emmy-winning miniseries The Kennedys left off, The Kennedys – After Camelot provides a fascinating look into the modern era of America’s royal family. Based on the best-selling book of the same name by J. Randy Taraborrelli. Featured Crew Jon Cassar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katie Holmes Jackie Kennedy Onassis Matthew Perry Ted Kennedy Diana Hardcastle Rose Kennedy Kristin Booth Ethel Kennedy Kristen Hager Joan Kennedy Full Cast & Crew Last Season Season 1 2017 | 2 Episodes Season 1 of The Kennedys: After Camelot premiered on April  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Kennedys: After Camelot. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://www.reelz.com/after-camelot-home/ Genres Drama Keywords miniseries Content Score 93 Almost there... Top Contributors 36 Elizabeth Jennings D 8 Derek.Jo.Lee88 s 4 stefner R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}