{"link": "https://www.themoviedb.org/tv/65493?language=en", "title": "The Ranch", "resume": "Being a pro athlete didn't pan out for Colt. Now he's helping his dad and brother keep the ranch afloat, and figuring out how he fits into the family.", "rate": 74, "genre": ["Comedy"], "cast": ["Ashton Kutcher", "Elisha Cuthbert", "Danny Masterson", "Sam Elliott", "Debra Winger"], "character": ["Colt", "Abby", "Jameson “Rooster”", "Beau", "Maggie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65493   Expand The Ranch   (2016) User Score  Play Trailer Overview Being a pro athlete didn't pan out for Colt. Now he's helping his dad and brother keep the ranch afloat, and figuring out how he fits into the family. Featured Crew Don Reo Creator Jim Patterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  7 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashton Kutcher Colt Elisha Cuthbert Abby Danny Masterson Jameson “Rooster” Sam Elliott Beau Debra Winger Maggie Full Cast & Crew Current Season Original Air Date Original Air Date Parts (Digital) Season 3 2018 | 10 Episodes Season 3 of The Ranch premiered on June 15, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply T Jon Cryer should take Over Open 1 by  triune@gmail.com Colts accent Open 0 by GrandTardigrade\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations   2011-08-05 Friends with Benefits 6.1    2014-10-06 Strange Empire 6.2    2015-06-12 Conspiracy 5.7    2013-07-20 Cedar Cove 6.7    2015-08-05 Difficult People 7.4    2017-08-04 Wet Hot American Summer: 10 Years Later 6.8    2014-10-05 Mulaney 2.4    2017-11-05 SMILF 6.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://www.netflix.com/title/80077977 Genres Comedy Keywords parent child relationship ranch colorado sitcom Content Score 100 Yes! Looking good! Top Contributors 51 Elizabeth Jennings 20 Banana n 9 ncmale28444@yahoo.com R 6 Rob  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}