{"link": "https://www.themoviedb.org/tv/66016?language=en", "title": "Ninja Boy", "resume": "After the death of Saizou, Kabamaru's horribly strict grandfather and iga ninja-sensei (teacher), an old lady Ran Akoko claims that she received a letter from him asking her to take care of his grandson. So Kabamaru runs off with Lady Akoko to the big city Tokyo to gorge himself on yakisoba, Ramen, chow-mein and attend a regular school which turns out to have weird quirks of its own.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Ryusei Nakao", "Yuusaku Yara", "Akio Nojima", "Akira Kamiya", "Mai Tachihara"], "character": ["Igano Kagemaru", "Kyoutou", "Maejima", "Mejiro Shizune", "Ookubo Mai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66016   Expand Ninja Boy   (1983) User Score Overview After the death of Saizou, Kabamaru's horribly strict grandfather and iga ninja-sensei (teacher), an old lady Ran Akoko claims that she received a letter from him asking her to take care of his grandson. So Kabamaru runs off with Lady Akoko to the big city Tokyo to gorge himself on yakisoba, Ramen, chow-mein and attend a regular school which turns out to have weird quirks of its own. Featured Crew Azuki Yuu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryusei Nakao Igano Kagemaru Yuusaku Yara Kyoutou Akio Nojima Maejima Akira Kamiya Mejiro Shizune Mai Tachihara Ookubo Mai Full Cast & Crew Last Season Season 1 1983 | 24 Episodes Season 1 of Ninja Boy premiered on October 20, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ninja Boy. You can help by rating TV shows you've seen. Facts Original Name  伊賀野カバ丸 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords ninja kabamaru Content Score 93 Almost there... Top Contributors C 25 Cr3ViL 15 Maikkoum 8 aiman t 6 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}