{"link": "https://www.themoviedb.org/tv/70600?language=en", "title": "Mercur", "resume": "A fictional inspired by reality, telling the story of Radio Mercur, the start, as it best and is fall.\nA story of an illegal radiostation with brodcasted from ship, a story of the diffrent person involed in the radio in the age 1958-1962 where radio mercur, broadcastede due to a law fall not conercering broadcasting from sea.", "rate": 85, "genre": ["Drama"], "cast": ["Bertil Smith", "Bertil Smith", "Andreas Jessen", "Neel Rønholt", "Stephania Potalivo"], "character": ["Asger", "Asger", "Flemming Vestergaard", "Anne-Marie Jensen", "Gitte Skovgaard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70600   Expand Mercur   (2017) User Score Overview A fictional inspired by reality, telling the story of Radio Mercur, the start, as it best and is fall. A story of an illegal radiostation with brodcasted from ship, a story of the diffrent person involed in the radio in the age 1958-1962 where radio mercur, broadcastede due to a law fall not conercering broadcasting from sea. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bertil Smith Asger Bertil Smith Asger Andreas Jessen Flemming Vestergaard Neel Rønholt Anne-Marie Jensen Stephania Potalivo Gitte Skovgaard Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Mercur premiered on March  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mercur. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Danish Runtime  45m Homepage   http://tv.tv2.dk/mercur Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 27 mkarbowiak 7 Kecla T 7 Thomaxz 4 Maretoh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}