{"link": "https://www.themoviedb.org/tv/1461?language=en", "title": "Second Thoughts", "resume": "Second thoughts is a British sitcom that ran from 3 May 1991 to 14 October 1994. It was broadcast on  ITV and made by LWT. It was followed by a sequel, Faith in the future. Second thoughts followed the lives of two middle-aged divorcees, Bill MacGregor and Faith Greyshott, from very different backgrounds trying to develop a relationship, despite the pressures pulling it apart.\nSecond thoughts was based upon the real-life relationship of the writers, husband and wife Jan Etherington and Gavin Petrie. It originally aired as a radio series on BBC Radio 4 broadcast between 1 November 1988 and 23 July 1992. The radio series consisted of four series and a Christmas special broadcast in 1992 with a total of 31 episodes. The radio scripts were used for the television series on ITV. The fifth series was considered weaker than the first four series; it was the only series not to be based on the original radio scripts.\nSecond thoughts ended on 14 October 1994, but has since been repeated on ITV3. The original radio series is often replayed on BBC7.", "rate": 70, "genre": ["Comedy"], "cast": ["Julia Sawalha", "Lynda Bellingham", "Belinda Lang", "James Bolam", "Geoffrey Whitehead"], "character": ["Hannah Grayshot", "Faith", "Liza", "Bill", "Richard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1461   Expand Second Thoughts   (1991) User Score Overview Second thoughts is a British sitcom that ran from 3 May 1991 to 14 October 1994. It was broadcast on  ITV and made by LWT. It was followed by a sequel, Faith in the future. Second thoughts followed the lives of two middle-aged divorcees, Bill MacGregor and Faith Greyshott, from very different backgrounds trying to develop a relationship, despite the pressures pulling it apart. Second thoughts was based upon the real-life relationship of the writers, husband and wife Jan Etherington and Gavin Petrie. It originally aired as a radio series on BBC Radio 4 broadcast between 1 November 1988 and 23 July 1992. The radio series consisted of four series and a Christmas special broadcast in 1992 with a total of 31 episodes. The radio scripts were used for the television series on ITV. The fifth series was considered weaker than the first four series; it was the only series not to be based on the original radio scripts. Second thoughts ended on 14 October 1994, but has since been repeated on ITV3. The original radio series is often replayed on BBC7. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Sawalha Hannah Grayshot Lynda Bellingham Faith Belinda Lang Liza James Bolam Bill Geoffrey Whitehead Richard Full Cast & Crew Last Season Season 5 1994 | 8 Episodes Season 5 of Second Thoughts premiered on August 26, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Second Thoughts. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords relationship family sitcom british humour middle aged couple Content Score 86 Almost there... Top Contributors O 11 Ozbourne 5 rudely_murray 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}