{"link": "https://www.themoviedb.org/tv/4526?language=en", "title": "Savannah", "resume": "Savannah is an American prime time television drama that ran from January 21, 1996 to February 24, 1997 on The WB. It was created by Constance M. Burge and produced by Aaron Spelling.", "rate": 74, "genre": ["Soap", "Drama"], "cast": ["Jamie Luner", "Paul Satterfield", "Beth Toussaint", "Ray Wise", "Robyn Lively"], "character": ["Peyton Richards Massick", "Lane Mackenzie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4526   Expand Savannah   (1996) User Score Overview Savannah is an American prime time television drama that ran from January 21, 1996 to February 24, 1997 on The WB. It was created by Constance M. Burge and produced by Aaron Spelling. Featured Crew Constance M. Burge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Luner Peyton Richards Massick Paul Satterfield Beth Toussaint Ray Wise Robyn Lively Lane Mackenzie Full Cast & Crew Last Season Season 2 1996 | 22 Episodes Season 2 of Savannah premiered on August 26, 1996. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Hated Reese with Passion but I really Love Lane & Peyton Open 0 by Irina\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1978-04-02 Dallas 6.1    1992-07-08 Melrose Place 4.9    2006-09-24 Brothers and Sisters 6.8    2003-09-23 One Tree Hill 6.5    1989-04-23 Baywatch 5.0    2003-08-05 The O.C. 6.9    2006-09-28 Ugly Betty 5.5    2004-10-03 Desperate Housewives 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Soap Drama Keywords secret southern usa revenge murder wealthy hometown Content Score 93 Almost there... Top Contributors 11 Banana w 3 webmaster s 3 speedycars a 2 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}