{"link": "https://www.themoviedb.org/tv/2330?language=en", "title": "Mickey Mouse Works", "resume": "Mickey Mouse Works is an American television show that features the cartoon character Mickey Mouse and his friends in a series of animated segments. It is somewhat of an update of Mickey's Mouse Tracks. It is the first Disney television animated series to be broadcast in HD. The series is rated TV-Y7.\nMickey Mouse, Minnie Mouse, Donald Duck, Daisy Duck, Goofy, Pluto, and Ludwig Von Drake all star in their own segments. Horace Horsecollar, Clarabelle Cow, Huey, Dewey and Louie, Chip 'n Dale, Scrooge McDuck, Pete, Humphrey the Bear, J. Audubon Woodlore, Dinah the Dachshund, Butch the Bulldog, Mortimer Mouse and Clara Cluck all appear as supporting characters. Musical themes for each character are composed by Stephen James Taylor with a live 12-piece band and extensive use of the fretless guitar. Music was nominated for an Annie Award in both 1999 and 2000. Although it was a very short-lived series, it immediately became very popular in its original run and in syndication. The cartoons on the show were later used in the Disney animated television series House of Mouse.", "rate": 23, "genre": ["Animation"], "cast": ["Wayne Allwine", "Tony Anselmo", "Tress MacNeille", "Bill Farmer", "Russi Taylor"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2330   Expand Mickey Mouse Works   (1999) User Score Overview Mickey Mouse Works is an American television show that features the cartoon character Mickey Mouse and his friends in a series of animated segments. It is somewhat of an update of Mickey's Mouse Tracks. It is the first Disney television animated series to be broadcast in HD. The series is rated TV-Y7. Mickey Mouse, Minnie Mouse, Donald Duck, Daisy Duck, Goofy, Pluto, and Ludwig Von Drake all star in their own segments. Horace Horsecollar, Clarabelle Cow, Huey, Dewey and Louie, Chip 'n Dale, Scrooge McDuck, Pete, Humphrey the Bear, J. Audubon Woodlore, Dinah the Dachshund, Butch the Bulldog, Mortimer Mouse and Clara Cluck all appear as supporting characters. Musical themes for each character are composed by Stephen James Taylor with a live 12-piece band and extensive use of the fretless guitar. Music was nominated for an Annie Award in both 1999 and 2000. Although it was a very short-lived series, it immediately became very popular in its original run and in syndication. The cartoons on the show were later used in the Disney animated television series House of Mouse. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wayne Allwine Tony Anselmo Tress MacNeille Bill Farmer Russi Taylor Full Cast & Crew Last Season Season 3 2000 | 5 Episodes Season 3 of Mickey Mouse Works premiered on September  9, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mickey Mouse Works. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors c 4 chloris77 c 1 christra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}