{"link": "https://www.themoviedb.org/tv/67557?language=en", "title": "The Grand Tour", "resume": "Jeremy Clarkson, Richard Hammond and James May are back with a show about adventure, excitement and friendship... as long as you accept that the people you call friends are also the ones you find extremely annoying. Sometimes it's even a show about cars. Follow them on their global adventure.", "rate": 78, "genre": ["Documentary"], "cast": ["Jeremy Clarkson", "Richard Hammond", "James May", "Abigail Eaton"], "character": ["Himself - Host", "Himself - Host", "Himself - Host", "Lap Racer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67557   Expand The Grand Tour   (2016) User Score  Play Trailer Overview Jeremy Clarkson, Richard Hammond and James May are back with a show about adventure, excitement and friendship... as long as you accept that the people you call friends are also the ones you find extremely annoying. Sometimes it's even a show about cars. Follow them on their global adventure. Featured Crew Jeremy Clarkson Creator James May Creator Richard Hammond Creator Andy Wilman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  10 Posters  11 Videos Trailers  1 Teasers  2 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Clarkson Himself - Host Richard Hammond Himself - Host James May Himself - Host Abigail Eaton Lap Racer Full Cast & Crew Current Season Season 2 2017 | 11 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Thoughts on the new show? Open 5 by  revengine Even roguish men who drive Jags must stay warm Open 0 by revengine\n      \n     Cinematography for the films Open 0 by revengine\n      \n     Go to Discussions Media Most Popular Videos  4 Backdrops  10 Posters  11 Recommendations   2002-10-20 Top Gear 7.5    2007-08-13 Californication 7.4    2015-06-21 Ballers 5.7    2016-10-02 Westworld 8.1    2015-08-28 Narcos 8.0    2016-07-15 Stranger Things 8.4    2016-05-22 Preacher 7.4    2015-11-20 Marvel's Jessica Jones 7.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Talk Show Original Language  English Runtime  60m, 70m Homepage   https://www.amazon.com/dp/B01J94A5GQ Genres Documentary Keywords automobile travel racing testing car race vehicles Content Score 100 Yes! Looking good! Top Contributors 86 Elizabeth Jennings 46 TopKek 29 tobim91 s 9 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}