{"link": "https://www.themoviedb.org/tv/68786?language=en", "title": "Hirugao: Love Affairs in the Afternoon", "resume": "Life is simple for Sasamoto Sawa, a young housewife, but when the adulteress Takigawa Rikako moves into her neighborhood, so too does a new world of sophistication and sex. After Takigawa is nearly caught in the act, Sasamoto covers for her during the ensuing aftermath, unwittingly involving herself with a handsome teacher named Kitano Yuichi — and discovering her own desires for extramarital passions.", "rate": 85, "genre": ["Drama"], "cast": ["Aya Ueto", "Michiko Kichise", "Takumi Saito", "Kazuki Kitamura", "Kosuke Suzuki"], "character": ["Sawa Sasamoto", "Rikako Takikawa", "Yuichiro Kitano", "Osamu Kato", "Shunsuke Sasamoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68786   Expand Hirugao: Love Affairs in the Afternoon   (2014) User Score Overview Life is simple for Sasamoto Sawa, a young housewife, but when the adulteress Takigawa Rikako moves into her neighborhood, so too does a new world of sophistication and sex. After Takigawa is nearly caught in the act, Sasamoto covers for her during the ensuing aftermath, unwittingly involving herself with a handsome teacher named Kitano Yuichi — and discovering her own desires for extramarital passions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Ueto Sawa Sasamoto Michiko Kichise Rikako Takikawa Takumi Saito Yuichiro Kitano Kazuki Kitamura Osamu Kato Kosuke Suzuki Shunsuke Sasamoto Full Cast & Crew Last Season Season 1 2014 | 11 Episodes Season 1 of Hirugao: Love Affairs in the Afternoon premiered on July 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hirugao: Love Affairs in the Afternoon. You can help by rating TV shows you've seen. Facts Original Name  昼顔〜平日午後3時の恋人たち〜 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.fujitv.co.jp/hirugao/index.html Genres Drama Keywords japan romance extramarital affair Content Score 86 Almost there... Top Contributors M 34 Maria180493 g 11 gashtoby  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}