{"link": "https://www.themoviedb.org/tv/61338?language=en", "title": "The Eccentric Family", "resume": "In Kyoto, humans and supernatural creatures live side-by-side. Soichiro Shimogamo used to be the head of tanuki society, but without warning one day he was made into tanuki stew, and no one knows how it happened. He left four sons behind who all live happily with their mother. What does fate have in store for this strongly bonded family?!", "rate": 55, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Takahiro Sakurai", "Junichi Suwabe", "Mai Nakahara", "Hiroyuki Yoshino", "Kikuko Inoue"], "character": ["Yasaburou Shimogamo (voice)", "Yaichirou Shimogamo (voice)", "Yashirou Shimogamo (voice)", "Yajirou Shimogamo (voice)", "Tousen Shimogamo (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61338   Expand The Eccentric Family   (2013) User Score Overview In Kyoto, humans and supernatural creatures live side-by-side. Soichiro Shimogamo used to be the head of tanuki society, but without warning one day he was made into tanuki stew, and no one knows how it happened. He left four sons behind who all live happily with their mother. What does fate have in store for this strongly bonded family?! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takahiro Sakurai Yasaburou Shimogamo (voice) Junichi Suwabe Yaichirou Shimogamo (voice) Mai Nakahara Yashirou Shimogamo (voice) Hiroyuki Yoshino Yajirou Shimogamo (voice) Kikuko Inoue Tousen Shimogamo (voice) Full Cast & Crew Last Season Season 2 2017 | 12 Episodes Season 2 of The Eccentric Family premiered on April  9, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Eccentric Family. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Eccentric Family. You can help by rating TV shows you've seen. Facts Original Name  有頂天家族 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://uchoten-anime.com Genres Animation Comedy Drama Keywords based on novel or book anthropomorphism slice of life tanuki contemporary fantasy japanese mythology anime Content Score 86 Almost there... Top Contributors 73 Marr 🇳🇱 23 sp1ti H 8 Hide i 8 iknvya  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}