{"link": "https://www.themoviedb.org/tv/7771?language=en", "title": "Meet the Browns", "resume": "Tyler Perry's Meet the Browns is an American sitcom created and produced by playwright, director, and producer Tyler Perry. The show revolves around a senior family living under one roof in Decatur, Georgia led by patriarch Mr. Brown and his daughter Cora Simmons. The show premiered on Wednesday, January 7, 2009 and finished its run on November 18, 2011 on TBS. It is made in the model of his play and film of the same name. The show stars David Mann and Tamela Mann, who starred in the earlier stage play and motion picture.", "rate": 70, "genre": ["Comedy"], "cast": ["K Callan", "Lamman Rucker", "Denise Boutte", "Tamela Mann", "LaVan Davis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7771   Expand Meet the Browns   (2009) User Score Overview Tyler Perry's Meet the Browns is an American sitcom created and produced by playwright, director, and producer Tyler Perry. The show revolves around a senior family living under one roof in Decatur, Georgia led by patriarch Mr. Brown and his daughter Cora Simmons. The show premiered on Wednesday, January 7, 2009 and finished its run on November 18, 2011 on TBS. It is made in the model of his play and film of the same name. The show stars David Mann and Tamela Mann, who starred in the earlier stage play and motion picture. Featured Crew Tyler Perry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast K Callan Lamman Rucker Denise Boutte Tamela Mann LaVan Davis Full Cast & Crew Last Season Season 5 2011 | 8 Episodes Season 5 of Meet the Browns premiered on October 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Meet the Browns. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.tbs.com/shows/meetthebrowns/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 1 Rich  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}