{"link": "https://www.themoviedb.org/tv/8168?language=en", "title": "Demons, The Last Van Helsing", "resume": "Demons is a British six-part supernatural drama TV series produced by Shine Productions, which premièred on ITV on 3 January 2009. It was produced by the same company that made the Sky1 supernatural drama Hex and the BBC One fantasy series Merlin. The DVD of the one series made was released on 6 April 2009.", "rate": 55, "genre": ["Sci-Fi", "Fantasy", "Drama", "Action", "Adventure"], "cast": ["Christian Cooke", "Philip Glenister", "Zoë Tapper", "Holliday Grainger"], "character": ["Mina Harker", "Ruby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8168   Expand Demons, The Last Van Helsing   (2009) User Score Overview Demons is a British six-part supernatural drama TV series produced by Shine Productions, which premièred on ITV on 3 January 2009. It was produced by the same company that made the Sky1 supernatural drama Hex and the BBC One fantasy series Merlin. The DVD of the one series made was released on 6 April 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Cooke Philip Glenister Zoë Tapper Mina Harker Holliday Grainger Ruby Full Cast & Crew Last Season Season 1 2009 | 6 Episodes Season 1 of Demons, The Last Van Helsing premiered on January  3, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Demons, The Last Van Helsing. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.itv.com/demons Genres Sci-Fi & Fantasy Drama Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 20 zurman1 w 5 webmaster s 3 speedycars 2 ugessss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}