{"link": "https://www.themoviedb.org/tv/7769?language=en", "title": "Yo soy Bea", "resume": "Yo soy Bea is a Spanish television comedy-drama series which aired on Telecinco from 10 July 2006 to 16 August 2009.\nThe series is an adaptation of the popular Colombian telenovela Yo soy Betty, la fea. Ruth Núñez played the title role of Beatriz \"Bea\" Pérez Pinzón and Alejandro Tous played Álvaro Aguilar, Bea's love interest. Yo soy Bea translates to \"I am Bea\"; it is a pun, with \"Bea\" sounding like bella, meaning pretty, and like fea, meaning ugly.\nThe Spanish adaptation screened weekdays during the daytime and pulled in, on average, over four million viewers. The series' record is a 42,1% share. It was Spain's top rated daytime programme.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Ruth Núñez", "José Manuel Seda", "Inma Isla", "Miguel Hermoso Arnao", "Mónica Estarreado"], "character": ["Bea Pinzón", "Gonzalo de Soto", "Elena Puente", "Diego de la Vega", "Cayetana de la Vega"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7769   Expand Yo soy Bea   (2006) User Score Overview Yo soy Bea is a Spanish television comedy-drama series which aired on Telecinco from 10 July 2006 to 16 August 2009. The series is an adaptation of the popular Colombian telenovela Yo soy Betty, la fea. Ruth Núñez played the title role of Beatriz \"Bea\" Pérez Pinzón and Alejandro Tous played Álvaro Aguilar, Bea's love interest. Yo soy Bea translates to \"I am Bea\"; it is a pun, with \"Bea\" sounding like bella, meaning pretty, and like fea, meaning ugly. The Spanish adaptation screened weekdays during the daytime and pulled in, on average, over four million viewers. The series' record is a 42,1% share. It was Spain's top rated daytime programme. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ruth Núñez Bea Pinzón José Manuel Seda Gonzalo de Soto Inma Isla Elena Puente Miguel Hermoso Arnao Diego de la Vega Mónica Estarreado Cayetana de la Vega Full Cast & Crew Last Season Season 1 2006 | 6 Episodes Season 1 of Yo soy Bea premiered on July 10, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yo soy Bea. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.telecinco.es/yosoybea/ Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 16 prm96 z 4 zurman1 N 2 NoemiTalavera  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}