{"link": "https://www.themoviedb.org/tv/3465?language=en", "title": "On the Air", "resume": "On the Air is an American sitcom created by David Lynch and Mark Frost, and broadcast by ABC. In the United States only three episodes were aired, although seven were filmed. The program follows the antics of the staff of a fictional 1950s television network, as they try to put on a live variety program called \"The Lester Guy Show\", with disastrous results.\nIt starred Ian Buchanan, Marla Rubinoff, Nancye Ferguson, Miguel Ferrer, Gary Grossman, and Mel Johnson, Jr. Directors included David Lynch, Mark Frost, Jack Fisk, Jonathan Sanger, Lesli Linka Glatter, and Betty Thomas.", "rate": 94, "genre": ["Comedy"], "cast": ["Marvin Kaplan", "Tracey Walter", "Miguel Ferrer", "Ian Buchanan", "David L. Lander"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3465   Expand On the Air   (1992) User Score Overview On the Air is an American sitcom created by David Lynch and Mark Frost, and broadcast by ABC. In the United States only three episodes were aired, although seven were filmed. The program follows the antics of the staff of a fictional 1950s television network, as they try to put on a live variety program called \"The Lester Guy Show\", with disastrous results. It starred Ian Buchanan, Marla Rubinoff, Nancye Ferguson, Miguel Ferrer, Gary Grossman, and Mel Johnson, Jr. Directors included David Lynch, Mark Frost, Jack Fisk, Jonathan Sanger, Lesli Linka Glatter, and Betty Thomas. Featured Crew David Lynch Creator Mark Frost Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marvin Kaplan Tracey Walter Miguel Ferrer Ian Buchanan David L. Lander Full Cast & Crew Last Season Season 1 1992 | 7 Episodes Season 1 of On the Air premiered on June 20, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations   2011-07-03 Penguindrum 7.8    2015-01-05 Yurikuma Arashi 7.7    2017-11-23 She's Gotta Have It 7.2    1997-04-02 Revolutionary Girl Utena 9.4    1993-01-08 Hotel Room 7.1    2015-09-14 Merlí 8.5    1989-04-03 Alfred J. Kwak 7.7    2002-01-01 DumbLand 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 2 salocin85 2 Friendoo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}