{"link": "https://www.themoviedb.org/tv/32824?language=en", "title": "Smile, You", "resume": "Seo Jung In is the kind-hearted, but spoiled daughter of a wealthy family. When the family's financial bubble bursts, her fiancée dumps her at the altar and her family is forced to rely on the kindness of their former chauffeur's family. While adjusting to life in their crowded, two-family home, Jung In and the Kangs' son, Hyun Su, begin to clash. Will these two find a way to get along, or will their initial irritation with one another blossom into something more?", "rate": 73, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Jung Kyung-ho", "Lee Min-jung", "Cheon Ho-jin", "Lee Chun-hee", "Choi Jung-yoon"], "character": ["Kang Hyun-soo", "Seo Jung-in", "Kang Sang-hoon", "Seo Sung-joon", "Seo Jung-kyung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32824   Expand Smile, You   (2009) User Score Overview Seo Jung In is the kind-hearted, but spoiled daughter of a wealthy family. When the family's financial bubble bursts, her fiancée dumps her at the altar and her family is forced to rely on the kindness of their former chauffeur's family. While adjusting to life in their crowded, two-family home, Jung In and the Kangs' son, Hyun Su, begin to clash. Will these two find a way to get along, or will their initial irritation with one another blossom into something more? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Kyung-ho Kang Hyun-soo Lee Min-jung Seo Jung-in Cheon Ho-jin Kang Sang-hoon Lee Chun-hee Seo Sung-joon Choi Jung-yoon Seo Jung-kyung Full Cast & Crew Last Season Season 1 2009 | 45 Episodes Season 1 of Smile, You premiered on September 26, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Smile, You. You can help by rating TV shows you've seen. Facts Original Name  그대, 웃어요 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/yousmile/ Genres Comedy Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 37 Maria180493 N 21 Nightowl.Kr LS 3 Lee Seung-Su t 2 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}