{"link": "https://www.themoviedb.org/tv/32152?language=en", "title": "The Return of the Condor Heroes", "resume": "The Return of the Condor Heroes is a Hong Kong television series adapted from Louis Cha's novel of the same title. It was first broadcast on TVB Jade from 31 October 1983 to 6 January 1984 in Hong Kong.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Andy Lau", "Idy Chan", "Sek Kin", "Francis Ng", "Lau Siu-Ming"], "character": ["Yang Guo", "Xiaolongnu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32152   Expand The Return of the Condor Heroes   (1983) User Score Overview The Return of the Condor Heroes is a Hong Kong television series adapted from Louis Cha's novel of the same title. It was first broadcast on TVB Jade from 31 October 1983 to 6 January 1984 in Hong Kong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andy Lau Yang Guo Idy Chan Xiaolongnu Sek Kin Francis Ng Lau Siu-Ming Full Cast & Crew Last Season Season 1 1983 | 50 Episodes Season 1 of The Return of the Condor Heroes premiered on October 31, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Return of the Condor Heroes. You can help by rating TV shows you've seen. Facts Original Name  神鵰俠侶 Status  Ended Network Certification  - Type  Scripted Original Language  Cantonese Runtime  - Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 thirstyhippo c 4 ctchim t 3 taxigps g 2 goldmundz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}