{"link": "https://www.themoviedb.org/tv/67654?language=en", "title": "Mary + Jane", "resume": "Jordan and Paige are two twenty-something best friends who run an all-female weed delivery service in Los Angeles. Filled with funny, raw and bizarre adventures, the show explores the uncharted territory as Los Angeles comes out of the Green Closet and gets into high and higher times.", "rate": 61, "genre": ["Comedy"], "cast": ["Jessica Rothe", "Scout Durwood"], "character": ["Paige", "Jordan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67654   Expand Mary + Jane   (2016) User Score Overview Jordan and Paige are two twenty-something best friends who run an all-female weed delivery service in Los Angeles. Filled with funny, raw and bizarre adventures, the show explores the uncharted territory as Los Angeles comes out of the Green Closet and gets into high and higher times. Featured Crew Deborah Kaplan Creator Harry Elfont Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Rothe Paige Scout Durwood Jordan Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Mary + Jane premiered on September  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2016-03-01 Loosely Exactly Nicole 5.8    2015-10-16 Truth Be Told 5.5    2016-01-13 Teachers 7.1    2016-10-19 HIM 6.2    2017-05-17 Downward Dog 6.7    2016-06-07 Agatha Raisin 6.3    2015-06-08 Odd Mom Out 6.7    2017-11-05 SMILF 6.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  21m Homepage   http://www.mtv.com/shows/mary-and-jane Genres Comedy Keywords drug dealer marijuana los angeles drugs young adult Content Score 64 We're so close, yet so far. Top Contributors 40 Banana 22 Elizabeth Jennings z 6 zyck w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}