{"link": "https://www.themoviedb.org/tv/3929?language=en", "title": "Thief", "resume": "Nick Atwater, the leader of a robbery crew, is balancing his personal life with the planning of a major heist while being targeted by a relentless cop and the Chinese mafia.", "rate": 77, "genre": ["Drama", "Action", "Adventure"], "cast": ["Andre Braugher", "Yancey Arias", "Malik Yoba", "Mae Whitman", "Clifton Collins Jr."], "character": ["Nick Atwater", "Gabriel \"Gabo\" Williams", "Tammi Deveraux", "Jack \"Bump\" Hill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3929   Expand Thief   (2006) User Score Overview Nick Atwater, the leader of a robbery crew, is balancing his personal life with the planning of a major heist while being targeted by a relentless cop and the Chinese mafia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andre Braugher Nick Atwater Yancey Arias Gabriel \"Gabo\" Williams Malik Yoba Mae Whitman Tammi Deveraux Clifton Collins Jr. Jack \"Bump\" Hill Full Cast & Crew Last Season Season 1 2006 | 6 Episodes Season 1 of Thief premiered on March 28, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2000-04-16 The Corner 7.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Action & Adventure Keywords heist outlaw thief miniseries Content Score 86 Almost there... Top Contributors 11 Banana TB 8 TMDb Bot w 1 webmaster R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}