{"link": "https://www.themoviedb.org/tv/63642?language=en", "title": "Legend of Fragrance", "resume": "Li Yi Feng plays a sweet, rich young master, while William Chan takes on the cold, heroic, investigator. On the ladies’ side, Tang Yan embodies the spirit of a sweet, strong willed Chinese Woman, in contrast to the nobly charming young mistress of Shu Chang. Moreover, the two ladies often find their interests in conflict with each other. Aside from that, the two families will battle over producing the best incenses in the area.", "rate": 0, "genre": ["Family"], "cast": ["Li Yifeng", "Tiffany Tang", "William Chan Wai-Ting", "Sierra Li", "Huang Ming"], "character": ["Ning Zhi Yuan", "An Le Yan / An Ruo Huan", "An Yi Chen / Wen Shi Qing", "Ning Pei Shan", "Wen Shi Xuan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63642   Expand Legend of Fragrance   (2015) User Score Overview Li Yi Feng plays a sweet, rich young master, while William Chan takes on the cold, heroic, investigator. On the ladies’ side, Tang Yan embodies the spirit of a sweet, strong willed Chinese Woman, in contrast to the nobly charming young mistress of Shu Chang. Moreover, the two ladies often find their interests in conflict with each other. Aside from that, the two families will battle over producing the best incenses in the area. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Li Yifeng Ning Zhi Yuan Tiffany Tang An Le Yan / An Ruo Huan William Chan Wai-Ting An Yi Chen / Wen Shi Qing Sierra Li Ning Pei Shan Huang Ming Wen Shi Xuan Full Cast & Crew Last Season Season 1 2015 | 42 Episodes Season 1 of Legend of Fragrance premiered on February  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Legend of Fragrance. You can help by rating TV shows you've seen. Facts Original Name  活色生香 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 28 Maria180493 4 Elizabeth Jennings TB 2 TMDb Bot 1 Wendy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}