{"link": "https://www.themoviedb.org/tv/63417?language=en", "title": "Noble, My Love", "resume": "The romance between Lee Kang hoon, the CEO of the world's largest company, and Cha Yoon seo, an attractive, innocent and lovely looking veterinarian. One day, Kang hoon is kidnapped and dramatically escapes from the bad guys, but his profuse bleeding causes him to blackout in front of one animal hospital. Yoon seo finds and cures him. \nBased on Web-novel “고결한그대 / The Noble You” by “고결 / Go Gyul”.", "rate": 74, "genre": ["Comedy"], "cast": ["Kim Jae-kyung", "Sung Hoon", "Park Eun-seok"], "character": ["Cha Yoon-seo", "Lee Kang-hoon", "Woo Sang-hyeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63417   Expand Noble, My Love   (2015) User Score Overview The romance between Lee Kang hoon, the CEO of the world's largest company, and Cha Yoon seo, an attractive, innocent and lovely looking veterinarian. One day, Kang hoon is kidnapped and dramatically escapes from the bad guys, but his profuse bleeding causes him to blackout in front of one animal hospital. Yoon seo finds and cures him.  Based on Web-novel “고결한그대 / The Noble You” by “고결 / Go Gyul”. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Jae-kyung Cha Yoon-seo Sung Hoon Lee Kang-hoon Park Eun-seok Woo Sang-hyeon Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Noble, My Love premiered on August 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2014-10-13 Tomorrow's Cantabile 7.3  Facts Original Name  고결한 그대 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage   http://tvcast.naver.com/noblemylove Genres Comedy Keywords veterinarian romantic comedy korea Content Score 56 We're so close, yet so far. Top Contributors t 27 tmdb38202327 M 12 Maria180493 11 Elizabeth Jennings 4 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}