{"link": "https://www.themoviedb.org/tv/34152?language=en", "title": "Boogiepop Phantom", "resume": "Boogiepop Phantom is a twelve-episode anime television series produced by Madhouse Studios, based on the Boogiepop light novel series by Kouhei Kadono, particularly that of Boogiepop and Others and Boogiepop At Dawn. The series is directed by Takashi Watanabe, from a screenplay by Sadayuki Murai, with original character designs by novel illustrator Kouji Ogata, and sound direction by Yota Tsuruoka.\nThe story takes place in an unnamed Japanese city, a month after a pillar of light appeared in the night sky and five years after a string of serial killings. Boogiepop Phantom follows an ensemble cast of characters, mostly high school students, who are witnesses to the incident and its consequences. At the time of the series, high school students have started to disappear again and the blame is placed on Boogiepop, an urban legend who is said to be the personification of Death.\nEach episode centers on different characters who sometimes have just a short involvement in the major events of the series. For this reason, many scenes are seen twice, from different perspectives, and some episodes are out of sequence, although there is a slow general time progression. An unusual visual style is employed wherein, for all but the last episode, a much reduced color palette is used in conjunction with a vignette effect. The sound design features many varied music genres from Gregorian to electronic, and even some sounds that appear to be unique to the show. Through the non-linear style of the series, the characters are used to develop the central themes of the series: Change, Escapism, Memory, and Relationships.", "rate": 82, "genre": ["Animation", "Mystery"], "cast": ["Yuu Asakawa", "Kaori Shimizu", "Sanae Kobayashi", "Kozue Yoshizumi", "Mayumi Asano"], "character": ["Kirima Nagi", "Boogiepop", "Manaka Kisaragi", "Rie Takai", "Boogiepop Phantom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34152   Expand Boogiepop Phantom   (2000) User Score  Play Trailer Overview Boogiepop Phantom is a twelve-episode anime television series produced by Madhouse Studios, based on the Boogiepop light novel series by Kouhei Kadono, particularly that of Boogiepop and Others and Boogiepop At Dawn. The series is directed by Takashi Watanabe, from a screenplay by Sadayuki Murai, with original character designs by novel illustrator Kouji Ogata, and sound direction by Yota Tsuruoka. The story takes place in an unnamed Japanese city, a month after a pillar of light appeared in the night sky and five years after a string of serial killings. Boogiepop Phantom follows an ensemble cast of characters, mostly high school students, who are witnesses to the incident and its consequences. At the time of the series, high school students have started to disappear again and the blame is placed on Boogiepop, an urban legend who is said to be the personification of Death. Each episode centers on different characters who sometimes have just a short involvement in the major events of the series. For this reason, many scenes are seen twice, from different perspectives, and some episodes are out of sequence, although there is a slow general time progression. An unusual visual style is employed wherein, for all but the last episode, a much reduced color palette is used in conjunction with a vignette effect. The sound design features many varied music genres from Gregorian to electronic, and even some sounds that appear to be unique to the show. Through the non-linear style of the series, the characters are used to develop the central themes of the series: Change, Escapism, Memory, and Relationships. Featured Crew Kouhei Kadono Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuu Asakawa Kirima Nagi Kaori Shimizu Boogiepop Sanae Kobayashi Manaka Kisaragi Kozue Yoshizumi Rie Takai Mayumi Asano Boogiepop Phantom Full Cast & Crew Last Season Season 1 2003 | 12 Episodes Season 1 of Boogiepop Phantom premiered on July 28, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2013-10-04 Kill la Kill 7.7    2007-06-09 Ergo Proxy 7.3    2012-10-12 Psycho-Pass 7.7  Facts Status  Ended Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  30m Homepage   https://web.archive.org/web/20070608193553/http://www.vap.co.jp:80/boogie/ Genres Animation Mystery Keywords anime Content Score 100 Yes! Looking good! Top Contributors 9 greenglass 5 theramyz z 5 zurman1 5 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}