{"link": "https://www.themoviedb.org/tv/2784?language=en", "title": "Donkey Kong Country", "resume": "Donkey Kong Country is a French/Canadian computer-generated animated television series. It is based on the Nintendo franchise Donkey Kong as portrayed in the Donkey Kong Country video game series by Nintendo & Rare. Created by France 2 and Nelvana, it was originally titled La Planète de Donkey Kong. Donkey Kong Country first aired in France on September 4, 1996; it premiered late in the United States on the Fox Kids block on Fox on August 15, 1997 but the show was not shown on the block for long. After only two episodes, the series moved to Fox Family. In Japan, Donkey Kong Country took over the TV Tokyo 6:30 P.M. timeslot from Gokudo and was later replaced with Hamtaro.\nDonkey Kong Country was one of the earliest television series to be computer-animated to match an artistic style and garnered critical acclaim in France and Japan but only marginal success elsewhere. Several elements of the series like the crystal coconut, appeared in later Donkey Kong Country video games like Donkey Kong 64, which was released a year after the show began airing on Fox.", "rate": 80, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["John Stocker", "Louise Vallance", "Len Carlson", "Andrew Sabiston", "Ron Rubin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2784   Expand Donkey Kong Country   (1996) User Score Overview Donkey Kong Country is a French/Canadian computer-generated animated television series. It is based on the Nintendo franchise Donkey Kong as portrayed in the Donkey Kong Country video game series by Nintendo & Rare. Created by France 2 and Nelvana, it was originally titled La Planète de Donkey Kong. Donkey Kong Country first aired in France on September 4, 1996; it premiered late in the United States on the Fox Kids block on Fox on August 15, 1997 but the show was not shown on the block for long. After only two episodes, the series moved to Fox Family. In Japan, Donkey Kong Country took over the TV Tokyo 6:30 P.M. timeslot from Gokudo and was later replaced with Hamtaro. Donkey Kong Country was one of the earliest television series to be computer-animated to match an artistic style and garnered critical acclaim in France and Japan but only marginal success elsewhere. Several elements of the series like the crystal coconut, appeared in later Donkey Kong Country video games like Donkey Kong 64, which was released a year after the show began airing on Fox. Featured Crew Erika Strobel Creator Nadine Van der Velde Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Stocker Louise Vallance Len Carlson Andrew Sabiston Ron Rubin Full Cast & Crew Last Season Season 3 2013 | 10 Episodes Season 3 of Donkey Kong Country premiered on January  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Donkey Kong Country. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Comedy Keywords primate cartoon monkey donkey kong Content Score 93 Almost there... Top Contributors 25 Banana z 10 zurman1 w 8 wil001 TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}