{"link": "https://www.themoviedb.org/tv/67195?language=en", "title": "Legion", "resume": "David Haller, AKA Legion, is a troubled young man who may be more than human. Diagnosed as schizophrenic, David has been in and out of psychiatric hospitals for years. But after a strange encounter with a fellow patient, he’s confronted with the possibility that the voices he hears and the visions he sees might be real.", "rate": 76, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Dan Stevens", "Rachel Keller", "Aubrey Plaza", "Jean Smart", "Jeremie Harris"], "character": ["David Haller / Legion", "Sydney ‘Syd’ Barrett", "Lenny Busker", "Melanie Bird", "Ptonomy Wallace"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67195   Expand Legion   (2017) User Score  Play Trailer Overview David Haller, AKA Legion, is a troubled young man who may be more than human. Diagnosed as schizophrenic, David has been in and out of psychiatric hospitals for years. But after a strange encounter with a fellow patient, he’s confronted with the possibility that the voices he hears and the visions he sees might be real. Featured Crew Noah Hawley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  34 Content Issues  2 Images Backdrops  21 Posters  18 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dan Stevens David Haller / Legion Rachel Keller Sydney ‘Syd’ Barrett Aubrey Plaza Lenny Busker Jean Smart Melanie Bird Jeremie Harris Ptonomy Wallace Full Cast & Crew Current Season Season 2 2018 | 11 Episodes View All Seasons Social Reviews  0 Discussions  36 Subject Status Replies Last Reply Season 2 finale ruined it for me Open 1 by  GregorClegane D Did they give a slight reference to Wolverine? Open 2 by  Drew007 Why do ppl hate this? Open 13 by  Movie Queen41 Go to Discussions Media Most Popular Videos  2 Backdrops  21 Posters  18 Recommendations   2016-05-22 Preacher 7.4    2015-11-20 Marvel's Jessica Jones 7.6    2016-09-30 Marvel's Luke Cage 6.9    2015-04-10 Marvel's Daredevil 7.7    2017-03-17 Marvel's Iron Fist 6.1    2015-12-14 The Expanse 7.5    2016-10-02 Westworld 8.1    2017-04-30 American Gods 6.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  50m Homepage   http://www.fxnetworks.com/shows/legion Genres Action & Adventure Sci-Fi & Fantasy Keywords superhero mutant telekinesis based on comic mental institution memory super power mental illness reality vs fantasy unreliable narrator astral projection Content Score 100 Yes! Looking good! Top Contributors 117 Elizabeth Jennings R 17 Rebecca L 15 Law TB 12 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}