{"link": "https://www.themoviedb.org/tv/60956?language=en", "title": "Doctor Stranger", "resume": "As a child, Park Hoon and his dad were kidnapped and taken to North Korea. He grew up there, learning to be a doctor just like his father. When Park Hoon escapes back to South Korea and begins work at a prestigious hospital, he makes it his goal to earn enough money to go back to North Korea to rescue his true love. He'll do anything to find her, but then he meets and falls for a mysterious woman who looks exactly like her.", "rate": 73, "genre": ["Drama"], "cast": ["Lee Jong-suk", "Park Hae-jin", "Jin Se-yeon", "Kang So-ra", "Jeon Kuk-hwan"], "character": ["Park Hoon", "Han Jae Joon", "Song Jae Hee / Han Seung Hee", "Oh Soo-Hyun", "Oh Joon-gyu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60956   Expand Doctor Stranger   (2014) User Score Overview As a child, Park Hoon and his dad were kidnapped and taken to North Korea. He grew up there, learning to be a doctor just like his father. When Park Hoon escapes back to South Korea and begins work at a prestigious hospital, he makes it his goal to earn enough money to go back to North Korea to rescue his true love. He'll do anything to find her, but then he meets and falls for a mysterious woman who looks exactly like her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jong-suk Park Hoon Park Hae-jin Han Jae Joon Jin Se-yeon Song Jae Hee / Han Seung Hee Kang So-ra Oh Soo-Hyun Jeon Kuk-hwan Oh Joon-gyu Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Doctor Stranger premiered on May  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2012-12-03 School 2013 8.5    2014-08-07 Surplus Princess 7.5    2013-12-09 The Prime Minister and I 7.1    2015-10-07 The Village: Achiara's Secret 7.9    2010-03-31 Personal Taste 7.4    2015-01-07 Kill Me, Heal Me 8.7    2015-05-15 The Producers 7.3    2014-07-23 It's Okay, That's Love 9.3  Facts Original Name  닥터 이방인 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000002970 Genres Drama Keywords korea medical drama Content Score 86 Almost there... Top Contributors N 44 Nightowl.Kr M 23 Maria180493 12 Elizabeth Jennings t 6 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}