{"link": "https://www.themoviedb.org/tv/3480?language=en", "title": "You Rang, M'Lord?", "resume": "You Rang M'Lord? is a British comedy series written by Jimmy Perry and David Croft, the creators of Dad's Army, It Ain't Half Hot Mum and Hi-de-Hi! It was broadcast between 1990 and 1993 on the BBC. The show was a comedy set in the house of an aristocratic family in the 1920s, contrasting the upper-class family and their servants in a house in London, along the same lines as the popular drama Upstairs, Downstairs.\nThe series featured many actors who had also appeared in their earlier series, notably Paul Shane, Jeffrey Holland and Su Pollard, all of whom had previously been in Perry and Croft's holiday camp sitcom, Hi-de-Hi!. Also featured were Donald Hewlett and Michael Knowles from Perry and Croft's It Ain't Half Hot Mum, and Bill Pertwee and occasionally Frank Williams from Dad's Army. The memorable 1920s-style theme tune was sung by Bob Monkhouse.\nEpisodes of You Rang M'Lord? were fifty minutes long, rather than the usual thirty, and attempted to introduce a more reflective approach and more complex plotting than other Croft and Perry series. There was also less reliance on filmed location sequences.", "rate": 87, "genre": ["Comedy"], "cast": ["Bill Pertwee", "Donald Hewlett", "Michael Knowles", "Jeffrey Holland", "Su Pollard"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3480   Expand You Rang, M'Lord?   (1988) User Score Overview You Rang M'Lord? is a British comedy series written by Jimmy Perry and David Croft, the creators of Dad's Army, It Ain't Half Hot Mum and Hi-de-Hi! It was broadcast between 1990 and 1993 on the BBC. The show was a comedy set in the house of an aristocratic family in the 1920s, contrasting the upper-class family and their servants in a house in London, along the same lines as the popular drama Upstairs, Downstairs. The series featured many actors who had also appeared in their earlier series, notably Paul Shane, Jeffrey Holland and Su Pollard, all of whom had previously been in Perry and Croft's holiday camp sitcom, Hi-de-Hi!. Also featured were Donald Hewlett and Michael Knowles from Perry and Croft's It Ain't Half Hot Mum, and Bill Pertwee and occasionally Frank Williams from Dad's Army. The memorable 1920s-style theme tune was sung by Bob Monkhouse. Episodes of You Rang M'Lord? were fifty minutes long, rather than the usual thirty, and attempted to introduce a more reflective approach and more complex plotting than other Croft and Perry series. There was also less reliance on filmed location sequences. Featured Crew Jimmy Perry Creator David Croft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Pertwee Donald Hewlett Michael Knowles Jeffrey Holland Su Pollard Full Cast & Crew Last Season Season 4 1993 | 6 Episodes Season 4 of You Rang, M'Lord? premiered on March 20, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on You Rang, M'Lord?. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Comedy Keywords upper class servant sitcom 1920s british humour period sitcom Content Score 93 Almost there... Top Contributors O 11 Ozbourne R 9 Rebecca a 5 aggastyan h 5 horvathjanko38  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}