{"link": "https://www.themoviedb.org/tv/45950?language=en", "title": "High School DxD", "resume": "The story follows Issei Hyōdō, a dim-witted, lecherous second-year high school student who is killed by a girl on his first date ever. Issei is reincarnated as a devil, and from that day forward, he serves as an underling of Riasu, a high-level devil who is also the prettiest girl on Issei's campus.", "rate": 63, "genre": ["Action", "Adventure", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Yuuki Kaji", "Ayana Taketatsu", "Shizuka Itou", "Youko Hikasa", "Azumi Asakura"], "character": ["Issei Hyodo", "Koneko Tōjo", "Akeno Himejima", "Rias Gremory", "Asia Argento"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45950   Expand High School DxD   (2012) User Score  Play Trailer Overview The story follows Issei Hyōdō, a dim-witted, lecherous second-year high school student who is killed by a girl on his first date ever. Issei is reincarnated as a devil, and from that day forward, he serves as an underling of Riasu, a high-level devil who is also the prettiest girl on Issei's campus. Featured Crew Tetsuya Yanagisawa Creator Takao Yoshioka Creator Kenji Konuta Creator Toru Kitahata Creator Yoshifumi Sueda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  9 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Yuuki Kaji Issei Hyodo Ayana Taketatsu Koneko Tōjo Shizuka Itou Akeno Himejima Youko Hikasa Rias Gremory Azumi Asakura Asia Argento Full Cast & Crew Current Season Original Air Date Original Air Date TV cour (Production) High School DxD Hero 2018 | 12 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for High School DxD. Login to be first! Go to Discussions Media Most Popular Videos  3 Backdrops  4 Posters  9 Recommendations   2014-04-08 Black Bullet 6.8    2017-07-04 Tsuredure Children 8.0    2014-10-05 The Fruit of Grisaia 5.8    2016-01-11 Grimgar of Fantasy and Ash 7.2    2010-07-05 Highschool of the Dead 7.0    2012-04-05 Sankarea: Undying Love 7.0    2013-03-31 Date a Live 7.9    2017-04-07 Love Tyrant 7.3  Facts Original Name  ハイスクールD×D Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.haremking.tv/ Genres Action & Adventure Comedy Sci-Fi & Fantasy Keywords high school nudity supernatural harem demon ecchi based on light novel anime school club Content Score 100 Yes! Looking good! Top Contributors 116 WillofOwn 39 sp1ti 17 Sadwick c 16 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}