{"link": "https://www.themoviedb.org/tv/53664?language=en", "title": "The Family of Bryggen", "resume": "They have long been Islands Brygge response to the royal family. Here they are known by one and all - and they are even familiar with every corner of Bryggen as their own back pocket. This is where the family has his permanent base. It is from their world begins. Now the rest of the quite, Danish country come first name with Lens, Stephanie and Ann. But the family of Bryggen will never be the typical family of Denmark, and their lives are anything but monotonous. Instead, they have a stronger unity than most.", "rate": 0, "genre": ["Drama", "Family"], "cast": ["Linse Kessler", "Stephanie Christiansen", "Mor Ann"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53664   Expand The Family of Bryggen   (2011) User Score Overview They have long been Islands Brygge response to the royal family. Here they are known by one and all - and they are even familiar with every corner of Bryggen as their own back pocket. This is where the family has his permanent base. It is from their world begins. Now the rest of the quite, Danish country come first name with Lens, Stephanie and Ann. But the family of Bryggen will never be the typical family of Denmark, and their lives are anything but monotonous. Instead, they have a stronger unity than most. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Linse Kessler Stephanie Christiansen Mor Ann Full Cast & Crew Last Season Season 6 2014 | 1 Episode Season 6 of The Family of Bryggen premiered on September  4, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Family of Bryggen. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Family of Bryggen. You can help by rating TV shows you've seen. Facts Original Name  Familien fra Bryggen Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  40m Homepage   http://tv3.dk/familienfrabryggen Genres Drama Family Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 76 Mike Andersen t 6 thermo6 3 servant74 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}