{"link": "https://www.themoviedb.org/tv/11502?language=en", "title": "Amazon", "resume": "Amazon was a syndicated television show created by Peter Benchley. It was developed by Canadian production companies Alliance Atlantis Communications & WIC Entertainment and German company Beta Film GmbH. The 22 episodes of the series were in first-run syndication between 1999 and 2000.\nThe drama series focused on the six survivors of a crashed airline flight in the Brazilian Amazon jungle. The group soon comes into contact with a Native American tribe, and relations are anything but friendly. The group is taken in by a mysterious tribe, who descended from 16th century British colonists who were lost in Amazon. Relations with the Chosen are tenuous at best. Most of the group escapes the Chosen only to stir up a hornets nest with a tribe of cannibals, led by an insane American woman bent on domination of all the local tribes. The first season ended in a cliff-hanger, and a second season was never produced. The series retained sufficient interest that it was released on DVD in 2011.\nA novelization of the 2-hour pilot was written by Rob MacGregor, and a mass-market paperback was released by Harper on 8 Aug 2000.\nThe German title was Amazonas - Gefangene des Dschungels.", "rate": 73, "genre": ["Drama"], "cast": ["Tyler Hynes", "Chris William Martin", "C. Thomas Howell", "Fabiana Udenio", "Rob Stewart"], "character": ["Pia Claire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11502   Expand Amazon   (1999) User Score Overview Amazon was a syndicated television show created by Peter Benchley. It was developed by Canadian production companies Alliance Atlantis Communications & WIC Entertainment and German company Beta Film GmbH. The 22 episodes of the series were in first-run syndication between 1999 and 2000. The drama series focused on the six survivors of a crashed airline flight in the Brazilian Amazon jungle. The group soon comes into contact with a Native American tribe, and relations are anything but friendly. The group is taken in by a mysterious tribe, who descended from 16th century British colonists who were lost in Amazon. Relations with the Chosen are tenuous at best. Most of the group escapes the Chosen only to stir up a hornets nest with a tribe of cannibals, led by an insane American woman bent on domination of all the local tribes. The first season ended in a cliff-hanger, and a second season was never produced. The series retained sufficient interest that it was released on DVD in 2011. A novelization of the 2-hour pilot was written by Rob MacGregor, and a mass-market paperback was released by Harper on 8 Aug 2000. The German title was Amazonas - Gefangene des Dschungels. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tyler Hynes Chris William Martin C. Thomas Howell Fabiana Udenio Pia Claire Rob Stewart Full Cast & Crew Last Season Season 1 1999 | 22 Episodes Season 1 of Amazon premiered on September 25, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amazon. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors P 6 PepikBerry 4 Zlogorek R 2 Rebecca 1 jobrien2001  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}