{"link": "https://www.themoviedb.org/tv/38979?language=en", "title": "The Confession", "resume": "The Confession is a 10-part web series created by Kiefer Sutherland, written and directed by Brad Mirman, and starring Kiefer Sutherland and John Hurt. It premiered on Hulu on March 28, 2011. Each episode is between five and seven minutes long. It co-stars Daniel London, Max Casella, and Michael Badalucco.", "rate": 76, "genre": ["Action", "Adventure", "Drama"], "cast": ["Kiefer Sutherland", "John Hurt"], "character": ["The Confessor", "Priest"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38979   Expand The Confession   (2011) User Score Overview The Confession is a 10-part web series created by Kiefer Sutherland, written and directed by Brad Mirman, and starring Kiefer Sutherland and John Hurt. It premiered on Hulu on March 28, 2011. Each episode is between five and seven minutes long. It co-stars Daniel London, Max Casella, and Michael Badalucco. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kiefer Sutherland The Confessor John Hurt Priest Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of The Confession premiered on March 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2006-01-01 In Justice 6.8    2011-06-06 Injustice 7.3    2014-11-23 Remember Me 6.7    2010-05-19 The Good Guys 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  7m, 5m, 6m Homepage   http://www.hulu.com/the-confession Genres Action & Adventure Drama Keywords good vs evil hitman priest confessional Content Score 56 We're so close, yet so far. Top Contributors 19 Banana 4 galani s 3 speedycars 3 rhazman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}