{"link": "https://www.themoviedb.org/tv/62792?language=en", "title": "Some Assembly Required", "resume": "When fourteen-year-old Jarvis Raines gets a chemistry set from his Aunt Marlene for Christmas, he assumes it's just another boring gift. Boy is he wrong! The contents create a chemical reaction that destroys his houseso much for a Merry Christmas! After getting not even an apology from the manufacturer, Knickknack Toys, Jarvis takes them to court, wins, and ends up owning the company!", "rate": 47, "genre": ["Comedy"], "cast": ["Charlie Storwick", "Dylan Playfair", "Kolton Stewart", "Harrison Houde", "Sydney Scotia"], "character": ["Piper Gray", "Malcolm \"Knox\" Knoxford III", "Jarvis Raines", "Bowie Sherman", "Geneva Hayes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62792   Expand Some Assembly Required   (2014) User Score Overview When fourteen-year-old Jarvis Raines gets a chemistry set from his Aunt Marlene for Christmas, he assumes it's just another boring gift. Boy is he wrong! The contents create a chemical reaction that destroys his houseso much for a Merry Christmas! After getting not even an apology from the manufacturer, Knickknack Toys, Jarvis takes them to court, wins, and ends up owning the company! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Storwick Piper Gray Dylan Playfair Malcolm \"Knox\" Knoxford III Kolton Stewart Jarvis Raines Harrison Houde Bowie Sherman Sydney Scotia Geneva Hayes Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Some Assembly Required premiered on January  6, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Geneva: Happy Birthday Sydney Scotia! Open 0 by wonder2wonder\n      \n     w Jarvis: Happy Birthday Kolton Stewart! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Some Assembly Required. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.netflix.com/title/80042307 Genres Comedy Keywords teenager working kids Content Score 71 Just a little bit more... Top Contributors w 7 wonder2wonder VF 7 Vitor Fernandes 6 Elizabeth Jennings LC 4 Legit Corporation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}