{"link": "https://www.themoviedb.org/tv/71001?language=en", "title": "Frame Arms Girl", "resume": "Based on Kotobukiya's Frame Arms Girl model kit line. The anime will focus on Gourai, the first model released for the line, as well as Stylet and Baselard.", "rate": 60, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Minami Kabayama", "Rika  Abe", "Youko Hikasa", "Hibiku Yamamura"], "character": ["Jinrai", "Frezvelk", "Gennai  Ao", "Architect"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71001   Expand Frame Arms Girl   (2017) User Score  Play Trailer Overview Based on Kotobukiya's Frame Arms Girl model kit line. The anime will focus on Gourai, the first model released for the line, as well as Stylet and Baselard. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minami Kabayama Jinrai Rika  Abe Frezvelk Youko Hikasa Gennai  Ao Hibiku Yamamura Architect Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Frame Arms Girl premiered on April  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Frame Arms Girl. You can help by rating TV shows you've seen. Facts Original Name  フレームアームズ・ガール Status  In Production Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.fagirl.com/ Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 22 johntres 7 sp1ti s 6 scott2029 5 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}