{"link": "https://www.themoviedb.org/tv/79407?language=en", "title": "Life on Mars", "resume": "While investigating a serial murder case, Han Tae Joo gets into an incident. When he wakes up, he finds himself back in 1987. To get back to his present world, he must solve the murder case.", "rate": 80, "genre": ["Comedy", "Crime", "Sci-Fi", "Fantasy"], "cast": ["Jung Kyung-ho", "Park Sung-woong", "Go Ah-sung", "Oh Dae-Hwan", "Noh Jong Hyun"], "character": ["Han Tae-Joo", "Kang Dong-Cheol", "Yoon Na-Young", "Lee Yong-Ki", "Jo Nam-Sik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79407   Expand Life on Mars   (2018) User Score Overview While investigating a serial murder case, Han Tae Joo gets into an incident. When he wakes up, he finds himself back in 1987. To get back to his present world, he must solve the murder case. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Kyung-ho Han Tae-Joo Park Sung-woong Kang Dong-Cheol Go Ah-sung Yoon Na-Young Oh Dae-Hwan Lee Yong-Ki Noh Jong Hyun Jo Nam-Sik Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Life on Mars premiered on June  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Life on Mars. You can help by rating TV shows you've seen. Facts Original Name  라이프 온 마스 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/ocn/lifeonmars/ Genres Comedy Crime Sci-Fi & Fantasy Keywords time travel Content Score 86 Almost there... Top Contributors M 49 Maria180493 t 3 tufr y 2 yhs4705 1 Otgoo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}