{"link": "https://www.themoviedb.org/tv/63180?language=en", "title": "TVF Pitchers", "resume": "A story of trials and tribulations of four young entrepreneurs who quit their day jobs in order to pursue their start up venture.", "rate": 72, "genre": ["Comedy", "Drama"], "cast": ["Jitendra Kumar", "Abhay Mahajan", "Naveen Kasturia", "Arunabh Kumar"], "character": ["Jitendra", "Saurabh Mandal", "Naveen Bansal", "Yogendra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63180   Expand TVF Pitchers   (2015) User Score  Play Trailer Overview A story of trials and tribulations of four young entrepreneurs who quit their day jobs in order to pursue their start up venture. Featured Crew Arunabh Kumar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jitendra Kumar Jitendra Abhay Mahajan Saurabh Mandal Naveen Kasturia Naveen Bansal Arunabh Kumar Yogendra Full Cast & Crew Last Season Season 1 2015 | 5 Episodes View All Seasons Social Reviews  1 Discussions  0 A review by Prithu  10.0 Written by  Prithu  on February 15, 2017 I have great respect for The Viral Fever team and this series is one of their best works. \nIf you haven't watched it, what are you waiting for? Go Watch it now. The characters are so well written and the plot for each episode is truly amazing. TVF Pitchers touches each aspect about the difficulties and challenges faced by young entrepreneurs and portrays them in a truly marvelous way. Totally worth your Sunday afternoon. Read All Reviews Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations   2014-10-29 Permanent Roommates 6.1    2016-08-28 TVF Tripling 8.0    2015-11-04 Bang Baaja Baaraat 9.0    2004-11-08 Sarabhai vs Sarabhai 5.6    Decker 4.8    2016-12-11 Humorously Yours 6.0    2017-04-21 Bill Nye Saves the World 2.4    2013-01-14 The Carrie Diaries 4.9  Facts Status  Returning Series Networks TVFPlay  Certification  - Type  Scripted Original Language  Hindi Runtime  40m Homepage   https://tvfplay.com/show/detail/14/Pitchers Genres Comedy Drama Keywords india startup buisness Content Score 100 Yes! Looking good! Top Contributors AG 24 Ankur Garg 19 anshdedha7 10 vishal1082 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}