{"link": "https://www.themoviedb.org/tv/43860?language=en", "title": "Wedding Band", "resume": "Wedding Band is an American comedy drama series starring Brian Austin Green, Harold Perrineau, Peter Cambor and Derek Miller. The series ran on TBS from November 10, 2012 to January 19, 2013 at 10 pm EST. It was created by Darin Moiselle and Josh Lobis. On January 22, 2013, TBS officially cancelled the series after one season due to low ratings.", "rate": 70, "genre": ["Comedy"], "cast": ["Brian Austin Green", "Peter Cambor", "Derek Miller", "Jenny Wade", "Kathryn Fiore"], "character": ["Tommy", "Eddie", "Barry", "Rachel", "Ingrid"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43860   Expand Wedding Band   (2012) User Score Overview Wedding Band is an American comedy drama series starring Brian Austin Green, Harold Perrineau, Peter Cambor and Derek Miller. The series ran on TBS from November 10, 2012 to January 19, 2013 at 10 pm EST. It was created by Darin Moiselle and Josh Lobis. On January 22, 2013, TBS officially cancelled the series after one season due to low ratings. Featured Crew Josh Lobis Creator Darin Moiselle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Austin Green Tommy Peter Cambor Eddie Derek Miller Barry Jenny Wade Rachel Kathryn Fiore Ingrid Full Cast & Crew Last Season Season 1 2012 | 10 Episodes Season 1 of Wedding Band premiered on November 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Wedding Band. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors x 12 xIO3Y s 3 speedycars 2 DarkMan D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}