{"link": "https://www.themoviedb.org/tv/29904?language=en", "title": "Brian Jacques' Redwall", "resume": "Redwall is a television series made by Canada-based Nelvana, France-based Alphanim and UK-based BBC One and is based on the Redwall novels by Brian Jacques. The series currently spans three seasons, the first based on the first book Redwall, the second on Mattimeo and the third on Martin the Warrior. The series airs on some PBS channels in the USA, and used to air on Teletoon in Canada on Saturday.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Jake Goldsbie", "Melissa McIntyre", "Ali Mukaddam", "Alison Pill", "Amos Crawley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29904   Expand Brian Jacques' Redwall   (1999) User Score Overview Redwall is a television series made by Canada-based Nelvana, France-based Alphanim and UK-based BBC One and is based on the Redwall novels by Brian Jacques. The series currently spans three seasons, the first based on the first book Redwall, the second on Mattimeo and the third on Martin the Warrior. The series airs on some PBS channels in the USA, and used to air on Teletoon in Canada on Saturday. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jake Goldsbie Melissa McIntyre Ali Mukaddam Alison Pill Amos Crawley Full Cast & Crew Last Season Season 3 2002 | 13 Episodes Season 3 of Brian Jacques' Redwall premiered on April 14, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Brian Jacques' Redwall. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.redwalltv.com/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords based on children's book cartoon mouse Content Score 86 Almost there... Top Contributors 11 Banana 10 TheOneManBoxOffice 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}