{"link": "https://www.themoviedb.org/tv/5645?language=en", "title": "Police Academy", "resume": "Police Academy: The Series, also known as Police Academy: The Animated Series, is a 1988 American animated television series based on the Police Academy series of films. The show was produced by Ruby-Spears Productions for Warner Bros. Television. It aired weekdays and lasted two seasons for a total of 65 episodes.\nSome episodes feature a crime boss named Kingpin. His keen intelligence, girth, and stature are very similar to the Marvel Comics character of the same name. Other new characters were added to the show as well. Among them were a group of talking police dogs called the Canine Corps. They were made up of Samson, Lobo, Bonehead, Chilipepper, and Schitzy. The theme song is performed by the Fat Boys who also make an appearance in two episodes as House's Friends: Big Boss, Cool and Mark.\nWhile the character of Carey Mahoney did appear in the show, he did not appear in either Police Academy 5: Assignment Miami Beach, Police Academy 6: City Under Siege, and Police Academy: Mission to Moscow.", "rate": 33, "genre": ["Animation"], "cast": ["Noam Zylberman", "Howard Morris", "Elizabeth Hanna", "Dan Hennessey", "Denise Pidgeon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5645   Expand Police Academy   (1988) User Score Overview Police Academy: The Series, also known as Police Academy: The Animated Series, is a 1988 American animated television series based on the Police Academy series of films. The show was produced by Ruby-Spears Productions for Warner Bros. Television. It aired weekdays and lasted two seasons for a total of 65 episodes. Some episodes feature a crime boss named Kingpin. His keen intelligence, girth, and stature are very similar to the Marvel Comics character of the same name. Other new characters were added to the show as well. Among them were a group of talking police dogs called the Canine Corps. They were made up of Samson, Lobo, Bonehead, Chilipepper, and Schitzy. The theme song is performed by the Fat Boys who also make an appearance in two episodes as House's Friends: Big Boss, Cool and Mark. While the character of Carey Mahoney did appear in the show, he did not appear in either Police Academy 5: Assignment Miami Beach, Police Academy 6: City Under Siege, and Police Academy: Mission to Moscow. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Noam Zylberman Howard Morris Elizabeth Hanna Dan Hennessey Denise Pidgeon Full Cast & Crew Last Season Season 2 1988 | 38 Episodes Season 2 of Police Academy premiered on November  5, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Police Academy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords police rookie cop Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana D 3 Daniel h 2 hueverin TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}