{"link": "https://www.themoviedb.org/tv/61830?language=en", "title": "The King's Face", "resume": "Since Kwanghae was born from a concubine and only appointed as Crown Prince in a desperate measure, many dissatisfied officials from Northerner faction often plotted for his assassination and dethronement for 16 years. He also often quarreled with his father, King Seonjo, especially regarding Kim Ga Hee. Both son and father will fight against each other in favor of her. However, he eventually managed to overcome the obstacles by the help of Physiognomist, Kim Do Chi and become the next king. Meanwhile, Gwiin Kim is King Seonjo’s royal concubine.", "rate": 80, "genre": ["Drama", "History"], "cast": ["Seo In Guk", "Jo Yoon-hee", "Lee Sung-jae", "Shin Sung-rok", "Ahn Suk-hwan"], "character": ["Prince Gwanghae", "Kim Ga-hee", "King Seonjo", "Kim Do-chi", "Yi San-hae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61830   Expand The King's Face   (2014) User Score  Play Trailer Overview Since Kwanghae was born from a concubine and only appointed as Crown Prince in a desperate measure, many dissatisfied officials from Northerner faction often plotted for his assassination and dethronement for 16 years. He also often quarreled with his father, King Seonjo, especially regarding Kim Ga Hee. Both son and father will fight against each other in favor of her. However, he eventually managed to overcome the obstacles by the help of Physiognomist, Kim Do Chi and become the next king. Meanwhile, Gwiin Kim is King Seonjo’s royal concubine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo In Guk Prince Gwanghae Jo Yoon-hee Kim Ga-hee Lee Sung-jae King Seonjo Shin Sung-rok Kim Do-chi Ahn Suk-hwan Yi San-hae Full Cast & Crew Last Season Season 1 2014 | 24 Episodes Season 1 of The King's Face premiered on November 19, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The King's Face. You can help by rating TV shows you've seen. Facts Original Name  왕의 얼굴 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/thekingsface/main.html Genres Drama History Keywords korea Content Score 93 Almost there... Top Contributors M 45 Maria180493 z 10 zurman1 t 7 tmdb38202327 3 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}