{"link": "https://www.themoviedb.org/tv/67598?language=en", "title": "Prince of Wolf", "resume": "A little boy, who was rescued by a pack of wolves after he was separated from his family on a camping trip, grew up to be the wolves' protector against poachers and other humans who invade their sanctuary.", "rate": 60, "genre": ["Drama"], "cast": ["Derek Chang", "Zhang Yu Zheng", "Zhang Yu Zheng", "Samuel Gu", "Minchen Lin"], "character": ["Du Ze Ming", "childhood Ze Ming", "teenage Ze Ming", "Jian Hao Wei", "Chen Shu Pei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67598   Expand Prince of Wolf   (2016) User Score Overview A little boy, who was rescued by a pack of wolves after he was separated from his family on a camping trip, grew up to be the wolves' protector against poachers and other humans who invade their sanctuary. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Chang Du Ze Ming Zhang Yu Zheng childhood Ze Ming Zhang Yu Zheng teenage Ze Ming Samuel Gu Jian Hao Wei Minchen Lin Chen Shu Pei Full Cast & Crew Last Season Season 1 2016 | 18 Episodes Season 1 of Prince of Wolf premiered on July  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Prince of Wolf. You can help by rating TV shows you've seen. Facts Original Name  Prince of Wolf 狼王子 Status  Ended Network SET Metro Certification  - Type  Scripted Original Language  Chinese Runtime  75m Homepage  - Genres Drama Keywords romance taiwan taiwanese Content Score 86 Almost there... Top Contributors k 23 kayl4 n 3 nubie A 3 Aka75 R 3 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}