{"link": "https://www.themoviedb.org/tv/2426?language=en", "title": "Angel", "resume": "The vampire Angel, cursed with a soul, moves to Los Angeles and aids people with supernatural-related problems while questing for his own redemption. A spin-off from Buffy the Vampire Slayer.", "rate": 76, "genre": ["Drama"], "cast": ["David Boreanaz", "Amy Acker", "Alexis Denisof", "Andy Hallett", "J. August Richards"], "character": ["Angel", "Winifred 'Fred' Burkle / Illyria", "Wesley Wyndam-Pryce", "Lorne", "Charles Gunn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2426   Expand Angel   (1999) User Score  Play Trailer Overview The vampire Angel, cursed with a soul, moves to Los Angeles and aids people with supernatural-related problems while questing for his own redemption. A spin-off from Buffy the Vampire Slayer. Featured Crew David Greenwalt Creator Joss Whedon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  19 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Boreanaz Angel Amy Acker Winifred 'Fred' Burkle / Illyria Alexis Denisof Wesley Wyndam-Pryce Andy Hallett Lorne J. August Richards Charles Gunn Full Cast & Crew Last Season Season 5 2003 | 22 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Better than Buffy Open 28 by  OTHFanatic S The Beast as the season's big bad Open 0 by Strannger18\n      \n     w Cordelia: Happy Birthday Charisma Carpenter! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  8 Recommendations   1997-03-10 Buffy the Vampire Slayer 8.0    1998-10-07 Charmed 6.7    2009-02-13 Dollhouse 7.2    2003-10-30 Tru Calling 6.9    2000-10-03 Dark Angel 7.2    2001-10-16 Smallville 6.9    1999-10-06 Roswell 7.0    2004-09-22 Veronica Mars 7.8  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  41m Homepage   http://www.tntdrama.com/series/angel/ Genres Drama Keywords monster vampire anti hero redemption vampire hunter evil corporation spin off vampire slayer fighting supernatural Content Score 100 Yes! Looking good! Top Contributors 39 TonAngel 23 lineker R 19 Rebecca RA 18 Rodrigo Amaral Buenos Ayres  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}