{"link": "https://www.themoviedb.org/tv/282?language=en", "title": "Ocean Girl", "resume": "Ocean Girl is an Australian science fiction TV series aimed for family audiences and starring Marzena Godecki as the lead character. The show is set in the near future, and focuses on an unusual girl named Neri who lives alone on an island, and the friendships she develops with the inhabitants of an underwater research facility called ORCA. The show is an example of deep ecology science fiction.\nOcean Girl inspired an animated series, The New Adventures of Ocean Girl, which ran from 2000 to 2001, and has since been released on DVD. The animated series is in a distinct reboot separate from the original live-action show.", "rate": 78, "genre": ["Drama", "Action", "Adventure"], "cast": ["Marzena Godecki", "Jeffrey Walker", "David Hoflin", "Kerry Armstrong", "Lauren Hewett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 282   Expand Ocean Girl   (1994) User Score Overview Ocean Girl is an Australian science fiction TV series aimed for family audiences and starring Marzena Godecki as the lead character. The show is set in the near future, and focuses on an unusual girl named Neri who lives alone on an island, and the friendships she develops with the inhabitants of an underwater research facility called ORCA. The show is an example of deep ecology science fiction. Ocean Girl inspired an animated series, The New Adventures of Ocean Girl, which ran from 2000 to 2001, and has since been released on DVD. The animated series is in a distinct reboot separate from the original live-action show. Featured Crew Jonathan M. Shiff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marzena Godecki Jeffrey Walker David Hoflin Kerry Armstrong Lauren Hewett Full Cast & Crew Last Season Season 4 1998 | 26 Episodes Season 4 of Ocean Girl premiered on September  5, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1989-04-04 Round the Twist 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors w 3 webmaster w 2 wuefab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}