{"link": "https://www.themoviedb.org/tv/75853?language=en", "title": "Liberty Crossing", "resume": "A hapless young intelligence analyst at the National Counterterrorism Center must untangle a terror plot while navigating the office's petty backstabbing and bureaucracy - while also tolerating his meddling family.", "rate": 0, "genre": ["Comedy"], "cast": ["Ashley Argota", "Adam Faison", "Shelley Hennig", "Pete Ploszek", "Calum Worthy"], "character": ["Abigail Abaya", "Mohammed Fayed", "Carly Ambrose", "Steven Hathaway", "Aaron Adelman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75853   Expand Liberty Crossing   (2018) User Score  Play Trailer Overview A hapless young intelligence analyst at the National Counterterrorism Center must untangle a terror plot while navigating the office's petty backstabbing and bureaucracy - while also tolerating his meddling family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Argota Abigail Abaya Adam Faison Mohammed Fayed Shelley Hennig Carly Ambrose Pete Ploszek Steven Hathaway Calum Worthy Aaron Adelman Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Liberty Crossing premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Liberty Crossing. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   https://www.go90.com/shows/libertycrossing Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors F 12 FFY00 8 Elizabeth Jennings 5 tigru89 l 3 lala07  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}