{"link": "https://www.themoviedb.org/tv/70207?language=en", "title": "Bad Romance The Series", "resume": "Yihwa, a single university girl, believes that she doesn’t need boys in her life because she can survive without them, and thinks that boys are like iPhones that are only for decoration purposes. However, when she went to the condominium unit of her best friend Korn, who is celebrating his anniversary with his partner Knock, she met Korn’s friend, Cho, who suddenly fell in love with her at first sight. But Yihwa did not feel it the same way; instead, she thought that Cho is gay and he wants to have a relationship with Knock. After that day, Cho started to pursue Yihwa, however he will be having a hard time to please her and will experience different circumstances before he becomes close to her.", "rate": 95, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Tomo Visava Thaiyanont", "Maengmum Pimnitchakun Bumrungkit", "Tul Pakorn Thanasrivanitchai", "Max Nattapol Diloknawarit"], "character": ["Cho", "Yihwa", "Knock", "Korn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70207   Expand Bad Romance The Series   (2016) User Score Overview Yihwa, a single university girl, believes that she doesn’t need boys in her life because she can survive without them, and thinks that boys are like iPhones that are only for decoration purposes. However, when she went to the condominium unit of her best friend Korn, who is celebrating his anniversary with his partner Knock, she met Korn’s friend, Cho, who suddenly fell in love with her at first sight. But Yihwa did not feel it the same way; instead, she thought that Cho is gay and he wants to have a relationship with Knock. After that day, Cho started to pursue Yihwa, however he will be having a hard time to please her and will experience different circumstances before he becomes close to her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomo Visava Thaiyanont Cho Maengmum Pimnitchakun Bumrungkit Yihwa Tul Pakorn Thanasrivanitchai Knock Max Nattapol Diloknawarit Korn Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Bad Romance The Series premiered on July 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bad Romance The Series. You can help by rating TV shows you've seen. Facts Original Name  ตกหลุมหัวใจยัยปีศาจ Status  Ended Network Certification  - Type  Scripted Original Language  Thai Runtime  75m Homepage   http://filmesgays.net/tvshows/bad-romance-the-series/ Genres Comedy Drama Mystery Keywords romance Content Score 79 Pump it up! We're close now. Top Contributors 14 gayso m 9 mendezsjoe 6 kbogesz 5 Nea  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}