{"link": "https://www.themoviedb.org/tv/2052?language=en", "title": "Boys from the Blackstuff", "resume": "Alan Bleasdale's five-part series relates the further experiences of unemployed Liverpudlian tarmac layers Dixie, Chrissie, Loggo and Yosser, and their revered older friend, retired longshoreman and union leader, George Malone. As they struggle to make ends meet in a depressed economy, and to hold together their financially battered families, they are harrassed by the petty bureaucrats of the DHSS. But the lumbering investigational juggernaut is, both comically and tragically, guided by drivers with only a provisional license.", "rate": 87, "genre": ["Drama"], "cast": ["Bernard Hill", "Michael Angelis", "Tom Georgeson", "Alan Igbon", "Peter Kerrigan"], "character": ["Yosser Hughes", "Chrissie Todd", "Dixie Dean", "Loggo Logmond", "George Malone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2052   Expand Boys from the Blackstuff   (1982) User Score Overview Alan Bleasdale's five-part series relates the further experiences of unemployed Liverpudlian tarmac layers Dixie, Chrissie, Loggo and Yosser, and their revered older friend, retired longshoreman and union leader, George Malone. As they struggle to make ends meet in a depressed economy, and to hold together their financially battered families, they are harrassed by the petty bureaucrats of the DHSS. But the lumbering investigational juggernaut is, both comically and tragically, guided by drivers with only a provisional license. Featured Crew Alan Bleasdale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Bernard Hill Yosser Hughes Michael Angelis Chrissie Todd Tom Georgeson Dixie Dean Alan Igbon Loggo Logmond Peter Kerrigan George Malone Full Cast & Crew Last Season Miniseries 1982 | 5 Episodes Season 1 of Boys from the Blackstuff premiered on October 10, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Boys from the Blackstuff. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b00v39pm Genres Drama Keywords northern england miniseries working class gritty unemployment Content Score 86 Almost there... Top Contributors 55 Markxist TB 45 TMDb Bot R 11 Rebecca O 7 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}