{"link": "https://www.themoviedb.org/tv/39379?language=en", "title": "Full Metal Panic!", "resume": "Kaname Chidori’s one of the most popular girls at her high school – unfortunately, it’s her growing popularity off campus she should be worrying about. Unbeknownst to Kaname, terrorists are plotting her abduction, believing she possesses the rare and coveted abilities of “the Whispered.”  That’s where Sousuke Sagara enters the picture. He’s a hotshot soldier from the clandestine counter-terrorist organization known as Mithril – and he’s going undercover at Kaname’s school to try and keep her safe. He may be an ace in the cockpit of an Arm Slave mech, but there’s no training in the world that could prepare him for the warzone of high school.", "rate": 72, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39379   Expand Full Metal Panic!   (2002) User Score  Play Trailer Overview Kaname Chidori’s one of the most popular girls at her high school – unfortunately, it’s her growing popularity off campus she should be worrying about. Unbeknownst to Kaname, terrorists are plotting her abduction, believing she possesses the rare and coveted abilities of “the Whispered.”  That’s where Sousuke Sagara enters the picture. He’s a hotshot soldier from the clandestine counter-terrorist organization known as Mithril – and he’s going undercover at Kaname’s school to try and keep her safe. He may be an ace in the cockpit of an Arm Slave mech, but there’s no training in the world that could prepare him for the warzone of high school. Featured Crew Shoji Gatoh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Full Metal Panic! Invisible Victory 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Full Metal Panic!. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2003-08-26 Full Metal Panic? Fumoffu 6.7    2006-04-04 Air Gear 5.3    2007-04-07 Moribito: Guardian of the Spirit 8.5    2010-04-03 Demon King Daimao 7.2    2009-04-09 Eden of the East 7.0    2009-10-02 A Certain Scientific Railgun 6.3    2006-10-03 D.Gray-man 8.3    2007-04-13 Stigma of the Wind 8.1  Facts Original Name  フルメタル·パニック! Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://fullmeta-iv.com/ Genres Animation Keywords high school based on novel or book slapstick romance mecha piloted robot gunfight violence parallel world military school life seinen anime Content Score 71 Just a little bit more... Top Contributors t 75 tmdb983464 55 Ronnie Borgquist 26 Banana 25 WillofOwn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}