{"link": "https://www.themoviedb.org/tv/4366?language=en", "title": "The Electric Company", "resume": "The Electric Company is an educational American children's television series that was produced by the Children's Television Workshop for PBS in the United States. PBS broadcast 780 episodes over the course of its six seasons from October 25, 1971 to April 15, 1977. After it ceased production that year, the program continued in reruns from 1977 to 1985, the result of a decision made in 1975 to produce two final seasons for perpetual use. CTW produced the show at Teletape Studios Second Stage in Manhattan, the first home of Sesame Street.\nThe Electric Company employed sketch comedy and other devices to provide an entertaining program to help elementary school children develop their grammar and reading skills. It was intended for children who had graduated from CTW's flagship program, Sesame Street. Appropriately, the humor was more mature than what was seen there.", "rate": 80, "genre": ["Comedy"], "cast": ["Bill Cosby", "Mel Brooks", "Skip Hinnant", "Denise Nickerson", "Lee Chamberlin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4366   Expand The Electric Company   (1971) User Score Overview The Electric Company is an educational American children's television series that was produced by the Children's Television Workshop for PBS in the United States. PBS broadcast 780 episodes over the course of its six seasons from October 25, 1971 to April 15, 1977. After it ceased production that year, the program continued in reruns from 1977 to 1985, the result of a decision made in 1975 to produce two final seasons for perpetual use. CTW produced the show at Teletape Studios Second Stage in Manhattan, the first home of Sesame Street. The Electric Company employed sketch comedy and other devices to provide an entertaining program to help elementary school children develop their grammar and reading skills. It was intended for children who had graduated from CTW's flagship program, Sesame Street. Appropriately, the humor was more mature than what was seen there. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Cosby Mel Brooks Skip Hinnant Denise Nickerson Lee Chamberlin Full Cast & Crew Last Season Season 6 1976 | 130 Episodes Season 6 of The Electric Company premiered on October 18, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Electric Company. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  28m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 7 Banana T 3 Tim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}