{"link": "https://www.themoviedb.org/tv/68187?language=en", "title": "The Idiot", "resume": "The Idiot is a costume drama TV series produced by Russia TV Channel in 2003, based on Fyodor Dostoevsky's novel of the same title.\nThe series' script is very close to Dostoevsky's original text, and the series features well-known Russian actors.", "rate": 88, "genre": ["Drama"], "cast": ["Evgeny Mironov", "Vladimir Mashkov", "Lydia Velezheva", "Olga Budina", "Inna Churikova"], "character": ["prince Lev Myshkin", "Parfyon Rogozhin", "Nastasya Filippovna", "Aglaya Epanchina", "Elizaveta Epanchina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68187   Expand The Idiot   (2003) User Score Overview The Idiot is a costume drama TV series produced by Russia TV Channel in 2003, based on Fyodor Dostoevsky's novel of the same title. The series' script is very close to Dostoevsky's original text, and the series features well-known Russian actors. Featured Crew Vladimir Bortko Creator Fyodor Dostoevsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Evgeny Mironov prince Lev Myshkin Vladimir Mashkov Parfyon Rogozhin Lydia Velezheva Nastasya Filippovna Olga Budina Aglaya Epanchina Inna Churikova Elizaveta Epanchina Full Cast & Crew Last Season Season 1 2003 | 10 Episodes Season 1 of The Idiot premiered on May 12, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Idiot. You can help by rating TV shows you've seen. Facts Original Name  Идиот Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Miniseries Original Language  Russian Runtime  50m Homepage   https://russia.tv/brand/show/brand_id/12927/ Genres Drama Keywords miniseries Content Score 93 Almost there... Top Contributors 94 LUR N 7 NikolaiKras 6 BrerFox R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}