{"link": "https://www.themoviedb.org/tv/44787?language=en", "title": "Shut Up Flower Boy Band", "resume": "Shut Up Flower Boy Band is a 2012 South Korean television series starring Sung Joon, Jo Bo-ah, Kim Myung-soo, Jung Eui-chul, Lee Hyun-jae, Yoo Min-kyu, and Kim Min-suk. It is a coming-of-age story about a high school rock band dealing with friendship, rivalry, romance and their passion for music. It aired on tvN from January 30 to March 20, 2012 on Mondays and Tuesdays at 23:00 for 16 episodes.\nIt is the second installment in cable channel tvN's new line of youth-targeted programming \"Oh! Boy\" Project, which features a line-up of handsome leading men. The previous series was Flower Boy Ramyun Shop.\nYoo Min-kyu was cast after winning tvN's reality audition program Flower Boy Casting: Oh! Boy. Kim Myung-soo is from boy band Infinite, Lee Hyun-jae is from indie rock band Mate, and Kim Min-suk and Kim Ye-rim were contestants on reality talent show Superstar K3.", "rate": 76, "genre": ["Drama"], "cast": ["Sung Joon", "L", "Lee Hyun-jae", "Kim Min-seok", "Yoo Min-kyu"], "character": ["Kwon Ji-hyuk", "Lee Hyun-soo", "Jang Do-il", "Seo Kyung-jong", "Kim Ha-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44787   Expand Shut Up Flower Boy Band   (2012) User Score Overview Shut Up Flower Boy Band is a 2012 South Korean television series starring Sung Joon, Jo Bo-ah, Kim Myung-soo, Jung Eui-chul, Lee Hyun-jae, Yoo Min-kyu, and Kim Min-suk. It is a coming-of-age story about a high school rock band dealing with friendship, rivalry, romance and their passion for music. It aired on tvN from January 30 to March 20, 2012 on Mondays and Tuesdays at 23:00 for 16 episodes. It is the second installment in cable channel tvN's new line of youth-targeted programming \"Oh! Boy\" Project, which features a line-up of handsome leading men. The previous series was Flower Boy Ramyun Shop. Yoo Min-kyu was cast after winning tvN's reality audition program Flower Boy Casting: Oh! Boy. Kim Myung-soo is from boy band Infinite, Lee Hyun-jae is from indie rock band Mate, and Kim Min-suk and Kim Ye-rim were contestants on reality talent show Superstar K3. Featured Crew Seo Yoon Hee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Joon Kwon Ji-hyuk L Lee Hyun-soo Lee Hyun-jae Jang Do-il Kim Min-seok Seo Kyung-jong Yoo Min-kyu Kim Ha-jin Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of Shut Up Flower Boy Band premiered on January 30, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   2011-06-29 Heartstrings 7.0    2015-08-05 Yong Pal 7.2    2014-12-08 Healer 8.7    2015-07-03 Oh My Ghostess 7.9    2014-11-12 Pinocchio 7.4    2009-10-07 You're Beautiful 7.9    2013-12-18 My Love From Another Star 8.2    2016-02-24 Descendants of the Sun 6.5  Facts Original Name  닥치고 꽃미남 밴드 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tvn.lifestyler.co.kr/drama/flowerband/ Genres Drama Keywords korea youth Content Score 100 Yes! Looking good! Top Contributors t 19 tmdb38202327 N 12 Nightowl.Kr LS 6 Lee Seung-Su z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}