{"link": "https://www.themoviedb.org/tv/257?language=en", "title": "California Dreams", "resume": "California Dreams is an American teen-oriented sitcom that aired from 1992 to 1996 on Saturday mornings during NBC's Teen NBC programming block. It was created by writers Brett Dewey and Ronald B. Solomon and executive produced by Peter Engel, all known for their work on Saved by the Bell.", "rate": 63, "genre": ["Comedy"], "cast": ["Kelly Packard", "William James Jones", "Michael Cade", "Jay Anthony Franke", "Jennie Kwan"], "character": ["Tiffani Smith", "Tony Wicks", "Sylvester 'Sly' Winkle", "Jake Sommers", "Samantha 'Sam' Woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 257   Expand California Dreams   (1992) User Score Overview California Dreams is an American teen-oriented sitcom that aired from 1992 to 1996 on Saturday mornings during NBC's Teen NBC programming block. It was created by writers Brett Dewey and Ronald B. Solomon and executive produced by Peter Engel, all known for their work on Saved by the Bell. Featured Crew Ronald B. Solomon Creator Brett Dewey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelly Packard Tiffani Smith William James Jones Tony Wicks Michael Cade Sylvester 'Sly' Winkle Jay Anthony Franke Jake Sommers Jennie Kwan Samantha 'Sam' Woo Full Cast & Crew Last Season Season 5 1996 | 15 Episodes Season 5 of California Dreams premiered on September  7, 1996. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply s were Matt and Jenny supposed to be twins? Open 0 by svreenwriter89\n      \n     Favourite cast? Open 0 by Stratego!\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on California Dreams. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords california rock band teen comedy sitcom teen social issues Content Score 79 Pump it up! We're close now. Top Contributors 5 17 5lucina5 16 Banana E 3 EightNine PS 3 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}