{"link": "https://www.themoviedb.org/tv/10843?language=en", "title": "Throb", "resume": "Throb is an American television sitcom broadcast in syndication from 1986 to 1988, created by Fredi Towbin. It revolved around thirty-something divorcee Sandy Beatty who gets a job at a small New Wave record label, Throb. Beatty's boss is Zach Armstrong, who looks like Michael J. Fox but dresses like Don Johnson. Beatty also has a 12-year old son named Jeremy. Beatty's best friend was Meredith, a single teacher who lived in her building, and her co-workers included hip business manager Phil Gaines, and Prudence Anne Bartlett, nicknamed Blue.\nDuring the second season, Sandy moved from her original apartment to the recently vacated penthouse in her building. She took in her co-worker, Blue, to help with rent, but the differences between straitlaced Sandy and the very free-spirited Blue became more pronounced as they both lived and worked together.\nNotably, it was the first time much of the American TV audience saw Jane Leeves, who later gained fame as Daphne Moon on Frasier. Also notable is the casting of a young Paul Walker, who played Jeremy Beatty for the first season. Walker became a leading man in Hollywood some 15 years later, particularly after his breakthrough role in The Fast and the Furious.", "rate": 60, "genre": ["Comedy"], "cast": ["Paul Walker", "Diana Canova", "Jane Leeves", "Jonathan Prince", "Richard Cummings Jr."], "character": ["Jeremy Beatty", "Prudence Anne 'Blue' Bartlett", "Phil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10843   Expand Throb   (1986) User Score Overview Throb is an American television sitcom broadcast in syndication from 1986 to 1988, created by Fredi Towbin. It revolved around thirty-something divorcee Sandy Beatty who gets a job at a small New Wave record label, Throb. Beatty's boss is Zach Armstrong, who looks like Michael J. Fox but dresses like Don Johnson. Beatty also has a 12-year old son named Jeremy. Beatty's best friend was Meredith, a single teacher who lived in her building, and her co-workers included hip business manager Phil Gaines, and Prudence Anne Bartlett, nicknamed Blue. During the second season, Sandy moved from her original apartment to the recently vacated penthouse in her building. She took in her co-worker, Blue, to help with rent, but the differences between straitlaced Sandy and the very free-spirited Blue became more pronounced as they both lived and worked together. Notably, it was the first time much of the American TV audience saw Jane Leeves, who later gained fame as Daphne Moon on Frasier. Also notable is the casting of a young Paul Walker, who played Jeremy Beatty for the first season. Walker became a leading man in Hollywood some 15 years later, particularly after his breakthrough role in The Fast and the Furious. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Walker Jeremy Beatty Diana Canova Jane Leeves Prudence Anne 'Blue' Bartlett Jonathan Prince Richard Cummings Jr. Phil Full Cast & Crew Last Season Season 2 1987 | 24 Episodes Season 2 of Throb premiered on September 19, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Throb. You can help by rating TV shows you've seen. Facts Status  Cancelled Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords music business punk rock workplace comedy Content Score 71 Just a little bit more... Top Contributors PE 5 Patrick E. Abe r 3 rampagedeluxe r 2 rampagedeluxe@gmx.de 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}