{"link": "https://www.themoviedb.org/tv/78173?language=en", "title": "Dragons: Race to the Edge", "resume": "Unlock the secrets of the Dragon Eye and come face to face with more dragons than anyone has ever imagined as Hiccup, Toothless and the Dragon Riders soar to the edge of adventure.", "rate": 75, "genre": ["Family", "Kids", "Animation"], "cast": ["Jay Baruchel", "America Ferrera", "Zack Pearlman", "Christopher Mintz-Plasse", "T.J. Miller"], "character": ["Hiccup", "Astrid", "Snotlout", "Fishlegs, Thor Bonecrusher", "T.J. Miller: Tuffnut, Gruffnut"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78173   Expand Dragons: Race to the Edge   (2015) User Score Overview Unlock the secrets of the Dragon Eye and come face to face with more dragons than anyone has ever imagined as Hiccup, Toothless and the Dragon Riders soar to the edge of adventure. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Baruchel Hiccup America Ferrera Astrid Zack Pearlman Snotlout Christopher Mintz-Plasse Fishlegs, Thor Bonecrusher T.J. Miller T.J. Miller: Tuffnut, Gruffnut Full Cast & Crew Current Season Season 6 2018 | 13 Episodes Season 6 of Dragons: Race to the Edge premiered on February 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dragons: Race to the Edge. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  - Homepage   https://www.howtotrainyourdragon.com/tv/race-to-the-edge Genres Family Kids Animation Keywords viking dragon Content Score 71 Just a little bit more... Top Contributors 39 tatergator O 9 OnNeVitQue2FoisJB p 4 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}