{"link": "https://www.themoviedb.org/tv/25707?language=en", "title": "Captain Tsubasa", "resume": "Tsubasa Ozora moves to the town Nankatsu to increase his skills as a soccer player. He is challanged by the Super Goalkeeper Genzo Wakabayashi. He then agree to compete and see who was the best soccer player there.", "rate": 70, "genre": ["Animation"], "cast": ["Akari Hibino"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25707   Expand Captain Tsubasa   (1983) User Score Overview Tsubasa Ozora moves to the town Nankatsu to increase his skills as a soccer player. He is challanged by the Super Goalkeeper Genzo Wakabayashi. He then agree to compete and see who was the best soccer player there. Featured Crew Yôichi Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  23 Images Backdrops  6 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akari Hibino Full Cast & Crew Last Season Season 7 2001 | 26 Episodes Season 7 of Captain Tsubasa premiered on October  7, 2001. View All Seasons Social Reviews  0 Discussions  23 Subject Status Replies Last Reply There are no discussions for Captain Tsubasa. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  9 Recommendations   1981-04-07 Meiken Jolie 7.3    1972-12-03 Mazinger Z 8.1    1975-05-01 The Adventures of Maya the Honey Bee 6.6    1982-06-29 The Mysterious Cities of Gold 8.9    1975-10-05 UFO Robo Grendizer 6.5    1994-11-10 Kommissar Rex 4.9    1960-11-14 Popeye the Sailor 5.8    1995-01-29 Hercules: The Legendary Journeys 6.3  Facts Original Name  キャプテン翼 Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tv-tokyo.co.jp/anime/cap_tsuba/ Genres Animation Keywords soccer anime Content Score 64 We're so close, yet so far. Top Contributors 9 United600 8 Elizabeth Jennings 8 niqo19 7 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}