{"link": "https://www.themoviedb.org/tv/904?language=en", "title": "Lincoln Heights", "resume": "Lincoln Heights is an American family drama television series about Eddie Sutton, a Mission Vista police officer who moves his family back to his old neighborhood, Lincoln Heights, to start a new life and to help out his old neighborhood. It is a dangerous place to raise a family, and through the many trials the family goes through, they soon learn that settling in is not as easy as it seems. While Officer Sutton struggles to cope with every day life as a street cop in Los Angeles, his kids try to fit in at their new schools and with their new neighbors.\nThe show premiered January 8, 2007 on the ABC Family network with 13 episodes ordered for the first season. It was approved for a second season, which premiered September 4, 2007. Vanessa Hudgens' song, Say OK had been used in a commercial to promote the second season. To promote the third season, they showed clips of Cassie and Charles's relationship to the song, Crush by the American Idol's seventh season runner-up, David Archuleta. To promote season 4, they're using the song, Avalanche by Marie Digby. The show's theme song was written and performed by bassist Stanley Clarke and singer-songwriter Blaire Reinhard.\nOn January 29, 2010, ABC Family announced the cancellation of the series after four seasons.", "rate": 63, "genre": ["Action", "Adventure", "Drama"], "cast": ["Russell Hornsby", "Nicki Micheaux", "Erica Hubbard", "Rhyon Nicole Brown", "Mishon Ratliff"], "character": ["Eddie Sutton", "Jenn Sutton", "Cassie Sutton", "Lizzie Sutton", "Taylor Sutton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 904   Expand Lincoln Heights   (2007) User Score Overview Lincoln Heights is an American family drama television series about Eddie Sutton, a Mission Vista police officer who moves his family back to his old neighborhood, Lincoln Heights, to start a new life and to help out his old neighborhood. It is a dangerous place to raise a family, and through the many trials the family goes through, they soon learn that settling in is not as easy as it seems. While Officer Sutton struggles to cope with every day life as a street cop in Los Angeles, his kids try to fit in at their new schools and with their new neighbors. The show premiered January 8, 2007 on the ABC Family network with 13 episodes ordered for the first season. It was approved for a second season, which premiered September 4, 2007. Vanessa Hudgens' song, Say OK had been used in a commercial to promote the second season. To promote the third season, they showed clips of Cassie and Charles's relationship to the song, Crush by the American Idol's seventh season runner-up, David Archuleta. To promote season 4, they're using the song, Avalanche by Marie Digby. The show's theme song was written and performed by bassist Stanley Clarke and singer-songwriter Blaire Reinhard. On January 29, 2010, ABC Family announced the cancellation of the series after four seasons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russell Hornsby Eddie Sutton Nicki Micheaux Jenn Sutton Erica Hubbard Cassie Sutton Rhyon Nicole Brown Lizzie Sutton Mishon Ratliff Taylor Sutton Full Cast & Crew Last Season Season 4 2009 | 10 Episodes Season 4 of Lincoln Heights premiered on September 14, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lincoln Heights. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords california teenager black family family of color Content Score 86 Almost there... Top Contributors 26 Banana TS 5 Tony S. c 1 castacasta w 1 whitelist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}