{"link": "https://www.themoviedb.org/tv/68192?language=en", "title": "Shoot the Messenger", "resume": "The series follows Daisy Channing, a young reporter trying to balance a messy personal life with a burgeoning career. Things begin to go sideways for Daisy when she witnesses a murder she thinks is gang-related, only to find herself slowly drawn into an interconnected web of criminal and illicit sexual activity that reaches into the corridors of corporate and political power. It's the kind of story that will destroy lives, including those of her own family. With help from lead homicide detective Kevin Lutz, her editor Mary Foster and co-worker Simon Olenski, Daisy uncovers a cover-up so scandalous it could bring down the government.", "rate": 50, "genre": ["Crime", "Drama"], "cast": ["Elyse Levesque", "Lucas Bryant", "Lyriq Bent", "Alex Kingston"], "character": ["Daisy Channing", "Simon Olenski", "Kevin Lutz", "Mary Foster"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68192   Expand Shoot the Messenger   (2016) User Score  Play Trailer Overview The series follows Daisy Channing, a young reporter trying to balance a messy personal life with a burgeoning career. Things begin to go sideways for Daisy when she witnesses a murder she thinks is gang-related, only to find herself slowly drawn into an interconnected web of criminal and illicit sexual activity that reaches into the corridors of corporate and political power. It's the kind of story that will destroy lives, including those of her own family. With help from lead homicide detective Kevin Lutz, her editor Mary Foster and co-worker Simon Olenski, Daisy uncovers a cover-up so scandalous it could bring down the government. Featured Crew Sudz Sutherland Creator Jennifer Holness Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elyse Levesque Daisy Channing Lucas Bryant Simon Olenski Lyriq Bent Kevin Lutz Alex Kingston Mary Foster Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Shoot the Messenger premiered on October  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Shoot the Messenger. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbc.ca/shootthemessenger/ Genres Crime Drama Keywords murder case Content Score 100 Yes! Looking good! Top Contributors z 24 zyck a 5 aliandrejoaquin 3 Victor t 2 tmdb62726470  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}