{"link": "https://www.themoviedb.org/tv/66551?language=en", "title": "The Mick", "resume": "Mackenzie \"Mickey\" Murphy is a hard-living, foul-mouthed, cigarette-smoking woman who moves to affluent Greenwich, CT to raise the spoiled kids of her wealthy sister who fled the country to avoid a federal indictment. She quickly learns what the rest of us already know - other people's children are awful.", "rate": 70, "genre": ["Comedy"], "cast": ["Kaitlin Olson", "Sofia Black-D'Elia", "Thomas Barbusca", "Jack Stanton", "Carla Jimenez"], "character": ["Machenzie 'Micky' Murphy", "Sabrina Pemberton", "Chip Pemberton", "Ben Pemberton", "Alba"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66551   Expand The Mick   (2017) User Score  Play Trailer Overview Mackenzie \"Mickey\" Murphy is a hard-living, foul-mouthed, cigarette-smoking woman who moves to affluent Greenwich, CT to raise the spoiled kids of her wealthy sister who fled the country to avoid a federal indictment. She quickly learns what the rest of us already know - other people's children are awful. Featured Crew Dave Chernin Creator John Chernin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  1 Images Backdrops  10 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaitlin Olson Machenzie 'Micky' Murphy Sofia Black-D'Elia Sabrina Pemberton Thomas Barbusca Chip Pemberton Jack Stanton Ben Pemberton Carla Jimenez Alba Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 2 2017 | 20 Episodes Season 2 of The Mick premiered on September 26, 2017. View All Seasons Social Reviews  1 Discussions  17 c A review by chris  7.0 Written by  chris  on August 28, 2017 ok no this isn't a role model family or the perfect American family however this is one of the funniest tv comedies in recent memory micky herself isn't very family or kid friendly but shes working on it and the show is so heartwarming and funny you just cant resist it I suggest if you have a  mature family you give this one a chance you will like it Read All Reviews Media Most Popular Videos  1 Backdrops  10 Posters  6 Recommendations   2017-10-01 Ghosted 6.2    2017-09-26 Law & Order True Crime 6.1    2016-09-21 Speechless 7.5    2014-06-04 Jennifer Falls 3.2    2016-05-26 Neil Gaiman's Likely Stories 5.8    2015-11-30 Superstore 6.7    2017-02-07 Imposters 7.6    2017-07-24 Somewhere Between 5.9  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.fox.com/the-mick Genres Comedy Keywords aunt dysfunctional family wealthy housekeeper family sitcom child care spoiled rich kids Content Score 100 Yes! Looking good! Top Contributors 55 Banana 28 Elizabeth Jennings k 13 krystyan b 10 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}