{"link": "https://www.themoviedb.org/tv/64186?language=en", "title": "Truth Be Told", "resume": "If you can think it, they will say it. This unabashed new comedy is about two diverse couples, who are both neighbors and best friends. As they go through life side by side, they can't help but analyze and obsess about EVERYTHING. From topics like sex and race, to the fact that the trusted new babysitter might just be a porn star, nothing is out of bounds for this wildly outspoken foursome.", "rate": 55, "genre": ["Comedy"], "cast": ["Mark-Paul Gosselaar", "Vanessa Lachey", "Tone Bell", "Bresha Webb"], "character": ["Mitch", "Tracy", "Russell", "Angie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64186   Expand Truth Be Told   (2015) User Score Overview If you can think it, they will say it. This unabashed new comedy is about two diverse couples, who are both neighbors and best friends. As they go through life side by side, they can't help but analyze and obsess about EVERYTHING. From topics like sex and race, to the fact that the trusted new babysitter might just be a porn star, nothing is out of bounds for this wildly outspoken foursome. Featured Crew D.J. Nash Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark-Paul Gosselaar Mitch Vanessa Lachey Tracy Tone Bell Russell Bresha Webb Angie Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Truth Be Told premiered on October 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2016-03-01 Loosely Exactly Nicole 5.8    2015-12-07 Telenovela 7.2    2015-10-01 Benders 5.9    2016-06-07 Agatha Raisin 6.3    2016-10-19 HIM 6.2    2016-01-13 Teachers 7.1    2017-05-17 Downward Dog 6.7    2016-09-05 Mary + Jane 6.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  21m Homepage   http://www.nbc.com/truth-be-told Genres Comedy Keywords sitcom Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings 17 Bobel 7 Banana f 2 furkan-guven0000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}