{"link": "https://www.themoviedb.org/tv/60566?language=en", "title": "Ambassadors", "resume": "Comedy-drama series set in the fictional Central Asian Republic of Tazbekistan where newly arrived British Ambassador Keith Davies is set the task of trying to secure a £2 billion helicopter contract for the United Kingdom.", "rate": 70, "genre": ["Comedy"], "cast": ["David Mitchell", "Robert Webb", "Susan Lynch", "Amara Karan", "Oliver Dimsdale"], "character": ["Keith Davis", "Neil Tilly", "Caitlin", "Isabel", "French Ambassador"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60566   Expand Ambassadors   (2013) User Score Overview Comedy-drama series set in the fictional Central Asian Republic of Tazbekistan where newly arrived British Ambassador Keith Davies is set the task of trying to secure a £2 billion helicopter contract for the United Kingdom. Featured Crew Rupert Walters Creator James Wood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Mitchell Keith Davis Robert Webb Neil Tilly Susan Lynch Caitlin Amara Karan Isabel Oliver Dimsdale French Ambassador Full Cast & Crew Last Season Season 1 2013 | 3 Episodes Season 1 of Ambassadors premiered on October 23, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2007-04-22 Kingdom 7.0    2010-12-25 Come Fly With Me 6.6    2005-06-05 Mock the Week 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p01jd3vx Genres Comedy Keywords middle east ambassador politics miniseries political humour british humour Content Score 93 Almost there... Top Contributors 25 tulgha TB 21 TMDb Bot O 6 Ozbourne 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}