{"link": "https://www.themoviedb.org/tv/61487?language=en", "title": "My Lovable Girl", "resume": "Hyun Wook is the CEO of a talent agency that scouts and trains idols. He is a brilliant songwriter-producer who appears cold and indifferent on the outside but is sensitive and kind-hearted. Hyun Wook lives in great difficulty as he unable to let go of his ex girlfriend who dies in an accident he witnesses first hand. His ex-girlfriend’s sister, Se Na, moves to Seoul in order to pursue her songwriting career and meets Hyun Wook who helps her achieve it. In the midst of healing through music, they fall in love.", "rate": 75, "genre": ["Drama"], "cast": ["Krystal Jung", "Rain", "Cha Ye-ryun", "L", "Jo Hee-bong"], "character": ["Yoon Se-na", "Lee Hyun-wook", "Shin Hae-yoon", "Shi-woo", "Kang Tae-min"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61487   Expand My Lovable Girl   (2014) User Score Overview Hyun Wook is the CEO of a talent agency that scouts and trains idols. He is a brilliant songwriter-producer who appears cold and indifferent on the outside but is sensitive and kind-hearted. Hyun Wook lives in great difficulty as he unable to let go of his ex girlfriend who dies in an accident he witnesses first hand. His ex-girlfriend’s sister, Se Na, moves to Seoul in order to pursue her songwriting career and meets Hyun Wook who helps her achieve it. In the midst of healing through music, they fall in love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Krystal Jung Yoon Se-na Rain Lee Hyun-wook Cha Ye-ryun Shin Hae-yoon L Shi-woo Jo Hee-bong Kang Tae-min Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of My Lovable Girl premiered on September 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Lovable Girl. You can help by rating TV shows you've seen. Facts Original Name  내겐 너무 사랑스러운 그녀 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000004441 Genres Drama Keywords music korea Content Score 86 Almost there... Top Contributors M 40 Maria180493 10 Elizabeth Jennings CM 7 Cherche Moi z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}