{"link": "https://www.themoviedb.org/tv/11617?language=en", "title": "Carol & Company", "resume": "Carol & Company is a comedy program airing on NBC-TV in the United States during 1990 and 1991.\nCarol & Company applied an unusual repertory approach to television comedy. Every week, Carol Burnett and her fellow players, Peter Krause, Jeremy Piven, Meagen Fay, Terry Kiser, Anita Barone, and Richard Kind, performed a different half-hour comedy playlet. Only the performers remained the same from week to week; there were no ongoing characters or plots, although there were guest stars from time to time; Betty White was one who made an appearance. In 1991, Carol's cohort, Tim Conway made a cameo appearance as audience member in an episode, \"That Little Extra Something.\"\nCarol & Company began as a midseason replacement in January 1990, and was subsequently picked up for a full season and ran until July 1991.\nIn 1990 Swoosie Kurtz won an Emmy for her appearance in the episode titled Reunion.", "rate": 0, "genre": ["Comedy"], "cast": ["Carol Burnett", "Peter Krause", "Jeremy Piven", "Richard Kind", "Meagen Fay"], "character": ["Myna", "Skit characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11617   Expand Carol & Company   (1990) User Score Overview Carol & Company is a comedy program airing on NBC-TV in the United States during 1990 and 1991. Carol & Company applied an unusual repertory approach to television comedy. Every week, Carol Burnett and her fellow players, Peter Krause, Jeremy Piven, Meagen Fay, Terry Kiser, Anita Barone, and Richard Kind, performed a different half-hour comedy playlet. Only the performers remained the same from week to week; there were no ongoing characters or plots, although there were guest stars from time to time; Betty White was one who made an appearance. In 1991, Carol's cohort, Tim Conway made a cameo appearance as audience member in an episode, \"That Little Extra Something.\" Carol & Company began as a midseason replacement in January 1990, and was subsequently picked up for a full season and ran until July 1991. In 1990 Swoosie Kurtz won an Emmy for her appearance in the episode titled Reunion. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carol Burnett Myna Peter Krause Skit characters Jeremy Piven Richard Kind Meagen Fay Full Cast & Crew Last Season Season 1 1990 | 14 Episodes Season 1 of Carol & Company premiered on March 31, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Carol & Company. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords anthology Content Score 71 Just a little bit more... Top Contributors 8 Banana R 1 Rebafan23  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}