{"link": "https://www.themoviedb.org/tv/70102?language=en", "title": "Stranded with a Million Dollars", "resume": "The series drops 10 adventurers on an island with nothing but the clothes on their backs and a million dollars in cash. Those who survive for 40 days filled with gut-wrenching journeys and demanding physical challenges will split the money as their prize. The catch? They can buy all of the survival supplies and creature comforts they desire, but everything is crazy expensive (think $30K for a tent), all decisions to make a purchase require a group majority and the cost comes out of their shared prize money.", "rate": 95, "genre": ["Action", "Adventure", "Reality"], "cast": ["Alex Apple", "Alonzo Gordon", "Ashley Mercer", "Bria Fleming", "Chris Lacerra"], "character": ["Himself", "Himself", "Herself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70102   Expand Stranded with a Million Dollars   (2017) User Score  Play Trailer Overview The series drops 10 adventurers on an island with nothing but the clothes on their backs and a million dollars in cash. Those who survive for 40 days filled with gut-wrenching journeys and demanding physical challenges will split the money as their prize. The catch? They can buy all of the survival supplies and creature comforts they desire, but everything is crazy expensive (think $30K for a tent), all decisions to make a purchase require a group majority and the cost comes out of their shared prize money. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex Apple Himself Alonzo Gordon Himself Ashley Mercer Herself Bria Fleming Herself Chris Lacerra Himself Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Stranded with a Million Dollars premiered on February 21, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Great show!  Interesting to see... Open 0 by nyxeus\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Stranded with a Million Dollars. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.mtv.com/shows/stranded Genres Action & Adventure Reality Keywords survival social Content Score 93 Almost there... Top Contributors D 23 Double-Dee 7 Alexandria t 6 tmdbfan1 4 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}