{"link": "https://www.themoviedb.org/tv/11945?language=en", "title": "Chances", "resume": "Chances was an Australian evening soap opera, produced from 1991 to 1992. It told the story of the average middle-class Taylor family whose lives are transformed by winning $3 million in the lottery. The series was broadcast by the Nine Network, initially as two one-hour episodes each week.\nPrincipal cast members included John Sheerin and Brenda Addie as Dan and Barbara Taylor, Jeremy Sims as their mischievous son Alex, Deborah Kennedy as Dan's sister Connie Reynolds, Tim Robertson as Dan's brother Jack, Anne Grigg as his wife Sarah, and Michael Caton as neighbourhood friend Bill Anderson. Originally, creator Lynn Bayonas pitched the show as a family-oriented drama; however to help ensure the program's success, Channel Nine asked for nude scenes and risqué elements to also be included in the series. Initial publicity for the show focused on the sex angle, and it was for this that Chances was chiefly known.", "rate": 0, "genre": ["Soap", "Drama"], "cast": ["Peter Phelps", "Tammy Macintosh", "Sandy Gore", "Michael Caton", "Diane Craig"], "character": ["Alex Alter Ego", "Mandy Foster", "Connie Taylor", "Bill Anderson", "Barbara Taylor #2"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11945   Expand Chances   (1991) User Score Overview Chances was an Australian evening soap opera, produced from 1991 to 1992. It told the story of the average middle-class Taylor family whose lives are transformed by winning $3 million in the lottery. The series was broadcast by the Nine Network, initially as two one-hour episodes each week. Principal cast members included John Sheerin and Brenda Addie as Dan and Barbara Taylor, Jeremy Sims as their mischievous son Alex, Deborah Kennedy as Dan's sister Connie Reynolds, Tim Robertson as Dan's brother Jack, Anne Grigg as his wife Sarah, and Michael Caton as neighbourhood friend Bill Anderson. Originally, creator Lynn Bayonas pitched the show as a family-oriented drama; however to help ensure the program's success, Channel Nine asked for nude scenes and risqué elements to also be included in the series. Initial publicity for the show focused on the sex angle, and it was for this that Chances was chiefly known. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Phelps Alex Alter Ego Tammy Macintosh Mandy Foster Sandy Gore Connie Taylor Michael Caton Bill Anderson Diane Craig Barbara Taylor #2 Full Cast & Crew Last Season Season 1 — | 127 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chances. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords lottery soap opera sudden wealth winning lottery Content Score 71 Just a little bit more... Top Contributors 23 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}