{"link": "https://www.themoviedb.org/tv/42388?language=en", "title": "Cajun Pawn Stars", "resume": "Cajun Pawn Stars is an American reality television series on the History channel that debuted January 8, 2012, at 10 pm ET.\nThe show is the second spin-off of Pawn Stars, but unlike fellow spinoffs American Restoration and Counting Cars, it is entirely unrelated to the venue and staff of Pawn Stars.\nCajun Pawn Stars revolves around another family-owned pawn shop, the Silver Dollar Pawn & Jewelry Center in Alexandria, Louisiana, which is owned by Jimmie \"Big Daddy\" DeRamus, who runs the store along with his wife Peggy, his brother Johnnie, and daughter Tammie. Assisting the DeRamuses are employees Tina Journet, Walt Piper, and Robby Friend; as well as the pawn shop's resident gun expert Gary Ermatinger. The shop claims to have over 100,000 items within its 20,000 square foot showroom.\nThe show's format is similar to the original Pawn Stars, as it features an array of collectible, antique and unusual items that people sell or pawn, complemented with \"pop-up\" facts related to the item. Also, as with the original series, the shop sometimes consults an expert to give an appraisal/opinion on the item being sold or pawned. In addition, at the second commercial break, a trivia question is asked in relation to the shop or item, as with Pawn Stars.", "rate": 57, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42388   Expand Cajun Pawn Stars   (2012) User Score Overview Cajun Pawn Stars is an American reality television series on the History channel that debuted January 8, 2012, at 10 pm ET. The show is the second spin-off of Pawn Stars, but unlike fellow spinoffs American Restoration and Counting Cars, it is entirely unrelated to the venue and staff of Pawn Stars. Cajun Pawn Stars revolves around another family-owned pawn shop, the Silver Dollar Pawn & Jewelry Center in Alexandria, Louisiana, which is owned by Jimmie \"Big Daddy\" DeRamus, who runs the store along with his wife Peggy, his brother Johnnie, and daughter Tammie. Assisting the DeRamuses are employees Tina Journet, Walt Piper, and Robby Friend; as well as the pawn shop's resident gun expert Gary Ermatinger. The shop claims to have over 100,000 items within its 20,000 square foot showroom. The show's format is similar to the original Pawn Stars, as it features an array of collectible, antique and unusual items that people sell or pawn, complemented with \"pop-up\" facts related to the item. Also, as with the original series, the shop sometimes consults an expert to give an appraisal/opinion on the item being sold or pawned. In addition, at the second commercial break, a trivia question is asked in relation to the shop or item, as with Pawn Stars. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2012 | 52 Episodes Season 1 of Cajun Pawn Stars premiered on January  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cajun Pawn Stars. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage  - Genres Reality Keywords southern pride buy, trade, sell animal trades Content Score 56 We're so close, yet so far. Top Contributors z 10 zurman1 PE 4 Patrick E. Abe 1 gianpoker 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}