{"link": "https://www.themoviedb.org/tv/27480?language=en", "title": "The Erotic Traveler", "resume": "The Midland Art Gallery is the home base for this erotic series starring Divini Rai as erotic photographer Marissa Johanson and Kaylani Lei as her pupil Allison Kraft. The series uses photographs and works of art to take episodic settings all over the world.", "rate": 60, "genre": ["Drama"], "cast": ["Tabitha Stevens", "Divini Rae", "Kaylani Lei"], "character": ["Model", "Marissa Johanson", "Allison Kraft"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27480   Expand The Erotic Traveler   (2007) User Score Overview The Midland Art Gallery is the home base for this erotic series starring Divini Rai as erotic photographer Marissa Johanson and Kaylani Lei as her pupil Allison Kraft. The series uses photographs and works of art to take episodic settings all over the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tabitha Stevens Model Divini Rae Marissa Johanson Kaylani Lei Allison Kraft Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of The Erotic Traveler premiered on February  2, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Erotic Traveler. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 20 resin 4 lineker f 2 florin1704 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}