{"link": "https://www.themoviedb.org/tv/6948?language=en", "title": "Battlefield Detectives", "resume": "Battlefield Detectives is a forensic documentary television series that aired on the History Channel from 2003 to 2006. The series explores famous battles focusing on the battlefield itself, and tell its story based on recent scientific research. It uses modern science to examine how the battles were won or lost.\nAccording to History Television, \"This series approaches the perennially interesting topic of famous battles in a fresh and exhilarating way. Focusing on the battlefield itself, each programme takes an important battle telling its story and posing a puzzling central question about the battle that recent scientific research is helping to illuminate - a contemporary journey of discovery and a compelling story from the past.\"", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6948   Expand Battlefield Detectives   (2003) User Score Overview Battlefield Detectives is a forensic documentary television series that aired on the History Channel from 2003 to 2006. The series explores famous battles focusing on the battlefield itself, and tell its story based on recent scientific research. It uses modern science to examine how the battles were won or lost. According to History Television, \"This series approaches the perennially interesting topic of famous battles in a fresh and exhilarating way. Focusing on the battlefield itself, each programme takes an important battle telling its story and posing a puzzling central question about the battle that recent scientific research is helping to illuminate - a contemporary journey of discovery and a compelling story from the past.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2003 | 30 Episodes Season 1 of Battlefield Detectives premiered on October 11, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Battlefield Detectives. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}