{"link": "https://www.themoviedb.org/tv/32437?language=en", "title": "Athena: Goddess of War", "resume": "Athena: Goddess of War is a South Korean espionage television drama series broadcast by SBS in 2010 and a spin-off of 2009's Iris. Budgeted at ₩20 billion like its predecessor, the two series are among the most expensive Korean dramas ever produced.\nStarring Jung Woo-sung, Cha Seung-won, Soo Ae, and Lee Ji-ah, the series premiered in December 2010 after filming in a number of overseas locations, including Italy, New Zealand, Japan, and the United States. The series is set in the same universe as its predecessor, allowing for select characters from Iris to reprise their roles throughout the story.", "rate": 53, "genre": ["Action", "Drama", "Romance", "Thriller"], "cast": ["Jung Woo-sung", "Cha Seung-won", "Soo-Ae", "Lee Ji-ah", "Choi Si-won"], "character": ["Lee Jung-woo", "Son Hyuk", "Yoon Hye-in", "Han Jae-hui", "Kim Jun-ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32437   Expand Athena: Goddess of War   (2010) User Score Overview Athena: Goddess of War is a South Korean espionage television drama series broadcast by SBS in 2010 and a spin-off of 2009's Iris. Budgeted at ₩20 billion like its predecessor, the two series are among the most expensive Korean dramas ever produced. Starring Jung Woo-sung, Cha Seung-won, Soo Ae, and Lee Ji-ah, the series premiered in December 2010 after filming in a number of overseas locations, including Italy, New Zealand, Japan, and the United States. The series is set in the same universe as its predecessor, allowing for select characters from Iris to reprise their roles throughout the story. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Woo-sung Lee Jung-woo Cha Seung-won Son Hyuk Soo-Ae Yoon Hye-in Lee Ji-ah Han Jae-hui Choi Si-won Kim Jun-ho Full Cast & Crew Last Season Season 1 2010 | 20 Episodes Season 1 of Athena: Goddess of War premiered on December 13, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Athena: Goddess of War. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Athena: Goddess of War. You can help by rating TV shows you've seen. Facts Original Name  아테나: 전쟁의 여신 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/athena/ Genres Action Drama Romance Thriller Keywords korea Content Score 86 Almost there... Top Contributors M 25 Maria180493 N 10 Nightowl.Kr 5 lareina123 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}