{"link": "https://www.themoviedb.org/tv/4616?language=en", "title": "Xena: Warrior Princess", "resume": "Xena: Warrior Princess is an American–New Zealand supernatural fantasy adventure series that aired in syndication from September 4, 1995 until June 18, 2001.\nThe series was created in 1995 by writer-director-producer Robert Tapert under his production tag, Renaissance Pictures with later executive producers being R. J. Stewart and Sam Raimi. The series narrative follows Xena, as an infamous warrior on a quest to seek redemption for her past sins against the innocent by using her formidable fighting skills to now, help those who are unable to defend themselves. Xena is accompanied by Gabrielle, who during the series changes from a simple farm girl into an Amazon warrior and Xena's comrade-in-arms; her initial naïveté helps to balance Xena and assists her in recognizing and pursuing the \"greater good\".\nThe show is a spin-off of the television series Hercules: The Legendary Journeys; the saga began with three episodes in Hercules where Xena was a recurring character originally scheduled to die in her third appearance. Aware that the character of Xena had been very successful among the public, the producers of the series decided to create a spin-off series based on her adventures. Xena was a successful show which has aired in more than 108 countries around the world since 1998. In 2004 and 2007, it was ranked #9 and #10 on TV Guide's Top Cult Shows Ever and the title character was ranked #100 on Bravo's 100 Greatest TV Characters. Xena's success has led to hundreds of tie-in products, including, comics, books, video games and conventions, realized annually since 1998 in Pasadena, California and London.", "rate": 67, "genre": ["Comedy", "Drama"], "cast": ["Lucy Lawless", "Renee O'Connor", "Ted Raimi", "Kevin Smith", "Karl Urban"], "character": ["Xena", "Gabrielle", "Joxer", "Ares", "Caesar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4616   Expand Xena: Warrior Princess   (1995) User Score Overview Xena: Warrior Princess is an American–New Zealand supernatural fantasy adventure series that aired in syndication from September 4, 1995 until June 18, 2001. The series was created in 1995 by writer-director-producer Robert Tapert under his production tag, Renaissance Pictures with later executive producers being R. J. Stewart and Sam Raimi. The series narrative follows Xena, as an infamous warrior on a quest to seek redemption for her past sins against the innocent by using her formidable fighting skills to now, help those who are unable to defend themselves. Xena is accompanied by Gabrielle, who during the series changes from a simple farm girl into an Amazon warrior and Xena's comrade-in-arms; her initial naïveté helps to balance Xena and assists her in recognizing and pursuing the \"greater good\". The show is a spin-off of the television series Hercules: The Legendary Journeys; the saga began with three episodes in Hercules where Xena was a recurring character originally scheduled to die in her third appearance. Aware that the character of Xena had been very successful among the public, the producers of the series decided to create a spin-off series based on her adventures. Xena was a successful show which has aired in more than 108 countries around the world since 1998. In 2004 and 2007, it was ranked #9 and #10 on TV Guide's Top Cult Shows Ever and the title character was ranked #100 on Bravo's 100 Greatest TV Characters. Xena's success has led to hundreds of tie-in products, including, comics, books, video games and conventions, realized annually since 1998 in Pasadena, California and London. Featured Crew Robert Tapert Creator John Schulian Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  4 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucy Lawless Xena Renee O'Connor Gabrielle Ted Raimi Joxer Kevin Smith Ares Karl Urban Caesar Full Cast & Crew Last Season Season 6 2000 | 22 Episodes View All Seasons Social Reviews  1 Discussions  9 C A review by CharlesTheBold Written by  CharlesTheBold  on February 22, 2017 XENA is a TV-series about a \"forgotten\" Greek hero, and was a companion series to HERCULES.  While Hercules is a straightforward hero who nearly always does the right thing, Xena is a former warlord who longs for redemption but still possesses some of the savage characteristics that caused her to ruin other people's lives.  An unusual choice for the hero of an adventure show; in fact her name is Greek for \"the strange woman\". The show was bizarre for its sheer lack of consistency.  For example, the afterlife: sometimes it was the Greek Hades, sometimes the Christian Heaven and Hell, sometime...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1995-01-29 Hercules: The Legendary Journeys 6.3    1998-10-07 Charmed 6.7    1993-09-12 Lois & Clark: The New Adventures of Superman 6.6    1985-09-29 MacGyver 7.3    1999-10-05 Angel 7.6    1982-09-26 Knight Rider 6.5    1989-04-23 Baywatch 5.0    1997-09-08 Ally McBeal 5.9  Facts Status  Ended Network Broadcast Syndication Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Comedy Drama Keywords strong woman anti hero mythology warrior woman sword fight tragic female protagonist heroine gods ares villain turns good psychotic villain sword and sorcery Content Score 93 Almost there... Top Contributors k 68 khedron 20 Banana 16 Apollo d 9 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}