{"link": "https://www.themoviedb.org/tv/46358?language=en", "title": "Franklin and Friends", "resume": "Franklin and Friends is a Canadian CGI children's television series produced by Nelvana. It is the second adaptation of the classic characters from the Franklin the Turtle series of children's books written by Paulette Bourgeois and illustrated by Brenda Clark, the first of which was Franklin, which was also produced by Nelvana. The new series was announced by Nelvana on September 28, 2010, and it debuted on Treehouse TV on March 4, 2011. The theme song itself is a revamped up to date version of the original series theme, \"Hey It's Franklin\". It premiered in the United States on Nickelodeon on February 13, 2012 and Nick Jr. on March 1, 2012. It also premiered in the Singapore on Mediacorp on February 15, 2012.", "rate": 100, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46358   Expand Franklin and Friends   (2012) User Score Overview Franklin and Friends is a Canadian CGI children's television series produced by Nelvana. It is the second adaptation of the classic characters from the Franklin the Turtle series of children's books written by Paulette Bourgeois and illustrated by Brenda Clark, the first of which was Franklin, which was also produced by Nelvana. The new series was announced by Nelvana on September 28, 2010, and it debuted on Treehouse TV on March 4, 2011. The theme song itself is a revamped up to date version of the original series theme, \"Hey It's Franklin\". It premiered in the United States on Nickelodeon on February 13, 2012 and Nick Jr. on March 1, 2012. It also premiered in the Singapore on Mediacorp on February 15, 2012. Featured Crew Paulette Bourgeois Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2011 | 52 Episodes Season 1 of Franklin and Friends premiered on February 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Franklin and Friends. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://franklin.treehousetv.com Genres Animation Keywords turtle animation friends 3d Content Score 64 We're so close, yet so far. Top Contributors 29 Maikkoum f 2 finalomen 1 pizzavomito 1 tkozyrski  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}