{"link": "https://www.themoviedb.org/tv/45571?language=en", "title": "The Story of Film: An Odyssey", "resume": "The Story of Film: An Odyssey is a documentary series about the history of film, presented on television in 15 one-hour chapters with a total length of over 900 minutes. It was directed and narrated by Mark Cousins, a film critic from Northern Ireland, based on his 2004 book The Story of Film.\nThe series was broadcast in September 2011 on More4, the digital television service of UK broadcaster Channel 4. The Story of Film was also featured in its entirety at the 2011 Toronto International Film Festival, and it was exhibited at the Museum of Modern Art in New York City in February 2012. It was broadcast in the United States on Turner Classic Movies beginning in September 2013.\nThe Telegraph headlined the series' initial broadcast in September 2011 as the \"cinematic event of the year\", describing it as \"visually ensnaring and intellectually lithe, it’s at once a love letter to cinema, an unmissable masterclass, and a radical rewriting of movie history.\" An Irish Times writer called the program a \"landmark\".\nIn February 2012, A. O. Scott of The New York Times contrasted the project with its \"important precursor\", Jean-Luc Godard’s Histoire du cinéma. In contrast to the Godard project, which Scott called \"personal, polemical and sometimes cryptic\", Scott described Cousins' film as \"a semester-long film studies survey course compressed into 15 brisk, sometimes contentious hours\" that \"stands as an invigorated compendium of conventional wisdom.\" He also commended its \"refusal to be nostalgic\".", "rate": 84, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45571   Expand The Story of Film: An Odyssey   (2011) User Score Overview The Story of Film: An Odyssey is a documentary series about the history of film, presented on television in 15 one-hour chapters with a total length of over 900 minutes. It was directed and narrated by Mark Cousins, a film critic from Northern Ireland, based on his 2004 book The Story of Film. The series was broadcast in September 2011 on More4, the digital television service of UK broadcaster Channel 4. The Story of Film was also featured in its entirety at the 2011 Toronto International Film Festival, and it was exhibited at the Museum of Modern Art in New York City in February 2012. It was broadcast in the United States on Turner Classic Movies beginning in September 2013. The Telegraph headlined the series' initial broadcast in September 2011 as the \"cinematic event of the year\", describing it as \"visually ensnaring and intellectually lithe, it’s at once a love letter to cinema, an unmissable masterclass, and a radical rewriting of movie history.\" An Irish Times writer called the program a \"landmark\". In February 2012, A. O. Scott of The New York Times contrasted the project with its \"important precursor\", Jean-Luc Godard’s Histoire du cinéma. In contrast to the Godard project, which Scott called \"personal, polemical and sometimes cryptic\", Scott described Cousins' film as \"a semester-long film studies survey course compressed into 15 brisk, sometimes contentious hours\" that \"stands as an invigorated compendium of conventional wisdom.\" He also commended its \"refusal to be nostalgic\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries 2011 | 15 Episodes Season 1 of The Story of Film: An Odyssey premiered on September  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1999-06-20 Haywire 5.4    Making 'The Shining' 7.2    2010-11-01 The Trip 8.0    1973-04-11 Scenes from a Marriage 8.0    2010-02-19 The Ricky Gervais Show 7.9    1994-01-26 The Critic 7.7    2010-04-11 Treme 8.1    2004-05-18 The Mighty Boosh 7.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/the-story-of-film-an-odyssey Genres Documentary Keywords miniseries history of film Content Score 56 We're so close, yet so far. Top Contributors R 10 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}