{"link": "https://www.themoviedb.org/tv/34003?language=en", "title": "Whites", "resume": "Whites was a BBC sitcom, written by Oliver Lansley and Matt King, directed by David Kerr, and starring Alan Davies as the executive chef at a country house hotel. BBC Two gave the go ahead for the show to go into production in August 2009 with the first episode airing in September 2010. Whites aired for six episodes in 2010. On 1 March 2011 Davies announced that the BBC would not be renewing Whites for another series.", "rate": 67, "genre": ["Comedy"], "cast": ["Katherine Parkinson", "Alan Davies", "Maggie Steed", "Stephen Wight", "Darren Boyd"], "character": ["Caroline"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34003   Expand Whites   (2010) User Score  Play Trailer Overview Whites was a BBC sitcom, written by Oliver Lansley and Matt King, directed by David Kerr, and starring Alan Davies as the executive chef at a country house hotel. BBC Two gave the go ahead for the show to go into production in August 2009 with the first episode airing in September 2010. Whites aired for six episodes in 2010. On 1 March 2011 Davies announced that the BBC would not be renewing Whites for another series. Featured Crew Matt King Creator Oliver Lansley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katherine Parkinson Caroline Alan Davies Maggie Steed Stephen Wight Darren Boyd Full Cast & Crew Last Season Season 1 2010 | 6 Episodes Season 1 of Whites premiered on September 28, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2006-01-01 In Justice 6.8    2016-06-08 Power Monkeys 7.0    2011-01-13 Kidnap and Ransom 7.6    2011-06-06 Injustice 7.3    2016-08-02 Borderline 7.1    2012-08-30 Good Cop 6.6    2012-02-20 The Bleak Old Shop of Stuff 6.7    2013-03-25 Plebs 7.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sitcom british humour Content Score 100 Yes! Looking good! Top Contributors I 6 Ingwar O 4 Ozbourne R 3 Rebecca s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}