{"link": "https://www.themoviedb.org/tv/51866?language=en", "title": "The Goddess of Fire", "resume": "Goddess of Fire is a 2013 South Korean television series starring Moon Geun-young, Lee Sang-yoon, Kim Bum, Park Gun-hyung, Seo Hyun-jin, Jun Kwang-ryul, Jeong Bo-seok, Byun Hee-bong, Han Go-eun, and Lee Kwang-soo. It airs on MBC on Mondays and Tuesdays at 21:55 for 32 episodes beginning July 1, 2013.\nThe historical drama depicts the life and love of Yoo Jung, who is based on real-life 16th century historical figure Baek Pa-sun, renowned as the first female potter and porcelain artist in the Joseon Dynasty.\nBaek's glazing skills were so prized, she was appointed as a china maker for the royal family. But her fame also attracted the attention of foreign invaders, and during the Japanese invasion in 1592, she was among the Korean artisans captured and forcibly taken to Japan and made to continue their craft there. Under Toyotomi Hideyoshi's orders to enrich Japanese arts and culture, Baek helped the advancement of many new types of pottery that would be claimed as Japanese works of art. She became well-respected in Japan, and there exists a shrine in the city of Arita dedicated to her.", "rate": 75, "genre": ["Drama"], "cast": ["Kim Bum", "Moon Geun-Young", "Jin Ji-hee", "Lee Sang-yoon", "Noh Young-hak"], "character": ["Kim Tae-do", "Yoo Jung", "Yoo Jung (young)", "Prince Gwanghae", "Prince Gwanghae (young)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51866   Expand The Goddess of Fire   (2013) User Score Overview Goddess of Fire is a 2013 South Korean television series starring Moon Geun-young, Lee Sang-yoon, Kim Bum, Park Gun-hyung, Seo Hyun-jin, Jun Kwang-ryul, Jeong Bo-seok, Byun Hee-bong, Han Go-eun, and Lee Kwang-soo. It airs on MBC on Mondays and Tuesdays at 21:55 for 32 episodes beginning July 1, 2013. The historical drama depicts the life and love of Yoo Jung, who is based on real-life 16th century historical figure Baek Pa-sun, renowned as the first female potter and porcelain artist in the Joseon Dynasty. Baek's glazing skills were so prized, she was appointed as a china maker for the royal family. But her fame also attracted the attention of foreign invaders, and during the Japanese invasion in 1592, she was among the Korean artisans captured and forcibly taken to Japan and made to continue their craft there. Under Toyotomi Hideyoshi's orders to enrich Japanese arts and culture, Baek helped the advancement of many new types of pottery that would be claimed as Japanese works of art. She became well-respected in Japan, and there exists a shrine in the city of Arita dedicated to her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Bum Kim Tae-do Moon Geun-Young Yoo Jung Jin Ji-hee Yoo Jung (young) Lee Sang-yoon Prince Gwanghae Noh Young-hak Prince Gwanghae (young) Full Cast & Crew Last Season Season 1 2013 | 32 Episodes Season 1 of The Goddess of Fire premiered on July  1, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Goddess of Fire. You can help by rating TV shows you've seen. Facts Original Name  불의 여신 정이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/firejung/ Genres Drama Keywords korea Content Score 86 Almost there... Top Contributors M 35 Maria180493 N 28 Nightowl.Kr 19 Elizabeth Jennings t 8 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}