{"link": "https://www.themoviedb.org/tv/42094?language=en", "title": "The Hillbilly Bears", "resume": "The Hillbilly Bears is an animated television series produced by Hanna-Barbera Productions. It aired as a segment on The Atom Ant/Secret Squirrel Show for two seasons, from 1965 to 1967. During the first half of the 1966-67 television season, The Atom Ant/Secret Squirrel Show was split into two shows, and The Hillbilly Bears aired as part of The Atom Ant Show. The characters in the series were a family of four funny animal bears: Paw and Maw Rugg, their teenage daughter Floral, and their young son Shag.", "rate": 90, "genre": ["Animation"], "cast": ["Don Messick", "Henry Corden", "Jean Vander Pyl"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42094   Expand The Hillbilly Bears   (1967) User Score Overview The Hillbilly Bears is an animated television series produced by Hanna-Barbera Productions. It aired as a segment on The Atom Ant/Secret Squirrel Show for two seasons, from 1965 to 1967. During the first half of the 1966-67 television season, The Atom Ant/Secret Squirrel Show was split into two shows, and The Hillbilly Bears aired as part of The Atom Ant Show. The characters in the series were a family of four funny animal bears: Paw and Maw Rugg, their teenage daughter Floral, and their young son Shag. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Messick Henry Corden Jean Vander Pyl Full Cast & Crew Last Season Season 1 1967 | 20 Episodes Season 1 of The Hillbilly Bears premiered on September  7, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Hillbilly Bears. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  English Runtime  7m Homepage  - Genres Animation Keywords cartoon bear Content Score 64 We're so close, yet so far. Top Contributors 14 Robson Guedes Vieira 5 Banana 3 minhus 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}