{"link": "https://www.themoviedb.org/tv/72465?language=en", "title": "Great Yellowstone Thaw", "resume": "Journey with Kirk Johnson to Yellowstone, where wolves, grizzlies, beavers and Great Gray owls survive one of the greatest seasonal changes on the planet. As the temperature swings 140 degrees, cameras capture how the animals cope.", "rate": 48, "genre": ["Documentary"], "cast": ["Kirk Johnson"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72465   Expand Great Yellowstone Thaw   (2017) User Score Overview Journey with Kirk Johnson to Yellowstone, where wolves, grizzlies, beavers and Great Gray owls survive one of the greatest seasonal changes on the planet. As the temperature swings 140 degrees, cameras capture how the animals cope. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirk Johnson Himself - Presenter Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Great Yellowstone Thaw premiered on June 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Great Yellowstone Thaw. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Documentary Original Language  English Runtime  60m Homepage   http://www.pbs.org/show/great-yellowstone-thaw/ Genres Documentary Keywords yellowstone nature documentary Content Score 56 We're so close, yet so far. Top Contributors 43 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}