{"link": "https://www.themoviedb.org/tv/805?language=en", "title": "Maid Marian and Her Merry Men", "resume": "Maid Marian and her Merry Men is a British children's sitcom created and written by Tony Robinson and directed by David Bell. It began in 1989 on BBC One and ran for four series, with the last episode shown in 1994. The show was a partially musical comic retelling of the legend of Robin Hood, placing Maid Marian in the role of leader of the Merry Men, and reducing Robin to an incompetent ex-tailor.\nThe programme was much appreciated by children and adults alike, and has been likened to Blackadder, not only for its historical setting and the presence of Tony Robinson, but also for its comic style. It is more surreal than Blackadder, however, and drops even more anachronisms. Many of the show's cast such as Howard Lew Lewis, Forbes Collins, Ramsay Gilderdale and Patsy Byrne had previously appeared in various episodes of Blackadder alongside Robinson. Like many British children's programmes, there is a lot of social commentary sneakily inserted, as well as witty asides about the Royal family, buses running on time, etc. Many of the plots spoofed or referenced film and television shows including other incarnations of Robin Hood in those mediums.", "rate": 73, "genre": ["Comedy"], "cast": ["Kate Lonergan", "Tony Robinson", "Adam Morris", "Howard Lew Lewis", "Danny John-Jules"], "character": ["Maid Marian", "The Sheriff of Nottingham", "Robin Hood (as Wayne Morris)", "Rabies", "Barrington"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 805   Expand Maid Marian and Her Merry Men   (1989) User Score Overview Maid Marian and her Merry Men is a British children's sitcom created and written by Tony Robinson and directed by David Bell. It began in 1989 on BBC One and ran for four series, with the last episode shown in 1994. The show was a partially musical comic retelling of the legend of Robin Hood, placing Maid Marian in the role of leader of the Merry Men, and reducing Robin to an incompetent ex-tailor. The programme was much appreciated by children and adults alike, and has been likened to Blackadder, not only for its historical setting and the presence of Tony Robinson, but also for its comic style. It is more surreal than Blackadder, however, and drops even more anachronisms. Many of the show's cast such as Howard Lew Lewis, Forbes Collins, Ramsay Gilderdale and Patsy Byrne had previously appeared in various episodes of Blackadder alongside Robinson. Like many British children's programmes, there is a lot of social commentary sneakily inserted, as well as witty asides about the Royal family, buses running on time, etc. Many of the plots spoofed or referenced film and television shows including other incarnations of Robin Hood in those mediums. Featured Crew Tony Robinson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Lonergan Maid Marian Tony Robinson The Sheriff of Nottingham Adam Morris Robin Hood (as Wayne Morris) Howard Lew Lewis Rabies Danny John-Jules Barrington Full Cast & Crew Last Season Season 4 1994 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1986-01-14 Boon 4.8    1976-09-06 George and Mildred 6.6    1986-10-06 The Trap Door 7.3    1995-02-27 Game On 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Comedy Keywords legend surreal parody sitcom british humour period sitcom myth Content Score 93 Almost there... Top Contributors 21 Markxist 11 Murnau O 7 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}