{"link": "https://www.themoviedb.org/tv/15425?language=en", "title": "Dirty Dancing", "resume": "Dirty Dancing is a 1988 television series on the CBS network. It is based on the film Dirty Dancing but had none of the original cast or staff. It stars Patrick Cassidy as Johnny and Melora Hardin as Baby. The show only lasted half a season, before it was canceled in January 1989 due to low ratings.", "rate": 0, "genre": ["Drama"], "cast": ["Melora Hardin", "Patrick Cassidy", "McLean Stevenson", "Paul Feig", "Constance Marie"], "character": ["Frances 'Baby' Kellerman", "Penny Rivera"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15425   Expand Dirty Dancing   (1988) User Score Overview Dirty Dancing is a 1988 television series on the CBS network. It is based on the film Dirty Dancing but had none of the original cast or staff. It stars Patrick Cassidy as Johnny and Melora Hardin as Baby. The show only lasted half a season, before it was canceled in January 1989 due to low ratings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melora Hardin Frances 'Baby' Kellerman Patrick Cassidy McLean Stevenson Paul Feig Constance Marie Penny Rivera Full Cast & Crew Last Season Season 1 1988 | 11 Episodes Season 1 of Dirty Dancing premiered on October 29, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dirty Dancing. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords hotel dancing resort hotel dance instructor 1960s Content Score 71 Just a little bit more... Top Contributors 9 Banana i 5 ismago CM 4 Cherche Moi z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}