{"link": "https://www.themoviedb.org/tv/688?language=en", "title": "The West Wing", "resume": "The West Wing provides a glimpse into presidential politics in the nation's capital as it tells the stories of the members of a fictional presidential administration. These interesting characters have humor and dedication that touches the heart while the politics that they discuss touch on everyday life.", "rate": 81, "genre": ["Drama"], "cast": ["Martin Sheen", "Allison Janney", "Richard Schiff", "John Spencer", "Bradley Whitford"], "character": ["President Josiah Bartlet", "C.J. Cregg", "Toby Ziegler", "Leo McGarry", "Josh Lyman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 688   Expand The West Wing   (1999) User Score  Play Trailer Overview The West Wing provides a glimpse into presidential politics in the nation's capital as it tells the stories of the members of a fictional presidential administration. These interesting characters have humor and dedication that touches the heart while the politics that they discuss touch on everyday life. Featured Crew Aaron Sorkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  15 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Sheen President Josiah Bartlet Allison Janney C.J. Cregg Richard Schiff Toby Ziegler John Spencer Leo McGarry Bradley Whitford Josh Lyman Full Cast & Crew Last Season Season 7 2005 | 22 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w C.J. Cregg: Happy Birthday Allison Janney! Open 0 by wonder2wonder\n      \n     w President Josiah Bartlet: Happy Birthday Martin Sheen! Open 0 by wonder2wonder\n      \n     The West Wing Open 5 by  AusFem Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  8 Recommendations   2012-06-24 The Newsroom 7.8    2004-10-03 Boston Legal 7.6    2006-10-11 30 Rock 7.1    2005-10-17 The Colbert Report 7.0    2006-09-18 Studio 60 on the Sunset Strip 7.4    1990-09-13 Law & Order 7.2    2004-07-18 Entourage 7.1    2007-06-28 Burn Notice 7.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.nbc.com/The_West_Wing/ Genres Drama Keywords usa president politics usa politics Content Score 100 Yes! Looking good! Top Contributors 112 dbowman 40 colonelgrant 18 rantamplan 17 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}