{"link": "https://www.themoviedb.org/tv/7404?language=en", "title": "The Mole", "resume": "The Mole is an American reality game show that aired on ABC. It was based on other versions of The Mole that have aired in numerous countries. The Mole was produced by Stone Stanley Entertainment for its first four seasons. It was cancelled but was later picked up again after a four year hiatus. The fifth season was produced by Stone & Co. Entertainment.\nThe series is a reality competition in which the contestants work as a group to add money to a pot that only one of them will eventually win. Among the contestants is one person who has been designated \"the Mole\" by the producers and is tasked with sabotaging the group's money-making efforts. At the end of each episode, the contestant who knows the least about the mole, as decided by the results of a quiz, is eliminated from the game.\nThe series was first hosted by news reporter Anderson Cooper; for the third season, Ahmad Rashād replaced Cooper, and Rashād was in turn replaced by Jon Kelley for the fifth season. The third and fourth seasons featured celebrity contestants instead of average citizens. The series' logo is a bright green thumbprint.", "rate": 67, "genre": [], "cast": ["Jon Kelley", "Anderson Cooper", "Erik von Detten", "Frederique van der Wal", "Kim Coles"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7404   Expand The Mole   (2001) User Score Overview The Mole is an American reality game show that aired on ABC. It was based on other versions of The Mole that have aired in numerous countries. The Mole was produced by Stone Stanley Entertainment for its first four seasons. It was cancelled but was later picked up again after a four year hiatus. The fifth season was produced by Stone & Co. Entertainment. The series is a reality competition in which the contestants work as a group to add money to a pot that only one of them will eventually win. Among the contestants is one person who has been designated \"the Mole\" by the producers and is tasked with sabotaging the group's money-making efforts. At the end of each episode, the contestant who knows the least about the mole, as decided by the results of a quiz, is eliminated from the game. The series was first hosted by news reporter Anderson Cooper; for the third season, Ahmad Rashād replaced Cooper, and Rashād was in turn replaced by Jon Kelley for the fifth season. The third and fourth seasons featured celebrity contestants instead of average citizens. The series' logo is a bright green thumbprint. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Kelley Anderson Cooper Erik von Detten Frederique van der Wal Kim Coles Full Cast & Crew Last Season Season 5 2008 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Mole. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.woestijnvis.be/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 6 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}