{"link": "https://www.themoviedb.org/tv/4229?language=en", "title": "Dexter's Laboratory", "resume": "Dexter's Laboratory is an American comic science fiction animated children's television series created by Genndy Tartakovsky for Cartoon Network. The series follows Dexter, a boy-genius with a secret laboratory filled with his collection of inventions. He constantly battles his sister Dee Dee, who always gains access despite his best efforts to keep her out, as well as his arch-rival and neighbor, Mandark. The series' first two seasons contain additional segments: Dial M for Monkey, which focuses on Dexter's pet lab monkey-turned-superhero, and The Justice Friends, about a trio of superheroes who share an apartment.\nTartakovsky first pitched the series to Hanna-Barbera's animated shorts showcase World Premiere Toons, basing it on student films he produced while attending the California Institute of the Arts. Four shorts were created and broadcast on Cartoon Network in 1995 and 1996 before viewer approval ratings convinced the network to order a 13-episode first season, which premiered on April 28, 1996. By 1999, 52 episodes and a television movie had been produced, and Tartakovsky then left the series to begin work on his other projects, Samurai Jack and Star Wars: Clone Wars. In 2001, the network revived the series under a different production team at Cartoon Network Studios, and after 26 more episodes, the series ended on November 20, 2003.", "rate": 75, "genre": ["Animation", "Comedy", "Family", "Sci-Fi", "Fantasy"], "cast": ["Christine Cavanaugh", "Allison Moore", "Kath Soucie", "Jeff Bennett", "Frank Welker"], "character": ["Dexter", "Dee Dee", "Mom", "Dad", "Monkey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4229   Expand Dexter's Laboratory   (1996) User Score Overview Dexter's Laboratory is an American comic science fiction animated children's television series created by Genndy Tartakovsky for Cartoon Network. The series follows Dexter, a boy-genius with a secret laboratory filled with his collection of inventions. He constantly battles his sister Dee Dee, who always gains access despite his best efforts to keep her out, as well as his arch-rival and neighbor, Mandark. The series' first two seasons contain additional segments: Dial M for Monkey, which focuses on Dexter's pet lab monkey-turned-superhero, and The Justice Friends, about a trio of superheroes who share an apartment. Tartakovsky first pitched the series to Hanna-Barbera's animated shorts showcase World Premiere Toons, basing it on student films he produced while attending the California Institute of the Arts. Four shorts were created and broadcast on Cartoon Network in 1995 and 1996 before viewer approval ratings convinced the network to order a 13-episode first season, which premiered on April 28, 1996. By 1999, 52 episodes and a television movie had been produced, and Tartakovsky then left the series to begin work on his other projects, Samurai Jack and Star Wars: Clone Wars. In 2001, the network revived the series under a different production team at Cartoon Network Studios, and after 26 more episodes, the series ended on November 20, 2003. Featured Crew Genndy Tartakovsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  28 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Christine Cavanaugh Dexter Allison Moore Dee Dee Kath Soucie Mom Jeff Bennett Dad Frank Welker Monkey Full Cast & Crew Last Season Season 4 2002 | 38 Episodes Season 4 of Dexter's Laboratory premiered on November 22, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   1998-11-18 The Powerpuff Girls 7.0    1999-11-12 Courage the Cowardly Dog 7.6    1997-07-07 Johnny Bravo 6.6    1997-09-16 Cow and Chicken 6.4    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    1999-01-04 Ed, Edd n Eddy 7.0    1991-08-11 Rugrats 7.1    1996-10-07 Hey Arnold! 6.8  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cartoonnetwork.com/tv_shows/dexter/ Genres Animation Comedy Family Sci-Fi & Fantasy Keywords villain house robot scientist family boy genius science Content Score 100 Yes! Looking good! Top Contributors 16 david8s95 15 Banana 15 d00ziie m 7 mode2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}