{"link": "https://www.themoviedb.org/tv/4704?language=en", "title": "Harry & Paul", "resume": "Harry & Paul is a BAFTA Award-winning British sketch comedy show starring Harry Enfield and Paul Whitehouse. It was first broadcast on BBC One on 13 April 2007. Prior to broadcast it was trailed as The Harry Enfield Show.\nThe show reunites the pair, who had success with Harry Enfield's Television Programme in the 1990s.\nThe second series of the programme began on BBC One on 5 September 2008. This was the last series from the comedy producer Geoffrey Perkins who died shortly before the programme's second series began. A third series was commissioned and began 28 September 2010 this time on BBC Two to where the show has been moved, because of falling ratings. The fourth series began broadcasting in October 2012.", "rate": 65, "genre": ["Comedy"], "cast": ["Paul Whitehouse", "Morwenna Banks", "Sophie Winkleman", "Simon Day", "Catherine Shepherd"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4704   Expand Harry & Paul   (2005) User Score Overview Harry & Paul is a BAFTA Award-winning British sketch comedy show starring Harry Enfield and Paul Whitehouse. It was first broadcast on BBC One on 13 April 2007. Prior to broadcast it was trailed as The Harry Enfield Show. The show reunites the pair, who had success with Harry Enfield's Television Programme in the 1990s. The second series of the programme began on BBC One on 5 September 2008. This was the last series from the comedy producer Geoffrey Perkins who died shortly before the programme's second series began. A third series was commissioned and began 28 September 2010 this time on BBC Two to where the show has been moved, because of falling ratings. The fourth series began broadcasting in October 2012. Featured Crew Paul Whitehouse Creator Harry Enfield Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Whitehouse Morwenna Banks Sophie Winkleman Simon Day Catherine Shepherd Full Cast & Crew Last Season Season 4 2012 | 6 Episodes Season 4 of Harry & Paul premiered on October 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Harry & Paul. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sketch comedy british humour Content Score 93 Almost there... Top Contributors 20 Banana 3 kcdh O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}