{"link": "https://www.themoviedb.org/tv/45277?language=en", "title": "Nakaimo: My Little Sister Is Among Them!", "resume": "Is insanity hereditary? Shougo Mikadono's beginning to think so, because the terms of his late father's will seem crazy and following them may drive Shougo bonkers as well. Oh, it sounds simple at first: before Shougo can claim his VERY large inheritance, he just has to start attending a certain new school and find a nice girl to marry.\nIt's a little unromantic, but perfectly do-able, right? After all, all the girls seem quite friendly, so all Shougo has to do is find one he has something in common with. Except, and here's the kicker, it turns out that Shougo has WAY too much in common with one of them, because she's actually his long-lost sister! And he has no idea which one she is!\nWill Shougo meet and court his Miss Right without committing something very morally wrong? Can he find his future bride without slipping into the wrong set of genes? And if his little sister does reveal herself, just how much will be revealed and under what circumstances?", "rate": 85, "genre": ["Drama", "Animation", "Comedy", "Romance"], "cast": ["Brittney Karbowski", "Clint Bickham", "Emily Neves", "Maggie Flecknoe", "Megan McDonald"], "character": ["Miyabi Kannagi (English Dub)", "Shogo Mikadono (English Dub)", "Mana Tendo (English Dub)", "Rinka Kunitachi (English Dub)", "Mei Sagara (English Dub)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45277   Expand Nakaimo: My Little Sister Is Among Them!   (2012) User Score Overview Is insanity hereditary? Shougo Mikadono's beginning to think so, because the terms of his late father's will seem crazy and following them may drive Shougo bonkers as well. Oh, it sounds simple at first: before Shougo can claim his VERY large inheritance, he just has to start attending a certain new school and find a nice girl to marry. It's a little unromantic, but perfectly do-able, right? After all, all the girls seem quite friendly, so all Shougo has to do is find one he has something in common with. Except, and here's the kicker, it turns out that Shougo has WAY too much in common with one of them, because she's actually his long-lost sister! And he has no idea which one she is! Will Shougo meet and court his Miss Right without committing something very morally wrong? Can he find his future bride without slipping into the wrong set of genes? And if his little sister does reveal herself, just how much will be revealed and under what circumstances? Featured Crew Hajime Taguchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brittney Karbowski Miyabi Kannagi (English Dub) Clint Bickham Shogo Mikadono (English Dub) Emily Neves Mana Tendo (English Dub) Maggie Flecknoe Rinka Kunitachi (English Dub) Megan McDonald Mei Sagara (English Dub) Full Cast & Crew Last Season Season 1 2012 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2011-01-08 Freezing 7.4    2016-07-07 Planetarian: The Reverie of a Little Planet 6.5    2010-01-07 Dance in the Vampire Bund 7.0    2011-10-08 Ben-To 7.2    2010-01-07 Baka and Test: Summon the Beasts 6.4    2010-04-02 Yamada's First Time: B Gata H Kei 7.5    2002-04-02 Chobits 6.9    2012-10-04 Love, Chunibyo & Other Delusions 7.6  Facts Original Name  この中に１人、妹がいる！ Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.sentaifilmworks.com/shows/nakaimo-my-little-sister-is-among-them Genres Drama Animation Comedy Romance Keywords nudity romance school anime Content Score 93 Almost there... Top Contributors 33 WillofOwn 11 CrewMdk e 5 elibiva 5 July  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}