{"link": "https://www.themoviedb.org/tv/9152?language=en", "title": "Steel Jeeg", "resume": "Steel Jeeg, more commonly known as Kotetsu Jeeg or Koutetsu Jeeg, is a super robot anime and manga series created by manga artists Go Nagai and Tatsuya Yasuda. The anime TV series was produced by Toei Doga. It was first broadcast on Japanese TV in 1975. The series lasted for 46 episodes. Steel Jeeg also ran as a manga in several children's publications.\nA sequel series called Kotetsushin Jeeg aired on the satellite network WOWOW, beginning April 5, 2007.", "rate": 80, "genre": ["Animation"], "cast": ["Tōru Furuya", "Rihoko Yoshida", "Isamu Tanonaka", "Kazue Takahashi", "Kenichi Ogata"], "character": ["Hiroshi Shiba", "Miwa Uzuki", "Ootone", "Queen Jou Himika", "Ikia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9152   Expand Steel Jeeg   (1975) User Score Overview Steel Jeeg, more commonly known as Kotetsu Jeeg or Koutetsu Jeeg, is a super robot anime and manga series created by manga artists Go Nagai and Tatsuya Yasuda. The anime TV series was produced by Toei Doga. It was first broadcast on Japanese TV in 1975. The series lasted for 46 episodes. Steel Jeeg also ran as a manga in several children's publications. A sequel series called Kotetsushin Jeeg aired on the satellite network WOWOW, beginning April 5, 2007. Featured Crew Gou Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tōru Furuya Hiroshi Shiba Rihoko Yoshida Miwa Uzuki Isamu Tanonaka Ootone Kazue Takahashi Queen Jou Himika Kenichi Ogata Ikia Full Cast & Crew Last Season SteelJeeg - Season 1 1975 | 13 Episodes Season 1 of Steel Jeeg premiered on October  5, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Steel Jeeg. You can help by rating TV shows you've seen. Facts Original Name  鋼鉄ジーグ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 24 tmdb983464 P 6 PieroMartini M 2 Migi 2 Mike Whitcombe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}