{"link": "https://www.themoviedb.org/tv/21674?language=en", "title": "Buzzer Beat", "resume": "Buzzer Beat is a Fuji TV Japanese television drama, which stars Yamashita Tomohisa, Keiko Kitagawa, and Aibu Saki.\nThe series primarily focuses on two characters, Naoki Kamiya, a professional basketball player, and Riko Shirakawa, an aspiring violinist. Over the course of the series Naoki faces difficulties trying to succeed in the world of basketball, and Riko struggles to become a successful violinist. Eventually the two meet and the series chronicles their relationship and struggles, as well as those of their friends.", "rate": 82, "genre": ["Drama", "Romance"], "cast": ["Tomohisa Yamashita", "Keiko Kitagawa", "Junpei Mizobata", "Saki Aibu", "Miki Maya"], "character": ["Kamiya Naoki", "Shirakawa Riko", "Hatano Shuji", "Natsuki Nanami", "Makiko Kamiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21674   Expand Buzzer Beat   (2009) User Score Overview Buzzer Beat is a Fuji TV Japanese television drama, which stars Yamashita Tomohisa, Keiko Kitagawa, and Aibu Saki. The series primarily focuses on two characters, Naoki Kamiya, a professional basketball player, and Riko Shirakawa, an aspiring violinist. Over the course of the series Naoki faces difficulties trying to succeed in the world of basketball, and Riko struggles to become a successful violinist. Eventually the two meet and the series chronicles their relationship and struggles, as well as those of their friends. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomohisa Yamashita Kamiya Naoki Keiko Kitagawa Shirakawa Riko Junpei Mizobata Hatano Shuji Saki Aibu Natsuki Nanami Miki Maya Makiko Kamiya Full Cast & Crew Last Season Season 1 2009 | 11 Episodes Season 1 of Buzzer Beat premiered on July 13, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2008-04-15 Absolute Boyfriend 8.0    2015-11-16 Oh My Venus 7.8    2016-11-16 Weightlifting Fairy Kim Bok-Joo 8.9  Facts Original Name  ブザー・ビート〜崖っぷちのヒーロー〜 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.fujitv.co.jp/buzzerbeat/index.html Genres Drama Romance Keywords japan sport Content Score 86 Almost there... Top Contributors A 18 Aka75 t 14 tmdb38202327 NS 3 Norte Serra 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}