{"link": "https://www.themoviedb.org/tv/1695?language=en", "title": "Monk", "resume": "Adrian Monk was once a rising star with the San Francisco Police Department, legendary for using unconventional means to solve the department's most baffling cases. But after the tragic (and still unsolved) murder of his wife Trudy, he developed an extreme case of obsessive-compulsive disorder. Now working as a private consultant, Monk continues to investigate cases in the most unconventional ways.", "rate": 77, "genre": ["Drama", "Mystery", "Crime", "Comedy"], "cast": ["Tony Shalhoub", "Traylor Howard", "Ted Levine", "Jason Gray-Stanford", "Emmy Clarke"], "character": ["Adrian Monk", "Natalie Teeger", "Leland Stottlemeyer", "Randy Disher", "Julie Teeger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1695   Expand Monk   (2002) User Score  Play Trailer Overview Adrian Monk was once a rising star with the San Francisco Police Department, legendary for using unconventional means to solve the department's most baffling cases. But after the tragic (and still unsolved) murder of his wife Trudy, he developed an extreme case of obsessive-compulsive disorder. Now working as a private consultant, Monk continues to investigate cases in the most unconventional ways. Featured Crew Andy Breckman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  2 Images Backdrops  26 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Shalhoub Adrian Monk Traylor Howard Natalie Teeger Ted Levine Leland Stottlemeyer Jason Gray-Stanford Randy Disher Emmy Clarke Julie Teeger Full Cast & Crew Last Season Season 8 2009 | 16 Episodes View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Sharona AND Natalie Open 5 by  VanillaLimeCoke Monk drinking game Open 0 by VanillaLimeCoke\n      \n     t Monk on Amazon Prime. Open 0 by tmdb23156637\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  26 Posters  7 Recommendations   2006-07-07 Psych 7.6    2000-10-06 CSI: Crime Scene Investigation 6.7    1996-09-17 Spin City 7.0    2005-09-20 My Name Is Earl 7.2    1990-09-13 Law & Order 7.2    2002-09-23 CSI: Miami 5.8    1971-09-15 Columbo 7.8    1987-04-05 Married... with Children 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.usanetwork.com/series/monk Genres Drama Mystery Crime Comedy Keywords san francisco private investigator obsessive compulsive disorder private detective mental disorders criminal consultant Content Score 100 Yes! Looking good! Top Contributors 23 Banana 16 Elizabeth Jennings 12 DarkMan m 11 mode2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}