{"link": "https://www.themoviedb.org/tv/9302?language=en", "title": "Digimon Tamers", "resume": "Digimon Tamers, known outside of Japan as the third season of Digimon: Digital Monsters, is the third television anime series produced by Toei Animation based on the Japanese Digimon franchise. Unlike the previous seasons, Digimon Adventure and Digimon Adventure 02, Tamers takes place in a different universe, mostly taking place in the real world and revolving heavily around the collectible card game based on the series. This series is also known for its darker undertones in story plots, taking darker routes than in previous series', but in the English dub, like the previous series, this feature more jokes and added dialogue than the Japanese version. Tamers aired in Japan between April 1, 2001 and March 31, 2002, whilst an English-language version by Saban Entertainment aired in North America between September 1, 2001 to June 8, 2002. A manga adaptation by Yuen Wong Yu ran between April and October 2004. It was succeeded by Digimon Frontier.", "rate": 66, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9302   Expand Digimon Tamers   (2002) User Score Overview Digimon Tamers, known outside of Japan as the third season of Digimon: Digital Monsters, is the third television anime series produced by Toei Animation based on the Japanese Digimon franchise. Unlike the previous seasons, Digimon Adventure and Digimon Adventure 02, Tamers takes place in a different universe, mostly taking place in the real world and revolving heavily around the collectible card game based on the series. This series is also known for its darker undertones in story plots, taking darker routes than in previous series', but in the English dub, like the previous series, this feature more jokes and added dialogue than the Japanese version. Tamers aired in Japan between April 1, 2001 and March 31, 2002, whilst an English-language version by Saban Entertainment aired in North America between September 1, 2001 to June 8, 2002. A manga adaptation by Yuen Wong Yu ran between April and October 2004. It was succeeded by Digimon Frontier. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2002 | 51 Episodes Season 1 of Digimon Tamers premiered on March  1, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   Digimon Adventure 02 5.6    Digimon Frontier 6.3    2004-07-10 DearS 5.0    1999-11-28 Little Bill 3.6    2006-09-08 Black Blood Brothers 7.4    2001-08-11 Cubix 4.3    1999-03-07 Digimon 6.8    2014-04-05 Dragonar Academy 7.0  Facts Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.toei-anim.co.jp/tv/digimon_t/ Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors J 6 Julia11111 A 5 Axiobyte j 4 joeykrenbek 4 enams90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}