{"link": "https://www.themoviedb.org/tv/3538?language=en", "title": "Aliens in America", "resume": "Aliens in America is an American sitcom created by David Guarascio and Moses Port that aired on The CW for one season from 2007–2008. Guarascio and Port also served as executive producers of the show alongside Tim Doyle. Luke Greenfield directed the pilot. The show is about an American teenager in Wisconsin whose family takes in a Muslim foreign exchange student from Pakistan.", "rate": 70, "genre": ["Comedy"], "cast": ["Lindsey Shaw", "Scott Patterson", "Amy Pietz", "Dan Byrd", "Adhir Kalyan"], "character": ["Claire Tolchuck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3538   Expand Aliens in America   (2007) User Score Overview Aliens in America is an American sitcom created by David Guarascio and Moses Port that aired on The CW for one season from 2007–2008. Guarascio and Port also served as executive producers of the show alongside Tim Doyle. Luke Greenfield directed the pilot. The show is about an American teenager in Wisconsin whose family takes in a Muslim foreign exchange student from Pakistan. Featured Crew David Guarascio Creator Moses Port Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lindsey Shaw Claire Tolchuck Scott Patterson Amy Pietz Dan Byrd Adhir Kalyan Full Cast & Crew Last Season Season 1 2007 | 18 Episodes Season 1 of Aliens in America premiered on October  1, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2011-09-04 Appropriate Adult 6.9    2005-06-07 Sugar Rush 7.8    1999-11-12 Courage the Cowardly Dog 7.6  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cwtv.com/thecw/aliens-in-america Genres Comedy Keywords high school muslim wisconsin racism teenager exchange student sitcom Content Score 93 Almost there... Top Contributors 16 Banana 15 Elizabeth Jennings F 10 Fayu 4 Sriram  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}