{"link": "https://www.themoviedb.org/tv/40604?language=en", "title": "Das Erbe der Guldenburgs", "resume": "Das Erbe der Guldenburgs is a German television series.", "rate": 45, "genre": ["Family"], "cast": ["Christiane Hörbiger", "Brigitte Horney", "Monika Peitsch", "Jürgen Goslar", "Iris Berben"], "character": ["Christine Gräfin von Guldenburg", "Hertha Gräfin von Guldenburg", "Aenne Günther", "Dr. Max Graf von Guldenburg", "Evelyn Lauritzen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40604   Expand Das Erbe der Guldenburgs   (1987) User Score Overview Das Erbe der Guldenburgs is a German television series. Featured Crew Michael Baier Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christiane Hörbiger Christine Gräfin von Guldenburg Brigitte Horney Hertha Gräfin von Guldenburg Monika Peitsch Aenne Günther Jürgen Goslar Dr. Max Graf von Guldenburg Iris Berben Evelyn Lauritzen Full Cast & Crew Last Season Season 3 1990 | 13 Episodes Season 3 of Das Erbe der Guldenburgs premiered on February 24, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1985-11-03 North and South 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 43 Samara TB 3 TMDb Bot a 3 asusar w 1 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}