{"link": "https://www.themoviedb.org/tv/10304?language=en", "title": "Suburban Shootout", "resume": "Suburban Shootout is a British satirical black comedy television series produced for Channel 5 and Paramount Comedy by Feelgood Fiction in association with Oxygen. The first series aired in the UK on Channel 5 from 27 April 2006. It began airing in the United States on 22 March 2006 on Oxygen and in Germany on Comedy Central in 2007. The second series began on Channel 5 on 6 September 2007.", "rate": 45, "genre": ["Comedy"], "cast": ["Anna Chancellor", "Felicity Montagu", "Amelia Bullmore", "Nicholas Farrell", "Emma Kennedy"], "character": ["Joyce Hazledine", "Raymond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10304   Expand Suburban Shootout   (2006) User Score Overview Suburban Shootout is a British satirical black comedy television series produced for Channel 5 and Paramount Comedy by Feelgood Fiction in association with Oxygen. The first series aired in the UK on Channel 5 from 27 April 2006. It began airing in the United States on 22 March 2006 on Oxygen and in Germany on Comedy Central in 2007. The second series began on Channel 5 on 6 September 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Chancellor Felicity Montagu Amelia Bullmore Joyce Hazledine Nicholas Farrell Raymond Emma Kennedy Full Cast & Crew Last Season Season 2 2007 | 6 Episodes Season 2 of Suburban Shootout premiered on September  6, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Suburban Shootout. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage  - Genres Comedy Keywords small town dark comedy housewife satire outlaw gang british comedy british humour Content Score 86 Almost there... Top Contributors 12 Banana 7 kcdh O 3 Ozbourne 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}