{"link": "https://www.themoviedb.org/tv/75504?language=en", "title": "Tarantula", "resume": "Set at the Tierra Chula Resident Hotel, Tarantula centers on Echo Johnson, a respected but uncertified tattoo artist. Echo’s poetic ramblings tell tales of misadventures with the other residents as they partake in party crashing, dumpster diving and other socially dubious acts of mischief.", "rate": 70, "genre": [], "cast": ["Carson D. Mell", "Dan Bakkedahl"], "character": ["Echo Johnson (voice)", "Lucas  (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75504   Expand Tarantula   (2017) User Score  Play Trailer Overview Set at the Tierra Chula Resident Hotel, Tarantula centers on Echo Johnson, a respected but uncertified tattoo artist. Echo’s poetic ramblings tell tales of misadventures with the other residents as they partake in party crashing, dumpster diving and other socially dubious acts of mischief. Featured Crew Carson D. Mell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carson D. Mell Echo Johnson (voice) Dan Bakkedahl Lucas  (voice) Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Tarantula premiered on December  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tarantula. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://www.tbs.com/shows/tarantula Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 26 Elizabeth Jennings TB 1 TMDb Bot D 1 Derek.Jo.Lee88 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}