{"link": "https://www.themoviedb.org/tv/70121?language=en", "title": "Sterva", "resume": "Contemporary Moscow. Journalist Sonya Bagretsova reviews restaurants for a popular Internet magazine. A misanthrope who wants and needs no one, she has one weakness - alcohol - that lands her in a ridiculous predicament.", "rate": 100, "genre": ["Comedy"], "cast": ["Yulia Topolnitskaya", "Svetlana Khodchenkova", "Aleksandra Bortich", "Yevgeni Syty", "Kseniya Radchenko"], "character": ["Nelya", "Sonya Bagretsova", "Sveta", "Anton Viktorovich, editor-in-chief", "waitress Destino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70121   Expand Sterva   (2017) User Score Overview Contemporary Moscow. Journalist Sonya Bagretsova reviews restaurants for a popular Internet magazine. A misanthrope who wants and needs no one, she has one weakness - alcohol - that lands her in a ridiculous predicament. Featured Crew Oleg Fomin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yulia Topolnitskaya Nelya Svetlana Khodchenkova Sonya Bagretsova Aleksandra Bortich Sveta Yevgeni Syty Anton Viktorovich, editor-in-chief Kseniya Radchenko waitress Destino Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Sterva premiered on January  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sterva. You can help by rating TV shows you've seen. Facts Original Name  Вы все меня бесите Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Russian Runtime  25m Homepage   http://ctc.ru/projects/serials/vy_vse_menya_besite/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors A 20 Amoenus 11 highroller n 5 navarro2018 3 mrtextortexel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}