{"link": "https://www.themoviedb.org/tv/1423?language=en", "title": "Ray Donovan", "resume": "Set in the sprawling mecca of the rich and famous, Ray Donovan does the dirty work for LA's top power players, and makes their problems disappear. His father's unexpected release from prison sets off a chain of events that shakes the Donovan family to its core.", "rate": 75, "genre": ["Drama"], "cast": ["Liev Schreiber", "Paula Malcomson", "Jon Voight", "Eddie Marsan", "Dash Mihok"], "character": ["Ray Donovan", "Abby Donovan", "Mickey Donovan", "Terry Donovan", "Bunchy Donovan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1423   Expand Ray Donovan   (2013) User Score  Play Trailer Overview Set in the sprawling mecca of the rich and famous, Ray Donovan does the dirty work for LA's top power players, and makes their problems disappear. His father's unexpected release from prison sets off a chain of events that shakes the Donovan family to its core. Featured Crew Ann Biderman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  1 Images Backdrops  32 Posters  20 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liev Schreiber Ray Donovan Paula Malcomson Abby Donovan Jon Voight Mickey Donovan Eddie Marsan Terry Donovan Dash Mihok Bunchy Donovan Full Cast & Crew Last Season Season 5 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply The Finale...thoughts? Open 8 by  rich24 SB SPOILERS SPOILERS SPOILERS - Never lets up Open 0 by Strange Bedfellows\n      \n     This is it!? Open 11 by  Nubyan Go to Discussions Media Most Popular Videos  1 Backdrops  32 Posters  20 Recommendations   2013-01-11 Banshee 7.9    2014-02-06 Bosch 7.9    2010-03-16 Justified 7.9    2013-01-30 The Americans 7.7    2011-10-02 Homeland 7.3    2010-05-04 Luther 7.9    2014-08-13 Legends 6.6    2012-06-03 Longmire 7.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.sho.com/ray-donovan Genres Drama Keywords california outlaw los angeles fixer Content Score 100 Yes! Looking good! Top Contributors 107 Elizabeth Jennings 67 Marr 🇳🇱 27 Banana 25 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}