{"link": "https://www.themoviedb.org/tv/59643?language=en", "title": "Restless", "resume": "A young woman finds out that her mother worked as a spy for the British Secret Service during World War II and has been on the run ever since.", "rate": 65, "genre": ["Drama"], "cast": ["Rufus Sewell", "Michelle Dockery", "Michael Gambon", "Charlotte Rampling", "Alexander Fehling"], "character": ["Lucas Romer", "Ruth Gilmartin", "Baron Mansfield / Lucas Romer", "Sally Gilmartin / Eva Delectorskaya", "Karl-Heinz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59643   Expand Restless   (2012) User Score  Play Trailer Overview A young woman finds out that her mother worked as a spy for the British Secret Service during World War II and has been on the run ever since. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rufus Sewell Lucas Romer Michelle Dockery Ruth Gilmartin Michael Gambon Baron Mansfield / Lucas Romer Charlotte Rampling Sally Gilmartin / Eva Delectorskaya Alexander Fehling Karl-Heinz Full Cast & Crew Last Season Miniseries 2012 | 2 Episodes Season 1 of Restless premiered on December 27, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Restless. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2014-01-09 Spies of Warsaw 7.2    2010-06-13 Rubicon 7.9    2015-03-02 Arthur & George 6.0    2014-10-02 Gracepoint 6.5    2013-10-29 The Escape Artist 7.0    2007-02-18 Inspector Lewis 7.6    2012-10-04 Hunted 7.1    2012-05-22 Hit & Miss 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/programmes/p0108tpb Genres Drama Keywords war based on novel or book spy miniseries british secret service Content Score 93 Almost there... Top Contributors TB 64 TMDb Bot 12 Banana r 9 rogercyk n 2 neostreaming  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}