{"link": "https://www.themoviedb.org/tv/13718?language=en", "title": "Hawkeye and the Last of the Mohicans", "resume": "Hawkeye and the Last of the Mohicans is a 1957 Western television series made for syndication by ITC Entertainment and Normandie Productions. It ran for one season of 39 half-hour monochrome episodes. The series is available on DVD and some episodes on VHS.\nLoosely based on The Last of the Mohicans by James Fenimore Cooper, the series was released under several different names, including Hawkeye and The Last of the Mohicans.\nThe series was set in New York's Hudson Valley in the 1750s but was filmed in Canada. The end credits state that the series was filmed in Canada with the cooperation of The Canadian Broadcasting Corporation.\nThe series had a more realistic view of America than most series of the times. The settlers were rough and dressed in old but suitable clothes for the long hard winters in the small settlements of the new frontier. The Native Americans were more realistically portrayed too, as an intelligent people with good and bad individuals among them. Fights in the film needed more than just the odd blow as the opponents hit hard at each other, and torture was used in a number of episodes. Weapons used were normally single shot rifles and tomahawks. Furs were often a motive of crime as they were the currency of the northern settlements.", "rate": 85, "genre": ["Western", "Drama"], "cast": ["Lon Chaney Jr.", "John Hart"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13718   Expand Hawkeye and the Last of the Mohicans   (1957) User Score Overview Hawkeye and the Last of the Mohicans is a 1957 Western television series made for syndication by ITC Entertainment and Normandie Productions. It ran for one season of 39 half-hour monochrome episodes. The series is available on DVD and some episodes on VHS. Loosely based on The Last of the Mohicans by James Fenimore Cooper, the series was released under several different names, including Hawkeye and The Last of the Mohicans. The series was set in New York's Hudson Valley in the 1750s but was filmed in Canada. The end credits state that the series was filmed in Canada with the cooperation of The Canadian Broadcasting Corporation. The series had a more realistic view of America than most series of the times. The settlers were rough and dressed in old but suitable clothes for the long hard winters in the small settlements of the new frontier. The Native Americans were more realistically portrayed too, as an intelligent people with good and bad individuals among them. Fights in the film needed more than just the odd blow as the opponents hit hard at each other, and torture was used in a number of episodes. Weapons used were normally single shot rifles and tomahawks. Furs were often a motive of crime as they were the currency of the northern settlements. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lon Chaney Jr. John Hart Full Cast & Crew Last Season Season 1 1957 | 39 Episodes Season 1 of Hawkeye and the Last of the Mohicans premiered on April  3, 1957. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hawkeye and the Last of the Mohicans. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 3 Steve 1 CouchTater 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}