{"link": "https://www.themoviedb.org/tv/2697?language=en", "title": "Sapphire & Steel", "resume": "Sapphire & Steel is a British television science-fiction fantasy series starring David McCallum as Steel and Joanna Lumley as Sapphire. Produced by ATV, it ran from 1979 to 1982 on the ITV network. The series was created by Peter J. Hammond who conceived the programme under the working title The Time Menders, after a stay in an allegedly haunted castle. Hammond also wrote all the stories except for the fifth, which was co-written by Don Houghton and Anthony Read.\nIn 2004, Sapphire and Steel returned in a series of audio dramas starring David Warner and Susannah Harker.", "rate": 82, "genre": ["Drama"], "cast": ["David McCallum", "Joanna Lumley"], "character": ["Sapphire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2697   Expand Sapphire & Steel   (1979) User Score Overview Sapphire & Steel is a British television science-fiction fantasy series starring David McCallum as Steel and Joanna Lumley as Sapphire. Produced by ATV, it ran from 1979 to 1982 on the ITV network. The series was created by Peter J. Hammond who conceived the programme under the working title The Time Menders, after a stay in an allegedly haunted castle. Hammond also wrote all the stories except for the fifth, which was co-written by Don Houghton and Anthony Read. In 2004, Sapphire and Steel returned in a series of audio dramas starring David Warner and Susannah Harker. Featured Crew Peter Hammond Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David McCallum Joanna Lumley Sapphire Full Cast & Crew Last Season Sapphire and steel season 6 1982 | 4 Episodes Season 6 of Sapphire & Steel premiered on August 19, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1984-01-29 Ever Decreasing Circles 6.5    2001-05-26 Messiah 8.0    1977-12-30 The Professionals 7.7    1988-10-25 Midnight Caller 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors t 3 tmdb15589237 r 3 rick555 SC 1 Steven C  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}