{"link": "https://www.themoviedb.org/tv/1104?language=en", "title": "Mad Men", "resume": "Mad Men is set in the 1960s, initially at the fictional Sterling Cooper advertising agency on Madison Avenue in New York City, and later at the newly created firm, Sterling Cooper Draper Pryce, located nearby in the Time-Life Building, at 1271 Avenue of the Americas. According to the show's pilot, the phrase \"mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves. The focal point of the series is Don Draper, creative director at Sterling Cooper and a founding partner at Sterling Cooper Draper Pryce, and the people in his life, both in and out of the office. The plot focuses on the business of the agencies as well as the personal lives of the characters, regularly depicting the changing moods and social mores of the United States in the 1960s.", "rate": 81, "genre": ["Drama"], "cast": ["Jon Hamm", "Elisabeth Moss", "Vincent Kartheiser", "January Jones", "Christina Hendricks"], "character": ["Don Draper", "Peggy Olson", "Pete Campbell", "Betty Draper", "Joan Holloway"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1104   Expand Mad Men   (2007) User Score  Play Trailer Overview Mad Men is set in the 1960s, initially at the fictional Sterling Cooper advertising agency on Madison Avenue in New York City, and later at the newly created firm, Sterling Cooper Draper Pryce, located nearby in the Time-Life Building, at 1271 Avenue of the Americas. According to the show's pilot, the phrase \"mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves. The focal point of the series is Don Draper, creative director at Sterling Cooper and a founding partner at Sterling Cooper Draper Pryce, and the people in his life, both in and out of the office. The plot focuses on the business of the agencies as well as the personal lives of the characters, regularly depicting the changing moods and social mores of the United States in the 1960s. Featured Crew Matthew Weiner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  73 Posters  32 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jon Hamm Don Draper Elisabeth Moss Peggy Olson Vincent Kartheiser Pete Campbell January Jones Betty Draper Christina Hendricks Joan Holloway Full Cast & Crew Last Season Season 7 2014 | 14 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply First season Vs. Last, visuals & directing Open 0 by Renovatio\n      \n     Horrible finale Open 4 by  Lloyd Fat makeup Open 0 by Renovatio\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  73 Posters  32 Recommendations   2010-09-19 Boardwalk Empire 7.7    2001-06-03 Six Feet Under 8.2    2003-11-02 Arrested Development 8.2    1999-01-10 The Sopranos 8.3    2013-02-01 House of Cards 8.2    2006-10-11 30 Rock 7.1    2005-03-24 The Office 8.0    2001-07-09 The Office 8.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  47m, 45m Homepage   http://www.amc.com/shows/mad-men Genres Drama Keywords work workplace advertising advertising agency executive madison avenue 1960s Content Score 100 Yes! Looking good! Top Contributors 326 lineker 95 Banana 71 Elizabeth Jennings n 28 nixskits  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}