{"link": "https://www.themoviedb.org/tv/10784?language=en", "title": "The Grid", "resume": "A team of American and British counter-terrorists are tasked with stopping a terrorist cell that is operating on a global level.", "rate": 70, "genre": ["Action", "Adventure", "Drama"], "cast": ["Dylan McDermott", "Julianna Margulies", "Bernard Hill", "James Remar", "Tom Skerritt"], "character": ["FBI Agent Max Canary", "NSA Agent Maren Jackson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10784   Expand The Grid   (2004) User Score Overview A team of American and British counter-terrorists are tasked with stopping a terrorist cell that is operating on a global level. Featured Crew Ken Friedman Creator Tracey Alexander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dylan McDermott FBI Agent Max Canary Julianna Margulies NSA Agent Maren Jackson Bernard Hill James Remar Tom Skerritt Full Cast & Crew Last Season Season 1 2004 | 6 Episodes Season 1 of The Grid premiered on July 19, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2011-02-03 Marchlands 7.4    2013-02-27 Lightfields 7.5    2015-04-15 The Delivery Man 6.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  44m, 60m Homepage   http://www.tnt.tv/title/?oid=540146 Genres Action & Adventure Drama Keywords cia fbi miniseries terrorism counter terrorism sarin Content Score 93 Almost there... Top Contributors TB 20 TMDb Bot R 13 Rebecca w 3 webmaster 3 galani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}