{"link": "https://www.themoviedb.org/tv/32220?language=en", "title": "Pasta", "resume": "Pasta is a 2010 South Korean television series starring Gong Hyo-jin, Lee Sun-kyun, Lee Ha-nui and Alex Chu. The workplace romantic comedy is about the dreams and struggles of a young woman who aspires to become an elite chef. It aired on MBC from January 4 to March 9, 2010 on Mondays and Tuesdays at 21:55 for 20 episodes.", "rate": 85, "genre": [], "cast": ["Gong Hyo-jin", "No Min-woo", "Alex Chu", "Lee Sun-kyun", "Jang Yong"], "character": ["Seo Yoo Kyung", "Philip", "Kim San", "Choi Hyun Wook", "Seo Jong Gyu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32220   Expand Pasta   (2010) User Score Overview Pasta is a 2010 South Korean television series starring Gong Hyo-jin, Lee Sun-kyun, Lee Ha-nui and Alex Chu. The workplace romantic comedy is about the dreams and struggles of a young woman who aspires to become an elite chef. It aired on MBC from January 4 to March 9, 2010 on Mondays and Tuesdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gong Hyo-jin Seo Yoo Kyung No Min-woo Philip Alex Chu Kim San Lee Sun-kyun Choi Hyun Wook Jang Yong Seo Jong Gyu Full Cast & Crew Last Season Season 1 2010 | 20 Episodes Season 1 of Pasta premiered on January  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Pasta. You can help by rating TV shows you've seen. Facts Original Name  파스타 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors N 17 Nightowl.Kr t 6 tmdb38202327 t 4 tmdb983464 z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}