{"link": "https://www.themoviedb.org/tv/12009?language=en", "title": "Marketplace", "resume": "Marketplace is a Canadian television series, broadcast on CBC Television. Launched in 1972, the series is a consumer advocacy newsmagazine, which shows investigative reports on issues such as product testing, health and safety, fraudulent business practices and other news issues of interest to product and service consumers.\nThe program was influential in the banning of urea formaldehyde foam insulation and lawn darts in Canada, the legislation of warnings on exploding pop bottles, successful prosecution of retailers for false advertising, new standards for bottled water and drinking fountains, new regulations to make children's sleepwear less flammable, and the implementation of safer designs for children's cribs.\nMarketplace was originally hosted by Joan Watson and George Finstad. Other hosts have included Bill Paul, Harry Brown, Norma Kent, Jacquie Perrin, Christine Johnson, Jim Nunn and Wendy Mesley. The program's current hosts are Tom Harrington and Erica Johnson.\nEarly seasons of the series had a theme song, \"The Consumer\", which was written and performed by Stompin' Tom Connors. For several years, every episode would begin with Connors singing the song, which became a hit.", "rate": 48, "genre": ["News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12009   Expand Marketplace   (1972) User Score Overview Marketplace is a Canadian television series, broadcast on CBC Television. Launched in 1972, the series is a consumer advocacy newsmagazine, which shows investigative reports on issues such as product testing, health and safety, fraudulent business practices and other news issues of interest to product and service consumers. The program was influential in the banning of urea formaldehyde foam insulation and lawn darts in Canada, the legislation of warnings on exploding pop bottles, successful prosecution of retailers for false advertising, new standards for bottled water and drinking fountains, new regulations to make children's sleepwear less flammable, and the implementation of safer designs for children's cribs. Marketplace was originally hosted by Joan Watson and George Finstad. Other hosts have included Bill Paul, Harry Brown, Norma Kent, Jacquie Perrin, Christine Johnson, Jim Nunn and Wendy Mesley. The program's current hosts are Tom Harrington and Erica Johnson. Early seasons of the series had a theme song, \"The Consumer\", which was written and performed by Stompin' Tom Connors. For several years, every episode would begin with Connors singing the song, which became a hit. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 40 2012 | 23 Episodes Season 40 of Marketplace premiered on September 14, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Marketplace. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.cbc.ca/marketplace Genres News Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}