{"link": "https://www.themoviedb.org/tv/82?language=en", "title": "Animaniacs", "resume": "The two Warner Brothers Yakko and Wakko and their Warner sister Dot had been (supposedly) created in the 1930's, but their cartoons were too screwy for the general public to handle. The three Warners were locked up in the studio water tower until they escaped in the 90's. There, they run wild, causing chaos everywhere!", "rate": 76, "genre": ["Animation", "Comedy", "Family"], "cast": ["Rob Paulsen", "Jess Harnell", "Tress MacNeille"], "character": ["Yakko Warner", "Wakko Warner", "Dot Warner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 82   Expand Animaniacs   (1993) User Score  Play Trailer Overview The two Warner Brothers Yakko and Wakko and their Warner sister Dot had been (supposedly) created in the 1930's, but their cartoons were too screwy for the general public to handle. The three Warners were locked up in the studio water tower until they escaped in the 90's. There, they run wild, causing chaos everywhere! Featured Crew Tom Ruegger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Paulsen Yakko Warner Jess Harnell Wakko Warner Tress MacNeille Dot Warner Full Cast & Crew Last Season Season 5 1997 | 9 Episodes Season 5 of Animaniacs premiered on September  8, 1997. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Animaniacs. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   1995-09-09 Pinky and the Brain 7.7    1990-09-14 Tiny Toon Adventures 7.3    1987-09-18 DuckTales 7.6    1983-09-10 Inspector Gadget 6.6    1991-09-08 Darkwing Duck 7.3    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1962-09-23 The Jetsons 6.6    1996-04-28 Dexter's Laboratory 7.3  Facts Status  Ended Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  21m Homepage  - Genres Animation Comedy Family Keywords animaniacs Content Score 71 Just a little bit more... Top Contributors w 10 winhacker 10 Banana 9 Rafaelasauani 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}