{"link": "https://www.themoviedb.org/tv/80519?language=en", "title": "Каменская - 3", "resume": "Continuation of the detective TV series based on the novels of Alexandra Marinina. Filmed under the novels \"The Illusion of Sin\", \"When the Gods Laugh\", \"The Stylist\" and \"The Seventh Sacrifice\". It consists of 16 series, 4 series for each novel.", "rate": 100, "genre": ["Action", "Adventure", "Mystery", "Drama", "Comedy", "Crime"], "cast": ["Elena Yakovleva", "Sergey Nikonenko", "Sergey Garmash", "Dmitriy Nagiev", "Andrey Ilin"], "character": ["Анастасия Павловна Каменская (главная роль)", "Виктор Алексеевич Гордеев (главная роль)", "Юрий Викторович Коротков (главная роль, майор)", "Михаил Лесников (главная роль, офицер ФСБ)", "Лёша Чистяков (главная роль, муж Каменской)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80519   Expand Каменская - 3   (2003) User Score Overview Continuation of the detective TV series based on the novels of Alexandra Marinina. Filmed under the novels \"The Illusion of Sin\", \"When the Gods Laugh\", \"The Stylist\" and \"The Seventh Sacrifice\". It consists of 16 series, 4 series for each novel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elena Yakovleva Анастасия Павловна Каменская (главная роль) Sergey Nikonenko Виктор Алексеевич Гордеев (главная роль) Sergey Garmash Юрий Викторович Коротков (главная роль, майор) Dmitriy Nagiev Михаил Лесников (главная роль, офицер ФСБ) Andrey Ilin Лёша Чистяков (главная роль, муж Каменской) Full Cast & Crew Last Season Season 1 2003 | 16 Episodes Season 1 of Каменская - 3 premiered on September 29, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations   2005-12-09 Каменская - 4 10.0    2001-12-22 Black Raven 10.0    2008-11-16 Kamenskaya - 5 10.0    2002-12-07 Каменская - 2 10.0  Facts Status  Ended Network Certification 0+ Meaning Can be watched by Any Age. Type  Scripted Original Language  Russian Runtime  44m Homepage  - Genres Action & Adventure Mystery Drama Comedy Crime Keywords based on novel or book russian novels crime russian Content Score 93 Almost there... Top Contributors n 41 navarro2018 11 Elena Sergeeva TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}