{"link": "https://www.themoviedb.org/tv/60860?language=en", "title": "Foo Fighters Sonic Highways", "resume": "In this new series, Foo Fighters commemorate their 20th anniversary by documenting the eight-city recording odyssey that produced their latest, and eighth, studio album.\nFoo Fighters founder Dave Grohl directs the series, which taps into the musical heritage and cultural fabric of eight cities: Chicago, Austin, Nashville, Los Angeles, Seattle, New Orleans, Washington D.C. and New York. The band based themselves at a legendary recording studio integral to the unique history and character of each location.\nOne song was recorded in each city, and every track features local legends. Even the lyrics were developed in an experimental, unprecedented way: Grohl held off on writing them until the last day of each session, letting himself be inspired by the experiences, interviews and personalities that became part of the process.\nFoo Fighters Sonic Highways is, in Grohl’s words, “a love letter to the history of American music.” Each episode delves into the identity of each city -- showing how each region shaped these musicians in their formative years and, in turn, how they impacted the cultural fabric of their hometowns. Every artist who appears in the show, regardless of genre or locale, started as an average kid with universal dreams of making music and making it big.\nGrohl made his feature film directorial debut in 2013 with the universally acclaimed Grammy-winning Sound City, a celebration of the human element in the creation and recording of music. Foo Fighters have won 11 Grammy Awards, including four for Best Rock Album, more than any other band.\nPremiering on the eve of Foo Fighters’ 20th anniversary, Foo Fighters Sonic Highways aims to “give back” to the next generation of young musicians. As guitarist and singer Buddy Guy, an interviewee from the Chicago blues scene, explains, “Everything comes from what’s come before.”", "rate": 74, "genre": ["Documentary", "Music"], "cast": ["Dave Grohl", "Taylor Hawkins", "Pat Smear", "Nate Mendel", "Chris Shiflett"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60860   Expand Foo Fighters Sonic Highways   (2014) User Score Overview In this new series, Foo Fighters commemorate their 20th anniversary by documenting the eight-city recording odyssey that produced their latest, and eighth, studio album. Foo Fighters founder Dave Grohl directs the series, which taps into the musical heritage and cultural fabric of eight cities: Chicago, Austin, Nashville, Los Angeles, Seattle, New Orleans, Washington D.C. and New York. The band based themselves at a legendary recording studio integral to the unique history and character of each location. One song was recorded in each city, and every track features local legends. Even the lyrics were developed in an experimental, unprecedented way: Grohl held off on writing them until the last day of each session, letting himself be inspired by the experiences, interviews and personalities that became part of the process. Foo Fighters Sonic Highways is, in Grohl’s words, “a love letter to the history of American music.” Each episode delves into the identity of each city -- showing how each region shaped these musicians in their formative years and, in turn, how they impacted the cultural fabric of their hometowns. Every artist who appears in the show, regardless of genre or locale, started as an average kid with universal dreams of making music and making it big. Grohl made his feature film directorial debut in 2013 with the universally acclaimed Grammy-winning Sound City, a celebration of the human element in the creation and recording of music. Foo Fighters have won 11 Grammy Awards, including four for Best Rock Album, more than any other band. Premiering on the eve of Foo Fighters’ 20th anniversary, Foo Fighters Sonic Highways aims to “give back” to the next generation of young musicians. As guitarist and singer Buddy Guy, an interviewee from the Chicago blues scene, explains, “Everything comes from what’s come before.” Featured Crew Dave Grohl Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Grohl Himself Taylor Hawkins Himself Pat Smear Himself Nate Mendel Himself Chris Shiflett Himself Full Cast & Crew Last Season Season 1 2014 | 8 Episodes Season 1 of Foo Fighters Sonic Highways premiered on October 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  6 Recommendations   2014-08-08 The Knick 7.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.hbo.com/foo-fighters-sonic-highways Genres Documentary Music Keywords rock and roll rock documentary Content Score 93 Almost there... Top Contributors 54 Elizabeth Jennings TB 33 TMDb Bot A 8 Alen 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}