{"link": "https://www.themoviedb.org/tv/25499?language=en", "title": "Umineko: When They Cry", "resume": "As customary per year, the entire family is gathering on the island for a conference that discusses the current financial situations of each respective person. Because of the family head's poor health, this year involves the topic of the head of the family's inheritance and how it will be distributed.\nHowever, the family is unaware that the distribution of his wealth is the least of Ushiromiya Kinzo's concerns for this year's family conference. After being told that his end was approaching by his longtime friend and physician, Kinzo is desperate to meet his life's true love one last time: the Golden Witch, Beatrice. Having immersed himself in black magic for many of the later years in his life, Kinzo instigates a ceremony to revive his beloved upon his family's arrival on Rokkenjima. Soon after, a violent typhoon traps the family on the island and a string of mysterious murders commence, forcing the eighteen people on the island to fight for their lives in a deadly struggle between fantasy and reality.", "rate": 85, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure", "Comedy", "Drama"], "cast": ["Marina Inoue", "Daisuke Ono", "Emi Shinohara", "Akihiko Ishizumi", "Kenichi Suzumura"], "character": ["Battler Ushiromiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25499   Expand Umineko: When They Cry   (2009) User Score Overview As customary per year, the entire family is gathering on the island for a conference that discusses the current financial situations of each respective person. Because of the family head's poor health, this year involves the topic of the head of the family's inheritance and how it will be distributed. However, the family is unaware that the distribution of his wealth is the least of Ushiromiya Kinzo's concerns for this year's family conference. After being told that his end was approaching by his longtime friend and physician, Kinzo is desperate to meet his life's true love one last time: the Golden Witch, Beatrice. Having immersed himself in black magic for many of the later years in his life, Kinzo instigates a ceremony to revive his beloved upon his family's arrival on Rokkenjima. Soon after, a violent typhoon traps the family on the island and a string of mysterious murders commence, forcing the eighteen people on the island to fight for their lives in a deadly struggle between fantasy and reality. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marina Inoue Daisuke Ono Battler Ushiromiya Emi Shinohara Akihiko Ishizumi Kenichi Suzumura Full Cast & Crew Last Season Season 1 2009 | 26 Episodes Season 1 of Umineko: When They Cry premiered on July  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Umineko: When They Cry. You can help by rating TV shows you've seen. Facts Original Name  うみねこのなく頃に Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://umineko.tv/web/index.html Genres Animation Sci-Fi & Fantasy Action & Adventure Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 seboseboss K 5 Kuroneko45 4 theramyz x 3 xoINARIox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}