{"link": "https://www.themoviedb.org/tv/1447?language=en", "title": "Psych", "resume": "Thanks to his police officer father's efforts, Shawn Spencer spent his childhood developing a keen eye for detail (and a lasting dislike of his dad). Years later, Shawn's frequent tips to the police lead to him being falsely accused of a crime he solved. Now, Shawn has no choice but to use his abilities to perpetuate his cover story: psychic crime-solving powers, all the while dragging his best friend, his dad, and the police along for the ride.", "rate": 77, "genre": ["Mystery", "Drama", "Comedy"], "cast": ["James Roday", "Dulé Hill", "Timothy Omundson", "Maggie Lawson", "Kirsten Nelson"], "character": ["Shawn Spencer", "Burton 'Gus' Guster", "Carlton Lassiter", "Juliet O'Hara", "Karen Vick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1447   Expand Psych   (2006) User Score  Play Trailer Overview Thanks to his police officer father's efforts, Shawn Spencer spent his childhood developing a keen eye for detail (and a lasting dislike of his dad). Years later, Shawn's frequent tips to the police lead to him being falsely accused of a crime he solved. Now, Shawn has no choice but to use his abilities to perpetuate his cover story: psychic crime-solving powers, all the while dragging his best friend, his dad, and the police along for the ride. Featured Crew Steve Franks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  23 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Roday Shawn Spencer Dulé Hill Burton 'Gus' Guster Timothy Omundson Carlton Lassiter Maggie Lawson Juliet O'Hara Kirsten Nelson Karen Vick Full Cast & Crew Last Season Season 8 2014 | 10 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Psych the Movie now available to view online on USAnetwork.com Open 0 by Mon-Star\n      \n     Psych The Movie on Dec 7, 2017 cable's USA channel Open 1 by  bratface w Detective Juliet O'Hara: Happy Birthday Maggie Lawson! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  11 Recommendations   2002-07-12 Monk 7.6    2007-09-24 Chuck 7.7    2007-06-28 Burn Notice 7.3    2009-10-23 White Collar 7.7    2008-09-23 The Mentalist 7.3    2009-01-21 Lie to Me 7.4    2007-09-26 Life 7.8    2009-09-17 Community 7.9  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.usanetwork.com/series/psych Genres Mystery Drama Comedy Keywords california police detective con man detective agency criminal consultant Content Score 100 Yes! Looking good! Top Contributors M 35 Manu 25 Jason Patrick 20 Banana 17 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}