{"link": "https://www.themoviedb.org/tv/62496?language=en", "title": "Evermoor", "resume": "A young girl and her blended family move to the small cottage town of Evermoor. All is well until sinister things start to happen, magic tapestries, an enchanted typewriter. Only a few of the strange things found in the town of Evermoor.", "rate": 45, "genre": ["Adventure"], "cast": ["Georgia Lock", "Sammy Moore", "Alex Starke", "Georgie Farmer", "Finney Cassidy"], "character": ["Bella Crossley", "Otto", "Ludo Carmichael", "Jake Crossley", "Cameron Marsh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62496   Expand Evermoor   (2014) User Score Overview A young girl and her blended family move to the small cottage town of Evermoor. All is well until sinister things start to happen, magic tapestries, an enchanted typewriter. Only a few of the strange things found in the town of Evermoor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Georgia Lock Bella Crossley Sammy Moore Otto Alex Starke Ludo Carmichael Georgie Farmer Jake Crossley Finney Cassidy Cameron Marsh Full Cast & Crew Last Season Season 2 2016 | 20 Episodes Season 2 of Evermoor premiered on April 10, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Seb: Happy Birthday George Sear! Open 0 by wonder2wonder\n      \n     w Bella: Happy Birthday Georgia Lock! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Evermoor. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.disney.co.uk/disney-channel/shows/evermoor Genres Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors w 21 wonder2wonder 16 Elizabeth Jennings c 6 christra R 4 Rambo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}