{"link": "https://www.themoviedb.org/tv/7971?language=en", "title": "Oskyldigt dömd", "resume": "Oskyldigt dömd is a Swedish drama television series from 2008. The first season was recorded in twelve episodes during February 2008 to be aired later during the fall. It premiered on the Finnish TV channel FST5 on September 24, 2008 and later the same evening on Swedish TV4. The series is produced by Filmlance. On January 23 TV4 announced that Mikael Persbrandt would be playing the main character and on February 10 other cast members were announced; Helena af Sandeberg, Sofia Ledarp, Marie Richardson and Mirja Turestedt. TV4 also announced that they had started to work on the second season before the first had even been aired., the first season was written by Johan Zollitsch, Jan Arnald, Karin Gidfors and Hans Rosenfeldt but the second one is written by Thomas Borgström and Sara Heldt. Filming the second season took place during the spring 2009. TV4 refused to say how much money the filming has cost the channel, but they confirms that \"a lot of money\" has been used.", "rate": 0, "genre": ["Drama"], "cast": ["Mikael Persbrandt", "Marie Richardson", "Sofia Ledarp"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7971   Expand Oskyldigt dömd   (2008) User Score  Play Trailer Overview Oskyldigt dömd is a Swedish drama television series from 2008. The first season was recorded in twelve episodes during February 2008 to be aired later during the fall. It premiered on the Finnish TV channel FST5 on September 24, 2008 and later the same evening on Swedish TV4. The series is produced by Filmlance. On January 23 TV4 announced that Mikael Persbrandt would be playing the main character and on February 10 other cast members were announced; Helena af Sandeberg, Sofia Ledarp, Marie Richardson and Mirja Turestedt. TV4 also announced that they had started to work on the second season before the first had even been aired., the first season was written by Johan Zollitsch, Jan Arnald, Karin Gidfors and Hans Rosenfeldt but the second one is written by Thomas Borgström and Sara Heldt. Filming the second season took place during the spring 2009. TV4 refused to say how much money the filming has cost the channel, but they confirms that \"a lot of money\" has been used. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mikael Persbrandt Marie Richardson Sofia Ledarp Full Cast & Crew Last Season Season 2 2009 | 12 Episodes Season 2 of Oskyldigt dömd premiered on September 30, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oskyldigt dömd. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tv4.se/serier/oskyldigt_domd Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors S 7 Shady12 2 tigru89 1 rudely_murray TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}