{"link": "https://www.themoviedb.org/tv/42252?language=en", "title": "Bodies of Evidence", "resume": "Bodies of Evidence is a police drama that aired on CBS from June 1992 to May 1993. It stars Lee Horsley and George Clooney as Los Angeles homicide detectives.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Lee Horsley", "George Clooney", "Kate McNeil", "Al Fann", "Jennifer Hetrick"], "character": ["Lieutenant Ben Carroll", "Det. Ryan Walker", "Det. Nora Houghton", "Det. Will Stratton", "Bonnie Carroll"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42252   Expand Bodies of Evidence   (1992) User Score Overview Bodies of Evidence is a police drama that aired on CBS from June 1992 to May 1993. It stars Lee Horsley and George Clooney as Los Angeles homicide detectives. Featured Crew James L. Conway Creator David Jacobs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Horsley Lieutenant Ben Carroll George Clooney Det. Ryan Walker Kate McNeil Det. Nora Houghton Al Fann Det. Will Stratton Jennifer Hetrick Bonnie Carroll Full Cast & Crew Last Season Season 2 1993 | 8 Episodes Season 2 of Bodies of Evidence premiered on March 30, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bodies of Evidence. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords los angeles police detective homicide detective Content Score 93 Almost there... Top Contributors R 12 Rebecca 11 Banana 2 seawolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}