{"link": "https://www.themoviedb.org/tv/95?language=en", "title": "Buffy the Vampire Slayer", "resume": "Into every generation a slayer is born: one girl in all the world, a chosen one. She alone will wield the strength and skill to fight the vampires, demons, and the forces of darkness; to stop the spread of their evil and the swell of their number. She is the Slayer.", "rate": 80, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Sarah Michelle Gellar", "Alyson Hannigan", "Anthony Stewart Head", "Michelle Trachtenberg", "James Marsters"], "character": ["Buffy Summers", "Willow Rosenberg", "Rupert Giles", "Dawn Summers", "Spike"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 95   Expand Buffy the Vampire Slayer   (1997) User Score  Play Trailer Overview Into every generation a slayer is born: one girl in all the world, a chosen one. She alone will wield the strength and skill to fight the vampires, demons, and the forces of darkness; to stop the spread of their evil and the swell of their number. She is the Slayer. Featured Crew Joss Whedon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  24 Content Issues  1 Images Backdrops  31 Posters  20 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Michelle Gellar Buffy Summers Alyson Hannigan Willow Rosenberg Anthony Stewart Head Rupert Giles Michelle Trachtenberg Dawn Summers James Marsters Spike Full Cast & Crew Last Season Season 7 2002 | 22 Episodes View All Seasons Social Reviews  1 Discussions  25 J A review by Joe  9.0 Written by  Joe  on March  3, 2017 Such a great show! It's got everything- great characters, strong storylines, many issues, and horror, romance, tragedy, comedy, coming of age, and much more!! Read All Reviews Media Most Popular Videos  1 Backdrops  31 Posters  20 Recommendations   1999-10-05 Angel 7.6    1998-10-07 Charmed 6.7    2004-09-22 Veronica Mars 7.8    2001-10-16 Smallville 6.9    2009-02-13 Dollhouse 7.2    2000-10-03 Dark Angel 7.2    2006-09-25 Heroes 6.9    1995-09-04 Xena: Warrior Princess 6.7  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 42m, 45m, 60m Homepage   http://www.foxhome.com/buffysplash/ Genres Comedy Drama Sci-Fi & Fantasy Keywords high school monster magic vampire anti hero supernatural chosen one female protagonist apocalypse teenager vampire slayer action heroine Content Score 100 Yes! Looking good! Top Contributors R 50 Rebecca J 49 Jenn L 41 Law m 19 mks  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}