{"link": "https://www.themoviedb.org/tv/34441?language=en", "title": "Easy to Assemble", "resume": "Easy to Assemble is a Webseries created by and starring Illeana Douglas, and sponsored by furniture store IKEA.\nDouglas plays a fictional version of herself trying to quit acting and work a \"real job\" at the IKEA in Burbank, CA. She soon finds she cannot leave Hollywood behind when fellow actress Justine Bateman starts an internet talk show called \"40 and Bitter\" on the floor of IKEA.\nThe series has had several notable guest stars, including Jeff Goldblum, Keanu Reeves, Jane Lynch, Justine Bateman, Tim Meadows, Cheri Oteri, Tom Arnold, Ed Begley, Jr., Kevin Pollak, Fred Willard, Daryl Sabara, Ricki Lake, David Henrie, Patricia Heaton, and Eric Lange.", "rate": 0, "genre": ["Comedy"], "cast": ["Illeana Douglas", "Justine Bateman", "Robert Mailhouse", "Keanu Reeves", "David Henrie"], "character": ["Herself", "Vorste Feirron", "Ethan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34441   Expand Easy to Assemble   (2008) User Score Overview Easy to Assemble is a Webseries created by and starring Illeana Douglas, and sponsored by furniture store IKEA. Douglas plays a fictional version of herself trying to quit acting and work a \"real job\" at the IKEA in Burbank, CA. She soon finds she cannot leave Hollywood behind when fellow actress Justine Bateman starts an internet talk show called \"40 and Bitter\" on the floor of IKEA. The series has had several notable guest stars, including Jeff Goldblum, Keanu Reeves, Jane Lynch, Justine Bateman, Tim Meadows, Cheri Oteri, Tom Arnold, Ed Begley, Jr., Kevin Pollak, Fred Willard, Daryl Sabara, Ricki Lake, David Henrie, Patricia Heaton, and Eric Lange. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Illeana Douglas Herself Justine Bateman Robert Mailhouse Keanu Reeves Vorste Feirron David Henrie Ethan Full Cast & Crew Last Season Season 4: This Side Up 2012 | 11 Episodes Season 4 of Easy to Assemble premiered on October 16, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Easy to Assemble. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage   https://www.youtube.com/user/EasyToAssembleTV Genres Comedy Keywords store Content Score 71 Just a little bit more... Top Contributors 18 Elizabeth Jennings 6 Banana 4 Marr 🇳🇱 w 3 wilsoncleveland  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}