{"link": "https://www.themoviedb.org/tv/70525?language=en", "title": "What Happens to My Family?", "resume": "Every family has its issues but what happens when the patriarch in the family is not happy with the behaviors of his children? Cha Bong Soon does not intend to just sit back and take bad treatment from his three adult children – Cha Kang Shim, Cha Kang Jae and Cha Dal Bong – and decides to take legal action against them. With such chaos going on in her family, Kang Shim has a tough time focusing on her job as secretary to the president of Daeoh Company and constantly at odds with the president's son, Moon Tae Joo, the company director. Will Tae Joo get sucked into the Cha family drama as well?", "rate": 0, "genre": ["Drama", "Family", "Comedy"], "cast": ["Yoo Dong-geun", "Kim Hyun-joo", "Kim Sang-kyung", "Yoon Park", "Park Hyung-sik"], "character": ["Cha Soon-Bong", "Cha Gang-Sim", "Moon Tae-Joo", "Cha Gang-Jae", "Cha Dal-Bong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70525   Expand What Happens to My Family?   (2014) User Score  Play Trailer Overview Every family has its issues but what happens when the patriarch in the family is not happy with the behaviors of his children? Cha Bong Soon does not intend to just sit back and take bad treatment from his three adult children – Cha Kang Shim, Cha Kang Jae and Cha Dal Bong – and decides to take legal action against them. With such chaos going on in her family, Kang Shim has a tough time focusing on her job as secretary to the president of Daeoh Company and constantly at odds with the president's son, Moon Tae Joo, the company director. Will Tae Joo get sucked into the Cha family drama as well? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Dong-geun Cha Soon-Bong Kim Hyun-joo Cha Gang-Sim Kim Sang-kyung Moon Tae-Joo Yoon Park Cha Gang-Jae Park Hyung-sik Cha Dal-Bong Full Cast & Crew Last Season Season 1 2014 | 53 Episodes Season 1 of What Happens to My Family? premiered on August 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on What Happens to My Family?. You can help by rating TV shows you've seen. Facts Original Name  가족끼리 왜 이래 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/whyfamily/ Genres Drama Family Comedy Keywords korea Content Score 93 Almost there... Top Contributors M 43 Maria180493 TB 2 TMDb Bot L 2 Leah  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}