{"link": "https://www.themoviedb.org/tv/4437?language=en", "title": "Survivorman", "resume": "Survivorman is a Canadian-produced television program, broadcast in Canada on the Outdoor Life Network, and internationally on Discovery Channel and Science Channel. The show aired three seasons and 4 specials – 2004, 2007, 2008, and 2012.\nThe title refers to the host of the show, Canadian filmmaker and survival expert Les Stroud, who used survival skills and knowledge to survive for up to ten days alone videotaping his adventures in remote locales where he brought with him little or no food, water, or equipment. According to the show's website, each location was scouted and pre-planned extensively by Stroud and his team who consulted with survival specialists and natives of each area. The fact that Stroud spent his time alone without a production crew is a major focus of the show.", "rate": 81, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4437   Expand Survivorman   (2004) User Score  Play Trailer Overview Survivorman is a Canadian-produced television program, broadcast in Canada on the Outdoor Life Network, and internationally on Discovery Channel and Science Channel. The show aired three seasons and 4 specials – 2004, 2007, 2008, and 2012. The title refers to the host of the show, Canadian filmmaker and survival expert Les Stroud, who used survival skills and knowledge to survive for up to ten days alone videotaping his adventures in remote locales where he brought with him little or no food, water, or equipment. According to the show's website, each location was scouted and pre-planned extensively by Stroud and his team who consulted with survival specialists and natives of each area. The fact that Stroud spent his time alone without a production crew is a major focus of the show. Featured Crew Les Stroud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 8 2016 | 2 Episodes Season 8 of Survivorman premiered on July 19, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Any Fans Lurking? Open 0 by Rick\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2006-10-27 Man vs. Wild 6.9    2011-05-30 Finding Bigfoot 4.4    2005-07-25 Anthony Bourdain: No Reservations 7.9    1989-09-09 Beetlejuice 7.2    1994-04-01 Sister, Sister 5.9    2017-09-17 The Vietnam War 8.1    Stephen King's Desperation 5.7    2010-12-01 Storage Wars 5.3  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  42m, 60m Homepage   http://www.survivorman.ca Genres Documentary Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 41 Joe Carson L 13 Limitless TB 4 TMDb Bot y 4 yoyosado  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}