{"link": "https://www.themoviedb.org/tv/45658?language=en", "title": "Metal Hurlant Chronicles", "resume": "Metal Hurlant Chronicles is inspired by the popular comics anthology Métal Hurlant, which in turn inspired the well known fantasy magazine Heavy Metal. Each episode takes place on a different planet - fantastical in its own way - with the common thread between stories being a traveling asteroid that impacts the lives of all it encounters.", "rate": 56, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["David Belle", "Eriq Ebouaney", "Joe Flanigan", "Michelle Ryan", "Rutger Hauer"], "character": ["Le prisonnier", "Kaskoff", "Hondo", "Jennifer", "Kerm"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45658   Expand Metal Hurlant Chronicles   (2012) User Score Overview Metal Hurlant Chronicles is inspired by the popular comics anthology Métal Hurlant, which in turn inspired the well known fantasy magazine Heavy Metal. Each episode takes place on a different planet - fantastical in its own way - with the common thread between stories being a traveling asteroid that impacts the lives of all it encounters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Belle Le prisonnier Eriq Ebouaney Kaskoff Joe Flanigan Hondo Michelle Ryan Jennifer Rutger Hauer Kerm Full Cast & Crew Last Season Season 2 2014 | 6 Episodes Season 2 of Metal Hurlant Chronicles premiered on April 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1994-09-10 ReBoot 8.3    2015-08-01 Star Trek: Renegades 5.2    2011-08-29 Death Valley 7.4    2011-02-07 Outcasts 6.2    2011-09-21 The Fades 7.0    2010-09-23 Outsourced 6.7    2012-09-26 The Neighbors 6.3    2012-06-07 TRON: Uprising 7.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.syfy.com/metalhurlantchronicles Genres Action & Adventure Sci-Fi & Fantasy Keywords based on comic anthology based on graphic novel Content Score 86 Almost there... Top Contributors 38 Elizabeth Jennings d 13 denis CM 6 Cherche Moi 4 ComputerBlue  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}