{"link": "https://www.themoviedb.org/tv/2048?language=en", "title": "The Hitchhiker's Guide to the Galaxy", "resume": "Don't Panic! The story of Arthur Dent, an average Englishman who life was spared by his friend, who turned out to be an alien, while the planet Earth is destroyed. His friend tells him about the Hitchhiker's Guide to the Galaxy, a guide with anything you ever needed, and wanted to know. They travel across the galaxy, meeting friendly, and not so friendly characters in order to find the great question (the answer being 42).", "rate": 76, "genre": ["Adventure", "Comedy", "Science", "Fiction"], "cast": ["Sandra Dickinson", "Mark Wing-Davey", "Simon Jones", "David Dixon", "Stephen Moore"], "character": ["Trillian", "Zaphod Beeblebrox", "Arthur Dent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2048   Expand The Hitchhiker's Guide to the Galaxy   (1981) User Score Overview Don't Panic! The story of Arthur Dent, an average Englishman who life was spared by his friend, who turned out to be an alien, while the planet Earth is destroyed. His friend tells him about the Hitchhiker's Guide to the Galaxy, a guide with anything you ever needed, and wanted to know. They travel across the galaxy, meeting friendly, and not so friendly characters in order to find the great question (the answer being 42). Featured Crew Douglas Adams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sandra Dickinson Trillian Mark Wing-Davey Zaphod Beeblebrox Simon Jones Arthur Dent David Dixon Stephen Moore Full Cast & Crew Last Season Season 1 1981 | 6 Episodes Season 1 of The Hitchhiker's Guide to the Galaxy premiered on January  5, 1981. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Hitchhiker's Guide to the Galaxy. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Hitchhiker's Guide to the Galaxy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  33m, 35m Homepage   http://www.bbc.co.uk/cult/hitchhikers/ Genres Adventure Comedy Science Fiction Keywords galaxy friendship adventure satire alien ufo end of the world space universe deep space explorer meaning of life alien friendship british humour Content Score 93 Almost there... Top Contributors 23 Elizabeth Jennings 22 jniemchak O 8 Ozbourne 7 mdcacho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}