{"link": "https://www.themoviedb.org/tv/21204?language=en", "title": "Grandpa in My Pocket", "resume": "Grandpa in My Pocket is a comedy drama series commissioned by Michael Carrington for CBeebies, the BBC's dedicated pre-school and nursery channel targeting children aged 1-6 years. The programme stars James Bolam, Jay Ruckley, Josie Cable, Zara Ramm and Sam Ellis. The story centres on Grandpa, who owns a magical Shrinking Cap, which only his grandson Jason knows about. This cap enables him to shrink to about 4 or 5 inches tall and experience many magical adventures which are told via voice-over narration by Jason, including finding a hamster under the floorboards and bringing a home-made robot to life.\nWhen miniaturized, he has enough magic power to make Jason's toy car and toy biplane and toy railway locomotive work as the real vehicles including making engine noise, and drive them. Jason has a simple toy glider made of two pieces of wood in the shape of a seagull which he calls Gordon; Grandpa, when miniaturized, can ride on this and make it fly like a real seagull.\nWhen miniaturized, Grandpa can jump much farther in proportion than in full size, and can also \"run for all he's worth\", as Jason puts it.\nGrandpa is never identified on-screen with a proper name, so we never learn whether he is Mr. Mason or Mrs. Mason's father – both refer to him simply as \"Grandpa\" in much the same way as the parents of comic strip characters – such as The Beano's Dennis the Menace, for example – call each other \"Mum\" and \"Dad\". Even Grandpa's own sister, Great Aunt Loretta, only ever calls him \"Grandpa\".", "rate": 70, "genre": [], "cast": ["James Bolam"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21204   Expand Grandpa in My Pocket User Score Overview Grandpa in My Pocket is a comedy drama series commissioned by Michael Carrington for CBeebies, the BBC's dedicated pre-school and nursery channel targeting children aged 1-6 years. The programme stars James Bolam, Jay Ruckley, Josie Cable, Zara Ramm and Sam Ellis. The story centres on Grandpa, who owns a magical Shrinking Cap, which only his grandson Jason knows about. This cap enables him to shrink to about 4 or 5 inches tall and experience many magical adventures which are told via voice-over narration by Jason, including finding a hamster under the floorboards and bringing a home-made robot to life. When miniaturized, he has enough magic power to make Jason's toy car and toy biplane and toy railway locomotive work as the real vehicles including making engine noise, and drive them. Jason has a simple toy glider made of two pieces of wood in the shape of a seagull which he calls Gordon; Grandpa, when miniaturized, can ride on this and make it fly like a real seagull. When miniaturized, Grandpa can jump much farther in proportion than in full size, and can also \"run for all he's worth\", as Jason puts it. Grandpa is never identified on-screen with a proper name, so we never learn whether he is Mr. Mason or Mrs. Mason's father – both refer to him simply as \"Grandpa\" in much the same way as the parents of comic strip characters – such as The Beano's Dennis the Menace, for example – call each other \"Mum\" and \"Dad\". Even Grandpa's own sister, Great Aunt Loretta, only ever calls him \"Grandpa\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Bolam Full Cast & Crew Last Season Season 3 2010 | 14 Episodes Season 3 of Grandpa in My Pocket premiered on December 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  12m Homepage   http://www.grandpainmypocket.co.uk/ Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}