{"link": "https://www.themoviedb.org/tv/3753?language=en", "title": "Crossroads", "resume": "Crossroads is a British television soap opera set in a fictional motel near Birmingham, England. Created by Hazel Adair and Peter Ling, the commercial ITV network originally broadcast the series between 1964 and 1988. Produced by ATV and later by Central it became a byword for cheap production values, particularly in the 1970s and early 1980s. The series was revived in a glossier version by Carlton Television in 2001, but was again cancelled in 2003.\nThe original theme tune was composed by Tony Hatch, and notably covered by Paul McCartney & Wings on their 1975 album Venus and Mars. A new version, which was first aired in 1987 when the series was relaunched as Crossroads, Kings Oak, was composed by Raf Ravenscroft and Max Early.", "rate": 80, "genre": ["Drama"], "cast": ["Kate O'Mara", "Jane Rossington", "Roger Tonge", "Kathy Staff", "Sue Lloyd"], "character": ["Doris Luke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3753   Expand Crossroads   (1964) User Score Overview Crossroads is a British television soap opera set in a fictional motel near Birmingham, England. Created by Hazel Adair and Peter Ling, the commercial ITV network originally broadcast the series between 1964 and 1988. Produced by ATV and later by Central it became a byword for cheap production values, particularly in the 1970s and early 1980s. The series was revived in a glossier version by Carlton Television in 2001, but was again cancelled in 2003. The original theme tune was composed by Tony Hatch, and notably covered by Paul McCartney & Wings on their 1975 album Venus and Mars. A new version, which was first aired in 1987 when the series was relaunched as Crossroads, Kings Oak, was composed by Raf Ravenscroft and Max Early. Featured Crew Peter Ling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate O'Mara Jane Rossington Roger Tonge Kathy Staff Doris Luke Sue Lloyd Full Cast & Crew Last Season (1964) season 24 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crossroads. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 19m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 3 Zlogorek 2 lineker t 2 tmdb18359958 1 mostern  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}