{"link": "https://www.themoviedb.org/tv/2802?language=en", "title": "Waterloo Road", "resume": "Waterloo Road is a UK television drama series the first broadcast was in the United Kingdom on BBC One on 9 March 2006. Originally set in a troubled comprehensive school in Rochdale, England, the location of the show was moved to the former Greenock Academy in Greenock, Scotland in 2012. The series focuses on the lives of the school's teachers and students, and confronts social issues such as extramarital affairs, abortion, divorce, child abuse, and suicide.\nWaterloo Road is produced by Shed Productions, the company responsible for Bad Girls and Footballers' Wives.", "rate": 56, "genre": ["Drama"], "cast": ["Nicola Stephenson", "Christopher Chung", "Georgie Glen", "Zöe Lucker", "Laurie Brett"], "character": ["Allie Westbrook", "Archie Wong", "Audrey McFall", "Carol Barry", "Christine Mulgrew"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2802   Expand Waterloo Road   (2006) User Score Overview Waterloo Road is a UK television drama series the first broadcast was in the United Kingdom on BBC One on 9 March 2006. Originally set in a troubled comprehensive school in Rochdale, England, the location of the show was moved to the former Greenock Academy in Greenock, Scotland in 2012. The series focuses on the lives of the school's teachers and students, and confronts social issues such as extramarital affairs, abortion, divorce, child abuse, and suicide. Waterloo Road is produced by Shed Productions, the company responsible for Bad Girls and Footballers' Wives. Featured Crew Ann McManus Creator Maureen Chadwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicola Stephenson Allie Westbrook Christopher Chung Archie Wong Georgie Glen Audrey McFall Zöe Lucker Carol Barry Laurie Brett Christine Mulgrew Full Cast & Crew Last Season Series 10 2014 | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Waterloo Road. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  52m, 60m Homepage   http://www.waterlooroad.co.uk/ Genres Drama Keywords high school northern england scotland teacher teenager high school teacher manchester Content Score 93 Almost there... Top Contributors 42 Elizabeth Jennings 19 rudely_murray 11 Banana TB 9 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}