{"link": "https://www.themoviedb.org/tv/62517?language=en", "title": "Zoo", "resume": "Set amidst a wave of violent animal attacks sweeping across the planet, a young renegade scientist is thrust into a race to unlock the mystery behind this pandemic before time runs out for animals and humans alike.", "rate": 59, "genre": ["Drama", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["James Wolk", "Nonso Anozie", "Billy Burke", "Kristen Connolly", "Josh Salatin"], "character": ["Jackson Oz", "Abraham Kenyatta", "Mitch Morgan", "Jamie Campbell", "Logan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62517   Expand Zoo   (2015) User Score  Play Trailer Overview Set amidst a wave of violent animal attacks sweeping across the planet, a young renegade scientist is thrust into a race to unlock the mystery behind this pandemic before time runs out for animals and humans alike. Featured Crew James Patterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  8 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Wolk Jackson Oz Nonso Anozie Abraham Kenyatta Billy Burke Mitch Morgan Kristen Connolly Jamie Campbell Josh Salatin Logan Full Cast & Crew Last Season Season 3 2017 | 13 Episodes Season 3 of Zoo premiered on June 29, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply *sighs* Another cliffhanger ending. (Spoilers) Open 0 by Heidi\n      \n     Guilty Pleasure Open 4 by  tuffysmom Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  7 Recommendations   2015-06-01 The Whispers 5.7    2015-05-14 Wayward Pines 6.5    2015-04-17 The Messengers 6.1    2014-01-11 Bitten 5.3    2014-03-10 Believe 6.3    2016-01-14 Colony 6.8    2014-07-13 The Strain 6.6    2015-06-14 Humans 7.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/zoo/ Genres Drama Action & Adventure Sci-Fi & Fantasy Keywords based on novel or book survival animal extinction pandemic Content Score 100 Yes! Looking good! Top Contributors 58 Elizabeth Jennings 53 Banana f 19 furkan-guven0115 w 13 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}