{"link": "https://www.themoviedb.org/tv/4347?language=en", "title": "All-American Girl", "resume": "All-American Girl is a 1994 ABC situation comedy starring Margaret Cho and featuring Jodi Long, Clyde Kusatsu, Amy Hill, B.D. Wong, and J.B. Quon as her Korean-American family.\nIt is the second American sitcom centered on a person of Asian descent, namely Cho.\nNotable guest stars during the run of the show include Oprah Winfrey, Jack Black, David Cross, Ming-Na, Vicki Lawrence, Quentin Tarantino, Tsai Chin, Mariska Hargitay, Billy Burke, Robert Clohessy and Garrett Wang.\nDiedrich Bader was a one time regular in the last episode of All American Girl, which was a pseudo pilot for a proposed but unrealized version of All American Girl, before achieving fame on The Drew Carey Show. On the DVD commentary for the series, Margaret Cho revealed that most of All American Girl's set furniture was reused by The Drew Carey Show.", "rate": 50, "genre": ["Comedy"], "cast": ["Clyde Kusatsu", "Ashley Johnson", "BD Wong", "Judy Gold", "Jodi Long"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4347   Expand All-American Girl   (1994) User Score Overview All-American Girl is a 1994 ABC situation comedy starring Margaret Cho and featuring Jodi Long, Clyde Kusatsu, Amy Hill, B.D. Wong, and J.B. Quon as her Korean-American family. It is the second American sitcom centered on a person of Asian descent, namely Cho. Notable guest stars during the run of the show include Oprah Winfrey, Jack Black, David Cross, Ming-Na, Vicki Lawrence, Quentin Tarantino, Tsai Chin, Mariska Hargitay, Billy Burke, Robert Clohessy and Garrett Wang. Diedrich Bader was a one time regular in the last episode of All American Girl, which was a pseudo pilot for a proposed but unrealized version of All American Girl, before achieving fame on The Drew Carey Show. On the DVD commentary for the series, Margaret Cho revealed that most of All American Girl's set furniture was reused by The Drew Carey Show. Featured Crew Margaret Cho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clyde Kusatsu Ashley Johnson BD Wong Judy Gold Jodi Long Full Cast & Crew Last Season Season 1 1994 | 19 Episodes Season 1 of All-American Girl premiered on September 14, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on All-American Girl. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 Zlogorek PS 1 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}