{"link": "https://www.themoviedb.org/tv/11710?language=en", "title": "Dinosaur Planet", "resume": "Dinosaur Planet, not to be confused with Planet Dinosaur, is a four-part American nature documentary first aired on Discovery Channel in 2003. It was hosted by Scott Sampson and narrated by Christian Slater.\nDinosaur Planet depicts dinosaurs living in various parts of the world 80 million years ago, using CGI. In actuality, a good part of the dinosaurs were designed by Mark Dubeau, who was the art director and primary creature designer on the aforementioned \"When Dinosaurs Roamed America\".", "rate": 68, "genre": ["Documentary"], "cast": ["Scott Sampson", "Christian Slater"], "character": ["Host", "Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11710   Expand Dinosaur Planet   (2003) User Score Overview Dinosaur Planet, not to be confused with Planet Dinosaur, is a four-part American nature documentary first aired on Discovery Channel in 2003. It was hosted by Scott Sampson and narrated by Christian Slater. Dinosaur Planet depicts dinosaurs living in various parts of the world 80 million years ago, using CGI. In actuality, a good part of the dinosaurs were designed by Mark Dubeau, who was the art director and primary creature designer on the aforementioned \"When Dinosaurs Roamed America\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scott Sampson Host Christian Slater Narrator (voice) Full Cast & Crew Last Season Season 1 2003 | 4 Episodes Season 1 of Dinosaur Planet premiered on December 14, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2011-09-14 Planet Dinosaur 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  48m Homepage  - Genres Documentary Keywords prehistoric miniseries dinosaur prehistoric creature prehistoric times Content Score 56 We're so close, yet so far. Top Contributors TB 16 TMDb Bot R 12 Rebecca G 6 Gaffer D 5 DracoAn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}