{"link": "https://www.themoviedb.org/tv/11849?language=en", "title": "The Powers of Matthew Star", "resume": "The Powers of Matthew Star is an American sci-fi television series that aired from September 17, 1982 through April 8, 1983, on NBC. It starred Peter Barton as the title character, alien prince Matthew ‘E’Hawke’ Star of the planet Quadris. Also starring were Amy Steel as Pam Elliot, Matthew’s girlfriend at Crestridge High, and Louis Gossett, Jr. as Matthew’s guardian Walt ‘D’hai’ Shepherd.\nIn 2002, The Powers of Matthew Star was ranked #22 on the list of TV Guide's \"50 Worst TV Shows of All Time\".", "rate": 60, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Peter Barton", "Louis Gossett, Jr.", "Amy Steel", "James Karen", "John Crawford"], "character": ["Matthew Star (E'Hawke)", "Walter \"Walt\" Shepherd (D'Hai)", "Pamela Elliot", "Major Wymore", "General Tucker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11849   Expand The Powers of Matthew Star   (1982) User Score Overview The Powers of Matthew Star is an American sci-fi television series that aired from September 17, 1982 through April 8, 1983, on NBC. It starred Peter Barton as the title character, alien prince Matthew ‘E’Hawke’ Star of the planet Quadris. Also starring were Amy Steel as Pam Elliot, Matthew’s girlfriend at Crestridge High, and Louis Gossett, Jr. as Matthew’s guardian Walt ‘D’hai’ Shepherd. In 2002, The Powers of Matthew Star was ranked #22 on the list of TV Guide's \"50 Worst TV Shows of All Time\". Featured Crew Harve Bennett Creator Steven E. de Souza Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Barton Matthew Star (E'Hawke) Louis Gossett, Jr. Walter \"Walt\" Shepherd (D'Hai) Amy Steel Pamela Elliot James Karen Major Wymore John Crawford General Tucker Full Cast & Crew Last Season Season 1 1982 | 22 Episodes Season 1 of The Powers of Matthew Star premiered on September 17, 1982. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Matthew Star: Happy Birthday Peter Barton! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Powers of Matthew Star. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Keywords alien alien teenager Content Score 93 Almost there... Top Contributors w 11 wonder2wonder 9 Banana CM 3 Cherche Moi 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}