{"link": "https://www.themoviedb.org/tv/4451?language=en", "title": "Filthy Rich & Catflap", "resume": "BBC sitcom starring former The Young Ones stars Nigel Planer, Rik Mayall and Adrian Edmondson as its three title characters respectively. It was written by Ben Elton with additional material credited to Mayall. One series of six half-hour episodes was produced (although the notion of a second series is played upon in the final episode, and the continuity announcer on the last installment says \"...and Filthy, Rich and Catflap will return next year.\" They didn't.)", "rate": 67, "genre": ["Comedy"], "cast": ["Nigel Planer", "Rik Mayall", "Adrian Edmondson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4451   Expand Filthy Rich & Catflap   (1987) User Score Overview BBC sitcom starring former The Young Ones stars Nigel Planer, Rik Mayall and Adrian Edmondson as its three title characters respectively. It was written by Ben Elton with additional material credited to Mayall. One series of six half-hour episodes was produced (although the notion of a second series is played upon in the final episode, and the continuity announcer on the last installment says \"...and Filthy, Rich and Catflap will return next year.\" They didn't.) Featured Crew Ben Elton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nigel Planer Rik Mayall Adrian Edmondson Full Cast & Crew Last Season Miniseries 1987 | 6 Episodes Season 1 of Filthy Rich & Catflap premiered on January  7, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2002-11-14 Harry Hill's TV Burp 7.2    1987-03-09 French & Saunders 7.4    1984-02-26 Spitting Image 7.8    1965-07-22 Till Death Us Do Part 7.2    1971-04-10 The Two Ronnies 9.0    1996-11-12 Never Mind the Buzzcocks 7.5    1994-11-04 Harry Enfield and Chums 7.8    1986-10-06 The Trap Door 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p009ssgb Genres Comedy Keywords dark comedy surreal satire celebrity breaking the fourth wall showbiz sitcom british humour Content Score 64 We're so close, yet so far. Top Contributors O 14 Ozbourne R 7 Rebecca e 2 egbertbos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}