{"link": "https://www.themoviedb.org/tv/4433?language=en", "title": "Queen of Swords", "resume": "Queen of Swords is an action–adventure television series set in California during the early 19th century that ran for one season, from 2000 to 2001.\nThe series premiered October 7, 2000. After filming had been completed on 22 episodes and the first eight episodes were broadcast, the series was canceled.", "rate": 0, "genre": ["Western", "Action", "Adventure"], "cast": ["Tessie Santiago", "Anthony Lemke", "Elsa Pataky", "Peter Wingfield", "Valentine Pelka"], "character": ["Maria Teresa Alvarado", "Capt. Marcus Grisham", "Vera Hidalgo", "Dr. Robert Helm", "Col. Luis Montoya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4433   Expand Queen of Swords   (2000) User Score  Play Trailer Overview Queen of Swords is an action–adventure television series set in California during the early 19th century that ran for one season, from 2000 to 2001. The series premiered October 7, 2000. After filming had been completed on 22 episodes and the first eight episodes were broadcast, the series was canceled. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tessie Santiago Maria Teresa Alvarado Anthony Lemke Capt. Marcus Grisham Elsa Pataky Vera Hidalgo Peter Wingfield Dr. Robert Helm Valentine Pelka Col. Luis Montoya Full Cast & Crew Last Season Season 1 2000 | 22 Episodes Season 1 of Queen of Swords premiered on October  7, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Queen of Swords. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Western Action & Adventure Keywords california strong woman latinx lead masked vigilante 19th century Content Score 93 Almost there... Top Contributors 12 Banana E 6 Edytor s 3 speedycars 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}