{"link": "https://www.themoviedb.org/tv/8297?language=en", "title": "The Philanthropist", "resume": "The Philanthropist is an American action drama series that premiered on NBC on Wednesday, June 24, 2009. The program was a limited summer series, principally filmed in South Africa. It opened to strong ratings, but saw a drop in viewers in subsequent weeks. The Philanthropist is a Carnival Films production in association with The Levinson/Fontana Company and Original Media. Tom Fontana, Barry Levinson, Peter Horton, Charlie Corwin, Gareth Neame, and Teri Weinberg served as executive producers.\nOn October 21, 2009, the series was canceled by NBC. Fans attempts to keep the show on the air using Facebook and a charitable cause called \"Save The Philanthropist through Charity\" were unsuccessful.", "rate": 80, "genre": ["Action", "Adventure", "Drama"], "cast": ["James Purefoy", "Neve Campbell", "Michael Kenneth Williams", "Lindy Booth", "Jesse L. Martin"], "character": ["Olivia Maidstone", "Philip Maidstone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8297   Expand The Philanthropist   (2009) User Score  Play Trailer Overview The Philanthropist is an American action drama series that premiered on NBC on Wednesday, June 24, 2009. The program was a limited summer series, principally filmed in South Africa. It opened to strong ratings, but saw a drop in viewers in subsequent weeks. The Philanthropist is a Carnival Films production in association with The Levinson/Fontana Company and Original Media. Tom Fontana, Barry Levinson, Peter Horton, Charlie Corwin, Gareth Neame, and Teri Weinberg served as executive producers. On October 21, 2009, the series was canceled by NBC. Fans attempts to keep the show on the air using Facebook and a charitable cause called \"Save The Philanthropist through Charity\" were unsuccessful. Featured Crew Tom Fontana Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Purefoy Neve Campbell Olivia Maidstone Michael Kenneth Williams Lindy Booth Jesse L. Martin Philip Maidstone Full Cast & Crew Last Season Season 1 2009 | 8 Episodes Season 1 of The Philanthropist premiered on June 24, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Philanthropist. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords billionaire good deed wealthy man traveller Content Score 100 Yes! Looking good! Top Contributors 18 Banana s 5 stheven w 4 webmaster i 4 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}