{"link": "https://www.themoviedb.org/tv/34250?language=en", "title": "A Recipe for the Heart", "resume": "A Recipe for the Heart is a 1997 TVB drama series.\nIn 2005, the series aired repeated episodes throughout Monday to Friday at 10:45 AM to 11:45 AM.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Lydia Shum", "Jessica Hsuan", "Bobby Au-Yeung", "Maggie Cheung Hoh-Yee", "Paul Chun"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34250   Expand A Recipe for the Heart   (1997) User Score Overview A Recipe for the Heart is a 1997 TVB drama series. In 2005, the series aired repeated episodes throughout Monday to Friday at 10:45 AM to 11:45 AM. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lydia Shum Jessica Hsuan Bobby Au-Yeung Maggie Cheung Hoh-Yee Paul Chun Full Cast & Crew Last Season Season 1 1997 | 29 Episodes Season 1 of A Recipe for the Heart premiered on November 10, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Recipe for the Heart. You can help by rating TV shows you've seen. Facts Original Name  美味天王 Status  Ended Network Certification  - Type  Scripted Original Language  Cantonese Runtime  60m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 4 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}