{"link": "https://www.themoviedb.org/tv/2241?language=en", "title": "Exit 57", "resume": "Exit 57 was a 30-minute sketch comedy series that aired on the American television channel Comedy Central from 1995 to 1996; its cast was composed of comedians Amy Sedaris, Paul Dinello, Stephen Colbert, Jodi Lennon, and Mitch Rouse, all of whom had previously studied improv at The Second City in Chicago. In 1999 Sedaris, Dinello, Colbert and Rouse would also create the Comedy Central show \"Strangers with Candy\".\nHumorist David Sedaris also served as an additional writer for the series, sharing a single onscreen credit with his sister as \"The Talent Family\". The show's producer, Joe Forristal, had also served as executive producer for The Kids in the Hall.\nAll of the sketches in the series are implied to take place in the fictional suburban setting of the Quad Cities. During the show's memorably cryptic opening sequence, the cast members are seen standing next to a broken down car on the highway. Soon they are picked up by a passing driver, who changes the radio station at the mention of a serial killer, and takes Polaroid pictures of his increasingly uncomfortable passengers. Growing suspicious, the cast demands to be let out. The car is then seen pulling off the highway at Exit 57.", "rate": 90, "genre": ["Comedy"], "cast": ["Paul Dinello", "Stephen Colbert", "Amy Sedaris", "Mitch Rouse"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2241   Expand Exit 57 User Score Overview Exit 57 was a 30-minute sketch comedy series that aired on the American television channel Comedy Central from 1995 to 1996; its cast was composed of comedians Amy Sedaris, Paul Dinello, Stephen Colbert, Jodi Lennon, and Mitch Rouse, all of whom had previously studied improv at The Second City in Chicago. In 1999 Sedaris, Dinello, Colbert and Rouse would also create the Comedy Central show \"Strangers with Candy\". Humorist David Sedaris also served as an additional writer for the series, sharing a single onscreen credit with his sister as \"The Talent Family\". The show's producer, Joe Forristal, had also served as executive producer for The Kids in the Hall. All of the sketches in the series are implied to take place in the fictional suburban setting of the Quad Cities. During the show's memorably cryptic opening sequence, the cast members are seen standing next to a broken down car on the highway. Soon they are picked up by a passing driver, who changes the radio station at the mention of a serial killer, and takes Polaroid pictures of his increasingly uncomfortable passengers. Growing suspicious, the cast demands to be let out. The car is then seen pulling off the highway at Exit 57. Featured Crew Paul Dinello Creator Mitch Rouse Creator Amy Sedaris Creator Stephen Colbert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Dinello Stephen Colbert Amy Sedaris Mitch Rouse Full Cast & Crew Last Season Season 2 — | 8 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors f 5 flickfreak TB 3 TMDb Bot D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}