{"link": "https://www.themoviedb.org/tv/62576?language=en", "title": "LEGO MARVEL Super Heroes: Maximum Overload", "resume": "Spider-Man and Marvel's Super Heroes take on a mischievous Loki and a team of super villains in an all-new LEGO adventure.", "rate": 65, "genre": ["Animation", "Kids"], "cast": ["Laura Bailey", "Dee Bradley Baker", "Troy Baker", "Drake Bell", "Greg Cipes"], "character": ["Black Widow (voice)", "Venom / Chitauri (voice)", "Loki (voice)", "Spider-Man (voice)", "Iron Fist (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62576   Expand LEGO MARVEL Super Heroes: Maximum Overload   (2013) User Score Overview Spider-Man and Marvel's Super Heroes take on a mischievous Loki and a team of super villains in an all-new LEGO adventure. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Bailey Black Widow (voice) Dee Bradley Baker Venom / Chitauri (voice) Troy Baker Loki (voice) Drake Bell Spider-Man (voice) Greg Cipes Iron Fist (voice) Full Cast & Crew Last Season Season 1 2013 | 5 Episodes Season 1 of LEGO MARVEL Super Heroes: Maximum Overload premiered on November  5, 2013. View All Seasons Social Reviews  1 Discussions  0 G A review by Gimly  2.0 Written by  Gimly  on April  4, 2017 A bizarre Marvel/LEGO skitshow with seemingly no point or original content. I don't expect much from this sort of thing (advertising material) but even for the format this was particularly odd. Final rating:★ - Of no value. Read All Reviews Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on LEGO MARVEL Super Heroes: Maximum Overload. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage  - Genres Animation Kids Keywords superhero based on comic lego Content Score 86 Almost there... Top Contributors 61 Marr 🇳🇱 R 50 RicoT 6 Elizabeth Jennings e 3 error666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}