{"link": "https://www.themoviedb.org/tv/1021?language=en", "title": "Casualty", "resume": "Casualty, stylised as CASUAL+Y, is a British medical drama television series that airs weekly on BBC One, and the longest-running emergency medical drama television series in the world. Created by Jeremy Brock and Paul Unwin, it was first broadcast on 6 September 1986, and transmitted in the UK on BBC One. The original producer was Geraint Morris.\nThe programme is based around the fictional Holby City Hospital and focuses on the staff and patients of the hospital's Accident and Emergency Department. The show has very few ties to its sister programme Holby City which began as a spin off from Casualty in 1999 and is set in the same hospital, but upstairs. The show's plots and characters occasionally crossover between the two programmes, but this is rare, and each show can easily be followed without having to watch the other. Casualty is shown weekly on a Saturday evening, which has been its time slot since the early 1990s.", "rate": 42, "genre": ["Drama"], "cast": ["Derek Thompson", "Lloyd Everitt", "Catherine Shipton", "Amanda Mealing", "George Rainsford"], "character": ["Charlie Fairhead", "Jez Andrews", "Lisa 'Duffy' Duffin", "Connie Beauchamp", "Ethan Hardy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1021   Expand Casualty   (1986) User Score Overview Casualty, stylised as CASUAL+Y, is a British medical drama television series that airs weekly on BBC One, and the longest-running emergency medical drama television series in the world. Created by Jeremy Brock and Paul Unwin, it was first broadcast on 6 September 1986, and transmitted in the UK on BBC One. The original producer was Geraint Morris. The programme is based around the fictional Holby City Hospital and focuses on the staff and patients of the hospital's Accident and Emergency Department. The show has very few ties to its sister programme Holby City which began as a spin off from Casualty in 1999 and is set in the same hospital, but upstairs. The show's plots and characters occasionally crossover between the two programmes, but this is rare, and each show can easily be followed without having to watch the other. Casualty is shown weekly on a Saturday evening, which has been its time slot since the early 1990s. Featured Crew Paul Unwin Creator Jeremy Brock Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Thompson Charlie Fairhead Lloyd Everitt Jez Andrews Catherine Shipton Lisa 'Duffy' Duffin Amanda Mealing Connie Beauchamp George Rainsford Ethan Hardy Full Cast & Crew Last Season Series 32 2017 | 14 Episodes Season 32 of Casualty premiered on August 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1999-01-12 Holby City 6.0    2011-07-04 Pointless Celebrities 7.5    1982-11-02 Countdown 5.4    1981-12-24 The Kenny Everett Television Show 7.0    1983-09-22 Just Good Friends 6.4    2005-02-21 Masterchef Goes Large 4.8    1998-09-04 Who Wants to Be a Millionaire? 6.1    Match of the Day 2 5.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b006m8wd Genres Drama Keywords england hospital doctor medical drama Content Score 100 Yes! Looking good! Top Contributors 372 rudely_murray 64 Markxist 59 Elizabeth Jennings 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}