{"link": "https://www.themoviedb.org/tv/77772?language=en", "title": "Mary & Mike", "resume": "Mary and Mike are a couple of elite agents from the Chilean secret police, DINA. Their job is to eliminate opposition leaders who from abroad articulate resistance to the fierce military dictatorship of Augusto Pinochet. In her public life, Mary is a writer and she relates with the most outstanding members of Santiago's cultural life. Mike, is a talented \"gringo\" for electronics. They live with their children Cony and Simon in the suburbs of Santiago where they tend to give crowded parties. But as they celebrate, in the backyard of their home they torture, murder and experiment with weapons of mass destruction.", "rate": 80, "genre": ["Drama", "Crime"], "cast": ["Mariana Loyola", "Andrés Rillón", "Consuelo Carreño", "Elías Collado", "Alejandro Goic"], "character": ["Mariana \"Mary\" Callejas", "Michael \"Mike\" Townley", "Cony", "Simón", "Enrique Subercaseaux"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77772   Expand Mary & Mike   (2018) User Score  Play Trailer Overview Mary and Mike are a couple of elite agents from the Chilean secret police, DINA. Their job is to eliminate opposition leaders who from abroad articulate resistance to the fierce military dictatorship of Augusto Pinochet. In her public life, Mary is a writer and she relates with the most outstanding members of Santiago's cultural life. Mike, is a talented \"gringo\" for electronics. They live with their children Cony and Simon in the suburbs of Santiago where they tend to give crowded parties. But as they celebrate, in the backyard of their home they torture, murder and experiment with weapons of mass destruction. Featured Crew Julio Cortés Creator Esteban Larraín Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariana Loyola Mariana \"Mary\" Callejas Andrés Rillón Michael \"Mike\" Townley Consuelo Carreño Cony Elías Collado Simón Alejandro Goic Enrique Subercaseaux Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Mary & Mike premiered on March  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mary & Mike. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  Spanish; Castilian Runtime  52m Homepage   http://www.chilevision.cl/mary-and-mike/ Genres Drama Crime Keywords based on a true story parenthood agent military dictatorship communism Content Score 100 Yes! Looking good! Top Contributors 69 Mikedeth5 4 Elizabeth Jennings TB 3 TMDb Bot 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}