{"link": "https://www.themoviedb.org/tv/72706?language=en", "title": "Fugitive Boys", "resume": "Tobio Masubuchi and his friends are ordinary high school students. Due to an incident, their peaceful days are about to change. Tobio’s friends are beaten by students from another high school in their neighborhood. Tobio and his friends scheme to get back the students from the other school. The day they are to carry out their plan, they see the other high school engulfed in flames. Tobio and his friends become suspects.", "rate": 0, "genre": ["Crime"], "cast": ["Masataka Kubota", "Mei Nagano", "Mackenyu Arata", "Shotaro Mamiya", "Shono Hayama"], "character": ["Tobio Masubuchi", "Renko Aokawa", "Tetsuto Ichihashi", "Sho Isami", "Yuki Maruyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72706   Expand Fugitive Boys   (2017) User Score Overview Tobio Masubuchi and his friends are ordinary high school students. Due to an incident, their peaceful days are about to change. Tobio’s friends are beaten by students from another high school in their neighborhood. Tobio and his friends scheme to get back the students from the other school. The day they are to carry out their plan, they see the other high school engulfed in flames. Tobio and his friends become suspects. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masataka Kubota Tobio Masubuchi Mei Nagano Renko Aokawa Mackenyu Arata Tetsuto Ichihashi Shotaro Mamiya Sho Isami Shono Hayama Yuki Maruyama Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Fugitive Boys premiered on July 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fugitive Boys. You can help by rating TV shows you've seen. Facts Original Name  僕たちがやりました Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   https://www.ktv.jp/bokuyari/index.html Genres Crime Keywords japan suspense Content Score 86 Almost there... Top Contributors M 40 Maria180493 w 6 woogoldsgreat  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}