{"link": "https://www.themoviedb.org/tv/36587?language=en", "title": "Our Home's Fox Deity", "resume": "Our Home's Fox Deity. is a Japanese light novel series by Jin Shibamura, with illustrations by Eizō Hōden. The first novel was released in February 2004, and as of October 2007, seven volumes have been published by ASCII Media Works under their Dengeki Bunko imprint. A manga adaptation by Suiren Shōfū started serialization in MediaWorks' Dengeki Comic Gao! magazine in February 2007; the manga transferred to ASCII Media Works Dengeki Daioh in April 2008 after the former was discontinued in February 2008. A 24-episode anime adaptation, produced by Zexcs, aired in Japan between April and September 2008. NIS America licensed the anime series under the title Our Home's Fox Deity. released it in North America.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Saori Hayami", "Masumi Asano", "Rie Kugimiya", "Yuu Asakawa", "Yukana"], "character": ["Kō", "Bekira", "Tsukuyomi", "Enju", "Kūgen Tenko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36587   Expand Our Home's Fox Deity   (2008) User Score Overview Our Home's Fox Deity. is a Japanese light novel series by Jin Shibamura, with illustrations by Eizō Hōden. The first novel was released in February 2004, and as of October 2007, seven volumes have been published by ASCII Media Works under their Dengeki Bunko imprint. A manga adaptation by Suiren Shōfū started serialization in MediaWorks' Dengeki Comic Gao! magazine in February 2007; the manga transferred to ASCII Media Works Dengeki Daioh in April 2008 after the former was discontinued in February 2008. A 24-episode anime adaptation, produced by Zexcs, aired in Japan between April and September 2008. NIS America licensed the anime series under the title Our Home's Fox Deity. released it in North America. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saori Hayami Kō Masumi Asano Bekira Rie Kugimiya Tsukuyomi Yuu Asakawa Enju Yukana Kūgen Tenko Full Cast & Crew Last Season Wagaya no oinarisama season 1 2008 | 24 Episodes Season 1 of Our Home's Fox Deity premiered on April  4, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Our Home's Fox Deity. You can help by rating TV shows you've seen. Facts Original Name  我が家のお稲荷さま. Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://anime.webnt.jp/oinarisama/ Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors k 8 kangcs74 5 sp1ti 3 yoshizuka m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}