{"link": "https://www.themoviedb.org/tv/34135?language=en", "title": "神様家族", "resume": "Kamisama Kazoku is an anime series based on a series of light novels by Yoshikazu Kuwashima, which premiered May 18, 2006 in Japan across the anime satellite television network Animax. The original light novel series has concluded with 8 volumes; however, a sequel light novel series titled Kamisama Kazoku Z was released on January 25, 2008.", "rate": 60, "genre": ["Animation"], "cast": ["Ami Koshimizu", "Mamiko Noto", "Tomoko Kaneda", "Akemi Kanda", "Daisuke Kishio"], "character": ["Tenko Kamiyama", "Ai Tachibana", "Lulu", "Meme Kamiyama", "Samatarou Kamiyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34135   Expand 神様家族   (2006) User Score Overview Kamisama Kazoku is an anime series based on a series of light novels by Yoshikazu Kuwashima, which premiered May 18, 2006 in Japan across the anime satellite television network Animax. The original light novel series has concluded with 8 volumes; however, a sequel light novel series titled Kamisama Kazoku Z was released on January 25, 2008. Featured Crew Yoshikazu Kuwashima Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ami Koshimizu Tenko Kamiyama Mamiko Noto Ai Tachibana Tomoko Kaneda Lulu Akemi Kanda Meme Kamiyama Daisuke Kishio Samatarou Kamiyama Full Cast & Crew Last Season Season 1 2006 | 13 Episodes Season 1 of 神様家族 premiered on May 17, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 神様家族. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.toei-anim.co.jp/tv/kamisama/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 Levi Seguel m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}