{"link": "https://www.themoviedb.org/tv/1746?language=en", "title": "Chewin' the Fat", "resume": "Chewin' the Fat is a Scottish comedy sketch show, starring Ford Kiernan, Greg Hemphill and Karen Dunbar. Comedians Paul Riley and Mark Cox also appeared regularly on the show.\nChewin' the Fat first started as a radio series on BBC Radio Scotland. The later television show, which ran for four series, was first broadcast on BBC One Scotland, but series three and four, as well as highlights from the first two series, were later broadcast to the rest of the United Kingdom. Although the last series ended in February 2002, 6 Hogmanay specials were broadcast and offered on DVD when purchasing the Scottish Sun between 2000 to 2005, one every year.\nChewin' the Fat gave rise to the spin-off show Still Game, a sitcom focusing on the two old male characters Jack and Victor.\nThe series was mostly filmed in and around Glasgow and occasionally West Dunbartonshire.\nThe English idiom to chew the fat means to chat casually, but thoroughly, about subjects of mutual interest.", "rate": 82, "genre": ["Comedy"], "cast": ["Karen Dunbar", "Ford Kiernan", "Julie Wilson Nimmo", "Gordon McCorkell", "Mark Cox"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1746   Expand Chewin' the Fat   (1999) User Score Overview Chewin' the Fat is a Scottish comedy sketch show, starring Ford Kiernan, Greg Hemphill and Karen Dunbar. Comedians Paul Riley and Mark Cox also appeared regularly on the show. Chewin' the Fat first started as a radio series on BBC Radio Scotland. The later television show, which ran for four series, was first broadcast on BBC One Scotland, but series three and four, as well as highlights from the first two series, were later broadcast to the rest of the United Kingdom. Although the last series ended in February 2002, 6 Hogmanay specials were broadcast and offered on DVD when purchasing the Scottish Sun between 2000 to 2005, one every year. Chewin' the Fat gave rise to the spin-off show Still Game, a sitcom focusing on the two old male characters Jack and Victor. The series was mostly filmed in and around Glasgow and occasionally West Dunbartonshire. The English idiom to chew the fat means to chat casually, but thoroughly, about subjects of mutual interest. Featured Crew Ford Kiernan Creator Greg Hemphill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karen Dunbar Ford Kiernan Julie Wilson Nimmo Gordon McCorkell Mark Cox Full Cast & Crew Last Season Season 4 2002 | 6 Episodes Season 4 of Chewin' the Fat premiered on January 18, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2009-02-25 Burnistoun 7.8    2008-10-20 Danny Dyer's Deadliest Men 7.0    2015-06-12 Conspiracy 5.7    2002-09-06 Still Game 8.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}