{"link": "https://www.themoviedb.org/tv/18203?language=en", "title": "Madventures", "resume": "Riku and Tunna travel around the globe on a shoestring budget, carrying nothing but their backpacks and a camera, on a quest to reveal the most bizarre and dangerous secrets of the planet. No crew, no security, no limits.", "rate": 77, "genre": ["Documentary"], "cast": ["Riku Rantala", "Tuomas Milonoff"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18203   Expand Madventures   (2002) User Score Overview Riku and Tunna travel around the globe on a shoestring budget, carrying nothing but their backpacks and a camera, on a quest to reveal the most bizarre and dangerous secrets of the planet. No crew, no security, no limits. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Riku Rantala Himself Tuomas Milonoff Himself Full Cast & Crew Last Season Season 3 2009 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Madventures. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2009-03-23 Kill Arman 8.3    1991-06-07 Kummeli 9.5    2005-09-19 Surface 6.6    2006-10-27 Man vs. Wild 6.9  Facts Status  Ended Networks Certification  - Type  Documentary Original Language  Finnish Runtime  45m Homepage   http://www.madventures.tv/ Genres Documentary Keywords cooking travel food culture Content Score 56 We're so close, yet so far. Top Contributors 40 BryGur 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}