{"link": "https://www.themoviedb.org/tv/35129?language=en", "title": "Popotan", "resume": "Beautiful sisters Ai, Mai, Mii, their android maid Mea and slippery pet ferret Unagi make an amazing journey together through time and space without ever leaving their beloved mansion behind! Following the clues of the strange dandelion-like \"Popotan,\" the girls are theoretically seeking the person who has the answers to their most personal questions, but they seem to have more than enough time to take side trips, meet new friends, visit hot springs and occasionally operate the X-mas shop they keep in the house along the way!\nYet, the girls' ultimate destiny holds more than a few surprises of its own, and not every moment is filled with hilarity, as moving through time means having to leave friends behind as well.", "rate": 90, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Haruko Momoi", "Masumi Asano", "Mai Kadowaki", "Ayako Kawasumi", "Rumi Shishido"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35129   Expand Popotan   (2003) User Score Overview Beautiful sisters Ai, Mai, Mii, their android maid Mea and slippery pet ferret Unagi make an amazing journey together through time and space without ever leaving their beloved mansion behind! Following the clues of the strange dandelion-like \"Popotan,\" the girls are theoretically seeking the person who has the answers to their most personal questions, but they seem to have more than enough time to take side trips, meet new friends, visit hot springs and occasionally operate the X-mas shop they keep in the house along the way! Yet, the girls' ultimate destiny holds more than a few surprises of its own, and not every moment is filled with hilarity, as moving through time means having to leave friends behind as well. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruko Momoi Masumi Asano Mai Kadowaki Ayako Kawasumi Rumi Shishido Full Cast & Crew Last Season Season 1 2003 | 12 Episodes Season 1 of Popotan premiered on July 17, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Popotan. You can help by rating TV shows you've seen. Facts Original Name  ぽぽたん Status  Ended Network BS-i Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Scripted Original Language  Japanese Runtime  25m Homepage   https://www.bandaivisual.co.jp/popotan/ Genres Animation Comedy Sci-Fi & Fantasy Keywords anime Content Score 86 Almost there... Top Contributors 20 greenglass 15 BrerFox m 3 magoozin TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}