{"link": "https://www.themoviedb.org/tv/34747?language=en", "title": "Kaiba", "resume": "Kaiba is an anime series directed by Masaaki Yuasa that debuted on the WOWOW satellite network in Spring 2008. Animation is by Madhouse and it is described as a sci-fi love story.\nThe series received an Excellence Prize for animation at the 2008 Japan Media Arts Festival.", "rate": 80, "genre": ["Animation"], "cast": ["Houko Kuwashima", "Mamiko Noto", "Romi Park", "Hisao Egawa", "Wasabi Mizuta"], "character": ["Kaiba", "Neiro", "Popo", "Vanilla", "Hyo-Hyo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34747   Expand Kaiba   (2008) User Score Overview Kaiba is an anime series directed by Masaaki Yuasa that debuted on the WOWOW satellite network in Spring 2008. Animation is by Madhouse and it is described as a sci-fi love story. The series received an Excellence Prize for animation at the 2008 Japan Media Arts Festival. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Houko Kuwashima Kaiba Mamiko Noto Neiro Romi Park Popo Hisao Egawa Vanilla Wasabi Mizuta Hyo-Hyo Full Cast & Crew Last Season Season 1 2008 | 12 Episodes Season 1 of Kaiba premiered on April 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2014-04-11 Ping Pong the Animation 8.4    2003-04-19 Texhnolyze 6.8    2010-04-22 The Tatami Galaxy 8.7    2006-07-09 Welcome to the N.H.K. 8.5    2004-02-03 Paranoia Agent 7.8    2007-07-27 Baccano! 8.4    2004-04-06 Monster 7.7    2011-01-07 Puella Magi Madoka Magica 7.9  Facts Original Name  カイバ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.wowow.co.jp/anime/kaiba Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 turnkit 3 seboseboss m 3 magoozin m 3 morrison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}