{"link": "https://www.themoviedb.org/tv/14658?language=en", "title": "Survivor", "resume": "A reality show contest where sixteen or more castaways split between two or more “Tribes” are taken to a remote isolated location and are forced to live off the land with meager supplies for roughly 39 days. Frequent physical challenges are used to pit the tribes against each other for rewards, such as food or luxuries, or for “Immunity”, forcing the other tribe to attend “Tribal Council”, where they must vote off one of their players.", "rate": 64, "genre": ["Reality"], "cast": ["Jeff Probst"], "character": ["Host / Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14658   Expand Survivor   (2000) User Score  Play Trailer Overview A reality show contest where sixteen or more castaways split between two or more “Tribes” are taken to a remote isolated location and are forced to live off the land with meager supplies for roughly 39 days. Frequent physical challenges are used to pit the tribes against each other for rewards, such as food or luxuries, or for “Immunity”, forcing the other tribe to attend “Tribal Council”, where they must vote off one of their players. Featured Crew Charlie Parsons Creator Mark Burnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  27 Content Issues  0 Images Backdrops  22 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Probst Host / Himself Full Cast & Crew Current Season Ghost Island 2018 | 15 Episodes Season 36 of Survivor premiered on February 28, 2018. View All Seasons Social Reviews  0 Discussions  27 Subject Status Replies Last Reply Ghost Island Open 23 by  Poetist I hate when producers fix it so they get the winner they want Open 7 by  jonnieblack This season has been really entertaining Open 0 by Jessica\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  22 Posters  4 Recommendations   2001-09-05 The Amazing Race 6.4    2004-01-08 The Celebrity Apprentice 4.2    2010-12-01 Storage Wars 5.3    1989-08-20 Saved by the Bell 6.2    2005-06-01 Dancing with the Stars 4.8    2005-04-12 Deadliest Catch 6.6    2002-06-11 American Idol 4.4    2004-12-01 Project Runway 5.0  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/survivor/ Genres Reality Keywords reality competition survival competition Content Score 71 Just a little bit more... Top Contributors 385 dbowman 38 Elizabeth Jennings 19 thecrgs TB 17 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}