{"link": "https://www.themoviedb.org/tv/5238?language=en", "title": "Holland's Next Top Model", "resume": "Holland's Next Top Model is a Dutch reality television show hosted by writer and former model Daphne Deckers, who also serves as the lead judge. The first \"cycle\" premiered in September 2006 and was one of RTL5's highest rated shows, which is based on the series America's Next Top Model with Tyra Banks. On July 24, 2012, RTL5 announced they would not broadcast a new season.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5238   Expand Holland's Next Top Model   (2006) User Score Overview Holland's Next Top Model is a Dutch reality television show hosted by writer and former model Daphne Deckers, who also serves as the lead judge. The first \"cycle\" premiered in September 2006 and was one of RTL5's highest rated shows, which is based on the series America's Next Top Model with Tyra Banks. On July 24, 2012, RTL5 announced they would not broadcast a new season. Featured Crew Tyra Banks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2016 | 2 Episodes Season 9 of Holland's Next Top Model premiered on August 30, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Holland's Next Top Model. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.rtl.nl/reality/hollandsnexttopmodel/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors AS 4 Anueta Sulivan A 1 Agnes23 s 1 suka 1 reiru12361  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}