{"link": "https://www.themoviedb.org/tv/2565?language=en", "title": "In Loving Memory", "resume": "In Loving Memory is a British period sitcom set in an undertakers business that starred Thora Hird and Christopher Beeny. A pilot was transmitted in 1969 by Thames Television who rejected the idea before it was finally accepted by Yorkshire Television in 1979 where it further ran for five series between until 1986.", "rate": 77, "genre": ["Comedy"], "cast": ["Thora Hird", "Christopher Beeny", "Avis Bunnage", "Liz Smith", "Paul Luty"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2565   Expand In Loving Memory   (1969) User Score Overview In Loving Memory is a British period sitcom set in an undertakers business that starred Thora Hird and Christopher Beeny. A pilot was transmitted in 1969 by Thames Television who rejected the idea before it was finally accepted by Yorkshire Television in 1979 where it further ran for five series between until 1986. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thora Hird Christopher Beeny Avis Bunnage Liz Smith Paul Luty Full Cast & Crew Last Season Season 5 1986 | 7 Episodes Season 5 of In Loving Memory premiered on February 13, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In Loving Memory. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords undertaker sitcom british humour period sitcom Content Score 71 Just a little bit more... Top Contributors 8 rpeters O 8 Ozbourne 1 TopKek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}