{"link": "https://www.themoviedb.org/tv/10124?language=en", "title": "Full Frontal", "resume": "Full Frontal was an Australian sketch comedy series which debuted in 1993. The show first aired on the Seven Network on 13 May 1993, and finished on 18 September 1997.\nIn 1998 a spin-off of the show moved to Network Ten under the name Totally Full Frontal, losing most of the original cast in the process and finished in 1999.\nSince 2008, re-runs have begun screening on The Comedy Channel as part of the channel's \"Aussie Gold\" block of locally made, classic comedy programming.", "rate": 0, "genre": ["Comedy"], "cast": ["Gina Riley", "Kym Gyngell", "Jane Turner", "Julia Morris", "Shaun Micallef"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10124   Expand Full Frontal   (1993) User Score Overview Full Frontal was an Australian sketch comedy series which debuted in 1993. The show first aired on the Seven Network on 13 May 1993, and finished on 18 September 1997. In 1998 a spin-off of the show moved to Network Ten under the name Totally Full Frontal, losing most of the original cast in the process and finished in 1999. Since 2008, re-runs have begun screening on The Comedy Channel as part of the channel's \"Aussie Gold\" block of locally made, classic comedy programming. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gina Riley Kym Gyngell Jane Turner Julia Morris Shaun Micallef Full Cast & Crew Last Season Season 1 1993 | 18 Episodes Season 1 of Full Frontal premiered on May 13, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Full Frontal. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords sketch comedy Content Score 86 Almost there... Top Contributors 4 Banana f 1 flegros8  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}