{"link": "https://www.themoviedb.org/tv/73386?language=en", "title": "Burning Ice", "resume": "To protect the woman he loves, a white collar worker unintentionally becomes involved in a murder case and is from then on a suspect. In the blink of an eye, his quiet and boring life gets completely shaken up as he suddenly is both being chased by the police as well as gangsters.", "rate": 0, "genre": ["Drama", "Crime"], "cast": ["Qin Hao", "Deng Jiajia", "Yao Lu", "Xu Dai"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73386   Expand Burning Ice   (2017) User Score  Play Trailer Overview To protect the woman he loves, a white collar worker unintentionally becomes involved in a murder case and is from then on a suspect. In the blink of an eye, his quiet and boring life gets completely shaken up as he suddenly is both being chased by the police as well as gangsters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Qin Hao Deng Jiajia Yao Lu Xu Dai Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Burning Ice premiered on September  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Burning Ice. You can help by rating TV shows you've seen. Facts Original Name  无证之罪 Status  In Production Network Certification  - Type  Scripted Original Language  Chinese Runtime  55m Homepage  - Genres Drama Crime Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 23 Wendy 4 Elizabeth Jennings G 4 Giaten 3 ssmol  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}