{"link": "https://www.themoviedb.org/tv/2127?language=en", "title": "¿Qué Pasa, USA?", "resume": "¿Qué Pasa, U.S.A.? is America's first bilingual situation comedy, and the first sitcom to be produced for PBS. It was produced and taped in front of a live studio audience at PBS member station WPBT in Miami, Florida and aired on PBS member stations nationwide. The program explored the trials and tribulations faced by the Peñas, a Cuban-American family living in Miami's Little Havana neighborhood, as they struggled to cope with a new country and a new language. The series was praised as being very true-to-life and accurately, if humorously, portraying the life and culture of Miami's Cuban-American population.", "rate": 80, "genre": ["Comedy"], "cast": ["Luis G. Oquendo", "Steven Bauer", "Connie Ramirez"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2127   Expand ¿Qué Pasa, USA? User Score Overview ¿Qué Pasa, U.S.A.? is America's first bilingual situation comedy, and the first sitcom to be produced for PBS. It was produced and taped in front of a live studio audience at PBS member station WPBT in Miami, Florida and aired on PBS member stations nationwide. The program explored the trials and tribulations faced by the Peñas, a Cuban-American family living in Miami's Little Havana neighborhood, as they struggled to cope with a new country and a new language. The series was praised as being very true-to-life and accurately, if humorously, portraying the life and culture of Miami's Cuban-American population. Featured Crew WPBT Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luis G. Oquendo Steven Bauer Connie Ramirez Full Cast & Crew Last Season ? season 4 — | 10 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.quepasausa.org Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}