{"link": "https://www.themoviedb.org/tv/1072?language=en", "title": "Scooby's All-Star Laff-A-Lympics", "resume": "Scooby's All-Star Laff-A-Lympics was a two-hour programming block of Saturday morning animated series produced by Hanna-Barbera Productions. Running from September 10, 1977 to September 2, 1978 on ABC, the block featured five Hanna-Barbera series among its segments: The Scooby-Doo Show, Laff-a-Lympics, The Blue Falcon & Dynomutt, Captain Caveman and the Teen Angels, and reruns of Scooby-Doo, Where are You!.\nFor the 1978–1979 season, the show was reduced to 90 minutes and re-titled Scooby's All-Stars. This season aired from September 9, 1978 to September 8, 1979 on ABC.\nEach week's program included six cartoon segments:\n⁕Captain Caveman and the Teen Angels: Comedy/mystery show about three teenage detectives and their companion, a prehistoric caveman superhero thawed from a block of ice. Sixteen episodes were produced.\n⁕Laff-a-Lympics: Based on Battle of the Network Stars, this series featured 45 Hanna-Barbera characters, including Scooby-Doo, Yogi Bear, Mumbly, and others competing in Olympics-styled events. Thirty-two episodes were produced.\n⁕The Scooby-Doo Show: Comedy/mystery show about four teenage detectives and their talking dog, Scooby-Doo. Eight first-run episodes were produced for the 1977-78 season, with 16 from 1976-77 rerun following the final first-run episode. Two of the new episodes, as well as two others from 1976–77, feature Scooby-Doo's cousin Scooby-Dum as a recurring character.", "rate": 85, "genre": ["Animation"], "cast": ["Mel Blanc", "Casey Kasem", "Don Messick", "Daws Butler", "Frank Welker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1072   Expand Scooby's All-Star Laff-A-Lympics   (1977) User Score Overview Scooby's All-Star Laff-A-Lympics was a two-hour programming block of Saturday morning animated series produced by Hanna-Barbera Productions. Running from September 10, 1977 to September 2, 1978 on ABC, the block featured five Hanna-Barbera series among its segments: The Scooby-Doo Show, Laff-a-Lympics, The Blue Falcon & Dynomutt, Captain Caveman and the Teen Angels, and reruns of Scooby-Doo, Where are You!. For the 1978–1979 season, the show was reduced to 90 minutes and re-titled Scooby's All-Stars. This season aired from September 9, 1978 to September 8, 1979 on ABC. Each week's program included six cartoon segments: ⁕Captain Caveman and the Teen Angels: Comedy/mystery show about three teenage detectives and their companion, a prehistoric caveman superhero thawed from a block of ice. Sixteen episodes were produced. ⁕Laff-a-Lympics: Based on Battle of the Network Stars, this series featured 45 Hanna-Barbera characters, including Scooby-Doo, Yogi Bear, Mumbly, and others competing in Olympics-styled events. Thirty-two episodes were produced. ⁕The Scooby-Doo Show: Comedy/mystery show about four teenage detectives and their talking dog, Scooby-Doo. Eight first-run episodes were produced for the 1977-78 season, with 16 from 1976-77 rerun following the final first-run episode. Two of the new episodes, as well as two others from 1976–77, feature Scooby-Doo's cousin Scooby-Dum as a recurring character. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mel Blanc Casey Kasem Don Messick Daws Butler Frank Welker Full Cast & Crew Last Season Season 2 1978 | 8 Episodes Season 2 of Scooby's All-Star Laff-A-Lympics premiered on September  9, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Scooby's All-Star Laff-A-Lympics. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m, 120m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 8 Robson Guedes Vieira 4 andruxtor g 3 gregbl D 3 DracoAn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}