{"link": "https://www.themoviedb.org/tv/32942?language=en", "title": "The Hard Times of RJ Berger", "resume": "The Hard Times of RJ Berger was an American television comedy series created by David Katzenberg and Seth Grahame-Smith for MTV. The show's central character is RJ Berger an unpopular sophomore at the fictional Pinkerton High School in Ohio who has an exceptionally large penis. Berger's two best friends are Miles Jenner, whose ambitions for popularity cause him to clash with Berger, and goth girl Lily Miran, who has been lusting after Berger for several years. Berger's love interest is Jenny Swanson, a cheerleader who is involved with Max Owens, a popular jock and bully. The show is presented as a coming of age story and has been described by Katzenberg and Grahame-Smith as a blend of the television series The Wonder Years and the film Superbad.\nThe pilot episode premiered on June 6, 2010, and the first season of 12 episodes concluded August 23, 2010. MTV renewed The Hard Times of RJ Berger for a second season, which premiered on March 24, 2011, and concluded on May 30, 2011, but canceled the show that August.", "rate": 70, "genre": ["Comedy"], "cast": ["Paul Iacono", "Jareb Dauplaise", "Kara Taitz", "Amber Lancaster", "Jayson Blair"], "character": ["R.J. Berger", "Miles Jenner", "Lily Miran", "Jenny Swanson", "Max Owens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32942   Expand The Hard Times of RJ Berger   (2010) User Score  Play Trailer Overview The Hard Times of RJ Berger was an American television comedy series created by David Katzenberg and Seth Grahame-Smith for MTV. The show's central character is RJ Berger an unpopular sophomore at the fictional Pinkerton High School in Ohio who has an exceptionally large penis. Berger's two best friends are Miles Jenner, whose ambitions for popularity cause him to clash with Berger, and goth girl Lily Miran, who has been lusting after Berger for several years. Berger's love interest is Jenny Swanson, a cheerleader who is involved with Max Owens, a popular jock and bully. The show is presented as a coming of age story and has been described by Katzenberg and Grahame-Smith as a blend of the television series The Wonder Years and the film Superbad. The pilot episode premiered on June 6, 2010, and the first season of 12 episodes concluded August 23, 2010. MTV renewed The Hard Times of RJ Berger for a second season, which premiered on March 24, 2011, and concluded on May 30, 2011, but canceled the show that August. Featured Crew Seth Grahame-Smith Creator David Katzenberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Iacono R.J. Berger Jareb Dauplaise Miles Jenner Kara Taitz Lily Miran Amber Lancaster Jenny Swanson Jayson Blair Max Owens Full Cast & Crew Last Season Season 2 2011 | 12 Episodes Season 2 of The Hard Times of RJ Berger premiered on March 24, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  7 Recommendations   2012-08-20 The Inbetweeners 3.6    2010-09-29 Todd and the Book of Pure Evil 7.6    2009-07-07 10 Things I Hate About You 6.5    2010-01-11 Blue Mountain State 7.0    2009-03-18 Better Off Ted 7.7    2012-09-25 Brickleberry 7.0    2004-03-12 Wonderfalls 7.8    2010-09-28 No Ordinary Family 6.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.mtv.com/shows/hard_times/series.jhtml Genres Comedy Keywords high school teen comedy Content Score 100 Yes! Looking good! Top Contributors 67 BudsieBuds M 7 MAthePA 4 Banana 3 MacFly 🇫🇷  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}