{"link": "https://www.themoviedb.org/tv/224?language=en", "title": "Match of the Day", "resume": "Match of the Day is the BBC's main football television programme. Typically, it is shown on BBC One on Saturday evenings during the English football season, showing highlights of the day's matches in English football's top division, the Premier League. It is one of the BBC's longest-running shows, having been on air since 22 August 1964, though it has not always been aired regularly. The programme is broadcast from MediaCityUK in Salford Quays on the banks of the Manchester Ship Canal in Greater Manchester.\nMOTD is presented by former England captain Gary Lineker, who is usually joined by England teammate and former Newcastle United captain Alan Shearer and Liverpool and Scotland defender Alan Hansen as well as Mark Lawrenson. Over the years many famous and respected sports broadcasters have fine-tuned their skills on the programme, including Kenneth Wolstenholme, David Coleman, Barry Davies, John Motson, Jimmy Hill and Des Lynam.", "rate": 80, "genre": ["Documentary"], "cast": ["Gary Lineker"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 224   Expand Match of the Day User Score Overview Match of the Day is the BBC's main football television programme. Typically, it is shown on BBC One on Saturday evenings during the English football season, showing highlights of the day's matches in English football's top division, the Premier League. It is one of the BBC's longest-running shows, having been on air since 22 August 1964, though it has not always been aired regularly. The programme is broadcast from MediaCityUK in Salford Quays on the banks of the Manchester Ship Canal in Greater Manchester. MOTD is presented by former England captain Gary Lineker, who is usually joined by England teammate and former Newcastle United captain Alan Shearer and Liverpool and Scotland defender Alan Hansen as well as Mark Lawrenson. Over the years many famous and respected sports broadcasters have fine-tuned their skills on the programme, including Kenneth Wolstenholme, David Coleman, Barry Davies, John Motson, Jimmy Hill and Des Lynam. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Lineker Host Full Cast & Crew Last Season 2016 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 80m Homepage   http://www.news.bbc.co.uk/sport1/hi/football/match_of_the_day/ Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 2 kodiwjaelani P 2 Peter C 2 Chris M 1 MikeJB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}