{"link": "https://www.themoviedb.org/tv/2290?language=en", "title": "Stargate Atlantis", "resume": "With the Ancients' city of Atlantis discovered in the Pegasus Galaxy by Stargate Command, Dr. Elizabeth Weir and Major Sheppard lead a scientific expedition to the ancient abandoned city. Once there, the team not only find themselves unable to contact Earth, but their explorations unexpectedly reawaken the Ancients' deadly enemies, The Wraith, who hunger for this new prey. Now with the help of newfound local allies like Teyla Emmagan, the Atlantis Team sets about to uncover their new home's secrets even as their war of survival against the Wraith begins.", "rate": 79, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["David Hewlett", "Joe Flanigan", "Rachel Luttrell", "Jason Momoa", "Jewel Staite"], "character": ["Rodney McKay", "Colonel John Sheppard", "Teyla Emmagan", "Ronon Dex", "Dr. Jennifer Keller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2290   Expand Stargate Atlantis   (2004) User Score  Play Trailer Overview With the Ancients' city of Atlantis discovered in the Pegasus Galaxy by Stargate Command, Dr. Elizabeth Weir and Major Sheppard lead a scientific expedition to the ancient abandoned city. Once there, the team not only find themselves unable to contact Earth, but their explorations unexpectedly reawaken the Ancients' deadly enemies, The Wraith, who hunger for this new prey. Now with the help of newfound local allies like Teyla Emmagan, the Atlantis Team sets about to uncover their new home's secrets even as their war of survival against the Wraith begins. Featured Crew Brad Wright Creator Robert C. Cooper Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  2 Images Backdrops  61 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast David Hewlett Rodney McKay Joe Flanigan Colonel John Sheppard Rachel Luttrell Teyla Emmagan Jason Momoa Ronon Dex Jewel Staite Dr. Jennifer Keller Full Cast & Crew Last Season Season 5 2008 | 20 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply SHUT UP!!!! Open 0 by Jetfire59\n      \n     o El Rey starts airing it today (09/05/17) Open 0 by ozzyozzie\n      \n     t Has anyone Read \"Homecoming?\" Open 1 by  iofbeholder Go to Discussions Media Most Popular Videos  2 Backdrops  61 Posters  10 Recommendations   2009-10-02 Stargate Universe 7.1    1997-07-27 Stargate SG-1 8.0    2001-09-26 Star Trek: Enterprise 7.4    2004-10-18 Battlestar Galactica 8.1    1995-01-16 Star Trek: Voyager 7.8    1993-01-03 Star Trek: Deep Space Nine 7.8    1994-01-26 Babylon 5 8.1    1987-09-28 Star Trek: The Next Generation 8.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://stargate.mgm.com/view/series/2/index.html Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords galaxy future technology atlantis space travel alien spaceship alien planet lost city alien race lost civilization warrior race distant  planet Content Score 100 Yes! Looking good! Top Contributors 678 Atanas 33 david8s95 19 Elizabeth Jennings w 17 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}