{"link": "https://www.themoviedb.org/tv/43152?language=en", "title": "Rooftop Prince", "resume": "Rooftop Prince is a 2012 South Korean fantasy romantic comedy television drama, starring Park Yuchun, Han Ji-min, Jeong Yu-mi, Lee Tae-sung, Lee Min-ho, Jung Suk-won and Choi Woo-shik. It is about a Joseon crown prince who, after his wife dies mysteriously, time travels to the future where he encounters familiar faces, modern-day devices, and corporate intrigue. It aired on SBS from March 21 to May 24, 2012 on Wednesdays and Thursdays at 21:55 for 20 episodes.", "rate": 81, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Park Yoo-chun", "Han Ji-min", "Jeong Yu-mi", "Kim So-hyun", "Lee Tae-sung"], "character": ["Prince Lee Gak / Yong Tae-yong", "Park-ha / Hong Bu-yong", "Hong Se-na / Hong Hwa-yong", "Hong Se-na (young) / Hong Hwa-yong (young)", "Yong Tae-mu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43152   Expand Rooftop Prince   (2012) User Score Overview Rooftop Prince is a 2012 South Korean fantasy romantic comedy television drama, starring Park Yuchun, Han Ji-min, Jeong Yu-mi, Lee Tae-sung, Lee Min-ho, Jung Suk-won and Choi Woo-shik. It is about a Joseon crown prince who, after his wife dies mysteriously, time travels to the future where he encounters familiar faces, modern-day devices, and corporate intrigue. It aired on SBS from March 21 to May 24, 2012 on Wednesdays and Thursdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Yoo-chun Prince Lee Gak / Yong Tae-yong Han Ji-min Park-ha / Hong Bu-yong Jeong Yu-mi Hong Se-na / Hong Hwa-yong Kim So-hyun Hong Se-na (young) / Hong Hwa-yong (young) Lee Tae-sung Yong Tae-mu Full Cast & Crew Last Season Season 1 2012 | 20 Episodes Season 1 of Rooftop Prince premiered on March 21, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  5 Recommendations   2012-08-13 Faith 7.6    2015-11-16 Oh My Venus 7.8    2010-03-31 Personal Taste 7.4    2011-05-09 Lie To Me 7.6    2010-11-13 Secret Garden 8.2    2013-08-05 Good Doctor 8.6    2012-09-12 The Innocent Man 8.8    2015-12-09 Remember 7.9  Facts Original Name  옥탑방 왕세자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/okprince/ Genres Comedy Drama Sci-Fi & Fantasy Keywords time travel korea Content Score 86 Almost there... Top Contributors M 41 Maria180493 N 12 Nightowl.Kr CM 12 Cherche Moi LS 10 Lee Seung-Su  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}