{"link": "https://www.themoviedb.org/tv/42500?language=en", "title": "Lucky Star", "resume": "Having fun in school, doing homework together, cooking and eating, playing video games, watching anime. All those little things make up the daily life of the anime-and chocolate-loving-Izumi Konata and her friends. Sometimes relaxing but more than often simply funny.  Lucky Star is a Japanese four-panel comic strip manga by Kagami Yoshimizu. The strip has been serialized in Kadokawa Shoten's Comptiq magazine since January 2004. Cameo strips were published in other magazines such as Shōnen Ace and others. It has no ongoing plot and typically focuses on the daily lives of the characters.\nA drama CD based on the series was released in August 2005, and the series spawned four video games released between 2005 and 2009. A 24-episode anime adaptation produced by Kyoto Animation aired between April 8 and September 16, 2007. The anime is licensed in North America by Kadokawa Pictures and distributed by Bandai Entertainment; six DVDs have been released between May 2008 and March 2009. An original video animation episode was released on September 26, 2008 accompanied by a drama CD. Bandai Entertainment released the OVA in an English-sub only version on August 4, 2009.\nA spin-off manga, Miyakawa-ke no Kūfuku, began serialization in January 2008 in Kadokawa Shoten's Comp H's magazine. An anime adaptation by Ordet and Encourage Films began airing on Ustream in April 2013.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Aya Hirano", "Aya Endo", "Kaori Fukuhara", "Emiri Kato"], "character": ["Konata Izumi", "Miyuki Takara", "Tsukasa Hiiragi", "Kagami Hiiragi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42500   Expand Lucky Star   (2007) User Score Overview Having fun in school, doing homework together, cooking and eating, playing video games, watching anime. All those little things make up the daily life of the anime-and chocolate-loving-Izumi Konata and her friends. Sometimes relaxing but more than often simply funny.  Lucky Star is a Japanese four-panel comic strip manga by Kagami Yoshimizu. The strip has been serialized in Kadokawa Shoten's Comptiq magazine since January 2004. Cameo strips were published in other magazines such as Shōnen Ace and others. It has no ongoing plot and typically focuses on the daily lives of the characters. A drama CD based on the series was released in August 2005, and the series spawned four video games released between 2005 and 2009. A 24-episode anime adaptation produced by Kyoto Animation aired between April 8 and September 16, 2007. The anime is licensed in North America by Kadokawa Pictures and distributed by Bandai Entertainment; six DVDs have been released between May 2008 and March 2009. An original video animation episode was released on September 26, 2008 accompanied by a drama CD. Bandai Entertainment released the OVA in an English-sub only version on August 4, 2009. A spin-off manga, Miyakawa-ke no Kūfuku, began serialization in January 2008 in Kadokawa Shoten's Comp H's magazine. An anime adaptation by Ordet and Encourage Films began airing on Ustream in April 2013. Featured Crew Kagami Yoshimizu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Hirano Konata Izumi Aya Endo Miyuki Takara Kaori Fukuhara Tsukasa Hiiragi Emiri Kato Kagami Hiiragi Full Cast & Crew Last Season Season 1 2007 | 24 Episodes Season 1 of Lucky Star premiered on April  8, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  6 Recommendations   2009-04-03 K-ON! 7.5    2012-10-09  Girls und Panzer 6.4    2010-10-03 Oreimo 7.1    2004-07-10 DearS 5.0    2006-04-03 The Melancholy of Haruhi Suzumiya 7.6    2012-10-09 Sakurasou no Pet na Kanojo 6.5    2012-07-08 Kokoro Connect 7.0    2008-10-04 A Certain Magical Index 7.4  Facts Original Name  らき☆すた Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.lucky-ch.com/ Genres Animation Comedy Keywords anime watercolour style based on 4-koma Content Score 93 Almost there... Top Contributors 18 Axeshizzle LC 9 Legit Corporation 9 Angel Bran 5 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}