{"link": "https://www.themoviedb.org/tv/68394?language=en", "title": "Watership Down", "resume": "Fleeing their doomed warren, a group of rabbits struggle to find and defend a new home.", "rate": 45, "genre": [], "cast": ["Freddie Fox", "Miles Jupp", "Ben Kingsley", "Daniel Rigby", "Gemma Arterton"], "character": ["Captain Holly (voice)", "Blackberry (voice)", "General Woundwort (voice)", "Dandelion (voice)", "Clover (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68394   Expand Watership Down   (2017) User Score Overview Fleeing their doomed warren, a group of rabbits struggle to find and defend a new home. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Freddie Fox Captain Holly (voice) Miles Jupp Blackberry (voice) Ben Kingsley General Woundwort (voice) Daniel Rigby Dandelion (voice) Gemma Arterton Clover (voice) Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Watership Down. You can help by rating TV shows you've seen. Facts Status  In Production Networks Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 18 maikamonroe 8 Elizabeth Jennings 1 Banana 1 robin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}