{"link": "https://www.themoviedb.org/tv/61009?language=en", "title": "Hotel King", "resume": "This drama portrays the story of a heiress, Ah Mo Ne (Lee Da Hae) who lives a sheltered life like a princess but a catastrophe pushes her to do all she can to protect her hotel. She and the general manager of the hotel, Cha Jae Wan (Lee Dong Wook) who appears cold on the outside but carries emotional baggage, fall in love. Cha Jae Wan and his mother were abandoned by his father. As an adult, he begins to work at a hotel and becomes an enemy to his father who abandoned him.", "rate": 78, "genre": ["Drama"], "cast": ["Lee Dong-wook", "Lee Da-hae", "Wang Ji-hye", "Im Seul-ong", "Lee Deok-hwa "], "character": ["Cha Jae-Wan", "Ah Mo-Ne", "Song Chae-Kyung", "Sun Woo-Hyun", "Lee Joong-goo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61009   Expand Hotel King   (2014) User Score Overview This drama portrays the story of a heiress, Ah Mo Ne (Lee Da Hae) who lives a sheltered life like a princess but a catastrophe pushes her to do all she can to protect her hotel. She and the general manager of the hotel, Cha Jae Wan (Lee Dong Wook) who appears cold on the outside but carries emotional baggage, fall in love. Cha Jae Wan and his mother were abandoned by his father. As an adult, he begins to work at a hotel and becomes an enemy to his father who abandoned him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Dong-wook Cha Jae-Wan Lee Da-hae Ah Mo-Ne Wang Ji-hye Song Chae-Kyung Im Seul-ong Sun Woo-Hyun Lee Deok-hwa  Lee Joong-goo Full Cast & Crew Last Season Season 1 2014 | 32 Episodes Season 1 of Hotel King premiered on April  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hotel King. You can help by rating TV shows you've seen. Facts Original Name  호텔킹 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/hoking/index.html Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 28 Nightowl.Kr M 22 Maria180493 16 Elizabeth Jennings z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}