{"link": "https://www.themoviedb.org/tv/60698?language=en", "title": "Comedy Nights with Kapil", "resume": "Comedy Nights with Kapil is a comedy show which provides a distinctive take on the everyday life of a common man as the show explores the story of every household and how our common man Kapil is affected by the simplest issues in life around him.\nThe show consists of a talented cast portraying various roles starting with the wife Mrs. Sharma played by Sumona Chakravarti, the interfering Daadi played by Ali Asgar, the unmarried Bua played by Upasana Singh, an annoying servant played by Naseem Vicky, and Kapil’s secretary played by Soni Singh. Talented theatre actor and comedian Sunil Grover will also be seen donning several unconventional characters throughout the series.", "rate": 79, "genre": ["Comedy"], "cast": ["Kapil Sharma", "Navjot Singh Sidhu", "Ali Asgar", "Sunil Grover", "Naseem Vicky"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60698   Expand Comedy Nights with Kapil   (2013) User Score Overview Comedy Nights with Kapil is a comedy show which provides a distinctive take on the everyday life of a common man as the show explores the story of every household and how our common man Kapil is affected by the simplest issues in life around him.\nThe show consists of a talented cast portraying various roles starting with the wife Mrs. Sharma played by Sumona Chakravarti, the interfering Daadi played by Ali Asgar, the unmarried Bua played by Upasana Singh, an annoying servant played by Naseem Vicky, and Kapil’s secretary played by Soni Singh. Talented theatre actor and comedian Sunil Grover will also be seen donning several unconventional characters throughout the series. Featured Crew Kapil Sharma Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kapil Sharma Navjot Singh Sidhu Ali Asgar Sunil Grover Naseem Vicky Full Cast & Crew Last Season Season 1 2013 | 15 Episodes Season 1 of Comedy Nights with Kapil premiered on June 22, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Comedy Nights with Kapil. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Hindi Runtime  - Homepage  - Genres Comedy Keywords sketch comedy Content Score 93 Almost there... Top Contributors b 17 bolo a 15 alym 5 Banana 4 anshdedha7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}