{"link": "https://www.themoviedb.org/tv/61130?language=en", "title": "Only Love", "resume": "Kim Tae-yang is a physician and Choi Yoo-ri is a broadcasting producer. Choi Jae-min is a dandy-ish executive at a clothing company and Kim Saet-byul is an unwed mother. Kim Woo-joo is much younger than Hong Mi-rae. As these three couples fall in love, they explore issues of age difference, blood ties and adoption, and wealth and poverty.", "rate": 0, "genre": ["Family", "Romance"], "cast": ["Seo Ha-joon", "Im Se-Mi", "Lee Kyu-han", "Nam Bo-ra", "Yoon Jong-hoon"], "character": ["Kim Tae-yang", "Choi Yoo-ri", "Choi Jae-min", "Kim Saet-byul", "Kim Woo-joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61130   Expand Only Love   (2014) User Score Overview Kim Tae-yang is a physician and Choi Yoo-ri is a broadcasting producer. Choi Jae-min is a dandy-ish executive at a clothing company and Kim Saet-byul is an unwed mother. Kim Woo-joo is much younger than Hong Mi-rae. As these three couples fall in love, they explore issues of age difference, blood ties and adoption, and wealth and poverty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Ha-joon Kim Tae-yang Im Se-Mi Choi Yoo-ri Lee Kyu-han Choi Jae-min Nam Bo-ra Kim Saet-byul Yoon Jong-hoon Kim Woo-joo Full Cast & Crew Last Season Season 1 2014 | 123 Episodes Season 1 of Only Love premiered on June  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Only Love. You can help by rating TV shows you've seen. Facts Original Name  사랑만 할래 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000003327 Genres Family Romance Keywords korea Content Score 86 Almost there... Top Contributors M 26 Maria180493 17 Elizabeth Jennings N 16 Nightowl.Kr t 3 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}