{"link": "https://www.themoviedb.org/tv/323?language=en", "title": "The Knights of Prosperity", "resume": "Eugene Gurkin has dreamt of opening his own bar for years, but his dead-end job as a janitor won't even fund a bottle of booze. In a serendipitous moment, he catches an episode of \"E! News\" and his passion is ignited. Soon Eugene recruits a group of average joes into his gang, The Knights of Prosperity, for a heist to finance their dreams. The initial target: rock icon Mick Jagger's super-luxe Central Park West apartment.", "rate": 74, "genre": ["Comedy"], "cast": ["Donal Logue", "Sofía Vergara", "Lenny Venito", "Maziyar Jobrani", "Kevin Michael Richardson"], "character": ["Eugene Gurkin", "Esperanza Villalobos", "Francis 'Squatch' Squacieri", "Gourishankar 'Gary' Subramaniam", "Rockefeller Butts"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 323   Expand The Knights of Prosperity   (2007) User Score  Play Trailer Overview Eugene Gurkin has dreamt of opening his own bar for years, but his dead-end job as a janitor won't even fund a bottle of booze. In a serendipitous moment, he catches an episode of \"E! News\" and his passion is ignited. Soon Eugene recruits a group of average joes into his gang, The Knights of Prosperity, for a heist to finance their dreams. The initial target: rock icon Mick Jagger's super-luxe Central Park West apartment. Featured Crew Rob Burnett Creator Jon Beckerman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Donal Logue Eugene Gurkin Sofía Vergara Esperanza Villalobos Lenny Venito Francis 'Squatch' Squacieri Maziyar Jobrani Gourishankar 'Gary' Subramaniam Kevin Michael Richardson Rockefeller Butts Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of The Knights of Prosperity premiered on January  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations   2010-09-08 Terriers 8.1    2015-06-21 The Brink 6.9  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage   http://abc.go.com/shows/the-knights-of-prosperity Genres Comedy Keywords thief sitcom Content Score 100 Yes! Looking good! Top Contributors 20 Banana s 3 speedycars 3 kiko1c w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}