{"link": "https://www.themoviedb.org/tv/12614?language=en", "title": "Clase 406", "resume": "''Clase 406 is a Mexican telenovela, which was produced by and broadcast by Televisa and aired in Canal De Las Estrellas in Mexico and Univision in the United States. The series aired from July 1, 2002 to October 2003 in Mexico. The series had four seasons and 350 one-hour episodes in total. It is a remake of a Colombian TV Series titled Francisco el Matemático, which aired in 1999. The story deals with the problems of current Hispanic youth, in general like sex, drug dealing, abuse, drinking, rape, deception, and heart break. The show had brought fame to the band La Quinta Estación in Mexico and their cast too have received the attention from the media. The show was replaced by C.L.A.P. El Lugar para Tus Sueños.", "rate": 75, "genre": ["Drama"], "cast": ["Francisco Rubio", "Frantz Cossío", "Anahí", "Sherlyn", "Christian Chávez"], "character": ["Carlos Muñoz 'El Caballo'", "Freddy Ordóñez Peñaloza", "Jessica Riquelme Brech", "Gabriela Chávez", "Fernando Lucena 'Fercho'"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12614   Expand Clase 406   (2002) User Score  Play Trailer Overview ''Clase 406 is a Mexican telenovela, which was produced by and broadcast by Televisa and aired in Canal De Las Estrellas in Mexico and Univision in the United States. The series aired from July 1, 2002 to October 2003 in Mexico. The series had four seasons and 350 one-hour episodes in total. It is a remake of a Colombian TV Series titled Francisco el Matemático, which aired in 1999. The story deals with the problems of current Hispanic youth, in general like sex, drug dealing, abuse, drinking, rape, deception, and heart break. The show had brought fame to the band La Quinta Estación in Mexico and their cast too have received the attention from the media. The show was replaced by C.L.A.P. El Lugar para Tus Sueños. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Francisco Rubio Carlos Muñoz 'El Caballo' Frantz Cossío Freddy Ordóñez Peñaloza Anahí Jessica Riquelme Brech Sherlyn Gabriela Chávez Christian Chávez Fernando Lucena 'Fercho' Full Cast & Crew Last Season Season 3 2002 | 1 Episode Season 3 of Clase 406 premiered on December 23, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Clase 406. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.esmas.com/clase406/ Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 23 Amanda l 10 lipo111 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}