{"link": "https://www.themoviedb.org/tv/44671?language=en", "title": "The Girl with the Red Scarf", "resume": "Al Yazmalım was a Turkish television series based on the novel The Red Scarf by Chinghiz Aitmatov and 1978 Turkish romantic drama film The Girl with the Red Scarf.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Seçkin Özdemir", "Baris Falay", "Nesrin Cavadzade", "Orhan Alkaya", "Özge Özpirinçci"], "character": ["İlyas Avcı", "Cemşit Ateş", "Ayça", "Salih", "Asiye Has"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44671   Expand The Girl with the Red Scarf User Score Overview Al Yazmalım was a Turkish television series based on the novel The Red Scarf by Chinghiz Aitmatov and 1978 Turkish romantic drama film The Girl with the Red Scarf.  Featured Crew Chinghiz Aitmatov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seçkin Özdemir İlyas Avcı Baris Falay Cemşit Ateş Nesrin Cavadzade Ayça Orhan Alkaya Salih Özge Özpirinçci Asiye Has Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Original Name  Al Yazmalım Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  60m Homepage   http://www.ayyapim.com/al-yazmalim Genres Drama Romance Keywords romance Content Score 86 Almost there... Top Contributors b 31 bluwy s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}