{"link": "https://www.themoviedb.org/tv/11042?language=en", "title": "ALF: The Animated Series", "resume": "ALF: The Animated Series is an animated cartoon spin-off based on the live-action Sitcom series ALF. It premiered on September 26, 1987 and ran for 26 episodes. ALF Tales was a spinoff from the series that ran on the NBC television network on Saturdays from August 1988 to December 1989. The show had characters from that series play various characters from fairy tales. The fairy tale was usually altered for comedic effect in a manner relational to Fractured Fairy Tales.", "rate": 57, "genre": ["Animation"], "cast": ["Paul Fusco", "Dan Hennessey", "Noam Zylberman", "Tabitha St. Germain"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11042   Expand ALF: The Animated Series   (1987) User Score Overview ALF: The Animated Series is an animated cartoon spin-off based on the live-action Sitcom series ALF. It premiered on September 26, 1987 and ran for 26 episodes. ALF Tales was a spinoff from the series that ran on the NBC television network on Saturdays from August 1988 to December 1989. The show had characters from that series play various characters from fairy tales. The fairy tale was usually altered for comedic effect in a manner relational to Fractured Fairy Tales. Featured Crew Paul Fusco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Fusco Dan Hennessey Noam Zylberman Tabitha St. Germain Full Cast & Crew Last Season Season 2 1988 | 13 Episodes Season 2 of ALF: The Animated Series premiered on September 10, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for ALF: The Animated Series. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on ALF: The Animated Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords alien alien planet alf Content Score 93 Almost there... Top Contributors 11 Banana 4 BlackDelivery 2 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}