{"link": "https://www.themoviedb.org/tv/2304?language=en", "title": "Thomas & Friends", "resume": "Thomas & Friends is a British children's television series, which had its first broadcast on the ITV network on 4 September 1984. It is based on The Railway Series of books by the Reverend Wilbert Awdry and his son, Christopher Awdry. These books deal with the adventures of a group of anthropomorphised locomotives and road vehicles who live on the fictional Island of Sodor. The books were based on stories Wilbert told to entertain his son, Christopher during his recovery from measles. From Series one to four, many of the stories are based on events from Awdry's personal experience.", "rate": 55, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2304   Expand Thomas & Friends   (1984) User Score  Play Trailer Overview Thomas & Friends is a British children's television series, which had its first broadcast on the ITV network on 4 September 1984. It is based on The Railway Series of books by the Reverend Wilbert Awdry and his son, Christopher Awdry. These books deal with the adventures of a group of anthropomorphised locomotives and road vehicles who live on the fictional Island of Sodor. The books were based on stories Wilbert told to entertain his son, Christopher during his recovery from measles. From Series one to four, many of the stories are based on events from Awdry's personal experience. Featured Crew Britt Allcroft Creator Reverend W. Awdry Creator Christopher Awdry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 19 2015 | 25 Episodes Season 19 of Thomas & Friends premiered on September 21, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   1981-09-16 Postman Pat 6.0    2002-10-04 The Basil Brush Show 8.0    1987-09-26 ChuckleVision 6.3    1999-04-12 Bob the Builder 5.5    1998-08-31 Noddy 5.9    1982-11-01 SuperTed 6.8    1991-09-26 Brum 5.2    1986-05-01 Bread 7.4  Facts Status  Returning Series Networks Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.thomasandfriends.com/ Genres Animation Keywords locomotive train kids Content Score 71 Just a little bit more... Top Contributors 26 Elizabeth Jennings 17 Banana Jd 16 Jeroen de Lau M 8 Marud  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}