{"link": "https://www.themoviedb.org/tv/70413?language=en", "title": "Gap Year", "resume": "It’s the story of British lads Dylan and Sean, childhood friends who have drifted apart, who initially set out to backpack through China but end up taking on the whole continent.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Anders Hayward", "Ade Oyefeso", "Aisling Bea", "Alice Lee", "Brittney Wilson"], "character": ["Dylan", "Sean", "Kendra", "May", "Ashley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70413   Expand Gap Year   (2017) User Score  Play Trailer Overview It’s the story of British lads Dylan and Sean, childhood friends who have drifted apart, who initially set out to backpack through China but end up taking on the whole continent. Featured Crew Tom Basden Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anders Hayward Dylan Ade Oyefeso Sean Aisling Bea Kendra Alice Lee May Brittney Wilson Ashley Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Gap Year premiered on February 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gap Year. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m, 25m Homepage   http://www.channel4.com/programmes/gap-year Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 26 szab 4 Mervan 2 Elizabeth Jennings 2 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}