{"link": "https://www.themoviedb.org/tv/6275?language=en", "title": "Egypt", "resume": "Egypt is a BBC television drama serial about various archaeological discoveries taking place in that country's history, with the occasional 'flashback' scene involving actors portraying the ancient Egyptians themselves. The hour-long show originally aired on Sunday nights at 9 pm on BBC1 in 2005.\nThe first two episodes explored the work of Howard Carter and his archaeological quest in Egypt in the early part of the twentieth century. The next two episodes focused on the eccentric explorer \"The Great Belzoni\", played by Matthew Kelly. The final two episodes dramatise the discovery and deciphering of the Rosetta Stone by Jean-François Champollion, who is played by Elliot Cowan.\nThe music was recorded by the Warsaw Radio Orchestra and is featured on the CD Timeless Histories by Chappell music, produced by Clare Isaacs.", "rate": 82, "genre": ["Documentary", "Drama"], "cast": ["Matthew Kelly", "Lynsey Baxter", "Andrew Sachs", "Julian Wadham", "Caroline Langrishe"], "character": ["Giovanni Belzoni", "Sarah Belzoni", "Narrator", "Lord Carnarvon", "Lady Carnarvon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6275   Expand Egypt   (2005) User Score Overview Egypt is a BBC television drama serial about various archaeological discoveries taking place in that country's history, with the occasional 'flashback' scene involving actors portraying the ancient Egyptians themselves. The hour-long show originally aired on Sunday nights at 9 pm on BBC1 in 2005. The first two episodes explored the work of Howard Carter and his archaeological quest in Egypt in the early part of the twentieth century. The next two episodes focused on the eccentric explorer \"The Great Belzoni\", played by Matthew Kelly. The final two episodes dramatise the discovery and deciphering of the Rosetta Stone by Jean-François Champollion, who is played by Elliot Cowan. The music was recorded by the Warsaw Radio Orchestra and is featured on the CD Timeless Histories by Chappell music, produced by Clare Isaacs. Featured Crew Jonathan Rich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Kelly Giovanni Belzoni Lynsey Baxter Sarah Belzoni Andrew Sachs Narrator Julian Wadham Lord Carnarvon Caroline Langrishe Lady Carnarvon Full Cast & Crew Last Season Season 1 2005 | 6 Episodes Season 1 of Egypt premiered on October 30, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2009-10-14 Alaska State Troopers 7.7    2016-10-12 Nurses Who Kill 7.3    2011-05-16 Killer Kids 6.5    2016-05-11 Killer Women with Piers Morgan 7.5    2012-09-17 Unsealed: Alien Files 5.4  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/pressoffice/pressreleases/stories/2005/10_october/17/egypt.shtml Genres Documentary Drama Keywords egypt history Content Score 93 Almost there... Top Contributors 25 waaw d 5 dune2000 2 Elizabeth Jennings 1 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}