{"link": "https://www.themoviedb.org/tv/63044?language=en", "title": "The Lost Treasure of Aquila", "resume": "The siblings Sam and Minna and their mother Eva arrive to the Orchid coast to celebrate Christmas in the sun with aunt Anja and their cousin Bianca. It's the first time after their father's death the siblings are back on his beloved Orchid coast, and it is in the same time both beautiful and sad to be there. It promises to be an exciting Christmas when a mysterious mask and old pieces of wood from a sunken ship washes ashore at the hotel where they live. Grandfather Ivo tells the three cousins the legend of pirate Aquila, whose ship sank in the battle for \"the greatest treasure of them all\". Meanwhile Sam, Minna and their mother Eva learns that the Orchid coast will be destroyed after Christmas. Can pirate Aquila's treasure save the coast?", "rate": 0, "genre": ["Action", "Adventure", "Family", "Kids", "Mystery"], "cast": ["Amanda Ooms", "Ana Gil De Melo Nascimento", "Buster Isitt", "Alexandra Breschi", "Lea Stojanov"], "character": ["Aquila", "Eva", "Sam", "Minna", "Bianca"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63044   Expand The Lost Treasure of Aquila   (2014) User Score Overview The siblings Sam and Minna and their mother Eva arrive to the Orchid coast to celebrate Christmas in the sun with aunt Anja and their cousin Bianca. It's the first time after their father's death the siblings are back on his beloved Orchid coast, and it is in the same time both beautiful and sad to be there. It promises to be an exciting Christmas when a mysterious mask and old pieces of wood from a sunken ship washes ashore at the hotel where they live. Grandfather Ivo tells the three cousins the legend of pirate Aquila, whose ship sank in the battle for \"the greatest treasure of them all\". Meanwhile Sam, Minna and their mother Eva learns that the Orchid coast will be destroyed after Christmas. Can pirate Aquila's treasure save the coast? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Ooms Aquila Ana Gil De Melo Nascimento Eva Buster Isitt Sam Alexandra Breschi Minna Lea Stojanov Bianca Full Cast & Crew Last Season Season 1 2014 | 24 Episodes Season 1 of The Lost Treasure of Aquila premiered on December  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Lost Treasure of Aquila. You can help by rating TV shows you've seen. Facts Original Name  Piratskattens Hemlighet Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  10m Homepage  - Genres Action & Adventure Family Kids Mystery Keywords family kids christmas story Content Score 86 Almost there... Top Contributors j 47 jnylen t 31 tmdb45070722 TB 4 TMDb Bot 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}