{"link": "https://www.themoviedb.org/tv/9041?language=en", "title": "Noein", "resume": "Noein: To Your Other Self, also known simply as Noein, is a science fiction anime television series directed by Kazuki Akane and Kenji Yasuda and produced by Satelight. The series has 24 episodes which comprise a complete storyline.\nThe English version was produced by Manga Entertainment.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Fujiko Takimoto", "Haruka Kudou", "Kazuya Nakai", "Akemi Okamura", "Atsuko Tanaka"], "character": ["Yuu Gotou", "Haruka Kaminogi", "Karasu", "Asuka Kaminogi", "Miyuki Gotou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9041   Expand Noein   (2007) User Score Overview Noein: To Your Other Self, also known simply as Noein, is a science fiction anime television series directed by Kazuki Akane and Kenji Yasuda and produced by Satelight. The series has 24 episodes which comprise a complete storyline. The English version was produced by Manga Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fujiko Takimoto Yuu Gotou Haruka Kudou Haruka Kaminogi Kazuya Nakai Karasu Akemi Okamura Asuka Kaminogi Atsuko Tanaka Miyuki Gotou Full Cast & Crew Last Season Season 1 2007 | 24 Episodes Season 1 of Noein premiered on June 18, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Noein. You can help by rating TV shows you've seen. Facts Original Name  ノエイン もうひとりの君 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 7 BlackDelivery m 3 magoozin 3 sp1ti 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}