{"link": "https://www.themoviedb.org/tv/39483?language=en", "title": "Major Crimes", "resume": "Major Crimes explores how the American justice system approaches the art of the deals as law enforcement officers and prosecutors work together to score a conviction. Los Angeles Police Captain Sharon Raydor heads up a special squad within the LAPD that deals with high-profile or particularly sensitive crimes.", "rate": 68, "genre": ["Drama"], "cast": ["Mary McDonnell", "Tony Denison", "Michael Paul Chan", "Raymond Cruz", "Phillip P. Keene"], "character": ["Captain Sharon Raydor", "Lt. Andy Flynn", "Lt. Mike Tao", "Detective Julio Sanchez", "Buzz Watson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39483   Expand Major Crimes   (2012) User Score Overview Major Crimes explores how the American justice system approaches the art of the deals as law enforcement officers and prosecutors work together to score a conviction. Los Angeles Police Captain Sharon Raydor heads up a special squad within the LAPD that deals with high-profile or particularly sensitive crimes. Featured Crew James Duff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  12 Content Issues  1 Images Backdrops  8 Posters  9 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Mary McDonnell Captain Sharon Raydor Tony Denison Lt. Andy Flynn Michael Paul Chan Lt. Mike Tao Raymond Cruz Detective Julio Sanchez Phillip P. Keene Buzz Watson Full Cast & Crew Current Season Season 6 2017 | 13 Episodes View All Seasons Social Reviews  0 Discussions  13 Subject Status Replies Last Reply Julio *promoted*? Open 0 by RodimusConvoy\n      \n     Stroh Betrayed! Open 0 by RodimusConvoy\n      \n     Hope Against Hope? Open 1 by  tristavv Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  9 Recommendations   2005-06-13 The Closer 7.0    2017-03-01 Chicago Justice 4.8    2014-01-08 Chicago P.D. 6.9    2016-01-07 Shades of Blue 6.2    2015-09-30 Code Black 7.0    2010-07-12 Rizzoli & Isles 7.0    2014-02-06 Bosch 7.9    2014-09-17 The Mysteries of Laura 6.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.tntdrama.com/shows/major-crimes.html Genres Drama Keywords police los angeles crime police investigation lapd major crime unit Content Score 100 Yes! Looking good! Top Contributors 162 seawolf 19 Elizabeth Jennings 18 niqo19 T 13 Tim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}