{"link": "https://www.themoviedb.org/tv/69356?language=en", "title": "Mapp and Lucia", "resume": "1930s comedy drama based on EF Benson's novels, about the rivalry between two women in a quaint village.", "rate": 63, "genre": ["Drama", "Comedy"], "cast": ["Miranda Richardson", "Anna Chancellor", "Poppy Miller", "Felicity Montagu", "Steve Pemberton"], "character": ["Elizabeth Mapp", "Emmeline 'Lucia' Lucas", "Evie Bartlett", "Godiva 'Diva' Plaistow", "Georgie Pillson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69356   Expand Mapp and Lucia   (2014) User Score Overview 1930s comedy drama based on EF Benson's novels, about the rivalry between two women in a quaint village. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miranda Richardson Elizabeth Mapp Anna Chancellor Emmeline 'Lucia' Lucas Poppy Miller Evie Bartlett Felicity Montagu Godiva 'Diva' Plaistow Steve Pemberton Georgie Pillson Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of Mapp and Lucia premiered on December 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mapp and Lucia. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b04wtrqv Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 38 Elizabeth Jennings TB 13 TMDb Bot 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}