{"link": "https://www.themoviedb.org/tv/61295?language=en", "title": "Pokémon Origins", "resume": "Pokémon Origins tells the story of the very first Pokémon video games,  Pokémon Red Version and Pokémon Blue Version. Follow Red as he travels  through the Kanto region, encounters Team Rocket, battles his rival, and  challenges the Pokémon League!", "rate": 66, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Bryce Papenbrook", "Lucien Dodge", "Kyle Hebert", "Kirk Thornton", "Christine Marie Cabanos"], "character": ["Red", "Blue (Green)", "Professor Oak", "Lance", "Reina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61295   Expand Pokémon Origins   (2013) User Score  Play Trailer Overview Pokémon Origins tells the story of the very first Pokémon video games,  Pokémon Red Version and Pokémon Blue Version. Follow Red as he travels  through the Kanto region, encounters Team Rocket, battles his rival, and  challenges the Pokémon League! Featured Crew Yukio Kuroda Creator Itsuro Kawasaki Creator Hideya Takahashi Creator Daiki Tomoyasu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bryce Papenbrook Red Lucien Dodge Blue (Green) Kyle Hebert Professor Oak Kirk Thornton Lance Christine Marie Cabanos Reina Full Cast & Crew Last Season Season 1 2013 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2016-09-16 Pokémon Generations 7.1    2015-07-09 SCHOOL-LIVE! 8.1    2015-10-03 Chivalry of a Failed Knight 7.9    2014-10-10 Your Lie in April 8.2    2012-07-08 Sword Art Online 7.7    2016-01-08 ERASED 7.8  Facts Original Name  ポケットモンスター ジ・オリジン Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Chinese Runtime  25m Homepage   http://www.pokemon.co.jp/ex/origin/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 26 Steven 14 Jenazad 7 United600 G 6 Guillaume  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}