{"link": "https://www.themoviedb.org/tv/78583?language=en", "title": "Mistress", "resume": "A story that follows the lives of four female friends in their 30's as they become involved in a series of murders.", "rate": 80, "genre": ["Drama"], "cast": ["Han Ga-in", "Shin Hyun-bin", "Moon Choi", "Goo Jae-Yee", "Lee Hee-joon"], "character": ["Jang Se-Yeon", "Kim Eun-Soo", "Han Jung-Won", "Do Hwa-Young", "Han Sang-Hoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78583   Expand Mistress   (2018) User Score Overview A story that follows the lives of four female friends in their 30's as they become involved in a series of murders. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  16 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Ga-in Jang Se-Yeon Shin Hyun-bin Kim Eun-Soo Moon Choi Han Jung-Won Goo Jae-Yee Do Hwa-Young Lee Hee-joon Han Sang-Hoon Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Mistress premiered on April 28, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  16 Recommendations We don't have enough data to suggest any TV shows based on Mistress. You can help by rating TV shows you've seen. Facts Original Name  미스트리스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/ocn/mistress Genres Drama Keywords remake Content Score 86 Almost there... Top Contributors M 32 Maria180493 继 25 继续支持 10 Elizabeth Jennings 5 Otgoo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}