{"link": "https://www.themoviedb.org/tv/8509?language=en", "title": "Cupid", "resume": "Cupid was a television series that aired on ABC from March 31 to June 16, 2009. The series is a revival of sorts of the network's 1998 series of the same name, changing its primary setting from Chicago to New York City.", "rate": 75, "genre": ["Drama"], "cast": ["Camille Guaty", "Rick Gomez", "Sarah Paulson", "Bobby Cannavale"], "character": ["Lita", "Dr. Claire McCrae", "Trevor Pierce"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8509   Expand Cupid   (2009) User Score  Play Trailer Overview Cupid was a television series that aired on ABC from March 31 to June 16, 2009. The series is a revival of sorts of the network's 1998 series of the same name, changing its primary setting from Chicago to New York City. Featured Crew Rob Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Camille Guaty Lita Rick Gomez Sarah Paulson Dr. Claire McCrae Bobby Cannavale Trevor Pierce Full Cast & Crew Last Season (2009) season 1 2009 | 7 Episodes Season 1 of Cupid premiered on March 31, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Cupid. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cupid. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://abc.go.com/primetime/cupid/index Genres Drama Keywords new york greek mythology psychiatrist cupid Content Score 100 Yes! Looking good! Top Contributors 10 BudsieBuds 6 Banana 4 Travis Bell w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}