{"link": "https://www.themoviedb.org/tv/74211?language=en", "title": "Biggest Deal", "resume": "One house and 16 celebrities divided into 4 teams with the aim of managing 4 businesses. This format takes each of the celebrity teams to run a pizzeria, car wash, bed and breakfast, and beauty salon. The profits made are given to solidarity institutions. The celebrities are closed in a home with 24 hour monitoring and are evaluated based on the business results and on the public vote.", "rate": 26, "genre": ["Reality"], "cast": ["Olívia Ortiz", "Teresa Guilherme"], "character": ["Host (Fora de Horas)", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74211   Expand Biggest Deal   (2017) User Score  Play Trailer Overview One house and 16 celebrities divided into 4 teams with the aim of managing 4 businesses. This format takes each of the celebrity teams to run a pizzeria, car wash, bed and breakfast, and beauty salon. The profits made are given to solidarity institutions. The celebrities are closed in a home with 24 hour monitoring and are evaluated based on the business results and on the public vote. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olívia Ortiz Host (Fora de Horas) Teresa Guilherme Host Full Cast & Crew Last Season Season 1 2017 | 42 Episodes Season 1 of Biggest Deal premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2007-09-24 The Big Bang Theory 6.8  Facts Status  Ended Network Certification  - Type  Reality Original Language  Portuguese Runtime  60m, 120m Homepage   http://www.tvi.iol.pt/biggestdeal/ Genres Reality Keywords reality competition Content Score 64 We're so close, yet so far. Top Contributors HS 19 Hugo S. 16 rubenjpvieira 8 Elizabeth Jennings 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}