{"link": "https://www.themoviedb.org/tv/4376?language=en", "title": "JAG", "resume": "JAG is an American legal drama television show with a distinct military theme, created by Donald P. Bellisario, and produced by Belisarius Productions in association with Paramount Network Television. The first season was co-produced with NBC Productions.\nOriginally conceived as a Top Gun meets A Few Good Men, the pilot episode of JAG first aired on NBC on September 23, 1995; but the series was later canceled on May 22, 1996 after finishing 79th in the ratings, leaving one episode unaired. Rival network CBS picked up the series for a midseason replacement, beginning on January 3, 1997. CBS's decision to air JAG proved to be a good move, as JAG for several seasons climbed in the ratings and was on the air for nine additional seasons. JAG furthermore spawned the hit series NCIS, which in turn spun off another hit, NCIS: Los Angeles.\nIn total, 227 episodes were produced over 10 seasons and JAG was during its 5th season seen in over 100 countries worldwide. JAG was so popular that it entered syndication early in 1999 and it is still regularly repeated.", "rate": 68, "genre": ["Mystery", "Drama"], "cast": ["David James Elliott", "Zoe McLellan", "Catherine Bell", "John M. Jackson", "Karri Turner"], "character": ["Cmdr. Harmon 'Harm' Rabb, Jr.", "Jennifer Coates", "Lt. Col. Sarah MacKenzie", "Adm. Albert Jethro 'A.J.' Chegwidden", "Lt. Harriet Sims"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4376   Expand JAG   (1995) User Score Overview JAG is an American legal drama television show with a distinct military theme, created by Donald P. Bellisario, and produced by Belisarius Productions in association with Paramount Network Television. The first season was co-produced with NBC Productions. Originally conceived as a Top Gun meets A Few Good Men, the pilot episode of JAG first aired on NBC on September 23, 1995; but the series was later canceled on May 22, 1996 after finishing 79th in the ratings, leaving one episode unaired. Rival network CBS picked up the series for a midseason replacement, beginning on January 3, 1997. CBS's decision to air JAG proved to be a good move, as JAG for several seasons climbed in the ratings and was on the air for nine additional seasons. JAG furthermore spawned the hit series NCIS, which in turn spun off another hit, NCIS: Los Angeles. In total, 227 episodes were produced over 10 seasons and JAG was during its 5th season seen in over 100 countries worldwide. JAG was so popular that it entered syndication early in 1999 and it is still regularly repeated. Featured Crew Donald P. Bellisario Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  26 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David James Elliott Cmdr. Harmon 'Harm' Rabb, Jr. Zoe McLellan Jennifer Coates Catherine Bell Lt. Col. Sarah MacKenzie John M. Jackson Adm. Albert Jethro 'A.J.' Chegwidden Karri Turner Lt. Harriet Sims Full Cast & Crew Last Season Season 1 1995 | 22 Episodes Season 1 of JAG premiered on September 23, 1995. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Re-watching Jag Open 7 by  klondike6 Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   1993-04-21 Walker, Texas Ranger 5.0    1993-09-12 Lois & Clark: The New Adventures of Superman 6.6    2001-09-24 Crossing Jordan 6.8    1974-01-15 Happy Days 7.3    1999-09-19 Judging Amy 7.1    1965-09-18 I Dream of Jeannie 7.1    1994-01-19 seaQuest DSV 6.7    1989-04-23 Baywatch 5.0  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbs.com/shows/jag/ Genres Mystery Drama Keywords navy military court u.s. navy military Content Score 93 Almost there... Top Contributors D 21 Davizator s 21 stingray23 12 Banana 11 rantamplan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}