{"link": "https://www.themoviedb.org/tv/59183?language=en", "title": "Southcliffe", "resume": "Following a raft of shootings in an English market town, the crimes are retold in a nonlinear narrative structure through the eyes of a journalist and the tragedies' victims.", "rate": 74, "genre": ["Crime", "Drama"], "cast": ["Rory Kinnear", "Sean Harris", "Shirley Henderson", "Anatol Yusef", "Eddie Marsan"], "character": ["David Whitehead", "Stephen Morton", "Claire Salter", "Paul Gould", "Andrew Salter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59183   Expand Southcliffe   (2013) User Score  Play Trailer Overview Following a raft of shootings in an English market town, the crimes are retold in a nonlinear narrative structure through the eyes of a journalist and the tragedies' victims. Featured Crew Tony Grisoni Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rory Kinnear David Whitehead Sean Harris Stephen Morton Shirley Henderson Claire Salter Anatol Yusef Paul Gould Eddie Marsan Andrew Salter Full Cast & Crew Last Season Season 1 2013 | 4 Episodes Season 1 of Southcliffe premiered on August  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations   2012-10-20 Outback Truckers 7.0    2011-08-05 Friends with Benefits 6.1    1990-04-08 Twin Peaks 8.1    2011-12-04 Black Mirror 8.2  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/southcliffe Genres Crime Drama Keywords homicide shooting murder family tragedy Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings 14 Steve 3 stego77 z 2 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}