{"link": "https://www.themoviedb.org/tv/61219?language=en", "title": "My Secret Hotel", "resume": "This is a romantic mystery drama that will depict a murder and a romance story taking place in a luxury hotel. Nam Sang Hyo is the manager for the wedding department of a hotel. She is a perfectionist with a bright personality. She meets her ex-husband Koo Hae Young as a client at the hotel. Sang Hyo and Hae Young were in love and married 7 years ago, but they divorced less than 100 days later. A murder case in the hotel gets in the way of the wedding and throws the characters into unexpected situations. Meanwhile, Jo Sung Gyum is the management director of the hotel and Sang Hyo’s boss. The murder case that brings about a crisis at the hotel is related with his personal history. He is in a love triangle with Sang Hyo and Eun Joo. Eun Joo works as public relations manager for the hotel. She is ambitious with her work career .", "rate": 70, "genre": ["Drama", "Comedy", "Mystery", "Romance"], "cast": ["Yoo In-na", "Kim Ji-Han", "Namgoong Min", "Lee Young-eun", "Ahn Gil-kang"], "character": ["Nam Sang-hyo", "Gu Hae-young", "Jo Sung-gyeom", "Yeo Eun-joo", "Kim Geum-bo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61219   Expand My Secret Hotel   (2014) User Score  Play Trailer Overview This is a romantic mystery drama that will depict a murder and a romance story taking place in a luxury hotel. Nam Sang Hyo is the manager for the wedding department of a hotel. She is a perfectionist with a bright personality. She meets her ex-husband Koo Hae Young as a client at the hotel. Sang Hyo and Hae Young were in love and married 7 years ago, but they divorced less than 100 days later. A murder case in the hotel gets in the way of the wedding and throws the characters into unexpected situations. Meanwhile, Jo Sung Gyum is the management director of the hotel and Sang Hyo’s boss. The murder case that brings about a crisis at the hotel is related with his personal history. He is in a love triangle with Sang Hyo and Eun Joo. Eun Joo works as public relations manager for the hotel. She is ambitious with her work career . Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo In-na Nam Sang-hyo Kim Ji-Han Gu Hae-young Namgoong Min Jo Sung-gyeom Lee Young-eun Yeo Eun-joo Ahn Gil-kang Kim Geum-bo Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of My Secret Hotel premiered on August 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  10 Recommendations We don't have enough data to suggest any TV shows based on My Secret Hotel. You can help by rating TV shows you've seen. Facts Original Name  마이 시크릿 호텔 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/shotel/ Genres Drama Comedy Mystery Romance Keywords korea Content Score 93 Almost there... Top Contributors M 63 Maria180493 t 6 tmdb983464 s 5 sheva_vitali z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}