{"link": "https://www.themoviedb.org/tv/14396?language=en", "title": "The Adventures of Super Mario Bros. 3", "resume": "The Adventures of Super Mario Bros. 3 is an American animated television series based on the video game Super Mario Bros. 3. It aired on NBC with Captain N: The Game Master in a programming block titled Captain N & The Adventures of Super Mario Bros. 3 from September 8, 1990 through December 1, 1990. Unlike its predecessor The Super Mario Bros. Super Show, the series has no live-action segments. DIC Entertainment produced this series while Nintendo provided the characters and power-ups.", "rate": 63, "genre": ["Family", "Animation"], "cast": ["Tony Rosato", "Dan Hennessey", "Harvey Atkin", "Tracey Moore", "Tara Strong"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14396   Expand The Adventures of Super Mario Bros. 3   (1990) User Score Overview The Adventures of Super Mario Bros. 3 is an American animated television series based on the video game Super Mario Bros. 3. It aired on NBC with Captain N: The Game Master in a programming block titled Captain N & The Adventures of Super Mario Bros. 3 from September 8, 1990 through December 1, 1990. Unlike its predecessor The Super Mario Bros. Super Show, the series has no live-action segments. DIC Entertainment produced this series while Nintendo provided the characters and power-ups. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Rosato Dan Hennessey Harvey Atkin Tracey Moore Tara Strong Full Cast & Crew Last Season Captain n &  season 1 1990 | 26 Episodes Season 1 of The Adventures of Super Mario Bros. 3 premiered on September  8, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1991-09-14 Captain N and the New Super Mario World 4.7    1989-09-04 The Super Mario Bros. Super Show! 5.9    1993-09-06 Adventures of Sonic the Hedgehog 4.9    2007-07-11 Code Monkeys 7.4  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  11m, 60m Homepage  - Genres Family Animation Keywords mario Content Score 86 Almost there... Top Contributors 11 Banana d 7 duck z 4 zurman1 4 anderbytes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}