{"link": "https://www.themoviedb.org/tv/61450?language=en", "title": "Strange Empire", "resume": "Set in 1869 Alberta-Montana border country, “Strange Empire” is a Western whose heroes are women. With most of their men gone, and those who remain battling for control, the women struggle to survive, to find their independence, and to build a life in which to thrive and raise families.", "rate": 62, "genre": ["Western"], "cast": ["Michelle Creber", "Cara Gee", "Matreya Scarrwener", "Teach Grant", "Eric Keenleyside"], "character": ["Kelly", "Kat Loving", "Robin", "Franklyn Caze", "Abe Little"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61450   Expand Strange Empire   (2014) User Score  Play Trailer Overview Set in 1869 Alberta-Montana border country, “Strange Empire” is a Western whose heroes are women. With most of their men gone, and those who remain battling for control, the women struggle to survive, to find their independence, and to build a life in which to thrive and raise families. Featured Crew Laurie Finstad-Knizhnik Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Creber Kelly Cara Gee Kat Loving Matreya Scarrwener Robin Teach Grant Franklyn Caze Eric Keenleyside Abe Little Full Cast & Crew Last Season Season 1 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Strange Empire. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbc.ca/strangeempire/ Genres Western Keywords cowboy and outlaw power struggle pioneer women canadian border american history 19th century Content Score 100 Yes! Looking good! Top Contributors 37 Elizabeth Jennings R 5 Rebecca z 5 zurman1 4 Nero Kosonen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}