{"link": "https://www.themoviedb.org/tv/61113?language=en", "title": "Crown Wing", "resume": "Nat Jersey arrived early this time and he sat at the large immaculate table in the dining room alone, then moment came when the dearest Countess walks into the room. High society Thais kick it off again in this stunning drama with fabulous cast.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Wongsakorn Poramathakorn", "Khemanit Jamikorn", "Karnklao Duaysienklao", "Chuerchart Wongsawat", "Weeradon Wangcharoenporn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61113   Expand Crown Wing   (2014) User Score  Play Trailer Overview Nat Jersey arrived early this time and he sat at the large immaculate table in the dining room alone, then moment came when the dearest Countess walks into the room. High society Thais kick it off again in this stunning drama with fabulous cast. Featured Crew Masquerade Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wongsakorn Poramathakorn Khemanit Jamikorn Karnklao Duaysienklao Chuerchart Wongsawat Weeradon Wangcharoenporn Full Cast & Crew Last Season Season 1 2014 | 18 Episodes Season 1 of Crown Wing premiered on May 26, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Crown Wing. You can help by rating TV shows you've seen. Facts Original Name  ปีกมงกุฎ Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 50 Crip 8 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}