{"link": "https://www.themoviedb.org/tv/10755?language=en", "title": "Harry and the Hendersons", "resume": "Harry and the Hendersons is an American sitcom based on the film of the same name, produced by Amblin Entertainment for Universal Television. The series aired in syndication from January 13, 1991 to June 18, 1993, with 72 half-hour episodes produced. The series is about a family who adopt a Bigfoot called Harry.", "rate": 51, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Bruce Davison", "Molly Cheek", "Noah Blake", "Brian Steele", "David Coburn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10755   Expand Harry and the Hendersons   (1991) User Score Overview Harry and the Hendersons is an American sitcom based on the film of the same name, produced by Amblin Entertainment for Universal Television. The series aired in syndication from January 13, 1991 to June 18, 1993, with 72 half-hour episodes produced. The series is about a family who adopt a Bigfoot called Harry. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce Davison Molly Cheek Noah Blake Brian Steele David Coburn Full Cast & Crew Last Season Season 3 1992 | 30 Episodes Season 3 of Harry and the Hendersons premiered on September 18, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1976-10-22 The New Avengers 7.6    1969-09-13 The Perils of Penelope Pitstop 5.7    1977-09-16 Logan's Run 7.9    1973-10-24 Kojak 7.4    1970-09-16 McCloud 7.0    1963-09-29 My Favorite Martian 5.4    1971-09-17 McMillan & Wife 7.2    1971-09-14 Cannon 5.6  Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords bigfoot family sitcom Content Score 71 Just a little bit more... Top Contributors 9 Banana 5 mvbueno h 2 hollowgen R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}