{"link": "https://www.themoviedb.org/tv/35954?language=en", "title": "Space Patrol", "resume": "Space Patrol is a science fiction adventure series that was originally aimed at juvenile audiences of the early 1950s via television, radio, and comic books. However, it soon developed a sizable adult audience such that by 1954, the program consistently ranked in the top 10 shows broadcast on a Saturday.", "rate": 0, "genre": [], "cast": ["Ed Kemmer", "Lyn Osborn", "Ken Mayer", "Nina Bara", "Marvin Miller"], "character": ["Buzz Corey", "Cadet Happy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35954   Expand Space Patrol   (1950) User Score Overview Space Patrol is a science fiction adventure series that was originally aimed at juvenile audiences of the early 1950s via television, radio, and comic books. However, it soon developed a sizable adult audience such that by 1954, the program consistently ranked in the top 10 shows broadcast on a Saturday. Featured Crew Mike Moser Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ed Kemmer Buzz Corey Lyn Osborn Cadet Happy Ken Mayer Nina Bara Marvin Miller Full Cast & Crew Last Season (us) season 5 1955 | 9 Episodes Season 5 of Space Patrol premiered on January  1, 1955. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Space Patrol. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 15m Homepage   http://www.solarguard.com/sphome.htm Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors RW 2 Rich Wannen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}