{"link": "https://www.themoviedb.org/tv/46183?language=en", "title": "Listen to Me, Girls. I'm Your Father!", "resume": "Segawa Yuta is a freshman of a university. He lost his parents when he was small and was raised by his sister Yuri. Yuta has been living alone since Yuri got married to a middle aged man when Yuta was a junior high student.   One day, Yuri visited Yuta's apartment and asked him to take care of her three daughters while Yuri and her husband were on a trip. He unwillingly accepted the job but the plane Yuri took went missing. In order to prevent the daughters from being adopted separately by relatives, Yuta decided to take in all three girls.   A life of a strange family in a tiny apartment begins.", "rate": 73, "genre": ["Drama", "Comedy", "Animation", "Drama"], "cast": ["Hatano Wataru", "Sumire Uesaka", "Yui Horie", "Eri Kitamura", "Daisuke Ono"], "character": ["Yuta Segawa", "Sora Takanashi", "Raika Oda", "Miu Takanashi", "Kouichi Nimura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46183   Expand Listen to Me, Girls. I'm Your Father!   (2012) User Score Overview Segawa Yuta is a freshman of a university. He lost his parents when he was small and was raised by his sister Yuri. Yuta has been living alone since Yuri got married to a middle aged man when Yuta was a junior high student.   One day, Yuri visited Yuta's apartment and asked him to take care of her three daughters while Yuri and her husband were on a trip. He unwillingly accepted the job but the plane Yuri took went missing. In order to prevent the daughters from being adopted separately by relatives, Yuta decided to take in all three girls.   A life of a strange family in a tiny apartment begins. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hatano Wataru Yuta Segawa Sumire Uesaka Sora Takanashi Yui Horie Raika Oda Eri Kitamura Miu Takanashi Daisuke Ono Kouichi Nimura Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of Listen to Me, Girls. I'm Your Father! premiered on January 11, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2014-07-05 Barakamon 7.3  Facts Original Name  パパのいうことを聞きなさい！ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.starchild.co.jp/special/papakiki/ Genres Drama Comedy Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 deanzel F 8 Fireworks 3 enams90 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}