{"link": "https://www.themoviedb.org/tv/64124?language=en", "title": "The Principal", "resume": "When history teacher Matt Bashir is promoted to Principal of a notoriously violent Boys' school in Sydney's south-west, his radical approach brings him into conflict and leaves his personal life dangerously exposed. But just when he seems to be making progress, a 17-year-old student is found dead on school grounds.", "rate": 57, "genre": ["Drama"], "cast": ["Mirah Foulkes", "Rahel Romahn", "Tyler De Nawi", "Aden Young", "Alex Dimitriades"], "character": ["Kellie Norton", "Tarek Ahmad", "Karim Ahmad", "Adam Bilic", "Matt Bashir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64124   Expand The Principal   (2015) User Score  Play Trailer Overview When history teacher Matt Bashir is promoted to Principal of a notoriously violent Boys' school in Sydney's south-west, his radical approach brings him into conflict and leaves his personal life dangerously exposed. But just when he seems to be making progress, a 17-year-old student is found dead on school grounds. Featured Crew Kristen Dunphy Creator Rachael Turk Creator Ian Collie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mirah Foulkes Kellie Norton Rahel Romahn Tarek Ahmad Tyler De Nawi Karim Ahmad Aden Young Adam Bilic Alex Dimitriades Matt Bashir Full Cast & Crew Last Season Season 1 2015 | 4 Episodes Season 1 of The Principal premiered on October  7, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply SPOILERS (ish)  - Cancelled early? Open 0 by Benedict\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2005-12-13 Spiral 8.2    2010-09-08 Terriers 8.1    2009-02-02 Whitechapel 7.5    1996-09-19 The Pretender 7.3    2014-06-01 Halt and Catch Fire 7.7    2014-02-06 Mozart in the Jungle 7.8    2013-04-22 Rectify 7.6    2014-10-12 The Affair 6.5  Facts Status  Ended Network Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Miniseries Original Language  English Runtime  55m Homepage   http://www.sbs.com.au/programs/the-principal Genres Drama Keywords australia high school miniseries school principal boys' school Content Score 100 Yes! Looking good! Top Contributors 17 Banana 16 Bobel TB 10 TMDb Bot 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}