{"link": "https://www.themoviedb.org/tv/5875?language=en", "title": "Anne of Green Gables: The Continuing Story", "resume": "The continuing adventures of Anne Shirley in New York and in France during World War I.", "rate": 65, "genre": [], "cast": ["Megan Follows", "Jonathan Crombie", "Schuyler Grant", "Greg Spottiswood", "Janet-Laine Green"], "character": ["Anne Shirley Blythe", "Gilbert Blythe", "Diana Barry Wright", "Fred Wright", "Maud Montrose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5875   Expand Anne of Green Gables: The Continuing Story   (2000) User Score  Play Trailer Overview The continuing adventures of Anne Shirley in New York and in France during World War I. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  8 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megan Follows Anne Shirley Blythe Jonathan Crombie Gilbert Blythe Schuyler Grant Diana Barry Wright Greg Spottiswood Fred Wright Janet-Laine Green Maud Montrose Full Cast & Crew Last Season Miniseries 2000 | 2 Episodes Season 1 of Anne of Green Gables: The Continuing Story premiered on March  5, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  8 Recommendations   1989-04-15 Around the World in 80 Days 6.4    1993-07-18 Heidi 6.9    2009-08-30 Wuthering Heights 6.9    2008-09-03 Lost in Austen 7.2    1985-11-03 North and South 7.2    1994-05-08 The Stand 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://anneofgreengables.com/films/anne-of-green-gables-the-continuing-story/ Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 48 TMDb Bot 13 Banana S 4 Sharker h 1 heimdallpl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}