{"link": "https://www.themoviedb.org/tv/20924?language=en", "title": "Capital Scandal", "resume": "Capital Scandal is a 2007 South Korean television series starring Kang Ji-hwan, Han Ji-min, Ryu Jin and Han Go-eun. It aired on KBS2 from June 6 to August 2, 2007 on Wednesdays and Thursdays at 21:55 for 16 episodes.\nBased on Lee Sun-mi's novel Love Story in the Capital, the story juxtaposes the heroic anti-Japanese movement with young romance by depicting the capital Seoul of the 1930s during colonial rule, called \"Gyeongseong\". It was a time when the nation's independence fighters fought against pro-Japanese traitors, while traditional Joseon-era Confucian values clashed and coexisted with a more modern way of life. The series portrays one of the darkest periods of Korean history with a mixture of tragedy, comedy and romance.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Han Ji-min", "Kang Ji-hwan", "Ryu Jin", "Ahn Suk-hwan", "Kang Nam-Gil"], "character": ["Na Yeo-kyung", "Sunwoo Wan", "Lee Soo-hyun", "Ueda Mamoru", "Kim Tak-gu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20924   Expand Capital Scandal   (2007) User Score Overview Capital Scandal is a 2007 South Korean television series starring Kang Ji-hwan, Han Ji-min, Ryu Jin and Han Go-eun. It aired on KBS2 from June 6 to August 2, 2007 on Wednesdays and Thursdays at 21:55 for 16 episodes. Based on Lee Sun-mi's novel Love Story in the Capital, the story juxtaposes the heroic anti-Japanese movement with young romance by depicting the capital Seoul of the 1930s during colonial rule, called \"Gyeongseong\". It was a time when the nation's independence fighters fought against pro-Japanese traitors, while traditional Joseon-era Confucian values clashed and coexisted with a more modern way of life. The series portrays one of the darkest periods of Korean history with a mixture of tragedy, comedy and romance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Ji-min Na Yeo-kyung Kang Ji-hwan Sunwoo Wan Ryu Jin Lee Soo-hyun Ahn Suk-hwan Ueda Mamoru Kang Nam-Gil Kim Tak-gu Full Cast & Crew Last Season Season 1 2007 | 16 Episodes Season 1 of Capital Scandal premiered on June  6, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Capital Scandal. You can help by rating TV shows you've seen. Facts Original Name  경성 스캔들 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  70m Homepage  - Genres Comedy Drama Keywords period drama Content Score 86 Almost there... Top Contributors M 27 Maria180493 CM 15 Cherche Moi 6 Imzadi S 3 Sergey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}