{"link": "https://www.themoviedb.org/tv/13592?language=en", "title": "The New 3 Stooges", "resume": "The New Three Stooges was an American animated television series that ran from 1965-1966 starring the Three Stooges. The show follows the trio's antics both in live-action and animated segments. The cast consisted of Moe Howard, Larry Fine and Joe DeRita, with actor and close friend Emil Sitka co-starring, as well as Margaret Kerry.", "rate": 100, "genre": ["Animation", "Comedy"], "cast": ["Moe Howard", "Larry Fine", "Tiny Brauer", "Joe DeRita", "Emil Sitka"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13592   Expand The New 3 Stooges   (1965) User Score Overview The New Three Stooges was an American animated television series that ran from 1965-1966 starring the Three Stooges. The show follows the trio's antics both in live-action and animated segments. The cast consisted of Moe Howard, Larry Fine and Joe DeRita, with actor and close friend Emil Sitka co-starring, as well as Margaret Kerry. Featured Crew Dick Brown Creator Norman Maurer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Moe Howard Larry Fine Tiny Brauer Joe DeRita Emil Sitka Full Cast & Crew Last Season Season 1 1965 | 156 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The New 3 Stooges. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 Hotsake J 3 JohnnyPhantom 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}