{"link": "https://www.themoviedb.org/tv/1404?language=en", "title": "Chuck", "resume": "Chuck is an American action-comedy/spy-drama television series created by Josh Schwartz and Chris Fedak. The series is about an \"average computer-whiz-next-door\" named Chuck, played by Zachary Levi, who receives an encoded e-mail from an old college friend now working for the Central Intelligence Agency; the message embeds the only remaining copy of a software program containing the United States' greatest spy secrets into Chuck's brain.", "rate": 77, "genre": ["Action", "Adventure", "Comedy", "Drama"], "cast": ["Zachary Levi", "Yvonne Strahovski", "Joshua Gomez", "Vik Sahay", "Scott Krinsky"], "character": ["Chuck Bartowski", "Sarah Walker", "Morgan Grimes", "Lester Patel", "Jeff Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1404   Expand Chuck   (2007) User Score  Play Trailer Overview Chuck is an American action-comedy/spy-drama television series created by Josh Schwartz and Chris Fedak. The series is about an \"average computer-whiz-next-door\" named Chuck, played by Zachary Levi, who receives an encoded e-mail from an old college friend now working for the Central Intelligence Agency; the message embeds the only remaining copy of a software program containing the United States' greatest spy secrets into Chuck's brain. Featured Crew Josh Schwartz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  58 Posters  27 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zachary Levi Chuck Bartowski Yvonne Strahovski Sarah Walker Joshua Gomez Morgan Grimes Vik Sahay Lester Patel Scott Krinsky Jeff Barnes Full Cast & Crew Last Season Original Air Date Original Air Date Season 1 (Original Air Date) Season 5 2011 | 13 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply \"I've been feeling a little pasty.\" Open 1 by  lima-2 w Chuck: Happy Birthday Zachary Levi! Open 0 by wonder2wonder\n      \n     w Sarah: Happy Birthday Yvonne Strahovski! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  58 Posters  27 Recommendations   2009-10-23 White Collar 7.7    2007-06-28 Burn Notice 7.3    2006-07-07 Psych 7.6    2001-10-16 Smallville 6.9    2006-09-25 Heroes 6.9    2008-09-09 Fringe 8.1    2008-09-23 The Mentalist 7.3    2009-09-17 Community 7.9  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.nbc.com/Chuck/ Genres Action & Adventure Comedy Drama Keywords cia super computer nerd secret agent national security agency (nsa) unlikely lovers computer in brain pretend relationship Content Score 100 Yes! Looking good! Top Contributors 54 Banana 37 lineker 33 Travis Bell f 19 furkan-guven0115  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}