{"link": "https://www.themoviedb.org/tv/67663?language=en", "title": "Danganronpa 3: The End of Hope's Peak High School", "resume": "The world was close to being destroyed by Ultimate Despair, who caused \"The Biggest, Most Awful, Most Tragic Event in Human History.\" In order to save this world from the event's chaos, the Future Foundation was formed. Although the organization continues its activities to restore the world, Makoto Naegi is under suspicion of treason due to him shielding the Remnants of Despair.  The Future Foundation members had gathered together to decide on his punishment, but they all end up getting trapped inside the place they were meeting by Monokuma, who demands that they begin the \"Final Killing.\" They have strange bangles put on their wrists, and are given tranquilizers when a certain time arrives. To make things worse, there apparently is a real traitor amongst their ranks who is coming to kill the members of the Future Foundation.  In this game where class trials don't exist, the only way to get rid of the traitor is to find him and kill him off. Naegi is forced to face the ultimate death game, where it's kill or be killed. The tale of despair in which hope kills hope begins.", "rate": 58, "genre": ["Action", "Adventure", "Animation", "Drama", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67663   Expand Danganronpa 3: The End of Hope's Peak High School   (2016) User Score  Play Trailer Overview The world was close to being destroyed by Ultimate Despair, who caused \"The Biggest, Most Awful, Most Tragic Event in Human History.\" In order to save this world from the event's chaos, the Future Foundation was formed. Although the organization continues its activities to restore the world, Makoto Naegi is under suspicion of treason due to him shielding the Remnants of Despair.  The Future Foundation members had gathered together to decide on his punishment, but they all end up getting trapped inside the place they were meeting by Monokuma, who demands that they begin the \"Final Killing.\" They have strange bangles put on their wrists, and are given tranquilizers when a certain time arrives. To make things worse, there apparently is a real traitor amongst their ranks who is coming to kill the members of the Future Foundation.  In this game where class trials don't exist, the only way to get rid of the traitor is to find him and kill him off. Naegi is forced to face the ultimate death game, where it's kill or be killed. The tale of despair in which hope kills hope begins. Featured Crew Seiji Kishi Creator Fukuoka Motoo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Hope Arc 2016 | 1 Episode Season 3 of Danganronpa 3: The End of Hope's Peak High School premiered on September 29, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2007-06-09 Ergo Proxy 7.3    2011-04-06 Steins;Gate 8.2    2017-03-31 13 Reasons Why 7.2    1993-09-10 The X-Files 8.1  Facts Original Name  ダンガンロンパ３ The End of 希望ヶ峰学園 未来編 Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Drama Mystery Keywords psychology Content Score 71 Just a little bit more... Top Contributors 44 ioneakatzuki 14 Jenazad 12 Red Squirrel 8 daarook  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}