{"link": "https://www.themoviedb.org/tv/62572?language=en", "title": "Saving My Stupid Youth", "resume": "Heisuke teaches at his alma mater, an all-boy’s Buddhist high school and leads a very ordinary life, except for the fact that he is still tortured by the memory of an unfortunate incident that took place there involving him and his school 14 years ago. In hopes of closure, he strikes upon a plan to jointly hold this year’s Culture Festival with a nearby girl’s school, with which there are chilly relations. Determined at all costs to make the event a success, Heisuke finds himself dealing with a constant stream of problems along the way.", "rate": 70, "genre": ["Comedy", "Drama"], "cast": ["Ryo Nishikido", "Hikari Mitsushima", "Kento Nagayama", "Daiki Shigeoka", "Katsuhisa Namase"], "character": ["Heisuke Hara", "Risa Hachiya", "Satoshi Tsutaya", "Yuzuru Ebisawa", "Daizaburo Sannomiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62572   Expand Saving My Stupid Youth   (2014) User Score Overview Heisuke teaches at his alma mater, an all-boy’s Buddhist high school and leads a very ordinary life, except for the fact that he is still tortured by the memory of an unfortunate incident that took place there involving him and his school 14 years ago. In hopes of closure, he strikes upon a plan to jointly hold this year’s Culture Festival with a nearby girl’s school, with which there are chilly relations. Determined at all costs to make the event a success, Heisuke finds himself dealing with a constant stream of problems along the way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryo Nishikido Heisuke Hara Hikari Mitsushima Risa Hachiya Kento Nagayama Satoshi Tsutaya Daiki Shigeoka Yuzuru Ebisawa Katsuhisa Namase Daizaburo Sannomiya Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Saving My Stupid Youth premiered on October 12, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Saving My Stupid Youth. You can help by rating TV shows you've seen. Facts Original Name  ごめんね青春！ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.tbs.co.jp/gomenne_tbs/ Genres Comedy Drama Keywords school Content Score 86 Almost there... Top Contributors 25 thirstyhippo A 6 Aka75 4 Elizabeth Jennings f 3 flashcg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}