{"link": "https://www.themoviedb.org/tv/73199?language=en", "title": "Trust Me", "resume": "Having lost her job for whistle-blowing, a skilled, hardworking nurse assumes her best friend's identity as a senior doctor to start a new life in Edinburgh.", "rate": 65, "genre": ["Drama"], "cast": ["Jodie Whittaker", "Emun Elliott", "Sharon Small", "Blake Harrison", "Nathan Welsh"], "character": ["Cath Hardacre / Ally Sutton", "Andy Brenner", "Brigitte Rayne", "Karl", "Sam Kelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73199   Expand Trust Me   (2017) User Score  Play Trailer Overview Having lost her job for whistle-blowing, a skilled, hardworking nurse assumes her best friend's identity as a senior doctor to start a new life in Edinburgh. Featured Crew Dan Sefton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jodie Whittaker Cath Hardacre / Ally Sutton Emun Elliott Andy Brenner Sharon Small Brigitte Rayne Blake Harrison Karl Nathan Welsh Sam Kelly Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Trust Me premiered on August  8, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply b Opinions Open 2 by  bgirlmagic Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2017-08-27 Strike 6.2    2017-03-01 Chicago Justice 4.8    2012-06-26 Line of Duty 8.0    2016-09-08 Better Things 6.7    2014-10-28 The Missing 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  56m Homepage   http://www.bbc.co.uk/programmes/b091gt2l Genres Drama Keywords nurse emergency doctor Content Score 100 Yes! Looking good! Top Contributors 16 Elizabeth Jennings 13 Markxist 12 Steve 4 HugoVert  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}