{"link": "https://www.themoviedb.org/tv/58867?language=en", "title": "Life of Lies", "resume": "Mentir para vivir is a Mexican telenovela produced by Rosy Ocampo for Televisa. The telenovela is written by Maria Zarattini, who last wrote La Fuerza del Destino.\nMayrín Villanueva and David Zepeda star as the protagonists, while Altair Jarabo, Leticia Perdigón and Diego Olivera star as the antagonists.", "rate": 0, "genre": ["Drama", "Thriller"], "cast": ["Mayrín Villanueva", "David Zepeda", "Diego Olivera", "Altaír Jarabo", "Adriana Roel"], "character": ["Oriana Caligaris / Inés Valdivia", "Ricardo Sánchez Bretón", "José Luis Falcón / Francisco Castro", "Raquel Ledesma", "Paloma Aresti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58867   Expand Life of Lies   (2013) User Score Overview Mentir para vivir is a Mexican telenovela produced by Rosy Ocampo for Televisa. The telenovela is written by Maria Zarattini, who last wrote La Fuerza del Destino. Mayrín Villanueva and David Zepeda star as the protagonists, while Altair Jarabo, Leticia Perdigón and Diego Olivera star as the antagonists. Featured Crew María Zarattini Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mayrín Villanueva Oriana Caligaris / Inés Valdivia David Zepeda Ricardo Sánchez Bretón Diego Olivera José Luis Falcón / Francisco Castro Altaír Jarabo Raquel Ledesma Adriana Roel Paloma Aresti Full Cast & Crew Last Season Season 1 2013 | 1 Episode Season 1 of Life of Lies premiered on June  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Life of Lies. You can help by rating TV shows you've seen. Facts Original Name  Mentir para vivir Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://www.televisa.com/telenovelas/mentir-para-vivir/ Genres Drama Thriller Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 21 shiff7 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}