{"link": "https://www.themoviedb.org/tv/1981?language=en", "title": "Charmed", "resume": "Three sisters (Prue, Piper and Phoebe) reunite and unlock their powers to become the Charmed Ones, the most powerful good witches of all time, whose prophesied destiny is to protect innocent lives from evil beings such as demons and warlocks. Each sister possesses unique magical powers that grow and evolve, while they attempt to maintain normal lives in modern day San Francisco.", "rate": 68, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Holly Marie Combs", "Alyssa Milano", "Rose McGowan", "Brian Krause", "Kaley Cuoco"], "character": ["Piper Halliwell", "Phoebe Halliwell", "Paige Matthews", "Leo Wyatt", "Billie Jenkins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1981   Expand Charmed   (1998) User Score Overview Three sisters (Prue, Piper and Phoebe) reunite and unlock their powers to become the Charmed Ones, the most powerful good witches of all time, whose prophesied destiny is to protect innocent lives from evil beings such as demons and warlocks. Each sister possesses unique magical powers that grow and evolve, while they attempt to maintain normal lives in modern day San Francisco.  Featured Crew Constance M. Burge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  2 Images Backdrops  22 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Holly Marie Combs Piper Halliwell Alyssa Milano Phoebe Halliwell Rose McGowan Paige Matthews Brian Krause Leo Wyatt Kaley Cuoco Billie Jenkins Full Cast & Crew Last Season Season 8 2005 | 22 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Is the reboot still happening? Open 4 by  TheBayHarborButcher w Paige: Happy Birthday Rose McGowan! Open 0 by wonder2wonder\n      \n     S The Quite Timeline Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  22 Posters  12 Recommendations   1995-09-04 Xena: Warrior Princess 6.7    1997-03-10 Buffy the Vampire Slayer 8.0    1999-10-05 Angel 7.6    2005-09-23 Ghost Whisperer 5.6    2001-10-16 Smallville 6.9    1995-01-29 Hercules: The Legendary Journeys 6.3    2002-09-23 CSI: Miami 5.8    2006-09-25 Heroes 6.9  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Comedy Drama Mystery Keywords witch sibling relationship magic mermaid warrior woman spell female protagonist werewolf demon succubus Content Score 100 Yes! Looking good! Top Contributors 95 Marr 🇳🇱 31 Banana 22 Medianoche SK 20 Scott K  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}