{"link": "https://www.themoviedb.org/tv/220?language=en", "title": "Big Day", "resume": "Big Day, originally titled A Day in the Life, is an American situation comedy that first aired on ABC from November 28, 2006 to January 30, 2007. The series was co-produced by Josh Goldsmith and Cathy Yuspa and directed by Michael Spiller for Sony Pictures Television. In Canada, the series aired on CanWest's Global and CH stations.\nOriginally, it was supposed to debut on October 5, 2006, along with Notes from the Underbelly, but ABC made a last-minute change in its schedule by moving Ugly Betty to Thursday, thus replacing both sitcoms whose \"buzz\" was not especially promising.\nBig Day was broadcast on Tuesdays at 9:00/8:00c. The timeslot was to be filled by another new sitcom that had a better \"buzz,\" The Knights of Prosperity, but ABC moved that program to Wednesdays to make Big Day a priority. According to the ratings, Big Day turned out to be a ratings disappointment.\nWhen Big Day ended its first season on January 30, 2007, only 12 of the 13 produced episodes aired leaving the 13th episode, titled The $10,000 Check, unaired.\nOn May 15, 2007, ABC officially cancelled the show after the network announced their 2007-2008 fall schedule.\nA film based on the show was cancelled twice in development from 2007 to 2008. In 2010, a re-version of the movie adaptation is currently in Pre-Production.", "rate": 20, "genre": ["Comedy"], "cast": ["Stephnie Weir", "Josh Cooke", "Marla Sokoloff", "Miriam Shor", "Kurt Fuller"], "character": ["Lorna", "Bandana", "Alice", "Becca", "Scuba Steve"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 220   Expand Big Day   (2006) User Score Overview Big Day, originally titled A Day in the Life, is an American situation comedy that first aired on ABC from November 28, 2006 to January 30, 2007. The series was co-produced by Josh Goldsmith and Cathy Yuspa and directed by Michael Spiller for Sony Pictures Television. In Canada, the series aired on CanWest's Global and CH stations. Originally, it was supposed to debut on October 5, 2006, along with Notes from the Underbelly, but ABC made a last-minute change in its schedule by moving Ugly Betty to Thursday, thus replacing both sitcoms whose \"buzz\" was not especially promising. Big Day was broadcast on Tuesdays at 9:00/8:00c. The timeslot was to be filled by another new sitcom that had a better \"buzz,\" The Knights of Prosperity, but ABC moved that program to Wednesdays to make Big Day a priority. According to the ratings, Big Day turned out to be a ratings disappointment. When Big Day ended its first season on January 30, 2007, only 12 of the 13 produced episodes aired leaving the 13th episode, titled The $10,000 Check, unaired. On May 15, 2007, ABC officially cancelled the show after the network announced their 2007-2008 fall schedule. A film based on the show was cancelled twice in development from 2007 to 2008. In 2010, a re-version of the movie adaptation is currently in Pre-Production. Featured Crew Josh Goldsmith Creator Cathy Yuspa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephnie Weir Lorna Josh Cooke Bandana Marla Sokoloff Alice Miriam Shor Becca Kurt Fuller Scuba Steve Full Cast & Crew Last Season Season 1 2006 | 13 Episodes Season 1 of Big Day premiered on November 28, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Big Day. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords wedding sitcom Content Score 93 Almost there... Top Contributors 10 Banana 6 lineker z 4 zurman1 b 3 b2k  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}