{"link": "https://www.themoviedb.org/tv/35490?language=en", "title": "The Last Don II", "resume": "As the elder don dies, his young heir moves into the position. He quickly proves to be as ruthless as he tries to discover who has launched a plot to overthrow his rule and may be infiltrating other families. In a left over plot line, his aunt discovers that the young don had her son murdered first setting her off in a plot to kill him. Then when she is stopped she is driven into the arms of a conflicted priest. Meanwhile, an undercover FBI agent moves into the family home as a teacher for the don's handicapped daughter.", "rate": 62, "genre": ["Crime", "Drama"], "cast": ["Jason Gedrick", "Patsy Kensit", "Kirstie Alley", "David Marciano", "James Wilder"], "character": ["Cross De Lena", "Josie Cirolia", "Rose Marie Clericuzio", "Giorgio Clericuzio", "Billy D'Angelo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35490   Expand The Last Don II   (1998) User Score Overview As the elder don dies, his young heir moves into the position. He quickly proves to be as ruthless as he tries to discover who has launched a plot to overthrow his rule and may be infiltrating other families. In a left over plot line, his aunt discovers that the young don had her son murdered first setting her off in a plot to kill him. Then when she is stopped she is driven into the arms of a conflicted priest. Meanwhile, an undercover FBI agent moves into the family home as a teacher for the don's handicapped daughter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Gedrick Cross De Lena Patsy Kensit Josie Cirolia Kirstie Alley Rose Marie Clericuzio David Marciano Giorgio Clericuzio James Wilder Billy D'Angelo Full Cast & Crew Last Season Miniseries 1998 | 2 Episodes Season 1 of The Last Don II premiered on May  2, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Last Don II. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1997-05-11 The Last Don 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Crime Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors TB 24 TMDb Bot R 5 Rebecca w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}