{"link": "https://www.themoviedb.org/tv/37558?language=en", "title": "The Legend of Condor Hero", "resume": "The Legend of Condor Hero is a Japanese/Chinese animation, it's an anime adaptation of The Return of the Condor Heroes, a wuxia novel by Louis Cha.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Mie Sonozaki", "Jouji Nakata", "Shiho Kikuchi", "Chieko Honda", "Urara Takano"], "character": ["Shouryuujo", "Kakusei", "Yaritsu En", "Kan Gan Hei", "Ribakushuu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37558   Expand The Legend of Condor Hero   (2001) User Score Overview The Legend of Condor Hero is a Japanese/Chinese animation, it's an anime adaptation of The Return of the Condor Heroes, a wuxia novel by Louis Cha. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mie Sonozaki Shouryuujo Jouji Nakata Kakusei Shiho Kikuchi Yaritsu En Chieko Honda Kan Gan Hei Urara Takano Ribakushuu Full Cast & Crew Last Season Legend of the condor hero season 1 2001 | 52 Episodes Season 1 of The Legend of Condor Hero premiered on October 11, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Condor Hero. You can help by rating TV shows you've seen. Facts Original Name  神鵰侠侶 コンドルヒーロー Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}