{"link": "https://www.themoviedb.org/tv/61441?language=en", "title": "Yowamushi Pedal", "resume": "Sakamichi Onada is a wimpy high school freshman who loves anime. He initially wants to enter the anime club, but winds up joining the cycling club after meeting two classmates who are already famous cyclists. He undertakes the grueling training to compete in races, and discovers his own hidden talent in cycling.", "rate": 74, "genre": ["Comedy", "Animation"], "cast": ["Daiki Yamashita", "Kohsuke Toriumi", "Hiroki Yasumoto", "Kentaro Ito", "Daisuke Kishio"], "character": ["Onoda Sakamichi (voice)", "Imaizumi Shunsuke (voice)", "Kinjō Shingo (voice)", "Tadokoro Jin (voice)", "Teshima Junta (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61441   Expand Yowamushi Pedal   (2013) User Score  Play Trailer Overview Sakamichi Onada is a wimpy high school freshman who loves anime. He initially wants to enter the anime club, but winds up joining the cycling club after meeting two classmates who are already famous cyclists. He undertakes the grueling training to compete in races, and discovers his own hidden talent in cycling. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daiki Yamashita Onoda Sakamichi (voice) Kohsuke Toriumi Imaizumi Shunsuke (voice) Hiroki Yasumoto Kinjō Shingo (voice) Kentaro Ito Tadokoro Jin (voice) Daisuke Kishio Teshima Junta (voice) Full Cast & Crew Current Season Yowamushi Pedal: Glory Line 2018 | 25 Episodes Season 4 of Yowamushi Pedal premiered on January  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2012-04-07 Kuroko's Basketball 7.9  Facts Original Name  弱虫ペダル Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://yowapeda.com/ Genres Comedy Animation Keywords sport cycling anime Content Score 93 Almost there... Top Contributors C 35 Chintaran 30 Elizabeth Jennings 24 sp1ti Z 17 Zayrus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}