{"link": "https://www.themoviedb.org/tv/34094?language=en", "title": "Virus: Virus Buster Serge", "resume": "Virus Buster Serge, known in Japan simply as Virus is a Japanese media franchise. It originated as an adventure game for the Sega Saturn. It was adapted into an anime television series which was directed by Masami Ōbari, produced by J.C.Staff and Plum, and aired on AT-X and TV Tokyo from October 2 to December 19, 1997. A light novel and second video game were also created.\nIn the year 2097 in the city of Neo Hong Kong, man and machine have melded nicely and the city has been blooming with technological advances. However, an entity that takes over the machines called the Virus is becoming a problem. For this problem, there exists the organization STAND equipped with their Gears led by the mysterious Raven. The latest member of the team is Serge, a man who cannot remember his past and thought joining STAND and confronting Raven would help him better understand. Little does he know how important he will become to the whole Virus conflict.\nOnly the anime has been adapted into English. It was licensed by Madman Entertainment in Australia and New Zealand and by Manga Entertainment in North America and the United Kingdom. The anime briefly aired on the American cable television Sci Fi Channel in 2007 and the Canadain cable channel IFC in 2008.", "rate": 0, "genre": ["Animation"], "cast": ["Hirotaka Suzuoki", "Mayumi Iizuka", "Ai Orikasa", "Haruna Ikezawa", "Kazuki Yao"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34094   Expand Virus: Virus Buster Serge   (1997) User Score Overview Virus Buster Serge, known in Japan simply as Virus is a Japanese media franchise. It originated as an adventure game for the Sega Saturn. It was adapted into an anime television series which was directed by Masami Ōbari, produced by J.C.Staff and Plum, and aired on AT-X and TV Tokyo from October 2 to December 19, 1997. A light novel and second video game were also created. In the year 2097 in the city of Neo Hong Kong, man and machine have melded nicely and the city has been blooming with technological advances. However, an entity that takes over the machines called the Virus is becoming a problem. For this problem, there exists the organization STAND equipped with their Gears led by the mysterious Raven. The latest member of the team is Serge, a man who cannot remember his past and thought joining STAND and confronting Raven would help him better understand. Little does he know how important he will become to the whole Virus conflict. Only the anime has been adapted into English. It was licensed by Madman Entertainment in Australia and New Zealand and by Manga Entertainment in North America and the United Kingdom. The anime briefly aired on the American cable television Sci Fi Channel in 2007 and the Canadain cable channel IFC in 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hirotaka Suzuoki Mayumi Iizuka Ai Orikasa Haruna Ikezawa Kazuki Yao Full Cast & Crew Last Season Season 1 1997 | 12 Episodes Season 1 of Virus: Virus Buster Serge premiered on October  2, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Virus: Virus Buster Serge. You can help by rating TV shows you've seen. Facts Original Name  VIRUS -VIRUS BUSTER SERGE- Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 seboseboss 3 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}