{"link": "https://www.themoviedb.org/tv/76307?language=en", "title": "Dirty Money", "resume": "From crippling payday loans to cars that cheat emissions tests, this investigative series exposes brazen acts of corporate greed and corruption.", "rate": 62, "genre": ["Crime", "Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76307   Expand Dirty Money   (2018) User Score  Play Trailer Overview From crippling payday loans to cars that cheat emissions tests, this investigative series exposes brazen acts of corporate greed and corruption. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Dirty Money premiered on January 26, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply This new Netflix series continues the trend... Open 0 by Daddie0\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2008-09-03 Sons of Anarchy 7.8    2015-08-28 Narcos 8.0    2011-12-04 Black Mirror 8.2    2013-02-01 House of Cards 8.2    2013-07-11 Orange Is the New Black 7.4    2002-06-02 The Wire 8.4    2016-10-02 Westworld 8.1    2015-02-08 Better Call Saul 8.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  75m, 50m Homepage   https://www.netflix.com/title/80118100 Genres Crime Documentary Keywords corruption corporate greed Content Score 64 We're so close, yet so far. Top Contributors 49 Elizabeth Jennings m 8 marriedtoafly Y 6 YJ 5 .maxx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}