{"link": "https://www.themoviedb.org/tv/63529?language=en", "title": "Twenty Again", "resume": "Due to an unplanned pregnancy, Ha No Ra married young and dropped out of school. But after two decades as a housewife, she finally gets the chance to experience college, alongside her 20-year-old son Kim Min Soo and his girlfriend Oh Hye Mi. Further complicating things, No Ra already has a strained student-teacher relationship, as her husband Kim Woo Chul and her first love Cha Hyun Suk wind up being her professors.", "rate": 65, "genre": ["Comedy", "Romance"], "cast": ["Choi Ji-woo", "Ha Seung-Ri", "Lee Sang-yoon", "Kim Hee-Chan", "Choi Won-young"], "character": ["Ha No-Ra", "Ha No-Ra (young)", "Cha Hyun-Seok", "Cha Hyun-Seok (young)", "Kim Woo-Cheol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63529   Expand Twenty Again   (2015) User Score Overview Due to an unplanned pregnancy, Ha No Ra married young and dropped out of school. But after two decades as a housewife, she finally gets the chance to experience college, alongside her 20-year-old son Kim Min Soo and his girlfriend Oh Hye Mi. Further complicating things, No Ra already has a strained student-teacher relationship, as her husband Kim Woo Chul and her first love Cha Hyun Suk wind up being her professors. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Ji-woo Ha No-Ra Ha Seung-Ri Ha No-Ra (young) Lee Sang-yoon Cha Hyun-Seok Kim Hee-Chan Cha Hyun-Seok (young) Choi Won-young Kim Woo-Cheol Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Twenty Again premiered on August 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   2016-02-24 Please Come Back, Mister 7.0    2016-05-02 Another Miss Oh 7.8    2016-08-12 Cinderella and Four Knights 5.8    2016-12-19 Hwarang: The Poet Warrior Youth 6.7  Facts Original Name  두번째 스무살 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/secondtwenty Genres Comedy Romance Keywords college housewife korea back to school Content Score 86 Almost there... Top Contributors M 42 Maria180493 16 Elizabeth Jennings 7 Imzadi 5 Kyukun  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}