{"link": "https://www.themoviedb.org/tv/43331?language=en", "title": "Paradise Ranch", "resume": "A divorced couple who married when they were 19 meet six years later and rediscover their feelings for each other.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Shim Chang-min", "Lee Yeon-hee", "Joo Sang-wook", "Im Soo-hyang", "Lee Si-eon"], "character": ["Han Dong-Joo", "Lee Da-ji", "Seo Yoon-ho", "Lee Da-eun", "Secretary Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43331   Expand Paradise Ranch   (2011) User Score Overview A divorced couple who married when they were 19 meet six years later and rediscover their feelings for each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shim Chang-min Han Dong-Joo Lee Yeon-hee Lee Da-ji Joo Sang-wook Seo Yoon-ho Im Soo-hyang Lee Da-eun Lee Si-eon Secretary Lee Full Cast & Crew Last Season Season 1 2011 | 16 Episodes Season 1 of Paradise Ranch premiered on January 24, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Paradise Ranch. You can help by rating TV shows you've seen. Facts Original Name  파라다이스 목장 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/paradiseranch/ Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors M 23 Maria180493 CM 6 Cherche Moi s 3 speedycars s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}