{"link": "https://www.themoviedb.org/tv/21086?language=en", "title": "Animal Mechanicals", "resume": "Animal Mechanicals is a Decode Entertainment television series created by Jeff Rosen and produced by Halifax Film, a DHX Media Company, in association with CBC.\nAnimal Mechanicals Rex, Unicorn, Komodo, Mouse, and Sasquatch, live and play in a place unlike any other; a colorful \"snap-together-take-apart\" world which can also transform. Things are always popping up, changing shape and most of all presenting challenges to the animal mechanicals. In each adventure the animal mechanicals get their new mission from Island Owl who displays images on her face, which changes to a screen. Each adventure has a variety of small challenges to overcome on the road to accomplishing the mission they are given. The challenges vary requiring the animal mechanicals to use their wide array of unique transformed \"Mechana\" abilities. The animal mechanicals must decide who should face each challenge.", "rate": 60, "genre": ["Animation"], "cast": ["Jim Fowler", "Lenore Zann"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21086   Expand Animal Mechanicals   (2008) User Score Overview Animal Mechanicals is a Decode Entertainment television series created by Jeff Rosen and produced by Halifax Film, a DHX Media Company, in association with CBC. Animal Mechanicals Rex, Unicorn, Komodo, Mouse, and Sasquatch, live and play in a place unlike any other; a colorful \"snap-together-take-apart\" world which can also transform. Things are always popping up, changing shape and most of all presenting challenges to the animal mechanicals. In each adventure the animal mechanicals get their new mission from Island Owl who displays images on her face, which changes to a screen. Each adventure has a variety of small challenges to overcome on the road to accomplishing the mission they are given. The challenges vary requiring the animal mechanicals to use their wide array of unique transformed \"Mechana\" abilities. The animal mechanicals must decide who should face each challenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Fowler Lenore Zann Full Cast & Crew Last Season Season 1 2008 | 20 Episodes Season 1 of Animal Mechanicals premiered on September  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Animal Mechanicals. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 kuzronk 3 Banana p 3 pepitopajas JM 1 James Maxwel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}