{"link": "https://www.themoviedb.org/tv/40016?language=en", "title": "Warrior Baek Dong Soo", "resume": "Warrior Baek Dong-soo is a 2011 South Korean fusion historical/action television series starring Ji Chang-wook, Yoo Seung-ho, Yoon So-yi, Shin Hyun-bin, Choi Min-soo and Jun Kwang-ryul. It aired on SBS from July 4 to October 10, 2011 on Mondays and Tuesdays at 21:55 for 29 episodes. Based on the 2010 comic Honorable Baek Dong-soo by Lee Jae-heon, the series is about how Joseon historical figure Baek Dong-soo grew to become a swordsman and folk hero. Baek was one of the three authors of Muyedobotongji, a pivotal martial arts work commissioned by King Jeongjo. Set against the backdrop of political maneuverings in Joseon between different factions, namely those led by King Jeongjo, by the Qing ambassador, by the Japanese swordsman Kenzo, and the assassin's guild Heuksa Chorong, at its core the series is a coming-of-age drama about brotherhood, friendship, loyalty and honor.", "rate": 90, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ji Chang-wook", "Yeo Jin-goo", "Yoo Seung-Ho", "Park Gun-tae", "Yoon Soy"], "character": ["Baek Dong-soo", "Baek Dong-soo (young)", "Yeo Woon", "Yeo Woon (young)", "Hwang Jin-joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40016   Expand Warrior Baek Dong Soo   (2011) User Score Overview Warrior Baek Dong-soo is a 2011 South Korean fusion historical/action television series starring Ji Chang-wook, Yoo Seung-ho, Yoon So-yi, Shin Hyun-bin, Choi Min-soo and Jun Kwang-ryul. It aired on SBS from July 4 to October 10, 2011 on Mondays and Tuesdays at 21:55 for 29 episodes. Based on the 2010 comic Honorable Baek Dong-soo by Lee Jae-heon, the series is about how Joseon historical figure Baek Dong-soo grew to become a swordsman and folk hero. Baek was one of the three authors of Muyedobotongji, a pivotal martial arts work commissioned by King Jeongjo. Set against the backdrop of political maneuverings in Joseon between different factions, namely those led by King Jeongjo, by the Qing ambassador, by the Japanese swordsman Kenzo, and the assassin's guild Heuksa Chorong, at its core the series is a coming-of-age drama about brotherhood, friendship, loyalty and honor. Featured Crew Lee Hyun-jik Creator Kim Hong-sun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Chang-wook Baek Dong-soo Yeo Jin-goo Baek Dong-soo (young) Yoo Seung-Ho Yeo Woon Park Gun-tae Yeo Woon (young) Yoon Soy Hwang Jin-joo Full Cast & Crew Last Season Season 1 2011 | 29 Episodes Season 1 of Warrior Baek Dong Soo premiered on July  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Warrior Baek Dong Soo. You can help by rating TV shows you've seen. Facts Original Name  무사 백동수 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.tv.sbs.co.kr/baekdongsoo/ Genres Action & Adventure Drama Keywords korea historical Content Score 100 Yes! Looking good! Top Contributors M 30 Maria180493 11 part-mozi CM 11 Cherche Moi N 9 Nightowl.Kr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}