{"link": "https://www.themoviedb.org/tv/131?language=en", "title": "Space Sentinels", "resume": "Space Sentinels is a Saturday morning animated series produced by Filmation which debuted on the American NBC network on September 10, 1977 and ran for thirteen half-hour episodes. The series has been called \"ahead of its time\" due to its racially diverse cast of main characters.\nIn this series, the Roman mythological figures Hercules and Mercury are joined by Astrea, a character created specifically for the series, to form a superhero team to protect mankind.\nThe complete series was released on Region 1 DVD on August 22, 2006, along with the complete series of The Freedom Force.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Animation"], "cast": ["Evan C. Kim", "George DiCenzo", "Lou Scheimer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 131   Expand Space Sentinels   (1977) User Score Overview Space Sentinels is a Saturday morning animated series produced by Filmation which debuted on the American NBC network on September 10, 1977 and ran for thirteen half-hour episodes. The series has been called \"ahead of its time\" due to its racially diverse cast of main characters. In this series, the Roman mythological figures Hercules and Mercury are joined by Astrea, a character created specifically for the series, to form a superhero team to protect mankind. The complete series was released on Region 1 DVD on August 22, 2006, along with the complete series of The Freedom Force. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Evan C. Kim George DiCenzo Lou Scheimer Full Cast & Crew Last Season Season 1 1977 | 13 Episodes Season 1 of Space Sentinels premiered on September 10, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Space Sentinels. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Sci-Fi & Fantasy Animation Keywords superhero greek mythology hercules Content Score 43 There's no 'I' in team... Top Contributors 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}