{"link": "https://www.themoviedb.org/tv/68033?language=en", "title": "Rookie Agent Rouge", "resume": "Can  a young woman prove her loyalty to her country and her family? Lan Yan  Zhi is a privileged banker’s daughter in Shanghai and a  student activist who mistakenly comes into possession of a letter from  the Japanese Army in 1937. She gets misunderstood for a spy by her  crush, Zhou Yu Hao, an upstanding officer in the Chinese Army.  To prove her innocence, Yan Zhi agrees to infiltrate the home of her  best friend, Feng Man Na, and help Yu Hao track down a  mysterious “Mister Traitor.” But what will Yan Zhi do when the search  leads to a member of her own family?", "rate": 56, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["Lu Yi", "Zhao Liying", "Yuan Wenkang", "Tao Xinran", "Li Meng Na"], "character": ["Zhou Yu Hao", "Lan Yan Zhi", "Song Mian", "Feng Man Na", "Wan Zhi Chao"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68033   Expand Rookie Agent Rouge   (2016) User Score Overview Can  a young woman prove her loyalty to her country and her family? Lan Yan  Zhi is a privileged banker’s daughter in Shanghai and a  student activist who mistakenly comes into possession of a letter from  the Japanese Army in 1937. She gets misunderstood for a spy by her  crush, Zhou Yu Hao, an upstanding officer in the Chinese Army.  To prove her innocence, Yan Zhi agrees to infiltrate the home of her  best friend, Feng Man Na, and help Yu Hao track down a  mysterious “Mister Traitor.” But what will Yan Zhi do when the search  leads to a member of her own family? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lu Yi Zhou Yu Hao Zhao Liying Lan Yan Zhi Yuan Wenkang Song Mian Tao Xinran Feng Man Na Li Meng Na Wan Zhi Chao Full Cast & Crew Last Season Season 1 2016 | 45 Episodes Season 1 of Rookie Agent Rouge premiered on September 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2015-07-22 Diamond Lover 6.9    2016-03-06 Refresh Man 7.0  Facts Original Name  胭脂 Status  Ended Networks JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Drama War & Politics Keywords china espionage historical military Content Score 86 Almost there... Top Contributors M 30 Maria180493 25 daliasued k 21 kayl4 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}