{"link": "https://www.themoviedb.org/tv/80350?language=en", "title": "New Amsterdam", "resume": "Inspired by Bellevue, the oldest public hospital in America, this unique medical drama follows the brilliant and charming Dr. Max Goodwin, the institution's newest medical director, who sets out to tear up the bureaucracy and provide exceptional care.", "rate": 0, "genre": ["Drama"], "cast": ["Ryan Eggold", "Freema Agyeman", "Janet Montgomery", "Jocko Sims", "Anupam Kher"], "character": ["Dr. Max Goodwin", "Dr. Hana Sharpe", "Dr. Laura Bloom", "Dr. Floyd Pearson", "Dr. Anil Kapoor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80350   Expand New Amsterdam   (2018) User Score Overview Inspired by Bellevue, the oldest public hospital in America, this unique medical drama follows the brilliant and charming Dr. Max Goodwin, the institution's newest medical director, who sets out to tear up the bureaucracy and provide exceptional care. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Eggold Dr. Max Goodwin Freema Agyeman Dr. Hana Sharpe Janet Montgomery Dr. Laura Bloom Jocko Sims Dr. Floyd Pearson Anupam Kher Dr. Anil Kapoor Full Cast & Crew Next Season Season 1 2018 | 1 Episode Season 1 of New Amsterdam is set to premiere on September 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  In Production Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   https://www.nbc.com/new-amsterdam Genres Drama Keywords hospital doctor medical drama Content Score 86 Almost there... Top Contributors j 16 jd1048576 R 13 Rebecca 8 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}