{"link": "https://www.themoviedb.org/tv/33289?language=en", "title": "Grandma's House", "resume": "Grandma's House is a sitcom television series broadcast on BBC Two. Written by Simon Amstell and long term collaborator Dan Swimer, the series stars Simon Amstell playing a version of himself: an ex-television presenter searching for meaning in his life. Each episode takes place at his Grandma's house, where Grandma welcomes her family, desperate to see everyone happy.\nThe first series was shown in 2010, the second in 2012. In December 2012 Amstell stated that there would not be a third series", "rate": 63, "genre": ["Comedy"], "cast": ["Samantha Spiro", "Simon Amstell", "Geoffrey Hutchings", "Rebecca Front", "Linda Bassett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33289   Expand Grandma's House   (2010) User Score Overview Grandma's House is a sitcom television series broadcast on BBC Two. Written by Simon Amstell and long term collaborator Dan Swimer, the series stars Simon Amstell playing a version of himself: an ex-television presenter searching for meaning in his life. Each episode takes place at his Grandma's house, where Grandma welcomes her family, desperate to see everyone happy. The first series was shown in 2010, the second in 2012. In December 2012 Amstell stated that there would not be a third series Featured Crew Simon Amstell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samantha Spiro Simon Amstell Geoffrey Hutchings Rebecca Front Linda Bassett Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of Grandma's House premiered on April 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Grandma's House. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords family british humour grandma Content Score 93 Almost there... Top Contributors O 5 Ozbourne d 4 dariushuntly R 3 Rebecca s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}