{"link": "https://www.themoviedb.org/tv/43887?language=en", "title": "Mobile Suit Gundam: The 08th MS Team", "resume": "Mobile Suit Gundam: The 08th MS Team is an original video animation anime series in the Gundam franchise. Released from January 25, 1996, to April 25, 1999, the 12-episode series details the exploits of an Earth Federation ground unit during the One Year War - specifically a month after the beginning of original 1979 Gundam series and into the final weeks of the war. The 08th MS Team is the first Gundam series to show the war from the viewpoint of the average soldier.", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43887   Expand Mobile Suit Gundam: The 08th MS Team   (1996) User Score Overview Mobile Suit Gundam: The 08th MS Team is an original video animation anime series in the Gundam franchise. Released from January 25, 1996, to April 25, 1999, the 12-episode series details the exploits of an Earth Federation ground unit during the One Year War - specifically a month after the beginning of original 1979 Gundam series and into the final weeks of the war. The 08th MS Team is the first Gundam series to show the war from the viewpoint of the average soldier. Featured Crew Takeyuki Kanda Creator Yoshiyuki Tomino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season TV Series 1996 | 12 Episodes Season 1 of Mobile Suit Gundam: The 08th MS Team premiered on January 25, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam: The 08th MS Team. You can help by rating TV shows you've seen. Facts Original Name  機動戦士ガンダム 第08MS小隊 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 13 Jenazad 6 YabukiJoe1 s 4 sleeve t 3 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}