{"link": "https://www.themoviedb.org/tv/34684?language=en", "title": "Rizelmine", "resume": "Rizelmine is a manga series written and illustrated by Yukiru Sugisaki. The manga was originally serialized for six chapters in the Kadokawa Shoten magazine Ace Next from November 2001 to April 2002 with a single tankōbon collection released on March 22, 2002. The manga has was translated into English and published in the North America by Tokyopop on August 9, 2005. An anime adaptation co-produced by m.o.e, Imagin, and Madhouse aired on Japan's Kids Station in 2002, but has not been licensed in English. Rizelmine was split into two seasons, both containing 12 episodes each. The first season aired April 2, 2002 through June 18, 2002. The second season, titled Rizelmine II, aired October 5, 2002 through December 21, 2002.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Rie Kugimiya", "Kappei Yamaguchi", "Chihiro Suzuki", "Masumi Asano", "Rie Tanaka"], "character": ["Rizel Iwaki", "Tomonori Iwaki", "Ryunosuke Hououin", "Aoi Seimoto", "Kyoko Yachigusa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34684   Expand Rizelmine   (2002) User Score Overview Rizelmine is a manga series written and illustrated by Yukiru Sugisaki. The manga was originally serialized for six chapters in the Kadokawa Shoten magazine Ace Next from November 2001 to April 2002 with a single tankōbon collection released on March 22, 2002. The manga has was translated into English and published in the North America by Tokyopop on August 9, 2005. An anime adaptation co-produced by m.o.e, Imagin, and Madhouse aired on Japan's Kids Station in 2002, but has not been licensed in English. Rizelmine was split into two seasons, both containing 12 episodes each. The first season aired April 2, 2002 through June 18, 2002. The second season, titled Rizelmine II, aired October 5, 2002 through December 21, 2002. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Kugimiya Rizel Iwaki Kappei Yamaguchi Tomonori Iwaki Chihiro Suzuki Ryunosuke Hououin Masumi Asano Aoi Seimoto Rie Tanaka Kyoko Yachigusa Full Cast & Crew Last Season Season 2 2002 | 12 Episodes Season 2 of Rizelmine premiered on October  5, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rizelmine. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin 1 Irresponsibletyler  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}