{"link": "https://www.themoviedb.org/tv/2317?language=en", "title": "My Name Is Earl", "resume": "When petty criminal Earl Hickey wins the lottery, he sets off on a quest to repair his questionable karma.", "rate": 72, "genre": ["Comedy"], "cast": ["Jason Lee", "Ethan Suplee", "Nadine Velazquez", "Jaime Pressly", "Eddie Steeples"], "character": ["Earl Hickey", "Randy Hickey", "Catalina Aruca", "Joy Turner", "Darnell Turner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2317   Expand My Name Is Earl   (2005) User Score  Play Trailer Overview When petty criminal Earl Hickey wins the lottery, he sets off on a quest to repair his questionable karma. Featured Crew Greg Garcia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  27 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Lee Earl Hickey Ethan Suplee Randy Hickey Nadine Velazquez Catalina Aruca Jaime Pressly Joy Turner Eddie Steeples Darnell Turner Full Cast & Crew Last Season Season 4 2008 | 27 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Joy: Happy Birthday Jaime Pressly! Open 0 by wonder2wonder\n      \n     w \"My name is Karma\" Open 0 by wonder2wonder\n      \n     w Earl: Happy Birthday Jason Lee! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  27 Posters  6 Recommendations   2000-01-09 Malcolm in the Middle 7.5    2001-10-02 Scrubs 7.7    1998-08-23 That '70s Show 7.4    1996-09-13 Everybody Loves Raymond 6.3    1989-07-05 Seinfeld 8.2    1982-09-30 Cheers 7.5    1990-09-10 The Fresh Prince of Bel-Air 7.3    1997-01-12 King of the Hill 7.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  21m, 30m Homepage   http://www.nbc.com/my-name-is-earl Genres Comedy Keywords white trash good deed karma sitcom Content Score 100 Yes! Looking good! Top Contributors l 16 lostarchitect 13 Banana 8 seawolf 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}