{"link": "https://www.themoviedb.org/tv/65704?language=en", "title": "Idiotsitter", "resume": "When wild child Gene is put under house arrest in her family's mansion, her parents hire buttoned-up nanny Billie to look after her. Trapped in each other’s company, the two strike up an unlikely friendship and cause all sorts of trouble. It's an odd-couple story that reaches new depths of depravity.", "rate": 59, "genre": ["Comedy"], "cast": ["Jillian Bell", "Charlotte Newhouse"], "character": ["Gene Russell", "Billie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65704   Expand Idiotsitter   (2016) User Score  Play Trailer Overview When wild child Gene is put under house arrest in her family's mansion, her parents hire buttoned-up nanny Billie to look after her. Trapped in each other’s company, the two strike up an unlikely friendship and cause all sorts of trouble. It's an odd-couple story that reaches new depths of depravity. Featured Crew Charlotte Newhouse Creator Jillian Bell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jillian Bell Gene Russell Charlotte Newhouse Billie Full Cast & Crew Last Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2016-01-13 Teachers 7.1    2015-08-05 Difficult People 7.4    2013-11-24 Getting On 6.8    2017-05-24 White Gold 6.8    2016-09-22 Easy 5.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  21m Homepage   http://cc.com/shows/idiotsitter Genres Comedy Keywords babysitter house arrest wealthy los angeles sitcom Content Score 71 Just a little bit more... Top Contributors 32 Banana b 7 bowen4514@gmail.com A 5 AlloVidnet 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}