{"link": "https://www.themoviedb.org/tv/9196?language=en", "title": "Comedy Lab", "resume": "Comedy Lab is a British television series which showcases pilots of experimental comedy shows. Series have been aired irregularly on Channel 4 and E4 since 1998.\nSeveral pilots first shown on Comedy Lab have gone on to spawn full series, most notably Trigger Happy TV, Fonejacker, That Peter Kay Thing, Meet the Magoons and FM. It also gave Jimmy Carr his first television appearance in Jimmy Carr's World of…Corporate Videos.\nThe 2001 series features the episodes Knife and Wife, Orcadia, Daydream Believers: Brand New Beamer and Jimmy Carr's World of…Corporate Videos featuring Jimmy Carr.\nThe 2008 series features the episodes Headwreckers, Mr and Mrs Fandango, Olivia Lee's Naughty Bits, Karl Pilkington: Satisfied Fool, Pappy's Fun Club, School of Comedy and Slaterwood.\n2010's shows are iCandy, Happy Finish, Penelope Princess of Pets, Jack Whitehall Secret Census, Filth, Moviemash and Hung Out.\nThe 2011 lineup includes: Anna & Katy, Totally Tom and Rick and Peter.", "rate": 100, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9196   Expand Comedy Lab   (1998) User Score Overview Comedy Lab is a British television series which showcases pilots of experimental comedy shows. Series have been aired irregularly on Channel 4 and E4 since 1998. Several pilots first shown on Comedy Lab have gone on to spawn full series, most notably Trigger Happy TV, Fonejacker, That Peter Kay Thing, Meet the Magoons and FM. It also gave Jimmy Carr his first television appearance in Jimmy Carr's World of…Corporate Videos. The 2001 series features the episodes Knife and Wife, Orcadia, Daydream Believers: Brand New Beamer and Jimmy Carr's World of…Corporate Videos featuring Jimmy Carr. The 2008 series features the episodes Headwreckers, Mr and Mrs Fandango, Olivia Lee's Naughty Bits, Karl Pilkington: Satisfied Fool, Pappy's Fun Club, School of Comedy and Slaterwood. 2010's shows are iCandy, Happy Finish, Penelope Princess of Pets, Jack Whitehall Secret Census, Filth, Moviemash and Hung Out. The 2011 lineup includes: Anna & Katy, Totally Tom and Rick and Peter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 12 2011 | 3 Episodes Season 12 of Comedy Lab premiered on September  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Comedy Lab. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords failed tv pilot sketch comedy british humour Content Score 56 We're so close, yet so far. Top Contributors a 17 alexmate 5 Banana O 1 Ozbourne 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}