{"link": "https://www.themoviedb.org/tv/69405?language=en", "title": "The Accursed Kings", "resume": "A sequence of seven episodes detailing the French monarchy.", "rate": 0, "genre": ["Drama"], "cast": ["Gérard Depardieu", "Hugues Dalmagro", "Jeanne Moreau", "Claude Rich", "Line Renaud"], "character": ["Jacques de Molay", "Capitaine des gardes", "Mahaut d'Artois", "Le cardinal Deuze", "Marie de Hongrie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69405   Expand The Accursed Kings   (2005) User Score Overview A sequence of seven episodes detailing the French monarchy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gérard Depardieu Jacques de Molay Hugues Dalmagro Capitaine des gardes Jeanne Moreau Mahaut d'Artois Claude Rich Le cardinal Deuze Line Renaud Marie de Hongrie Full Cast & Crew Last Season Season 1 2005 | 5 Episodes Season 1 of The Accursed Kings premiered on July 11, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Accursed Kings. You can help by rating TV shows you've seen. Facts Original Name  Les rois maudits Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Miniseries Original Language  French Runtime  90m Homepage   http://les-rois-maudits.france2.fr/ Genres Drama Keywords history Content Score 86 Almost there... Top Contributors 66 waaw s 7 speedycars t 6 tmdb96173038 E 4 EvelRus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}