{"link": "https://www.themoviedb.org/tv/10100?language=en", "title": "Denver, the Last Dinosaur", "resume": "Denver, the Last Dinosaur is a U.S.-French cartoon for children originally released in 1988 by World Events Productions. It was nationally syndicated throughout the United States in 1988 with reruns airing until 1990. Episodes often focused on issues of conservation, ecology, and friendship.\nThe show ran for two seasons, as the dinosaur boom that had followed The Land Before Time waned, causing viewership to drop. The series received a recommendation from the National Educational Association.", "rate": 65, "genre": ["Animation", "Action", "Adventure"], "cast": ["Joey Dedio", "Pat Fraley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10100   Expand Denver, the Last Dinosaur   (1988) User Score Overview Denver, the Last Dinosaur is a U.S.-French cartoon for children originally released in 1988 by World Events Productions. It was nationally syndicated throughout the United States in 1988 with reruns airing until 1990. Episodes often focused on issues of conservation, ecology, and friendship. The show ran for two seasons, as the dinosaur boom that had followed The Land Before Time waned, causing viewership to drop. The series received a recommendation from the National Educational Association. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joey Dedio Pat Fraley Full Cast & Crew Last Season Season 2 1988 | 39 Episodes Season 2 of Denver, the Last Dinosaur premiered on September 29, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1966-09-10 Space Ghost and Dino Boy 7.2    2005-02-21 Masterchef Goes Large 4.8    1958-10-02 The Huckleberry Hound Show 7.0    1977-09-10 Captain Caveman and the Teen Angels 6.1    1984-09-05 Heathcliff & the Catillac Cats 5.4    1978-09-09 The All-New Popeye Hour 6.5    1986-09-08 SilverHawks 7.1    1988-09-06 Count Duckula 6.9  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 3 vadlefou w 3 waterhorse g 3 grand24 A 2 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}