{"link": "https://www.themoviedb.org/tv/34821?language=en", "title": "Ashita no Nadja", "resume": "Ashita no Nadja, is a romance anime with 50 episodes of 24 minutes installments, produced by Toei Animation and aired between February 2, 2003 and January 25, 2004. And it was the first TV Asahi Anime in the Sunday Morning 8:30 Timeslot to use TV Asahi's current logo.\nThe opening theme is \"Nadja!!\" by Minako Honda, and the ending theme is \"Que Sera, Sera\" by Ami Koshimizu.\nThe series is available on DVD containing two to three episodes each. The series has been released in French-Canadian R1 DVD by Imavision in two boxsets, and will receive English-language compilation dubbed movies from William Winckler Productions and Toei with a planned DVD release.\nIn 2009, William Winckler Productions produced two all new English dubbed movie versions edited from the original series. Producer William Winckler, known for Tekkaman the Space Knight, wrote, produced and directed the English films, which are seen on broadband in Japan.\nA manga version, written by Izumi Todo and drawn by Yui Ayumi, was serialized by Kodansha in the manga magazine Nakayoshi from March 2003 to February 2004, and collected in two bound volumes.", "rate": 0, "genre": [], "cast": ["Mitsuki Saiga", "Takumi Yamazaki", "Daisuke Kishio", "Reiko Kiuchi", "Kazuya Ichijō"], "character": ["Francis Harcourt", "Abel Geiger", "Thomas O'Brien", "Kennosuke Tsurugi", "George Haskill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34821   Expand Ashita no Nadja   (2003) User Score Overview Ashita no Nadja, is a romance anime with 50 episodes of 24 minutes installments, produced by Toei Animation and aired between February 2, 2003 and January 25, 2004. And it was the first TV Asahi Anime in the Sunday Morning 8:30 Timeslot to use TV Asahi's current logo. The opening theme is \"Nadja!!\" by Minako Honda, and the ending theme is \"Que Sera, Sera\" by Ami Koshimizu. The series is available on DVD containing two to three episodes each. The series has been released in French-Canadian R1 DVD by Imavision in two boxsets, and will receive English-language compilation dubbed movies from William Winckler Productions and Toei with a planned DVD release. In 2009, William Winckler Productions produced two all new English dubbed movie versions edited from the original series. Producer William Winckler, known for Tekkaman the Space Knight, wrote, produced and directed the English films, which are seen on broadband in Japan. A manga version, written by Izumi Todo and drawn by Yui Ayumi, was serialized by Kodansha in the manga magazine Nakayoshi from March 2003 to February 2004, and collected in two bound volumes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitsuki Saiga Francis Harcourt Takumi Yamazaki Abel Geiger Daisuke Kishio Thomas O'Brien Reiko Kiuchi Kennosuke Tsurugi Kazuya Ichijō George Haskill Full Cast & Crew Last Season Season 1 2003 | 51 Episodes Season 1 of Ashita no Nadja premiered on February  2, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ashita no Nadja. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 5 renegita p 3 perikoman m 3 magoozin A 3 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}