{"link": "https://www.themoviedb.org/tv/1347?language=en", "title": "Viva Laughlin", "resume": "Viva Laughlin is an American musical comedy-drama series adapted by Bob Lowry and Peter Bowker from the popular BBC British serial, Blackpool, and taking its name from the latter program's sequel, Viva Blackpool. Lowry and Bowker also served as executive producers alongside Hugh Jackman, John Palermo, Paul Telegdy and Gabriele Muccino. The latter also directed the pilot. It was filmed on location in part at the Morongo Casino Resort & Spa in Cabazon, California for most of the inside casino shots.\nProduced by BBC Worldwide, CBS Paramount Network Television, Sony Pictures Television and Seed Productions, the series was greenlit and given a thirteen-episode order on May 14, 2007. Excerpts from the series were aired in subsequent previews throughout the CBS telecast of the 61st Annual Tony Awards on June 10, 2007. CBS aired a preview of the pilot on October 18, 2007 following an episode of CSI: Crime Scene Investigation before broadcasting its official season premiere on October 21, 2007 in its regular timeslot on Sunday nights at 8:00/7:00c, following 60 Minutes.\nCBS cancelled Viva Laughlin on October 22, 2007 after airing two episodes, with the Nine Network following suit the next day by canceling the show after airing only one episode. Both CBS and Nine filled the show's time slot with episodes of CSI, with The Amazing Race then taking Viva Laughlin's place on CBS on November 4. There are still no plans to air the remaining episodes.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Lloyd Owen", "Carter Jenkins", "Eric Winter", "Mädchen Amick"], "character": ["Peter Carlyle", "Natalie Holden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1347   Expand Viva Laughlin   (2007) User Score Overview Viva Laughlin is an American musical comedy-drama series adapted by Bob Lowry and Peter Bowker from the popular BBC British serial, Blackpool, and taking its name from the latter program's sequel, Viva Blackpool. Lowry and Bowker also served as executive producers alongside Hugh Jackman, John Palermo, Paul Telegdy and Gabriele Muccino. The latter also directed the pilot. It was filmed on location in part at the Morongo Casino Resort & Spa in Cabazon, California for most of the inside casino shots. Produced by BBC Worldwide, CBS Paramount Network Television, Sony Pictures Television and Seed Productions, the series was greenlit and given a thirteen-episode order on May 14, 2007. Excerpts from the series were aired in subsequent previews throughout the CBS telecast of the 61st Annual Tony Awards on June 10, 2007. CBS aired a preview of the pilot on October 18, 2007 following an episode of CSI: Crime Scene Investigation before broadcasting its official season premiere on October 21, 2007 in its regular timeslot on Sunday nights at 8:00/7:00c, following 60 Minutes. CBS cancelled Viva Laughlin on October 22, 2007 after airing two episodes, with the Nine Network following suit the next day by canceling the show after airing only one episode. Both CBS and Nine filled the show's time slot with episodes of CSI, with The Amazing Race then taking Viva Laughlin's place on CBS on November 4. There are still no plans to air the remaining episodes. Featured Crew Peter Bowker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lloyd Owen Carter Jenkins Eric Winter Peter Carlyle Mädchen Amick Natalie Holden Full Cast & Crew Last Season Season 1 2007 | 5 Episodes Season 1 of Viva Laughlin premiered on October 18, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Viva Laughlin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Comedy Drama Keywords casino music murder suspect vegas Content Score 93 Almost there... Top Contributors 15 Banana CM 6 Cherche Moi 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}