{"link": "https://www.themoviedb.org/tv/32066?language=en", "title": "Geronimo Stilton", "resume": "Geronimo Stilton is a 2009 television series based on the books of the same name. It is produced by Atlantyca Ent. and MoonScoop Group.\nIt first premiered on September 15, 2009 on Rai 2 in Italy.\nOn April 15, 2010, Atlantyca Entertainment and MoonScoop announced they would continue the series with a second season of twenty-six episodes, which premiered in Italy on October 24, 2011.", "rate": 70, "genre": ["Mystery", "Comedy", "Animation"], "cast": ["Patricia Drake", "Brian Drummond", "Moneca Stori", "Sarah Edmondson", "Richard Ian Cox"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32066   Expand Geronimo Stilton   (2009) User Score Overview Geronimo Stilton is a 2009 television series based on the books of the same name. It is produced by Atlantyca Ent. and MoonScoop Group. It first premiered on September 15, 2009 on Rai 2 in Italy. On April 15, 2010, Atlantyca Entertainment and MoonScoop announced they would continue the series with a second season of twenty-six episodes, which premiered in Italy on October 24, 2011. Featured Crew Elisabetta Dami Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patricia Drake Brian Drummond Moneca Stori Sarah Edmondson Richard Ian Cox Full Cast & Crew Last Season Season 2 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Geronimo Stilton. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Italian Runtime  22m Homepage   http://geronimostilton.com/CA-fr/home/ Genres Mystery Comedy Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors P 9 PatricF s 3 speedycars J 1 JipenJanneke I 1 Ivamic  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}