{"link": "https://www.themoviedb.org/tv/2759?language=en", "title": "The Day Today", "resume": "The Day Today is a surreal British parody of television current affairs programmes, broadcast in 1994, and created by the comedians Armando Iannucci and Chris Morris. It is an adaptation of the radio programme On the Hour, which was broadcast on BBC Radio 4 between 1991 and 1992. On the Hour was written by Morris, Iannucci, Steven Wells, Andrew Glover, Stewart Lee, Richard Herring, David Quantick, and the cast. For The Day Today, Peter Baynham joined the writing team, and Lee and Herring were replaced by Graham Linehan and Arthur Mathews. The principal cast of On the Hour was retained for The Day Today.\nThe Day Today is composed of six half-hour episodes and a selection of shorter, five-minute slots recorded as promotion trailers for the longer segments. The six half-hour episodes were originally broadcast from 19 January to 23 February 1994 on BBC2. The Day Today has won many awards, including Morris winning the 1994 British Comedy Award for Best Newcomer. All six episodes are available on BBC DVD, having previously been issued on VHS.", "rate": 82, "genre": ["Comedy"], "cast": ["Patrick Marber", "Rebecca Front", "David Schneider", "Doon Mackichan", "Steve Coogan"], "character": ["Peter O'Hanraha-hanrahan", "Barbara Wintergreen", "Sylvester Stuart", "Collaterlie Sisters", "Alan Partridge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2759   Expand The Day Today   (1994) User Score Overview The Day Today is a surreal British parody of television current affairs programmes, broadcast in 1994, and created by the comedians Armando Iannucci and Chris Morris. It is an adaptation of the radio programme On the Hour, which was broadcast on BBC Radio 4 between 1991 and 1992. On the Hour was written by Morris, Iannucci, Steven Wells, Andrew Glover, Stewart Lee, Richard Herring, David Quantick, and the cast. For The Day Today, Peter Baynham joined the writing team, and Lee and Herring were replaced by Graham Linehan and Arthur Mathews. The principal cast of On the Hour was retained for The Day Today. The Day Today is composed of six half-hour episodes and a selection of shorter, five-minute slots recorded as promotion trailers for the longer segments. The six half-hour episodes were originally broadcast from 19 January to 23 February 1994 on BBC2. The Day Today has won many awards, including Morris winning the 1994 British Comedy Award for Best Newcomer. All six episodes are available on BBC DVD, having previously been issued on VHS. Featured Crew Armando Iannucci Creator Christopher Morris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Marber Peter O'Hanraha-hanrahan Rebecca Front Barbara Wintergreen David Schneider Sylvester Stuart Doon Mackichan Collaterlie Sisters Steve Coogan Alan Partridge Full Cast & Crew Last Season Season 1 1994 | 6 Episodes Season 1 of The Day Today premiered on January 19, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1997-01-29 Brass Eye 8.0    1986-10-06 The Trap Door 7.3    1997-11-03 I'm Alan Partridge 6.9    2006-10-02 Three Sheets 7.3    2005-02-11 Nathan Barley 7.9    1996-09-21 Dark Skies 7.6    2006-03-02 Charlie Brooker's Screenwipe 9.2    1996-05-26 Cold Lazarus 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords news broadcast surreal satire parody current affairs british humour Content Score 93 Almost there... Top Contributors O 8 Ozbourne R 3 Rebecca 2 ulysses31 a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}