{"link": "https://www.themoviedb.org/tv/572?language=en", "title": "Rainbow Brite", "resume": "Rainbow Brite is a media franchise by Hallmark Cards, introduced in 1983. The animated television series of the same name was started in 1984.\nRainbow Brite made her animated debut in a syndicated prime-time special, \"Peril in the Pits\", first aired on June 27, 1984. Two more two-part specials were subsequently made, \"The Mighty Monstromurk Menace\" and \"The Beginning of Rainbowland\".\nIn April 1986, Rainbow Brite became a regular series, as part of DIC's weekly syndicated Kideo TV block; eight new episodes were made for this run. Rainbow Brite remained part of the Kideo TV lineup until May 1987.", "rate": 62, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Peter Cullen", "Mona Marshall", "Scott Menville", "David Mendenhall", "Bettina Bush"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 572   Expand Rainbow Brite   (1984) User Score Overview Rainbow Brite is a media franchise by Hallmark Cards, introduced in 1983. The animated television series of the same name was started in 1984. Rainbow Brite made her animated debut in a syndicated prime-time special, \"Peril in the Pits\", first aired on June 27, 1984. Two more two-part specials were subsequently made, \"The Mighty Monstromurk Menace\" and \"The Beginning of Rainbowland\". In April 1986, Rainbow Brite became a regular series, as part of DIC's weekly syndicated Kideo TV block; eight new episodes were made for this run. Rainbow Brite remained part of the Kideo TV lineup until May 1987. Featured Crew Jean Chalopin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Cullen Mona Marshall Scott Menville David Mendenhall Bettina Bush Full Cast & Crew Last Season Season 1 1984 | 13 Episodes Season 1 of Rainbow Brite premiered on December 13, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rainbow Brite. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 2 Samara l 1 lizashley_xo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}