{"link": "https://www.themoviedb.org/tv/31757?language=en", "title": "Meteor", "resume": "Following an unparalleled series of meteor fireballs plummeting toward Earth, a renowned scientist, his assistant, and an on-target conspiracy theorist race against time to expose a government cover-up, reveal the truth, and prevent a massive meteor from destroying the planet.", "rate": 48, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Marla Sokoloff", "Christopher Lloyd", "Ernie Hudson", "Stacy Keach", "Kenneth Mitchell"], "character": ["Imogene O'Neil", "Prof. Daniel Lehman", "Gen. Brasser", "Sheriff Crowe", "Russ Hapscomb"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31757   Expand Meteor   (2009) User Score Overview Following an unparalleled series of meteor fireballs plummeting toward Earth, a renowned scientist, his assistant, and an on-target conspiracy theorist race against time to expose a government cover-up, reveal the truth, and prevent a massive meteor from destroying the planet. Featured Crew Ernie Barbarash Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marla Sokoloff Imogene O'Neil Christopher Lloyd Prof. Daniel Lehman Ernie Hudson Gen. Brasser Stacy Keach Sheriff Crowe Kenneth Mitchell Russ Hapscomb Full Cast & Crew Last Season Season 1 2009 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations   2009-07-26 The Storm 4.0    1999-10-01 BeastMaster 5.9    1977-12-30 Mind Your Language 8.0    1988-09-06 Count Duckula 6.9    1991-09-15 Eerie, Indiana 7.6    2009-02-14 Impact 5.1    1997-04-03 Police Academy: The Series 5.6    1987-09-12 Fraggle Rock: The Animated Series 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  188m, 240m, 120m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords saving the world meteor comet science fiction meteorite disaster miniseries scientist Content Score 93 Almost there... Top Contributors TB 76 TMDb Bot 27 Banana LH 9 Lars Haaber Pedersen i 3 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}