{"link": "https://www.themoviedb.org/tv/41246?language=en", "title": "Wonder Woman", "resume": "Wonder Woman is a never-aired television pilot produced by Warner Bros. Television and DC Entertainment for NBC, based on the DC Comics character of the same name. David E. Kelley wrote the pilot, which was directed by Jeffrey Reiner. Adrianne Palicki starred as the main character.\nThe Wonder Woman pilot was expected to debut in 2011, but NBC opted not to buy the series.", "rate": 0, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Adrianne Palicki", "Pedro Pascal", "Elizabeth Hurley", "Tracie Thoms", "Edward Herrmann"], "character": ["Diana Prince / Wonder Woman", "Ed Indelicato", "Veronica Cale", "Etta Candy", "Senator Warren"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41246   Expand Wonder Woman User Score Overview Wonder Woman is a never-aired television pilot produced by Warner Bros. Television and DC Entertainment for NBC, based on the DC Comics character of the same name. David E. Kelley wrote the pilot, which was directed by Jeffrey Reiner. Adrianne Palicki starred as the main character. The Wonder Woman pilot was expected to debut in 2011, but NBC opted not to buy the series. Featured Crew William Moulton Marston Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrianne Palicki Diana Prince / Wonder Woman Pedro Pascal Ed Indelicato Elizabeth Hurley Veronica Cale Tracie Thoms Etta Candy Edward Herrmann Senator Warren Full Cast & Crew Last Season Season 1 — | 1 Episode View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Wonder Woman. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Facts Status  Pilot Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords strong woman dc comics superheroine based on comic failed tv pilot Content Score 86 Almost there... Top Contributors J 31 Jason 29 Banana 22 janar z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}