{"link": "https://www.themoviedb.org/tv/3329?language=en", "title": "Australia's Next Top Model", "resume": "Australia's Next Top Model is an Australian reality television series, based on a franchise that was created by Tyra Banks with America's Next Top Model. It is produced by Granada Productions and broadcast on the Australian subscription television channel, FOX8. The series' objective is to find a promising but as-yet undiscovered Australian fashion Model and reward her with a platform to boost her chances of forging a successful career within the modelling industry.\nThe series was last formerly hosted by Australian model Sarah Murdoch, who also served as lead judge and co-executive producer of the show for cycles five to seven. Jodhi Meares and Erika Heynatz also served as former hosts. An eighth cycle was confirmed for production and broadcast during 2013. Producers had to find a replacement host before production re-commenced.\nIn April 2012 it was announced that the series would take a break for 2012 due to the fact that producers of the show were having trouble finding a replacement for Sarah Murdoch. It was announced on 19 November 2012 that beauty queen, model, and television personality Jennifer Hawkins was chosen as the new host for the ongoing eighth cycle.", "rate": 38, "genre": ["Reality"], "cast": ["Jennifer Hawkins", "Megan Gale"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3329   Expand Australia's Next Top Model   (2005) User Score Overview Australia's Next Top Model is an Australian reality television series, based on a franchise that was created by Tyra Banks with America's Next Top Model. It is produced by Granada Productions and broadcast on the Australian subscription television channel, FOX8. The series' objective is to find a promising but as-yet undiscovered Australian fashion Model and reward her with a platform to boost her chances of forging a successful career within the modelling industry. The series was last formerly hosted by Australian model Sarah Murdoch, who also served as lead judge and co-executive producer of the show for cycles five to seven. Jodhi Meares and Erika Heynatz also served as former hosts. An eighth cycle was confirmed for production and broadcast during 2013. Producers had to find a replacement host before production re-commenced. In April 2012 it was announced that the series would take a break for 2012 due to the fact that producers of the show were having trouble finding a replacement for Sarah Murdoch. It was announced on 19 November 2012 that beauty queen, model, and television personality Jennifer Hawkins was chosen as the new host for the ongoing eighth cycle. Featured Crew Tyra Banks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Hawkins Megan Gale Full Cast & Crew Last Season Cycle 10 2016 | 9 Episodes Season 10 of Australia's Next Top Model premiered on September 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Australia's Next Top Model. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.fox8.tv/shows/australias-next-top-model Genres Reality Keywords modeling Content Score 64 We're so close, yet so far. Top Contributors e 31 erinnny 13 Banana TB 6 TMDb Bot 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}