{"link": "https://www.themoviedb.org/tv/44210?language=en", "title": "Twelve Chairs", "resume": "Set in the late 1920's Soviet Union, Ostap Bender and Ippolit \"Kisa\" Vorobyaninov are after stash of diamonds hidden in one of the chairs in 12-chair set. They are forced to go on a cross-country chase when the chairs are auctioned off.", "rate": 75, "genre": [], "cast": ["Andrey Mironov", "Anatoli Papanov", "Rolan Bykov", "Oleg Tabakov", "Tatyana Pelttser"], "character": ["Остап Бендер", "Киса Воробьянинов", "Отец Фёдор", "Альхен", "Клавдия Ивановна"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44210   Expand Twelve Chairs   (1976) User Score Overview Set in the late 1920's Soviet Union, Ostap Bender and Ippolit \"Kisa\" Vorobyaninov are after stash of diamonds hidden in one of the chairs in 12-chair set. They are forced to go on a cross-country chase when the chairs are auctioned off. Featured Crew Mark Zakharov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrey Mironov Остап Бендер Anatoli Papanov Киса Воробьянинов Rolan Bykov Отец Фёдор Oleg Tabakov Альхен Tatyana Pelttser Клавдия Ивановна Full Cast & Crew Last Season Miniseries 1976 | 4 Episodes Season 1 of Twelve Chairs premiered on June  4, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2005-12-19 The Master and Margarita 6.0    1969-01-01 Nu, pogodi! 6.8    1973-08-11 Seventeen Moments of Spring 7.5    2009-11-16 Воронины 5.3    School 5.4    2006-03-08 Happy Together 4.0    2008-08-25 Универ 4.3    2010-03-29 Interny 5.7  Facts Original Name  12 стульев Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Miniseries Original Language  Russian Runtime  65m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 37 TMDb Bot R 17 Rebecca n 9 navarro2018 R 7 RomanGalperin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}