{"link": "https://www.themoviedb.org/tv/13729?language=en", "title": "Shackleton", "resume": "The story of the remarkable 1914 expedition to the South Pole of legendary British explorer Sir Ernest Shackleton.", "rate": 66, "genre": ["Drama", "Action", "Adventure"], "cast": ["Embeth Davidtz", "Kenneth Branagh", "Kevin McNally", "Mark McGann", "Lorcan Cranitch"], "character": ["Sir Ernest Henry Shackleton", "Frank Worsley", "Tom Crean", "Frank Wild"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13729   Expand Shackleton   (2002) User Score Overview The story of the remarkable 1914 expedition to the South Pole of legendary British explorer Sir Ernest Shackleton. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Embeth Davidtz Kenneth Branagh Sir Ernest Henry Shackleton Kevin McNally Frank Worsley Mark McGann Tom Crean Lorcan Cranitch Frank Wild Full Cast & Crew Last Season Miniseries 2002 | 2 Episodes Season 1 of Shackleton premiered on January  1, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations   1997-08-31 Full Circle with Michael Palin 7.3    1992-12-06 A Touch of Frost 7.9    2002-10-13 Sahara with Michael Palin 6.9    1989-09-19 Doogie Howser, M.D. 5.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  103m Homepage   http://www.channel4.com/programmes/shackleton Genres Drama Action & Adventure Keywords survival sir ernest shackleton Content Score 86 Almost there... Top Contributors TB 40 TMDb Bot 6 olaf-d-aix 5 Banana J 4 JeePeCe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}