{"link": "https://www.themoviedb.org/tv/61833?language=en", "title": "Expedition Unknown", "resume": "Expedition Unknown chronicles the adventures of Josh Gates as he investigates iconic mysteries across the globe. Gates begins by interviewing key eyewitnesses and uncovering recent developments in the story, then springboards into a fully immersive exploration. This authentic, roughshod adventure leads Gates closer to the truth behind these unanswered global enigmas, such as the disappearance of Amelia Earhart’s plane. Josh Gates is an adventurer and avid explorer with a unique brand of humor and passion for off-the-map excursions.", "rate": 78, "genre": ["Documentary"], "cast": ["Josh Gates"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61833   Expand Expedition Unknown   (2015) User Score  Play Trailer Overview Expedition Unknown chronicles the adventures of Josh Gates as he investigates iconic mysteries across the globe. Gates begins by interviewing key eyewitnesses and uncovering recent developments in the story, then springboards into a fully immersive exploration. This authentic, roughshod adventure leads Gates closer to the truth behind these unanswered global enigmas, such as the disappearance of Amelia Earhart’s plane. Josh Gates is an adventurer and avid explorer with a unique brand of humor and passion for off-the-map excursions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Gates Himself - Host Full Cast & Crew Current Season Season 5 2018 | 5 Episodes Season 5 of Expedition Unknown premiered on May 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2010-11-02 Mysteries at the Museum 8.8    2007-06-06 Destination Truth 7.6    2014-02-28 Hangar 1: The UFO Files 6.6    2012-03-27 NASA's Unexplained Files 7.7    2014-01-05 The Curse of Oak Island 7.1  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.travelchannel.com/shows/expedition-unknown Genres Documentary Keywords humor fish out of water danger Content Score 64 We're so close, yet so far. Top Contributors 28 Elizabeth Jennings 10 Marco 7 szab TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}