{"link": "https://www.themoviedb.org/tv/1774?language=en", "title": "Johnny and the Sprites", "resume": "Johnny and the Sprites is a musical television show aimed for preschoolers that airs every weekend on the \"Playhouse Disney\" program of The Disney Channel. The show was created for, is produced by, and stars John Tartaglia. The show's theme song was written by Stephen Schwartz. Each episode of the show features a musical number, many of which are written by various notable Broadway composers such as Gary Adler, Bobby Lopez, Laurence O'Keefe, Michael Patrick Walker, and others. The Sprites and all of the other creatures that inhabit Johnny's world were designed by Michael Schupbach. The set was designed by Laura Brock.\nThe show premiered on October 9, 2005 with five 5-minute-long episodes, which continually play on The Disney Channel's programming. However, due to extremely positive audience reaction, the show was renewed for thirteen half-hour shows for 2007. The current episodes can also be viewed on the Disney Channel's official website. The show was then renewed for a second season of half-hour episodes, which were filmed in Fall 2007 at Kaufman Astoria Studios in Queens, New York City. The second season premiered Saturday, Jan. 19, 2008.\nThe show follows Johnny T, a song writer who moves into a house given to him by his great-uncle. There, he discovers little magical creatures called \"sprites,\" who introduce him to their fantasy world. In return, Johnny shows the sprites, named Ginger, Basil, Lily and Root what it is to be human, teaching them an important lesson through song, dance, and entertainment.", "rate": 0, "genre": [], "cast": ["John Tartaglia", "Leslie Carrara-Rudolph", "Carmen Osbahr", "Tim Lagasse"], "character": ["Johnny", "Ginger the Sprite"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1774   Expand Johnny and the Sprites   (2005) User Score Overview Johnny and the Sprites is a musical television show aimed for preschoolers that airs every weekend on the \"Playhouse Disney\" program of The Disney Channel. The show was created for, is produced by, and stars John Tartaglia. The show's theme song was written by Stephen Schwartz. Each episode of the show features a musical number, many of which are written by various notable Broadway composers such as Gary Adler, Bobby Lopez, Laurence O'Keefe, Michael Patrick Walker, and others. The Sprites and all of the other creatures that inhabit Johnny's world were designed by Michael Schupbach. The set was designed by Laura Brock. The show premiered on October 9, 2005 with five 5-minute-long episodes, which continually play on The Disney Channel's programming. However, due to extremely positive audience reaction, the show was renewed for thirteen half-hour shows for 2007. The current episodes can also be viewed on the Disney Channel's official website. The show was then renewed for a second season of half-hour episodes, which were filmed in Fall 2007 at Kaufman Astoria Studios in Queens, New York City. The second season premiered Saturday, Jan. 19, 2008. The show follows Johnny T, a song writer who moves into a house given to him by his great-uncle. There, he discovers little magical creatures called \"sprites,\" who introduce him to their fantasy world. In return, Johnny shows the sprites, named Ginger, Basil, Lily and Root what it is to be human, teaching them an important lesson through song, dance, and entertainment. Featured Crew John Tartaglia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Tartaglia Johnny Leslie Carrara-Rudolph Ginger the Sprite Carmen Osbahr Tim Lagasse Full Cast & Crew Last Season Season 1 2005 | 16 Episodes Season 1 of Johnny and the Sprites premiered on October 19, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Johnny and the Sprites. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.disney.go.com/disneychannel/playhouse/johnny/ Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}