{"link": "https://www.themoviedb.org/tv/77240?language=en", "title": "Captain Tsubasa", "resume": "The passionate story of an elementary school student whose thoughts and dreams revolve almost entirely around the love of soccer. 11-year-old Tsubasa Oozora started playing football at a very young age, and while it was mostly just a recreational sport for his friends, for him, it developed into something of an obsession.  In order to pursue his dream to the best of his elementary school abilities, Tsubasa moves with his mother to Nankatsu city, which is well-known for its excellent elementary school soccer teams. But although he was easily the best in his old town, Nankatsu has a lot more competition, and he will need all of his skill and talent in order to stand out from this new crowd.\nHe encounters not only rivals, but also new friends like the pretty girl Sanae Nakazawa and the talented goalkeeper, Genzo Wakabayashi, who shares the same passion as Tsubasa, and will prove to be a treasured friend in helping him push towards his dreams. Representing Japan in the FIFA World Cup is Tsubasa’s ultimate dream, but it will take a lot more than talent to reach it.", "rate": 84, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Yuuko Sanpei", "Kenichi Suzumura", "Takuya Satou", "Ayaka Fukuhara", "Mutsumi Tamura"], "character": ["Tsubasa Ozora (voice)", "Genzou Wakabayashi (voice)", "Kojirou Hyuuga (voice)", "Tarou Misaki (voice)", "Ryou Ishizaki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77240   Expand Captain Tsubasa   (2018) User Score Overview The passionate story of an elementary school student whose thoughts and dreams revolve almost entirely around the love of soccer. 11-year-old Tsubasa Oozora started playing football at a very young age, and while it was mostly just a recreational sport for his friends, for him, it developed into something of an obsession.  In order to pursue his dream to the best of his elementary school abilities, Tsubasa moves with his mother to Nankatsu city, which is well-known for its excellent elementary school soccer teams. But although he was easily the best in his old town, Nankatsu has a lot more competition, and he will need all of his skill and talent in order to stand out from this new crowd. He encounters not only rivals, but also new friends like the pretty girl Sanae Nakazawa and the talented goalkeeper, Genzo Wakabayashi, who shares the same passion as Tsubasa, and will prove to be a treasured friend in helping him push towards his dreams. Representing Japan in the FIFA World Cup is Tsubasa’s ultimate dream, but it will take a lot more than talent to reach it. Featured Crew Toshiyuki Kato Creator Atsuhiro Tomioka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuko Sanpei Tsubasa Ozora (voice) Kenichi Suzumura Genzou Wakabayashi (voice) Takuya Satou Kojirou Hyuuga (voice) Ayaka Fukuhara Tarou Misaki (voice) Mutsumi Tamura Ryou Ishizaki (voice) Full Cast & Crew Current Season Season 1 2018 | 24 Episodes Season 1 of Captain Tsubasa premiered on April  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Captain Tsubasa. You can help by rating TV shows you've seen. Facts Original Name  キャプテン翼 Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.tv-tokyo.co.jp/anime/captaintsubasa2018/ Genres Animation Comedy Drama Keywords competition coming of age remake tournament soccer teenager anime sports Content Score 100 Yes! Looking good! Top Contributors 120 Mikedeth5 T 13 Trasob 11 sp1ti 5 animotime  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}