{"link": "https://www.themoviedb.org/tv/3704?language=en", "title": "Super Rescue Solbrain", "resume": "Super Rescue Solbrain is a Japanese tokusatsu television series produced by Toei Company. It ran for 53 episodes from January 20, 1991 to January 26, 1992 on TV Asahi. It is part of the Metal Hero Series franchise; a sequel to Tokkei Winspector, it is the second series to follow the Rescue Hero trilogy.", "rate": 80, "genre": ["Action", "Adventure"], "cast": ["Mitsue Mori", "Hidenori Iura", "Koichi Nakayama", "Takeshi Kuwabara"], "character": ["Reiko Higushi/SolJeanne", "Jun Masuda", "Daiki Nishio/Solbraver", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3704   Expand Super Rescue Solbrain   (1991) User Score Overview Super Rescue Solbrain is a Japanese tokusatsu television series produced by Toei Company. It ran for 53 episodes from January 20, 1991 to January 26, 1992 on TV Asahi. It is part of the Metal Hero Series franchise; a sequel to Tokkei Winspector, it is the second series to follow the Rescue Hero trilogy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitsue Mori Reiko Higushi/SolJeanne Hidenori Iura Jun Masuda Koichi Nakayama Daiki Nishio/Solbraver Takeshi Kuwabara Narrator Full Cast & Crew Last Season Season 1 1991 | 53 Episodes Season 1 of Super Rescue Solbrain premiered on January 20, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Super Rescue Solbrain. You can help by rating TV shows you've seen. Facts Original Name  特救指令ソルブレイン Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Action & Adventure Keywords tokusatsu Content Score 86 Almost there... Top Contributors NS 25 Norte Serra t 1 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}