{"link": "https://www.themoviedb.org/tv/43136?language=en", "title": "Superman", "resume": "Superman is a 15-part black-and-white Columbia film serial based on the comic book character Superman. It stars an uncredited Kirk Alyn and Noel Neill as Lois Lane. It is notable as the first live-action appearance of Superman on film and for the longevity of its distribution. The serial was directed by Thomas Carr, who later directed many early episodes of the Adventures of Superman television show, and Spencer Gordon Bennet, produced by Sam Katzman and shot in and around Los Angeles, California. It was originally screened at movie matinées and after the first three scene-setting chapters, every episode ends in a cliffhanger. The Superman-in-flight scenes are animations, in part due to the small production budget.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Animation"], "cast": ["Kirk Alyn", "Noel Neill", "Pierre Watkin", "Tommy Bond"], "character": ["Superman / Clark Kent", "Lois Lane", "Perry White", "Jimmy Olsen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43136   Expand Superman   (1948) User Score Overview Superman is a 15-part black-and-white Columbia film serial based on the comic book character Superman. It stars an uncredited Kirk Alyn and Noel Neill as Lois Lane. It is notable as the first live-action appearance of Superman on film and for the longevity of its distribution. The serial was directed by Thomas Carr, who later directed many early episodes of the Adventures of Superman television show, and Spencer Gordon Bennet, produced by Sam Katzman and shot in and around Los Angeles, California. It was originally screened at movie matinées and after the first three scene-setting chapters, every episode ends in a cliffhanger. The Superman-in-flight scenes are animations, in part due to the small production budget. Featured Crew Thomas Carr Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirk Alyn Superman / Clark Kent Noel Neill Lois Lane Pierre Watkin Perry White Tommy Bond Jimmy Olsen Full Cast & Crew Last Season Season 1 1948 | 15 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Superman. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Superman. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  18m Homepage  - Genres Sci-Fi & Fantasy Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors R 14 Rebecca 10 Guy Kanniard p 1 pedrol1981 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}