{"link": "https://www.themoviedb.org/tv/72140?language=en", "title": "Frankie Boyle's New World Order", "resume": "In an attempt to make sense of the bewildering world we live in, Frankie Boyle dissects the week's news using stand-up, review, discussion and audience interaction.", "rate": 13, "genre": ["News", "Comedy"], "cast": ["Frankie Boyle", "Sara Pascoe", "Katherine Ryan"], "character": ["Himself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72140   Expand Frankie Boyle's New World Order   (2017) User Score  Play Trailer Overview In an attempt to make sense of the bewildering world we live in, Frankie Boyle dissects the week's news using stand-up, review, discussion and audience interaction. Featured Crew Frankie Boyle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frankie Boyle Himself Sara Pascoe Herself Katherine Ryan Herself Full Cast & Crew Current Season Episode 2 2018 | 3 Episodes Season 2 of Frankie Boyle's New World Order premiered on May 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Frankie Boyle's New World Order. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  45m Homepage   http://www.bbc.co.uk/programmes/b08tpkbm Genres News Comedy Keywords black humor social satire political satire Content Score 71 Just a little bit more... Top Contributors 31 DBD a 10 ariskamunic8 7 Elizabeth Jennings 2 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}