{"link": "https://www.themoviedb.org/tv/13397?language=en", "title": "Masada", "resume": "Masada is an American television miniseries that aired on ABC in April 1981. Advertised by the network as an \"ABC Novel for Television,\" it was a fictionalized account of the historical siege of the Masada citadel in Israel by legions of the Roman Empire in AD 73. The TV series' script is based on the novel The Antagonists by Ernest Gann. The siege ended when the Roman armies were able to enter the fortress, only to discover the mass suicide by the Jewish defenders when defeat became imminent.\nMasada was one of several historical miniseries produced in the early 1980s following the success of NBC's Shogun in 1980.\nThe miniseries starred Peter O'Toole as Roman legion commander Lucius Flavius Silva, Peter Strauss as the Jewish commander Elazar ben Ya'ir, and Barbara Carrera as Silva's Jewish mistress. David Warner, as Pomponius Falco, won an Emmy Award for his role. O'Toole was nominated for an Emmy for his performance. It was his first appearance in an American miniseries. Jerry Goldsmith and Morton Stevens composed the series' score. Goldsmith received an Emmy for his contribution.\nMasada was filmed on location at the site of the ancient fortress, in the Judean Desert, Israel. Remains of a ramp, created during the filming to simulate the ramp built by the Romans to take the fortress, can still be seen at the site.", "rate": 73, "genre": ["Drama", "Action", "Adventure"], "cast": ["Barbara Carrera", "Peter O'Toole", "Peter Strauss", "Anthony Quayle", "David Warner"], "character": ["Sheva", "Lucius Flavius Silva", "Eleazar Ben Yair", "Rubrius Gallus", "Pomponius Falco"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13397   Expand Masada   (1981) User Score Overview Masada is an American television miniseries that aired on ABC in April 1981. Advertised by the network as an \"ABC Novel for Television,\" it was a fictionalized account of the historical siege of the Masada citadel in Israel by legions of the Roman Empire in AD 73. The TV series' script is based on the novel The Antagonists by Ernest Gann. The siege ended when the Roman armies were able to enter the fortress, only to discover the mass suicide by the Jewish defenders when defeat became imminent. Masada was one of several historical miniseries produced in the early 1980s following the success of NBC's Shogun in 1980. The miniseries starred Peter O'Toole as Roman legion commander Lucius Flavius Silva, Peter Strauss as the Jewish commander Elazar ben Ya'ir, and Barbara Carrera as Silva's Jewish mistress. David Warner, as Pomponius Falco, won an Emmy Award for his role. O'Toole was nominated for an Emmy for his performance. It was his first appearance in an American miniseries. Jerry Goldsmith and Morton Stevens composed the series' score. Goldsmith received an Emmy for his contribution. Masada was filmed on location at the site of the ancient fortress, in the Judean Desert, Israel. Remains of a ramp, created during the filming to simulate the ramp built by the Romans to take the fortress, can still be seen at the site. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Carrera Sheva Peter O'Toole Lucius Flavius Silva Peter Strauss Eleazar Ben Yair Anthony Quayle Rubrius Gallus David Warner Pomponius Falco Full Cast & Crew Last Season Season 1 1981 | 4 Episodes Season 1 of Masada premiered on April  5, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2013-12-18 The Great Train Robbery 6.8    1985-11-03 North and South 7.2    1978-04-02 Dallas 6.1    1988-10-11 Jack the Ripper 7.1    1971-09-17 The Persuaders! 8.0    1962-10-04 The Saint 7.2    1980-09-15 Shogun 7.5    1965-09-15 Lost in Space 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  480m Homepage  - Genres Drama Action & Adventure Keywords miniseries ancient history Content Score 86 Almost there... Top Contributors TB 27 TMDb Bot 14 Mitsarinho w 3 webmaster R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}