{"link": "https://www.themoviedb.org/tv/14777?language=en", "title": "Agatha Christie's Partners in Crime", "resume": "Agatha Christie's Partners in Crime is a 1983 British television series based on the short stories of the same name by Agatha Christie. It was directed by John A. Davis and Tony Wharmby, and starred James Warwick and Francesca Annis in the leading roles of husband and wife sleuths Tommy and Prudence 'Tuppence' Beresford. Reece Dinsdale co-starred as Albert in all except episodes 3 and 5.\nThe series follows the adventures and exploits of the Beresfords, who have recently taken over the running of a detective agency based in London, and each episode features one of the stories from the book. Among these are a quest for missing jewels, the investigation of poltergeists and a story involving poisoned chocolates.\nThe series followed the short stories closely with two notable exceptions: First, the detective parodies, although alluded to on occasion, were for the most part dispensed with. Secondly, the story arc of the blue Russian letters and the search for the agent known as Number 16 were also dispensed with. For this reason three chapters were not adapted.\nThe series' original run was immediately preceded by transmission on 9 October 1983 of the same production team's adaptation of Christie's second novel The Secret Adversary, which also starred Annis and Warwick in the same roles and which acted as an introduction for viewers to Agatha Christie's Partners in Crime.", "rate": 47, "genre": ["Comedy", "Drama"], "cast": ["James Warwick", "Francesca Annis", "Reece Dinsdale", "Arthur Cox"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14777   Expand Agatha Christie's Partners in Crime   (1983) User Score Overview Agatha Christie's Partners in Crime is a 1983 British television series based on the short stories of the same name by Agatha Christie. It was directed by John A. Davis and Tony Wharmby, and starred James Warwick and Francesca Annis in the leading roles of husband and wife sleuths Tommy and Prudence 'Tuppence' Beresford. Reece Dinsdale co-starred as Albert in all except episodes 3 and 5. The series follows the adventures and exploits of the Beresfords, who have recently taken over the running of a detective agency based in London, and each episode features one of the stories from the book. Among these are a quest for missing jewels, the investigation of poltergeists and a story involving poisoned chocolates. The series followed the short stories closely with two notable exceptions: First, the detective parodies, although alluded to on occasion, were for the most part dispensed with. Secondly, the story arc of the blue Russian letters and the search for the agent known as Number 16 were also dispensed with. For this reason three chapters were not adapted. The series' original run was immediately preceded by transmission on 9 October 1983 of the same production team's adaptation of Christie's second novel The Secret Adversary, which also starred Annis and Warwick in the same roles and which acted as an introduction for viewers to Agatha Christie's Partners in Crime. Featured Crew Jack Williams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Warwick Francesca Annis Reece Dinsdale Arthur Cox Full Cast & Crew Last Season Season 1 1983 | 11 Episodes Season 1 of Agatha Christie's Partners in Crime premiered on October  9, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Agatha Christie's Partners in Crime. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  45m, 50m, 60m Homepage  - Genres Comedy Drama Keywords murder mystery Content Score 93 Almost there... Top Contributors m 13 michael47 t 6 tmdb42368388 r 5 rick555 2 titantelo15  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}