{"link": "https://www.themoviedb.org/tv/43853?language=en", "title": "Romance of the Three Kingdoms", "resume": "Yokoyama Mitsuteru Sangokushi is a Japanese anime series based on the Sangokushi manga by Mitsuteru Yokoyama, itself based on Eiji Yoshikawa's retelling of the Chinese literary classic Romance of the Three Kingdoms.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Daiki Nakamura", "Shinpachi Tsuji", "Keiji Fujiwara", "Jūrōta Kosugi", "Sho Hayami"], "character": ["Liu Bei Xuande", "Guan Yu Yunchang", "Zhang Fei Yide", "Zhao Yun Zilong", "Zhuge Liang Kongming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43853   Expand Romance of the Three Kingdoms   (1991) User Score Overview Yokoyama Mitsuteru Sangokushi is a Japanese anime series based on the Sangokushi manga by Mitsuteru Yokoyama, itself based on Eiji Yoshikawa's retelling of the Chinese literary classic Romance of the Three Kingdoms. Featured Crew Mitsuteru Yokoyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daiki Nakamura Liu Bei Xuande Shinpachi Tsuji Guan Yu Yunchang Keiji Fujiwara Zhang Fei Yide Jūrōta Kosugi Zhao Yun Zilong Sho Hayami Zhuge Liang Kongming Full Cast & Crew Last Season Season 1 — | 46 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Romance of the Three Kingdoms. You can help by rating TV shows you've seen. Facts Original Name  横山光輝 三国志 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 12 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}