{"link": "https://www.themoviedb.org/tv/44045?language=en", "title": "All Watched Over by Machines of Loving Grace", "resume": "We have been colonised by the machines we have built. Although we don't realise it, the way we see everything in the world today is through the eyes of the computers.", "rate": 83, "genre": ["Documentary"], "cast": ["Stewart Brand", "Peder Anker", "David Attenborough", "Richard Brautigan", "Bill Clinton"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44045   Expand All Watched Over by Machines of Loving Grace   (2011) User Score  Play Trailer Overview We have been colonised by the machines we have built. Although we don't realise it, the way we see everything in the world today is through the eyes of the computers. Featured Crew Adam Curtis Creator Lucy Kelsall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stewart Brand Himself Peder Anker Himself David Attenborough Himself Richard Brautigan Himself Bill Clinton Himself Full Cast & Crew Last Season Season 1 2011 | 3 Episodes Season 1 of All Watched Over by Machines of Loving Grace premiered on May 22, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2007-03-11 The Trap: What Happened to Our Dream of Freedom 0.0    2002-03-17 The Century of the Self 8.2    2004-10-20 The Power of Nightmares 8.2    2006-08-21 When the Levees Broke: A Requiem in Four Acts 7.0    2003-03-16 Frank Herbert's Children of Dune 6.8    2002-10-01 Ghost in the Shell: Stand Alone Complex 8.0    2008-03-16 John Adams 7.9    2015-02-08 The Jinx: The Life and Deaths of Robert Durst 8.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://bbc.co.uk/programmes/b011lvb9 Genres Documentary Keywords technology progress industrialist financial crisis mankind Content Score 100 Yes! Looking good! Top Contributors TB 39 TMDb Bot 20 jchaven 5 Banana w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}