{"link": "https://www.themoviedb.org/tv/1274?language=en", "title": "Six Feet Under", "resume": "A darkly comic look at members of a dysfunctional L.A. family that run a funeral business. \nWhen death is your business, what is your life? For the Fisher family, the world outside of their family-owned funeral home continues to be at least as challenging as--and far less predictable than--the one inside.", "rate": 82, "genre": ["Drama"], "cast": ["Peter Krause", "Michael C. Hall", "Frances Conroy", "Lauren Ambrose", "Freddy Rodríguez"], "character": ["Nate Fisher", "David Fisher", "Ruth Fisher", "Claire Fisher", "Federico Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1274   Expand Six Feet Under   (2001) User Score  Play Trailer Overview A darkly comic look at members of a dysfunctional L.A. family that run a funeral business.  When death is your business, what is your life? For the Fisher family, the world outside of their family-owned funeral home continues to be at least as challenging as--and far less predictable than--the one inside. Featured Crew Alan Ball Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  16 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Krause Nate Fisher Michael C. Hall David Fisher Frances Conroy Ruth Fisher Lauren Ambrose Claire Fisher Freddy Rodríguez Federico Diaz Full Cast & Crew Last Season Season 5 2005 | 12 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Still the series with best ever ending Open 4 by HoneyWest\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  7 Recommendations   2007-07-19 Mad Men 8.0    2004-03-21 Deadwood 8.1    1999-01-10 The Sopranos 8.3    1997-07-12 Oz 8.1    2007-08-13 Californication 7.4    2006-10-01 Dexter 8.0    2003-11-02 Arrested Development 8.2    2010-03-16 Justified 7.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m, 60m Homepage   http://www.hbo.com/six-feet-under Genres Drama Keywords sibling relationship gay widow death of father dysfunctional family family drama los angeles family death funeral home life Content Score 100 Yes! Looking good! Top Contributors L 49 Law 30 Elizabeth Jennings 12 Travis Bell 12 ceslava  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}