{"link": "https://www.themoviedb.org/tv/230?language=en", "title": "The New Scooby and Scrappy-Doo Show", "resume": "The New Scooby and Scrappy Doo Show is the sixth incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo. It premiered on September 10, 1983, and ran for one season on ABC as a half-hour program made up of two eleven-minute short cartoons. \nThe show is a return to the mystery solving format and reintroduces Daphne after a four-year absence. The plots of each episode feature her, Shaggy, Scooby-Doo, and Scrappy-Doo solving supernatural mysteries under the cover of being reporters for a teen magazine.", "rate": 63, "genre": ["Animation", "Mystery", "Comedy"], "cast": ["Casey Kasem", "Heather North", "Don Messick"], "character": ["Shaggy", "Daphne", "Scooby / Scrappy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 230   Expand The New Scooby and Scrappy-Doo Show   (1983) User Score Overview The New Scooby and Scrappy Doo Show is the sixth incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo. It premiered on September 10, 1983, and ran for one season on ABC as a half-hour program made up of two eleven-minute short cartoons.  The show is a return to the mystery solving format and reintroduces Daphne after a four-year absence. The plots of each episode feature her, Shaggy, Scooby-Doo, and Scrappy-Doo solving supernatural mysteries under the cover of being reporters for a teen magazine. Featured Crew Ken Spears Creator Joe Ruby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Kasem Shaggy Heather North Daphne Don Messick Scooby / Scrappy Full Cast & Crew Last Season Season 1 1983 | 13 Episodes Season 1 of The New Scooby and Scrappy-Doo Show premiered on September 10, 1983. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The New Scooby and Scrappy-Doo Show. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1995-12-09 Ace Ventura Pet Detective: The Series 5.0    1984-09-08 The New Scooby-Doo Mysteries 6.2    1997-09-13 101 Dalmatians: The Series 7.0    1996-04-02 Dennis the Menace and Gnasher 5.8    2002-03-05 The Osbournes 6.4    1990-09-08 The Tom & Jerry Kids Show 6.0    2002-09-07 Baby Looney Tunes 5.5    1993-09-11 The Pink Panther 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Mystery Comedy Keywords crime solving Content Score 50 Still needs a little work. Top Contributors N 12 Notamymerrick 7 Banana 5 Elizabeth Jennings AK 3 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}