{"link": "https://www.themoviedb.org/tv/43032?language=en", "title": "You're Under Arrest!", "resume": "Tokyo Highway Patrolwomen Natsumi and Miyuki get off to a bad start when Miyuki busts Natsumi for reckless moped driving on her way to work. Things get worse when they find out they're going to be partners!\nA continuation of the OVA series, the adventures of Tokyo policewomen Natsumi and Miyuki continue in the You're Under Arrest TV series. It's back to Bokuto Precinct, where demented felons and bashful (but hunky) policemen abound, and where the cutest girl in the office... isn't a girl.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Etsuko Kozakura", "Akiko Hiramatsu", "Sakiko Tamagawa"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43032   Expand You're Under Arrest!   (1996) User Score Overview Tokyo Highway Patrolwomen Natsumi and Miyuki get off to a bad start when Miyuki busts Natsumi for reckless moped driving on her way to work. Things get worse when they find out they're going to be partners! A continuation of the OVA series, the adventures of Tokyo policewomen Natsumi and Miyuki continue in the You're Under Arrest TV series. It's back to Bokuto Precinct, where demented felons and bashful (but hunky) policemen abound, and where the cutest girl in the office... isn't a girl. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Etsuko Kozakura Akiko Hiramatsu Sakiko Tamagawa Full Cast & Crew Last Season Season 3 2007 | 23 Episodes Season 3 of You're Under Arrest! premiered on October  4, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You're Under Arrest!. You can help by rating TV shows you've seen. Facts Original Name  逮捕しちゃうぞ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Action & Adventure Comedy Keywords police anime Content Score 43 There's no 'I' in team... Top Contributors 11 TheDerpMan Z 4 ZZaunkoenig b 1 bestiada  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}