{"link": "https://www.themoviedb.org/tv/10612?language=en", "title": "Dick Turpin", "resume": "Dick Turpin is a British television drama series starring Richard O'Sullivan and Michael Deeks. It was created by Richard Carpenter, Paul Knight and Sydney Cole and written by Richard Carpenter, John Kane, Charles Crichton and Paul Wheeler, it was made by Gatetarn, Seacastle productions in-association with London Weekend Television between 1978 and 1980. 26 half hour episodes and one feature length episode were filmed on location at Maidenhead in Berkshire, England.\nThe series is loosely based on the adventures of the real 18th century highwayman Dick Turpin.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Richard O'Sullivan", "Christopher Benjamin", "David Daker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10612   Expand Dick Turpin   (1979) User Score Overview Dick Turpin is a British television drama series starring Richard O'Sullivan and Michael Deeks. It was created by Richard Carpenter, Paul Knight and Sydney Cole and written by Richard Carpenter, John Kane, Charles Crichton and Paul Wheeler, it was made by Gatetarn, Seacastle productions in-association with London Weekend Television between 1978 and 1980. 26 half hour episodes and one feature length episode were filmed on location at Maidenhead in Berkshire, England. The series is loosely based on the adventures of the real 18th century highwayman Dick Turpin. Featured Crew Richard Carpenter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard O'Sullivan Christopher Benjamin David Daker Full Cast & Crew Last Season Season 4 1982 | 6 Episodes Season 4 of Dick Turpin premiered on January 30, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dick Turpin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors d 11 darkburner  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}