{"link": "https://www.themoviedb.org/tv/35244?language=en", "title": "Hollywood Wives", "resume": "Jackie Collins' Hollywood Wives is a 1985 television mini-series based on the 1983 novel by Jackie Collins.\nHollywood Wives tells the stories of several women in Hollywood, from powerful talent agents and screenwriters to vivacious screen vixens and young, innocent newcomers. The mini-series generally follows the same plot as the novel, though it does omit certain subplots and characters.\nAiring in February 1985, Hollywood Wives was one of the most watched mini-series of the 1980s. The 3-part, four-and-a-half-hour production was produced by Aaron Spelling, whose hit show Dynasty was no.1 in the ratings at the time, perhaps partly accounting for the ratings success of Hollywood Wives. Like Dynasty, costume design was by Nolan Miller.\nJackie Collins herself was credited as \"Creative Consultant\" for the mini-series, though she later made it clear that she was not actually consulted at all during production and was less than enthusiastic about some of the casting choices.\nHollywood Wives was nominated for an Emmy Award for \"Outstanding Film Editing in a Limited Series or a Special\" in 1985.", "rate": 25, "genre": ["Drama"], "cast": ["Andrew Stevens", "Roddy McDowall", "Robert Stack", "Stefanie Powers", "Joanna Cassidy"], "character": ["Montana Gray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35244   Expand Hollywood Wives   (1985) User Score Overview Jackie Collins' Hollywood Wives is a 1985 television mini-series based on the 1983 novel by Jackie Collins. Hollywood Wives tells the stories of several women in Hollywood, from powerful talent agents and screenwriters to vivacious screen vixens and young, innocent newcomers. The mini-series generally follows the same plot as the novel, though it does omit certain subplots and characters. Airing in February 1985, Hollywood Wives was one of the most watched mini-series of the 1980s. The 3-part, four-and-a-half-hour production was produced by Aaron Spelling, whose hit show Dynasty was no.1 in the ratings at the time, perhaps partly accounting for the ratings success of Hollywood Wives. Like Dynasty, costume design was by Nolan Miller. Jackie Collins herself was credited as \"Creative Consultant\" for the mini-series, though she later made it clear that she was not actually consulted at all during production and was less than enthusiastic about some of the casting choices. Hollywood Wives was nominated for an Emmy Award for \"Outstanding Film Editing in a Limited Series or a Special\" in 1985. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Stevens Roddy McDowall Robert Stack Stefanie Powers Montana Gray Joanna Cassidy Full Cast & Crew Last Season Season 1 1985 | 3 Episodes Season 1 of Hollywood Wives premiered on February 17, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hollywood Wives. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords miniseries Content Score 71 Just a little bit more... Top Contributors TB 24 TMDb Bot R 7 Rebecca s 3 speedycars r 1 rburton66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}