{"link": "https://www.themoviedb.org/tv/13752?language=en", "title": "Saturday Kitchen", "resume": "Saturday Kitchen Live is a 90 minute cookery programme, which is broadcast live on BBC One on Saturday mornings. It is currently presented by James Martin; previous presenters have included Antony Worrall Thompson and Gregg Wallace. The programme is currently produced by Cactus TV. The programme has also aired on RTÉ One in Ireland on Saturday mornings, the episodes shown are several months old.", "rate": 0, "genre": [], "cast": ["James Martin"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13752   Expand Saturday Kitchen   (2002) User Score Overview Saturday Kitchen Live is a 90 minute cookery programme, which is broadcast live on BBC One on Saturday mornings. It is currently presented by James Martin; previous presenters have included Antony Worrall Thompson and Gregg Wallace. The programme is currently produced by Cactus TV. The programme has also aired on RTÉ One in Ireland on Saturday mornings, the episodes shown are several months old. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Martin Himself - Presenter Full Cast & Crew Last Season Season 2013 2013 | 43 Episodes Season 2013 of Saturday Kitchen premiered on January  5, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Saturday Kitchen. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   https://www.bbc.co.uk/programmes/b006v5y2 Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 28 United600 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}