{"link": "https://www.themoviedb.org/tv/69014?language=en", "title": "The Beginning of Life: The Series", "resume": "Using breakthroughs in technology and neuroscience, this series examines how environment affects infants - and how infants can affect our future.", "rate": 100, "genre": ["Documentary", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69014   Expand The Beginning of Life: The Series   (2016) User Score Overview Using breakthroughs in technology and neuroscience, this series examines how environment affects infants - and how infants can affect our future. Featured Crew Estela Renner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Beginning of Life: The Series. You can help by rating TV shows you've seen. Facts Original Name  O Começo da Vida, Série Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Documentary Original Language  Portuguese Runtime  45m Homepage  - Genres Documentary Family Keywords development child crianças desenvolvimento criação Content Score 64 We're so close, yet so far. Top Contributors 50 Gabriel W. Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}