{"link": "https://www.themoviedb.org/tv/34566?language=en", "title": "The Power of Destiny", "resume": "La Fuerza del Destino is a Mexican telenovela produced by Rosy Ocampo for Televisa. Sandra Echeverria and David Zepeda star as the main protagonists, while Laisha Wilkins, Gabriel Soto, Rosa Maria Bianchi, and Juan Ferrara star as the main antagonists. La Fuerza del Destino won 5 awards in Premios TVyNovelas: Best first actress, best original story or adaptation, best male antagonist, best lead actress, and best telenovela of the year. The theme song is sung by Marc Anthony and Sandra Echeverria. Portions of their performance in the recording studio are periodically shown in the closing credits.\nCanal de las Estrellas aired La Fuerza del Destino from March 14 to July 31, 2011 Univision had announced that La Fuerza del Destino would air on the network as part of the 2011-2012 programming schedule, and was broadcast from August 2 to December 26, 2011, with La que no podía amar replacing it in both countries. It was awarded\"The Best Telenovela of 2012\" by Premios TVyNovelas.", "rate": 0, "genre": ["Drama"], "cast": ["David Zepeda", "Sandra Echeverría", "Laisha Wilkins", "Juan Ferrara", "Gabriel Soto"], "character": ["Iván Villagómez / Iván McGuire", "Lucía Lomelí Curiel", "Maripaz Lomelí Curiel", "Juan Jaime Mondragón", "Camilo Galván"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34566   Expand The Power of Destiny   (2011) User Score Overview La Fuerza del Destino is a Mexican telenovela produced by Rosy Ocampo for Televisa. Sandra Echeverria and David Zepeda star as the main protagonists, while Laisha Wilkins, Gabriel Soto, Rosa Maria Bianchi, and Juan Ferrara star as the main antagonists. La Fuerza del Destino won 5 awards in Premios TVyNovelas: Best first actress, best original story or adaptation, best male antagonist, best lead actress, and best telenovela of the year. The theme song is sung by Marc Anthony and Sandra Echeverria. Portions of their performance in the recording studio are periodically shown in the closing credits. Canal de las Estrellas aired La Fuerza del Destino from March 14 to July 31, 2011 Univision had announced that La Fuerza del Destino would air on the network as part of the 2011-2012 programming schedule, and was broadcast from August 2 to December 26, 2011, with La que no podía amar replacing it in both countries. It was awarded\"The Best Telenovela of 2012\" by Premios TVyNovelas. Featured Crew María Zarattini Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Zepeda Iván Villagómez / Iván McGuire Sandra Echeverría Lucía Lomelí Curiel Laisha Wilkins Maripaz Lomelí Curiel Juan Ferrara Juan Jaime Mondragón Gabriel Soto Camilo Galván Full Cast & Crew Last Season Season 1 2011 | 1 Episode Season 1 of The Power of Destiny premiered on March 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Power of Destiny. You can help by rating TV shows you've seen. Facts Original Name  La Fuerza del Destino Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.televisa.esmas.com/entretenimiento/telenovelas/la-fuerza-del-destino/ Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 24 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}