{"link": "https://www.themoviedb.org/tv/9841?language=en", "title": "It's Garry Shandling's Show", "resume": "It's Garry Shandling's Show is an American sitcom which was initially broadcast on Showtime from 1986 to 1990. It was created by Garry Shandling and Alan Zweibel. The show is notable for its frequent use of breaking the fourth wall to allow characters to speak directly to the audience. Its format inspired Sean Hughes to create Sean's Show in the UK.", "rate": 75, "genre": ["Comedy"], "cast": ["Paul Willson", "Michael Tucci", "Garry Shandling", "Barbara Cason", "Molly Cheek"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9841   Expand It's Garry Shandling's Show   (1986) User Score  Play Trailer Overview It's Garry Shandling's Show is an American sitcom which was initially broadcast on Showtime from 1986 to 1990. It was created by Garry Shandling and Alan Zweibel. The show is notable for its frequent use of breaking the fourth wall to allow characters to speak directly to the audience. Its format inspired Sean Hughes to create Sean's Show in the UK. Featured Crew Garry Shandling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Willson Michael Tucci Garry Shandling Barbara Cason Molly Cheek Full Cast & Crew Last Season Season 4 1989 | 19 Episodes Season 4 of It's Garry Shandling's Show premiered on November 10, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on It's Garry Shandling's Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 4 Banana b 1 bmorr72 TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}