{"link": "https://www.themoviedb.org/tv/39388?language=en", "title": "Femme Fatales", "resume": "Femme Fatales is an anthology TV series, inspired by the men's magazine of the same name, with each episode focusing on an antihero woman, intercut with softcore pornographic scenes and produced by Cinemax.\nLilith, introduces each episode Rod Serling-style and occasionally appears within the narrative. Some characters make encore appearances in later episodes.", "rate": 63, "genre": ["Drama"], "cast": ["Christine Donlon", "Tanit Phoenix Copley", "Sandra McCoy", "Nikki Griffin", "Leilani Sarelle"], "character": ["Violet MacReady", "Lilith", "Professor Kelsey Williams", "Nicole Ryan", "Veronica Flood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39388   Expand Femme Fatales   (2011) User Score Overview Femme Fatales is an anthology TV series, inspired by the men's magazine of the same name, with each episode focusing on an antihero woman, intercut with softcore pornographic scenes and produced by Cinemax. Lilith, introduces each episode Rod Serling-style and occasionally appears within the narrative. Some characters make encore appearances in later episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christine Donlon Violet MacReady Tanit Phoenix Copley Lilith Sandra McCoy Professor Kelsey Williams Nikki Griffin Nicole Ryan Leilani Sarelle Veronica Flood Full Cast & Crew Last Season Season 2 2012 | 13 Episodes Season 2 of Femme Fatales premiered on May 25, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations   2013-09-29 Masters of Sex 6.6    2007-09-19 Gossip Girl 6.3    2015-10-31 Ash vs Evil Dead 7.8  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  23m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors f 10 florin1704 m 6 moviedbmailinator 5 Atanas z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}