{"link": "https://www.themoviedb.org/tv/30577?language=en", "title": "Elmo's World", "resume": "\"Elmo's World\" is a fifteen-minute long segment that was shown at the end of the children's television program Sesame Street. It premiered in late 1998, as part of the show's structural changes, to appeal to their younger viewers, and to increase their lower ratings. The segment was developed out of a series of workshops that studied the changes in the viewing habits of their audience, and the reasons for the show's lower ratings. \"Elmo's World\" used traditional elements of production, but had a more sustained narrative. It was presented from the perspective of a three-year old child as represented by its host, the Muppet Elmo, who was performed by Kevin Clash. In 2002, Sesame Street's producers changed the rest of the show to reflect its younger demographic and the increase in their viewers' sophistication.\nLong-time writer Judy Freudberg came up with the concept of \"Elmo's World\", and writer Tony Geiss and executive producer Arlene Sherman helped develop it. Instead of the realism of the rest of the show, the segment presented Elmo moving between and combining two worlds of live action and computer-generated animation, which looked like a child's squiggly crayon drawing come to life\" created by the host, and with \"a stream-of-consciousness feel to it\". In addition to Elmo, two other important characters in \"Elmo's World\", Elmo's pet goldfish Dorothy and the members of the Noodle family, were silent in order to allow Elmo to do all the talking, and to give children the opportunity to respond to what they saw on the screen.", "rate": 40, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30577   Expand Elmo's World User Score Overview \"Elmo's World\" is a fifteen-minute long segment that was shown at the end of the children's television program Sesame Street. It premiered in late 1998, as part of the show's structural changes, to appeal to their younger viewers, and to increase their lower ratings. The segment was developed out of a series of workshops that studied the changes in the viewing habits of their audience, and the reasons for the show's lower ratings. \"Elmo's World\" used traditional elements of production, but had a more sustained narrative. It was presented from the perspective of a three-year old child as represented by its host, the Muppet Elmo, who was performed by Kevin Clash. In 2002, Sesame Street's producers changed the rest of the show to reflect its younger demographic and the increase in their viewers' sophistication. Long-time writer Judy Freudberg came up with the concept of \"Elmo's World\", and writer Tony Geiss and executive producer Arlene Sherman helped develop it. Instead of the realism of the rest of the show, the segment presented Elmo moving between and combining two worlds of live action and computer-generated animation, which looked like a child's squiggly crayon drawing come to life\" created by the host, and with \"a stream-of-consciousness feel to it\". In addition to Elmo, two other important characters in \"Elmo's World\", Elmo's pet goldfish Dorothy and the members of the Noodle family, were silent in order to allow Elmo to do all the talking, and to give children the opportunity to respond to what they saw on the screen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 31 2000 | 1 Episode Season 31 of Elmo's World premiered on January 18, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m, 20m, 15m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 3 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}