{"link": "https://www.themoviedb.org/tv/34820?language=en", "title": "Jing: King of Bandits", "resume": "Jing: King of Bandits, also known as King of Bandit Jing, is a seven volume manga series by Yuichi Kumakura about the adventures of the bandit Jing and his partner Kir. The manga was adapted into a 13 episode anime series produced by Aniplex and directed by Hiroshi Watanabe as well as a Game Boy game released in 2000 by Messiah. The anime series aired from May 15, 2002 to August 14, 2002 on NHK in Japan. The manga is licensed in English in North America by Tokyopop. ADV Films licensed the Jing: King of Bandits anime series for $50,000. ADV had also licensed the Seventh Heaven OVA, however in 2008, the OVA became one of over ADV titles transferred to Funimation. As of September 1, 2009, all of ADV Films' former catalog are transferred to AEsir Holdings, with distribution from Section23 Films\nA recurring theme in Jing: King of Bandits is references to alcoholic beverages. Chapters are referred to as \"shots\". Each storyline arc features at least one person who is named after an alcoholic beverage. In addition, each town or city is named after a cocktail, and Jing and Kir's \"Kir Royale\" attack is also a cocktail, observed by his catch phrase \"Gimme a Kir Royale\" uttered almost every time before he uses it. More information about the specifics of each name can be found in the Tokyopop releases.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Mitsuki Saiga", "Shin'ichirou Miki", "Ryusei Nakao"], "character": ["Jing", "Postino", "Kir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34820   Expand Jing: King of Bandits   (2002) User Score Overview Jing: King of Bandits, also known as King of Bandit Jing, is a seven volume manga series by Yuichi Kumakura about the adventures of the bandit Jing and his partner Kir. The manga was adapted into a 13 episode anime series produced by Aniplex and directed by Hiroshi Watanabe as well as a Game Boy game released in 2000 by Messiah. The anime series aired from May 15, 2002 to August 14, 2002 on NHK in Japan. The manga is licensed in English in North America by Tokyopop. ADV Films licensed the Jing: King of Bandits anime series for $50,000. ADV had also licensed the Seventh Heaven OVA, however in 2008, the OVA became one of over ADV titles transferred to Funimation. As of September 1, 2009, all of ADV Films' former catalog are transferred to AEsir Holdings, with distribution from Section23 Films A recurring theme in Jing: King of Bandits is references to alcoholic beverages. Chapters are referred to as \"shots\". Each storyline arc features at least one person who is named after an alcoholic beverage. In addition, each town or city is named after a cocktail, and Jing and Kir's \"Kir Royale\" attack is also a cocktail, observed by his catch phrase \"Gimme a Kir Royale\" uttered almost every time before he uses it. More information about the specifics of each name can be found in the Tokyopop releases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitsuki Saiga Jing Shin'ichirou Miki Postino Ryusei Nakao Kir Full Cast & Crew Last Season Season 1 2002 | 13 Episodes Season 1 of Jing: King of Bandits premiered on May 15, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Jing: King of Bandits. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors m 3 magoozin 1 Elizabeth Jennings 1 TheDerpMan S 1 SACorreia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}