{"link": "https://www.themoviedb.org/tv/65520?language=en", "title": "King Star King", "resume": "King Star King is a tall, blond muscular man who after seducing his love, Princess Snow White, falls from his higher plane of existence to serve as a fry cook in a run-down waffle house. In order to reclaim his place in the heavens, he must battle his amnesia to defeat the evil Spring Bunny and rescue Snow White.", "rate": 93, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy"], "cast": ["Robin Atkin Downes", "J.J. Villard", "Mallory McGill", "Rachel Butera", "Tommy Blacha"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65520   Expand King Star King   (2014) User Score Overview King Star King is a tall, blond muscular man who after seducing his love, Princess Snow White, falls from his higher plane of existence to serve as a fry cook in a run-down waffle house. In order to reclaim his place in the heavens, he must battle his amnesia to defeat the evil Spring Bunny and rescue Snow White. Featured Crew J.J. Villard Creator Eric Kaplan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robin Atkin Downes J.J. Villard Mallory McGill Rachel Butera Tommy Blacha Full Cast & Crew Last Season Season 1 2014 | 6 Episodes Season 1 of King Star King premiered on June 15, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on King Star King. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage   http://www.adultswim.com/videos/king-star-king/ Genres Sci-Fi & Fantasy Animation Comedy Keywords star king Content Score 100 Yes! Looking good! Top Contributors 51 LautyWTF 13 Elizabeth Jennings z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}