{"link": "https://www.themoviedb.org/tv/17415?language=en", "title": "BrainSurge", "resume": "BrainSurge is an American children's game show aired on Nickelodeon hosted by Jeff Sutphen. The show taped its first season in February 2009, and debuted on September 28, 2009. The show's format was adapted from the Tokyo Broadcasting System game show Brain Survivor.\nThe network announced on February 18, 2010 that the program was renewed for a second season, that will consist of 40 episodes, and will feature the same format without any known changes. The second season, which featured the 40 original episodes plus one episode held over from season one, premiered on June 21, 2010. The third season started airing on July 18, 2011 on Nick@Nite. Season 3 is marketed as Family BrainSurge, and has a two-person family team format with five teams.\nBrainSurge was taped at Hollywood Center Studios in Hollywood, California.", "rate": 78, "genre": ["Kids"], "cast": ["Lilly Petruzzi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17415   Expand BrainSurge   (2009) User Score Overview BrainSurge is an American children's game show aired on Nickelodeon hosted by Jeff Sutphen. The show taped its first season in February 2009, and debuted on September 28, 2009. The show's format was adapted from the Tokyo Broadcasting System game show Brain Survivor. The network announced on February 18, 2010 that the program was renewed for a second season, that will consist of 40 episodes, and will feature the same format without any known changes. The second season, which featured the 40 original episodes plus one episode held over from season one, premiered on June 21, 2010. The third season started airing on July 18, 2011 on Nick@Nite. Season 3 is marketed as Family BrainSurge, and has a two-person family team format with five teams. BrainSurge was taped at Hollywood Center Studios in Hollywood, California. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lilly Petruzzi Full Cast & Crew Last Season Season 1 2009 | 31 Episodes Season 1 of BrainSurge premiered on September 28, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on BrainSurge. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  22m Homepage   http://www.nick.com/shows/brainsurge Genres Kids Keywords game show children Content Score 43 There's no 'I' in team... Top Contributors 5 Banana R 3 Rebecca TB 2 TMDb Bot A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}