{"link": "https://www.themoviedb.org/tv/70540?language=en", "title": "Andi Mack", "resume": "Andi is contemplative and artistic and sheltered by overprotective parents. But on the eve of her 13th birthday, Andi's free-spirited older sister Bex returns home with a revelation that changes everything and sends Andi on an uncharted course of self-discovery.", "rate": 69, "genre": ["Comedy", "Family"], "cast": ["Peyton Elizabeth Lee", "Joshua Rush", "Sofia Wylie", "Asher Angel", "Lauren Tom"], "character": ["Andi Mack", "Cyrus Goodman", "Buffy Driscoll", "Jonah Beck", "Celia Mack"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70540   Expand Andi Mack   (2017) User Score  Play Trailer Overview Andi is contemplative and artistic and sheltered by overprotective parents. But on the eve of her 13th birthday, Andi's free-spirited older sister Bex returns home with a revelation that changes everything and sends Andi on an uncharted course of self-discovery. Featured Crew Terri Minsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Peyton Elizabeth Lee Andi Mack Joshua Rush Cyrus Goodman Sofia Wylie Buffy Driscoll Asher Angel Jonah Beck Lauren Tom Celia Mack Full Cast & Crew Current Season Season 2 2017 | 18 Episodes Season 2 of Andi Mack premiered on October 27, 2017. View All Seasons Social Reviews  1 Discussions  7 Featured Review A review by Reno  8.0 Written by  Reno  on September 26, 2017 She's just turned a teenager, and her personal life just got twisted! SEASON 01: The latest coming-of-age comedy-drama from Disney channel. 'Girls Meets World' left a big void and so far no programme had replaced it. Could this be the one? Well, I would say, almost. 12 episodes per season for a children's show is too short, even for a short as 20 minutes long per episode. But it was a good initiation. Not just focused on comedy, but so many inspiring topics as well. And then its central character, Andi was not the one who led the entire show. The best part was, all the character...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  1 Posters  2 Recommendations   2017-10-03 Kevin (Probably) Saves the World 7.3    2017-04-04 Dimension 404 6.8    2010-03-27 Victorious 7.1    2017-01-01 The Mick 6.9  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  23m Homepage   http://disneynow.go.com/shows/andi-mack Genres Comedy Family Keywords teenage girl best friend middle school teenager east asian lead Content Score 100 Yes! Looking good! Top Contributors 31 Warpath a 17 acontributor 17 Banana 16 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}