{"link": "https://www.themoviedb.org/tv/62284?language=en", "title": "Those Who Kill", "resume": "Follows Catherine Jensen, a recently promoted homicide detective who enlists the help of Thomas Schaeffer, a forensic psychologist, to track down serial killers and relentlessly seeks the truth behind the disappearance of her brother.", "rate": 57, "genre": ["Action", "Adventure", "Crime"], "cast": ["Chloë Sevigny", "James D'Arcy"], "character": ["Catherine Jensen", "Thomas Schaeffer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62284   Expand Those Who Kill   (2014) User Score  Play Trailer Overview Follows Catherine Jensen, a recently promoted homicide detective who enlists the help of Thomas Schaeffer, a forensic psychologist, to track down serial killers and relentlessly seeks the truth behind the disappearance of her brother. Featured Crew Glen Morgan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chloë Sevigny Catherine Jensen James D'Arcy Thomas Schaeffer Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Those Who Kill premiered on March  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2015-02-04 Winter 7.0    2015-06-10 The Interceptor 5.7    2015-11-16 The Coroner 5.2    2009-04-09 Southland 7.8    2012-12-30 Ripper Street 7.3  Facts Status  Cancelled Networks Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Action & Adventure Crime Keywords serial killer missing person female detective homicide detective forensic psychologist Content Score 71 Just a little bit more... Top Contributors 22 Paul 20 Elizabeth Jennings CM 8 Cherche Moi s 8 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}