{"link": "https://www.themoviedb.org/tv/13859?language=en", "title": "The Rifleman", "resume": "The Rifleman is an American Western television program starring Chuck Connors as rancher Lucas McCain and Johnny Crawford as his son, Mark McCain. It was set in the 1880s in the town of North Fork, New Mexico Territory. The show was filmed in black-and-white, half-hour episodes. \"The Rifleman\" aired on ABC from September 30, 1958 to April 8, 1963 as a production of Four Star Television. It was one of the first prime time series to have a widowed parent raise a child.", "rate": 73, "genre": ["Action", "Adventure", "Western"], "cast": ["Chuck Connors", "Johnny Crawford"], "character": ["Lucas McCain", "Mark McCain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13859   Expand The Rifleman   (1958) User Score Overview The Rifleman is an American Western television program starring Chuck Connors as rancher Lucas McCain and Johnny Crawford as his son, Mark McCain. It was set in the 1880s in the town of North Fork, New Mexico Territory. The show was filmed in black-and-white, half-hour episodes. \"The Rifleman\" aired on ABC from September 30, 1958 to April 8, 1963 as a production of Four Star Television. It was one of the first prime time series to have a widowed parent raise a child. Featured Crew Sam Peckinpah Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chuck Connors Lucas McCain Johnny Crawford Mark McCain Full Cast & Crew Last Season Season 5 1962 | 26 Episodes Season 5 of The Rifleman premiered on October  1, 1962. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Rifleman. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1957-09-14 Have Gun – Will Travel 8.3    1958-09-23 Sea Hunt 6.8    1968-01-09 It Takes a Thief 7.4    1965-01-24 Branded 8.3    1957-09-18 Wagon Train 6.3    1963-09-24 Petticoat Junction 5.7    1963-09-29 My Favorite Martian 5.4    1952-10-01 This Is Your Life 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Western Keywords widower Content Score 64 We're so close, yet so far. Top Contributors 11 Steve PE 5 Patrick E. Abe S 2 Samara 2 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}