{"link": "https://www.themoviedb.org/tv/74557?language=en", "title": "Screen Time", "resume": "Join Chris Taylor for a brand new show all about film, television and just about anything else you can watch on a screen. From the latest blockbusters to the hidden gems, we're here to help you work out what to watch next", "rate": 0, "genre": ["Talk"], "cast": ["Chris Taylor"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74557   Expand Screen Time   (2017) User Score Overview Join Chris Taylor for a brand new show all about film, television and just about anything else you can watch on a screen. From the latest blockbusters to the hidden gems, we're here to help you work out what to watch next Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Taylor Host Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Screen Time premiered on October 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Screen Time. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Talk Show Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/programs/screen-time/ Genres Talk Keywords television youtube Content Score 56 We're so close, yet so far. Top Contributors 22 zdlr 4 United600 TB 2 TMDb Bot 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}