{"link": "https://www.themoviedb.org/tv/74074?language=en", "title": "Because This Is My First Life", "resume": "Nam Se-Hee is a single man in his early 30's. He has chosen to not marry. He owns his home, but he owes a lot on his mortgage. Yoon Ji-Ho is a single woman in her early 30's. She does not own a home and envies those that do. She has given up on dating due to her financial struggles. Yoon Ji-Ho begins to live at Nam Se-Hee’s house. They become housemates.", "rate": 93, "genre": ["Comedy", "Drama"], "cast": ["Lee Min-ki", "Jung So-min", "Park Byung-eun", "Esom", "Kim Min-seok"], "character": ["Nam Se-Hee", "Yoon Ji-Ho", "Ma Sang-Goo", "Woo Soo-Ji", "Sim Won-Seok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74074   Expand Because This Is My First Life   (2017) User Score Overview Nam Se-Hee is a single man in his early 30's. He has chosen to not marry. He owns his home, but he owes a lot on his mortgage. Yoon Ji-Ho is a single woman in her early 30's. She does not own a home and envies those that do. She has given up on dating due to her financial struggles. Yoon Ji-Ho begins to live at Nam Se-Hee’s house. They become housemates. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Min-ki Nam Se-Hee Jung So-min Yoon Ji-Ho Park Byung-eun Ma Sang-Goo Esom Woo Soo-Ji Kim Min-seok Sim Won-Seok Full Cast & Crew Current Season Season 1 2017 | 16 Episodes Season 1 of Because This Is My First Life premiered on October  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2017-10-11 Avengers Social Club 8.7    2017-05-22 Circle 6.6  Facts Original Name  이번 생은 처음이라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/tvnfirstlife/ Genres Comedy Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 65 Maria180493 k 12 keror0 10 Elizabeth Jennings q 5 qq1112q  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}