{"link": "https://www.themoviedb.org/tv/5512?language=en", "title": "Working Girl", "resume": "Working Girl is an American sitcom that aired on NBC from April to July 1990. Loosely based on the 1988 film of the same name starring Melanie Griffith, the series stars Sandra Bullock as Tess McGill, in a role that was initially meant for Nancy McKeon.", "rate": 0, "genre": ["Comedy"], "cast": ["Sandra Bullock", "George Newbern", "Anthony Tyler Quinn", "Judy Prescott", "Eyde Byrde"], "character": ["Tess McGill", "Everett Rutledge", "Sal Pascarella", "Lana Peters", "Libby Wentworth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5512   Expand Working Girl   (1990) User Score Overview Working Girl is an American sitcom that aired on NBC from April to July 1990. Loosely based on the 1988 film of the same name starring Melanie Griffith, the series stars Sandra Bullock as Tess McGill, in a role that was initially meant for Nancy McKeon. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sandra Bullock Tess McGill George Newbern Everett Rutledge Anthony Tyler Quinn Sal Pascarella Judy Prescott Lana Peters Eyde Byrde Libby Wentworth Full Cast & Crew Last Season Season 1 1990 | 8 Episodes Season 1 of Working Girl premiered on April 16, 1990. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Tess: Happy Birthday Sandra Bullock! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Working Girl. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york sitcom workplace comedy Content Score 71 Just a little bit more... Top Contributors 21 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}