{"link": "https://www.themoviedb.org/tv/2014?language=en", "title": "Saved by the Bell: The College Years", "resume": "Saved by the Bell: The College Years is a sequel to the Saved by the Bell series which ran from September 14, 1993 to February 8, 1994, lasting one season. It was the third incarnation of the franchise. It is also the only series of the franchise to air on primetime television instead of Saturday mornings. It aired on NBC on Tuesday evenings.", "rate": 50, "genre": ["Comedy"], "cast": ["Mark-Paul Gosselaar", "Mario López", "Dustin Diamond", "Anne Tremko", "Kiersten Warren"], "character": ["Zachary 'Zack' Morris", "A.C. Slater", "Samuel \"Screech\" Powers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2014   Expand Saved by the Bell: The College Years   (1993) User Score Overview Saved by the Bell: The College Years is a sequel to the Saved by the Bell series which ran from September 14, 1993 to February 8, 1994, lasting one season. It was the third incarnation of the franchise. It is also the only series of the franchise to air on primetime television instead of Saturday mornings. It aired on NBC on Tuesday evenings. Featured Crew Sam Bobrick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark-Paul Gosselaar Zachary 'Zack' Morris Mario López A.C. Slater Dustin Diamond Samuel \"Screech\" Powers Anne Tremko Kiersten Warren Full Cast & Crew Last Season Season 1 1993 | 20 Episodes Season 1 of Saved by the Bell: The College Years premiered on May 22, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1987-09-20 My Two Dads 5.7    1996-03-29 Nash Bridges 6.5    1999-09-19 Judging Amy 7.1    1996-08-26 7th Heaven 5.2    1989-08-20 Saved by the Bell 6.2    1994-09-21 Touched by an Angel 5.3    1983-09-17 Alvin and the Chipmunks 6.0    1976-03-21 Charlie's Angels 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Comedy Keywords california college young adult Content Score 93 Almost there... Top Contributors 7 Banana M 4 Manu z 4 zurman1 p 4 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}