{"link": "https://www.themoviedb.org/tv/39680?language=en", "title": "China, IL", "resume": "China, IL – meaning \"China, Illinois\" – is an animated television series for the cable network Adult Swim. The series is created by Brad Neely, and features Neely's existing characters from the China, IL web series and special. Characters include Frank and Steve Smith, aka \"The Professor Brothers,\" and Mark \"Baby\" Cakes. Neely provides the voice for all three characters. The series is produced by Williams Street and animated by Titmouse, Inc. China, IL has been renewed for a second season with the possibility of a new half-hour runtime.\nOn May 25, 2008, Adult Swim ran The Funeral, an 11-minute special which was streamed on the now defunct Super Deluxe website. The special combined Brad Neely's Professor Brothers and Baby Cakes webseries, which were also streamed at Super Deluxe, and established a larger environment for the characters. The special, as well as Brad Neely's other videos, can be viewed at Neely's YouTube page.", "rate": 60, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39680   Expand China, IL   (2011) User Score Overview China, IL – meaning \"China, Illinois\" – is an animated television series for the cable network Adult Swim. The series is created by Brad Neely, and features Neely's existing characters from the China, IL web series and special. Characters include Frank and Steve Smith, aka \"The Professor Brothers,\" and Mark \"Baby\" Cakes. Neely provides the voice for all three characters. The series is produced by Williams Street and animated by Titmouse, Inc. China, IL has been renewed for a second season with the possibility of a new half-hour runtime. On May 25, 2008, Adult Swim ran The Funeral, an 11-minute special which was streamed on the now defunct Super Deluxe website. The special combined Brad Neely's Professor Brothers and Baby Cakes webseries, which were also streamed at Super Deluxe, and established a larger environment for the characters. The special, as well as Brad Neely's other videos, can be viewed at Neely's YouTube page. Featured Crew Brad Neely Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2015 | 10 Episodes Season 3 of China, IL premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2007-05-13 Superjail! 7.5    1989-09-09 Beetlejuice 7.2    2006-10-16 Frisky Dingo 8.1    2005-07-08 Camp Lazlo 5.6    2007-07-11 Code Monkeys 7.4    2000-12-21 The Brak Show 7.0    1994-03-05 Duckman 8.1    1995-09-09 Freakazoid! 7.3  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  25m, 11m Homepage   http://www.adultswim.com/shows/china-il/index.html Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 9 TMDb Bot A 2 AnthonyAtkins232 p 2 panjoel 2 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}