{"link": "https://www.themoviedb.org/tv/875?language=en", "title": "Guiding Light", "resume": "Guiding Light is an American television soap opera that is credited by the Guinness Book of World Records as the longest-running television drama in history, broadcast from 1952 until 2009, preceded by a 15-year broadcast on radio. Guiding Light stands as the third longest-running program in all of broadcast history; only the Norwegian children's radio program Lørdagsbarnetimen and the American country music radio program Grand Ole Opry have been on the air longer.\nGuiding Light was created by Irna Phillips, and began as an NBC Radio serial on January 25, 1937. During June 2, 1947, the series was transferred to CBS Radio, before starting on June 30, 1952, on CBS Television. It would continue to be broadcast concomitantly on radio until June 29, 1956. The series was expanded from 15 minutes to a half-hour during 1968, and then to a full hour on November 7, 1977. The series broadcast its 15,000th televised episode on September 6, 2006.\nOn April 1, 2009, it was announced that CBS canceled Guiding Light after a 72-year run due to low ratings. The show taped its final scenes for CBS on August 11, 2009, and its final episode on the network aired on September 18, 2009. On October 5, 2009, CBS replaced Guiding Light with an hour-long revival of Let's Make a Deal, hosted by Wayne Brady.", "rate": 53, "genre": ["Soap"], "cast": ["Rebecca Staab"], "character": ["Jessica Lynn 'Jessie' Matthews"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 875   Expand Guiding Light   (1952) User Score Overview Guiding Light is an American television soap opera that is credited by the Guinness Book of World Records as the longest-running television drama in history, broadcast from 1952 until 2009, preceded by a 15-year broadcast on radio. Guiding Light stands as the third longest-running program in all of broadcast history; only the Norwegian children's radio program Lørdagsbarnetimen and the American country music radio program Grand Ole Opry have been on the air longer. Guiding Light was created by Irna Phillips, and began as an NBC Radio serial on January 25, 1937. During June 2, 1947, the series was transferred to CBS Radio, before starting on June 30, 1952, on CBS Television. It would continue to be broadcast concomitantly on radio until June 29, 1956. The series was expanded from 15 minutes to a half-hour during 1968, and then to a full hour on November 7, 1977. The series broadcast its 15,000th televised episode on September 6, 2006. On April 1, 2009, it was announced that CBS canceled Guiding Light after a 72-year run due to low ratings. The show taped its final scenes for CBS on August 11, 2009, and its final episode on the network aired on September 18, 2009. On October 5, 2009, CBS replaced Guiding Light with an hour-long revival of Let's Make a Deal, hosted by Wayne Brady. Featured Crew Irna Phillips Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rebecca Staab Jessica Lynn 'Jessie' Matthews Full Cast & Crew Last Season 1952 1952 | 1 Episode Season 1 of Guiding Light premiered on June 30, 1952. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Guiding Light. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.guidinglight.net/ Genres Soap Keywords soap opera Content Score 64 We're so close, yet so far. Top Contributors 17 Banana z 6 zurman1 4 Zlogorek s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}