{"link": "https://www.themoviedb.org/tv/46439?language=en", "title": "Aria the Scarlet Ammo", "resume": "In response to the worsening crime rate, Japan creates Tokyo Butei High, an elite academy where \"Butei\" or armed detectives hone their deadly skills in hopes of becoming mercenary-like agents of justice. One particular Butei is Kinji Tooyama, an anti-social and curt sophomore dropout who was once a student of the combat-centric Assault Division. Kinji now lives a life of leisure studying logistics in order to cover up his powerful but embarrassing special ability. However, his peaceful days soon come to an end when he becomes the target of the infamous \"Butei Killer,\" and runs into an emotional hurricane and outspoken prodigy of the highest rank, Aria Holmes Kanzaki, who saves Kinji's life and demands that he become her partner after seeing what he is truly capable of.", "rate": 57, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Rie Kugimiya", "Junji Majima", "Mariya Ise", "Mikako Takahashi"], "character": ["Kanzaki H. Aria", "Kinji Tooyama", "Riko Mine", "Shirayuki Hotogi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46439   Expand Aria the Scarlet Ammo   (2011) User Score Overview In response to the worsening crime rate, Japan creates Tokyo Butei High, an elite academy where \"Butei\" or armed detectives hone their deadly skills in hopes of becoming mercenary-like agents of justice. One particular Butei is Kinji Tooyama, an anti-social and curt sophomore dropout who was once a student of the combat-centric Assault Division. Kinji now lives a life of leisure studying logistics in order to cover up his powerful but embarrassing special ability. However, his peaceful days soon come to an end when he becomes the target of the infamous \"Butei Killer,\" and runs into an emotional hurricane and outspoken prodigy of the highest rank, Aria Holmes Kanzaki, who saves Kinji's life and demands that he become her partner after seeing what he is truly capable of. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Kugimiya Kanzaki H. Aria Junji Majima Kinji Tooyama Mariya Ise Riko Mine Mikako Takahashi Shirayuki Hotogi Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Aria the Scarlet Ammo premiered on April 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2010-01-05 Ladies versus Butlers! 10.0    2013-03-31 Date a Live 7.9    2012-04-05 Sankarea: Undying Love 7.0    Sekirei Pure Engagement 8.2    2009-10-05 Heaven's Lost Property 5.3    2009-04-02 Phantom: Requiem for the Phantom 6.4    2014-04-09 Chaika - The Coffin Princess 8.2    2008-10-04 A Certain Magical Index 7.4  Facts Original Name  緋弾のアリア Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords anime Content Score 86 Almost there... Top Contributors 19 Dreydor D 5 Deviian v 4 velluto93 3 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}