{"link": "https://www.themoviedb.org/tv/10497?language=en", "title": "American Hot Rod", "resume": "American Hot Rod is a reality television series that originally aired between 2004 and 2008 on The Learning Channel and Discovery Channel. The unique series documented the crew at Boyd Coddington's car shop and their personal struggles to build hot rods and custom vehicles. It was made on location at Coddington's hot rod and wheel shop in La Habra, California. Many employees went to work for Overhaulin's Chip Foose, a former partner of Coddington, for a more relaxed environment.\nCustom built cars built during the series included the \"Alumatub\", 61 Impala Bubbletop, 63 Chevy Corvette Stingray and a 42 Woodie. In July 2007, the shop made an Elvis Tribute Car, a modified 1957 pink Cadillac, sponsored by Reese’s.\nBoyd Coddington died in February 2008. His shop closed its doors for the final time on Friday June 20, 2008.", "rate": 45, "genre": ["Documentary", "Drama"], "cast": ["Boyd Coddington"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10497   Expand American Hot Rod   (2004) User Score Overview American Hot Rod is a reality television series that originally aired between 2004 and 2008 on The Learning Channel and Discovery Channel. The unique series documented the crew at Boyd Coddington's car shop and their personal struggles to build hot rods and custom vehicles. It was made on location at Coddington's hot rod and wheel shop in La Habra, California. Many employees went to work for Overhaulin's Chip Foose, a former partner of Coddington, for a more relaxed environment. Custom built cars built during the series included the \"Alumatub\", 61 Impala Bubbletop, 63 Chevy Corvette Stingray and a 42 Woodie. In July 2007, the shop made an Elvis Tribute Car, a modified 1957 pink Cadillac, sponsored by Reese’s. Boyd Coddington died in February 2008. His shop closed its doors for the final time on Friday June 20, 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Boyd Coddington Full Cast & Crew Last Season Season 5 2007 | 12 Episodes Season 5 of American Hot Rod premiered on July 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on American Hot Rod. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}