{"link": "https://www.themoviedb.org/tv/12785?language=en", "title": "Spaceballs: The Animated Series", "resume": "Spaceballs: The Animated Series, also known as Spaceballs: The Series, is an animated television series that premiered in 2008 on G4 and Canada's Super Channel, and is loosely based on the parody science fiction film Spaceballs. Similarly to how the original film parodied the original Star Wars films and the Star Trek universe, each episode of the series parodies a different film or other aspect of popular culture, such as the Star Wars prequel trilogy, The Lord of the Rings, or the Grand Theft Auto video games.", "rate": 18, "genre": [], "cast": ["Mel Brooks", "Daphne Zuniga", "Rino Romano", "Tino Insana", "Dee Bradley Baker"], "character": ["Princess Vespa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12785   Expand Spaceballs: The Animated Series   (2008) User Score Overview Spaceballs: The Animated Series, also known as Spaceballs: The Series, is an animated television series that premiered in 2008 on G4 and Canada's Super Channel, and is loosely based on the parody science fiction film Spaceballs. Similarly to how the original film parodied the original Star Wars films and the Star Trek universe, each episode of the series parodies a different film or other aspect of popular culture, such as the Star Wars prequel trilogy, The Lord of the Rings, or the Grand Theft Auto video games. Featured Crew Mel Brooks Creator Thomas Meehan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mel Brooks Daphne Zuniga Princess Vespa Rino Romano Tino Insana Dee Bradley Baker Full Cast & Crew Last Season Season 1 2008 | 13 Episodes Season 1 of Spaceballs: The Animated Series premiered on September 21, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Spaceballs: The Animated Series. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}