{"link": "https://www.themoviedb.org/tv/7428?language=en", "title": "Burn Up", "resume": "An oil industrialist, an environmental activist and a politician are in conflict in this drama set around a summit on climate change.", "rate": 65, "genre": ["Drama"], "cast": ["Bradley Whitford", "Neve Campbell", "Rupert Penry-Jones", "Marc Warren", "Sandrine Holt"], "character": ["Mack", "Holly", "Tom", "Philip Crowley", "Mika"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7428   Expand Burn Up   (2008) User Score Overview An oil industrialist, an environmental activist and a politician are in conflict in this drama set around a summit on climate change. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bradley Whitford Mack Neve Campbell Holly Rupert Penry-Jones Tom Marc Warren Philip Crowley Sandrine Holt Mika Full Cast & Crew Last Season Season 1 2008 | 2 Episodes Season 1 of Burn Up premiered on June 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Burn Up. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/drama/burnup/ Genres Drama Keywords climate change global warming miniseries environment Content Score 86 Almost there... Top Contributors 20 Banana 10 Marr 🇳🇱 z 8 zurman1 i 4 ismago  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}