{"link": "https://www.themoviedb.org/tv/61018?language=en", "title": "Whose Line Is It Anyway?", "resume": "\"Whose Line Is It Anyway?\" (1998-2007, 2013-) is the US edition of the British show of the same name (with many of the same performers). It features some of the world's finest improv(isational) comics, including Wayne Brady, Colin Mochrie, Ryan Stiles and Drew Carey (Drew also hosting most shows, Aisha Tyler hosting the 2013 season). Each week, the main four improv comics (and a guest improv comic) spontaneously play \"theatre sports\" with crazy scenes, weird quirks, or improvised songs.", "rate": 77, "genre": ["Comedy"], "cast": ["Ryan Stiles", "Colin Mochrie", "Wayne Brady", "Laura Hall"], "character": ["Himself", "Himself", "Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61018   Expand Whose Line Is It Anyway?   (1998) User Score Overview \"Whose Line Is It Anyway?\" (1998-2007, 2013-) is the US edition of the British show of the same name (with many of the same performers). It features some of the world's finest improv(isational) comics, including Wayne Brady, Colin Mochrie, Ryan Stiles and Drew Carey (Drew also hosting most shows, Aisha Tyler hosting the 2013 season). Each week, the main four improv comics (and a guest improv comic) spontaneously play \"theatre sports\" with crazy scenes, weird quirks, or improvised songs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Stiles Himself Colin Mochrie Himself Wayne Brady Himself Laura Hall Herself Full Cast & Crew Current Season Season 14 2018 | 6 Episodes Season 14 of Whose Line Is It Anyway? premiered on June  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2013-07-16 Whose Line Is It Anyway 8.1    1988-09-23 Whose Line Is It Anyway? 7.8    1990-09-10 The Fresh Prince of Bel-Air 7.3    1996-01-09 3rd Rock from the Sun 7.3    1951-06-15 I Love Lucy 7.6    1996-09-13 Everybody Loves Raymond 6.3    2003-01-22 Chappelle's Show 8.2    1991-08-11 The Ren & Stimpy Show 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cwtv.com/shows/whose-line-is-it-anyway Genres Comedy Keywords remake improvisation Content Score 86 Almost there... Top Contributors 49 Elizabeth Jennings D 15 Doramius b 7 basher ea 4 elizabeth aden  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}