{"link": "https://www.themoviedb.org/tv/62050?language=en", "title": "Winter", "resume": "After the success of 2014’s TV movie The Killing Field, Rebecca Gibney returns to the screen as Detective Sergeant Eve Winter in Seven’s new series Winter. Peter O’Brien will reprise his role as Detective Inspector Lachlan McKenzie. The series will premiere Wednesday 4 February 2015 @ 9.00pm and as it begins Eve Winter and her task force must solve the chilling murder of 23-year old mother Karly at a hauntingly beautiful fishing town south of Sydney.", "rate": 70, "genre": ["Drama"], "cast": ["Rebecca Gibney", "Peter O'Brien", "Matthew Nable", "Antonia Prebble", "Akos Armont"], "character": ["Eve Winter", "Lachlan McKenzie", "Jake Harris", "Alesia Taylor", "Milo Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62050   Expand Winter   (2015) User Score  Play Trailer Overview After the success of 2014’s TV movie The Killing Field, Rebecca Gibney returns to the screen as Detective Sergeant Eve Winter in Seven’s new series Winter. Peter O’Brien will reprise his role as Detective Inspector Lachlan McKenzie. The series will premiere Wednesday 4 February 2015 @ 9.00pm and as it begins Eve Winter and her task force must solve the chilling murder of 23-year old mother Karly at a hauntingly beautiful fishing town south of Sydney. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rebecca Gibney Eve Winter Peter O'Brien Lachlan McKenzie Matthew Nable Jake Harris Antonia Prebble Alesia Taylor Akos Armont Milo Lee Full Cast & Crew Last Season Season 1 2015 | 6 Episodes Season 1 of Winter premiered on February  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   2014-03-03 Those Who Kill 5.7    2015-11-16 The Coroner 5.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   https://au.tv.yahoo.com/plus7/winter/ Genres Drama Keywords australia murder investigation murder mystery Content Score 79 Pump it up! We're close now. Top Contributors 17 Elizabeth Jennings 13 Banana 6 CouchTater w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}