{"link": "https://www.themoviedb.org/tv/42299?language=en", "title": "Legend of the Patriots", "resume": "Legend of the Patriots is a remake of the 1975 South Korean drama Comrades. Its production was spawned to commemorate the 60th anniversary of the Korean War. The story centers around the lives of eleven Korean soldiers fighting in the Korean War. Director Kim Sang-hwi remarked that the series is not about the ideologies of South and North Korea, but rather focuses on the struggles of ordinary people who lived through the war.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lee Tae-ran", "Ryu Sang Wook", "Kim Roe-ha", "Choi Soo-jong", "Lee Deok-hwa "], "character": ["Lee Soo Kyung", "Park Joo Yong", "Park Il Kwon", "Lee Hyun Joong", "Park Woong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42299   Expand Legend of the Patriots   (2010) User Score Overview Legend of the Patriots is a remake of the 1975 South Korean drama Comrades. Its production was spawned to commemorate the 60th anniversary of the Korean War. The story centers around the lives of eleven Korean soldiers fighting in the Korean War. Director Kim Sang-hwi remarked that the series is not about the ideologies of South and North Korea, but rather focuses on the struggles of ordinary people who lived through the war. Featured Crew Kim Sang-hwi Creator Song Hyeon-wook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Tae-ran Lee Soo Kyung Ryu Sang Wook Park Joo Yong Kim Roe-ha Park Il Kwon Choi Soo-jong Lee Hyun Joong Lee Deok-hwa  Park Woong Full Cast & Crew Last Season Comrades season 1 2010 | 20 Episodes Season 1 of Legend of the Patriots premiered on June 19, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Legend of the Patriots. You can help by rating TV shows you've seen. Facts Original Name  전우 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  55m, 60m Homepage   http://www.kbs.co.kr/drama/625/ Genres Action & Adventure Drama Keywords war history Content Score 100 Yes! Looking good! Top Contributors 44 part-mozi 5 Mitsarinho t 4 tmdb983464 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}