{"link": "https://www.themoviedb.org/tv/76829?language=en", "title": "D'Artagnan and Three Musketeers", "resume": "The musketeers battle against the all-powerful Cardinal Richelieu and the treacherous Milady.", "rate": 78, "genre": ["Action", "Adventure"], "cast": ["Mikhail Boyarskiy", "Venyamin Smekhov", "Igor Starygin", "Valentin Smirnitskiy", "Irina Alfyorova"], "character": ["Dartanyan", "Athos", "Aramis", "Porthos", "Costance Bonacieux"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76829   Expand D'Artagnan and Three Musketeers   (1979) User Score Overview The musketeers battle against the all-powerful Cardinal Richelieu and the treacherous Milady. Featured Crew Georgi Yungvald-Khilkevich Creator Alexandre Dumas Creator Mark Rozovsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  11 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mikhail Boyarskiy Dartanyan Venyamin Smekhov Athos Igor Starygin Aramis Valentin Smirnitskiy Porthos Irina Alfyorova Costance Bonacieux Full Cast & Crew Last Season Miniseries 1979 | 3 Episodes Season 1 of D'Artagnan and Three Musketeers premiered on December 25, 1979. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for D'Artagnan and Three Musketeers. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  11 Posters  2 Recommendations   1973-08-11 Seventeen Moments of Spring 7.5    1969-01-01 Nu, pogodi! 6.8    1976-06-04 Twelve Chairs 7.5  Facts Original Name  Д’Артаньян и три мушкетёра Status  Ended Network Certification  - Type  Miniseries Original Language  Russian Runtime  250m Homepage  - Genres Action & Adventure Keywords based on novel or book adventure musical history swashbuckler foreign language adaptation 17th century Content Score 93 Almost there... Top Contributors z 80 zoroman1975 15 Banana TB 7 TMDb Bot n 5 navarro2018  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}