{"link": "https://www.themoviedb.org/tv/3312?language=en", "title": "Huckleberry Finn and His Friends", "resume": "Huckleberry Finn and His Friends was a 1979 television series documenting the exploits of Huckleberry Finn and Tom Sawyer, based on the novels The Adventures of Tom Sawyer and Adventures of Huckleberry Finn by American writer Mark Twain. The series was made up of 26 episodes and was a Canadian/German coproduction.\nHuckleberry Finn is played by Ian Tracey who is also the narrator. Tom Sawyer is played by Sammy Snyders.\nDirected by Jack B. Hively and Ken Jubenvill, this mini-series was broadcast in many countries such as Germany, UK, Australia, Canada, South Africa, Venezuela and many other Latin American nations. The series was re-shown many times during the 1980s to early 1990s and has grown somewhat of a cult following.\nEven though Mark Twain originally wrote the books The Adventures of Tom Sawyer and The Adventures of Huckleberry Finn as separate units, this mini-series conjures up both literary works as only one story. Therefore, it places greater importance on Huckleberry's character without putting aside Tom Sawyer's.\nIn 2007, the complete series was released as a 4 DVD box set by Fabulous Films in the UK. It contains many extras including a 12 page color booklet and a 30 minute 'making of' documentary featuring interviews with many stars of the series including Sammy Snyders, Ian Tracey, and Blu Mankuma.", "rate": 70, "genre": ["Action", "Adventure"], "cast": ["Ian Tracey", "Sammy Snyders", "Brigitte Horney", "Bernie Coulson", "Blu Mankuma"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3312   Expand Huckleberry Finn and His Friends   (1980) User Score Overview Huckleberry Finn and His Friends was a 1979 television series documenting the exploits of Huckleberry Finn and Tom Sawyer, based on the novels The Adventures of Tom Sawyer and Adventures of Huckleberry Finn by American writer Mark Twain. The series was made up of 26 episodes and was a Canadian/German coproduction. Huckleberry Finn is played by Ian Tracey who is also the narrator. Tom Sawyer is played by Sammy Snyders. Directed by Jack B. Hively and Ken Jubenvill, this mini-series was broadcast in many countries such as Germany, UK, Australia, Canada, South Africa, Venezuela and many other Latin American nations. The series was re-shown many times during the 1980s to early 1990s and has grown somewhat of a cult following. Even though Mark Twain originally wrote the books The Adventures of Tom Sawyer and The Adventures of Huckleberry Finn as separate units, this mini-series conjures up both literary works as only one story. Therefore, it places greater importance on Huckleberry's character without putting aside Tom Sawyer's. In 2007, the complete series was released as a 4 DVD box set by Fabulous Films in the UK. It contains many extras including a 12 page color booklet and a 30 minute 'making of' documentary featuring interviews with many stars of the series including Sammy Snyders, Ian Tracey, and Blu Mankuma. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Tracey Sammy Snyders Brigitte Horney Bernie Coulson Blu Mankuma Full Cast & Crew Last Season Season 1 1980 | 26 Episodes Season 1 of Huckleberry Finn and His Friends premiered on November 15, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Huckleberry Finn and His Friends. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 4 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}