{"link": "https://www.themoviedb.org/tv/72922?language=en", "title": "The Eternal Love", "resume": "Mo Lian Cheng is the 8th prince of Dongyue who is forced to marry Qu Tan Er who was already in love with Mo Yi Huai (Mo Lian Cheng's elder brother). Qu Tan Er tries to commit suicide one day because she doesn't want to marry Mo Lian Cheng but doesn't succeed. One day, she woke up and another person entered her body, two people in one body but each person has a different personality and actions. Every time one of them tells a lie, they would switch bodies. Although their outer appearance is the same, their souls aren't. Mo Lian Cheng is suspicious at why Qu Tan Er is sometimes so different but soon he falls in love with Xiao Tan, who is not lady like. Xiao Tan who is from the modern world tries all methods so she can go back but so far nothing helps. Can Xiao Tan ever go back to the modern world?", "rate": 60, "genre": ["Comedy"], "cast": ["Xing Zhao Lin", "Liang Jie", "Xin Rui Qi"], "character": ["Mo Lian Cheng", "Qu Tan Er / Xiao Tan", "Zhao Qing Yun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72922   Expand The Eternal Love   (2017) User Score Overview Mo Lian Cheng is the 8th prince of Dongyue who is forced to marry Qu Tan Er who was already in love with Mo Yi Huai (Mo Lian Cheng's elder brother). Qu Tan Er tries to commit suicide one day because she doesn't want to marry Mo Lian Cheng but doesn't succeed. One day, she woke up and another person entered her body, two people in one body but each person has a different personality and actions. Every time one of them tells a lie, they would switch bodies. Although their outer appearance is the same, their souls aren't. Mo Lian Cheng is suspicious at why Qu Tan Er is sometimes so different but soon he falls in love with Xiao Tan, who is not lady like. Xiao Tan who is from the modern world tries all methods so she can go back but so far nothing helps. Can Xiao Tan ever go back to the modern world? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Xing Zhao Lin Mo Lian Cheng Liang Jie Qu Tan Er / Xiao Tan Xin Rui Qi Zhao Qing Yun Full Cast & Crew Last Season Season 1 2017 | 25 Episodes Season 1 of The Eternal Love premiered on July 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Eternal Love. You can help by rating TV shows you've seen. Facts Original Name  双世宠妃 Status  Ended Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  35m Homepage   http://weibo.com/u/3616300095 Genres Comedy Keywords romance historical Content Score 56 We're so close, yet so far. Top Contributors 24 sansalayne 4 galactica_j l 3 lic 3 maik72  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}