{"link": "https://www.themoviedb.org/tv/62650?language=en", "title": "Chicago Med", "resume": "An emotional thrill ride through the day-to-day chaos of the city's most explosive hospital and the courageous team of doctors who hold it together. They will tackle unique new cases inspired by topical events, forging fiery relationships in the pulse-pounding pandemonium of the emergency room.", "rate": 67, "genre": ["Drama"], "cast": ["Colin Donnell", "Nick Gehlfuss", "Torrey DeVitto", "Oliver Platt", "Yaya DaCosta"], "character": ["Connor Rhodes", "Will Halstead", "Natalie Manning", "Daniel Charles", "April Sexton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62650   Expand Chicago Med   (2015) User Score  Play Trailer Overview An emotional thrill ride through the day-to-day chaos of the city's most explosive hospital and the courageous team of doctors who hold it together. They will tackle unique new cases inspired by topical events, forging fiery relationships in the pulse-pounding pandemonium of the emergency room. Featured Crew Dick Wolf Creator Matt Olmstead Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Colin Donnell Connor Rhodes Nick Gehlfuss Will Halstead Torrey DeVitto Natalie Manning Oliver Platt Daniel Charles Yaya DaCosta April Sexton Full Cast & Crew Current Season Season 3 2017 | 20 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply m alcoholics in the ER Open 3 by  madmehr S2e23 Season Ender Open 1 by  Xcalat3 No discussions yet? Man, this forum is so new. Favourite/least favourite charcter. Go! Open 7 by  Silvee Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations   2014-01-08 Chicago P.D. 6.9    2012-10-10 Chicago Fire 7.1    2017-03-01 Chicago Justice 4.8    2017-09-27 SEAL Team 6.6    2015-09-30 Code Black 7.0    2017-11-02 S.W.A.T. 6.6    2017-09-25 The Brave 6.6    2010-09-20 Hawaii Five-0 6.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/chicago-med Genres Drama Keywords chicago nurse hospital doctor spin off medical drama Content Score 100 Yes! Looking good! Top Contributors 56 Banana 32 d.a. 30 Nero Kosonen 20 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}