{"link": "https://www.themoviedb.org/tv/697?language=en", "title": "Challenge of the GoBots", "resume": "Challenge of the GoBots is an American animated series produced by Hanna-Barbera, based on the Gobots toy-line released from Tonka. The show originally debuted in animated form as a five-part miniseries, which aired in syndication from October 29 - November 2, 1984. A regular series followed the next year, premiering on September 16, 1985 as part of the new weekday/weekend morning programming block called The Funtastic World of Hanna-Barbera. The series was later rerun on the USA Cartoon Express.", "rate": 75, "genre": ["Animation"], "cast": ["B. J. Ward", "Phil Hartman", "Brock Peters", "Frank Welker", "Peter Cullen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 697   Expand Challenge of the GoBots   (1984) User Score Overview Challenge of the GoBots is an American animated series produced by Hanna-Barbera, based on the Gobots toy-line released from Tonka. The show originally debuted in animated form as a five-part miniseries, which aired in syndication from October 29 - November 2, 1984. A regular series followed the next year, premiering on September 16, 1985 as part of the new weekday/weekend morning programming block called The Funtastic World of Hanna-Barbera. The series was later rerun on the USA Cartoon Express. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast B. J. Ward Phil Hartman Brock Peters Frank Welker Peter Cullen Full Cast & Crew Last Season Season 1 1984 | 66 Episodes Season 1 of Challenge of the GoBots premiered on September  8, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Challenge of the GoBots. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors m 5 megacharlespc z 4 zurman1 2 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}