{"link": "https://www.themoviedb.org/tv/35461?language=en", "title": "So Ra No Wo To", "resume": "Sound of the Sky is a Japanese anime television series produced by A-1 Pictures and Aniplex and directed by Mamoru Kanbe. The 12-episode anime aired in Japan on the TV Tokyo television network between January 5 and March 22, 2010. Sound of the Sky is the debut project of Anime no Chikara. A manga adaptation illustrated by Yagi Shinba began serialization in the January 2010 issue of ASCII Media Works' Dengeki Daioh magazine. A visual novel developed by Compile Heart was released on the PlayStation Portable in May 2010.", "rate": 55, "genre": ["Animation", "Comedy"], "cast": ["Aya Endo", "Eri Kitamura", "Unsho Ishizuka", "Misato Fukuen", "Hisako Kanemoto"], "character": ["Filicia Heideman", "Kureha Suminoya", "Klaus", "Yumina", "Kanata Sorami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35461   Expand So Ra No Wo To   (2010) User Score Overview Sound of the Sky is a Japanese anime television series produced by A-1 Pictures and Aniplex and directed by Mamoru Kanbe. The 12-episode anime aired in Japan on the TV Tokyo television network between January 5 and March 22, 2010. Sound of the Sky is the debut project of Anime no Chikara. A manga adaptation illustrated by Yagi Shinba began serialization in the January 2010 issue of ASCII Media Works' Dengeki Daioh magazine. A visual novel developed by Compile Heart was released on the PlayStation Portable in May 2010. Featured Crew Mamoru Kambe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Endo Filicia Heideman Eri Kitamura Kureha Suminoya Unsho Ishizuka Klaus Misato Fukuen Yumina Hisako Kanemoto Kanata Sorami Full Cast & Crew Last Season Sora no oto season 1 2010 | 12 Episodes Season 1 of So Ra No Wo To premiered on January  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on So Ra No Wo To. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.sorawoto.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors B 10 Bonsai 5 qw0aszx m 3 magoozin K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}