{"link": "https://www.themoviedb.org/tv/6030?language=en", "title": "Hippies", "resume": "Swinging London, 1969. From his flat in Notting Hill Gate, Ray Purbbs edits an 'underground' (that is, counterculture) magazine, Mouth, assisted by his fellow hippies Alex, Jill and Hugo. Ray is passionate about protest, ludicrously enthusiastic about every hip trend and convinced he is (or could be) a major player in the battle between the Establishment and the alternative society. Alex - though he comes from a wealthy background and seems more interested in golf than altering society - is coolness personified, a man so laid-back he seems to exist outside of reality. Jill embraces all the new-found liberty afforded her gender and claims to espouse free love, though this attitude doesn't stretch to her 'boyfriend', Ray, long been deprived of her carnal interest. Hugo is spectacularly vague, almost brilliant in his obliqueness. Led by Ray, the quartet jump on every trendy bandwagon and comprehensively fail to make the slightest bit of difference in all they do. The gang are pretty useless at everything - in fact, they're not even that good at being hippies.", "rate": 73, "genre": ["Comedy"], "cast": ["Julian Rhind-Tutt", "Sally Phillips", "Simon Pegg", "Darren Boyd", "Geraldine McNulty"], "character": ["Jill Sprint", "Ray Purbbs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6030   Expand Hippies   (1999) User Score Overview Swinging London, 1969. From his flat in Notting Hill Gate, Ray Purbbs edits an 'underground' (that is, counterculture) magazine, Mouth, assisted by his fellow hippies Alex, Jill and Hugo. Ray is passionate about protest, ludicrously enthusiastic about every hip trend and convinced he is (or could be) a major player in the battle between the Establishment and the alternative society. Alex - though he comes from a wealthy background and seems more interested in golf than altering society - is coolness personified, a man so laid-back he seems to exist outside of reality. Jill embraces all the new-found liberty afforded her gender and claims to espouse free love, though this attitude doesn't stretch to her 'boyfriend', Ray, long been deprived of her carnal interest. Hugo is spectacularly vague, almost brilliant in his obliqueness. Led by Ray, the quartet jump on every trendy bandwagon and comprehensively fail to make the slightest bit of difference in all they do. The gang are pretty useless at everything - in fact, they're not even that good at being hippies. Featured Crew Graham Linehan Creator Arthur Mathews Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julian Rhind-Tutt Sally Phillips Jill Sprint Simon Pegg Ray Purbbs Darren Boyd Geraldine McNulty Full Cast & Crew Last Season Season 1 1999 | 6 Episodes Season 1 of Hippies premiered on November 12, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2012-08-27 Hunderby 8.0    2013-05-12 Family Tree 6.2    2000-09-19 My Family 7.2    2006-02-27 Snuff Box 8.2    1996-11-12 Never Mind the Buzzcocks 7.5    2006-10-20 Man to Man with Dean Learner 7.3    2005-06-05 Mock the Week 7.0    2004-05-18 The Mighty Boosh 7.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p00twgq2 Genres Comedy Keywords magazine miniseries counter-culture british humour Content Score 93 Almost there... Top Contributors R 6 Rebecca O 5 Ozbourne 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}