{"link": "https://www.themoviedb.org/tv/1865?language=en", "title": "Early Doors", "resume": "A sitcom set in a small pub in Manchester, “The Grapes”, where daily life is bound up in the issues of love, loneliness, and blocked urinals. Regular drinkers Joe and Duffy pass the time with landlord Ken and his police officer cronies.", "rate": 80, "genre": ["Comedy"], "cast": ["John Henshaw", "Craig Cash", "Phil Mealey", "Rita May", "Christine Bottomley"], "character": ["Ken Dixon", "Joe", "Duffy", "Jean Dixon", "Melanie Dixon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1865   Expand Early Doors   (2003) User Score Overview A sitcom set in a small pub in Manchester, “The Grapes”, where daily life is bound up in the issues of love, loneliness, and blocked urinals. Regular drinkers Joe and Duffy pass the time with landlord Ken and his police officer cronies. Featured Crew Craig Cash Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Henshaw Ken Dixon Craig Cash Joe Phil Mealey Duffy Rita May Jean Dixon Christine Bottomley Melanie Dixon Full Cast & Crew Last Season Season 2 2004 | 6 Episodes Season 2 of Early Doors premiered on September 13, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Early Doors. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/earlydoors/ Genres Comedy Keywords northern england bar pub sitcom british humour workplace comedy Content Score 93 Almost there... Top Contributors 46 Markxist 10 Banana 7 Elizabeth Jennings O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}