{"link": "https://www.themoviedb.org/tv/4601?language=en", "title": "Law & Order: Criminal Intent", "resume": "The third installment of the “Law & Order” franchise takes viewers deep into the minds of its criminals while following the intense psychological approaches the Major Case Squad uses to solve its crimes.", "rate": 74, "genre": ["Drama"], "cast": ["Kathryn Erbe", "Vincent D'Onofrio", "Jay O. Sanders", "Julia Ormond"], "character": ["Detective Alexandra Eames", "Detective Robert Goren", "Joseph Hannah", "Paula Gyson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4601   Expand Law & Order: Criminal Intent   (2001) User Score  Play Trailer Overview The third installment of the “Law & Order” franchise takes viewers deep into the minds of its criminals while following the intense psychological approaches the Major Case Squad uses to solve its crimes. Featured Crew Dick Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  16 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathryn Erbe Detective Alexandra Eames Vincent D'Onofrio Detective Robert Goren Jay O. Sanders Joseph Hannah Julia Ormond Paula Gyson Full Cast & Crew Last Season Season 10 2011 | 8 Episodes Season 10 of Law & Order: Criminal Intent premiered on May  1, 2011. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Detective Alexandra Eames: Happy Birthday Kathryn Erbe! Open 1 by  LastLion w Detective Goren: Happy Birthday Vincent D'Onofrio! Open 0 by wonder2wonder\n      \n     k The best Law & Order of them all! Open 6 by  LastLion Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  2 Recommendations   1990-09-13 Law & Order 7.2    2001-09-24 Crossing Jordan 6.8    2000-10-06 CSI: Crime Scene Investigation 6.7    2002-09-23 CSI: Miami 5.8    1993-09-21 NYPD Blue 6.5    1999-09-20 Law & Order: Special Victims Unit 6.2    1964-09-17 Bewitched 7.1    2006-03-05 Numb3rs 6.5  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://usanetwork.com/criminalintent Genres Drama Keywords new york nypd murder investigation law and order Content Score 100 Yes! Looking good! Top Contributors 111 Banana 13 waaw b 11 bugfix 10 stego77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}