{"link": "https://www.themoviedb.org/tv/1790?language=en", "title": "Family Feud", "resume": "Family Feud is an American game show in which two families compete against each other in a contest to name the most popular responses to a survey question posed to 100 people. The show was created by Mark Goodson and Bill Todman in the United States, and now airs in numerous local formats worldwide.\nSince its premiere in 1976, Family Feud has aired during 30 non-consecutive seasons. The show premiered on ABC and was hosted by Richard Dawson from 1976 until it was cancelled in 1985, by which point it had been popular on both the network and in syndication. The series was revived by CBS in 1988 with Ray Combs hosting and expanded to an hour-long format in 1992 until its cancellation in 1993. Combs also hosted the accompanying syndicated series until 1994, when he was replaced by Dawson for one season, which also expanded to an hour-long format before being cancelled in 1995. Later versions were hosted by Louie Anderson, Richard Karn, and John O'Hurley. Since the 2010–11 television season, Family Feud has been hosted by comedian/actor Steve Harvey.\nThe show's ratings were said to have improved significantly under Harvey. Family Feud's ratings were said to have improved a full 40% from the prior year back when John O'Hurley hosted. During the 2011–12 season, the fast-rising game show averaged a 4.0 and became the 5th highest rated show in all of syndication. As of the 2012–13 season, Family Feud has regularly been the second highest rated show in all of daytime television programming. In 2013, TV Guide ranked it #3 in its list of the 60 greatest game shows ever.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1790   Expand Family Feud   (1976) User Score Overview Family Feud is an American game show in which two families compete against each other in a contest to name the most popular responses to a survey question posed to 100 people. The show was created by Mark Goodson and Bill Todman in the United States, and now airs in numerous local formats worldwide. Since its premiere in 1976, Family Feud has aired during 30 non-consecutive seasons. The show premiered on ABC and was hosted by Richard Dawson from 1976 until it was cancelled in 1985, by which point it had been popular on both the network and in syndication. The series was revived by CBS in 1988 with Ray Combs hosting and expanded to an hour-long format in 1992 until its cancellation in 1993. Combs also hosted the accompanying syndicated series until 1994, when he was replaced by Dawson for one season, which also expanded to an hour-long format before being cancelled in 1995. Later versions were hosted by Louie Anderson, Richard Karn, and John O'Hurley. Since the 2010–11 television season, Family Feud has been hosted by comedian/actor Steve Harvey. The show's ratings were said to have improved significantly under Harvey. Family Feud's ratings were said to have improved a full 40% from the prior year back when John O'Hurley hosted. During the 2011–12 season, the fast-rising game show averaged a 4.0 and became the 5th highest rated show in all of syndication. As of the 2012–13 season, Family Feud has regularly been the second highest rated show in all of daytime television programming. In 2013, TV Guide ranked it #3 in its list of the 60 greatest game shows ever. Featured Crew Mark Goodson Creator Bill Todman Creator Paul Alter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1983 1983 | 7 Episodes Season 1983 of Family Feud premiered on April 15, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2001-04-16 Weakest Link 7.0    1973-07-02 Match Game 7.6    1999-08-16 Who Wants to Be a Millionaire? (US) 7.0    1983-09-19 Wheel of Fortune 7.3    1972-09-04 The Price Is Right 8.5  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m, 22m, 44m Homepage   http://www.familyfeud.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 TheOneManBoxOffice 2 remark  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}