{"link": "https://www.themoviedb.org/tv/65750?language=en", "title": "Street Outlaws: New Orleans", "resume": "This time instead of being in the 405 this show will take us to the Big Easy; New Orleans! Featuring no one else but Big Chief's number one enemy, Kye Kelly his third generation Camaro The Shocker. Big Chief claims that Kye Kelly is the one and only person he has not beat yet. Chief is so set on beating Kye Kelly that he now has a Promod called the Crowmod which his first goal is to use to beat Kye Kelly!", "rate": 55, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65750   Expand Street Outlaws: New Orleans   (2016) User Score Overview This time instead of being in the 405 this show will take us to the Big Easy; New Orleans! Featuring no one else but Big Chief's number one enemy, Kye Kelly his third generation Camaro The Shocker. Big Chief claims that Kye Kelly is the one and only person he has not beat yet. Chief is so set on beating Kye Kelly that he now has a Promod called the Crowmod which his first goal is to use to beat Kye Kelly! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Street Outlaws: New Orleans premiered on June 26, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Street Outlaws: New Orleans. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Street Outlaws: New Orleans. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Reality Original Language  English Runtime  - Homepage  - Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 8 Elizabeth Jennings m 7 megasopyan b 3 basher b 2 bowen4514@gmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}