{"link": "https://www.themoviedb.org/tv/67205?language=en", "title": "Cualca!", "resume": "Cualca (stylized as CUALCA!) Was a television series of skits Argentina initially issued as part of Duro de Domar by Channel 9 in 2012 program, but reaping success mainly in the official accounts of Vimeo and YouTube. Conceived and starring Malena Pichot, Julian Kartun, Julian Lucero, Julián Doregger and Charo López; the series is a spoof on where they try feminist messages against racism, homophobia and general social prejudices existing in Argentina where there is no set storyline. It has several recurring characters, and others that cater to the chapters, which are divided into episodes and micros. A second season was proposed via Idea.me and was released on November 6, 2014 by the Pichot YouTube channel. A spin-off titled For now was released by Cosmopolitan Television in 2013.", "rate": 0, "genre": [], "cast": ["Malena Pichot", "Julián Kartun", "Julián Lucero", "Julián Doregger", "Charo López"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67205   Expand Cualca!   (2012) User Score Overview Cualca (stylized as CUALCA!) Was a television series of skits Argentina initially issued as part of Duro de Domar by Channel 9 in 2012 program, but reaping success mainly in the official accounts of Vimeo and YouTube. Conceived and starring Malena Pichot, Julian Kartun, Julian Lucero, Julián Doregger and Charo López; the series is a spoof on where they try feminist messages against racism, homophobia and general social prejudices existing in Argentina where there is no set storyline. It has several recurring characters, and others that cater to the chapters, which are divided into episodes and micros. A second season was proposed via Idea.me and was released on November 6, 2014 by the Pichot YouTube channel. A spin-off titled For now was released by Cosmopolitan Television in 2013. Featured Crew Malena Pichot Creator Julián Kartun Creator Julián Lucero Creator Julián Doregger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Malena Pichot Julián Kartun Julián Lucero Julián Doregger Charo López Full Cast & Crew Last Season Season 2 2014 | 1 Episode Season 2 of Cualca! premiered on November  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cualca!. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 21 arielfas 2 facundox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}