{"link": "https://www.themoviedb.org/tv/64394?language=en", "title": "Outcast", "resume": "Kyle Barnes has been plagued by possession since he was a child. Now an adult, he embarks on a spiritual journey to find answers, but what he uncovers could mean the end of life on Earth as we know it.", "rate": 70, "genre": ["Drama"], "cast": ["Patrick Fugit", "Philip Glenister", "Wrenn Schmidt", "Reg E. Cathey", "Brent Spiner"], "character": ["Kyle Barnes", "Reverend Anderson", "Megan Holter", "Chief Giles", "Sidney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64394   Expand Outcast   (2016) User Score  Play Trailer Overview Kyle Barnes has been plagued by possession since he was a child. Now an adult, he embarks on a spiritual journey to find answers, but what he uncovers could mean the end of life on Earth as we know it. Featured Crew Robert Kirkman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  10 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Fugit Kyle Barnes Philip Glenister Reverend Anderson Wrenn Schmidt Megan Holter Reg E. Cathey Chief Giles Brent Spiner Sidney Full Cast & Crew Last Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply t This show makes no sense anymore (spoilers) Open 4 by  izzybee3 i liked it Open 5 by  tmdb38541732 Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  11 Recommendations   2016-09-23 The Exorcist 7.2    2016-05-22 Preacher 7.4    2015-05-14 Wayward Pines 6.5    2016-03-07 Damien 6.5    2014-07-13 The Strain 6.6    2016-03-04 Slasher 6.0    2014-06-29 The Leftovers 7.7    2013-03-18 Bates Motel 7.6  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.cinemax.com/outcast/ Genres Drama Keywords demon demonic possession Content Score 100 Yes! Looking good! Top Contributors 44 Elizabeth Jennings 23 Bendik 10 niqo19 a 9 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}