{"link": "https://www.themoviedb.org/tv/50087?language=en", "title": "Amnesia", "resume": "This story takes place in a fictional town, in a fictional country, in a fictional world. One morning, a young lady awakens to find that she has lost all her memories prior to that morning. Her life, her relationships, her very name—all gone. All that's left is a cell phone with numbers and names she doesn't recognize and Orion, a young boy that only she appears to be able to see. With Orion's guidance, she struggles to make sense of herself, a boyfriend she doesn't know and the thousand and one little things that make up a daily life. But with no memories left, the only alternative is to forge new ones, even if that means leaving old loves behind.", "rate": 56, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50087   Expand Amnesia   (2013) User Score Overview This story takes place in a fictional town, in a fictional country, in a fictional world. One morning, a young lady awakens to find that she has lost all her memories prior to that morning. Her life, her relationships, her very name—all gone. All that's left is a cell phone with numbers and names she doesn't recognize and Orion, a young boy that only she appears to be able to see. With Orion's guidance, she struggles to make sense of herself, a boyfriend she doesn't know and the thousand and one little things that make up a daily life. But with no memories left, the only alternative is to forge new ones, even if that means leaving old loves behind. Featured Crew Yoshimitsu Ohashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Amnesia premiered on January  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2014-04-04 The Kawai Complex Guide to Manors and Hostel Behavior 5.9  Facts Original Name  アムネシア Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.anime-amnesia.com/ Genres Animation Drama Sci-Fi & Fantasy Keywords amnesia romance cafe parallel world anime based on visual novel reverse harem Content Score 71 Just a little bit more... Top Contributors 21 CrewMdk 14 Panayotis f 8 franfac 7 Levi Seguel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}