{"link": "https://www.themoviedb.org/tv/67490?language=en", "title": "Despertar Contigo", "resume": "Destiny brings two youngsters together in the middle of a flower show whose love story begins as soon as they meet. Maia and Pablo come from different social classes: Maia is Othón’s daughter, one of the most important entrepreneurs in the flower growing industry, while Pablo belongs to the bodyguard squad escorting Antonia, Othón’s biggest opponent… two people holding a lot of grudge. Antonia and Othón met at a young age and they don’t miss any chance to hurt each other, so when the confusing encounter between Maia and Pablo takes place, Antonia uses that ‘holy gift’ to fool the girl by telling her Pablo is one of the most important flower-growers in the country... a lie that is not intended to hurt Maia, to whom is irrelevant whether Pablo has money or not, but Othón instead, a nouveau riche with no class who wants his daughter to marry a wealthy man and would be ov", "rate": 80, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Daniel Arenas", "Ela Velden"], "character": ["Pablo Herminio Leal", "Maia Alcalá"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67490   Expand Despertar Contigo   (2016) User Score Overview Destiny brings two youngsters together in the middle of a flower show whose love story begins as soon as they meet. Maia and Pablo come from different social classes: Maia is Othón’s daughter, one of the most important entrepreneurs in the flower growing industry, while Pablo belongs to the bodyguard squad escorting Antonia, Othón’s biggest opponent… two people holding a lot of grudge. Antonia and Othón met at a young age and they don’t miss any chance to hurt each other, so when the confusing encounter between Maia and Pablo takes place, Antonia uses that ‘holy gift’ to fool the girl by telling her Pablo is one of the most important flower-growers in the country... a lie that is not intended to hurt Maia, to whom is irrelevant whether Pablo has money or not, but Othón instead, a nouveau riche with no class who wants his daughter to marry a wealthy man and would be ov Featured Crew Pedro Damián Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel Arenas Pablo Herminio Leal Ela Velden Maia Alcalá Full Cast & Crew Last Season Season 1 2016 | 11 Episodes Season 1 of Despertar Contigo premiered on August  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Despertar Contigo. You can help by rating TV shows you've seen. Facts Status  In Production Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   www.lasestrellas.tv/telenovelas/amo-despertar-contigo/ Genres Comedy Drama Mystery Keywords stand-up comedian Content Score 50 Still needs a little work. Top Contributors 58 Alexandre Gomes a 13 agunk28 8 Elizabeth Jennings ma 1 makau ahmed  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}