{"link": "https://www.themoviedb.org/tv/68462?language=en", "title": "Golden Pouch", "resume": "When Han Suk-Hoon was little, he was adopted by a family in the United States. He returns to Korea as an adult and works as an excellent surgeon, but he falls into a bottomless pit. He succeeds as a dumpling master.", "rate": 10, "genre": ["Family"], "cast": ["Kim Ji-Han", "Ryu Hyo-Young", "Ahn Nae-sang"], "character": ["Han Suk-Hoon", "Geum Sul-Hwa", "Geum Jung-Do"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68462   Expand Golden Pouch   (2016) User Score Overview When Han Suk-Hoon was little, he was adopted by a family in the United States. He returns to Korea as an adult and works as an excellent surgeon, but he falls into a bottomless pit. He succeeds as a dumpling master. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Ji-Han Han Suk-Hoon Ryu Hyo-Young Geum Sul-Hwa Ahn Nae-sang Geum Jung-Do Full Cast & Crew Last Season Season 1 2016 | 122 Episodes Season 1 of Golden Pouch premiered on November 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Golden Pouch. You can help by rating TV shows you've seen. Facts Original Name  황금주머니 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  30m Homepage  - Genres Family Keywords korea Content Score 56 We're so close, yet so far. Top Contributors M 24 Maria180493 z 20 zurman1 4 andermairena 3 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}