{"link": "https://www.themoviedb.org/tv/62107?language=en", "title": "Critical", "resume": "The Major Trauma Centre is a state-of-the-art unit which treats only the most gravely ill or seriously injured. Whether that patient lives or dies is determined by knife-edge decisions and procedures, but can the diverse team of medical professionals knit together and rise to the challenge? Our team hold a life in their hands but in every case they face the agonisingly real fear that it could slip through their fingers.", "rate": 81, "genre": ["Drama"], "cast": ["Lennie James", "Catherine Walker", "Kimberley Nixon", "Neve McIntosh", "Prasanna Puwanarajah"], "character": ["Glen Boyle", "Fiona Lomas", "Dr Harry Bennett Edwards", "Nicola Hicklin", "Ramakrishna Chandramohan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62107   Expand Critical   (2015) User Score  Play Trailer Overview The Major Trauma Centre is a state-of-the-art unit which treats only the most gravely ill or seriously injured. Whether that patient lives or dies is determined by knife-edge decisions and procedures, but can the diverse team of medical professionals knit together and rise to the challenge? Our team hold a life in their hands but in every case they face the agonisingly real fear that it could slip through their fingers. Featured Crew Jed Mercurio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lennie James Glen Boyle Catherine Walker Fiona Lomas Kimberley Nixon Dr Harry Bennett Edwards Neve McIntosh Nicola Hicklin Prasanna Puwanarajah Ramakrishna Chandramohan Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Critical premiered on February 24, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Critical. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.sky.com/tv/show/critical Genres Drama Keywords nurse hospital doctor emergency medical drama Content Score 100 Yes! Looking good! Top Contributors 36 Nero Kosonen 16 Elizabeth Jennings TB 6 TMDb Bot z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}