{"link": "https://www.themoviedb.org/tv/63776?language=en", "title": "On the Wings of Love", "resume": "On the Wings of Love is a 2015 Philippine romantic comedy television series directed by Antoinette Jadaone and Jojo Saguin, starring James Reid and Nadine Lustre in their first primetime television series. The series premiered on ABS-CBN and worldwide on The Filipino Channel on August 10, 2015.\nThe romantic comedy centers around two different people — Leah, a simple girl with an American dream, and Clark, a boy living his American life — who are forced to marry in order to legally stay and continue working in the United States.", "rate": 70, "genre": ["Drama", "Romance", "Comedy"], "cast": ["Jason Francisco", "Thou Reyes", "James Reid", "Nadine Lustre", "Cherry Pie Picache"], "character": ["Cullen", "Denzel", "Clark Medina", "Leah Olivar", "Jacqueline \"Tita Jack\" Magtoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63776   Expand On the Wings of Love   (2015) User Score Overview On the Wings of Love is a 2015 Philippine romantic comedy television series directed by Antoinette Jadaone and Jojo Saguin, starring James Reid and Nadine Lustre in their first primetime television series. The series premiered on ABS-CBN and worldwide on The Filipino Channel on August 10, 2015. The romantic comedy centers around two different people — Leah, a simple girl with an American dream, and Clark, a boy living his American life — who are forced to marry in order to legally stay and continue working in the United States. Featured Crew ABS-CBN Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Francisco Cullen Thou Reyes Denzel James Reid Clark Medina Nadine Lustre Leah Olivar Cherry Pie Picache Jacqueline \"Tita Jack\" Magtoto Full Cast & Crew Last Season Season 1 2015 | 45 Episodes Season 1 of On the Wings of Love premiered on August 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on On the Wings of Love. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://entertainment2.abs-cbn.com/tv/shows/onthewingsoflove/main Genres Drama Romance Comedy Keywords romantic comedy romance Content Score 93 Almost there... Top Contributors n 33 nma811 R 5 Rebecca EC 5 Evil Clown 2 Charles  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}