{"link": "https://www.themoviedb.org/tv/20131?language=en", "title": "Within These Walls", "resume": "Within These Walls is a British television drama programme made by London Weekend Television for ITV and shown between 1974 and 1978. It portrayed life in HMP Stone Park, a fictional women's prison. Unlike the later women-in-prison TV series Prisoner and Bad Girls, Within These Walls tended to centre its storylines around the prison staff rather than the inmates.\nThe lead character was the well-groomed, genteel governor Faye Boswell, and episodes revolved around her attempts to liberalise the prison regime while managing her personal life at home. Another prominent character was her Chief Officer, Mrs. Armitage. Googie Withers left after three series; in Series Four her character was replaced as governor by Helen Forrester, who in turn left to be replaced in the final Series Five by Susan Marshall.\nThe creator and writer of the programme, David Butler, played the prison chaplain, the Rev Henry Prentice, in some episodes.\nAs of November 2011 Network DVD have released all five series in the UK, with the exception of \"Nowhere for the Kids\", an episode from Series Two which appears to have been wiped from the archives.", "rate": 0, "genre": ["Drama"], "cast": ["Jerome Willis", "Googie Withers", "Denys Hawthorne", "Mona Bruce"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20131   Expand Within These Walls   (1974) User Score Overview Within These Walls is a British television drama programme made by London Weekend Television for ITV and shown between 1974 and 1978. It portrayed life in HMP Stone Park, a fictional women's prison. Unlike the later women-in-prison TV series Prisoner and Bad Girls, Within These Walls tended to centre its storylines around the prison staff rather than the inmates. The lead character was the well-groomed, genteel governor Faye Boswell, and episodes revolved around her attempts to liberalise the prison regime while managing her personal life at home. Another prominent character was her Chief Officer, Mrs. Armitage. Googie Withers left after three series; in Series Four her character was replaced as governor by Helen Forrester, who in turn left to be replaced in the final Series Five by Susan Marshall. The creator and writer of the programme, David Butler, played the prison chaplain, the Rev Henry Prentice, in some episodes. As of November 2011 Network DVD have released all five series in the UK, with the exception of \"Nowhere for the Kids\", an episode from Series Two which appears to have been wiped from the archives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerome Willis Googie Withers Denys Hawthorne Mona Bruce Full Cast & Crew Last Season Season 5 1978 | 13 Episodes Season 5 of Within These Walls premiered on January 21, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Within These Walls. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.networkdvd.net/ Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 1 Markxist 1 Cavalera 1 t0by 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}