{"link": "https://www.themoviedb.org/tv/3830?language=en", "title": "Haunted", "resume": "Haunted is an American television program first aired in September 2002 on UPN. The program, which was filmed in Vancouver, was canceled in November 2002 due to low ratings. As a result, only seven of the completed episodes were aired. However, all eleven filmed episodes have subsequently been shown in international airings of the show. In August 2007, the series aired on HDNet. The series then began airing on Sci Fi in September 2007 and January 2008. In 2009, Chiller began airing this program as part of their daily marathon line-up. It plays there sporadically. A marathon of the entire series ran all day on October 31, 2010 on Universal HD.", "rate": 70, "genre": ["Action", "Adventure", "Mystery", "Drama"], "cast": ["Matthew Fox", "Lynn Collins", "John Mann", "Michael Irby", "Russell Hornsby"], "character": ["Frank Taylor", "Assistant D.A. Jessica Manning", "Simon Dunn", "Dante", "Marcus Bradshaw"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3830   Expand Haunted   (2002) User Score Overview Haunted is an American television program first aired in September 2002 on UPN. The program, which was filmed in Vancouver, was canceled in November 2002 due to low ratings. As a result, only seven of the completed episodes were aired. However, all eleven filmed episodes have subsequently been shown in international airings of the show. In August 2007, the series aired on HDNet. The series then began airing on Sci Fi in September 2007 and January 2008. In 2009, Chiller began airing this program as part of their daily marathon line-up. It plays there sporadically. A marathon of the entire series ran all day on October 31, 2010 on Universal HD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Fox Frank Taylor Lynn Collins Assistant D.A. Jessica Manning John Mann Simon Dunn Michael Irby Dante Russell Hornsby Marcus Bradshaw Full Cast & Crew Last Season Season 1 2002 | 11 Episodes Season 1 of Haunted premiered on September 24, 2002. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Haunted. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Haunted. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m Homepage  - Genres Action & Adventure Mystery Drama Keywords psychic power private investigator missing child Content Score 86 Almost there... Top Contributors 13 Banana 5 BudsieBuds 4 luftikus009 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}