{"link": "https://www.themoviedb.org/tv/68635?language=en", "title": "Cold", "resume": "After learning that her real father is in prison for killing the mother she never knew and furious at having been lied to all her life, 16-year-old Isla Wallis runs away to the remote mining town where she was born. There, she learns of a series of horrific murders of First Nation women that may be ties to her mother's death. With the help of Tina, a street-smart local, Isla starts to uncover the shocking truth behind these brutal crimes.", "rate": 0, "genre": ["Drama"], "cast": ["Annalise Basso", "Devery Jacobs", "Jim True-Frost", "David Ferry", "Tammy Isbell"], "character": ["Isla Wallis", "Tina", "Nathan", "Vernon", "Emma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68635   Expand Cold   (2016) User Score Overview After learning that her real father is in prison for killing the mother she never knew and furious at having been lied to all her life, 16-year-old Isla Wallis runs away to the remote mining town where she was born. There, she learns of a series of horrific murders of First Nation women that may be ties to her mother's death. With the help of Tina, a street-smart local, Isla starts to uncover the shocking truth behind these brutal crimes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Annalise Basso Isla Wallis Devery Jacobs Tina Jim True-Frost Nathan David Ferry Vernon Tammy Isbell Emma Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Cold premiered on October 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cold. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  8m, 12m Homepage   https://www.go90.com/a/tnP-VjxLJeA Genres Drama Keywords first nations Content Score 86 Almost there... Top Contributors 23 Elizabeth Jennings 1 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}