{"link": "https://www.themoviedb.org/tv/8819?language=en", "title": "破裏拳ポリマ", "resume": "Hurricane Polymar is a Japanese anime series produced by Tatsunoko Productions. The show was created by Tatsuo Yoshida, who had produced many of Tatsunoko's series. Other romanizations of the name include Hurricane Polymer, and Hariken Polymar.\nHurricane Polymar is the secret identity of Takeshi Yoroi. He wears a special suit which enables him to fight crime. The suit is made of memory plastic which enables him to assume any shape, including morphing its wearer in 5 different vehicles.\nOnigawara, the director of the International Secret Police Agency, looked forward to making Takeshi a top-notch criminal investigator. Takeshi was given training, which turned him into an all-around sportsman as well as martial arts expert. However, Takeshi's attitude toward crime-fighting was so incompatible with Onigawara's, that he disowned him. For a while Takeshi investigated crime alone; then he became a private detective's assistant and general handyman. Secretly, however, Takeshi obtained from a scientist a new artificial polymer, polymet, that was far stronger than steel. With this polymet Takeshi transformed himself into Hurricane Polymar, an invincible costumed hero.", "rate": 0, "genre": ["Animation"], "cast": ["Masashi Amenomori", "Kazuyuki Sogabe", "Kan Tokumaru", "Kei Tomiyama", "Takeshi Aono"], "character": ["Toragoro Onigabara", "Yoroi Takeshi", "Inspector Deret", "Next Episode Preview Narrator", "Kuruma Joe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8819   Expand 破裏拳ポリマ   (1974) User Score Overview Hurricane Polymar is a Japanese anime series produced by Tatsunoko Productions. The show was created by Tatsuo Yoshida, who had produced many of Tatsunoko's series. Other romanizations of the name include Hurricane Polymer, and Hariken Polymar. Hurricane Polymar is the secret identity of Takeshi Yoroi. He wears a special suit which enables him to fight crime. The suit is made of memory plastic which enables him to assume any shape, including morphing its wearer in 5 different vehicles. Onigawara, the director of the International Secret Police Agency, looked forward to making Takeshi a top-notch criminal investigator. Takeshi was given training, which turned him into an all-around sportsman as well as martial arts expert. However, Takeshi's attitude toward crime-fighting was so incompatible with Onigawara's, that he disowned him. For a while Takeshi investigated crime alone; then he became a private detective's assistant and general handyman. Secretly, however, Takeshi obtained from a scientist a new artificial polymer, polymet, that was far stronger than steel. With this polymet Takeshi transformed himself into Hurricane Polymar, an invincible costumed hero. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masashi Amenomori Toragoro Onigabara Kazuyuki Sogabe Yoroi Takeshi Kan Tokumaru Inspector Deret Kei Tomiyama Next Episode Preview Narrator Takeshi Aono Kuruma Joe Full Cast & Crew Last Season Season 1 1974 | 26 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 破裏拳ポリマ. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors b 9 baux 4 Wong 3 Forrest73  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}