{"link": "https://www.themoviedb.org/tv/20060?language=en", "title": "Choukou Senshi Changéríon", "resume": "Choukou Senshi Changéríon is a Tokusatsu series created by Toei Company, and co-produced by Sega Enterprises. The series aired from April 3, 1996 to December 25, 1996. It was originally planned to run for a full 52 episodes before being cut down to 39 due to low ratings.", "rate": 0, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Takashi Hagino", "Mie Hayashi", "Yuka Matsui", "Atsushi Ogawa", "Ryuuzaburou Ootomo"], "character": ["Akira Suzumura / Changéríon", "Akemi Tachibana", "Rui Kirihara", "Shogo Kuroiwa /  Black Knight Gauser", "Dark General Zander (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20060   Expand Choukou Senshi Changéríon   (1996) User Score  Play Trailer Overview Choukou Senshi Changéríon is a Tokusatsu series created by Toei Company, and co-produced by Sega Enterprises. The series aired from April 3, 1996 to December 25, 1996. It was originally planned to run for a full 52 episodes before being cut down to 39 due to low ratings. Featured Crew Sega Enterprises Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takashi Hagino Akira Suzumura / Changéríon Mie Hayashi Akemi Tachibana Yuka Matsui Rui Kirihara Atsushi Ogawa Shogo Kuroiwa /  Black Knight Gauser Ryuuzaburou Ootomo Dark General Zander (Voice) Full Cast & Crew Last Season Season 1 1996 | 39 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Choukou Senshi Changéríon. You can help by rating TV shows you've seen. Facts Original Name  超光戦士シャンゼリオン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   https://web.archive.org/web/20131003050447/http://tvarc.toei.co.jp/tv/changerion/ Genres Action & Adventure Sci-Fi & Fantasy Keywords tokusatsu sega changerion Content Score 100 Yes! Looking good! Top Contributors 46 J. TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}