{"link": "https://www.themoviedb.org/tv/60832?language=en", "title": "Nanana's Buried Treasure", "resume": "Disowned by his father, Jugo Yama has run away from home to the island of Nanae. He begins to live by himself, only to discover his room is haunted by the ghost of Nanana Ryugajo. She was murdered ten years ago, and her killer must be found before she can rest in peace. Before her death, Nanana collected things from all over the world and hid them throughout the island. Using the mysterious powers of these hidden items, they should be able to find the culprit. As Jugo begins his hunt for her collection, however, he discovers he's not the only person searching.", "rate": 80, "genre": ["Animation", "Adventure", "Romance", "Action", "Adventure"], "cast": ["Yuki Ono", "Rui Tanabe", "Kana Hanazawa", "Kazuyuki Okitsu", "Kana Asumi"], "character": ["Jūgo Yama", "Nanana Ryūgajō", "Daruku Hoshino", "Isshin Yuiga", "Tensai Ikkyū"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60832   Expand Nanana's Buried Treasure   (2014) User Score Overview Disowned by his father, Jugo Yama has run away from home to the island of Nanae. He begins to live by himself, only to discover his room is haunted by the ghost of Nanana Ryugajo. She was murdered ten years ago, and her killer must be found before she can rest in peace. Before her death, Nanana collected things from all over the world and hid them throughout the island. Using the mysterious powers of these hidden items, they should be able to find the culprit. As Jugo begins his hunt for her collection, however, he discovers he's not the only person searching. Featured Crew Kanta Kamei Creator Hideyuki Kurata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuki Ono Jūgo Yama Rui Tanabe Nanana Ryūgajō Kana Hanazawa Daruku Hoshino Kazuyuki Okitsu Isshin Yuiga Kana Asumi Tensai Ikkyū Full Cast & Crew Last Season Season 1 2014 | 11 Episodes Season 1 of Nanana's Buried Treasure premiered on April 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Nanana's Buried Treasure. You can help by rating TV shows you've seen. Facts Original Name  龍ヶ嬢七々々の埋蔵金 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.nanana.tv/ Genres Animation Adventure Romance Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 32 benf45 4 Indi G 4 Geonk 4 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}