{"link": "https://www.themoviedb.org/tv/71738?language=en", "title": "The Orville", "resume": "Follow the crew of the not-so-functional exploratory ship in the Earth's interstellar fleet, 300 years in the future.", "rate": 72, "genre": ["Drama", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Seth MacFarlane", "Adrianne Palicki", "Penny Johnson", "Scott Grimes", "Peter Macon"], "character": ["Ed Mercer", "Kelly Grayson", "Claire Finn", "Gordon Malloy", "Bortus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71738   Expand The Orville   (2017) User Score  Play Trailer Overview Follow the crew of the not-so-functional exploratory ship in the Earth's interstellar fleet, 300 years in the future. Featured Crew Seth MacFarlane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  68 Content Issues  1 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seth MacFarlane Ed Mercer Adrianne Palicki Kelly Grayson Penny Johnson Claire Finn Scott Grimes Gordon Malloy Peter Macon Bortus Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 1 2017 | 12 Episodes Season 1 of The Orville premiered on September  9, 2017. View All Seasons Social Reviews  2 Discussions  69 l A review by larz9  4.0 Written by  larz9  on September 26, 2017 More heart than humour. Nothing wrong with that, if you find that sort of thing to be entertaining. Perhaps it's because we're talking about the creator of Family Guy, American Dad and A Million Ways to Die in the West. Maybe that set my funny bone's expectations too high but the guy is indeed hilarious and I suppose that was the standard I was hoping for. In any case, this comes off more as pure homage to Star Trek with a little sprinkling of humour here and there. I gave it a chance with three episodes. I'll give it another chance with the fourth episode but if that doesn't tickle me pink,...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   2017-09-24 Star Trek: Discovery 6.8    2017-10-02 The Gifted 7.0    2017-09-29 Marvel's Inhumans 5.6    2017-10-01 Ghosted 6.2    2017-09-25 The Brave 6.6    2017-09-17 Philip K. Dick's Electric Dreams 7.2    2016-05-22 Preacher 7.4    2016-10-17 Travelers 7.5  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.fox.com/the-orville Genres Drama Comedy Sci-Fi & Fantasy Keywords future spoof space exploration Content Score 100 Yes! Looking good! Top Contributors 46 Warpath 24 Banana 20 Gabriel W. Almeida 19 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}