{"link": "https://www.themoviedb.org/tv/69818?language=en", "title": "Raid", "resume": "Raid is based on detective stories by author Harri Nykänen and made into a 12-part series.\nThe story tells about a police officer who has been investigating white-collar crimes is shot dead in a TV-studio. Another policeman takes his own life at his summer home. A young woman, an executive with a powerful electronics concern, also commits suicide. Her embittered father suspects foul play and he invites Raid, the woman's former boyfriend to \"make inquiries\".\nMeanwhile, the police are looking for the first killer - and the trail leads inexorably to Raid. Very soon, however, they realise that the guilty party is somewhere else, and the interests of the police and the avenging angel Raid converge. The unholy alliance shows that even those with morals may, to some extent, use immoral means to achieve an end.\nThe Raid series was voted the best TV-programme in Finland year 2000. Tapio Piirainen received an award for best script and best direction.\nThe series was also honoured with a prestigious film award and the Finnish Whodunnit Society's award. The music from the series sold gold and platinum.", "rate": 95, "genre": ["Drama", "Crime"], "cast": ["Kai Lehtinen", "Oiva Lohtander", "Mari Rantasila", "Kirsti Valve", "Pekka Huotari"], "character": ["Raid", "Eero Jansson", "Tarja Piirainen", "Sanna Susisaari", "Hannu 'Hopo' Huusko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69818   Expand Raid   (2000) User Score Overview Raid is based on detective stories by author Harri Nykänen and made into a 12-part series. The story tells about a police officer who has been investigating white-collar crimes is shot dead in a TV-studio. Another policeman takes his own life at his summer home. A young woman, an executive with a powerful electronics concern, also commits suicide. Her embittered father suspects foul play and he invites Raid, the woman's former boyfriend to \"make inquiries\". Meanwhile, the police are looking for the first killer - and the trail leads inexorably to Raid. Very soon, however, they realise that the guilty party is somewhere else, and the interests of the police and the avenging angel Raid converge. The unholy alliance shows that even those with morals may, to some extent, use immoral means to achieve an end. The Raid series was voted the best TV-programme in Finland year 2000. Tapio Piirainen received an award for best script and best direction. The series was also honoured with a prestigious film award and the Finnish Whodunnit Society's award. The music from the series sold gold and platinum. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kai Lehtinen Raid Oiva Lohtander Eero Jansson Mari Rantasila Tarja Piirainen Kirsti Valve Sanna Susisaari Pekka Huotari Hannu 'Hopo' Huusko Full Cast & Crew Last Season Season 1 2000 | 12 Episodes Season 1 of Raid premiered on January 10, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Raid. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Finnish Runtime  40m Homepage  - Genres Drama Crime Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 37 BryGur  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}