{"link": "https://www.themoviedb.org/tv/80199?language=en", "title": "Deep in the Realm of Conscience", "resume": "During the reign of Emperor Shang of Tang, Prince of Ping, and Princess Taiping stage a coup and execute the Empress Dowager Wei who was seize power on the court system. They support Prince of Xiang in reclaiming the throne. The palace appears to be returning to peace, but, the great waves are secretly approaching - On the court, the aunt-nephew camp of Princess Taiping and Prince of Ping begin to be divided and become like fire and water. Within the inner palace, Prince of Ping's first wife, Wong Zhen and favorite concubine Zheng Chunxi compete with their beauty and cannot get along. Fortunately, within the deceitful inner palace, there is rare integrity. The heroic and righteous imperial guards, Yam Sam-Shu and Ho Lei, and the quiet and elegant department heads, Kam Yeuk-chin, and Yuen Yuet, are four genuine people that decorate the gloomy and cold palace halls with a brush of romance and add a little mystery - Some people will give up everything for their most beloved, while others will give up their soul for power. A series of unsolved cases occur in the palace. Within the layers and layers of mystery is a long-kept secret. As it is slowly unraveled, it reveals humanity's deep thirst for power and wealth.", "rate": 60, "genre": ["Drama"], "cast": ["Nancy Wu Ting-yan", "Jacqueline Wong", "Candy Luo", "Loong Kei Lee", "Mary Hon Ma-Li"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80199   Expand Deep in the Realm of Conscience   (2018) User Score Overview During the reign of Emperor Shang of Tang, Prince of Ping, and Princess Taiping stage a coup and execute the Empress Dowager Wei who was seize power on the court system. They support Prince of Xiang in reclaiming the throne. The palace appears to be returning to peace, but, the great waves are secretly approaching - On the court, the aunt-nephew camp of Princess Taiping and Prince of Ping begin to be divided and become like fire and water. Within the inner palace, Prince of Ping's first wife, Wong Zhen and favorite concubine Zheng Chunxi compete with their beauty and cannot get along. Fortunately, within the deceitful inner palace, there is rare integrity. The heroic and righteous imperial guards, Yam Sam-Shu and Ho Lei, and the quiet and elegant department heads, Kam Yeuk-chin, and Yuen Yuet, are four genuine people that decorate the gloomy and cold palace halls with a brush of romance and add a little mystery - Some people will give up everything for their most beloved, while others will give up their soul for power. A series of unsolved cases occur in the palace. Within the layers and layers of mystery is a long-kept secret. As it is slowly unraveled, it reveals humanity's deep thirst for power and wealth. Featured Crew Junhua Fang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nancy Wu Ting-yan Jacqueline Wong Candy Luo Loong Kei Lee Mary Hon Ma-Li Full Cast & Crew Current Season Season 1 2018 | 40 Episodes Season 1 of Deep in the Realm of Conscience premiered on May 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Deep in the Realm of Conscience. You can help by rating TV shows you've seen. Facts Original Name  深宫计 Status  Ended Network Certification  - Type  Scripted Original Language  Cantonese Runtime  40m Homepage   http://programme.tvb.com/drama/deepintherealmofconsciencehongkongversion Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors v 75 vking 2 Elizabeth Jennings 1 fate6317  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}