{"link": "https://www.themoviedb.org/tv/6771?language=en", "title": "All Dogs Go To Heaven: The Series", "resume": "All Dogs Go to Heaven: The Series is an animated television series which aired from 1996 to 1998 in syndication and on the Fox Family Channel from 1998 to 1999, with 41 half-hour episodes produced in total. It aired on Cartoon Network in 1999 to 2000. It was produced by MGM Animation and was distributed by Claster Television. Don Bluth’s 1989 animated feature All Dogs Go to Heaven featured a roguish German Shepherd named Charlie who died, went to heaven, conned his way back to Earth for vengeance on his killer Carface and then found redemption through a little orphaned girl named Ann-Marie. The film was popular with audiences, spawning a sequel, All Dogs Go to Heaven 2 and this animated series.\nThe theme song for the series is \"A Little Heaven\", written by Lorraine Feather and Mark Watters. The singers were Gene Miller of Nashville, Clydene Jackson-Edwards and Carmen Twillie. Most of the voice actors from the feature films reprised their roles in the series, including Dom DeLuise, Ernest Borgnine, Charles Nelson Reilly, Bebe Neuwirth, Sheena Easton and Adam Wylie. Steven Weber provided the voice of Charlie B. Barkin, who was voiced in the films by Burt Reynolds and Charlie Sheen.", "rate": 30, "genre": ["Animation", "Kids"], "cast": ["Ernest Borgnine", "Bebe Neuwirth", "Dom DeLuise", "April Winchell", "Sheena Easton"], "character": ["Itchy Itchiford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6771   Expand All Dogs Go To Heaven: The Series   (1996) User Score Overview All Dogs Go to Heaven: The Series is an animated television series which aired from 1996 to 1998 in syndication and on the Fox Family Channel from 1998 to 1999, with 41 half-hour episodes produced in total. It aired on Cartoon Network in 1999 to 2000. It was produced by MGM Animation and was distributed by Claster Television. Don Bluth’s 1989 animated feature All Dogs Go to Heaven featured a roguish German Shepherd named Charlie who died, went to heaven, conned his way back to Earth for vengeance on his killer Carface and then found redemption through a little orphaned girl named Ann-Marie. The film was popular with audiences, spawning a sequel, All Dogs Go to Heaven 2 and this animated series. The theme song for the series is \"A Little Heaven\", written by Lorraine Feather and Mark Watters. The singers were Gene Miller of Nashville, Clydene Jackson-Edwards and Carmen Twillie. Most of the voice actors from the feature films reprised their roles in the series, including Dom DeLuise, Ernest Borgnine, Charles Nelson Reilly, Bebe Neuwirth, Sheena Easton and Adam Wylie. Steven Weber provided the voice of Charlie B. Barkin, who was voiced in the films by Burt Reynolds and Charlie Sheen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ernest Borgnine Bebe Neuwirth Dom DeLuise Itchy Itchiford April Winchell Sheena Easton Full Cast & Crew Last Season Season 3 1998 | 15 Episodes Season 3 of All Dogs Go To Heaven: The Series premiered on July 31, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on All Dogs Go To Heaven: The Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Kids Keywords san francisco based on movie cartoon dog guardian angel Content Score 71 Just a little bit more... Top Contributors 18 Ronnie Borgquist 15 TheOneManBoxOffice 13 Banana r 2 ralfw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}