{"link": "https://www.themoviedb.org/tv/1714?language=en", "title": "Common As Muck", "resume": "Common As Muck is a gritty BBC comedy drama serial focusing on the lives of a crew of bin men and their management staff. It ran for two series. The first series was screened in 1994 and the second in 1997. Both were nominated for a BAFTA for Best Drama.", "rate": 87, "genre": ["Comedy", "Drama"], "cast": ["Tim Healy", "Edward Woodward", "Neil Dudgeon", "Nimmy March", "Richard Ridings"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1714   Expand Common As Muck   (1994) User Score Overview Common As Muck is a gritty BBC comedy drama serial focusing on the lives of a crew of bin men and their management staff. It ran for two series. The first series was screened in 1994 and the second in 1997. Both were nominated for a BAFTA for Best Drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Healy Edward Woodward Neil Dudgeon Nimmy March Richard Ridings Full Cast & Crew Last Season Season 2 1997 | 6 Episodes Season 2 of Common As Muck premiered on January  8, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1981-03-12 Sorry! 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Comedy Drama Keywords friendship sex northern england boss job interview son pension college father stripper cheat on husband betrayal hospital working class council gritty cheat on wife british humour workplace comedy drunkeness affair redundancy bin men Content Score 86 Almost there... Top Contributors O 55 Ozbourne 5 kcdh 5 Markxist a 3 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}