{"link": "https://www.themoviedb.org/tv/2619?language=en", "title": "A Love To Kill", "resume": "A Love to Kill is a 2005 South Korean television drama series, starring Rain, Shin Min-a, Kim Sa-rang and Lee Ki-woo. It aired on KBS2 from October 31 to December 20, 2005 on Mondays and Tuesdays at 21:55 for 16 episodes.", "rate": 79, "genre": ["Drama"], "cast": ["Rain", "Shin Min-A", "Kim Sa-rang", "Lee Ki-Woo", "Ji Sang-ryeol"], "character": ["Kang Bok-Gu", "Cha Eun-Seok", "Han Da-Jung", "Kim Joon-Sung", "Tae Choon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2619   Expand A Love To Kill   (2005) User Score Overview A Love to Kill is a 2005 South Korean television drama series, starring Rain, Shin Min-a, Kim Sa-rang and Lee Ki-woo. It aired on KBS2 from October 31 to December 20, 2005 on Mondays and Tuesdays at 21:55 for 16 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rain Kang Bok-Gu Shin Min-A Cha Eun-Seok Kim Sa-rang Han Da-Jung Lee Ki-Woo Kim Joon-Sung Ji Sang-ryeol Tae Choon Full Cast & Crew Last Season Season 1 2005 | 16 Episodes Season 1 of A Love To Kill premiered on October 31, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A Love To Kill. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2011-03-07 Detectives in Trouble 7.8  Facts Original Name  이 죽일 놈의 사랑 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/ijuksa/ Genres Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 22 Maria180493 t 5 tmdb983464 2 sansalayne 2 handouyahia.zahra@hotmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}