{"link": "https://www.themoviedb.org/tv/12890?language=en", "title": "Worst Week", "resume": "Worst Week is an American TV series which originally aired on CBS from September 22, 2008 to June 6, 2009. The series was based on the British sitcom The Worst Week of My Life. The show was adapted for American audiences by Fox under the title Worst Week of My Life, but a series failed to materialize after the pilot was filmed.\nThe series aired on CBS Mondays at 9:30pm ET/PT, following Two and a Half Men. The premiere attracted 11 million viewers but lost a third of its lead-in audience. Ratings dropped to a low of 8.4 million viewers with the sixth episode, then began to climb steadily. They reached a high of 12.12 million viewers with the eleventh episode but declined afterwards. The season finale titled \"The Epidural\" aired on February 16, 2009. The Series is currently being shown in Ireland on RTÉ Two, Sundays at 3:40am.\nOn May 20, 2009, CBS announced its new season schedule and canceled Worst Week. A previously unaired episode entitled \"The Party\" aired on June 6, 2009. Worst Week is set in Manassas, Virginia", "rate": 70, "genre": ["Comedy"], "cast": ["Erinn Hayes", "Nancy Lenehan", "Kyle Bornheimer", "Kurtwood Smith"], "character": ["Melanie Clayton", "Angela Clayton", "Sam Briggs", "Dick Clayton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12890   Expand Worst Week   (2008) User Score Overview Worst Week is an American TV series which originally aired on CBS from September 22, 2008 to June 6, 2009. The series was based on the British sitcom The Worst Week of My Life. The show was adapted for American audiences by Fox under the title Worst Week of My Life, but a series failed to materialize after the pilot was filmed. The series aired on CBS Mondays at 9:30pm ET/PT, following Two and a Half Men. The premiere attracted 11 million viewers but lost a third of its lead-in audience. Ratings dropped to a low of 8.4 million viewers with the sixth episode, then began to climb steadily. They reached a high of 12.12 million viewers with the eleventh episode but declined afterwards. The season finale titled \"The Epidural\" aired on February 16, 2009. The Series is currently being shown in Ireland on RTÉ Two, Sundays at 3:40am. On May 20, 2009, CBS announced its new season schedule and canceled Worst Week. A previously unaired episode entitled \"The Party\" aired on June 6, 2009. Worst Week is set in Manassas, Virginia Featured Crew Matt Tarses Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Erinn Hayes Melanie Clayton Nancy Lenehan Angela Clayton Kyle Bornheimer Sam Briggs Kurtwood Smith Dick Clayton Full Cast & Crew Last Season Season 1 2008 | 16 Episodes Season 1 of Worst Week premiered on September 22, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  2 Recommendations   2007-09-26 Bionic Woman 5.5    2008-10-09 Life on Mars 6.4    2011-01-17 Being Human 5.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.cbs.com/primetime/worst_week/ Genres Comedy Keywords in-laws sitcom Content Score 100 Yes! Looking good! Top Contributors 14 Banana z 4 zurman1 w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}