{"link": "https://www.themoviedb.org/tv/64513?language=en", "title": "American Crime Story", "resume": "An anthology series centered around some of history's most famous criminals.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Annaleigh Ashford", "Darren Criss", "Penélope Cruz", "Nico Evers-Swindell", "Ricky Martin"], "character": ["Lizzie Cote", "Andrew Cunanan", "Donatella Versace", "Phil Cote", "Antonio D'Amico"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64513   Expand American Crime Story   (2016) User Score  Play Trailer Overview An anthology series centered around some of history's most famous criminals. Featured Crew Ryan Murphy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  16 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Annaleigh Ashford Lizzie Cote Darren Criss Andrew Cunanan Penélope Cruz Donatella Versace Nico Evers-Swindell Phil Cote Ricky Martin Antonio D'Amico Full Cast & Crew Current Season The Assassination of Gianni Versace 2018 | 9 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply m This was brilliant. Open 15 by  microscope Lee Miglin and Andrew Open 5 by  ScorpionQ2 Best casting choice? Open 1 by  microscope Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  7 Recommendations   2015-12-18 Making a Murderer 7.8    2014-04-15 Fargo 8.2    2015-08-28 Narcos 8.0    2014-01-12 True Detective 8.1    2013-04-04 Hannibal 7.7    2015-11-06 Master of None 8.0    2010-05-04 Luther 7.9    2015-11-20 Marvel's Jessica Jones 7.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  42m Homepage   http://www.fxnetworks.com/shows/american-crime-story Genres Crime Drama Keywords police based on a true story anthology lawyer crime criminal based on true events crime investigation criminal law Content Score 100 Yes! Looking good! Top Contributors 62 Elizabeth Jennings 55 cesar_n 20 Wong 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}