{"link": "https://www.themoviedb.org/tv/24460?language=en", "title": "Don't Tell the Bride", "resume": "Don't Tell The Bride is a British reality TV series shown on BBC Three in the United Kingdom, BBC America in the United States and The LifeStyle Channel in Australia amongst others.\nAs of 2012, six series of the show have aired, and the seventh will be filmed in 2013. In February 2012, it was announced that the show had been nominated for a Rose d'Or award for best 'Factual Entertainment' show.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24460   Expand Don't Tell the Bride   (2007) User Score  Play Trailer Overview Don't Tell The Bride is a British reality TV series shown on BBC Three in the United Kingdom, BBC America in the United States and The LifeStyle Channel in Australia amongst others. As of 2012, six series of the show have aired, and the seventh will be filmed in 2013. In February 2012, it was announced that the show had been nominated for a Rose d'Or award for best 'Factual Entertainment' show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 11 2016 | 3 Episodes Season 11 of Don't Tell the Bride premiered on July 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Don't Tell the Bride. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00d7mtr Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors z 5 zurman1 4 david8s95 2 area 301 CG 2 Cheryl G. Gaines  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}