{"link": "https://www.themoviedb.org/tv/9285?language=en", "title": "Civilisation", "resume": "Sir Kenneth Clarke guides us through the ages exploring the glorious rise of civilisation in western man. Beginning with the bleakness of the dark ages to the present day, we consider civilisation's articulations and expressions in some of man's finest works of art.", "rate": 81, "genre": ["Documentary"], "cast": ["Kenneth Clark"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9285   Expand Civilisation   (1969) User Score  Play Trailer Overview Sir Kenneth Clarke guides us through the ages exploring the glorious rise of civilisation in western man. Beginning with the bleakness of the dark ages to the present day, we consider civilisation's articulations and expressions in some of man's finest works of art. Featured Crew Kenneth Clark Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenneth Clark Himself - Host Full Cast & Crew Last Season Season 1 1969 | 13 Episodes Season 1 of Civilisation premiered on February 22, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Civilisation. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Documentary Keywords history cultural Content Score 71 Just a little bit more... Top Contributors 29 Aty 11 Elizabeth Jennings О 8 Олег TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}