{"link": "https://www.themoviedb.org/tv/43055?language=en", "title": "Suite PreCure", "resume": "Suite PreCure♪, or Suite Pretty Cure♪, is a Japanese anime series and the eighth Pretty Cure installment by Izumi Todo. Produced by Toei Animation, the series is directed by Munehisa Sakai, who directed the One Piece anime series and character designs by Akira Takahashi, who previously worked on Kaidan Restaurant. The series aired on TV Asahi's ANN network from February 6, 2011 to January 29, 2012, replacing HeartCatch PreCure! in its initial timeslot, and was succeeded by Smile PreCure! A manga adaptation is also being serialised in Kodansha's monthly Nakayoshi magazine.\nThe series theme is music, which are prominent to the names of the Cures and the magical devices they use.", "rate": 0, "genre": ["Animation"], "cast": ["Ami Koshimizu", "Fumiko Orikasa", "Kotono Mitsuishi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43055   Expand Suite PreCure   (2011) User Score Overview Suite PreCure♪, or Suite Pretty Cure♪, is a Japanese anime series and the eighth Pretty Cure installment by Izumi Todo. Produced by Toei Animation, the series is directed by Munehisa Sakai, who directed the One Piece anime series and character designs by Akira Takahashi, who previously worked on Kaidan Restaurant. The series aired on TV Asahi's ANN network from February 6, 2011 to January 29, 2012, replacing HeartCatch PreCure! in its initial timeslot, and was succeeded by Smile PreCure! A manga adaptation is also being serialised in Kodansha's monthly Nakayoshi magazine. The series theme is music, which are prominent to the names of the Cures and the magical devices they use. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ami Koshimizu Fumiko Orikasa Kotono Mitsuishi Full Cast & Crew Last Season Season 1 2011 | 48 Episodes Season 1 of Suite PreCure premiered on February  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Suite PreCure. You can help by rating TV shows you've seen. Facts Original Name  スイートプリキュア♪ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.toei-anim.co.jp/tv/suite_precure/ Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 12 Banana m 3 magoozin n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}