{"link": "https://www.themoviedb.org/tv/77623?language=en", "title": "Old Boy", "resume": "Old Boy revolves around Wu Zheng, a pilot with a high-flying job and enviable good looks. He is more than capable of taking responsibility for the lives of countless passengers but outside of work, he is tameless and free spirited and basically a child at heart. His son named Xiao Han turns up out of the blue followed by teacher Lin Xiao Ou who’s more than eager to help out. Needless to say,their arrival shakes up the life of a jet setter especially since Pilot and Teacher had met once before, when they were abroad, and it wasn’t pretty", "rate": 80, "genre": ["Drama"], "cast": ["Liu Ye", "Ariel Lin", "Guo Shutong", "Lei Jiayin", "Hu Xian Xu"], "character": ["Wu Zheng", "Lin Xiao Ou", "Ye Zi", "Shi Fei", "Xiao Han"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77623   Expand Old Boy   (2018) User Score Overview Old Boy revolves around Wu Zheng, a pilot with a high-flying job and enviable good looks. He is more than capable of taking responsibility for the lives of countless passengers but outside of work, he is tameless and free spirited and basically a child at heart. His son named Xiao Han turns up out of the blue followed by teacher Lin Xiao Ou who’s more than eager to help out. Needless to say,their arrival shakes up the life of a jet setter especially since Pilot and Teacher had met once before, when they were abroad, and it wasn’t pretty Featured Crew 刘俊杰 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Ye Wu Zheng Ariel Lin Lin Xiao Ou Guo Shutong Ye Zi Lei Jiayin Shi Fei Hu Xian Xu Xiao Han Full Cast & Crew Current Season Season 1 2018 | 47 Episodes Season 1 of Old Boy premiered on March  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Old Boy. You can help by rating TV shows you've seen. Facts Original Name  老男孩 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords romance Content Score 93 Almost there... Top Contributors M 26 Maria180493 m 9 magicyangx TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}