{"link": "https://www.themoviedb.org/tv/62547?language=en", "title": "The Disappearance", "resume": "A family falling apart over a missing girl. This intimate drama traces the increasing trauma of the Morel family when their 17 year old daughter, Leah, fails to return home from a night out. The Disappearance explores every parent's worst nightmare: their child going missing, their fate unknown.", "rate": 90, "genre": ["Crime", "Mystery"], "cast": ["Pierre-François Martin-Laval", "Alix Poisson", "François-Xavier Demaison", "Alice Pol", "Camille Razat"], "character": ["Julien Morel", "Florence Morel", "Bertrand Molina", "Camille Guérin", "Léa Morel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62547   Expand The Disappearance   (2015) User Score  Play Trailer Overview A family falling apart over a missing girl. This intimate drama traces the increasing trauma of the Morel family when their 17 year old daughter, Leah, fails to return home from a night out. The Disappearance explores every parent's worst nightmare: their child going missing, their fate unknown. Featured Crew Charlotte Brändström Creator Marie Deshaires Creator Catherine Touzet Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierre-François Martin-Laval Julien Morel Alix Poisson Florence Morel François-Xavier Demaison Bertrand Molina Alice Pol Camille Guérin Camille Razat Léa Morel Full Cast & Crew Last Season Miniseries 2015 | 8 Episodes Season 1 of The Disappearance premiered on April 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Disappearance. You can help by rating TV shows you've seen. Facts Original Name  Disparue Status  Ended Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Miniseries Original Language  French Runtime  55m Homepage  - Genres Crime Mystery Keywords miniseries Content Score 100 Yes! Looking good! Top Contributors R 20 RoNain TB 16 TMDb Bot А 10 Алексей 7 WLEXT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}