{"link": "https://www.themoviedb.org/tv/12786?language=en", "title": "Murdoch Mysteries", "resume": "A Victorian-era Toronto detective uses then-cutting edge forensic techniques to solve crimes, with the assistance of a female coroner who is also struggling for recognition in the face of tradition, based on the books by Maureen Jennings.", "rate": 69, "genre": ["Drama", "Mystery"], "cast": ["Yannick Bisson", "Helene Joy", "Jonny Harris", "Lachlan Murdoch", "Thomas Craig"], "character": ["Detective William Murdoch", "Dr. Julia Ogden", "Constable George Crabtree", "Constable Henry Higgins", "Inspector Thomas Charles Brackenreid"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12786   Expand Murdoch Mysteries   (2008) User Score  Play Trailer Overview A Victorian-era Toronto detective uses then-cutting edge forensic techniques to solve crimes, with the assistance of a female coroner who is also struggling for recognition in the face of tradition, based on the books by Maureen Jennings. Featured Crew Maureen Jennings Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  12 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yannick Bisson Detective William Murdoch Helene Joy Dr. Julia Ogden Jonny Harris Constable George Crabtree Lachlan Murdoch Constable Henry Higgins Thomas Craig Inspector Thomas Charles Brackenreid Full Cast & Crew Last Season Season 11 2017 | 18 Episodes Season 11 of Murdoch Mysteries premiered on September 25, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Renewed for Season 11  :D Open 2 by  Patrick E. Abe Detective William Murdoch of the Toronto Constabulary Open 6 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  5 Recommendations   1969-09-11 Room 222 5.8    1955-10-03 Captain Kangaroo 6.4    1952-10-01 This Is Your Life 7.7    2015-06-18 Complications 6.5    1957-09-22 Maverick 8.3    1960-10-07 Route 66 7.3    2012-02-24 Miss Fisher's Murder Mysteries 7.3    2007-03-15 Raines 7.3  Facts Status  Returning Series Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbc.ca/murdochmysteries/ Genres Drama Mystery Keywords canada based on novel or book toronto victorian england period drama police detective 19th century police procedural Content Score 100 Yes! Looking good! Top Contributors 72 Elizabeth Jennings 48 theholmboy M 26 Manu b 14 baluator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}