{"link": "https://www.themoviedb.org/tv/12453?language=en", "title": "Desmond's", "resume": "Desmond's was a British television situation comedy broadcast by Channel 4 from 1989 to 1994. With 71 episodes, Desmond's became Channel 4's longest-running sitcom. The first series was shot in 1988, with the first episode broadcast in January 1989. The show was made in and set in Peckham, London, England and featured a predominantly Black British Guyanese cast.\nConceived and co-written by Trix Worrell, and produced by Charlie Hanson and Humphrey Barclay, this series starred Norman Beaton as barber Desmond Ambrose. Desmond's shop was a gathering place for an assortment of local characters.", "rate": 65, "genre": ["Comedy"], "cast": ["Carmen Munroe", "Norman Beaton", "Dominic Keating", "Kim Walker", "Robbie Gee"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12453   Expand Desmond's   (1989) User Score Overview Desmond's was a British television situation comedy broadcast by Channel 4 from 1989 to 1994. With 71 episodes, Desmond's became Channel 4's longest-running sitcom. The first series was shot in 1988, with the first episode broadcast in January 1989. The show was made in and set in Peckham, London, England and featured a predominantly Black British Guyanese cast. Conceived and co-written by Trix Worrell, and produced by Charlie Hanson and Humphrey Barclay, this series starred Norman Beaton as barber Desmond Ambrose. Desmond's shop was a gathering place for an assortment of local characters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carmen Munroe Norman Beaton Dominic Keating Kim Walker Robbie Gee Full Cast & Crew Last Season Season 6 1994 | 13 Episodes Season 6 of Desmond's premiered on September 26, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1994-09-27 The Fast Show 7.6  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords london england business working class family british comedy black family barber shop sitcom british humour workplace comedy black sitcom Content Score 71 Just a little bit more... Top Contributors 9 Banana O 8 Ozbourne a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}