{"link": "https://www.themoviedb.org/tv/42389?language=en", "title": "Vampire Prosecutor", "resume": "Min Tae Yeon (Yun Jung Hoon) isn't your typical vampire or your typical prosecutor. Rather than drinking blood from innocent strangers, he opts for blood sold on the black market in the posh bars of Seoul. He also has the uncanny ability to tell where the victim of his cases died, and how they died based on their blood's smell and taste. The only person who knows of his secret ability is Detective Hwang Soon Bum (Lee Won Jong). They end up working together in a new joint department between police and prosecutors solving murder cases. They are joined by rookie prosecutor Yoo Jung In (Lee Young Ah), and intern Cho Dong Man. Together, they solve murder cases, and Tae Yeon must use his \"powers\" to find leads on seemingly unsolvable cases. The one mystery he can't solve is: who was the vampire/serial killer that changed him seven years ago?", "rate": 80, "genre": ["Crime", "Fantasy", "Mystery", "Thriller"], "cast": ["Yeon Jung-hoon", "Lee Young-ah", "Kim Ji-young", "Lee Won-Jong", "Lee Kyung-young"], "character": ["Min Tae-yeon", "Yoo Jung-in", "Lee Ji-ae", "Hwang Soon-bom", "Jo Jung-hyun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42389   Expand Vampire Prosecutor   (2011) User Score Overview Min Tae Yeon (Yun Jung Hoon) isn't your typical vampire or your typical prosecutor. Rather than drinking blood from innocent strangers, he opts for blood sold on the black market in the posh bars of Seoul. He also has the uncanny ability to tell where the victim of his cases died, and how they died based on their blood's smell and taste. The only person who knows of his secret ability is Detective Hwang Soon Bum (Lee Won Jong). They end up working together in a new joint department between police and prosecutors solving murder cases. They are joined by rookie prosecutor Yoo Jung In (Lee Young Ah), and intern Cho Dong Man. Together, they solve murder cases, and Tae Yeon must use his \"powers\" to find leads on seemingly unsolvable cases. The one mystery he can't solve is: who was the vampire/serial killer that changed him seven years ago? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeon Jung-hoon Min Tae-yeon Lee Young-ah Yoo Jung-in Kim Ji-young Lee Ji-ae Lee Won-Jong Hwang Soon-bom Lee Kyung-young Jo Jung-hyun Full Cast & Crew Last Season Season 2 2012 | 11 Episodes Season 2 of Vampire Prosecutor premiered on September  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2013-06-05 I Hear Your Voice 8.2  Facts Original Name  뱀파이어 검사 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/ocn/vampire2/ Genres Crime Fantasy Mystery Thriller Keywords vampire korea Content Score 86 Almost there... Top Contributors M 41 Maria180493 t 5 tmdb38202327 z 5 zurman1 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}