{"link": "https://www.themoviedb.org/tv/42999?language=en", "title": "Angel Heart", "resume": "A young Taiwanese assassin codenamed \"Glass Heart\" committed suicide by jumping off a building, and her heart was pierced by metal fence. Miraculously, her life was saved by heart transplantation. During her recovery she began to experience strange dreams, which lead her to Japan looking for the donor of her heart, who happens to be Kaori Makimura, former partner of City Hunter Ryo Saeba.\nThe author mentioned in the first tankoubon volume that Angel Heart only shares the same characters of City Hunter but not its continuation. The events are all parallel universe, therefore it has nothing to do with City Hunter.", "rate": 80, "genre": ["Animation", "Drama"], "cast": ["Yôko Asagami", "Kazue Ikura", "Akira Kamiya", "Chihiro Suzuki"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42999   Expand Angel Heart   (2005) User Score Overview A young Taiwanese assassin codenamed \"Glass Heart\" committed suicide by jumping off a building, and her heart was pierced by metal fence. Miraculously, her life was saved by heart transplantation. During her recovery she began to experience strange dreams, which lead her to Japan looking for the donor of her heart, who happens to be Kaori Makimura, former partner of City Hunter Ryo Saeba. The author mentioned in the first tankoubon volume that Angel Heart only shares the same characters of City Hunter but not its continuation. The events are all parallel universe, therefore it has nothing to do with City Hunter. Featured Crew Coamix, Shinchōsha Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yôko Asagami Kazue Ikura Akira Kamiya Chihiro Suzuki Full Cast & Crew Last Season Season 1 2005 | 50 Episodes Season 1 of Angel Heart premiered on October  3, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Angel Heart. You can help by rating TV shows you've seen. Facts Original Name  エンジェル・ハート Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Drama Keywords anime Content Score 93 Almost there... Top Contributors M 10 Migi J 4 JohnyB0y 4 Elizabeth Jennings 3 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}