{"link": "https://www.themoviedb.org/tv/332?language=en", "title": "Los simuladores", "resume": "Los Simuladores is an Argentine television series about a small team of con artists for hire, who use their skills to solve common people's life problems. The show ran for two seasons, from 2002 to 2003. It was very popular and highly acclaimed, winning a Golden Martín Fierro Award. A number of remakes have been produced for various markets worldwide. There are also plans to release a film based on the series.\nThe original series was produced and aired by the Argentine network Telefé, and ran for two 13-episode seasons in 2002 and 2003. The series is occasionally shown in reruns on Telefé. Remakes were soon produced in Chile and in Spain, using some of the same actors and production members. Another remake was made in Russia. Since 2008, Sony Pictures Television International has produced a remake for Mexican television network Televisa; as of late 2010, early production is starting on a third season, in which Salma Hayek is scheduled to appear.", "rate": 78, "genre": ["Drama", "Comedy"], "cast": ["Diego Peretti", "Federico D'Elía", "Martín Seefeld", "Alejandro Fiore"], "character": ["Emilio Ravenna", "Mario Santos", "Gabriel Medina", "Pablo Lampone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 332   Expand Los simuladores   (2002) User Score Overview Los Simuladores is an Argentine television series about a small team of con artists for hire, who use their skills to solve common people's life problems. The show ran for two seasons, from 2002 to 2003. It was very popular and highly acclaimed, winning a Golden Martín Fierro Award. A number of remakes have been produced for various markets worldwide. There are also plans to release a film based on the series. The original series was produced and aired by the Argentine network Telefé, and ran for two 13-episode seasons in 2002 and 2003. The series is occasionally shown in reruns on Telefé. Remakes were soon produced in Chile and in Spain, using some of the same actors and production members. Another remake was made in Russia. Since 2008, Sony Pictures Television International has produced a remake for Mexican television network Televisa; as of late 2010, early production is starting on a third season, in which Salma Hayek is scheduled to appear. Featured Crew Damián Szifrón Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diego Peretti Emilio Ravenna Federico D'Elía Mario Santos Martín Seefeld Gabriel Medina Alejandro Fiore Pablo Lampone Full Cast & Crew Last Season Season 2 2003 | 11 Episodes Season 2 of Los simuladores premiered on May 26, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-01-15 Utopia 8.0    1987-09-10 Teenage Mutant Ninja Turtles 7.3    2009-01-21 Lie to Me 7.4    2014-01-12 True Detective 8.1    2004-10-18 Battlestar Galactica 8.1    2011-12-04 Black Mirror 8.2    2015-08-23 Fear the Walking Dead 6.4    2016-10-02 Westworld 8.1  Facts Status  Ended Network Telefe Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 ImABlackstar z 5 zurman1 3 felectronika t 2 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}