{"link": "https://www.themoviedb.org/tv/2265?language=en", "title": "I'm Sorry, I Love You", "resume": "Cha Moo Hyuk is a man who was adopted by an Australian family but treated cruelly and then abandoned at a young age. By chance, he meets Song Eun Chae, a fashion coordinator dedicated to her employer, singer Choi Yune. Their meeting will have implications for the rest of Cha Moo Hyuk's life as a devastating turn of events leads him to delve into his past, and ultimately find happiness.", "rate": 90, "genre": ["Drama"], "cast": ["Im Soo-jung", "So Ji-sub", "Jung Kyung-ho", "Choi Yeo-jin", "Seo Ji-young"], "character": ["Song Eun-Chae", "Cha Moo-Hyuk", "Choi Yune", "Moon Ji-Young", "Kang Min-Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2265   Expand I'm Sorry, I Love You   (2004) User Score Overview Cha Moo Hyuk is a man who was adopted by an Australian family but treated cruelly and then abandoned at a young age. By chance, he meets Song Eun Chae, a fashion coordinator dedicated to her employer, singer Choi Yune. Their meeting will have implications for the rest of Cha Moo Hyuk's life as a devastating turn of events leads him to delve into his past, and ultimately find happiness. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Im Soo-jung Song Eun-Chae So Ji-sub Cha Moo-Hyuk Jung Kyung-ho Choi Yune Choi Yeo-jin Moon Ji-Young Seo Ji-young Kang Min-Joo Full Cast & Crew Last Season Season 1 2004 | 16 Episodes Season 1 of I'm Sorry, I Love You premiered on November  9, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I'm Sorry, I Love You. You can help by rating TV shows you've seen. Facts Original Name  미안하다, 사랑한다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/misa/index.html/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 19 Maria180493 B 19 Beatriz LS 3 Lee Seung-Su t 1 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}