{"link": "https://www.themoviedb.org/tv/67136?language=en", "title": "This Is Us", "resume": "Follows the lives and families of three adults living and growing up in the United States of America in present and past times. As their paths cross and their life stories intertwine in curious ways, we find that several of them share the same birthday - and so much more than anyone would expect.", "rate": 81, "genre": ["Comedy", "Drama"], "cast": ["Milo Ventimiglia", "Mandy Moore", "Sterling K. Brown", "Chrissy Metz", "Justin Hartley"], "character": ["Jack Pearson", "Rebecca Pearson", "Randall Pearson", "Kate Pearson", "Kevin Pearson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67136   Expand This Is Us   (2016) User Score  Play Trailer Overview Follows the lives and families of three adults living and growing up in the United States of America in present and past times. As their paths cross and their life stories intertwine in curious ways, we find that several of them share the same birthday - and so much more than anyone would expect. Featured Crew Dan Fogelman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  49 Content Issues  1 Images Backdrops  11 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Milo Ventimiglia Jack Pearson Mandy Moore Rebecca Pearson Sterling K. Brown Randall Pearson Chrissy Metz Kate Pearson Justin Hartley Kevin Pearson Full Cast & Crew Last Season Season 2 2017 | 18 Episodes View All Seasons Social Reviews  1 Discussions  50 c A review by chris  7.0 Written by  chris  on August 28, 2017 I might be a man but I cry watching this show its just that close to real life if your looking for a real story and loveable characters to go along with it this is the show for you I have never not laughed or cried during any episode I have seen and I have developed a crush on Kate 'yea I said it I like the big girl lol' but everyone even the kids are charming and I believe even tweens can relate to the tween characters so its good for an older family too 'some sexual content and swearing some times' but aside from that its fantastic I say watch this one Read All Reviews Media Most Popular Videos  1 Backdrops  11 Posters  8 Recommendations   2017-02-19 Big Little Lies 7.9    2016-09-21 Speechless 7.5    2014-09-25 How to Get Away with Murder 7.4    2016-09-19 The Good Place 7.8    2017-09-25 The Good Doctor 7.9    2014-06-29 The Leftovers 7.7    2017-10-02 The Gifted 7.0    2015-11-06 Master of None 8.0  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://nbc.com/this-is-us Genres Comedy Drama Keywords sibling relationship loss of loved one adoption family relationships alcohol abuse prescription drug abuse grieving weight loss flashback foster care Content Score 100 Yes! Looking good! Top Contributors 133 janar 70 Banana p 36 plumpro 18 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}