{"link": "https://www.themoviedb.org/tv/450?language=en", "title": "Island at War", "resume": "Island at War is a British television series that tells the story of the German Occupation of the Channel Islands. It primarily focuses on three local families: the upper class Dorrs, the middle class Mahys and the working class Jonases, and four German officers. The fictional island of St. Gregory serves as a stand-in for the real-life islands Jersey and Guernsey, and the story is compiled from the events on both islands.\nProduced by Granada Television in Manchester, Island at War had an estimated budget of £9,000,000 and was filmed on location in the Isle of Man from August 2003 to October 2003. When the series was shown in the UK, it appeared in six 70-minute episodes.", "rate": 70, "genre": ["Drama"], "cast": ["Laurence Fox", "Philip Glenister", "Saskia Reeves", "Clare Holman", "James Wilby"], "character": ["Bernhardt Tellemann", "Oberst Heinrich Baron Von Rheingarten", "Cassie Mahy", "Felicity Dorr", "Sen. James Dorr"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 450   Expand Island at War   (2004) User Score Overview Island at War is a British television series that tells the story of the German Occupation of the Channel Islands. It primarily focuses on three local families: the upper class Dorrs, the middle class Mahys and the working class Jonases, and four German officers. The fictional island of St. Gregory serves as a stand-in for the real-life islands Jersey and Guernsey, and the story is compiled from the events on both islands. Produced by Granada Television in Manchester, Island at War had an estimated budget of £9,000,000 and was filmed on location in the Isle of Man from August 2003 to October 2003. When the series was shown in the UK, it appeared in six 70-minute episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laurence Fox Bernhardt Tellemann Philip Glenister Oberst Heinrich Baron Von Rheingarten Saskia Reeves Cassie Mahy Clare Holman Felicity Dorr James Wilby Sen. James Dorr Full Cast & Crew Last Season Season 1 2004 | 6 Episodes Season 1 of Island at War premiered on July 11, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Island at War. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  70m Homepage   http://www.pbs.org/wgbh/masterpiece/islandatwar/index.html (US) Genres Drama Keywords war world war ii miniseries period drama Content Score 86 Almost there... Top Contributors 29 Banana 3 lineker H 2 HarleyRider 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}