{"link": "https://www.themoviedb.org/tv/5848?language=en", "title": "Uppdrag granskning", "resume": "Swedish investigative journalism series known for the use of concealed cameras and microphones.", "rate": 68, "genre": ["Documentary"], "cast": ["Karin Mattisson", "Janne Josefsson"], "character": ["Host", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5848   Expand Uppdrag granskning   (2001) User Score Overview Swedish investigative journalism series known for the use of concealed cameras and microphones. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karin Mattisson Host Janne Josefsson Host Full Cast & Crew Last Season Season 2017 2017 | 34 Episodes Season 17 of Uppdrag granskning premiered on January 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   The World of Science 6.0    2015-12-01 1000 Years until Christmas Eve 7.0    1999-01-18 Parlamentet 3.0    2013-11-07 Folkets främsta företrädare 5.0    2011-01-06 The Reckoning 3.7    1987-09-05 På spåret 5.0    2004-08-30 John Safran vs God 7.3    2016-04-25 After the Thrones 4.6  Facts Status  Returning Series Networks Certification  - Type  Documentary Original Language  Swedish Runtime  60m Homepage   http://www.svt.se/ug/ Genres Documentary Keywords investigation reporter Content Score 56 We're so close, yet so far. Top Contributors j 38 jnylen 27 Peter b 4 bowen4514@gmail.com TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}