{"link": "https://www.themoviedb.org/tv/31923?language=en", "title": "The Legend of the Condor Heroes", "resume": "The Legend of the Condor Heroes is a Chinese television series adapted from Louis Cha's novel of the same title. The series was produced by Chinese Entertainment Shanghai, the same company that produced Chinese Paladin, The Little Fairy and The Young Warriors. Many cast members from those projects collaborated again in this series, such as Hu Ge, Ariel Lin, Justin Yuan, and Cecilia Liu. The series was first broadcast on KMTV-1 in China in July 2008.", "rate": 0, "genre": ["Drama"], "cast": ["Ariel Lin", "Hu Ge", "Yuan Hong", "Liu Shishi"], "character": ["Huang Rong", "Guo Jing", "Yang Kang", "Mu Nian Ci"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31923   Expand The Legend of the Condor Heroes   (2008) User Score Overview The Legend of the Condor Heroes is a Chinese television series adapted from Louis Cha's novel of the same title. The series was produced by Chinese Entertainment Shanghai, the same company that produced Chinese Paladin, The Little Fairy and The Young Warriors. Many cast members from those projects collaborated again in this series, such as Hu Ge, Ariel Lin, Justin Yuan, and Cecilia Liu. The series was first broadcast on KMTV-1 in China in July 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ariel Lin Huang Rong Hu Ge Guo Jing Yuan Hong Yang Kang Liu Shishi Mu Nian Ci Full Cast & Crew Last Season Season 1 2008 | 50 Episodes Season 1 of The Legend of the Condor Heroes premiered on July 19, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Legend of the Condor Heroes. You can help by rating TV shows you've seen. Facts Original Name  射雕英雄传 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china wuxia Content Score 86 Almost there... Top Contributors M 25 Maria180493 7 thirstyhippo 6 Elizabeth Jennings S 4 Sakya0608  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}