{"link": "https://www.themoviedb.org/tv/32236?language=en", "title": "WWII in HD", "resume": "WWII in HD is a 10-part American documentary television miniseries that originally aired from November 15 to November 19, 2009 on the History Channel. The program focuses on the firsthand experiences of twelve American service members during World War II, including an Army nurse, a member of the Tuskegee Airmen, a second generation Japanese American and prisoner of war, and an Austrian Jewish immigrant. The twelve members recorded their time in both theaters and some had later interviews; found footage from the battlefield was paired with the stories of the twelve service members.\nThe episodes premiered on five consecutive days, with two episodes per day. The series is narrated by Gary Sinise and was produced by Lou Reda Productions in Easton, Pennsylvania, United States.", "rate": 76, "genre": ["Documentary"], "cast": ["LL Cool J", "Ron Livingston", "Gary Sinise", "Tim DeKay", "James Kyson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32236   Expand WWII in HD   (2009) User Score Overview WWII in HD is a 10-part American documentary television miniseries that originally aired from November 15 to November 19, 2009 on the History Channel. The program focuses on the firsthand experiences of twelve American service members during World War II, including an Army nurse, a member of the Tuskegee Airmen, a second generation Japanese American and prisoner of war, and an Austrian Jewish immigrant. The twelve members recorded their time in both theaters and some had later interviews; found footage from the battlefield was paired with the stories of the twelve service members. The episodes premiered on five consecutive days, with two episodes per day. The series is narrated by Gary Sinise and was produced by Lou Reda Productions in Easton, Pennsylvania, United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  25 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast LL Cool J Ron Livingston Gary Sinise Tim DeKay James Kyson Full Cast & Crew Last Season Season 1 2009 | 10 Episodes Season 1 of WWII in HD premiered on November 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  25 Posters  6 Recommendations   2000-12-30 Harvey Birdman, Attorney at Law 7.7    2009-03-15 Kings 7.9    2004-09-09 Joey 5.8    2008-07-13 Generation Kill 8.1    2014-03-11 From Dusk till Dawn: The Series 6.0    1997-07-12 Oz 8.1    2012-09-17 Revolution 6.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.history.com/content/wwii-in-hd Genres Documentary Keywords world war ii miniseries Content Score 86 Almost there... Top Contributors 12 Banana t 5 taxigps R 4 Rebecca TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}