{"link": "https://www.themoviedb.org/tv/77156?language=en", "title": "Re:Mind", "resume": "Eleven high school classmates awaken, restrained to a large dining room. While fearing for their lives, they question a motive to this bizarre act.", "rate": 63, "genre": ["Drama", "Mystery"], "cast": ["Qyoko Kudo", "Mirei Sasaki", "Sarina Ushio", "Mei Higashimura", "Ayaka Takamoto"], "character": ["Kyoko Saito", "Mirei Sasaki", "Sarina Ushio", "Mei Higashimura", "Ayaka Takamoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77156   Expand Re:Mind   (2017) User Score  Play Trailer Overview Eleven high school classmates awaken, restrained to a large dining room. While fearing for their lives, they question a motive to this bizarre act. Featured Crew Yusuke Ishida Creator Yûsuke Koroyasu Creator Akira Uchikata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Qyoko Kudo Kyoko Saito Mirei Sasaki Mirei Sasaki Sarina Ushio Sarina Ushio Mei Higashimura Mei Higashimura Ayaka Takamoto Ayaka Takamoto Full Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of Re:Mind premiered on October 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Re:Mind. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/remind/ Genres Drama Mystery Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors C 18 CyberScream M 11 Migi 5 clapton 5 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}