{"link": "https://www.themoviedb.org/tv/11578?language=en", "title": "Ein Herz und eine Seele", "resume": "Ein Herz und eine Seele is a German cult sitcom based on the British sitcom Till Death Us Do Part by Johnny Speight. The show premiered on January 15, 1973 and lasted for about twenty episodes, airing its last on November 4, 1974. In 1976, the show had a short-lived revival with another four episodes. Ein Herz und eine Seele was written by Wolfgang Menge.\nThe show was extremely successful during its initial run and it still proves very popular in reruns. Two episodes in particular, Silvesterpunsch and Rosenmontagszug have gained such popularity that they are now shown traditionally on German TV on New Year's Eve and Rosenmontag, respectively.", "rate": 85, "genre": ["Comedy"], "cast": ["Heinz Schubert", "Elisabeth Wiedemann", "Diether Krebs", "Hildegard Krekel"], "character": ["Alfred Tetzlaff", "Else Tetzlaff", "Michael Graf", "Rita Graf"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11578   Expand Ein Herz und eine Seele   (1973) User Score Overview Ein Herz und eine Seele is a German cult sitcom based on the British sitcom Till Death Us Do Part by Johnny Speight. The show premiered on January 15, 1973 and lasted for about twenty episodes, airing its last on November 4, 1974. In 1976, the show had a short-lived revival with another four episodes. Ein Herz und eine Seele was written by Wolfgang Menge. The show was extremely successful during its initial run and it still proves very popular in reruns. Two episodes in particular, Silvesterpunsch and Rosenmontagszug have gained such popularity that they are now shown traditionally on German TV on New Year's Eve and Rosenmontag, respectively. Featured Crew Wolfgang Menge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heinz Schubert Alfred Tetzlaff Elisabeth Wiedemann Else Tetzlaff Diether Krebs Michael Graf Hildegard Krekel Rita Graf Full Cast & Crew Last Season Season 2 1976 | 4 Episodes Season 2 of Ein Herz und eine Seele premiered on May 31, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1966-09-17 Raumpatrouille – Die phantastischen Abenteuer des Raumschiffes Orion 8.1    1971-12-05 Der Seewolf 5.6    1959-09-12 Bonanza 5.9    1971-09-17 The Persuaders! 8.0    1964-12-18 The Pink Panther Show 7.0    1964-09-24 The Munsters 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  44m Homepage  - Genres Comedy Keywords berlin ruhr family Content Score 100 Yes! Looking good! Top Contributors S 23 Samara s 5 stesme x 3 xelmox93 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}