{"link": "https://www.themoviedb.org/tv/66201?language=en", "title": "Shadow of Truth", "resume": "In 2006, the body of the girl Tair Rada was found in the bathroom stall at the school where she studied. Days later, the police arrested a suspect - Roman Zadorov, and after a week of intense interrogation he admits and restores the murder. However, even after he was convicted three times, many still believe in his innocence. The series explores the length and breadth provision and leaving no stone unturned in an attempt to complete the picture of the puzzle, exposing new and dramatic discoveries. Through a complex mosaic of interviews, photographs and cinematic touch with the extensive use of inquiry and archives, the show tries to fathom the overwhelming truth.", "rate": 86, "genre": ["Documentary"], "cast": ["Ilana Rada", "Roman Zadorov", "Shmuel Rada"], "character": ["Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66201   Expand Shadow of Truth   (2016) User Score Overview In 2006, the body of the girl Tair Rada was found in the bathroom stall at the school where she studied. Days later, the police arrested a suspect - Roman Zadorov, and after a week of intense interrogation he admits and restores the murder. However, even after he was convicted three times, many still believe in his innocence. The series explores the length and breadth provision and leaving no stone unturned in an attempt to complete the picture of the puzzle, exposing new and dramatic discoveries. Through a complex mosaic of interviews, photographs and cinematic touch with the extensive use of inquiry and archives, the show tries to fathom the overwhelming truth. Featured Crew Mika Timor Creator Ari Pines Creator Yotam Guendelman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ilana Rada Herself Roman Zadorov Himself Shmuel Rada Himself Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Shadow of Truth premiered on March 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Shadow of Truth. You can help by rating TV shows you've seen. Facts Original Name  צל של אמת Status  Ended Networks Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Miniseries Original Language  Hebrew Runtime  37m Homepage  - Genres Documentary Keywords wrong accusal investigation evidence documentary miniseries crime Content Score 64 We're so close, yet so far. Top Contributors 51 GustavoJander 16 almogmoyal TB 7 TMDb Bot Y 6 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}