{"link": "https://www.themoviedb.org/tv/69088?language=en", "title": "Marvel's Agents of S.H.I.E.L.D.: Slingshot", "resume": "Marvel’s Agents of S.H.I.E.L.D.: Slingshot is set in the world of the hit television series Marvel’s Agents of S.H.I.E.L.D. Taking place shortly before the beginning of Season 4, this digital series features the character of Elena “Yo-Yo” Rodriguez, an Inhuman with the ability to move with super-speed. As a person with powers, she must sign the recently instituted Sokovia Accords, the worldwide agreement that regulates and tracks those with super powers. However, the restrictions of the Accords are in direct conflict with a personal mission she’s desperate to fulfill, a mission that will test her abilities, her allegiances, and will include some tense encounters with our most popular S.H.I.E.L.D. team members.", "rate": 56, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Clark Gregg", "Chloe Bennet", "Ming-Na Wen", "Iain De Caestecker", "Elizabeth Henstridge"], "character": ["Phil Coulson", "Daisy Johnson / Quake", "Melinda May", "Leo Fitz", "Jemma Simmons"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69088   Expand Marvel's Agents of S.H.I.E.L.D.: Slingshot   (2016) User Score Overview Marvel’s Agents of S.H.I.E.L.D.: Slingshot is set in the world of the hit television series Marvel’s Agents of S.H.I.E.L.D. Taking place shortly before the beginning of Season 4, this digital series features the character of Elena “Yo-Yo” Rodriguez, an Inhuman with the ability to move with super-speed. As a person with powers, she must sign the recently instituted Sokovia Accords, the worldwide agreement that regulates and tracks those with super powers. However, the restrictions of the Accords are in direct conflict with a personal mission she’s desperate to fulfill, a mission that will test her abilities, her allegiances, and will include some tense encounters with our most popular S.H.I.E.L.D. team members. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clark Gregg Phil Coulson Chloe Bennet Daisy Johnson / Quake Ming-Na Wen Melinda May Iain De Caestecker Leo Fitz Elizabeth Henstridge Jemma Simmons Full Cast & Crew Last Season Season 1 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2015-01-06 Marvel's Agent Carter 7.5    2015-06-14 Humans 7.5    2015-01-15 The Man in the High Castle 7.5    2017-02-08 Legion 7.6    2013-09-24 Marvel's Agents of S.H.I.E.L.D. 6.7    2015-06-12 Dark Matter 6.3    2016-09-30 Marvel's Luke Cage 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage   http://abc.go.com/shows/marvels-agents-of-shield-slingshot Genres Sci-Fi & Fantasy Keywords marvel cinematic universe Content Score 86 Almost there... Top Contributors 24 Cor Cordium r 14 racci S 12 SerialeOnline2015 9 Halil Gokdal  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}