{"link": "https://www.themoviedb.org/tv/79434?language=en", "title": "What's Wrong With Secretary Kim", "resume": "Lee Young-Joon's family runs a large company and he works as the vice-president of the company. He is smart, rich and handsome, but he is arrogant. His secretary is Kim Mi-So. She has worked for him for years and she is perfect for him, but Kim Mi-So decides to quit her job.", "rate": 80, "genre": ["Comedy"], "cast": ["Park Seo-jun", "Park Min-young", "Lee Tae-hwan", "Pyo Ye-Jin", "Kim Hye-ok"], "character": ["Lee Young-Joon", "Kim Mi-So", "Lee Sung-Yeon", "Kim Ji-A", "Madame Choi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79434   Expand What's Wrong With Secretary Kim   (2018) User Score Overview Lee Young-Joon's family runs a large company and he works as the vice-president of the company. He is smart, rich and handsome, but he is arrogant. His secretary is Kim Mi-So. She has worked for him for years and she is perfect for him, but Kim Mi-So decides to quit her job. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Seo-jun Lee Young-Joon Park Min-young Kim Mi-So Lee Tae-hwan Lee Sung-Yeon Pyo Ye-Jin Kim Ji-A Kim Hye-ok Madame Choi Full Cast & Crew Current Season Season 1 2018 | 16 Episodes Season 1 of What's Wrong With Secretary Kim premiered on June  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on What's Wrong With Secretary Kim. You can help by rating TV shows you've seen. Facts Original Name  김비서가 왜 그럴까 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/secretarykim/ Genres Comedy Keywords romance Content Score 86 Almost there... Top Contributors M 43 Maria180493 19 Chelsea y 7 yhs4705 s 4 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}