{"link": "https://www.themoviedb.org/tv/63787?language=en", "title": "Angel Eyes", "resume": "Yoon Soo-wan and Park Dong-joo were each other's first loves, but were forced to separate due to painful family circumstances. Soo-wan, who had been blind, eventually undergoes an eye transplant surgery that restores her sight.\nTwelve years later, Soo-wan now works as an emergency rescue worker, while Dong-joo is a surgeon. They meet each other again. But Soo Wan is engaged to a Neurosurgeon, Kang Ji Woon. Knowing this, Park Dong Joo decided to keep quiet and not reveal his identity to Soo Wan and also decided to go back. Will Soo Wan realize that Doctor Dylan Park is her first love, Park Dong Joo? Will they end up together despite all the obstacles that they are going to face?", "rate": 80, "genre": ["Drama", "Family", "Romance"], "cast": ["Lee Sang-yoon", "Koo Hye-sun", "Kang Ha-neul", "Nam Ji-hyeon", "Kim Ji-seok"], "character": ["Park Dong-joo", "Yoon Soo-wan", "Park Dong-joo (young)", "Yoon Soo-wan (young)", "Kang Ji-woon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63787   Expand Angel Eyes   (2014) User Score Overview Yoon Soo-wan and Park Dong-joo were each other's first loves, but were forced to separate due to painful family circumstances. Soo-wan, who had been blind, eventually undergoes an eye transplant surgery that restores her sight. Twelve years later, Soo-wan now works as an emergency rescue worker, while Dong-joo is a surgeon. They meet each other again. But Soo Wan is engaged to a Neurosurgeon, Kang Ji Woon. Knowing this, Park Dong Joo decided to keep quiet and not reveal his identity to Soo Wan and also decided to go back. Will Soo Wan realize that Doctor Dylan Park is her first love, Park Dong Joo? Will they end up together despite all the obstacles that they are going to face? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Sang-yoon Park Dong-joo Koo Hye-sun Yoon Soo-wan Kang Ha-neul Park Dong-joo (young) Nam Ji-hyeon Yoon Soo-wan (young) Kim Ji-seok Kang Ji-woon Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Angel Eyes premiered on April  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Angel Eyes. You can help by rating TV shows you've seen. Facts Original Name  엔젤 아이즈 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/angeleyes/ Genres Drama Family Romance Keywords korea Content Score 86 Almost there... Top Contributors t 41 tmdb38202327 M 10 Maria180493 z 5 zurman1 4 Fabrício  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}