{"link": "https://www.themoviedb.org/tv/62148?language=en", "title": "Unkind Women", "resume": "This drama features the women of three generations and the people around them.\nMa Ri grows up as a good teacher of this generation where there is no true mentor. Hyun Sook, who has been a troublemaker, realizes the love and support of her family. Kang Soon Ok regards herself as unlucky, but later on realizes how happy she has been.\nHow can you hold up when your life gets tough? You will figure it out by holding up day by day, just like these women in the drama.", "rate": 78, "genre": ["Drama"], "cast": ["Kim Hye-ja", "Chae Shi-ra", "Lee Ha-Na", "Lee Soon-jae", "Chang Mi-hee"], "character": ["Kang Soon-Ok", "Kim Hyun-Sook", "Jung Ma-Ri", "Kim Chul-Hee", "Jang Mo-Ran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62148   Expand Unkind Women   (2015) User Score  Play Trailer Overview This drama features the women of three generations and the people around them. Ma Ri grows up as a good teacher of this generation where there is no true mentor. Hyun Sook, who has been a troublemaker, realizes the love and support of her family. Kang Soon Ok regards herself as unlucky, but later on realizes how happy she has been. How can you hold up when your life gets tough? You will figure it out by holding up day by day, just like these women in the drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hye-ja Kang Soon-Ok Chae Shi-ra Kim Hyun-Sook Lee Ha-Na Jung Ma-Ri Lee Soon-jae Kim Chul-Hee Chang Mi-hee Jang Mo-Ran Full Cast & Crew Last Season Season 1 2015 | 24 Episodes Season 1 of Unkind Women premiered on February 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Unkind Women. You can help by rating TV shows you've seen. Facts Original Name  착하지 않은 여자들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/badwoman/ Genres Drama Keywords korea Content Score 93 Almost there... Top Contributors 42 Elizabeth Jennings M 8 Maria180493 t 6 tmdb38202327 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}