{"link": "https://www.themoviedb.org/tv/61444?language=en", "title": "ANZAC Girls", "resume": "The unique, and rarely told true stories of Australian and New Zealand nurses serving at Gallipoli and the Western Front during the First World War.", "rate": 75, "genre": ["War", "Politics", "Drama"], "cast": ["Georgia Flood", "Antonia Prebble", "Laura Brent", "Anna McGahan", "Caroline Craig"], "character": ["Alice Ross-King", "Hilda Steele", "Elsie Cook", "Olive Haynes", "Grace Wilson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61444   Expand ANZAC Girls   (2014) User Score Overview The unique, and rarely told true stories of Australian and New Zealand nurses serving at Gallipoli and the Western Front during the First World War. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Georgia Flood Alice Ross-King Antonia Prebble Hilda Steele Laura Brent Elsie Cook Anna McGahan Olive Haynes Caroline Craig Grace Wilson Full Cast & Crew Last Season Mini-Series 2014 | 6 Episodes Season 1 of ANZAC Girls premiered on August 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ANZAC Girls. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Miniseries Original Language  English Runtime  58m, 60m Homepage   http://www.abc.net.au/tv/programs/anzac-girls/ Genres War & Politics Drama Keywords nurse world war i doctor period drama costume drama gallipoli campaign Content Score 86 Almost there... Top Contributors 51 Elizabeth Jennings 19 United600 15 Banana w 4 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}