{"link": "https://www.themoviedb.org/tv/1584?language=en", "title": "What a Cartoon!", "resume": "What a Cartoon! is an American animation showcase project created by Fred Seibert for Hanna-Barbera Cartoons to be run on Cartoon Network. The project consisted of 82 short cartoons, intended to return creative power to animators and artists, by recreating the atmospheres that spawned the great cartoon characters of the mid-20th century. Each of 71 short cartoons mirrored the structure of a theatrical cartoon, with each film being based on an original storyboard drawn and written by its artist or creator.\nThe shorts from the project first aired on February 20, 1995, and were promoted as World Premiere Toons. During the original run of the shorts the series was retitled as The What a Cartoon! Show until the final short aired August 17, 2001. The project served as the launching point for multiple successful Cartoon Network series, including Dexter's Laboratory, Johnny Bravo, Cow and Chicken, The Powerpuff Girls, Courage the Cowardly Dog, Mike, Lu & Og, Whatever Happened to... Robot Jones?, Codename: Kids Next Door and The Grim Adventures of Billy & Mandy as well as a precursor to Fox's Family Guy. The series is influential for birthing a slew of original Cartoon Network hits and helping to revive television animation in the 1990s. Once it had several original series, those became the first Cartoon Cartoons.", "rate": 85, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1584   Expand What a Cartoon!   (1995) User Score Overview What a Cartoon! is an American animation showcase project created by Fred Seibert for Hanna-Barbera Cartoons to be run on Cartoon Network. The project consisted of 82 short cartoons, intended to return creative power to animators and artists, by recreating the atmospheres that spawned the great cartoon characters of the mid-20th century. Each of 71 short cartoons mirrored the structure of a theatrical cartoon, with each film being based on an original storyboard drawn and written by its artist or creator. The shorts from the project first aired on February 20, 1995, and were promoted as World Premiere Toons. During the original run of the shorts the series was retitled as The What a Cartoon! Show until the final short aired August 17, 2001. The project served as the launching point for multiple successful Cartoon Network series, including Dexter's Laboratory, Johnny Bravo, Cow and Chicken, The Powerpuff Girls, Courage the Cowardly Dog, Mike, Lu & Og, Whatever Happened to... Robot Jones?, Codename: Kids Next Door and The Grim Adventures of Billy & Mandy as well as a precursor to Fox's Family Guy. The series is influential for birthing a slew of original Cartoon Network hits and helping to revive television animation in the 1990s. Once it had several original series, those became the first Cartoon Cartoons. Featured Crew Fred Seibert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1995 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2005-08-07 The Girls Next Door 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 15 phboba R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}