{"link": "https://www.themoviedb.org/tv/29?language=en", "title": "Mary Hartman, Mary Hartman", "resume": "Mary Hartman, Mary Hartman is an American soap opera parody that aired in daily syndication from January 1976 to May 1977. The series was produced by Norman Lear, directed by Joan Darling and Jim Drake, and starred Louise Lasser. The series writers were Gail Parent and Ann Marcus.\nThe show's title was the eponymous character's name stated twice, because Lear and the writers believed that everything that was said on a soap opera was said twice.\nIn 2004 and 2007, Mary Hartman, Mary Hartman was ranked #21 and #26 on \"TV Guide's Top Cult Shows Ever\".", "rate": 70, "genre": [], "cast": ["Debralee Scott", "Mary Kay Place", "Louise Lasser", "Victor Kilian", "Philip Bruns"], "character": ["Mary Hartman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29   Expand Mary Hartman, Mary Hartman   (1976) User Score Overview Mary Hartman, Mary Hartman is an American soap opera parody that aired in daily syndication from January 1976 to May 1977. The series was produced by Norman Lear, directed by Joan Darling and Jim Drake, and starred Louise Lasser. The series writers were Gail Parent and Ann Marcus. The show's title was the eponymous character's name stated twice, because Lear and the writers believed that everything that was said on a soap opera was said twice. In 2004 and 2007, Mary Hartman, Mary Hartman was ranked #21 and #26 on \"TV Guide's Top Cult Shows Ever\". Featured Crew Ann Marcus Creator Daniel Gregory Browne Creator Jerry Adelman Creator Gail Parent Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Debralee Scott Mary Kay Place Louise Lasser Mary Hartman Victor Kilian Philip Bruns Full Cast & Crew Last Season Season 2 1976 | 177 Episodes Season 2 of Mary Hartman, Mary Hartman premiered on July  6, 1976. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Mary: Happy Birthday Louise Lasser! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mary Hartman, Mary Hartman. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 1 tmdb64845936 T 1 Tim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}