{"link": "https://www.themoviedb.org/tv/55886?language=en", "title": "Motylki", "resume": "It's April of 1986. Pripyat, Ukraine. A core meltdown occurred at Reactor 4 of the Chernobyl Power Plant. Over thirty people died during the blast but the estimated death toll as a result of the radiation fallout will reach a four-digit number. This accident will be considered the world’s largest ecological disaster.  Set at ground zero of a catastrophe, this film will reveal the details of the Chernobyl event. The shocking news of the explosion at the nuclear plant has spread, as the world watched the tragedy in fear and confusion. Hearts went out to those who displayed selfless courage and integrity in the initial efforts to stabilize the reactor power.  But some were too busy being in love to notice what had just happened in nearby Chernobyl. The disaster has faded into the background...  This is an account of love and loss, bravery and supernatural stoicism in the face of unbeatable odds.", "rate": 69, "genre": ["Documentary", "Drama"], "cast": ["Yuriy Borisov", "Maria Poezzhaeva", "Maxím Anatóljewitsch Saussálin", "Oleh Primohenov", "Evgeniya Loza"], "character": ["... Павел", "... Аля", "... Кузичев", "... Моряк"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55886   Expand Motylki   (2013) User Score  Play Trailer Overview It's April of 1986. Pripyat, Ukraine. A core meltdown occurred at Reactor 4 of the Chernobyl Power Plant. Over thirty people died during the blast but the estimated death toll as a result of the radiation fallout will reach a four-digit number. This accident will be considered the world’s largest ecological disaster.  Set at ground zero of a catastrophe, this film will reveal the details of the Chernobyl event. The shocking news of the explosion at the nuclear plant has spread, as the world watched the tragedy in fear and confusion. Hearts went out to those who displayed selfless courage and integrity in the initial efforts to stabilize the reactor power.  But some were too busy being in love to notice what had just happened in nearby Chernobyl. The disaster has faded into the background...  This is an account of love and loss, bravery and supernatural stoicism in the face of unbeatable odds. Featured Crew  Vitaliy Vorobyov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuriy Borisov ... Павел Maria Poezzhaeva ... Аля Maxím Anatóljewitsch Saussálin ... Кузичев Oleh Primohenov ... Моряк Evgeniya Loza Full Cast & Crew Last Season Season 1 2013 | 4 Episodes Season 1 of Motylki premiered on April 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Motylki. You can help by rating TV shows you've seen. Facts Original Name  Мотыльки Status  Ended Network Certification  - Type  Miniseries Original Language  Russian Runtime  52m Homepage   http://film.ua/en/distribution/projects/241 Genres Documentary Drama Keywords miniseries Content Score 100 Yes! Looking good! Top Contributors TB 24 TMDb Bot b 13 b.sviglo R 9 Rebecca 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}