{"link": "https://www.themoviedb.org/tv/13493?language=en", "title": "Nobuta wo Produce", "resume": "Nobuta wo Produce is a Japanese television drama produced and aired in 2005 by NTV. The television show is based on the book of the same name by Gen Shiraiwa. The story follows the high school lives of Kiritani and Kusano as they attempt to make a shy Kotani into the most popular girl in school.", "rate": 73, "genre": ["Drama"], "cast": ["Kazuya Kamenashi", "Tomohisa Yamashita", "Erika Toda", "Maki Horikita", "Kanako Fukaura"], "character": ["Nobuko Kotani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13493   Expand Nobuta wo Produce   (2005) User Score Overview Nobuta wo Produce is a Japanese television drama produced and aired in 2005 by NTV. The television show is based on the book of the same name by Gen Shiraiwa. The story follows the high school lives of Kiritani and Kusano as they attempt to make a shy Kotani into the most popular girl in school. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kazuya Kamenashi Tomohisa Yamashita Erika Toda Maki Horikita Nobuko Kotani Kanako Fukaura Full Cast & Crew Last Season Season 1 2005 | 10 Episodes Season 1 of Nobuta wo Produce premiered on October 15, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2011-07-11 Full Throttle Girl 7.6    2007-04-16 Operation Love 8.8    2008-07-03 Code Blue 8.0    2006-07-08 My Boss My Hero 7.3    2016-12-02 Goblin 7.2  Facts Original Name  野ブタ。をプロデュース Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.ntv.co.jp/nobuta/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 13 Aka75 5 Wendy 5 tcx4c70 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}