{"link": "https://www.themoviedb.org/tv/46910?language=en", "title": "Catfish: The TV Show", "resume": "In each episode, with the guidance and help of Nev Schulman and Max Joseph, a hopeful romantic partner will go on an emotional journey to discover the truth about their significant other. Has that object of affection been telling the truth?", "rate": 63, "genre": ["Reality"], "cast": ["Nev Schulman", "Max Joseph"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46910   Expand Catfish: The TV Show   (2012) User Score  Play Trailer Overview In each episode, with the guidance and help of Nev Schulman and Max Joseph, a hopeful romantic partner will go on an emotional journey to discover the truth about their significant other. Has that object of affection been telling the truth? Featured Crew Max Joseph Creator Nev Schulman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  9 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nev Schulman Himself Max Joseph Himself Full Cast & Crew Current Season Season 7 2018 | 11 Episodes Season 7 of Catfish: The TV Show premiered on January  3, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply S6 Ep9: FINALLY! Open 29 by  JohnSteed S6 Ep9 - Max a Massive Hypocrite!! Open 0 by JohnSteed\n      \n     b I don't like the fake ones (tricking Nev and Max) Open 3 by  blacknyellowsquid Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  3 Recommendations   2011-01-11 Teen Mom 2 4.8    1992-05-21 The Real World 4.8    2007-09-19 Kitchen Nightmares 7.1    2009-07-19 Pawn Stars 6.5    2006-12-05 Bad Girls Club 5.3    2012-06-18 Love & Hip Hop Atlanta 4.6    2011-09-21 Fresh Meat 7.2    2011-01-26 Face Off 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://mtv.com/shows/catfish Genres Reality Keywords online dating Content Score 71 Just a little bit more... Top Contributors 26 Elizabeth Jennings 13 Banana b 12 basher 10 Rug  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}