{"link": "https://www.themoviedb.org/tv/3916?language=en", "title": "Dangerous", "resume": "Dangerous is an Australian television drama series that first screened on 16 January 2007 on FOX8 and was shown in Ireland on RTÉ One. In mid-2008, it began running on The WB's online network in the US.\nIt features a \"Romeo and Juliet\" story of forbidden love, set against the culturally diverse backgrounds of Sydney's western suburbs street crime and the affluence of Sydney’s eastern suburbs. It explores youth culture, including taboo subjects like party drug use and the underground world of drag racing and ramraiding. Dangerous is produced by John Edwards and Imogen Banks. Writers include Fiona Seres and Brendan Cowell, acclaimed for their work on Love My Way. It is directed by David Caesar and Shawn Seet. The series' theme song is \"Set The Record Straight\", performed by New Zealand hip hop group Fast Crew, although the lyrics \"Auckland City, let's go\" has been changed to \"Sydney City, let's go\" for use on the show.", "rate": 5, "genre": ["Drama"], "cast": ["Khan Chittenden", "Joel Edgerton", "Jack Finsterer", "Katie Wall", "Vico Thai"], "character": ["Dean", "Senior Sergeant Mark Field", "Nathan Walsh", "Esther", "Phu \"Riz\" Nguyen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3916   Expand Dangerous   (2007) User Score Overview Dangerous is an Australian television drama series that first screened on 16 January 2007 on FOX8 and was shown in Ireland on RTÉ One. In mid-2008, it began running on The WB's online network in the US. It features a \"Romeo and Juliet\" story of forbidden love, set against the culturally diverse backgrounds of Sydney's western suburbs street crime and the affluence of Sydney’s eastern suburbs. It explores youth culture, including taboo subjects like party drug use and the underground world of drag racing and ramraiding. Dangerous is produced by John Edwards and Imogen Banks. Writers include Fiona Seres and Brendan Cowell, acclaimed for their work on Love My Way. It is directed by David Caesar and Shawn Seet. The series' theme song is \"Set The Record Straight\", performed by New Zealand hip hop group Fast Crew, although the lyrics \"Auckland City, let's go\" has been changed to \"Sydney City, let's go\" for use on the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Khan Chittenden Dean Joel Edgerton Senior Sergeant Mark Field Jack Finsterer Nathan Walsh Katie Wall Esther Vico Thai Phu \"Riz\" Nguyen Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Dangerous premiered on January 16, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dangerous. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 8 miguemadridista  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}