{"link": "https://www.themoviedb.org/tv/49875?language=en", "title": "La Crim'", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 0, "genre": ["Crime"], "cast": ["Isabel Otero", "Dominique Guillo", "Didier Cauchy", "Jean-François Garreaud", "Alexandra London"], "character": ["Commandant Hélène Vallon", "Capitaine Alexandre Siskowski", "Commandant Jean-Louis Scandella", "Commandant Michel Lemarchand", "Capitaine Florence Bailly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49875   Expand La Crim'   (1999) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Martin Brossollet Creator Jeffrey Frohner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Isabel Otero Commandant Hélène Vallon Dominique Guillo Capitaine Alexandre Siskowski Didier Cauchy Commandant Jean-Louis Scandella Jean-François Garreaud Commandant Michel Lemarchand Alexandra London Capitaine Florence Bailly Full Cast & Crew Last Season Season 8 2006 | 6 Episodes Season 8 of La Crim' premiered on February 24, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La Crim'. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Scripted Original Language  French Runtime  52m Homepage  - Genres Crime Keywords police investigation crime Content Score 79 Pump it up! We're close now. Top Contributors E 92 Europe12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}