{"link": "https://www.themoviedb.org/tv/68163?language=en", "title": "Princess of Lan Ling King", "resume": "The legend of the Qingluan mirror and Lican sword which is said to be able reunite the country when possessed by the owner. The items once formerly owned by the Dragon Sect are now lost. Before the demise of the Dragon Sect leader, the information regarding the location of these heirlooms is handed down to the only remaining maiden-Duan Mu Ling. She is told by her master that she is not to give away the location to anyone as it could bring chaos in the wrong hands. Upon the death of her master, she goes in search of the lost mirror and sword under the guise of the high official from the Northern Zhou Court Si Kong's wife's niece. During her journey she comes across the Prince Gao Chang Gong (a.k.a Prince of Orchid Hills) and Yu Wen Yong. Her romance blooms with both and she must choose who to help and who to love. \nBased off the internet novel 'The Royal Prince of Orchid Hills' and a sequel to the highly popular 2013 drama adaptation of Lan Ling Wang.", "rate": 43, "genre": ["Drama"], "cast": ["Zhang Han Yun", "Peng Guan Ying", "chen yi", "Kris Shen", "fu ying"], "character": ["Yuan Zing Suo / Duan Mu Lian", "Yuwen Yong", "lan ling wang (pangeran lan ling)", "Yuwen Yu", "permaisuri Ashina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68163   Expand Princess of Lan Ling King   (2016) User Score Overview The legend of the Qingluan mirror and Lican sword which is said to be able reunite the country when possessed by the owner. The items once formerly owned by the Dragon Sect are now lost. Before the demise of the Dragon Sect leader, the information regarding the location of these heirlooms is handed down to the only remaining maiden-Duan Mu Ling. She is told by her master that she is not to give away the location to anyone as it could bring chaos in the wrong hands. Upon the death of her master, she goes in search of the lost mirror and sword under the guise of the high official from the Northern Zhou Court Si Kong's wife's niece. During her journey she comes across the Prince Gao Chang Gong (a.k.a Prince of Orchid Hills) and Yu Wen Yong. Her romance blooms with both and she must choose who to help and who to love.  Based off the internet novel 'The Royal Prince of Orchid Hills' and a sequel to the highly popular 2013 drama adaptation of Lan Ling Wang. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhang Han Yun Yuan Zing Suo / Duan Mu Lian Peng Guan Ying Yuwen Yong chen yi lan ling wang (pangeran lan ling) Kris Shen Yuwen Yu fu ying permaisuri Ashina Full Cast & Crew Last Season Season 1 2016 | 30 Episodes Season 1 of Princess of Lan Ling King premiered on September 29, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Princess of Lan Ling King. You can help by rating TV shows you've seen. Facts Original Name  蘭陵王妃 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Drama Keywords war china Content Score 86 Almost there... Top Contributors k 30 kayl4 22 Elizabeth Jennings M 8 Maria180493 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}