{"link": "https://www.themoviedb.org/tv/65396?language=en", "title": "Secrets at the Hotel", "resume": "The story of Secrets at the Hotel begins in 1908. Julio Olmedo and Isabel Alarcón travel on the same train to the Gran Hotel, property of the Alarcón family. Both of them ignore that their lives will take a new twist in that place, produced by love, treason, and the secrets hidden there. \nJulio Olmedo travels there looking for his twin sister, Cristina, who stopped writing him months ago. Isabel comes to attend her mother’s call, the matriarch Teresa Langre Widow of Alarcón, who has fixed her wedding with Diego Montejo and to whom she has also granted the Gran Hotel’s management.\nA series of murders take place in the town where the hotel is along with Cristina Olmedo’s vanishing, and detective Serapio Ayala arrives from the capital city to clear them up; nevertheless, during his staying, the mysteries around the place pile up and become more difficult to figure out every time. Ayala is a science lover and he relies on it to solve any case he is assigned with.\nOlmedo joins the Gran Hotel as a waiter; there, he meets Andrés Salinas, son of Ángela Gómez, the housekeeper. A good friendship grows between Julio and Andrés which turns into a brotherhood. Andrés helps Julio investigate what happened to his sister. Andrés is in love with Belén García, an unscrupulous maid who manages, by playing victim of a cheating, to make Andrés recognize the child she is expecting, product of her affair with Diego Montejo.\nSofía Alarcón is Teresa’s oldest daughter, she is married to Alfredo Vergara, the heir of a lineage family tradition. Sofía is pregnant, but she loses her baby and the obsession for having a child finally undermines her weak mental health.\nFelipe Alarcón is a young man who has always lived under the protection of his mother. She has made him a weak man in front of his feelings and desires, so now he is very far from being the heir his father always wanted him to be. \nÁngela Salinas, the housekeeper of the Gran Hotel, knows every corner of that place and every person that has been in there in the past thirty years. Her unbreakable face hides secrets she refuses to reveal, mostly, to protect her son Andrés. \nIn Secrets at the hotel, mysteries accumulate on a daily basis and the love between Isabel and Julio grows stronger day by day, so they must confront the obstacles the epoch and the society of that time put in front of them.\nSecrets at the hotel is the place where the richest families of the time come to spend their leisure time ignoring that, inside those rooms and hallways, love and dead circulate at once.", "rate": 50, "genre": ["Drama", "Mystery"], "cast": ["Erick Elías", "Irene Azuela", "Diana Bracho", "Daniela Romo", "Jorge Poza"], "character": ["Julio Olmedo", "Isabel Alarcón", "Teresa Alarcón", "Angela", "Diego"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65396   Expand Secrets at the Hotel   (2016) User Score Overview The story of Secrets at the Hotel begins in 1908. Julio Olmedo and Isabel Alarcón travel on the same train to the Gran Hotel, property of the Alarcón family. Both of them ignore that their lives will take a new twist in that place, produced by love, treason, and the secrets hidden there.  Julio Olmedo travels there looking for his twin sister, Cristina, who stopped writing him months ago. Isabel comes to attend her mother’s call, the matriarch Teresa Langre Widow of Alarcón, who has fixed her wedding with Diego Montejo and to whom she has also granted the Gran Hotel’s management. A series of murders take place in the town where the hotel is along with Cristina Olmedo’s vanishing, and detective Serapio Ayala arrives from the capital city to clear them up; nevertheless, during his staying, the mysteries around the place pile up and become more difficult to figure out every time. Ayala is a science lover and he relies on it to solve any case he is assigned with. Olmedo joins the Gran Hotel as a waiter; there, he meets Andrés Salinas, son of Ángela Gómez, the housekeeper. A good friendship grows between Julio and Andrés which turns into a brotherhood. Andrés helps Julio investigate what happened to his sister. Andrés is in love with Belén García, an unscrupulous maid who manages, by playing victim of a cheating, to make Andrés recognize the child she is expecting, product of her affair with Diego Montejo. Sofía Alarcón is Teresa’s oldest daughter, she is married to Alfredo Vergara, the heir of a lineage family tradition. Sofía is pregnant, but she loses her baby and the obsession for having a child finally undermines her weak mental health. Felipe Alarcón is a young man who has always lived under the protection of his mother. She has made him a weak man in front of his feelings and desires, so now he is very far from being the heir his father always wanted him to be.  Ángela Salinas, the housekeeper of the Gran Hotel, knows every corner of that place and every person that has been in there in the past thirty years. Her unbreakable face hides secrets she refuses to reveal, mostly, to protect her son Andrés.  In Secrets at the hotel, mysteries accumulate on a daily basis and the love between Isabel and Julio grows stronger day by day, so they must confront the obstacles the epoch and the society of that time put in front of them. Secrets at the hotel is the place where the richest families of the time come to spend their leisure time ignoring that, inside those rooms and hallways, love and dead circulate at once. Featured Crew Ramón Campos Creator Gema R. Neira Creator María Renée Prudencio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erick Elías Julio Olmedo Irene Azuela Isabel Alarcón Diana Bracho Teresa Alarcón Daniela Romo Angela Jorge Poza Diego Full Cast & Crew Last Season Season 1 2016 | 1 Episode Season 1 of Secrets at the Hotel premiered on January 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Secrets at the Hotel. You can help by rating TV shows you've seen. Facts Original Name  El Hotel de los Secretos Status  Returning Series Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Drama Mystery Keywords hotel mexico telenovela 20th century Content Score 93 Almost there... Top Contributors s 34 shiff7 13 Banana CM 6 Cherche Moi d 4 denim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}