{"link": "https://www.themoviedb.org/tv/5320?language=en", "title": "Romany Jones", "resume": "Romany Jones is a British sitcom made by LWT, It starred Arthur Mullard and Queenie Watts as Wally and Lily Briggs and was broadcast between 1973 and 1975, The show was originally designed as a vehicle for James Beck, involving the comic misadventures of two layabout families living on a caravan site.\nFollowing the death of Beck in August 1973, aged just 44, Bert and Betty Jones were written out of the series, and Jonathan Cecil and Gay Soper took over the lead roles, playing new neighbours, Jeremy and Susan Crichton-Jones.\nThe show had a pilot broadcast in 1972 and was followed by a spin off sequel in 1976 entitled Yus, My Dear, starring Mullard and Watts.", "rate": 70, "genre": ["Comedy"], "cast": ["James Beck", "Arthur Mullard", "Queenie Watts", "Jo Rowbottom", "Jonathan Cecil"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5320   Expand Romany Jones   (1972) User Score Overview Romany Jones is a British sitcom made by LWT, It starred Arthur Mullard and Queenie Watts as Wally and Lily Briggs and was broadcast between 1973 and 1975, The show was originally designed as a vehicle for James Beck, involving the comic misadventures of two layabout families living on a caravan site. Following the death of Beck in August 1973, aged just 44, Bert and Betty Jones were written out of the series, and Jonathan Cecil and Gay Soper took over the lead roles, playing new neighbours, Jeremy and Susan Crichton-Jones. The show had a pilot broadcast in 1972 and was followed by a spin off sequel in 1976 entitled Yus, My Dear, starring Mullard and Watts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Beck Arthur Mullard Queenie Watts Jo Rowbottom Jonathan Cecil Full Cast & Crew Last Season Season 4 1975 | 6 Episodes Season 4 of Romany Jones premiered on June  6, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Romany Jones. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords slob british humour couples Content Score 71 Just a little bit more... Top Contributors O 7 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}