{"link": "https://www.themoviedb.org/tv/76995?language=en", "title": "Mysterious Personal Shopper", "resume": "Hong Se Yeon works as a personal shopper. She is outgoing and a positive person, but she is betrayed by people whom she loved. She begins to take revenge on those who betrayed her. Meanwhile, Eun Kyung Hye is the only child of a CEO. Her life looks perfect, but she has a fear that she will get abandoned. Because of her fear, she has an impulse control disorder and gets compulsive.", "rate": 34, "genre": ["Drama", "Family", "Mystery"], "cast": ["Choi Myung-gil", "Park Ha-na", "Wang Bit-na", "Han Sang-jin", "Lee Eun-Hyung"], "character": ["Geum Young-Sook", "Hong Se-Yeon", "Eun Kyung-Hye", "Jang Myung-Hwan", "Lee Jae-Joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76995   Expand Mysterious Personal Shopper   (2018) User Score Overview Hong Se Yeon works as a personal shopper. She is outgoing and a positive person, but she is betrayed by people whom she loved. She begins to take revenge on those who betrayed her. Meanwhile, Eun Kyung Hye is the only child of a CEO. Her life looks perfect, but she has a fear that she will get abandoned. Because of her fear, she has an impulse control disorder and gets compulsive. Featured Crew Kim Sang-hwi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Myung-gil Geum Young-Sook Park Ha-na Hong Se-Yeon Wang Bit-na Eun Kyung-Hye Han Sang-jin Jang Myung-Hwan Lee Eun-Hyung Lee Jae-Joon Full Cast & Crew Current Season Season 1 2018 | 100 Episodes Season 1 of Mysterious Personal Shopper premiered on February 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mysterious Personal Shopper. You can help by rating TV shows you've seen. Facts Original Name  인형의 집 Status  Returning Series Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/mysteryshopper/ Genres Drama Family Mystery Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors M 37 Maria180493 24 beanucha123 10 galactica_j 7 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}