{"link": "https://www.themoviedb.org/tv/13894?language=en", "title": "Tipping the Velvet", "resume": "Tipping the Velvet is a 2002 BBC television drama serial based on the best-selling debut novel by Sarah Waters of the same name. It originally screened in three episodes on BBC Two and was produced for the BBC by the independent production company Sally Head Productions. It stars Rachael Stirling, Keeley Hawes, and Jodhi May.\nDirected by Geoffrey Sax, the novel was adapted by screenwriter Andrew Davies. The production was made available on DVD by BBC Worldwide soon after broadcast.", "rate": 75, "genre": ["Drama"], "cast": ["Rachael Stirling", "Keeley Hawes", "Anna Chancellor", "Jodhi May", "Alexei Sayle"], "character": ["Kitty Butler", "Charles Frobisher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13894   Expand Tipping the Velvet   (2002) User Score Overview Tipping the Velvet is a 2002 BBC television drama serial based on the best-selling debut novel by Sarah Waters of the same name. It originally screened in three episodes on BBC Two and was produced for the BBC by the independent production company Sally Head Productions. It stars Rachael Stirling, Keeley Hawes, and Jodhi May. Directed by Geoffrey Sax, the novel was adapted by screenwriter Andrew Davies. The production was made available on DVD by BBC Worldwide soon after broadcast. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachael Stirling Keeley Hawes Kitty Butler Anna Chancellor Jodhi May Alexei Sayle Charles Frobisher Full Cast & Crew Last Season Season 1 2002 | 3 Episodes Season 1 of Tipping the Velvet premiered on December  9, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tipping the Velvet. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords sex based on novel or book victorian england lesbian miniseries period drama 19th century male impersonator Content Score 86 Almost there... Top Contributors 10 Banana R 6 Rebecca 4 Elizabeth Jennings T 4 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}