{"link": "https://www.themoviedb.org/tv/9619?language=en", "title": "Planet Robot Danguard Ace", "resume": "Planet Robo Danguard Ace is a Japanese science fiction anime series created by Leiji Matsumoto with Dan Kobayashi. It was licensed by Jim Terry Productions as part of the Force Five promotion as simply \"Danguard Ace\". English dialog was written for re-dubbing by Lynn Garrison who then combined a number of episodes into a feature length presentation which gained a cult following on the Showtime network during the eighties. The titular robot also appeared in Marvel Comics' Shogun Warriors series, as well as the toy line of the same name. In 2009, William Winckler Productions produced three all new English dubbed movie versions edited from the original series. Producer William Winckler, known for Tekkaman the Space Knight, wrote, produced and directed the English films, which are seen on broadband in Japan.\nDangard Ace is Matsumoto's only contribution to the giant robot genre.", "rate": 0, "genre": ["Animation"], "cast": ["Akira Kamiya", "Hidekatsu Shibata", "Mami Koyama", "Rihoko Yoshida", "Toshio Furukawa"], "character": ["Takuma Ichimonji (voice)", "Dantetsu Ichimonji (voice)", "Miraa (voice)", "Lisa (voice)", "Hideo Oboshi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9619   Expand Planet Robot Danguard Ace   (1977) User Score Overview Planet Robo Danguard Ace is a Japanese science fiction anime series created by Leiji Matsumoto with Dan Kobayashi. It was licensed by Jim Terry Productions as part of the Force Five promotion as simply \"Danguard Ace\". English dialog was written for re-dubbing by Lynn Garrison who then combined a number of episodes into a feature length presentation which gained a cult following on the Showtime network during the eighties. The titular robot also appeared in Marvel Comics' Shogun Warriors series, as well as the toy line of the same name. In 2009, William Winckler Productions produced three all new English dubbed movie versions edited from the original series. Producer William Winckler, known for Tekkaman the Space Knight, wrote, produced and directed the English films, which are seen on broadband in Japan. Dangard Ace is Matsumoto's only contribution to the giant robot genre. Featured Crew Leiji Matsumoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akira Kamiya Takuma Ichimonji (voice) Hidekatsu Shibata Dantetsu Ichimonji (voice) Mami Koyama Miraa (voice) Rihoko Yoshida Lisa (voice) Toshio Furukawa Hideo Oboshi (voice) Full Cast & Crew Last Season Season 1 1977 | 56 Episodes Season 1 of Planet Robot Danguard Ace premiered on March  6, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Planet Robot Danguard Ace. You can help by rating TV shows you've seen. Facts Original Name  惑星ロボダンガードＡWakusei Robo Danguard Ace Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  28m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 30 tmdb983464 4 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}