{"link": "https://www.themoviedb.org/tv/1972?language=en", "title": "Battlestar Galactica", "resume": "When an old enemy, the Cylons, resurface and obliterate the 12 colonies, the crew of the aged Galactica protect a small civilian fleet - the last of humanity - as they journey toward the fabled 13th colony, Earth.", "rate": 82, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Edward James Olmos", "Mary McDonnell", "Jamie Bamber", "Katee Sackhoff", "James Callis"], "character": ["William Adama", "Laura Roslin", "Lee 'Apollo' Adama", "Kara 'Starbuck' Thrace", "Gaius Baltar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1972   Expand Battlestar Galactica   (2004) User Score  Play Trailer Overview When an old enemy, the Cylons, resurface and obliterate the 12 colonies, the crew of the aged Galactica protect a small civilian fleet - the last of humanity - as they journey toward the fabled 13th colony, Earth. Featured Crew Ronald D. Moore Creator Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  3 Images Backdrops  70 Posters  21 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edward James Olmos William Adama Mary McDonnell Laura Roslin Jamie Bamber Lee 'Apollo' Adama Katee Sackhoff Kara 'Starbuck' Thrace James Callis Gaius Baltar Full Cast & Crew Last Season Season 4 2008 | 21 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply J Any IMDB refugees? Open 3 by  Nexus71 Besides This Show, What are Your Favorite \"Space\" TV Shows? Open 4 by  Nexus71 Did the entire series take place in a virtual reality? Open 1 by  Nexus71 Go to Discussions Media Most Popular Videos  2 Backdrops  70 Posters  21 Recommendations   2003-12-08 Battlestar Galactica 8.3    2002-09-20 Firefly 8.2    1987-09-28 Star Trek: The Next Generation 8.2    1997-07-27 Stargate SG-1 8.0    2004-07-15 Stargate Atlantis 7.8    2009-10-02 Stargate Universe 7.1    2001-09-26 Star Trek: Enterprise 7.4    2010-01-22 Caprica 6.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.syfy.com/battlestar/ Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords war cyborg space travel invasion spaceship space alien planet space opera cybernetic Content Score 100 Yes! Looking good! Top Contributors d 103 dais 32 Travis Bell 26 Elizabeth Jennings 26 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}