{"link": "https://www.themoviedb.org/tv/64031?language=en", "title": "Border", "resume": "Ishikawa Ango is a very capable detective that lives only for his job. One day, while investigating a crime scene, he gets shot in the head by the criminal that was still lurking about. Ango gets thrown over that line that divides life and death but, though he dies, doctor's are able to reanimate him and he pulls through. Yet, the bullet remains stuck in his head as the operation to remove it is very dangerous. Shortly after, he goes back to work and soon realizes that he's now able to see and talk with the recently departed.", "rate": 70, "genre": ["Crime", "Mystery"], "cast": ["Shun Oguri", "Munetaka Aoki", "Haru", "Arata Furuta", "Kenichi Takito"], "character": ["Ango Ishikawa", "Yuma Tachibana", "Mika Higa", "Akai", "Suzuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64031   Expand Border   (2014) User Score Overview Ishikawa Ango is a very capable detective that lives only for his job. One day, while investigating a crime scene, he gets shot in the head by the criminal that was still lurking about. Ango gets thrown over that line that divides life and death but, though he dies, doctor's are able to reanimate him and he pulls through. Yet, the bullet remains stuck in his head as the operation to remove it is very dangerous. Shortly after, he goes back to work and soon realizes that he's now able to see and talk with the recently departed. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shun Oguri Ango Ishikawa Munetaka Aoki Yuma Tachibana Haru Mika Higa Arata Furuta Akai Kenichi Takito Suzuki Full Cast & Crew Current Season Border2 2017 | 2 Episodes Season 2 of Border premiered on October  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Border. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.tv-asahi.co.jp/douga/border Genres Crime Mystery Keywords detective supernatural crime ocult Content Score 71 Just a little bit more... Top Contributors 32 thirstyhippo m 32 magyc85 6 Elizabeth Jennings V 3 VegaKita  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}