{"link": "https://www.themoviedb.org/tv/1103?language=en", "title": "Elizabeth R", "resume": "Elizabeth R is a BBC television drama serial of six 85-minute plays starring Glenda Jackson in the title role. It was first broadcast on BBC2 from February to March 1971, through the Australian Broadcasting Corporation in Australia and broadcast in America on PBS's Masterpiece Theatre.", "rate": 88, "genre": ["Drama"], "cast": ["Glenda Jackson", "Stephen Murray", "John Shrapnel", "Ronald Hines", "Robert Hardy"], "character": ["Queen Elizabeth I", "Earl of Sussex", "William Cecil", "Robert Dudley (Earl of Leicester)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1103   Expand Elizabeth R   (1971) User Score Overview Elizabeth R is a BBC television drama serial of six 85-minute plays starring Glenda Jackson in the title role. It was first broadcast on BBC2 from February to March 1971, through the Australian Broadcasting Corporation in Australia and broadcast in America on PBS's Masterpiece Theatre. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Glenda Jackson Queen Elizabeth I Stephen Murray John Shrapnel Earl of Sussex Ronald Hines William Cecil Robert Hardy Robert Dudley (Earl of Leicester) Full Cast & Crew Last Season Season 1 1971 | 6 Episodes Season 1 of Elizabeth R premiered on February 17, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1970-01-01 The Six Wives of Henry VIII 7.6    1975-04-01 Edward the Seventh 7.6    1981-10-12 Brideshead Revisited 7.8    1973-10-31 The World at War 8.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  85m Homepage  - Genres Drama Keywords england queen elizabeth i royalty miniseries historical drama 16th century british monarchy Content Score 86 Almost there... Top Contributors TB 18 TMDb Bot R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}