{"link": "https://www.themoviedb.org/tv/1812?language=en", "title": "Peep and the Big Wide World", "resume": "Peep and the Big Wide World is an animated cartoon that teaches nature and basic science concepts to preschoolers. The main characters include a yellow baby chick named Peep and his friends Quack, a teenaged blue drake, and Chirp, a baby red robin with pink eyelids. The current show, narrated by Joan Cusack is based on a National Film Board of Canada cartoon short of the same name, created in 1988 by Kaj Pindal and narrated by Peter Ustinov, and another short, \"The Peep Show\", from 1962. The original short comprised three 10-minute films featuring Peep, Quack, and Chirp as they meet a cat, a ladybug, a turtle and a frog who speaks from both sides of his mouth.\nThe show is produced by WGBH in Boston and 9 Story Entertainment in Toronto, Canada. In the US, this show formerly aired on Discovery Kids as part of its commercial-free and sponsor-free \"Ready, Set, Learn!\" programming block. It now airs nationally in the United States on public television, distributed by American Public Television. In Canada, it airs on TVOntario. DVDs and books are also available for purchase. Peep and the Big Wide World is currently sponsored by the National Science Foundation in conjunction with WGBH-TV as part of an education and outreach program. The principal investigator is Kate Taylor, also of the ZOOM block. The National Science Foundation is the only permanent sponsor of the show. Northrop Grumman, The Carnegie Corporation of New York, the Corporation for Public Broadcasting and Toyota funded the show for only season two. The Discovery Kids Foundation funded the show for only season one. In 1999, the show was produced by Clumsy PriStar Television. The VHS copies are produced from Clumsy Pristar's home viewings.", "rate": 75, "genre": ["Animation"], "cast": ["Adrian Truss", "Alex Hood", "Alexander Conti", "Colin Fox", "David Huband"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1812   Expand Peep and the Big Wide World   (2004) User Score Overview Peep and the Big Wide World is an animated cartoon that teaches nature and basic science concepts to preschoolers. The main characters include a yellow baby chick named Peep and his friends Quack, a teenaged blue drake, and Chirp, a baby red robin with pink eyelids. The current show, narrated by Joan Cusack is based on a National Film Board of Canada cartoon short of the same name, created in 1988 by Kaj Pindal and narrated by Peter Ustinov, and another short, \"The Peep Show\", from 1962. The original short comprised three 10-minute films featuring Peep, Quack, and Chirp as they meet a cat, a ladybug, a turtle and a frog who speaks from both sides of his mouth. The show is produced by WGBH in Boston and 9 Story Entertainment in Toronto, Canada. In the US, this show formerly aired on Discovery Kids as part of its commercial-free and sponsor-free \"Ready, Set, Learn!\" programming block. It now airs nationally in the United States on public television, distributed by American Public Television. In Canada, it airs on TVOntario. DVDs and books are also available for purchase. Peep and the Big Wide World is currently sponsored by the National Science Foundation in conjunction with WGBH-TV as part of an education and outreach program. The principal investigator is Kate Taylor, also of the ZOOM block. The National Science Foundation is the only permanent sponsor of the show. Northrop Grumman, The Carnegie Corporation of New York, the Corporation for Public Broadcasting and Toyota funded the show for only season two. The Discovery Kids Foundation funded the show for only season one. In 1999, the show was produced by Clumsy PriStar Television. The VHS copies are produced from Clumsy Pristar's home viewings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrian Truss Alex Hood Alexander Conti Colin Fox David Huband Full Cast & Crew Last Season Season 5 2011 | 10 Episodes Season 5 of Peep and the Big Wide World premiered on October 10, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Peep and the Big Wide World. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Peep and the Big Wide World. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m, 22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 4 Angyl A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}