{"link": "https://www.themoviedb.org/tv/71790?language=en", "title": "S.W.A.T.", "resume": "Follows a locally born and bred S.W.A.T. lieutenant who is torn between loyalty to the streets and duty to his fellow officers when he's tasked to run a highly-trained unit that's the last stop for solving crimes in Los Angeles.", "rate": 66, "genre": ["Action", "Adventure", "Drama", "Crime"], "cast": ["Shemar Moore", "Stephanie Sigman", "Alex Russell", "Jay Harrington", "Lina Esco"], "character": ["Daniel 'Hondo' Harrelson", "Jessica Cortez", "Jim Street", "David 'Deacon' Kay", "Chris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71790   Expand S.W.A.T.   (2017) User Score  Play Trailer Overview Follows a locally born and bred S.W.A.T. lieutenant who is torn between loyalty to the streets and duty to his fellow officers when he's tasked to run a highly-trained unit that's the last stop for solving crimes in Los Angeles. Featured Crew Aaron Rahsaan Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shemar Moore Daniel 'Hondo' Harrelson Stephanie Sigman Jessica Cortez Alex Russell Jim Street Jay Harrington David 'Deacon' Kay Lina Esco Chris Full Cast & Crew Current Season Season 1 2017 | 22 Episodes Season 1 of S.W.A.T. premiered on November  1, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w A nice guy? Open 0 by wonder2wonder\n      \n     w Mama's boy Open 2 by  wonder2wonder w Played for a fool Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2017-09-27 SEAL Team 6.6    2016-09-20 Bull 6.6    2017-10-01 Wisdom of the Crowd 7.1    2017-09-25 The Brave 6.6    2017-10-09 Valor 6.3    2016-10-10 Freakish 5.8    2018-01-21 The Resident 7.0    2017-09-26 Law & Order True Crime 6.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/swat/ Genres Action & Adventure Drama Crime Keywords los angeles swat team Content Score 100 Yes! Looking good! Top Contributors 42 Warpath 30 Banana 12 niqo19 m 10 misfit_noel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}