{"link": "https://www.themoviedb.org/tv/60663?language=en", "title": "Buddy Complex", "resume": "Buddy Complex revolves around the main character, Aoba Watase, an ordinary high school boy. One day, his classmate Hina Yumihara, saves him from being killed by a guy in a mecha that came from the future. Hina revealed that she herself also from the future and then she sends Aoba into the future. When he wakes up, he finds himself over seventy years into the future, where the Free Pact Alliance and the Zogilia Republic are at war with each other, each battling with their own valiancers; and Aoba is on the former's team, teams up with Dio using coupling valiancers Luxon and Bradyon. He also learns that Hina is on the opposing team, and what's even stranger, she doesn't remember him at all.", "rate": 70, "genre": ["Animation", "War", "Sci-Fi", "Fantasy"], "cast": ["Yoshitsugu Matsuoka", "Kouki Uchiyama", "Saori Hayami", "Aoi Yuki", "Tomokazu Sugita"], "character": ["Aoba Watase", "Dio Junyou Weinberg", "Hina Yumihara", "Fiona Junyou Weinberg", "Lee Conrad"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60663   Expand Buddy Complex   (2013) User Score  Play Trailer Overview Buddy Complex revolves around the main character, Aoba Watase, an ordinary high school boy. One day, his classmate Hina Yumihara, saves him from being killed by a guy in a mecha that came from the future. Hina revealed that she herself also from the future and then she sends Aoba into the future. When he wakes up, he finds himself over seventy years into the future, where the Free Pact Alliance and the Zogilia Republic are at war with each other, each battling with their own valiancers; and Aoba is on the former's team, teams up with Dio using coupling valiancers Luxon and Bradyon. He also learns that Hina is on the opposing team, and what's even stranger, she doesn't remember him at all. Featured Crew Hajime Yatate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshitsugu Matsuoka Aoba Watase Kouki Uchiyama Dio Junyou Weinberg Saori Hayami Hina Yumihara Aoi Yuki Fiona Junyou Weinberg Tomokazu Sugita Lee Conrad Full Cast & Crew Last Season To the Future Arc 2013 | 15 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Buddy Complex. You can help by rating TV shows you've seen. Facts Original Name  バディ・コンプレックス Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation War Sci-Fi & Fantasy Keywords mecha anime Content Score 100 Yes! Looking good! Top Contributors h 42 heeroyuy176 14 Aitor1995 8 miryoku j 8 jaiik1004  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}