{"link": "https://www.themoviedb.org/tv/39657?language=en", "title": "Penguindrum", "resume": "A terminally ill girl named Himari Takakura is miraculously saved from death by a strange spirit who resides in a penguin-shaped hat. However, in exchange for extending her life, the spirit tasks Himari's brothers, Kanba and Shōma, to seek out an elusive item known as the Penguin Drum with assistance from a trio of strange penguins.", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Mystery"], "cast": ["Miho Arakawa", "Ryohei Kimura", "Subaru Kimura", "Marie Miyake", "Yui Horie"], "character": ["Himari Takakura", "Shouma Takakura", "Kanba Takakura", "Ringo Oginome", "Masako Natsume"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39657   Expand Penguindrum   (2011) User Score  Play Trailer Overview A terminally ill girl named Himari Takakura is miraculously saved from death by a strange spirit who resides in a penguin-shaped hat. However, in exchange for extending her life, the spirit tasks Himari's brothers, Kanba and Shōma, to seek out an elusive item known as the Penguin Drum with assistance from a trio of strange penguins. Featured Crew Kunihiko Ikuhara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miho Arakawa Himari Takakura Ryohei Kimura Shouma Takakura Subaru Kimura Kanba Takakura Marie Miyake Ringo Oginome Yui Horie Masako Natsume Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of Penguindrum premiered on July  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  5 Recommendations   1992-06-20 On the Air 9.4    2015-01-05 Yurikuma Arashi 7.7    1989-04-03 Alfred J. Kwak 7.7    1997-04-02 Revolutionary Girl Utena 9.4    2017-11-23 She's Gotta Have It 7.2    1993-01-08 Hotel Room 7.1    2015-09-14 Merlí 8.5    2002-01-01 DumbLand 7.3  Facts Original Name  輪るピングドラム Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://penguindrum.jp Genres Action & Adventure Animation Comedy Drama Mystery Keywords symbolism penguin resurrection apple broken family anime Content Score 100 Yes! Looking good! Top Contributors 36 Micael Lopes 20 sp1ti t 11 themacguffinman p 5 psy4trik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}