{"link": "https://www.themoviedb.org/tv/75140?language=en", "title": "Shot in the Dark", "resume": "Three rival freelance stringers scour the streets at night to film crime scenes, fires, accidents -- and anything else they can sell to news outlets.", "rate": 74, "genre": ["Reality"], "cast": ["Howard Raishbrook", "Scott Lane", "Zak Holman"], "character": ["himself", "himself", "himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75140   Expand Shot in the Dark   (2017) User Score  Play Trailer Overview Three rival freelance stringers scour the streets at night to film crime scenes, fires, accidents -- and anything else they can sell to news outlets. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Howard Raishbrook himself Scott Lane himself Zak Holman himself Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of Shot in the Dark premiered on November 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2006-03-13 Canada's Worst Handyman 5.0    2014-01-14 Friday Night Tykes 6.8    2012-09-04 Highway Thru Hell 7.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Reality Original Language  English Runtime  35m Homepage   https://www.netflix.com/title/80171561 Genres Reality Keywords cameraman news Content Score 64 We're so close, yet so far. Top Contributors M 28 Maisel 7 Jorge Gomes 5 Steve a 4 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}