{"link": "https://www.themoviedb.org/tv/60649?language=en", "title": "The 7.39", "resume": "Carl Matthews commutes by train to London where he works in a property management office under a boss who is pressuring him to dismiss an employee. He has a kind and supportive wife Maggie and two teenage children who he feels do not appreciate him.\nOne morning he complains to a woman called Sally that she has taken his seat on the train. He later apologises to her and they start chatting, a relationship develops and she reveals that she is divorced but about to marry again, although scenes with her fiancée suggest she is going cold on the idea. She works at a health club and Carl joins it so that he can see more of her. They fall in love and one evening when the train is not running they spend the night together at a hotel. The second part of the drama deals with the repercussions of their affair.", "rate": 66, "genre": ["Drama"], "cast": ["David Morrissey", "Sheridan Smith", "Olivia Colman", "Sean Maguire", "Izzy Meikle-Small"], "character": ["Carl Matthews", "Sally Thorn", "Maggie Matthews", "Ryan Cole", "Charlotte Matthews"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60649   Expand The 7.39   (2014) User Score  Play Trailer Overview Carl Matthews commutes by train to London where he works in a property management office under a boss who is pressuring him to dismiss an employee. He has a kind and supportive wife Maggie and two teenage children who he feels do not appreciate him. One morning he complains to a woman called Sally that she has taken his seat on the train. He later apologises to her and they start chatting, a relationship develops and she reveals that she is divorced but about to marry again, although scenes with her fiancée suggest she is going cold on the idea. She works at a health club and Carl joins it so that he can see more of her. They fall in love and one evening when the train is not running they spend the night together at a hotel. The second part of the drama deals with the repercussions of their affair. Featured Crew David Nicholls Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Morrissey Carl Matthews Sheridan Smith Sally Thorn Olivia Colman Maggie Matthews Sean Maguire Ryan Cole Izzy Meikle-Small Charlotte Matthews Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of The 7.39 premiered on January  6, 2014. View All Seasons Social Reviews  1 Discussions  0 Featured Review A review by Reno  8.0 Written by  Reno  on June 16, 2015 Sometimes the quarrels are the game changer in the life. A British television movie, splits into two parts of each 60 minutes long. From the writer of 'One Day' who once again wrote a beautiful screenplay. Portrayal of the romantic drama from the perspective of the middle-aged people. Indeed, specially made movie for them, it explores the midlife crises in the marriage and spiritless mechanical life that follows the day after the day. Now, you guys have to switch your mind to google map mode: The story told between the two points of life's map, one is where the home and the family is, dot,...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The 7.39. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b03pn0sn Genres Drama Keywords friendship london england cheating miniseries train journey romantic drama married engaged Content Score 100 Yes! Looking good! Top Contributors TB 47 TMDb Bot u 18 uhtred1986 9 Elizabeth Jennings 5 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}