{"link": "https://www.themoviedb.org/tv/39253?language=en", "title": "How to Be a Gentleman", "resume": "How to Be a Gentleman, inspired by the book of the same name, is a comedy about the unlikely friendship between a traditional, refined writer and an unrefined personal trainer. Andrew Carlson (David Hornsby) is an etiquette columnist whose devotion to ideals from a more civilized time has lead to a life detached from modern society. Infectiously optimistic, Bert Lansing (Kevin Dillon) is a reformed \"bad boy\" from Andrew's past who inherited a fitness center, but can still be rude, loud and sloppy. When Andrew's editor, Jerry (Dave Foley), tells him to put a modern, sexy twist on his column or be fired, he hires Bert as a life coach in the hopes of learning to be less \"gentle man\" and more \"real man.\"", "rate": 53, "genre": ["Comedy"], "cast": ["David Hornsby", "Kevin Dillon", "Dave Foley", "Mary Lynn Rajskub", "Rhys Darby"], "character": ["Andrew Carlson", "Bert Lansing", "Jerry", "Janet", "Mike"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39253   Expand How to Be a Gentleman   (2011) User Score  Play Trailer Overview How to Be a Gentleman, inspired by the book of the same name, is a comedy about the unlikely friendship between a traditional, refined writer and an unrefined personal trainer. Andrew Carlson (David Hornsby) is an etiquette columnist whose devotion to ideals from a more civilized time has lead to a life detached from modern society. Infectiously optimistic, Bert Lansing (Kevin Dillon) is a reformed \"bad boy\" from Andrew's past who inherited a fitness center, but can still be rude, loud and sloppy. When Andrew's editor, Jerry (Dave Foley), tells him to put a modern, sexy twist on his column or be fired, he hires Bert as a life coach in the hopes of learning to be less \"gentle man\" and more \"real man.\" Featured Crew David Hornsby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Hornsby Andrew Carlson Kevin Dillon Bert Lansing Dave Foley Jerry Mary Lynn Rajskub Janet Rhys Darby Mike Full Cast & Crew Last Season Season 1 2011 | 9 Episodes Season 1 of How to Be a Gentleman premiered on September 29, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2012-12-17 1600 Penn 4.4    2012-01-19 Unsupervised 6.6  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cbs.com/primetime/how_to_be_a_gentleman Genres Comedy Keywords newspaper columnist life teacher Content Score 100 Yes! Looking good! Top Contributors 8 United600 5 Banana 1 Vampire Bai 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}