{"link": "https://www.themoviedb.org/tv/64016?language=en", "title": "The New Scooby-Doo Mysteries", "resume": "Picking up almost directly where 'The New Scooby and Scappy Doo Show' left off. The main difference being  that the team are now occasionally joined by Fred and Velma, who have been absent since season one of the 'Scooby and scrappy Doo' show in 1979.", "rate": 62, "genre": ["Animation", "Family"], "cast": ["Casey Kasem", "Don Messick", "Heather North"], "character": ["Shaggy Rogers (voice)", "Scooby / Scrappy (voice)", "Daphne Blake (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64016   Expand The New Scooby-Doo Mysteries   (1984) User Score Overview Picking up almost directly where 'The New Scooby and Scappy Doo Show' left off. The main difference being  that the team are now occasionally joined by Fred and Velma, who have been absent since season one of the 'Scooby and scrappy Doo' show in 1979. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Kasem Shaggy Rogers (voice) Don Messick Scooby / Scrappy (voice) Heather North Daphne Blake (voice) Full Cast & Crew Last Season Season 1 1984 | 13 Episodes Season 1 of The New Scooby-Doo Mysteries premiered on September  8, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The New Scooby-Doo Mysteries. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    1996-04-02 Dennis the Menace and Gnasher 5.8    2011-09-19 Kung Fu Panda: Legends of Awesomeness 6.7    1958-10-02 The Huckleberry Hound Show 7.0  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Czech Runtime  - Homepage  - Genres Animation Family Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors d 15 deen0x N 11 Notamymerrick Z 4 ZEDik n 3 neodawg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}