{"link": "https://www.themoviedb.org/tv/3272?language=en", "title": "Decisiones", "resume": "Decisiones is a Telemundo-produced Spanish-language television anthology of steamy melodramas about passion and sex in the modern world. The 30-minute-long series features impassioned people thrust into amorous adventures and pushed to their breaking points. Unlike much Spanish-language dramatic fare, each show contains a complete story.\nAccording to Telemundo, these fervid tales are \"inspired by real-life cases of everyday heroes\". The network bills the show as a mix of drama and reality. Telemundo also broadcast English subtitles of many episodes as closed captions on CC3.\nDecisiones' first aired on Telemundo from May 9 to August 8, 2005 with Candela Ferro hosting. It returned to the prime-time schedule from September 26, 2005 to April 13, 2007, when it made room for the serial Sin Vergüenza. A third run began in daytime on August 22, 2007 with the title Decisiones de mujeres hosted by Rashel Diaz.\nOn September 4, 2007, a 50-episode season of Decisiones began production in Puerto Rico by a division of Telemundo, Telemundo of Puerto Rico Studios. The season debuted on November 12, 2007, hosted by Cynthia Olavarria. As of April, 2008, over 500 episodes of this series had been produced.", "rate": 100, "genre": ["Drama"], "cast": ["Catherine Siachoque", "Jorge Aravena", "Gabriela Spanic", "Flavio Caballero", "Natasha Klauss"], "character": ["Daniela"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3272   Expand Decisiones   (2005) User Score Overview Decisiones is a Telemundo-produced Spanish-language television anthology of steamy melodramas about passion and sex in the modern world. The 30-minute-long series features impassioned people thrust into amorous adventures and pushed to their breaking points. Unlike much Spanish-language dramatic fare, each show contains a complete story. According to Telemundo, these fervid tales are \"inspired by real-life cases of everyday heroes\". The network bills the show as a mix of drama and reality. Telemundo also broadcast English subtitles of many episodes as closed captions on CC3. Decisiones' first aired on Telemundo from May 9 to August 8, 2005 with Candela Ferro hosting. It returned to the prime-time schedule from September 26, 2005 to April 13, 2007, when it made room for the serial Sin Vergüenza. A third run began in daytime on August 22, 2007 with the title Decisiones de mujeres hosted by Rashel Diaz. On September 4, 2007, a 50-episode season of Decisiones began production in Puerto Rico by a division of Telemundo, Telemundo of Puerto Rico Studios. The season debuted on November 12, 2007, hosted by Cynthia Olavarria. As of April, 2008, over 500 episodes of this series had been produced. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine Siachoque Jorge Aravena Gabriela Spanic Daniela Flavio Caballero Natasha Klauss Full Cast & Crew Last Season Season 1 2005 | 1 Episode Season 1 of Decisiones premiered on May  9, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Decisiones. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage   http://www.msnlatino.telemundo.com/novelas/Decisiones/ Genres Drama Keywords passion Content Score 86 Almost there... Top Contributors 18 Mon-Star s 3 speedycars GD 2 Gary Davis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}