{"link": "https://www.themoviedb.org/tv/1996?language=en", "title": "The Flintstones", "resume": "The misadventures of two modern-day Stone Age families, the Flintstones and the Rubbles.", "rate": 71, "genre": ["Family", "Animation", "Comedy"], "cast": ["Mel Blanc", "Alan Reed", "Jean Vander Pyl", "Bea Benaderet", "John Stephenson"], "character": ["Barney Rubble", "Fred Flintstone", "Wilma Flintstone", "Betty Rubble", "Mr. Slate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1996   Expand The Flintstones   (1960) User Score  Play Trailer Overview The misadventures of two modern-day Stone Age families, the Flintstones and the Rubbles. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mel Blanc Barney Rubble Alan Reed Fred Flintstone Jean Vander Pyl Wilma Flintstone Bea Benaderet Betty Rubble John Stephenson Mr. Slate Full Cast & Crew Last Season Season 6 1965 | 26 Episodes Season 6 of The Flintstones premiered on September 17, 1965. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply outstanding Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  7 Recommendations   1962-09-23 The Jetsons 6.6    1983-09-10 Inspector Gadget 6.6    1969-09-13 Scooby-Doo, Where Are You! 7.5    1995-09-09 Pinky and the Brain 7.7    1960-10-11 The Bugs Bunny Show 7.8    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1987-09-18 DuckTales 7.6    1964-12-18 The Pink Panther Show 7.0  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.thewb.com/shows/the-flintstones Genres Family Animation Comedy Keywords prehistoric flintstones Content Score 100 Yes! Looking good! Top Contributors V 44 Vivo 31 Banana 21 Elizabeth Jennings 16 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}