{"link": "https://www.themoviedb.org/tv/40239?language=en", "title": "The Princess' Man", "resume": "The Princess' Man is a 2011 South Korean television series, starring Park Si-hoo, Moon Chae-won, Kim Yeong-cheol, Song Jong-ho, Hong Soo-hyun, and Lee Soon-jae. It is a period drama about the forbidden romance between the daughter of King Sejo and the son of Sejo's political opponent Kim Jong-seo. It aired on KBS2 from July 20 to October 6, 2011 on Wednesdays and Thursdays at 21:55 for 24 episodes.", "rate": 86, "genre": ["Drama"], "cast": ["Moon Chae-won", "Park Shi Hoo", "Hong Soo-hyun", "Lee Soon-jae", "Song Jong-ho"], "character": ["Lee Se Ryung", "Kim Seung Yoo", "Princess Kyung Hye", "Kim Jong Seo", "Shin Myeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40239   Expand The Princess' Man   (2011) User Score  Play Trailer Overview The Princess' Man is a 2011 South Korean television series, starring Park Si-hoo, Moon Chae-won, Kim Yeong-cheol, Song Jong-ho, Hong Soo-hyun, and Lee Soon-jae. It is a period drama about the forbidden romance between the daughter of King Sejo and the son of Sejo's political opponent Kim Jong-seo. It aired on KBS2 from July 20 to October 6, 2011 on Wednesdays and Thursdays at 21:55 for 24 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Moon Chae-won Lee Se Ryung Park Shi Hoo Kim Seung Yoo Hong Soo-hyun Princess Kyung Hye Lee Soon-jae Kim Jong Seo Song Jong-ho Shin Myeon Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of The Princess' Man premiered on July 20, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2012-01-04 Moon Embracing the Sun 8.4    2008-05-21 Iljimae 9.3    2010-08-30 Sungkyunkwan Scandal 7.7    2015-12-09 Remember 7.9    2016-05-13 Mirror of the Witch 5.2    2010-11-13 Secret Garden 8.2    2016-08-22 Love in the Moonlight 6.5  Facts Original Name  공주의 남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/princess/ Genres Drama Keywords korea Content Score 93 Almost there... Top Contributors M 15 Maria180493 CM 9 Cherche Moi t 8 tmdb38202327 N 5 Nightowl.Kr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}