{"link": "https://www.themoviedb.org/tv/27604?language=en", "title": "The Arbitrator", "resume": "The series tells the story of Nadav Feldman , a young social worker , who discovers that he is adopted and finds himself in the depths of his biological father's family, Baruch Asulin, a leader of an organized crime syndicate in Israel known as \"Ha-Borer\"(The Arbitrator), due to his activities as an arbitrator in disputes in the underworld. The series focuses on the combination of dramatic stretches , the conflict between the norms of society including crime, especially norms and codes of conduct of the underworld. Among other highlights of the series, in a satirical way, the contrast between certain behaviors of some of the heroes of the series (as a demonstration of piety) and other behaviors (such as the blatant disregard for human life).", "rate": 0, "genre": ["Drama"], "cast": ["Moshe Ivgy", "Yehuda Levi", "Maya Maron", "Shlomi Koriat", "Netta Garti"], "character": ["Baruch Asulin", "Nadav Feldman", "Orna Kleinman", "Avi Asulin", "Limor Goldman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27604   Expand The Arbitrator   (2007) User Score Overview The series tells the story of Nadav Feldman , a young social worker , who discovers that he is adopted and finds himself in the depths of his biological father's family, Baruch Asulin, a leader of an organized crime syndicate in Israel known as \"Ha-Borer\"(The Arbitrator), due to his activities as an arbitrator in disputes in the underworld. The series focuses on the combination of dramatic stretches , the conflict between the norms of society including crime, especially norms and codes of conduct of the underworld. Among other highlights of the series, in a satirical way, the contrast between certain behaviors of some of the heroes of the series (as a demonstration of piety) and other behaviors (such as the blatant disregard for human life). Featured Crew Shay Kanot Creator Reshef Levy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Moshe Ivgy Baruch Asulin Yehuda Levi Nadav Feldman Maya Maron Orna Kleinman Shlomi Koriat Avi Asulin Netta Garti Limor Goldman Full Cast & Crew Last Season Haborer season 3 2010 | 12 Episodes Season 3 of The Arbitrator premiered on October 26, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Arbitrator. You can help by rating TV shows you've seen. Facts Original Name  הבורר Status  Ended Network Certification  - Type  Scripted Original Language  Hebrew Runtime  42m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 Banana m 4 mlevi a 2 adambakir92 i 1 ironman198911  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}