{"link": "https://www.themoviedb.org/tv/66298?language=en", "title": "Wagamama High Spec", "resume": "Protagonist Kouki Narumi is a high school  student who also writes a manga serialized in a certain weekly  publication. Kaoruko Rokuonji is the student council president and  illustrator for a popular manga. One day, just as Kaoruko happens to be  trying to recruit a male student council member, she learns Kouki's true  identity and the fact that it's his manga she has been illustrating.  Kouki agrees to join the student council under the condition that she  keeps his identity secret. Then his younger sister, Toa Narumi, and her  friend Mihiro Miyase also join the student council...", "rate": 30, "genre": ["Animation", "Comedy"], "cast": ["Mariko Honda", "Megu Sakuragawa", "Mai Gotou", "Chiyo Ousaki"], "character": ["Kaoruko Rokuonji (voice)", "Ashe R. Sakuragi (voice)", "Toa Narumi (voice)", "Mihiro Miyase (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66298   Expand Wagamama High Spec   (2016) User Score  Play Trailer Overview Protagonist Kouki Narumi is a high school  student who also writes a manga serialized in a certain weekly  publication. Kaoruko Rokuonji is the student council president and  illustrator for a popular manga. One day, just as Kaoruko happens to be  trying to recruit a male student council member, she learns Kouki's true  identity and the fact that it's his manga she has been illustrating.  Kouki agrees to join the student council under the condition that she  keeps his identity secret. Then his younger sister, Toa Narumi, and her  friend Mihiro Miyase also join the student council... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariko Honda Kaoruko Rokuonji (voice) Megu Sakuragawa Ashe R. Sakuragi (voice) Mai Gotou Toa Narumi (voice) Chiyo Ousaki Mihiro Miyase (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Wagamama High Spec premiered on April 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Wagamama High Spec. You can help by rating TV shows you've seen. Facts Original Name  ワガママハイスペック Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  3m Homepage   http://www.whanime.com/ Genres Animation Comedy Keywords harem ecchi promotional fan service based on visual novel Content Score 93 Almost there... Top Contributors 67 Marr 🇳🇱 s 3 sheva_vitali m 3 magoozin 3 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}