{"link": "https://www.themoviedb.org/tv/67178?language=en", "title": "Marvel's The Punisher", "resume": "A former Marine out to punish the criminals responsible for his family's murder finds himself ensnared in a military conspiracy.", "rate": 80, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Jon Bernthal", "Ebon Moss-Bachrach", "Ben Barnes", "Deborah Ann Woll", "Amber Rose Revah"], "character": ["Frank Castle / The Punisher", "David Lieberman / Micro", "Billy Russo", "Karen Page", "Dinah Madani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67178   Expand Marvel's The Punisher   (2017) User Score  Play Trailer Overview A former Marine out to punish the criminals responsible for his family's murder finds himself ensnared in a military conspiracy. Featured Crew Steve Lightfoot Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  1 Images Backdrops  10 Posters  20 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Bernthal Frank Castle / The Punisher Ebon Moss-Bachrach David Lieberman / Micro Ben Barnes Billy Russo Deborah Ann Woll Karen Page Amber Rose Revah Dinah Madani Full Cast & Crew Current Season Season 1 2017 | 13 Episodes Season 1 of Marvel's The Punisher premiered on November 17, 2017. View All Seasons Social Reviews  0 Discussions  18 Subject Status Replies Last Reply Netflix learns nothing apparently Open 12 by  poweranimals I don't get the high praise (spoiler) Open 2 by  JustinJackFlash Actress Who Played the DHS Agent was Godawful Terrible Open 6 by  mechajutaro Go to Discussions Media Most Popular Videos  3 Backdrops  10 Posters  20 Recommendations   2017-08-18 Marvel's The Defenders 7.1    2016-09-30 Marvel's Luke Cage 6.9    2017-03-17 Marvel's Iron Fist 6.1    2015-11-20 Marvel's Jessica Jones 7.6    2015-04-10 Marvel's Daredevil 7.7    2017-10-02 The Gifted 7.0    2017-11-21 Marvel's Runaways 7.3    2017-10-13 Mindhunter 7.4  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  53m Homepage   https://www.netflix.com/title/80117498 Genres Action & Adventure Crime Drama Keywords gun based on comic vigilante violence Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings I 30 Iscoh 29 Hevinalle R 11 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}