{"link": "https://www.themoviedb.org/tv/8418?language=en", "title": "Get Karl! Oh Soo Jung", "resume": "Get Karl! Oh Soo-jung is a 2007 South Korean romantic comedy television seriesn starring Uhm Jung-hwa and Oh Ji-ho. It aired on SBS from July 28 to September 16, 2007 on Saturdays and Sundays at 21:45 for 16 episodes.\nThe series is based on the real-life love story of Lee Ju-young, the CEO of the drama's production company who reunited with her current husband ten years after breaking up with him. Moreover, Go Man-soo is the actual name of Lee's pro-golfer husband who incidentally instructed Oh Ji-ho on his golf swings in preparation for the role.", "rate": 60, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Oh Ji-ho", "Uhm Jung-hwa", "Park Soo-jin", "Sung Dong-il", "Kim Kap-soo"], "character": ["Go Man-soo / Karl Go", "Oh Soo-jung", "Oh Soo-jung (young)", "Jung Seung-gyu", "Oh Byung-jik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8418   Expand Get Karl! Oh Soo Jung   (2007) User Score Overview Get Karl! Oh Soo-jung is a 2007 South Korean romantic comedy television seriesn starring Uhm Jung-hwa and Oh Ji-ho. It aired on SBS from July 28 to September 16, 2007 on Saturdays and Sundays at 21:45 for 16 episodes. The series is based on the real-life love story of Lee Ju-young, the CEO of the drama's production company who reunited with her current husband ten years after breaking up with him. Moreover, Go Man-soo is the actual name of Lee's pro-golfer husband who incidentally instructed Oh Ji-ho on his golf swings in preparation for the role. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Ji-ho Go Man-soo / Karl Go Uhm Jung-hwa Oh Soo-jung Park Soo-jin Oh Soo-jung (young) Sung Dong-il Jung Seung-gyu Kim Kap-soo Oh Byung-jik Full Cast & Crew Last Season Season 1 2007 | 16 Episodes Season 1 of Get Karl! Oh Soo Jung premiered on July 28, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Get Karl! Oh Soo Jung. You can help by rating TV shows you've seen. Facts Original Name  칼잡이 오수정 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/osujung/ Genres Comedy Drama Romance Keywords romantic comedy korea Content Score 86 Almost there... Top Contributors t 25 tmdb38202327 z 10 zurman1 M 5 Maria180493 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}