{"link": "https://www.themoviedb.org/tv/74802?language=en", "title": "Deadwind", "resume": "When Sofia Karppi, a detective in her 30's who is trying to get over her husband's death, discovers the body of a young woman on a construction site, she triggers a chain of events that threatens to destroy her life again.", "rate": 0, "genre": ["Drama", "Crime"], "cast": ["Pihla Viitala", "Lauri Tilkanen", "Tommi Korpela", "Kari Hietalahti", "Jonna Järnefelt"], "character": ["Sofia Karppi", "Sakari Nurmi", "Alex Hoikkala", "Louhivuori", "Linda Hoikkala"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74802   Expand Deadwind   (2018) User Score Overview When Sofia Karppi, a detective in her 30's who is trying to get over her husband's death, discovers the body of a young woman on a construction site, she triggers a chain of events that threatens to destroy her life again. Featured Crew Rike Jokela Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pihla Viitala Sofia Karppi Lauri Tilkanen Sakari Nurmi Tommi Korpela Alex Hoikkala Kari Hietalahti Louhivuori Jonna Järnefelt Linda Hoikkala Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Deadwind premiered on March 14, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Deadwind. You can help by rating TV shows you've seen. Facts Original Name  Karppi Status  Returning Series Network Certification  - Type  Scripted Original Language  Finnish Runtime  48m Homepage   https://areena.yle.fi/1-4254834 Genres Drama Crime Keywords murder female detective Content Score 100 Yes! Looking good! Top Contributors 40 Hevinalle 10 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}