{"link": "https://www.themoviedb.org/tv/9497?language=en", "title": "The Wonderful Wizard of Oz", "resume": "The Wonderful Wizard of Oz, known in Japan as Oz no Mahōtsukai is an anime adaptation based on four of the original Oz books by L. Frank Baum. In Japan, the series aired on NHK then TV Tokyo from 1986 to 1987. It consists of 52 episodes, which explain other parts of the Oz stories, including the events that happened after Dorothy first left Oz.\nIn 1987, HBO purchased the rights to the series and dubbed it into English. Production for the English version was done by the Canadian studio Cinar. Actress Margot Kidder was hired as narrator, and the Canadian band Parachute Club provided songs for the series, which aired as a mini-series. This English version attempted to completely occlude the show's Japanese origins, going so far as to remove all Japanese names and studios from the credits and to credit key aspects of the animation to Westerners, which applied primarily to the CGI opening sequence. Currently the English dub of series airs in the United States on the Cookie Jar Toons block on This TV.\nThe series has been aired in many countries outside Japan and has been dubbed in English, Spanish, Italian and numerous other languages.\nAside from having the same source material, this TV series bears no relation to the 1982 anime film directed by Fumihiko Takayama and produced by Yoshimitsu Banno for Toho, though both works share the same title in Japanese. However, since the 1982 film was not released in Japan until 1986 - the same year in which the TV series was first broadcast - the two productions are often confused.", "rate": 100, "genre": ["Animation"], "cast": ["Yoshito Yasuhara", "Naoko Kouda", "Margot Kidder", "Richard Dumont"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9497   Expand The Wonderful Wizard of Oz   (1987) User Score Overview The Wonderful Wizard of Oz, known in Japan as Oz no Mahōtsukai is an anime adaptation based on four of the original Oz books by L. Frank Baum. In Japan, the series aired on NHK then TV Tokyo from 1986 to 1987. It consists of 52 episodes, which explain other parts of the Oz stories, including the events that happened after Dorothy first left Oz. In 1987, HBO purchased the rights to the series and dubbed it into English. Production for the English version was done by the Canadian studio Cinar. Actress Margot Kidder was hired as narrator, and the Canadian band Parachute Club provided songs for the series, which aired as a mini-series. This English version attempted to completely occlude the show's Japanese origins, going so far as to remove all Japanese names and studios from the credits and to credit key aspects of the animation to Westerners, which applied primarily to the CGI opening sequence. Currently the English dub of series airs in the United States on the Cookie Jar Toons block on This TV. The series has been aired in many countries outside Japan and has been dubbed in English, Spanish, Italian and numerous other languages. Aside from having the same source material, this TV series bears no relation to the 1982 anime film directed by Fumihiko Takayama and produced by Yoshimitsu Banno for Toho, though both works share the same title in Japanese. However, since the 1982 film was not released in Japan until 1986 - the same year in which the TV series was first broadcast - the two productions are often confused. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshito Yasuhara Naoko Kouda Margot Kidder Richard Dumont Full Cast & Crew Last Season Season 2 — | 22 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Wonderful Wizard of Oz. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 Travis Bell 5 yuvalg72  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}