{"link": "https://www.themoviedb.org/tv/72218?language=en", "title": "Hello, Detective Hedgehog", "resume": "Detective Goro Nanase and his colleagues of \"Akatsuka Detective Office\" are based in Shimo-Akazuka of Itabashi-ku, Tokyo. The detectives take on a string of challenging cases that no one else wants to take on.", "rate": 0, "genre": ["Drama", "Mystery"], "cast": ["Eita", "Kyoko Fukada", "Go Morita", "Tomoko Yamaguchi", "Soichi Nakaoka"], "character": ["Goro Nanase", "Ranko Shidawara", "Kyusaku Kogure", "Kaoru Kaze"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72218   Expand Hello, Detective Hedgehog   (2017) User Score Overview Detective Goro Nanase and his colleagues of \"Akatsuka Detective Office\" are based in Shimo-Akazuka of Itabashi-ku, Tokyo. The detectives take on a string of challenging cases that no one else wants to take on. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eita Goro Nanase Kyoko Fukada Ranko Shidawara Go Morita Kyusaku Kogure Tomoko Yamaguchi Kaoru Kaze Soichi Nakaoka Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Hello, Detective Hedgehog premiered on July 14, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Hello, Detective Hedgehog. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hello, Detective Hedgehog. You can help by rating TV shows you've seen. Facts Original Name  ハロー張りネズミ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.tbs.co.jp/hello-harinezumi/ Genres Drama Mystery Keywords private detective Content Score 86 Almost there... Top Contributors 29 thirstyhippo 8 MagicFire 4 Terence Haejin Lee g 4 gashtoby  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}