{"link": "https://www.themoviedb.org/tv/43059?language=en", "title": "Heimat", "resume": "Heimat is the overall title of several series of films in 32 episodes written and directed by Edgar Reitz which view life in Germany between 1919 and 2000 through the eyes of a family from the Hunsrück area of the Rhineland. Personal and domestic life is set against glimpses of wider social and political events. The combined length of the 32 films is 53 hours and 25 minutes, making it one of the longest series of feature-length films in cinema history.\nThe title Heimat is a German word meaning \"homeland\". Its use is partly an ironic reference to the film genre known as Heimatfilm which was popular in Germany in the 1950s. Heimatfilms were noted for their rural settings, sentimental tone and simplistic morality.\nAesthetically, all three series are notable for their frequent switching between colour and black-and-white film to convey different emotional states.", "rate": 95, "genre": ["Drama"], "cast": ["Salome Kammer", "Henry Arnold"], "character": ["Clarissa Lichtblau", "Hermann Simon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43059   Expand Heimat   (1984) User Score Overview Heimat is the overall title of several series of films in 32 episodes written and directed by Edgar Reitz which view life in Germany between 1919 and 2000 through the eyes of a family from the Hunsrück area of the Rhineland. Personal and domestic life is set against glimpses of wider social and political events. The combined length of the 32 films is 53 hours and 25 minutes, making it one of the longest series of feature-length films in cinema history. The title Heimat is a German word meaning \"homeland\". Its use is partly an ironic reference to the film genre known as Heimatfilm which was popular in Germany in the 1950s. Heimatfilms were noted for their rural settings, sentimental tone and simplistic morality. Aesthetically, all three series are notable for their frequent switching between colour and black-and-white film to convey different emotional states. Featured Crew Edgar Reitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Salome Kammer Clarissa Lichtblau Henry Arnold Hermann Simon Full Cast & Crew Last Season Season 3 2004 | 6 Episodes Season 3 of Heimat premiered on December 15, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Heimat. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  120m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors ST 17 Super Tim m 11 mh667 R 7 Rebecca 6 adm1979  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}