{"link": "https://www.themoviedb.org/tv/11466?language=en", "title": "Kaamelott", "resume": "In this off beat account of King Arthur's quest for the Grail, virtually every journey, battle or adventure is stopped dead in its tracks by the knights of the round table's most worldly traits : cowardice, greed, idiocy or misplaced chivalry. As a consequence, instead of epic adventures we are treated with the characters' pragmatic and anachronistic take on each and every event in the Grail legend, true to the purest sitcom tradition.", "rate": 81, "genre": ["Drama", "Comedy"], "cast": ["Alexandre Astier", "Anne Girouard", "Audrey Fleurot", "Thomas Cousseau", "Franck Pitiot"], "character": ["Roi Arthur", "Guenièvre", "La Dame du Lac", "Lancelot", "Perceval"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11466   Expand Kaamelott   (2005) User Score  Play Trailer Overview In this off beat account of King Arthur's quest for the Grail, virtually every journey, battle or adventure is stopped dead in its tracks by the knights of the round table's most worldly traits : cowardice, greed, idiocy or misplaced chivalry. As a consequence, instead of epic adventures we are treated with the characters' pragmatic and anachronistic take on each and every event in the Grail legend, true to the purest sitcom tradition. Featured Crew Alexandre Astier Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  15 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexandre Astier Roi Arthur Anne Girouard Guenièvre Audrey Fleurot La Dame du Lac Thomas Cousseau Lancelot Franck Pitiot Perceval Full Cast & Crew Last Season Season 6 2009 | 9 Episodes Season 6 of Kaamelott premiered on October 17, 2009. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Kaamelott. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  4 Recommendations   2008-10-25 Hero Corp 6.8    2012-02-13 Kaboul Kitchen 8.0    2002-10-27 Caméra Café 6.8    2009-04-27 The Visitor from the Future 8.5    2011-08-29 Bref 8.2    2008-06-03 Scènes de ménages 6.2    1999-10-11 A Guy, a Girl 6.0    1998-10-24 H 7.6  Facts Status  Ended Network Certification NR Meaning No rating information. Type  Scripted Original Language  French Runtime  3m, 4m Homepage   http://www.kaamelott.com Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors c 37 chacal51 M 15 Manu 12 Arasu 9 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}