{"link": "https://www.themoviedb.org/tv/12916?language=en", "title": "The Littlest Hobo", "resume": "The Littlest Hobo is a Canadian television series based upon a 1958 American film of the same name directed by Charles R. Rondeau. The series first aired from 1963 to 1965 in syndication, spanning six seasons and was revived for a popular second run on CTV from October 11, 1979 to March 7, 1985. It starred an ownerless dog.\nAll three productions revolved around a stray German Shepherd, the titular Hobo, who wanders from town to town, helping people in need. Although the concept was perhaps similar to that of Lassie, the Littlest Hobo's destiny was to befriend those who apparently needed help. Despite the attempts of the many people whom he helped to adopt him, he appeared to prefer to be on his own, and would head off by himself at the end of each episode.\nNever actually named on-screen, the dog is often referred to by the name Hobo or by the names given by temporary human companions. Hobo's background is also unexplained on-screen. His origins, motivation and ultimate destination are also never explained.\nAlthough some characters appeared in more than one episode, the only constant was the Littlest Hobo himself.", "rate": 0, "genre": ["Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12916   Expand The Littlest Hobo   (1979) User Score Overview The Littlest Hobo is a Canadian television series based upon a 1958 American film of the same name directed by Charles R. Rondeau. The series first aired from 1963 to 1965 in syndication, spanning six seasons and was revived for a popular second run on CTV from October 11, 1979 to March 7, 1985. It starred an ownerless dog. All three productions revolved around a stray German Shepherd, the titular Hobo, who wanders from town to town, helping people in need. Although the concept was perhaps similar to that of Lassie, the Littlest Hobo's destiny was to befriend those who apparently needed help. Despite the attempts of the many people whom he helped to adopt him, he appeared to prefer to be on his own, and would head off by himself at the end of each episode. Never actually named on-screen, the dog is often referred to by the name Hobo or by the names given by temporary human companions. Hobo's background is also unexplained on-screen. His origins, motivation and ultimate destination are also never explained. Although some characters appeared in more than one episode, the only constant was the Littlest Hobo himself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 1982 | 18 Episodes Season 4 of The Littlest Hobo premiered on September 16, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Littlest Hobo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}