{"link": "https://www.themoviedb.org/tv/23022?language=en", "title": "Astro Boy", "resume": "In 2030 AD, after being abandoned by his creator, a young boy robot is rescued by an Android Advocate, Dr Elefun, who adopts him as his own and guides him in the use of his special powers to aid and protect mankind and robot-kind.", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Mari Shimizu", "Hisashi Katsuta", "Ichirō Nagai", "Katsuji Mori", "Masako Sugaya"], "character": ["Atom (voice)", "Dr. Ochanomizu (voice)", "Detective Tawashi (voice)", "Atlas (voice)", "Uran (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23022   Expand Astro Boy   (1980) User Score Overview In 2030 AD, after being abandoned by his creator, a young boy robot is rescued by an Android Advocate, Dr Elefun, who adopts him as his own and guides him in the use of his special powers to aid and protect mankind and robot-kind. Featured Crew Osamu Tezuka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  2 Featurettes  0 Opening Credits  2 Top Billed Cast Mari Shimizu Atom (voice) Hisashi Katsuta Dr. Ochanomizu (voice) Ichirō Nagai Detective Tawashi (voice) Katsuji Mori Atlas (voice) Masako Sugaya Uran (voice) Full Cast & Crew Last Season Astro Boy 1980 | 52 Episodes Season 1 of Astro Boy premiered on October  1, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Astro Boy. You can help by rating TV shows you've seen. Facts Original Name  鉄腕アトム Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.astroboy-online.com/wiki/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords boy superhero cartoon animation children robot 1980s anime Content Score 100 Yes! Looking good! Top Contributors 36 sykobanana t 29 tmdb983464 9 Ailurus Fulgens TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}