{"link": "https://www.themoviedb.org/tv/13269?language=en", "title": "Jane Eyre", "resume": "Jane Eyre is a 1983 British television serial adaptation of Charlotte Brontë's novel of the same name, produced by BBC and directed by Julian Amyes. The serial stars Zelah Clarke as the title character, and Timothy Dalton as Edward Rochester. Deene Park, located near Corby, Northamptonshire was used as the setting of Rochester's Thornfield Hall.", "rate": 69, "genre": ["Drama"], "cast": ["Carol Gillies", "James Marcus", "Jean Harvey", "Joolia Cappleman", "Eve Matheson"], "character": ["Grace Poole", "John", "Mrs. Fairfax", "Bertha", "Leah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13269   Expand Jane Eyre   (1983) User Score Overview Jane Eyre is a 1983 British television serial adaptation of Charlotte Brontë's novel of the same name, produced by BBC and directed by Julian Amyes. The serial stars Zelah Clarke as the title character, and Timothy Dalton as Edward Rochester. Deene Park, located near Corby, Northamptonshire was used as the setting of Rochester's Thornfield Hall. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carol Gillies Grace Poole James Marcus John Jean Harvey Mrs. Fairfax Joolia Cappleman Bertha Eve Matheson Leah Full Cast & Crew Last Season Miniseries 1983 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1996-11-17 The Tenant of Wildfell Hall 7.3    1999-11-28 Wives and Daughters 7.3    2008-10-26 Little Dorrit 7.7    2012-09-25 The Paradise 6.8    2008-09-14 Tess of the D'Urbervilles 7.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p00tcjq7 Genres Drama Keywords based on novel or book miniseries dark hero period drama governess costume drama Content Score 86 Almost there... Top Contributors TB 34 TMDb Bot R 9 Rebecca 8 Elizabeth Jennings 6 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}