{"link": "https://www.themoviedb.org/tv/56296?language=en", "title": "Orphan Black", "resume": "A streetwise hustler is pulled into a compelling conspiracy after witnessing the suicide of a girl who looks just like her.", "rate": 77, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Tatiana Maslany", "Jordan Gavaris", "Kevin Hanchard", "Kristian Bruun", "Ari Millen"], "character": ["Sarah / Cosima / Alison / Helena / Rachel", "Felix \"Fee\" Dawkins", "Detective Arthur \"Art\" Bell", "Donald \"Donnie\" Hendrix", "Mark / Rudy / Miller / Ira"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56296   Expand Orphan Black   (2013) User Score  Play Trailer Overview A streetwise hustler is pulled into a compelling conspiracy after witnessing the suicide of a girl who looks just like her. Featured Crew Graeme Manson Creator John Fawcett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  6 Images Backdrops  42 Posters  29 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tatiana Maslany Sarah / Cosima / Alison / Helena / Rachel Jordan Gavaris Felix \"Fee\" Dawkins Kevin Hanchard Detective Arthur \"Art\" Bell Kristian Bruun Donald \"Donnie\" Hendrix Ari Millen Mark / Rudy / Miller / Ira Full Cast & Crew Last Season Season 5 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  23 Subject Status Replies Last Reply Loved the Ending (Definitely Spoilers for Those Who Haven't Seen It) Open 5 by  SunParakeet a I think I'm done with this show. Open 22 by  Satai Delenn a What Rachel did to herself... Open 3 by  Satai Delenn Go to Discussions Media Most Popular Videos  1 Backdrops  42 Posters  29 Recommendations   2015-06-05 Sense8 7.7    2013-07-11 Orange Is the New Black 7.4    2013-04-04 Hannibal 7.7    2015-11-20 Marvel's Jessica Jones 7.6    2012-05-27 Continuum 7.1    2009-11-12 Misfits 7.7    2013-09-16 Sleepy Hollow 6.4    2008-09-09 Fringe 8.1  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://www.space.ca/show/orphan-black Genres Drama Sci-Fi & Fantasy Keywords sibling relationship experiment clone eugenics identity swap genetic enhancement Content Score 100 Yes! Looking good! Top Contributors 488 janar 57 Elizabeth Jennings R 44 Rebecca v 38 vahidSA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}