{"link": "https://www.themoviedb.org/tv/43418?language=en", "title": "Canaan", "resume": "Two years ago, Shibuya was ravaged by a biological terrorist  attack using the deadly Ua virus. Maria Osawa was saved when her father  inoculated her against the virus, but is left with partial amnesia from  the shock. She works as a cameraman when she reunites with a girl named  Canaan in Shanghai, China. A gifted assassin with synesthesia, she is  under orders from an unknown organization for a yet unspecified mission", "rate": 76, "genre": ["Animation", "Drama", "Action", "Adventure"], "cast": ["Miyuki Sawashiro", "Maaya Sakamoto", "Yoshino Nanjou", "Kenji Hamada", "Akio Otsuka"], "character": ["Canaan", "Alphard Al Shua", "Maria Oosawa", "Minoru Minorikawa", "Siam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43418   Expand Canaan   (2009) User Score Overview Two years ago, Shibuya was ravaged by a biological terrorist  attack using the deadly Ua virus. Maria Osawa was saved when her father  inoculated her against the virus, but is left with partial amnesia from  the shock. She works as a cameraman when she reunites with a girl named  Canaan in Shanghai, China. A gifted assassin with synesthesia, she is  under orders from an unknown organization for a yet unspecified mission Featured Crew Masahiro Ando Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyuki Sawashiro Canaan Maaya Sakamoto Alphard Al Shua Yoshino Nanjou Maria Oosawa Kenji Hamada Minoru Minorikawa Akio Otsuka Siam Full Cast & Crew Last Season Canaan 2009 | 13 Episodes Season 1 of Canaan premiered on July  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  7 Recommendations   2007-10-18 Ghost Hound 7.2    2010-04-02 Yamada's First Time: B Gata H Kei 7.5    2017-04-11 WorldEnd: What do you do at the end of the world? Are you busy? Will you save us? 8.8    2011-01-08 Freezing 7.4    2011-04-14 Aria the Scarlet Ammo 6.4    Sekirei Pure Engagement 8.2    2010-01-07 Dance in the Vampire Bund 7.0    2011-10-08 Ben-To 7.2  Facts Original Name  カナン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.canaan.jp/ Genres Animation Drama Action & Adventure Keywords assassin terrorist group virus anime Content Score 100 Yes! Looking good! Top Contributors r 23 rocman 7 Thxneo t 6 tmdb983464 6 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}