{"link": "https://www.themoviedb.org/tv/19338?language=en", "title": "South Pacific", "resume": "South Pacific is a British nature documentary series from the BBC Natural History Unit, which began airing on BBC Two on 10 May 2009. The six-part series surveys the natural history of the islands of the South Pacific region, including many of the coral atolls and New Zealand. It was filmed entirely in high-definition. South Pacific was co-produced by the Discovery Channel and the series producer was Huw Cordey. It is narrated by Benedict Cumberbatch. Filming took place over 18 months in a variety of remote locations around the Pacific including: Anuta, Banks Islands, French Frigate Shoals, Papua New Guinea, Palmyra, Kingman Reef, Tuvalu, Palau, Caroline Islands, Tuamotus and Tanna Island in Vanuatu.\nOn 6 May 2009, BBC Worldwide released a short clip of big wave surfer Dylan Longbottom surfing in slow motion, high-definition footage as a preview of the series, attracting extremely positive reactions on the video sharing website YouTube.\nThe series was released on DVD and Blu-ray Disc on 15 June 2009. At the end of each fifty-minute episode, a ten-minute featurette takes a behind-the-scenes look at the challenges of filming the series.\nThe series was released by Discovery International in the USA under the title Wild Pacific, with narration provided by Mike Rowe.", "rate": 81, "genre": ["Documentary"], "cast": ["Benedict Cumberbatch"], "character": ["Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19338   Expand South Pacific   (2009) User Score Overview South Pacific is a British nature documentary series from the BBC Natural History Unit, which began airing on BBC Two on 10 May 2009. The six-part series surveys the natural history of the islands of the South Pacific region, including many of the coral atolls and New Zealand. It was filmed entirely in high-definition. South Pacific was co-produced by the Discovery Channel and the series producer was Huw Cordey. It is narrated by Benedict Cumberbatch. Filming took place over 18 months in a variety of remote locations around the Pacific including: Anuta, Banks Islands, French Frigate Shoals, Papua New Guinea, Palmyra, Kingman Reef, Tuvalu, Palau, Caroline Islands, Tuamotus and Tanna Island in Vanuatu. On 6 May 2009, BBC Worldwide released a short clip of big wave surfer Dylan Longbottom surfing in slow motion, high-definition footage as a preview of the series, attracting extremely positive reactions on the video sharing website YouTube. The series was released on DVD and Blu-ray Disc on 15 June 2009. At the end of each fifty-minute episode, a ten-minute featurette takes a behind-the-scenes look at the challenges of filming the series. The series was released by Discovery International in the USA under the title Wild Pacific, with narration provided by Mike Rowe. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  12 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Benedict Cumberbatch Narrator (voice) Full Cast & Crew Last Season Miniseries 2009 | 6 Episodes Season 1 of South Pacific premiered on May 10, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for South Pacific. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  8 Recommendations   2009-02-11 Nature's Great Events 8.4    1991-08-11 Doug 7.0    1951-06-15 I Love Lucy 7.6    2001-09-12 The Blue Planet 8.4    1998-08-05 Whose Line Is It Anyway? 7.8  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m, 50m Homepage   http://www.bbc.co.uk/programmes/b00jq11g Genres Documentary Keywords island ocean pacific miniseries south pacific pacific  ocean nature documentary Content Score 64 We're so close, yet so far. Top Contributors TB 30 TMDb Bot R 13 Rebecca r 6 robko22 q 4 qmich  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}