{"link": "https://www.themoviedb.org/tv/61721?language=en", "title": "Mr. Back", "resume": "Mr. Baek is a successful hotelier who's more interested in hoarding his money than in enjoying his golden years. But in a strange turn of events, this classic scrooge gets a second chance at life when he wakes up as a younger version of himself (Shin Ha Kyun). With no way to prove his identity, Mr. Baek must enter his own company as a rookie and is forced to work his way up once again. With precious little time, Mr. Baek is given the opportunity to take stock of his life — and to give love a chance.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Shin Ha-kyun", "Jang Na-ra", "Lee Joon", "Jung Suk-won", "Park Ye-jin"], "character": ["Choi Go-bong / Choi Shin-hyun", "Eun Ha-soo", "Choi Dae-han", "Jung Yi-gun", "Hong Ji-yoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61721   Expand Mr. Back   (2014) User Score Overview Mr. Baek is a successful hotelier who's more interested in hoarding his money than in enjoying his golden years. But in a strange turn of events, this classic scrooge gets a second chance at life when he wakes up as a younger version of himself (Shin Ha Kyun). With no way to prove his identity, Mr. Baek must enter his own company as a rookie and is forced to work his way up once again. With precious little time, Mr. Baek is given the opportunity to take stock of his life — and to give love a chance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin Ha-kyun Choi Go-bong / Choi Shin-hyun Jang Na-ra Eun Ha-soo Lee Joon Choi Dae-han Jung Suk-won Jung Yi-gun Park Ye-jin Hong Ji-yoon Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Mr. Back premiered on November  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mr. Back. You can help by rating TV shows you've seen. Facts Original Name  미스터 백 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/mr/ Genres Drama Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 43 Maria180493 l 11 llluqiang CM 8 Cherche Moi 3 part-mozi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}