{"link": "https://www.themoviedb.org/tv/55582?language=en", "title": "Kodoku no Gurume", "resume": "Centered around typical Japanese food, a solitary salesman travelling through the country for business purposes, eats at its various establishments and experiences the various delicacies of Japanese cuisine.", "rate": 79, "genre": ["Drama"], "cast": ["Yutaka Matsushige"], "character": ["Goro Inogashira"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55582   Expand Kodoku no Gurume   (2012) User Score Overview Centered around typical Japanese food, a solitary salesman travelling through the country for business purposes, eats at its various establishments and experiences the various delicacies of Japanese cuisine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yutaka Matsushige Goro Inogashira Full Cast & Crew Current Season Season 7 2018 | 11 Episodes Season 7 of Kodoku no Gurume premiered on April  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Kodoku no Gurume. You can help by rating TV shows you've seen. Facts Original Name  孤独のグルメ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/kodokunogurume/ Genres Drama Keywords food based on manga gastronomy Content Score 56 We're so close, yet so far. Top Contributors 40 m17 13 Marr 🇳🇱 s 13 sylphd 8 Kyuhwan Kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}