{"link": "https://www.themoviedb.org/tv/2458?language=en", "title": "CSI: NY", "resume": "CSI: NY is an American police procedural television series that ran on CBS from September 22, 2004 to February 22, 2013 for a total of nine seasons and 197 original episodes. The show follows the investigations of a team of NYPD forensic scientists and police officers identified as \"Crime Scene Investigators\".", "rate": 67, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Carmine Giovinazzo", "Anna Belknap", "Robert Joy", "A.J. Buckley", "Hill Harper"], "character": ["Danny Messer", "Lindsay Monroe", "Sid Hammerback", "Adam Ross", "Sheldon Hawkes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2458   Expand CSI: NY   (2004) User Score Overview CSI: NY is an American police procedural television series that ran on CBS from September 22, 2004 to February 22, 2013 for a total of nine seasons and 197 original episodes. The show follows the investigations of a team of NYPD forensic scientists and police officers identified as \"Crime Scene Investigators\". Featured Crew Anthony Zuiker Creator Ann Donahue Creator Carol Mendelsohn Creator Jerry Bruckheimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  15 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carmine Giovinazzo Danny Messer Anna Belknap Lindsay Monroe Robert Joy Sid Hammerback A.J. Buckley Adam Ross Hill Harper Sheldon Hawkes Full Cast & Crew Last Season Season 9 2012 | 17 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply I loved this show, but... Open 0 by Bananaghost\n      \n     w Lindsay: Happy Birthday Anna Belknap! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  15 Posters  7 Recommendations   2002-09-23 CSI: Miami 5.8    2000-10-06 CSI: Crime Scene Investigation 6.7    2002-09-26 Without a Trace 6.8    2003-09-28 Cold Case 7.0    1990-09-13 Law & Order 7.2    2001-09-30 Law & Order: Criminal Intent 7.1    1997-09-08 Ally McBeal 5.9    1989-04-23 Baywatch 5.0  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.cbs.com/primetime/csi_ny/ Genres Crime Drama Mystery Keywords new york spin off nypd crime lab murder investigation crime investigation csi Content Score 93 Almost there... Top Contributors 76 Banana 65 seawolf 29 Ronnie Borgquist 16 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}