{"link": "https://www.themoviedb.org/tv/62244?language=en", "title": "Angry Mom", "resume": "When Jo Gang-Ja attended high school, she was notorious for fighting. She gave birth to her daughter A-Ran in her late teens and became more responsible. Her daughter A-Ran is now a high school student, but A-Ran is bullied at school. Jo Gang-Ja decides to go back to high school to protect her daughter. Jo Gang-Ja becomes a high school student again.", "rate": 83, "genre": ["Comedy", "Drama", "Family"], "cast": ["Kim Hee-seon", "Ji Hyun-woo", "Kim Yoo-jung", "Lim Hyung-jun", "Go Soo-hee"], "character": ["Jo Kang Ja", "Park Noh Ah", "Oh Ah Ran", "Oh Jin Sang", "Han Gong Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62244   Expand Angry Mom   (2015) User Score Overview When Jo Gang-Ja attended high school, she was notorious for fighting. She gave birth to her daughter A-Ran in her late teens and became more responsible. Her daughter A-Ran is now a high school student, but A-Ran is bullied at school. Jo Gang-Ja decides to go back to high school to protect her daughter. Jo Gang-Ja becomes a high school student again. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hee-seon Jo Kang Ja Ji Hyun-woo Park Noh Ah Kim Yoo-jung Oh Ah Ran Lim Hyung-jun Oh Jin Sang Go Soo-hee Han Gong Joo Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Angry Mom premiered on March 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  7 Recommendations   2017-07-17 The King in Love 5.4  Facts Original Name  앵그리맘 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/angm/ Genres Comedy Drama Family Keywords korea Content Score 86 Almost there... Top Contributors s 26 sandybilbo 19 Elizabeth Jennings M 17 Maria180493 m 8 mooseok.kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}