{"link": "https://www.themoviedb.org/tv/15536?language=en", "title": "Hamish Macbeth", "resume": "Hamish Macbeth is a comedy-drama series made by BBC Scotland and first aired in 1995. It is loosely based on a series of mystery novels by M. C. Beaton. The series concerns a local police officer, Constable Hamish Macbeth in the fictitious town of Lochdubh on the west coast of Scotland. The titular character was played by Robert Carlyle. It ran for three series from 1995 to 1997, with the first two series having six episodes and the third having eight.", "rate": 70, "genre": ["Drama"], "cast": ["Shirley Henderson", "Robert Carlyle", "Ralph Riach", "Morag Hood", "James Young"], "character": ["Hamish Macbeth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15536   Expand Hamish Macbeth   (1995) User Score Overview Hamish Macbeth is a comedy-drama series made by BBC Scotland and first aired in 1995. It is loosely based on a series of mystery novels by M. C. Beaton. The series concerns a local police officer, Constable Hamish Macbeth in the fictitious town of Lochdubh on the west coast of Scotland. The titular character was played by Robert Carlyle. It ran for three series from 1995 to 1997, with the first two series having six episodes and the third having eight. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shirley Henderson Robert Carlyle Hamish Macbeth Ralph Riach Morag Hood James Young Full Cast & Crew Last Season Season 3 1997 | 8 Episodes Season 3 of Hamish Macbeth premiered on March 16, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hamish Macbeth. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords small town police scotland rural setting small town sheriff Content Score 86 Almost there... Top Contributors 11 Banana 4 Zlogorek 3 Elizabeth Jennings O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}