{"link": "https://www.themoviedb.org/tv/9795?language=en", "title": "The Jury", "resume": "Set in New York City, the series brings the viewer into the jury room to watch the deliberators try to answer the many questions posed during a trial. As facts are exposed through flashbacks of testimony and crime footage, viewers will form their own opinions about the guilt or innocence of the defendant. Following each verdict, a final flashback will let viewers see the crime as it actually happened and reveal whether or not the jury made the right decision.", "rate": 70, "genre": ["Drama"], "cast": ["Billy Burke", "Shalom Harlow", "Anna Friel", "Jeff Hephner", "Cote de Pablo"], "character": ["John Ranguso", "Melissa Greenfield", "Megan Delaney", "Keenan O'Brien", "Marguerite Cisneros"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9795   Expand The Jury   (2004) User Score Overview Set in New York City, the series brings the viewer into the jury room to watch the deliberators try to answer the many questions posed during a trial. As facts are exposed through flashbacks of testimony and crime footage, viewers will form their own opinions about the guilt or innocence of the defendant. Following each verdict, a final flashback will let viewers see the crime as it actually happened and reveal whether or not the jury made the right decision. Featured Crew James Yoshimura Creator Tom Fontana Creator Barry Levinson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Burke John Ranguso Shalom Harlow Melissa Greenfield Anna Friel Megan Delaney Jeff Hephner Keenan O'Brien Cote de Pablo Marguerite Cisneros Full Cast & Crew Last Season Season 1 2004 | 10 Episodes Season 1 of The Jury premiered on June  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Jury. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords trial jury courtroom Content Score 93 Almost there... Top Contributors 21 United600 3 Banana w 3 webmaster R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}