{"link": "https://www.themoviedb.org/tv/7985?language=en", "title": "Seth MacFarlane's Cavalcade of Cartoon Comedy", "resume": "Seth MacFarlane's Cavalcade of Cartoon Comedy is an American cartoon web series created by Seth MacFarlane. The series is based on the cutaway jokes on Family Guy.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Alex Borstein", "Alexandra Breckenridge", "Seth Green", "Rachael MacFarlane", "Phil LaMarr"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7985   Expand Seth MacFarlane's Cavalcade of Cartoon Comedy   (2008) User Score  Play Trailer Overview Seth MacFarlane's Cavalcade of Cartoon Comedy is an American cartoon web series created by Seth MacFarlane. The series is based on the cutaway jokes on Family Guy. Featured Crew Seth MacFarlane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex Borstein Alexandra Breckenridge Seth Green Rachael MacFarlane Phil LaMarr Full Cast & Crew Last Season Season 1 2008 | 50 Episodes Season 1 of Seth MacFarlane's Cavalcade of Cartoon Comedy premiered on September 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2000-01-14 Trigger Happy TV 7.3    2004-11-14 Tom Goes to the Mayor 7.2    2011-05-03 The Looney Tunes Show 7.0    2006-08-06 Metalocalypse 6.9    2004-10-27 Drawn Together 6.9    1998-09-01 The Wild Thornberrys 6.0    2000-12-30 Aqua Teen Hunger Force 7.2    1992-09-22 Beavis and Butt-head 6.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  1m Homepage   http://www.sethcomedy.com/ Genres Animation Comedy Keywords sketch comedy Content Score 100 Yes! Looking good! Top Contributors 12 TheOneManBoxOffice A 9 AnthonyAtkins232 7 demiansamuel 7 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}