{"link": "https://www.themoviedb.org/tv/80119?language=en", "title": "My Story For You", "resume": "It’s 1998, and Zhang Chang Gong gets his first taste of success as a developer in an IT company. At the same time, he meets and falls in love with Li Mu Zi, a kind and intelligent university student. Unfortunately the IT bubble soon bursts, and Zhang Chang Gong is left unemployed. With the help of his friends and family, Chang Gong faces the challenges head on, and eventually becomes a top-selling author.", "rate": 0, "genre": ["Drama"], "cast": ["Luo Jin", "Zheng Shuang", "Johnny Huang", "Zhang Yi Shang", "Pang Han Chen"], "character": ["Zhang Chang Gong", "Li Mu Zi", "Zhang Gong Wei", "Zhang Yao Yao", "Han Dong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80119   Expand My Story For You   (2018) User Score Overview It’s 1998, and Zhang Chang Gong gets his first taste of success as a developer in an IT company. At the same time, he meets and falls in love with Li Mu Zi, a kind and intelligent university student. Unfortunately the IT bubble soon bursts, and Zhang Chang Gong is left unemployed. With the help of his friends and family, Chang Gong faces the challenges head on, and eventually becomes a top-selling author. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luo Jin Zhang Chang Gong Zheng Shuang Li Mu Zi Johnny Huang Zhang Gong Wei Zhang Yi Shang Zhang Yao Yao Pang Han Chen Han Dong Full Cast & Crew Current Season Season 1 2018 | 18 Episodes Season 1 of My Story For You premiered on June 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Story For You. You can help by rating TV shows you've seen. Facts Original Name  为了你我愿意热爱整个世界 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords romance Content Score 86 Almost there... Top Contributors M 28 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}