{"link": "https://www.themoviedb.org/tv/35299?language=en", "title": "Supah Ninjas", "resume": "Supah Ninjas is an American action-comedy superhero series, created by Leo Chu and Eric Garcia. The series premiered as a special preview on Nickelodeon on January 17, 2011 in the United States and started airing regularly on April 16, 2011. On March 15, 2012, it was the announced that the series was renewed for a second season. The second season premiered on February 9, 2013, after a new episode of Marvin Marvin. It was announced on May 7, 2013 that the show will not be renewed for a third season.", "rate": 68, "genre": ["Action", "Adventure"], "cast": ["George Takei", "Gracie Dzienny", "Ryan Potter", "Carlos Knight"], "character": ["Hattori 'Hologramps' Fukanaga", "Amanda McKay", "Mike Fukanaga", "Owen Reynolds"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35299   Expand Supah Ninjas   (2011) User Score Overview Supah Ninjas is an American action-comedy superhero series, created by Leo Chu and Eric Garcia. The series premiered as a special preview on Nickelodeon on January 17, 2011 in the United States and started airing regularly on April 16, 2011. On March 15, 2012, it was the announced that the series was renewed for a second season. The second season premiered on February 9, 2013, after a new episode of Marvin Marvin. It was announced on May 7, 2013 that the show will not be renewed for a third season. Featured Crew Leo Chu Creator Eric Garcia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Takei Hattori 'Hologramps' Fukanaga Gracie Dzienny Amanda McKay Ryan Potter Mike Fukanaga Carlos Knight Owen Reynolds Full Cast & Crew Last Season Season 2 2013 | 13 Episodes Season 2 of Supah Ninjas premiered on February  9, 2013. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Mike: Happy Birthday Ryan Potter! Open 0 by wonder2wonder\n      \n     w Amanda: Happy Birthday Gracie Dzienny! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2016-11-11 MECH-X4 6.3    2015-09-12 Game Shakers 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.nick.com/shows/supah-ninjas/ Genres Action & Adventure Keywords martial arts ninja teenager Content Score 93 Almost there... Top Contributors 15 Banana s 3 speedycars 1 DarkMan V 1 VintageSmoke  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}