{"link": "https://www.themoviedb.org/tv/68267?language=en", "title": "Trollhunters", "resume": "After uncovering a mysterious amulet, an average teen assumes an unlikely destiny and sets out to save two worlds. Created by Guillermo del Toro.", "rate": 76, "genre": ["Family", "Animation", "Action", "Adventure", "Comedy"], "cast": ["Kelsey Grammer", "Charlie Saxton", "Lexi Medrano", "Ron Perlman", "Jonathan Hyde"], "character": ["Blinky (voice)", "Toby Domzalski (voice)", "Claire Nuñez (voice)", "Bular (voice)", "Mr. Strickler (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68267   Expand Trollhunters   (2016) User Score  Play Trailer Overview After uncovering a mysterious amulet, an average teen assumes an unlikely destiny and sets out to save two worlds. Created by Guillermo del Toro. Featured Crew Guillermo del Toro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelsey Grammer Blinky (voice) Charlie Saxton Toby Domzalski (voice) Lexi Medrano Claire Nuñez (voice) Ron Perlman Bular (voice) Jonathan Hyde Mr. Strickler (voice) Full Cast & Crew Current Season Part 3 2018 | 13 Episodes Season 3 of Trollhunters premiered on May 25, 2018. View All Seasons Social Reviews  2 Discussions  0 Featured Review A review by Reno  10.0 Written by  Reno  on February  4, 2018 It's time now for Gunmar to prepare to face the Trollhunters! SEASON 02: I don't know how to begin, because I loved the first season. The review was one of the longest I've ever written for any title. But this follow up season did not stand up to that standard. It's still a nice show with nice animation and all, I enjoyed watching it, though lesser. I don't know what made it fall slightly. Maybe the first season had awesome villains and adventures, which totally lacked in this. Angor Rot, Strickler, Nomura, NotEnrique, particularly Bular, the son of Gunmar was brilliant. If o...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  6 Posters  8 Recommendations   2015-12-24 Dawn of the Croods 6.6    2016-10-28 Skylanders Academy 7.3    2016-03-11 Netflix Presents: The Characters 5.0    2015-01-16 The Adventures of Puss in Boots 6.4    2016-11-07 The Sound of Your Heart 8.0    2011-02-08 Traffic Light 7.2    2017-01-09 Little Witch Academia 8.2    2004-01-28 Winx Club 4.7  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  25m Homepage   https://www.netflix.com/title/80075820 Genres Family Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 40 Elizabeth Jennings 36 TopKek 9 Ander33x 8 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}