{"link": "https://www.themoviedb.org/tv/4390?language=en", "title": "Roswell Conspiracies: Aliens, Myths and Legends", "resume": "Roswell Conspiracies: Aliens, Myths and Legends was an animated program, that originally aired in 1999 as part of BKN, the syndicated's cartoon programing block. The programming segment premiered in 1992. The show was part of BKN's drive to reinvent itself. The show's premise was that aliens had been living among humans for ages, and were the origins of many of the creatures humans know from myth, folklore and legends, including vampires and werewolves.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Mystery"], "cast": ["Janyse Jaud", "Saffron Henderson", "Scott McNeil", "Dale Wilson", "Peter Kelamis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4390   Expand Roswell Conspiracies: Aliens, Myths and Legends   (1999) User Score Overview Roswell Conspiracies: Aliens, Myths and Legends was an animated program, that originally aired in 1999 as part of BKN, the syndicated's cartoon programing block. The programming segment premiered in 1992. The show was part of BKN's drive to reinvent itself. The show's premise was that aliens had been living among humans for ages, and were the origins of many of the creatures humans know from myth, folklore and legends, including vampires and werewolves. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Janyse Jaud Saffron Henderson Scott McNeil Dale Wilson Peter Kelamis Full Cast & Crew Last Season The roswell conspiracies season 1 1999 | 40 Episodes Season 1 of Roswell Conspiracies: Aliens, Myths and Legends premiered on August 27, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Roswell Conspiracies: Aliens, Myths and Legends. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Mystery Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors TB 2 TMDb Bot A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}