{"link": "https://www.themoviedb.org/tv/49929?language=en", "title": "Bad Teacher", "resume": "An always inappropriate, fearless and unapologetic former trophy wife masquerades as a teacher in order to find a new man after her wealthy husband leaves her penniless.", "rate": 51, "genre": ["Comedy"], "cast": ["Ari Graynor", "Seth Lucas Bowen", "Sara Rodier", "Yara Shahidi", "Ava Allan"], "character": ["Meredith Davis", "Noah", "Lily", "Jalisa", "Bella"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49929   Expand Bad Teacher   (2014) User Score  Play Trailer Overview An always inappropriate, fearless and unapologetic former trophy wife masquerades as a teacher in order to find a new man after her wealthy husband leaves her penniless. Featured Crew Hilary Winston Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ari Graynor Meredith Davis Seth Lucas Bowen Noah Sara Rodier Lily Yara Shahidi Jalisa Ava Allan Bella Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 1 2014 | 13 Episodes Season 1 of Bad Teacher premiered on April 23, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2014-07-17 Married 6.3    2013-09-23 Trophy Wife 5.7    2012-09-25 Ben and Kate 5.9    2011-01-17 Harry's Law 6.7    2013-09-17 Dads 4.8    1994-09-12 Party of Five 6.3  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.cbs.com/shows/bad-teacher/ Genres Comedy Keywords blonde teacher high school teacher based on movie sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 15 Banana 10 Elizabeth Jennings TB 5 TMDb Bot s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}