{"link": "https://www.themoviedb.org/tv/62733?language=en", "title": "Stonemouth", "resume": "Based on Iain Banks's best-selling novel, this romantic mystery follows Stewart as he returns to his childhood home and tries to discover the truth behind his best friend's death.", "rate": 73, "genre": ["Drama"], "cast": ["Christian Cooke", "Charlotte Spencer", "Peter Mullan", "Gary Lewis", "Brian Gleeson"], "character": ["Stewart Gilmour", "Ellie Murston", "Don Murston", "Mike MacAvett", "Powell Imrie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62733   Expand Stonemouth   (2015) User Score Overview Based on Iain Banks's best-selling novel, this romantic mystery follows Stewart as he returns to his childhood home and tries to discover the truth behind his best friend's death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Cooke Stewart Gilmour Charlotte Spencer Ellie Murston Peter Mullan Don Murston Gary Lewis Mike MacAvett Brian Gleeson Powell Imrie Full Cast & Crew Last Season Miniseries 2015 | 2 Episodes Season 1 of Stonemouth premiered on June  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2015-06-10 The Interceptor 5.7  Facts Status  Ended Networks Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p02qxkvz Genres Drama Keywords secret suicide funeral scotland organized crime miniseries hometown Content Score 86 Almost there... Top Contributors 48 Elizabeth Jennings 17 Banana 12 Steve R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}