{"link": "https://www.themoviedb.org/tv/80020?language=en", "title": "Super Dragon Ball Heroes", "resume": "Trunks returns from the future to train with Goku and Vegeta. However, it disappears without warning. Then the mysterious Fu bursts in, telling them that Trunks has been imprisoned in the Prison Planet, a mysterious complex in an unknown place in the universes. The group seeks the dragon balls to free Trunks, but an endless battle awaits them! Will Goku and the others rescue Trunks and escape the Prison Planet?", "rate": 45, "genre": ["Action", "Adventure", "Animation", "Kids", "Comedy"], "cast": ["Masako Nozawa", "Ryou Horikawa", "Takeshi Kusao", "Eiko Yamada", "Kappei Yamaguchi"], "character": ["Son Goku / Xeno", "Vegeta", "Trunks", "Mai", "Fu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80020   Expand Super Dragon Ball Heroes   (2018) User Score  Play Trailer Overview Trunks returns from the future to train with Goku and Vegeta. However, it disappears without warning. Then the mysterious Fu bursts in, telling them that Trunks has been imprisoned in the Prison Planet, a mysterious complex in an unknown place in the universes. The group seeks the dragon balls to free Trunks, but an endless battle awaits them! Will Goku and the others rescue Trunks and escape the Prison Planet? Featured Crew Akira Toriyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Son Goku / Xeno Ryou Horikawa Vegeta Takeshi Kusao Trunks Eiko Yamada Mai Kappei Yamaguchi Fu Full Cast & Crew Current Season Prison Planet Saga 2018 | 25 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Super Dragon Ball Heroes. You can help by rating TV shows you've seen. Facts Original Name  ドラゴンボール ヒーローズ Status  In Production Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  Japanese Runtime  10m Homepage   http://www.carddass.com/dbh/sdbh/prison_planet/character.php Genres Action & Adventure Animation Kids Comedy Keywords miniseries dragon ball super dragon ball dragon ball heroes super dragon ball heroes Content Score 100 Yes! Looking good! Top Contributors 41 TopKek 4 Animexla D 4 Destr0y 4 Series Out  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}