{"link": "https://www.themoviedb.org/tv/64077?language=en", "title": "Marley's Ghosts", "resume": "Marley has a rare gift that comes with mixed blessings - she can talk to the dead, who sadly now include both her husband Adam, her lover Michael and her vicar… Awkward.", "rate": 70, "genre": ["Comedy"], "cast": ["Sarah Alexander", "John Hannah", "Jo Joyner", "Nicholas Burns"], "character": ["Marley", "Adam", "Vicar", "Michael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64077   Expand Marley's Ghosts   (2015) User Score  Play Trailer Overview Marley has a rare gift that comes with mixed blessings - she can talk to the dead, who sadly now include both her husband Adam, her lover Michael and her vicar… Awkward. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Alexander Marley John Hannah Adam Jo Joyner Vicar Nicholas Burns Michael Full Cast & Crew Last Season Season 2 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2014-03-21 Welcome to Sweden 6.3    2013-04-19 Alpha House 7.3    2015-06-08 Odd Mom Out 6.7    2014-09-04 Chasing Shadows 7.5    2015-09-30 You, Me and the Apocalypse 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://gold.uktv.co.uk/shows/marleys-ghosts Genres Comedy Keywords supernatural psychic power ghost british humour Content Score 93 Almost there... Top Contributors 19 CouchTater 15 Elizabeth Jennings 6 Banana 4 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}