{"link": "https://www.themoviedb.org/tv/69238?language=en", "title": "Broken Pieces", "resume": "A story about difficult choices, tough decisions, entwined lives and parents torn between their children and their hearts. Gulseren comes from a poor background, while Cihans wife Dilara is wealthy. They both gave birth in the same hospital on the same day 15 years ago but a mistake was made that would change their destinies. Having similar surnames, an absent-minded nurse mixed the babies and nobody noticed. As the truth about the children is revealed, fundamental problems arise between the two families because of their totally different lifestyles and economic statuses. However these events bring Cihan and Gulseren closer together. They have inexplicable feelings towards each other that they cannot run away from or ignore.", "rate": 67, "genre": ["Action", "Adventure", "Comedy", "Drama", "Family"], "cast": ["Ebru Özkan", "Burkan Tozkoparan", "Leyla Tanlar", "Alina Boz", "Civan Canova"], "character": ["Dilara", "Ozan", "Cansu", "Hazal", "Rahmi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69238   Expand Broken Pieces   (2014) User Score  Play Trailer Overview A story about difficult choices, tough decisions, entwined lives and parents torn between their children and their hearts. Gulseren comes from a poor background, while Cihans wife Dilara is wealthy. They both gave birth in the same hospital on the same day 15 years ago but a mistake was made that would change their destinies. Having similar surnames, an absent-minded nurse mixed the babies and nobody noticed. As the truth about the children is revealed, fundamental problems arise between the two families because of their totally different lifestyles and economic statuses. However these events bring Cihan and Gulseren closer together. They have inexplicable feelings towards each other that they cannot run away from or ignore. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ebru Özkan Dilara Burkan Tozkoparan Ozan Leyla Tanlar Cansu Alina Boz Hazal Civan Canova Rahmi Full Cast & Crew Last Season Season 3 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Broken Pieces. You can help by rating TV shows you've seen. Facts Original Name  Paramparça Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Action & Adventure Comedy Drama Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 39 zerox A 22 Alenp 16 Elizabeth Jennings 5 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}