{"link": "https://www.themoviedb.org/tv/8117?language=en", "title": "Cribb", "resume": "Cribb is a television police drama, which debuted in 1979 as a 90-minute TV film from Granada Television in the United Kingdom. Later, thirteen 50-minute episodes were produced, which ran from 1980-81.\nAdapted from Peter Lovesey's Sergeant Cribb novels and set in Victorian London around the time of the Jack the Ripper murders in 1888, Alan Dobie starred as the tough Detective Sergeant who worked for the newly formed Criminal Investigation Department, determined to remove crime from the streets of London using the latest detection methods.\nThe series portrayed life in Victorian England, and the programmes included many real historical events such as the publication of Jerome K. Jerome's Three Men in a Boat and the sale of London Zoo's famous elephant, Jumbo, to Barnum and Bailey's Circus. The stories included issues such as bare-knuckle prize fighting, spiritualism and Irish terrorism. Assisting Cribb was Detective Constable Thackery, played by William Simons.\nThe 1979 pilot episode was entitled Waxwork and featured Carol Royle and Susie Blake and was produced and directed by June Wyndham-Davies.", "rate": 0, "genre": ["Mystery", "Drama"], "cast": ["William Simons", "Alan Dobie", "David Waller", "Thorley Walters"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8117   Expand Cribb   (1979) User Score Overview Cribb is a television police drama, which debuted in 1979 as a 90-minute TV film from Granada Television in the United Kingdom. Later, thirteen 50-minute episodes were produced, which ran from 1980-81. Adapted from Peter Lovesey's Sergeant Cribb novels and set in Victorian London around the time of the Jack the Ripper murders in 1888, Alan Dobie starred as the tough Detective Sergeant who worked for the newly formed Criminal Investigation Department, determined to remove crime from the streets of London using the latest detection methods. The series portrayed life in Victorian England, and the programmes included many real historical events such as the publication of Jerome K. Jerome's Three Men in a Boat and the sale of London Zoo's famous elephant, Jumbo, to Barnum and Bailey's Circus. The stories included issues such as bare-knuckle prize fighting, spiritualism and Irish terrorism. Assisting Cribb was Detective Constable Thackery, played by William Simons. The 1979 pilot episode was entitled Waxwork and featured Carol Royle and Susie Blake and was produced and directed by June Wyndham-Davies. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Simons Alan Dobie David Waller Thorley Walters Full Cast & Crew Last Season Season 2 1981 | 6 Episodes Season 2 of Cribb premiered on March 29, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cribb. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Mystery Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}