{"link": "https://www.themoviedb.org/tv/32675?language=en", "title": "War and Remembrance", "resume": "War and Remembrance is an American miniseries based on the novel of the same name by Herman Wouk. It is the sequel to highly successful The Winds of War.", "rate": 78, "genre": ["Drama", "War", "Politics"], "cast": ["Robert Mitchum", "Victoria Tennant", "David Dukes", "Zevi Wolmark", "Robert Hardy"], "character": ["Capt. Victor 'Pug' Henry", "Pamela Tudsbury", "Leslie Slote", "John Simms", "Winston Churchill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32675   Expand War and Remembrance   (1988) User Score Overview War and Remembrance is an American miniseries based on the novel of the same name by Herman Wouk. It is the sequel to highly successful The Winds of War. Featured Crew Herman Wouk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Mitchum Capt. Victor 'Pug' Henry Victoria Tennant Pamela Tudsbury David Dukes Leslie Slote Zevi Wolmark John Simms Robert Hardy Winston Churchill Full Cast & Crew Last Season Season 1 1988 | 12 Episodes Season 1 of War and Remembrance premiered on November 13, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1983-02-06 The Winds of War 7.0    1982-09-20 Smiley's People 7.9    2008-03-05 The War 8.1    1992-12-06 A Touch of Frost 7.9    1971-09-17 The Persuaders! 8.0    1980-09-15 Shogun 7.5    1985-11-04 Edge of Darkness 8.4    1979-09-10 Tinker Tailor Soldier Spy 7.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  135m Homepage  - Genres Drama War & Politics Keywords war world war ii miniseries Content Score 93 Almost there... Top Contributors S 34 Samara 13 Banana TH 6 Thomas Hamstrup CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}