{"link": "https://www.themoviedb.org/tv/5874?language=en", "title": "Anne of Green Gables", "resume": "When Anne Shirley arrives at the Cuthbert’s Farm on Prince Edward Island, she is a precocious, romantic child, desperate to be loved, and highly sensitive about her red hair and homely looks. Anne moves from one mishap to another as her wild imagination and far-fetched antics combine to constantly bring trouble upon her shoulders.", "rate": 84, "genre": ["Drama", "Family"], "cast": ["Jonathan Crombie", "Colleen Dewhurst", "Charmion King", "Richard Farnsworth", "Megan Follows"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5874   Expand Anne of Green Gables   (1985) User Score  Play Trailer Overview When Anne Shirley arrives at the Cuthbert’s Farm on Prince Edward Island, she is a precocious, romantic child, desperate to be loved, and highly sensitive about her red hair and homely looks. Anne moves from one mishap to another as her wild imagination and far-fetched antics combine to constantly bring trouble upon her shoulders. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Crombie Colleen Dewhurst Charmion King Richard Farnsworth Megan Follows Full Cast & Crew Last Season Miniseries 1985 | 2 Episodes Season 1 of Anne of Green Gables premiered on November 30, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  2 Recommendations   1972-09-14 The Waltons 6.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://anneofgreengables.com/films/anne-of-green-gables/ Genres Drama Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 28 Banana 19 colonelgrant 6 Imzadi t 3 total1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}