{"link": "https://www.themoviedb.org/tv/44459?language=en", "title": "Save Me", "resume": "After choking on a hero sandwich in her kitchen and suffering a dramatic  near-death experience, Beth Harper - an absentee wife and mother - is revived  and claims she can now talk to God. Her teenage daughter, Emily, is horrified and her husband, Tom, is skeptical. To make matters worse,  Tom's ex-mistress, Carly McKenna, is in a coma after a close encounter with lightning in  the Harper's front yard.", "rate": 74, "genre": ["Comedy"], "cast": ["Anne Heche", "Michael Landes", "Alexandra Breckenridge", "Madison Davenport", "Heather Burns"], "character": ["Beth Harper", "Tom Harper", "Carly McKenna", "Emily Harper", "Jenna Dennings"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44459   Expand Save Me   (2013) User Score  Play Trailer Overview After choking on a hero sandwich in her kitchen and suffering a dramatic  near-death experience, Beth Harper - an absentee wife and mother - is revived  and claims she can now talk to God. Her teenage daughter, Emily, is horrified and her husband, Tom, is skeptical. To make matters worse,  Tom's ex-mistress, Carly McKenna, is in a coma after a close encounter with lightning in  the Harper's front yard. Featured Crew John Scott Shepherd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Heche Beth Harper Michael Landes Tom Harper Alexandra Breckenridge Carly McKenna Madison Davenport Emily Harper Heather Burns Jenna Dennings Full Cast & Crew Last Season Season 1 2013 | 7 Episodes Season 1 of Save Me premiered on May 23, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2010-09-19 Call Me Fitz 6.8    2010-09-22 Better With You 6.0    2014-02-23 Growing Up Fisher 5.9    2013-09-26 The Michael J. Fox Show 5.6    2012-09-26 The Neighbors 6.3    2012-09-11 The New Normal 5.2    2010-09-21 Running Wilde 6.8    2012-05-24 Men at Work 6.6  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m, 20m Homepage   http://www.nbc.com/save-me/ Genres Comedy Keywords reference to god sitcom Content Score 100 Yes! Looking good! Top Contributors 19 Banana 14 United600 s 5 speedycars a 3 adltata  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}