{"link": "https://www.themoviedb.org/tv/738?language=en", "title": "Welcome Back, Kotter", "resume": "Welcome Back, Kotter is an American television sitcom starring Gabe Kaplan and featuring a young John Travolta. Videotaped in front of a live studio audience, it originally aired on the ABC network from September 9, 1975, to June 8, 1979.", "rate": 73, "genre": ["Comedy"], "cast": ["Gabe Kaplan", "John Travolta", "John Sylvester White", "Ron Palillo", "Robert Hegyes"], "character": ["Gabe Kotter", "Vinnie Barbarino", "Arnold Horshack"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 738   Expand Welcome Back, Kotter   (1975) User Score Overview Welcome Back, Kotter is an American television sitcom starring Gabe Kaplan and featuring a young John Travolta. Videotaped in front of a live studio audience, it originally aired on the ABC network from September 9, 1975, to June 8, 1979. Featured Crew Gabe Kaplan Creator Alan Sacks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabe Kaplan Gabe Kotter John Travolta Vinnie Barbarino John Sylvester White Ron Palillo Arnold Horshack Robert Hegyes Full Cast & Crew Last Season Season 4 1978 | 23 Episodes Season 4 of Welcome Back, Kotter premiered on November 25, 1978. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply john travota Open 5 by  lantzn d Favorite sweathog? Open 2 by  Beetweenboards Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   1982-10-02 Newhart 7.4    1970-09-24 The Odd Couple 7.1    1975-01-18 The Jeffersons 6.7    1983-09-16 Webster 4.9    1976-01-27 Laverne & Shirley 6.7    1978-09-18 WKRP in Cincinnati 8.1    1984-01-04 Night Court 6.9    1977-01-14 Fantasy Island 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 Elizabeth Jennings S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}