{"link": "https://www.themoviedb.org/tv/3787?language=en", "title": "Chaotic", "resume": "Chaotic is originally a Danish trading card game. It expanded to an online game in America which then became a television program based on the game. The program is seen on 4Kids TV, Jetix, The CW4Kids, Cartoon Network and Disney XD. It was brought over to the United States from Denmark by Bryan C. Gannon and Chaotic USA Entertainment Group, and produced by Chaotic USA Entertainment Group, 4Kids Productions and Bardel Entertainment. The trading card game came out September 6, 2006 in the U.S. and Canada.\nEach card comes with a unique code which the owner can upload onto the Chaotic website. This allows the owner to trade and play on-line using his/her own card collection. The game was well known to be the only game with a TV show, an online game, and a TCG that were all integrated. However, the online game is currently closed.", "rate": 100, "genre": ["Animation"], "cast": ["Joshua Briggs", "J. David Brimmer", "Shawn Curran", "Booth Daniels", "Booth Daniels"], "character": ["Connor", "Raznus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3787   Expand Chaotic   (2006) User Score Overview Chaotic is originally a Danish trading card game. It expanded to an online game in America which then became a television program based on the game. The program is seen on 4Kids TV, Jetix, The CW4Kids, Cartoon Network and Disney XD. It was brought over to the United States from Denmark by Bryan C. Gannon and Chaotic USA Entertainment Group, and produced by Chaotic USA Entertainment Group, 4Kids Productions and Bardel Entertainment. The trading card game came out September 6, 2006 in the U.S. and Canada. Each card comes with a unique code which the owner can upload onto the Chaotic website. This allows the owner to trade and play on-line using his/her own card collection. The game was well known to be the only game with a TV show, an online game, and a TCG that were all integrated. However, the online game is currently closed. Featured Crew Martin Rauff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joshua Briggs J. David Brimmer Shawn Curran Booth Daniels Connor Booth Daniels Raznus Full Cast & Crew Last Season Season 3 2009 | 12 Episodes Season 3 of Chaotic premiered on October 31, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chaotic. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors M 58 MusicBussinessUK m 3 magoozin f 1 francoaldo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}