{"link": "https://www.themoviedb.org/tv/67683?language=en", "title": "Travelers", "resume": "Hundreds of years from now, the last surviving humans discover the means of sending consciousness back through time, directly into people in the 21st century. These \"travelers\" assume the lives of seemingly random people, while secretly working as teams to perform missions in order to save humanity from a terrible future.", "rate": 74, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Eric McCormack", "MacKenzie Porter", "Nesta Cooper", "Jared Abrahamson", "Reilly Dolman"], "character": ["Grant MacLaren", "Marcy Warton", "Carly Shannon", "Trevor Holden", "Philip Pearson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67683   Expand Travelers   (2016) User Score  Play Trailer Overview Hundreds of years from now, the last surviving humans discover the means of sending consciousness back through time, directly into people in the 21st century. These \"travelers\" assume the lives of seemingly random people, while secretly working as teams to perform missions in order to save humanity from a terrible future. Featured Crew Brad Wright Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric McCormack Grant MacLaren MacKenzie Porter Marcy Warton Nesta Cooper Carly Shannon Jared Abrahamson Trevor Holden Reilly Dolman Philip Pearson Full Cast & Crew Current Season Season 2 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply c Season 3 confirmed by Netflix Open 0 by chrisjdel\n      \n     c Second Season Begins (Spoilers) Open 2 by  chrisjdel c Second Season Dropped on Netflix (What an ending!) [Major spoilers, obviously] Open 0 by chrisjdel\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  6 Recommendations   2016-01-14 Colony 6.8    2016-10-05 Frequency 7.3    2016-10-03 Timeless 7.0    2016-12-16 The OA 7.3    2015-12-14 The Expanse 7.5    2015-06-05 Sense8 7.7    2015-06-12 Dark Matter 6.3    2016-11-30 Incorporated 6.1  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://showcase.ca/travelers Genres Drama Sci-Fi & Fantasy Keywords time travel time traveler north america Content Score 100 Yes! Looking good! Top Contributors 87 Elizabeth Jennings 50 Banana VA 8 Viktor Andersson a 6 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}