{"link": "https://www.themoviedb.org/tv/77041?language=en", "title": "The Final Cut", "resume": "Urquhart aims to secure his legacy on the international stage, but faces threats both from abroad and closer to home.", "rate": 87, "genre": [], "cast": ["Ian Richardson", "Diane Fletcher", "Paul Freeman", "Isla Blair", "Nickolas Grace"], "character": ["Francis Urquhart", "Elizabeth Urquhart", "Tom Makepeace", "Claire Carlsen", "Geoffrey Booza Pitt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77041   Expand The Final Cut   (1990) User Score Overview Urquhart aims to secure his legacy on the international stage, but faces threats both from abroad and closer to home. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Richardson Francis Urquhart Diane Fletcher Elizabeth Urquhart Paul Freeman Tom Makepeace Isla Blair Claire Carlsen Nickolas Grace Geoffrey Booza Pitt Full Cast & Crew Last Season Miniseries 1990 | 4 Episodes Season 1 of The Final Cut premiered on November 18, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1993-11-21 To Play the King 8.6  Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://www.bbc.co.uk/programmes/p0114csn Genres No genres have been added. Keywords prime minister miniseries political thriller house of commons house of cards Content Score 64 We're so close, yet so far. Top Contributors TB 32 TMDb Bot 14 Banana K 1 KSUMovieGuy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}