{"link": "https://www.themoviedb.org/tv/63532?language=en", "title": "Sealed with a Kiss", "resume": "Orphaned as a child, TongXue lives under the care of her maternal uncle. While she was working at a cafe, she caught the attention and attraction of Mo ShaoQian, CEO of YuanZhong Corporation. Little does she know that her father once betrayed YuanZhong Corporation by selling classified business details to a rival and indirectly caused Mo ShaoQian's father death. \nTongXue's father's betrayal plunged YuanZhong Corporation into a serious crisis and ShaoQian was forced to enter a political marriage with Mu YongFei, heiress to Mu Corporation, in order save his father's company. On their wedding night, ShaoQian became repulsed by YongFei's possessive, condescending attitude, and could not stand to live under the same roof with her. ShaoQian continuously sought to divorce Yongfei for the next ten years, but she resolutely refused despite both leading separate lives and being in a nominal marriage. \nAfter ShaoQian discovers TongXue's identity, he seeks to avenge his father's death. ShaoQian uses criminal evidence (embezzlement) against TongXue's uncle to blackmail her to live with him as his mistress. As ShaoQian gets to know TongXue, he begins to harbor very conflicted feelings for her. On the surface, he treats TongXue coldly and toys with her emotions. Secretively, ShaoQian cannot help himself but falls hopelessly in with love her and wants to protect her... But will TongXue be able to let go of her childhood sweetheart and reciprocates his feelings?", "rate": 0, "genre": ["Drama"], "cast": ["Hawick Lau", "Ying Er"], "character": ["Mo Shao Qian", "Tong Xue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63532   Expand Sealed with a Kiss   (2011) User Score Overview Orphaned as a child, TongXue lives under the care of her maternal uncle. While she was working at a cafe, she caught the attention and attraction of Mo ShaoQian, CEO of YuanZhong Corporation. Little does she know that her father once betrayed YuanZhong Corporation by selling classified business details to a rival and indirectly caused Mo ShaoQian's father death.  TongXue's father's betrayal plunged YuanZhong Corporation into a serious crisis and ShaoQian was forced to enter a political marriage with Mu YongFei, heiress to Mu Corporation, in order save his father's company. On their wedding night, ShaoQian became repulsed by YongFei's possessive, condescending attitude, and could not stand to live under the same roof with her. ShaoQian continuously sought to divorce Yongfei for the next ten years, but she resolutely refused despite both leading separate lives and being in a nominal marriage.  After ShaoQian discovers TongXue's identity, he seeks to avenge his father's death. ShaoQian uses criminal evidence (embezzlement) against TongXue's uncle to blackmail her to live with him as his mistress. As ShaoQian gets to know TongXue, he begins to harbor very conflicted feelings for her. On the surface, he treats TongXue coldly and toys with her emotions. Secretively, ShaoQian cannot help himself but falls hopelessly in with love her and wants to protect her... But will TongXue be able to let go of her childhood sweetheart and reciprocates his feelings? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hawick Lau Mo Shao Qian Ying Er Tong Xue Full Cast & Crew Last Season Season 1 2011 | 28 Episodes Season 1 of Sealed with a Kiss premiered on October 22, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sealed with a Kiss. You can help by rating TV shows you've seen. Facts Original Name  千山暮雪 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors M 23 Maria180493 4 Elizabeth Jennings TB 2 TMDb Bot 1 prostapostei  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}