{"link": "https://www.themoviedb.org/tv/62054?language=en", "title": "Seven Days of a Daddy and a Daughter", "resume": "This home comedy tells the story of Kyoichiro and his teenage daughter Koume. One day, the two ride a train together after visiting Kyoichiro's mother-in-law. He sees it as a chance to get to know his daughter better, but he ends up getting more than that - by some mysterious force, both Kyoichiro and Koume end up with their mind in the other's body! Unfortunately, they have no choice but to swap lives, pretending to be each other at school and work.", "rate": 55, "genre": ["Family", "Drama", "Comedy"], "cast": ["Yui Aragaki", "Hiroshi Tachi", "Mayumi Sada", "Shigeaki Kato"], "character": ["Mika"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62054   Expand Seven Days of a Daddy and a Daughter   (2007) User Score Overview This home comedy tells the story of Kyoichiro and his teenage daughter Koume. One day, the two ride a train together after visiting Kyoichiro's mother-in-law. He sees it as a chance to get to know his daughter better, but he ends up getting more than that - by some mysterious force, both Kyoichiro and Koume end up with their mind in the other's body! Unfortunately, they have no choice but to swap lives, pretending to be each other at school and work. Featured Crew Mahoko Takanari Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Aragaki Mika Hiroshi Tachi Mayumi Sada Shigeaki Kato Full Cast & Crew Last Season Season 1 2007 | 7 Episodes Season 1 of Seven Days of a Daddy and a Daughter premiered on July  1, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Seven Days of a Daddy and a Daughter. You can help by rating TV shows you've seen. Facts Original Name  パパとムスメの7日間 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres Family Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 25 taxigps 7 Kyuhwan Kim 6 Elizabeth Jennings NS 3 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}