{"link": "https://www.themoviedb.org/tv/61078?language=en", "title": "Charming Deception", "resume": "The Vichawayt were a wealthy family. They have a big house and are owners of a big corporation, a construction company but once their parents died via a vehicle accident the three remaining children were left to face this important twist of faith in their lives. Asit, the older brother of the family and his wife, Lalita took over the family’s construction business. Orncha, the second sister took care of everything in the household. Arnus, the youngest sister studied in England but because of the changes in her financial state Nus has to find a benefactor to finance her education – she received aid from Pa, an old man named Chart from Thailand. Chart felt a familiar connection with Nus who reminded him of his daughter whom life was cut short by a car accident. She too was named Nus.\nSubsequently, the Vichawayt’s contruction company will be hired by a young millionaire magnate named Krao Supagan who offered the company a contract to build a grand hotel costing several hundreds millions bahts. Arnus came back to Thailand with her best friend, Gonwik and met Krao who went to pick Wik up at the airport for the first time. Because Krao and Wik have feeling for one another it was not surprising that Krao and Nus were to meet each other often at Wik’s house. (Krao is actually Wik’s distance relative whom she is secretly in love with. She called him Uncle Krao.) Nus saw Krao as an enigma, a strange person but she missed him when he’s not around. Nus’s feeling for Chaithong, her boyfriend changed for when he offered her marriage Nus refused and declared she’s not ready yet.\nThen Chart fell sick – it was revealed to Nus that her Pa is actually Krao’s uncle. Arnus accepted to be Chart’s caretaker which went according to Krao’s plan. Krao then continued on with his scheme by going after Orncha and Lalita, every woman of the Vichawayt will be under his wrath.\nThe situation got worst for the Vichawayt when debt collectors came after their family home, if they didn’t pay up their house will get seize. Krao helped the family by giving them 20 million baht to borrow but because the money was his the house became his property.\nThen Asit got into an accident giving Krao the opportunity to get close to his wife. Krao had an affair with Lalita and the two were seem by Chaithong who brought the news to Arnus. Arnus hated Krao and was disappointed by the conduct of the two.\nAs for Orncha, Krao brought her stuffs and flirted heavily with her. He told her to break up with Pharop, her lover. Orn believed him and broke up with her boyfriend. Once Arnus found out about the break up she told Krao to stop his involvements with her sister and sister-in-law. Krao then offered her marriage as a solution which she agreed because she felt sorry for her brother and wanted to help her sister who used to say she hated Krao but has now fallen in love with him. Both Lalita and Orncha were sadden and upset by this news. Orn quietly married Pharop as a result of her grief over Krao. As for Wik, she was very hurt by her best friend’s wedding to Krao that she went to live in America with her family.\nKrao gave Nus a one year contract in the marriage before he can divorce her, a promise he made to his uncle who knew why he wanted to marry her. On their wedding night Krao proceeded with his plan and raped Nus to be his wife. He also told her his reason for doing so – he revealed to her that the Vichawayt family deserved all of this because his mom was raped by her dad. Nus’s dad raped a woman despite knowing that she already has a son and husband and that husband was none other than his old friend, the man that helped him to richness with his business. His mother was hurt – being overwhelmed with shame she committed suicide.\nLalita still have feeling for Krao, after she divorced her husband she tried to seduce Krao but he got angry with her. He found her repulsive. He scolded her harshly and asked her if she still remember Chewit or not, the guy who got his heart broken by her and committed suicide as a result of that heartache. Chewit was Krao’s younger brother, everything Krao did to Lalita was out of revenge not love. Krao told Lalita that she’s nothing to him but a cheap woman. Furious and hurt by his words Lalita took out a gun to shoot Krao but Nus took the bullet for him instead landing her in a critical condition in the hospital.\nTimes passed by, Orn gave birth to her first child with Pharop, Asit went to America to gain work experience, Lalita was sentenced to jail time for her crime, and Anus made a complete recovery from being shot. Krao told Arnus about his feeling for her, the truth was that he love the angel named Arnus.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Sukollawat Kanarot", "Davika Hoorne", "Hana Lewis", "Atichanan Seesaywok", "Kannaporn Puangtong"], "character": ["Krao", "Arnus/Nus", "Tarin/Rin", "Nok", "Oun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61078   Expand Charming Deception   (2013) User Score Overview The Vichawayt were a wealthy family. They have a big house and are owners of a big corporation, a construction company but once their parents died via a vehicle accident the three remaining children were left to face this important twist of faith in their lives. Asit, the older brother of the family and his wife, Lalita took over the family’s construction business. Orncha, the second sister took care of everything in the household. Arnus, the youngest sister studied in England but because of the changes in her financial state Nus has to find a benefactor to finance her education – she received aid from Pa, an old man named Chart from Thailand. Chart felt a familiar connection with Nus who reminded him of his daughter whom life was cut short by a car accident. She too was named Nus. Subsequently, the Vichawayt’s contruction company will be hired by a young millionaire magnate named Krao Supagan who offered the company a contract to build a grand hotel costing several hundreds millions bahts. Arnus came back to Thailand with her best friend, Gonwik and met Krao who went to pick Wik up at the airport for the first time. Because Krao and Wik have feeling for one another it was not surprising that Krao and Nus were to meet each other often at Wik’s house. (Krao is actually Wik’s distance relative whom she is secretly in love with. She called him Uncle Krao.) Nus saw Krao as an enigma, a strange person but she missed him when he’s not around. Nus’s feeling for Chaithong, her boyfriend changed for when he offered her marriage Nus refused and declared she’s not ready yet. Then Chart fell sick – it was revealed to Nus that her Pa is actually Krao’s uncle. Arnus accepted to be Chart’s caretaker which went according to Krao’s plan. Krao then continued on with his scheme by going after Orncha and Lalita, every woman of the Vichawayt will be under his wrath. The situation got worst for the Vichawayt when debt collectors came after their family home, if they didn’t pay up their house will get seize. Krao helped the family by giving them 20 million baht to borrow but because the money was his the house became his property. Then Asit got into an accident giving Krao the opportunity to get close to his wife. Krao had an affair with Lalita and the two were seem by Chaithong who brought the news to Arnus. Arnus hated Krao and was disappointed by the conduct of the two. As for Orncha, Krao brought her stuffs and flirted heavily with her. He told her to break up with Pharop, her lover. Orn believed him and broke up with her boyfriend. Once Arnus found out about the break up she told Krao to stop his involvements with her sister and sister-in-law. Krao then offered her marriage as a solution which she agreed because she felt sorry for her brother and wanted to help her sister who used to say she hated Krao but has now fallen in love with him. Both Lalita and Orncha were sadden and upset by this news. Orn quietly married Pharop as a result of her grief over Krao. As for Wik, she was very hurt by her best friend’s wedding to Krao that she went to live in America with her family. Krao gave Nus a one year contract in the marriage before he can divorce her, a promise he made to his uncle who knew why he wanted to marry her. On their wedding night Krao proceeded with his plan and raped Nus to be his wife. He also told her his reason for doing so – he revealed to her that the Vichawayt family deserved all of this because his mom was raped by her dad. Nus’s dad raped a woman despite knowing that she already has a son and husband and that husband was none other than his old friend, the man that helped him to richness with his business. His mother was hurt – being overwhelmed with shame she committed suicide. Lalita still have feeling for Krao, after she divorced her husband she tried to seduce Krao but he got angry with her. He found her repulsive. He scolded her harshly and asked her if she still remember Chewit or not, the guy who got his heart broken by her and committed suicide as a result of that heartache. Chewit was Krao’s younger brother, everything Krao did to Lalita was out of revenge not love. Krao told Lalita that she’s nothing to him but a cheap woman. Furious and hurt by his words Lalita took out a gun to shoot Krao but Nus took the bullet for him instead landing her in a critical condition in the hospital. Times passed by, Orn gave birth to her first child with Pharop, Asit went to America to gain work experience, Lalita was sentenced to jail time for her crime, and Anus made a complete recovery from being shot. Krao told Arnus about his feeling for her, the truth was that he love the angel named Arnus. Featured Crew DaraVDO Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sukollawat Kanarot Krao Davika Hoorne Arnus/Nus Hana Lewis Tarin/Rin Atichanan Seesaywok Nok Kannaporn Puangtong Oun Full Cast & Crew Last Season Season 1 2013 | 18 Episodes Season 1 of Charming Deception premiered on February 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Charming Deception. You can help by rating TV shows you've seen. Facts Original Name  ร้อยเล่ห์เสน่ห์ลวง Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  96m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 44 Crip TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}