{"link": "https://www.themoviedb.org/tv/36368?language=en", "title": "Successful Story of a Bright Girl", "resume": "Jang Na Ra plays a cute and innocent country girl who often daydreams of rescuing her prince. One day, she meets Jang Hyuk who accidentally falls into her bath tub while she was taking her bath. Not off to a good start they started arguing over the matter. However, the story goes on to tell how Jang Nara arrives in the big city due to her plan to settle her irresponsible parents' debts. She moves into Jang Hyuk's house as a hired servant hence begins to teach the rich spoiled brat (Jang Hyuk) some manners through her down to earth scoldings and no-nonsense attitude. This drama gets totally hilarious in many scenes where Jang Nara and Jang Hyuk's combination comes out as refreshingly cute. Jang Hyuk plays a rich and proud man who inherits his father's business (Snowy Cosmetics) but is later betrayed by his own cousin and uncle leading to his downfall. On the other hand, Jang Nara plays a girl that he meets who help him pick up the pieces in his life, from defeat to success. A very well written drama with a story many will enjoy!\nSource: k-fever.com", "rate": 0, "genre": ["Drama"], "cast": ["Han Eun-jung", "Jang Na-ra", "Jang Hyuk", "Choo Ja-hyun", "Yoon Tae-young"], "character": ["Hwang Bo-bae", "Song Seok-gu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36368   Expand Successful Story of a Bright Girl   (2002) User Score Overview Jang Na Ra plays a cute and innocent country girl who often daydreams of rescuing her prince. One day, she meets Jang Hyuk who accidentally falls into her bath tub while she was taking her bath. Not off to a good start they started arguing over the matter. However, the story goes on to tell how Jang Nara arrives in the big city due to her plan to settle her irresponsible parents' debts. She moves into Jang Hyuk's house as a hired servant hence begins to teach the rich spoiled brat (Jang Hyuk) some manners through her down to earth scoldings and no-nonsense attitude. This drama gets totally hilarious in many scenes where Jang Nara and Jang Hyuk's combination comes out as refreshingly cute. Jang Hyuk plays a rich and proud man who inherits his father's business (Snowy Cosmetics) but is later betrayed by his own cousin and uncle leading to his downfall. On the other hand, Jang Nara plays a girl that he meets who help him pick up the pieces in his life, from defeat to success. A very well written drama with a story many will enjoy! Source: k-fever.com Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Eun-jung Jang Na-ra Jang Hyuk Choo Ja-hyun Hwang Bo-bae Yoon Tae-young Song Seok-gu Full Cast & Crew Last Season Season 1 2002 | 14 Episodes Season 1 of Successful Story of a Bright Girl premiered on March 13, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Successful Story of a Bright Girl. You can help by rating TV shows you've seen. Facts Original Name  명랑소녀 성공기 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors N 28 Nightowl.Kr s 7 sheva_vitali 2 Elizabeth Jennings t 2 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}