{"link": "https://www.themoviedb.org/tv/1370?language=en", "title": "Scully", "resume": "Scully was a British television drama with some comedy elements set in the city of Liverpool, England, that originated from a BBC Play For Today episode \"Scully's New Years Eve\". Originally broadcast on Channel Four in 1984, the single series was spread over six half-hour episodes plus a one-hour final episode. It was written by playwright Alan Bleasdale. The drama is notable for featuring many of the Liverpool football club first-team squad of that era.\nFrancis Scully is a teenage boy who has his heart set on gaining a trial match for Liverpool to hopefully fulfil his ambition of playing for the club. Francis, in everyday situations during his waking hours, occasionally \"sees\" famous Liverpool players such as Kenny Dalglish when they are not really there. These dream-like sequences recur throughout the episodes.\nThe main plotline is the efforts of Scully's school teachers to persuade Scully to appear in the school pantomime which they attempt by promising him a trial with his beloved Liverpool if he will cooperate. When Scully and his friends are not in school making trouble for the teachers and the school caretaker, they are seen roaming the local streets upsetting the neighbours and getting into trouble with the police. Scully sometimes has visions of the school caretaker appearing as a vampire due to the caretaker's nickname being Dracula. These frequent waking dream sequences give the show a somewhat surreal atmosphere.", "rate": 40, "genre": ["Comedy", "Drama"], "cast": ["Andrew Schofield", "Ray Kingsley", "Elvis Costello", "Sam Kelly", "Tom Georgeson"], "character": ["Franny Scully", "'Mooey' Morgan", "Henry Scully", "Brady", "Isaiah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1370   Expand Scully   (1984) User Score Overview Scully was a British television drama with some comedy elements set in the city of Liverpool, England, that originated from a BBC Play For Today episode \"Scully's New Years Eve\". Originally broadcast on Channel Four in 1984, the single series was spread over six half-hour episodes plus a one-hour final episode. It was written by playwright Alan Bleasdale. The drama is notable for featuring many of the Liverpool football club first-team squad of that era. Francis Scully is a teenage boy who has his heart set on gaining a trial match for Liverpool to hopefully fulfil his ambition of playing for the club. Francis, in everyday situations during his waking hours, occasionally \"sees\" famous Liverpool players such as Kenny Dalglish when they are not really there. These dream-like sequences recur throughout the episodes. The main plotline is the efforts of Scully's school teachers to persuade Scully to appear in the school pantomime which they attempt by promising him a trial with his beloved Liverpool if he will cooperate. When Scully and his friends are not in school making trouble for the teachers and the school caretaker, they are seen roaming the local streets upsetting the neighbours and getting into trouble with the police. Scully sometimes has visions of the school caretaker appearing as a vampire due to the caretaker's nickname being Dracula. These frequent waking dream sequences give the show a somewhat surreal atmosphere. Featured Crew Alan Bleasdale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Schofield Franny Scully Ray Kingsley 'Mooey' Morgan Elvis Costello Henry Scully Sam Kelly Brady Tom Georgeson Isaiah Full Cast & Crew Last Season Season 1 1984 | 7 Episodes Season 1 of Scully premiered on May 14, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Scully. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage  - Genres Comedy Drama Keywords high school england sport liverpool miniseries soccer teenager Content Score 93 Almost there... Top Contributors TB 36 TMDb Bot 11 Banana R 6 Rebecca 2 Markxist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}