{"link": "https://www.themoviedb.org/tv/45884?language=en", "title": "BOSS", "resume": "Osawa Eriko is a beautiful career woman who has just returned from training in the U.S. and is appointed as the \"boss\" of this division. But despite her intelligence and capabilities, she can never understand a man's heart, so she remains unable to find a husband.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Yuki Amami", "Tetsuji Tamayama", "Yutaka Takenouchi", "Erika Toda", "Kendo Kobayashi"], "character": ["Eriko Osawa", "Takuma Katagiri", "Shinjiro Nodate", "Mami Kimoto", "Zenji Iwai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45884   Expand BOSS   (2009) User Score Overview Osawa Eriko is a beautiful career woman who has just returned from training in the U.S. and is appointed as the \"boss\" of this division. But despite her intelligence and capabilities, she can never understand a man's heart, so she remains unable to find a husband. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuki Amami Eriko Osawa Tetsuji Tamayama Takuma Katagiri Yutaka Takenouchi Shinjiro Nodate Erika Toda Mami Kimoto Kendo Kobayashi Zenji Iwai Full Cast & Crew Last Season Season 2 2011 | 11 Episodes Season 2 of BOSS premiered on April 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on BOSS. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage  - Genres Crime Drama Keywords crime police detective Content Score 86 Almost there... Top Contributors A 68 Aka75 15 Wendy 4 thirstyhippo 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}