{"link": "https://www.themoviedb.org/tv/8546?language=en", "title": "Battlestar Galactica: The Face of the Enemy", "resume": "Battlestar Galactica: The Face of the Enemy is a ten-part series of webisodes that was broadcast in the mid-season break of season 4 of Battlestar Galactica. The episodes are between 3 and 6 minutes in length, with two released per week. The series was written by Jane Espenson and Seamus Kevin Fahey.\nThe episodes were released in the break between \"Revelations\" and \"Sometimes a Great Notion\", but are set in between \"Sometimes a Great Notion\" and the following episode, \"A Disquiet Follows My Soul\", and are noteworthy for providing the origins of Lt. Gaeta's attempted coup in the upcoming episodes, as well as revealing that he and Lt. Hoshi are romantically involved.\nIn March 2009 the series won several Streamy Awards: Best Dramatic Web Series, Best Writing for a Dramatic Web Series, and Best Male Actor in a Dramatic Web Series for Alessandro Juliani. The series was also nominated for an Emmy Award in the Short-format Live-action Entertainment Program category.", "rate": 80, "genre": ["Science", "Fiction", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8546   Expand Battlestar Galactica: The Face of the Enemy   (2008) User Score Overview Battlestar Galactica: The Face of the Enemy is a ten-part series of webisodes that was broadcast in the mid-season break of season 4 of Battlestar Galactica. The episodes are between 3 and 6 minutes in length, with two released per week. The series was written by Jane Espenson and Seamus Kevin Fahey. The episodes were released in the break between \"Revelations\" and \"Sometimes a Great Notion\", but are set in between \"Sometimes a Great Notion\" and the following episode, \"A Disquiet Follows My Soul\", and are noteworthy for providing the origins of Lt. Gaeta's attempted coup in the upcoming episodes, as well as revealing that he and Lt. Hoshi are romantically involved. In March 2009 the series won several Streamy Awards: Best Dramatic Web Series, Best Writing for a Dramatic Web Series, and Best Male Actor in a Dramatic Web Series for Alessandro Juliani. The series was also nominated for an Emmy Award in the Short-format Live-action Entertainment Program category. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2008 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2006-09-05 Battlestar Galactica: The Resistance 8.0    2007-10-05 Battlestar Galactica: Razor Flashbacks 7.0    2003-12-08 Battlestar Galactica 8.3    2004-10-18 Battlestar Galactica 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Science Fiction Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 20 zurman1 9 Batliebre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}