{"link": "https://www.themoviedb.org/tv/7516?language=en", "title": "Dunkirk", "resume": "Dunkirk is a 2004 BBC television docudrama about the Battle of Dunkirk and the Dunkirk evacuation in World War II.", "rate": 69, "genre": ["Documentary"], "cast": ["Phil Cornwell", "Simon Russell Beale", "Timothy Dalton", "Ricci Harnett", "Benedict Cumberbatch"], "character": ["Harry Noakes", "Winston Churchill", "Narrator", "Guardsman Desmond Thorogood", "Lt Jimmy Langley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7516   Expand Dunkirk   (2004) User Score Overview Dunkirk is a 2004 BBC television docudrama about the Battle of Dunkirk and the Dunkirk evacuation in World War II. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Cornwell Harry Noakes Simon Russell Beale Winston Churchill Timothy Dalton Narrator Ricci Harnett Guardsman Desmond Thorogood Benedict Cumberbatch Lt Jimmy Langley Full Cast & Crew Last Season Season 1 2004 | 3 Episodes Season 1 of Dunkirk premiered on February 18, 2004. View All Seasons Social Reviews  1 Discussions  0 A review by lwpcolonel  7.0 Written by  lwpcolonel  on January 14, 2018 This is a docudrama that requires both an interest and prior detailed knowledge regarding this historic event. As a Strategic Planner by trade, I found the logistical actions primarily directed by Royal Navy staff officer, Captain Tennant, who on May 26th was dispatched on board the destroyer HMS Wolfhound to Dunkirk to aid in the evacuation of more than 330,000 British and French troops left stranded when France fell to the Nazis, [official account] fascinating. My wife found it sad, upsetting, and tragic. Not something that everyone will appreciate.\nKnowing the story and admiring the logistic...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2004-03-21 Gunpowder, Treason & Plot 5.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/pressoffice/pressreleases/stories/2004/02_february/03/dunkirk.shtml Genres Documentary Keywords war world war ii evacuation miniseries battle dunkirk Content Score 86 Almost there... Top Contributors T 14 Torq00 TB 8 TMDb Bot F 7 FreemanUS R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}