{"link": "https://www.themoviedb.org/tv/35412?language=en", "title": "Lucky Chances", "resume": "Lucky Chances is a 1990 television mini-series written by Jackie Collins and based on her bestselling novels Chances and Lucky. It starred Vincent Irizarry, Sandra Bullock, Eric Braeden, Nicollette Sheridan, Anne-Marie Johnson, Phil Morris, David McCallum, Richard Anderson and Robert Duncan McNeill. It was directed by Buzz Kulik.", "rate": 70, "genre": ["Drama"], "cast": ["Sandra Bullock", "Nicollette Sheridan", "Michael Nader", "Stephanie Beacham", "Shawnee Smith"], "character": ["Maria Santangelo", "Lucky Santangelo", "Enzio Bonnatti", "Susan Martino Santangelo", "Olympia Stanislopolous"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35412   Expand Lucky Chances   (1990) User Score Overview Lucky Chances is a 1990 television mini-series written by Jackie Collins and based on her bestselling novels Chances and Lucky. It starred Vincent Irizarry, Sandra Bullock, Eric Braeden, Nicollette Sheridan, Anne-Marie Johnson, Phil Morris, David McCallum, Richard Anderson and Robert Duncan McNeill. It was directed by Buzz Kulik. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sandra Bullock Maria Santangelo Nicollette Sheridan Lucky Santangelo Michael Nader Enzio Bonnatti Stephanie Beacham Susan Martino Santangelo Shawnee Smith Olympia Stanislopolous Full Cast & Crew Last Season Season 1 1990 | 3 Episodes Season 1 of Lucky Chances premiered on October  7, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lucky Chances. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  272m Homepage  - Genres Drama Keywords miniseries crime family Content Score 71 Just a little bit more... Top Contributors 13 Banana TB 12 TMDb Bot g 7 greggegorius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}