{"link": "https://www.themoviedb.org/tv/69219?language=en", "title": "Lâcher prise", "resume": "Everyone can have a bad day now and then, but we meet Valerie on a morning that divides her life neatly into before and after. It took one inconsequential setback – a silly thing, really – to cause a slight delay in Valerie’s schedule, resulting in a regrettable distraction, causing an unfortunate incident, which leads her to the police station….. making her miss the single most important event she had on her agenda: The Meeting! That’s when the dam breaks. All that control to build the fragile framework of her life collapses instantly. Valerie gets fired, is obliged to restrain her lifestyle, and now with the shared custody of her son in question, Valerie has to review her priorities and reorganize her life.", "rate": 60, "genre": ["Drama", "Comedy"], "cast": ["Sophie Cadieux", "Sylvie Léonard", "Simon Lacroix", "Éric Paulhus", "Antoine Archambault"], "character": ["Valérie Danaul", "Madeleine", "Éric", "Kevin", "Thomas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69219   Expand Lâcher prise   (2017) User Score Overview Everyone can have a bad day now and then, but we meet Valerie on a morning that divides her life neatly into before and after. It took one inconsequential setback – a silly thing, really – to cause a slight delay in Valerie’s schedule, resulting in a regrettable distraction, causing an unfortunate incident, which leads her to the police station….. making her miss the single most important event she had on her agenda: The Meeting! That’s when the dam breaks. All that control to build the fragile framework of her life collapses instantly. Valerie gets fired, is obliged to restrain her lifestyle, and now with the shared custody of her son in question, Valerie has to review her priorities and reorganize her life. Featured Crew Isabelle Langlois Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sophie Cadieux Valérie Danaul Sylvie Léonard Madeleine Simon Lacroix Éric Éric Paulhus Kevin Antoine Archambault Thomas Full Cast & Crew Current Season Season 2 2018 | 13 Episodes Season 2 of Lâcher prise premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Lâcher prise. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  21m Homepage   http://ici.radio-canada.ca/tele/lacher-prise Genres Drama Comedy Keywords depression burnout mental disorders Content Score 93 Almost there... Top Contributors 61 Banana 9 NickNightingale 2 karaa 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}