{"link": "https://www.themoviedb.org/tv/15401?language=en", "title": "Efterlyst", "resume": "Efterlyst is a Swedish TV program, equivalent of America's Most Wanted. The show plays security camera footage, reconstructions of crimes, and then takes calls and tips from the Swedish public. Efterlyst has since its start gotten many leads that have led to the arrest of many of Sweden's most noted criminals. In Swedish prisons, Efterlyst is commonly referred to as \"Golartimmen\", literally meaning \"Snitch-hour\".\nThe host, Hasse Aro, was, until the season of 2009, assisted by crime-expert Leif G W Persson. From the 2010 season he is assisted by former State Police Chief Tommy Lindström. Since 2011 he is assisted by Jens Lapidus and Thomas Bodström. In the 2012 season only Thomas Bodström will assist as expert commentator.", "rate": 0, "genre": ["Documentary"], "cast": ["Katarina Wennstam", "Hasse Brontén", "Tage Åström"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15401   Expand Efterlyst User Score Overview Efterlyst is a Swedish TV program, equivalent of America's Most Wanted. The show plays security camera footage, reconstructions of crimes, and then takes calls and tips from the Swedish public. Efterlyst has since its start gotten many leads that have led to the arrest of many of Sweden's most noted criminals. In Swedish prisons, Efterlyst is commonly referred to as \"Golartimmen\", literally meaning \"Snitch-hour\". The host, Hasse Aro, was, until the season of 2009, assisted by crime-expert Leif G W Persson. From the 2010 season he is assisted by former State Police Chief Tommy Lindström. Since 2011 he is assisted by Jens Lapidus and Thomas Bodström. In the 2012 season only Thomas Bodström will assist as expert commentator. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katarina Wennstam Hasse Brontén Tage Åström Full Cast & Crew Last Season Season 49 2014 | 12 Episodes Season 49 of Efterlyst premiered on October  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Swedish Runtime  60m Homepage   http://www.tv8.se/efterlyst Genres Documentary Keywords talk show call center crime investigation Content Score 50 Still needs a little work. Top Contributors j 42 jnylen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}