{"link": "https://www.themoviedb.org/tv/63354?language=en", "title": "Mr. Robinson", "resume": "Centers on a rough-edged musician Craig, who's adjusting to his new life as a music teacher in a big-city middle school where he encounters teacher politics and the temptations of single moms.", "rate": 23, "genre": ["Comedy"], "cast": ["Craig Robinson", "Benjamin Koldyke", "Brandon T. Jackson", "Spencer Grammer", "Amandla Stenberg"], "character": ["Craig Robinson", "Jimmy Hooper", "Ben Robinson", "Ashleigh Fellows", "Halle Foster"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63354   Expand Mr. Robinson   (2015) User Score  Play Trailer Overview Centers on a rough-edged musician Craig, who's adjusting to his new life as a music teacher in a big-city middle school where he encounters teacher politics and the temptations of single moms. Featured Crew Owen Ellickson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Robinson Craig Robinson Benjamin Koldyke Jimmy Hooper Brandon T. Jackson Ben Robinson Spencer Grammer Ashleigh Fellows Amandla Stenberg Halle Foster Full Cast & Crew Last Season Season 1 2015 | 6 Episodes Season 1 of Mr. Robinson premiered on August  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mr. Robinson. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.nbc.com/mr-robinson Genres Comedy Keywords music teacher teacher middle school black men sitcom Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings 11 Banana LC 5 Legit Corporation TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}