{"link": "https://www.themoviedb.org/tv/35700?language=en", "title": "The Island", "resume": "Michelle, Guido and Frankie have been co-workers and close friends for years. But when their boss gets fired, Guido gets a promotion and is replaced by the odd Alain Van Damme. No normal day passes on this work floor where impossible situations, hilarious moments and odd people are just a daily thing.", "rate": 90, "genre": ["Comedy"], "cast": ["Frank Focketijn", "Wim Opbrouck", "Dirk van Dijck", "Tom van Dyck", "Bruno Vanden Broecke"], "character": ["Guido Pallemans", "Frankie Loosveld", "Michel Drets", "Alain Vandam", "Sammy Tanghe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35700   Expand The Island   (2004) User Score Overview Michelle, Guido and Frankie have been co-workers and close friends for years. But when their boss gets fired, Guido gets a promotion and is replaced by the odd Alain Van Damme. No normal day passes on this work floor where impossible situations, hilarious moments and odd people are just a daily thing. Featured Crew Jan Eelen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Focketijn Guido Pallemans Wim Opbrouck Frankie Loosveld Dirk van Dijck Michel Drets Tom van Dyck Alain Vandam Bruno Vanden Broecke Sammy Tanghe Full Cast & Crew Last Season Season 2 2007 | 6 Episodes Season 2 of The Island premiered on December  6, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2009-01-01 Van Vlees en Bloed 8.6    2012-04-29 Quiz Me Quick 8.8    2000-02-11 In de gloria 8.7  Facts Original Name  Het Eiland Status  Ended Networks - Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 19 jonabeer 5 Maretoh S 4 Stoffelaar t 1 televor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}