{"link": "https://www.themoviedb.org/tv/32555?language=en", "title": "Gloomy Salad Days", "resume": "This drama involves 12 different stories which happened to teenagers, taken from real life social cases. Shen Qi is a student who has a brain tumor, giving him the ability to see Death Girl when no one else can. As he witnesses her task of ferrying different people to the afterlife, he gradually falls in love with her and begins to understand the transition between life and death.", "rate": 70, "genre": ["Drama"], "cast": ["Aaron Yan", "Serena Fang", "Zaizai Lin"], "character": ["Shen Qi", "Du", "Nicole Zeng"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32555   Expand Gloomy Salad Days   (2010) User Score Overview This drama involves 12 different stories which happened to teenagers, taken from real life social cases. Shen Qi is a student who has a brain tumor, giving him the ability to see Death Girl when no one else can. As he witnesses her task of ferrying different people to the afterlife, he gradually falls in love with her and begins to understand the transition between life and death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aaron Yan Shen Qi Serena Fang Du Zaizai Lin Nicole Zeng Full Cast & Crew Last Season Season 1 2010 | 20 Episodes Season 1 of Gloomy Salad Days premiered on October  9, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Gloomy Salad Days. You can help by rating TV shows you've seen. Facts Original Name  死神少女 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  60m Homepage   http://baike.baidu.com/subview/3527743/16763017.htm Genres Drama Keywords taiwanese Content Score 56 We're so close, yet so far. Top Contributors M 20 Maria180493 z 5 zurman1 P 3 Proteus 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}