{"link": "https://www.themoviedb.org/tv/67842?language=en", "title": "Nightmare Teacher", "resume": "A homeroom teacher of Yosan Private High School has an accident, and thus a substitute comes to fill in. Han Bong-Gu (Uhm Ki-Joon) is a mysterious man, and after strange occurrences the class president Ye-Rim (Kim So-Hyun) tries to get to the bottom of this mystery.", "rate": 75, "genre": ["Mystery"], "cast": ["Baek Seung-do", "Kim Ji Ahn", "Jang Kyoung-Up", "Hak Jin", "Kwon Young Min"], "character": ["Oh Ki Chul", "Do Do Hee", "Chun Jae Soo", "Seok Phil Ho", "Lee Jong Suk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67842   Expand Nightmare Teacher   (2016) User Score  Play Trailer Overview A homeroom teacher of Yosan Private High School has an accident, and thus a substitute comes to fill in. Han Bong-Gu (Uhm Ki-Joon) is a mysterious man, and after strange occurrences the class president Ye-Rim (Kim So-Hyun) tries to get to the bottom of this mystery. Featured Crew Hyun Moon Sub Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Baek Seung-do Oh Ki Chul Kim Ji Ahn Do Do Hee Jang Kyoung-Up Chun Jae Soo Hak Jin Seok Phil Ho Kwon Young Min Lee Jong Suk Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Nightmare Teacher premiered on March 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   2014-02-09 Cheo Yong 7.4    2014-10-04 Bad Guys 7.6  Facts Original Name  악몽선생 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage  - Genres Mystery Keywords horror school Content Score 86 Almost there... Top Contributors k 32 kayl4 S 5 Sinuzaki 5 klownz 3 part-mozi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}