{"link": "https://www.themoviedb.org/tv/13916?language=en", "title": "Death Note", "resume": "Light Yagami is an ace student with great prospects—and he’s bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and Light has vowed to use the power of the Death Note to rid the world of evil. But will Light succeed in his noble goal, or will the Death Note turn him into the very thing he fights against?", "rate": 83, "genre": ["Animation", "Mystery"], "cast": ["Mamoru Miyano", "Kappei Yamaguchi", "Shidou Nakamura", "Aya Hirano", "Noriko Hidaka"], "character": ["Light Yagami (voice)", "L Lawliet (voice)", "Ryuk (voice)", "Misa Amane (voice)", "Near (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13916   Expand Death Note   (2006) User Score  Play Trailer Overview Light Yagami is an ace student with great prospects—and he’s bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and Light has vowed to use the power of the Death Note to rid the world of evil. But will Light succeed in his noble goal, or will the Death Note turn him into the very thing he fights against? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  17 Posters  23 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamoru Miyano Light Yagami (voice) Kappei Yamaguchi L Lawliet (voice) Shidou Nakamura Ryuk (voice) Aya Hirano Misa Amane (voice) Noriko Hidaka Near (voice) Full Cast & Crew Last Season Season 1 2006 | 37 Episodes Season 1 of Death Note premiered on October  4, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Killing Ray Penbar was silly Open 2 by  movie_nazi Go to Discussions Media Most Popular Videos  1 Backdrops  17 Posters  23 Recommendations   2011-04-06 Steins;Gate 8.2    2013-04-06 Attack on Titan 7.6    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1    2004-07-25 Elfen Lied 7.6    1995-10-04 Neon Genesis Evangelion 8.0    1998-04-03 Cowboy Bebop 8.2    2003-10-04 Fullmetal Alchemist 8.0  Facts Original Name  DEATH NOTE Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.ntv.co.jp/deathnote/ Genres Animation Mystery Keywords secret identity supernatural murder thriller serial killer psychological thriller based on manga crime dual life contemporary fantasy shounen anime Content Score 93 Almost there... Top Contributors 127 Marr 🇳🇱 t 54 tmdb983464 30 Urizev v 28 vahidSA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}