{"link": "https://www.themoviedb.org/tv/65919?language=en", "title": "Tomorrow When the War Began", "resume": "This dramatic adventure series tells the story of a group of teenagers who are separated from their families following an invasion of their country, a conflict they never saw coming.", "rate": 60, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Narek Armaganian", "Fantine Banulski", "Andrew Creer", "Madeleine Clunies-Ross", "Molly Daniels"], "character": ["Homer", "Robyn", "Kevin", "Fiona", "Ellie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65919   Expand Tomorrow When the War Began   (2016) User Score  Play Trailer Overview This dramatic adventure series tells the story of a group of teenagers who are separated from their families following an invasion of their country, a conflict they never saw coming. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Narek Armaganian Homer Fantine Banulski Robyn Andrew Creer Kevin Madeleine Clunies-Ross Fiona Molly Daniels Ellie Full Cast & Crew Last Season Series 1 2016 | 6 Episodes Season 1 of Tomorrow When the War Began premiered on April 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2014-07-20 The Lottery 4.9    1995-09-22 Space: Above and Beyond 6.8    1998-09-09 First Wave 6.6    1966-09-09 The Time Tunnel 7.0    1965-09-15 Lost in Space 6.8    1968-09-20 Hawaii Five-O 6.7  Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.tomorrowwhenthewarbegan.com/ Genres Action & Adventure Drama Mystery Keywords australia invasion teenager occupation based on young adult novel Content Score 93 Almost there... Top Contributors 46 United600 11 Elizabeth Jennings D 11 Dirk1313 10 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}