{"link": "https://www.themoviedb.org/tv/74323?language=en", "title": "Vampirina", "resume": "A young vampire girl faces the joys and trials of being the new kid in town when her family moves from Transylvania to Pennsylvania.", "rate": 0, "genre": [], "cast": ["Isabella Crovetti", "James Van Der Beek", "Lauren Graham", "Mitchell Whitfield", "Jordan Alexa Davis"], "character": ["Vampirina (aka Vee)", "Boris Hauntley", "Oxana Hauntley", "Demi", "Poppy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74323   Expand Vampirina   (2017) User Score  Play Trailer Overview A young vampire girl faces the joys and trials of being the new kid in town when her family moves from Transylvania to Pennsylvania. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Isabella Crovetti Vampirina (aka Vee) James Van Der Beek Boris Hauntley Lauren Graham Oxana Hauntley Mitchell Whitfield Demi Jordan Alexa Davis Poppy Full Cast & Crew Current Season Season 1 2017 | 17 Episodes Season 1 of Vampirina premiered on October 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Vampirina. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  - Homepage   http://watchdisneyjunior.go.com/vampirina Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 23 Elizabeth Jennings A 9 AlePre TB 3 TMDb Bot 2 sreknob  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}