{"link": "https://www.themoviedb.org/tv/10528?language=en", "title": "Raising Dad", "resume": "Raising Dad is an American television series that aired on the WB from September 2001 until May 2002. The series starred Bob Saget, Kat Dennings, Brie Larson, Riley Smith, Beau Wirick, and Jerry Adler, and was produced by Albion Productions in association with Paramount Television.", "rate": 0, "genre": ["Comedy"], "cast": ["Bob Saget", "Brie Larson", "Kat Dennings", "Jerry Adler", "Andy Kindler"], "character": ["Matt Stewart", "Emily Stewart", "Sarah Stewart", "Sam Stewart", "Mr. Stuart Travers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10528   Expand Raising Dad   (2001) User Score Overview Raising Dad is an American television series that aired on the WB from September 2001 until May 2002. The series starred Bob Saget, Kat Dennings, Brie Larson, Riley Smith, Beau Wirick, and Jerry Adler, and was produced by Albion Productions in association with Paramount Television. Featured Crew Jonathan Katz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Saget Matt Stewart Brie Larson Emily Stewart Kat Dennings Sarah Stewart Jerry Adler Sam Stewart Andy Kindler Mr. Stuart Travers Full Cast & Crew Last Season Season 1 — | 22 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Raising Dad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords family single father high school teacher sitcom living with parents Content Score 93 Almost there... Top Contributors R 16 Rebecca 9 Banana s 3 speedycars TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}