{"link": "https://www.themoviedb.org/tv/31919?language=en", "title": "Human Target", "resume": "Human Target is an American action drama television series broadcast by ABC in the United States. It is based on the comic book character of the same title created by Len Wein and Carmine Infantino, and developed for television by Danny Bilson and Paul DeMeo. The seven-episode series premiered on July 20, 1992, and last aired on August 29, 1992. This series is unrelated to the 2010 Fox television series of the same name, also based on the Human Target character.", "rate": 30, "genre": ["Action", "Adventure"], "cast": ["Rick Springfield", "Signy Coleman", "Kirk Baltz", "R. Lee Ermey"], "character": ["Christopher Chance", "General Ferris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31919   Expand Human Target   (1992) User Score Overview Human Target is an American action drama television series broadcast by ABC in the United States. It is based on the comic book character of the same title created by Len Wein and Carmine Infantino, and developed for television by Danny Bilson and Paul DeMeo. The seven-episode series premiered on July 20, 1992, and last aired on August 29, 1992. This series is unrelated to the 2010 Fox television series of the same name, also based on the Human Target character. Featured Crew Danny Bilson Creator Paul De Meo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rick Springfield Christopher Chance Signy Coleman Kirk Baltz R. Lee Ermey General Ferris Full Cast & Crew Last Season Season 1 1992 | 7 Episodes Season 1 of Human Target premiered on July 20, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Human Target. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors S 5 Samara 3 ibai93 b 2 bloodypit R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}