{"link": "https://www.themoviedb.org/tv/27511?language=en", "title": "GMTV", "resume": "GMTV is the name of the national Channel 3 breakfast television contractor/licensee, broadcasting in the United Kingdom from 1 January 1993 to 3 September 2010. It became a wholly owned subsidiary of ITV plc in November 2009. Shortly after, ITV plc announced the programme would end. The final edition of GMTV was broadcast on 3 September 2010.", "rate": 0, "genre": ["News"], "cast": ["Alison Hammond", "Anthea Turner", "Eamonn Holmes", "Jamie Rickers"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27511   Expand GMTV   (1993) User Score Overview GMTV is the name of the national Channel 3 breakfast television contractor/licensee, broadcasting in the United Kingdom from 1 January 1993 to 3 September 2010. It became a wholly owned subsidiary of ITV plc in November 2009. Shortly after, ITV plc announced the programme would end. The final edition of GMTV was broadcast on 3 September 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alison Hammond Anthea Turner Eamonn Holmes Jamie Rickers Full Cast & Crew Last Season Season 18 2010 | 200 Episodes Season 18 of GMTV premiered on January  1, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on GMTV. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  News Original Language  English Runtime  120m, 145m Homepage  - Genres News Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 21 lineker TB 2 TMDb Bot 2 Chantezj18 N 1 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}