{"link": "https://www.themoviedb.org/tv/25075?language=en", "title": "Lonesome Dove: The Series", "resume": "Set in the small western town of Curtis Wells, Lonesome Dove: The Series follows first the romance and later the marriage of Newt Call and Hannah Peale, and the obsession that Clay Mosby, who owns most of the town, has with young Hannah, who looks remarkably like his late wife, Mary. In addition to the talented regular Canadian cast of Scott Bairstow, Christianne Hirt, and Eric McCormack, the show also featured the recurring players of Dennis Weaver as legend Buffalo Bill Cody, Diahann Carroll as innkeeper and widow Ida Grayson, Paul Johansson as newspaperman and family member Austin Peale, and Paul Le Mat as Hannah's father and the editor of the local paper.", "rate": 80, "genre": ["Western"], "cast": ["Scott Bairstow", "Eric McCormack", "Christianne Hirt", "Dennis Weaver"], "character": ["Newt Call", "Col. Francis Clay Mosby", "Hannah Peale Call", "Buffalo Bill Cody"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25075   Expand Lonesome Dove: The Series   (1994) User Score Overview Set in the small western town of Curtis Wells, Lonesome Dove: The Series follows first the romance and later the marriage of Newt Call and Hannah Peale, and the obsession that Clay Mosby, who owns most of the town, has with young Hannah, who looks remarkably like his late wife, Mary. In addition to the talented regular Canadian cast of Scott Bairstow, Christianne Hirt, and Eric McCormack, the show also featured the recurring players of Dennis Weaver as legend Buffalo Bill Cody, Diahann Carroll as innkeeper and widow Ida Grayson, Paul Johansson as newspaperman and family member Austin Peale, and Paul Le Mat as Hannah's father and the editor of the local paper. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scott Bairstow Newt Call Eric McCormack Col. Francis Clay Mosby Christianne Hirt Hannah Peale Call Dennis Weaver Buffalo Bill Cody Full Cast & Crew Last Season Season 1 1994 | 21 Episodes Season 1 of Lonesome Dove: The Series premiered on September  9, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lonesome Dove: The Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords 19th century Content Score 86 Almost there... Top Contributors 8 Banana S 2 Samara S 2 SolidSnke 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}