{"link": "https://www.themoviedb.org/tv/62806?language=en", "title": "Mask", "resume": "Ji-Sook goes through a difficult period, due to her father's private loan. She begins living as Eun-Ha. Eun-Ha is from a wealthy family and looks like Ji-Sook. When Min-Woo was only seven years old, he became the successor of a large corporation which his family ran. Due to his position, he cannot reveal his feelings. Through his family, he meets Eun-Ha. He notices she is different from other wealthy woman that he has met. Min-Woo has feelings for her.", "rate": 88, "genre": ["Drama"], "cast": ["Soo-Ae", "Ju Ji-hoon", "Yeon Jung-hoon", "Yoo In-young", "Jung Dong-Hwan"], "character": ["Byun Ji-sook / Seo Eun-ha", "Choi Min-Woo", "Min Seok-hoon", "Choi Mi-Yeon", "Byun Dae-sung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62806   Expand Mask   (2015) User Score Overview Ji-Sook goes through a difficult period, due to her father's private loan. She begins living as Eun-Ha. Eun-Ha is from a wealthy family and looks like Ji-Sook. When Min-Woo was only seven years old, he became the successor of a large corporation which his family ran. Due to his position, he cannot reveal his feelings. Through his family, he meets Eun-Ha. He notices she is different from other wealthy woman that he has met. Min-Woo has feelings for her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soo-Ae Byun Ji-sook / Seo Eun-ha Ju Ji-hoon Choi Min-Woo Yeon Jung-hoon Min Seok-hoon Yoo In-young Choi Mi-Yeon Jung Dong-Hwan Byun Dae-sung Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Mask premiered on May 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Mask. You can help by rating TV shows you've seen. Facts Original Name  가면 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/2015mask/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 38 Maria180493 15 Charles 12 Elizabeth Jennings t 5 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}