{"link": "https://www.themoviedb.org/tv/46540?language=en", "title": "Full House Take 2", "resume": "Full House Take 2 is a 2012 South Korean television series that was jointly produced by Korean, Chinese and Japanese companies. It aired on Japan's TBS-cable affiliate TBS Channel 2, and South Korean cable channel SBS Plus.\nThe term \"sequel\" is used loosely, since the series only shares the same premise as Won Soo-yeon's manhwa and the original 2004 hit Full House, but has a completely different set of characters and plot.", "rate": 60, "genre": ["Comedy"], "cast": ["Hwang Jung-eum", "No Min-woo", "Park Ki-Woong", "Yoo Seol-Ah", "Noh Jung Ui"], "character": ["Jang Man-ok / Michelle Jang", "Lee Tae-ik", "Won Kang-hwi", "Jin Se-ryung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46540   Expand Full House Take 2   (2012) User Score Overview Full House Take 2 is a 2012 South Korean television series that was jointly produced by Korean, Chinese and Japanese companies. It aired on Japan's TBS-cable affiliate TBS Channel 2, and South Korean cable channel SBS Plus. The term \"sequel\" is used loosely, since the series only shares the same premise as Won Soo-yeon's manhwa and the original 2004 hit Full House, but has a completely different set of characters and plot. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hwang Jung-eum Jang Man-ok / Michelle Jang No Min-woo Lee Tae-ik Park Ki-Woong Won Kang-hwi Yoo Seol-Ah Jin Se-ryung Noh Jung Ui Full Cast & Crew Last Season Season 1 2012 | 32 Episodes Season 1 of Full House Take 2 premiered on October 22, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Full House Take 2. You can help by rating TV shows you've seen. Facts Original Name  풀하우스 TAKE 2 Status  Ended Network SBS Plus Certification  - Type  Scripted Original Language  Korean Runtime  30m Homepage   http://sbsplus.sbs.co.kr/fullhouse2/ Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 24 Maria180493 t 9 tmdb983464 z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}