{"link": "https://www.themoviedb.org/tv/3149?language=en", "title": "Noozles", "resume": "Noozles, also known as The Wonderous Koala Blinky, is a 26-episode anime by Nippon Animation Company that was originally released in Japan in 1984. It depicts the adventures of a 12-year old girl named Sandy and her koala friends, Blinky and Pinky, who are from the extra-dimensional realm of Koalawalla Land. Noozles aired in Japan on the Fuji TV network in its original run from July to December 1984, with reruns continuing until 1987; an edited, dubbed version later aired in the United States on Nickelodeon from November 1988 through April 1993. The show usually aired at 1pm on the weekdays, immediately following another koala themed cartoon, Adventures of the Little Koala. It has been reported that the series has recently begun airing once again in Japan on AT-X.\nThe series has also been dubbed into French, Korean, Spanish and German.\nThe series features episode direction by Noboru Ishiguro, best known for his work on the sci-fi anime series Space Battleship Yamato and the original Macross series and layout work by Yasuji Mori.", "rate": 0, "genre": ["Animation"], "cast": ["Cheryl Chase", "Dave Mallow", "Brianne Siddall", "Kerrigan Mahan", "Mari Devon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3149   Expand Noozles   (1984) User Score Overview Noozles, also known as The Wonderous Koala Blinky, is a 26-episode anime by Nippon Animation Company that was originally released in Japan in 1984. It depicts the adventures of a 12-year old girl named Sandy and her koala friends, Blinky and Pinky, who are from the extra-dimensional realm of Koalawalla Land. Noozles aired in Japan on the Fuji TV network in its original run from July to December 1984, with reruns continuing until 1987; an edited, dubbed version later aired in the United States on Nickelodeon from November 1988 through April 1993. The show usually aired at 1pm on the weekdays, immediately following another koala themed cartoon, Adventures of the Little Koala. It has been reported that the series has recently begun airing once again in Japan on AT-X. The series has also been dubbed into French, Korean, Spanish and German. The series features episode direction by Noboru Ishiguro, best known for his work on the sci-fi anime series Space Battleship Yamato and the original Macross series and layout work by Yasuji Mori. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cheryl Chase Dave Mallow Brianne Siddall Kerrigan Mahan Mari Devon Full Cast & Crew Last Season Season 1 1984 | 24 Episodes Season 1 of Noozles premiered on July  7, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Noozles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}