{"link": "https://www.themoviedb.org/tv/1414?language=en", "title": "The Shield", "resume": "The story of an inner-city Los Angeles police precinct where some of the cops aren't above breaking the rules or working against their associates to both keep the streets safe and their self-interests intact.", "rate": 82, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Michael Chiklis", "Walton Goggins", "CCH Pounder", "Jay Karnes", "Catherine Dent"], "character": ["Vic Mackey", "Shane Vendrell", "Claudette Wyms", "Dutch Wagenbach", "Danielle Sofer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1414   Expand The Shield   (2002) User Score  Play Trailer Overview The story of an inner-city Los Angeles police precinct where some of the cops aren't above breaking the rules or working against their associates to both keep the streets safe and their self-interests intact. Featured Crew Shawn Ryan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  1 Images Backdrops  19 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Chiklis Vic Mackey Walton Goggins Shane Vendrell CCH Pounder Claudette Wyms Jay Karnes Dutch Wagenbach Catherine Dent Danielle Sofer Full Cast & Crew Last Season Season 7 2008 | 13 Episodes Season 7 of The Shield premiered on September  2, 2008. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply The Wire or The Shield? Open 1 by  JAYJAY1234 M Best season? Open 2 by  Lockard The GOAT One of the Greatest Cop Dramas of all time Open 4 by  RCH2288 Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  8 Recommendations   1997-07-12 Oz 8.1    2010-03-16 Justified 7.9    2004-03-21 Deadwood 8.1    2002-06-02 The Wire 8.4    1999-01-10 The Sopranos 8.3    2010-09-19 Boardwalk Empire 7.7    2008-09-03 Sons of Anarchy 7.8    2001-06-03 Six Feet Under 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.fxnetworks.com/shows/originals/the_shield/ Genres Action & Adventure Crime Drama Keywords outlaw gang dirty cop police detective lapd Content Score 100 Yes! Looking good! Top Contributors 48 Travis Bell 17 Banana 14 niqo19 10 Julien Lefebvre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}