{"link": "https://www.themoviedb.org/tv/5479?language=en", "title": "Children of the Dust", "resume": "Gypsy Smith, is a gunfighter and a bounty hunter. When he leads the US army into a Cheyenne camp to capture a suspected Indian renegade, a long train of events begins that finally lead to that 'good day to die'. White Wolf, only a child, is one of the few survivors of the massacre of his tribe that day, and Gypsy brings him to live with the Maxwell family, where he grows up not fully Indian and not really white but a bit too close to Rachel, the Maxwell daughter.\nGypsy now reappears, leading a group of Black settlers from the post-Civil War South to start a new life in a town of their own - Freedom in the Oklahoma Territory, its first black settlement. White Wolf (or Corby as a 'white' name') is now with his people, but all of these parts come back together in conflict, violence, loss, and Pyrric triumph.", "rate": 60, "genre": ["Western", "Drama"], "cast": ["Sidney Poitier", "Michael Moriarty", "Farrah Fawcett", "Katharine Isabelle", "Joanna Going"], "character": ["Gypsy Smith", "John Maxwell", "Nora Maxwell", "Young Rachel", "Rachel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5479   Expand Children of the Dust   (1995) User Score  Play Trailer Overview Gypsy Smith, is a gunfighter and a bounty hunter. When he leads the US army into a Cheyenne camp to capture a suspected Indian renegade, a long train of events begins that finally lead to that 'good day to die'. White Wolf, only a child, is one of the few survivors of the massacre of his tribe that day, and Gypsy brings him to live with the Maxwell family, where he grows up not fully Indian and not really white but a bit too close to Rachel, the Maxwell daughter. Gypsy now reappears, leading a group of Black settlers from the post-Civil War South to start a new life in a town of their own - Freedom in the Oklahoma Territory, its first black settlement. White Wolf (or Corby as a 'white' name') is now with his people, but all of these parts come back together in conflict, violence, loss, and Pyrric triumph. Featured Crew David Greene Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sidney Poitier Gypsy Smith Michael Moriarty John Maxwell Farrah Fawcett Nora Maxwell Katharine Isabelle Young Rachel Joanna Going Rachel Full Cast & Crew Last Season Season 1 1995 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Children of the Dust. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  240m Homepage  - Genres Western Drama Keywords bounty hunter miniseries wild west gunfighter black men cheyenne 19th century Content Score 100 Yes! Looking good! Top Contributors TB 53 TMDb Bot 14 Banana 7 Steve R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}