{"link": "https://www.themoviedb.org/tv/5333?language=en", "title": "Naked Science", "resume": "Naked Science is an American documentary television series that premiered in 2004 on the National Geographic Channel. The program features various subjects related to science and technology. Some of the views expressed might be considered fringe or pseudo-science, and some of the scientists may present opinions which have not been properly peer-reviewed or are not widely accepted within their scientific communities, in particular on topics such as Bermuda Triangle or Atlantis for example.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5333   Expand Naked Science   (2004) User Score Overview Naked Science is an American documentary television series that premiered in 2004 on the National Geographic Channel. The program features various subjects related to science and technology. Some of the views expressed might be considered fringe or pseudo-science, and some of the scientists may present opinions which have not been properly peer-reviewed or are not widely accepted within their scientific communities, in particular on topics such as Bermuda Triangle or Atlantis for example. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2005 | 14 Episodes Season 7 of Naked Science premiered on January 15, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Naked Science. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.channel.nationalgeographic.com/channel/nakedscience/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 Zlogorek 3 Travis Bell 2 thebaritone55@live.co.za H 2 Hrvoje  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}