{"link": "https://www.themoviedb.org/tv/42384?language=en", "title": "Ojakgyo Family", "resume": "Ojakgyo Family is a South Korean television series starring Uee, Joo Won, Ryu Soo-young, Choi Jung-yoon, Jung Woong-in, Yeon Woo-jin, Baek Il-seob, and Kim Ja-ok. The family drama aired on KBS2 from August 6, 2011 to February 19, 2012 on Saturdays and Sundays at 19:55 for 58 episodes.", "rate": 0, "genre": ["Comedy"], "cast": ["Uee", "Joo Won", "Ryu Soo-young", "Jung Suk-won", "Jung Woong-in"], "character": ["Baek Ja-eun", "Hwang Tae-hee", "Hwang Tae-bum", "Kim Je-ha", "Hwang Tae-shik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42384   Expand Ojakgyo Family   (2011) User Score Overview Ojakgyo Family is a South Korean television series starring Uee, Joo Won, Ryu Soo-young, Choi Jung-yoon, Jung Woong-in, Yeon Woo-jin, Baek Il-seob, and Kim Ja-ok. The family drama aired on KBS2 from August 6, 2011 to February 19, 2012 on Saturdays and Sundays at 19:55 for 58 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uee Baek Ja-eun Joo Won Hwang Tae-hee Ryu Soo-young Hwang Tae-bum Jung Suk-won Kim Je-ha Jung Woong-in Hwang Tae-shik Full Cast & Crew Last Season Season 1 2011 | 1 Episode Season 1 of Ojakgyo Family premiered on August  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ojakgyo Family. You can help by rating TV shows you've seen. Facts Original Name  오작교 형제들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 11 RJ_F13 5 Banana t 3 tmdb38202327 A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}