{"link": "https://www.themoviedb.org/tv/71308?language=en", "title": "Disjointed", "resume": "Pot activist Ruth Whitefeather Feldman runs a medical marijuana dispensary while encouraging her loyal patients to chill out and enjoy the high life.", "rate": 53, "genre": ["Comedy"], "cast": ["Kathy Bates", "Elizabeth Alderfer", "Douglas Baldwin", "Tone Bell", "Chris Redd"], "character": ["Ruth", "Olivia", "Pete", "Carter", "Dank"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71308   Expand Disjointed   (2017) User Score  Play Trailer Overview Pot activist Ruth Whitefeather Feldman runs a medical marijuana dispensary while encouraging her loyal patients to chill out and enjoy the high life. Featured Crew Chuck Lorre Creator David Javerbaum Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  2 Posters  7 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathy Bates Ruth Elizabeth Alderfer Olivia Douglas Baldwin Pete Tone Bell Carter Chris Redd Dank Full Cast & Crew Last Season Original Air Date Original Air Date Parts (Digital) Season 1 2017 | 20 Episodes Season 1 of Disjointed premiered on August 24, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Love this show Open 0 by reaper907\n      \n     x Wow what a piece of shit Open 0 by xbxoxy\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  7 Recommendations   2016-08-12 Ask the Storybots 7.5    2015-08-07 Project Mc² 4.7    2011-08-05 Friends with Benefits 6.1    2015-12-18 F is for Family 6.8    2017-09-10 The Deuce 7.9    2017-09-25 Young Sheldon 6.9    2017-07-21 Ozark 8.0    2016-11-15 Shooter 6.7  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m Homepage   https://www.netflix.com/title/80117694 Genres Comedy Keywords marijuana drugs Content Score 100 Yes! Looking good! Top Contributors 74 Elizabeth Jennings 12 Banana Y 7 YJ 7 bstarko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}