{"link": "https://www.themoviedb.org/tv/3645?language=en", "title": "Mancuso, F.B.I.", "resume": "Mancuso, F.B.I. is a crime drama which was aired by NBC as part of its 1989-90 schedule.\nMancuso, F.B.I. stars veteran actor Robert Loggia as Nick Mancuso, a hardened veteran of the Bureau now assigned to Washington, D.C., where he was largely regarded by his superiors and bureaucratic types as a maverick with little regard for agency rules and procedures. This charge was largely true; Mancuso's true motivation was, as a press release for the show near the time of its premiere described it, \"a passionate love affair with the United States Constitution\" and an overwhelming desire to see genuine justice rather than the mere appearance of it.", "rate": 50, "genre": ["Drama"], "cast": ["Robert Loggia", "Lindsay Frost", "Fredric Lehne", "Charles Siebert", "Randi Brooks"], "character": ["Nick Mancuso", "Kristen Carter", "Eddie McMasters", "Dr Paul Summers", "Jean St John"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3645   Expand Mancuso, F.B.I.   (1989) User Score Overview Mancuso, F.B.I. is a crime drama which was aired by NBC as part of its 1989-90 schedule. Mancuso, F.B.I. stars veteran actor Robert Loggia as Nick Mancuso, a hardened veteran of the Bureau now assigned to Washington, D.C., where he was largely regarded by his superiors and bureaucratic types as a maverick with little regard for agency rules and procedures. This charge was largely true; Mancuso's true motivation was, as a press release for the show near the time of its premiere described it, \"a passionate love affair with the United States Constitution\" and an overwhelming desire to see genuine justice rather than the mere appearance of it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Loggia Nick Mancuso Lindsay Frost Kristen Carter Fredric Lehne Eddie McMasters Charles Siebert Dr Paul Summers Randi Brooks Jean St John Full Cast & Crew Last Season Season 1 1989 | 20 Episodes Season 1 of Mancuso, F.B.I. premiered on October 13, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mancuso, F.B.I.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords washington d.c. fbi Content Score 71 Just a little bit more... Top Contributors 9 Banana e 1 enderucum R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}