{"link": "https://www.themoviedb.org/tv/69876?language=en", "title": "Everyone's Getting Married", "resume": "Asuka Takanashi is a twenty-something woman who works for a megabank and holds various professional qualifications in finance. Despite her successful career, she is extremely eager to get married and become a stay-at-home housewife. One day, she suddenly gets damped by her boyfriend of five years. Desperate to find her next potential husband, she immediately starts searching to find the \"love of her life.\" Then she meets Ryu Nanami, a very popular TV newscaster. He appears to be the most ideal man for Asuka, except that Ryu is 100% against the idea of marriage and determined to never get married. However, despite their different views on marriage, they eventually fall in love and start their relationship. It seemed as though everything was going so well, but this was the beginning of their “Battle of Values.” Where is their romantic relationship headed? Will Asuka be able to announce her marriage and make her dream come true?", "rate": 100, "genre": ["Drama"], "cast": ["Mariya Nishiuchi", "Ryuta Yamamura", "Ikusaburo Yamazaki", "Anne Nakamura", "Yukino Kishii"], "character": ["Asuka Takanashi", "Ryu Nanami", "Akihito Kamiya", "Rio Kiriyama", "Momoko Makise"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69876   Expand Everyone's Getting Married   (2017) User Score Overview Asuka Takanashi is a twenty-something woman who works for a megabank and holds various professional qualifications in finance. Despite her successful career, she is extremely eager to get married and become a stay-at-home housewife. One day, she suddenly gets damped by her boyfriend of five years. Desperate to find her next potential husband, she immediately starts searching to find the \"love of her life.\" Then she meets Ryu Nanami, a very popular TV newscaster. He appears to be the most ideal man for Asuka, except that Ryu is 100% against the idea of marriage and determined to never get married. However, despite their different views on marriage, they eventually fall in love and start their relationship. It seemed as though everything was going so well, but this was the beginning of their “Battle of Values.” Where is their romantic relationship headed? Will Asuka be able to announce her marriage and make her dream come true? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariya Nishiuchi Asuka Takanashi Ryuta Yamamura Ryu Nanami Ikusaburo Yamazaki Akihito Kamiya Anne Nakamura Rio Kiriyama Yukino Kishii Momoko Makise Full Cast & Crew Last Season Season 1 2017 | 9 Episodes Season 1 of Everyone's Getting Married premiered on January 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Everyone's Getting Married. You can help by rating TV shows you've seen. Facts Original Name  突然ですが、明日結婚します Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.fujitv.co.jp/ashita_kekkonshimasu/ Genres Drama Keywords japan romance Content Score 86 Almost there... Top Contributors M 37 Maria180493 1 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}