{"link": "https://www.themoviedb.org/tv/63032?language=en", "title": "Hoff the Record", "resume": "Shot like a documentary, the semi-improvised comedy Hoff The Record follows TV legend David Hasselhoff - playing a highly fictionalized version of himself - as he arrives in the UK in an attempt to reignite his flagging career. It's been thirty years since he rose to worldwide fame in Baywatch and Knight Rider and things have since gone a little stale for The Hoff. Will a move across the Atlantic change his luck?", "rate": 60, "genre": ["Comedy"], "cast": ["David Hasselhoff"], "character": ["David Hasselhoff"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63032   Expand Hoff the Record   (2015) User Score Overview Shot like a documentary, the semi-improvised comedy Hoff The Record follows TV legend David Hasselhoff - playing a highly fictionalized version of himself - as he arrives in the UK in an attempt to reignite his flagging career. It's been thirty years since he rose to worldwide fame in Baywatch and Knight Rider and things have since gone a little stale for The Hoff. Will a move across the Atlantic change his luck? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Hasselhoff David Hasselhoff Full Cast & Crew Last Season Season 2 2016 | 6 Episodes Season 2 of Hoff the Record premiered on May  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2011-02-08 Traffic Light 7.2    2017-01-01 Beau Séjour 7.9    2015-12-01 Real Rob 5.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://dave.uktv.co.uk/shows/hoff-the-record/ Genres Comedy Keywords comeback mockumentary aging actor career resurrection Content Score 56 We're so close, yet so far. Top Contributors 40 Elizabeth Jennings z 4 zurman1 2 gianpoker a 2 apung21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}