{"link": "https://www.themoviedb.org/tv/43020?language=en", "title": "Continuum", "resume": "The series centers on the conflict between a group of rebels from the year 2077 who time-travel to Vancouver, BC, in 2012, and a police officer who accidentally accompanies them. In spite of being many years early, the rebel group decides to continue its violent campaign to stop corporations of the future from replacing governments, while the police officer endeavours to stop them without revealing to anyone that she and the rebels are from the future.", "rate": 72, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Rachel Nichols", "Erik Knudsen", "Victor Webster", "Stephen Lobo", "Roger Cross"], "character": ["Kiera Cameron", "Alec Sadler", "Carlos Fonnegra", "Matthew Kellog", "Travis Verta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43020   Expand Continuum   (2012) User Score  Play Trailer Overview The series centers on the conflict between a group of rebels from the year 2077 who time-travel to Vancouver, BC, in 2012, and a police officer who accidentally accompanies them. In spite of being many years early, the rebel group decides to continue its violent campaign to stop corporations of the future from replacing governments, while the police officer endeavours to stop them without revealing to anyone that she and the rebels are from the future. Featured Crew Simon Barry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  19 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel Nichols Kiera Cameron Erik Knudsen Alec Sadler Victor Webster Carlos Fonnegra Stephen Lobo Matthew Kellog Roger Cross Travis Verta Full Cast & Crew Last Season Season 4 2015 | 6 Episodes View All Seasons Social Reviews  2 Discussions  4 A review by AKJETJ  6.0 Written by  AKJETJ  on July 12, 2017 I really wanted to like this show. It started so promising but got way too political. Read All Reviews Media Most Popular Videos  1 Backdrops  19 Posters  13 Recommendations   2009-07-07 Warehouse 13 7.2    2008-09-09 Fringe 8.1    2012-09-17 Revolution 6.0    2013-10-09 The Tomorrow People 6.6    2013-11-17 Almost Human 7.0    2011-09-26 Terra Nova 6.3    2013-04-15 Defiance 6.2    2011-07-11 Alphas 6.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.showcase.ca/continuum Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords time travel fish out of water police detective vancouver Content Score 100 Yes! Looking good! Top Contributors 181 seawolf 27 Travis Bell 20 Elizabeth Jennings 17 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}