{"link": "https://www.themoviedb.org/tv/45967?language=en", "title": "Yamada's First Time: B Gata H Kei", "resume": "OMG! There’s this girl at school, Yamada, who wants to make like a hundred sex friends. She totally thinks she can devirginize one hundred different boys! Can you believe that? That’s like every boy in the school. Who does she think she is? I heard from my friend’s neighbor’s cousin’s lab partner that Yamada’s never even been kissed.  Oh. My. God. I would totally die. That’s like burn all your makeup and shave off your eyebrows embarrassing. I can’t even think about it. Today at lunch I saw Yamada flirting, like for reals flirting, with that geek Kosuda. You know the guy. Photography club, no muscles, boring face, kind of reminds you of a black-and-white movie. Super lame. If Yamada can’t even make the sex with him, she’ll never score a hundred cherry boys. She needs to take like Sex Ed or something because I heard she can’t give it away!", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["Kana Hanazawa", "Atsushi Abe", "Yukari Tamura", "Asami Shimoda", "Brittney Karbowski"], "character": ["Mayu Miyano", "Takashi Kosuda", "Yamada", "Chika Yamada", "Yamada (English Dub)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45967   Expand Yamada's First Time: B Gata H Kei   (2010) User Score  Play Trailer Overview OMG! There’s this girl at school, Yamada, who wants to make like a hundred sex friends. She totally thinks she can devirginize one hundred different boys! Can you believe that? That’s like every boy in the school. Who does she think she is? I heard from my friend’s neighbor’s cousin’s lab partner that Yamada’s never even been kissed.  Oh. My. God. I would totally die. That’s like burn all your makeup and shave off your eyebrows embarrassing. I can’t even think about it. Today at lunch I saw Yamada flirting, like for reals flirting, with that geek Kosuda. You know the guy. Photography club, no muscles, boring face, kind of reminds you of a black-and-white movie. Super lame. If Yamada can’t even make the sex with him, she’ll never score a hundred cherry boys. She needs to take like Sex Ed or something because I heard she can’t give it away! Featured Crew Yōko Sanri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  22 Posters  1 Videos Trailers  1 Teasers  0 Clips  4 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Mayu Miyano Atsushi Abe Takashi Kosuda Yukari Tamura Yamada Asami Shimoda Chika Yamada Brittney Karbowski Yamada (English Dub) Full Cast & Crew Last Season B gata h kei yamada’s first time season 1 2010 | 12 Episodes Season 1 of Yamada's First Time: B Gata H Kei premiered on April  2, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  5 Backdrops  22 Posters  1 Recommendations   2010-01-07 Dance in the Vampire Bund 7.0    2011-01-08 Freezing 7.4    2009-07-04 Canaan 7.6    2011-10-08 Ben-To 7.2    2015-07-07 Bikini Warriors 4.4    2012-07-05 Good Luck Girl! 8.0    2014-10-06 When Supernatural Battles Became Commonplace 8.3    2012-07-06 Nakaimo: My Little Sister Is Among Them! 8.5  Facts Original Name  B型H系 Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/yamadas-first-time-b-gata-h-kei/home Genres Animation Comedy Keywords nudity romance school anime Content Score 100 Yes! Looking good! Top Contributors 41 WillofOwn IL 13 I Love Animes r 8 rimas21 5 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}