{"link": "https://www.themoviedb.org/tv/39916?language=en", "title": "The Green Room with Paul Provenza", "resume": "Comedian and director of the obscenely hilarious hit film The Aristocrats, Paul Provenza invites some of the biggest names in stand-up to sit down and try to beat each other to the punch line. From politics and racism to sex and money, no topic is off limits in The Green Room.", "rate": 80, "genre": ["Comedy", "Talk"], "cast": ["Paul Provenza"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39916   Expand The Green Room with Paul Provenza   (2010) User Score Overview Comedian and director of the obscenely hilarious hit film The Aristocrats, Paul Provenza invites some of the biggest names in stand-up to sit down and try to beat each other to the punch line. From politics and racism to sex and money, no topic is off limits in The Green Room. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Provenza Himself - Host Full Cast & Crew Last Season Season 2 2011 | 8 Episodes Season 2 of The Green Room with Paul Provenza premiered on July 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Green Room with Paul Provenza. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Talk Show Original Language  English Runtime  28m Homepage   http://www.sho.com/the-green-room-with-paul-provenza Genres Comedy Talk Keywords talk show joke comedian round table discussion behind the scenes Content Score 56 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings 8 Banana L 4 Law 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}