{"link": "https://www.themoviedb.org/tv/9508?language=en", "title": "Anna Lee", "resume": "Anna Lee is a British television series produced by Brian Eastman and Carnival Films for London Weekend Television. Following a 1993 pilot, five two-hour programmes were produced in 1994, loosely based on the detective novels of Liza Cody. These were broadcast in the U.S. on the A&E cable network. The title role was played by Imogen Stubbs. Music was by Anne Dudley with theme song \"Sister, Sister\" and some additional songs by Luciana Caporaso. Considerable alterations were made from the original books so that sometimes they seem to share only their titles. According to actor Ken Stott's webpage:", "rate": 82, "genre": ["Crime", "Drama"], "cast": ["Brian Glover", "Imogen Stubbs", "Peter Wight"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9508   Expand Anna Lee   (1994) User Score Overview Anna Lee is a British television series produced by Brian Eastman and Carnival Films for London Weekend Television. Following a 1993 pilot, five two-hour programmes were produced in 1994, loosely based on the detective novels of Liza Cody. These were broadcast in the U.S. on the A&E cable network. The title role was played by Imogen Stubbs. Music was by Anne Dudley with theme song \"Sister, Sister\" and some additional songs by Luciana Caporaso. Considerable alterations were made from the original books so that sometimes they seem to share only their titles. According to actor Ken Stott's webpage: Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Glover Imogen Stubbs Peter Wight Full Cast & Crew Last Season Season 1 1994 | 5 Episodes Season 1 of Anna Lee premiered on February 27, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Anna Lee. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  100m Homepage  - Genres Crime Drama Keywords ex-cop private investigator private detective Content Score 56 We're so close, yet so far. Top Contributors 16 Banana c 5 clipper314 4 kcdh PS 2 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}