{"link": "https://www.themoviedb.org/tv/3663?language=en", "title": "Camp Runamuck", "resume": "Camp Runamuck is an American sitcom which aired on NBC during the 1965-1966 television season. The series was created and executive produced by David Swift, and aired for 26 episodes.", "rate": 0, "genre": ["Comedy"], "cast": ["Hermione Baddeley", "Dave Madden", "Leonard Stone", "Arch Johnson", "Frank De Vol"], "character": ["Eulalia Divine", "Pruett", "Doc Joslyn", "Commander Wivenhoe", "Doc Joslyn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3663   Expand Camp Runamuck   (1965) User Score Overview Camp Runamuck is an American sitcom which aired on NBC during the 1965-1966 television season. The series was created and executive produced by David Swift, and aired for 26 episodes. Featured Crew David Swift Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hermione Baddeley Eulalia Divine Dave Madden Pruett Leonard Stone Doc Joslyn Arch Johnson Commander Wivenhoe Frank De Vol Doc Joslyn Full Cast & Crew Last Season Season 1 1965 | 26 Episodes Season 1 of Camp Runamuck premiered on September 17, 1965. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Camp Runamuck. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords summer camp camp sitcom Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}