{"link": "https://www.themoviedb.org/tv/44460?language=en", "title": "Gatchaman", "resume": "Gatchaman is a three-part original video animation (OVA) based on the popular 1970s anime Gatchaman. It was released in Japan and the United States during the mid-1990s. This version of Gatchaman is set in the year 2066 where the evil leader of the nation of Hontwall is threatening to take over the planet. Scientists from the International Science Organization are disappearing and only five teenage heroes, the Science Ninja team, can stop the disaster. The OVAs were licensed by Urban Vision through Harmony Gold USA and were released on VHS and DVD. At Anime Boston 2013, Sentai Filmworks had announced that they have rescued the OVA series along with the original 1970's series for a DVD re-release in October. The series was made available for streaming through Crunchyroll.\nThe series was originally dubbed by Harmony Gold and Urban Vision, however, Sentai Filmworks confirmed that the OVAs will be redubbed for their upcoming DVD and Blu-ray re-release to match the uncut TV series dub.", "rate": 78, "genre": ["Animation"], "cast": ["Eddie Frierson", "Richard Cansino", "Lara Cody", "Mona Marshall", "Richard Epcar"], "character": ["Ken the Eagle", "Joe the Condor", "June the Swan", "Jimmy the Falcon", "Rocky the Owl"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44460   Expand Gatchaman   (1972) User Score Overview Gatchaman is a three-part original video animation (OVA) based on the popular 1970s anime Gatchaman. It was released in Japan and the United States during the mid-1990s. This version of Gatchaman is set in the year 2066 where the evil leader of the nation of Hontwall is threatening to take over the planet. Scientists from the International Science Organization are disappearing and only five teenage heroes, the Science Ninja team, can stop the disaster. The OVAs were licensed by Urban Vision through Harmony Gold USA and were released on VHS and DVD. At Anime Boston 2013, Sentai Filmworks had announced that they have rescued the OVA series along with the original 1970's series for a DVD re-release in October. The series was made available for streaming through Crunchyroll. The series was originally dubbed by Harmony Gold and Urban Vision, however, Sentai Filmworks confirmed that the OVAs will be redubbed for their upcoming DVD and Blu-ray re-release to match the uncut TV series dub. Featured Crew Tatsuo Yoshida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eddie Frierson Ken the Eagle Richard Cansino Joe the Condor Lara Cody June the Swan Mona Marshall Jimmy the Falcon Richard Epcar Rocky the Owl Full Cast & Crew Last Season The Dragon King 1972 | 85 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Gatchaman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  139m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 18 cypherronin E 4 Enigma19 a 2 akide 2 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}