{"link": "https://www.themoviedb.org/tv/5319?language=en", "title": "100 höjdare", "resume": "100 höjdare was a Swedish TV series which was produced and aired on Kanal 5. Six seasons of the show were produced and it ran from 2004 to 2008. It was hosted by the comedy duo Filip Hammar & Fredrik Wikingsson.\nIn the first three seasons the hosts presented funny moments, often in the form of video clips, listing their 100 all-time favorites. In season two and three they also discuss the clips with celebrity guests. By season four the format changed and instead of showing clips, Filip and Fredrik made impromptu interviews with people, often in their homes.", "rate": 85, "genre": ["Documentary", "Comedy"], "cast": ["Fredrik Wikingsson", "Filip Hammar"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5319   Expand 100 höjdare   (2004) User Score Overview 100 höjdare was a Swedish TV series which was produced and aired on Kanal 5. Six seasons of the show were produced and it ran from 2004 to 2008. It was hosted by the comedy duo Filip Hammar & Fredrik Wikingsson. In the first three seasons the hosts presented funny moments, often in the form of video clips, listing their 100 all-time favorites. In season two and three they also discuss the clips with celebrity guests. By season four the format changed and instead of showing clips, Filip and Fredrik made impromptu interviews with people, often in their homes. Featured Crew Filip Hammar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fredrik Wikingsson Filip Hammar Full Cast & Crew Last Season Season 6 2008 | 8 Episodes Season 6 of 100 höjdare premiered on March 17, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 100 höjdare. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Documentary Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors j 1 jnylen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}