{"link": "https://www.themoviedb.org/tv/38141?language=en", "title": "At The Mercy of The Sky", "resume": "Sakura Ooyagi returns to his old hometown in order to start school  at Sōei High School. On the first day, he runs into an old childhood  friend: a junior named Mihoshi Akeno. As children, the two used to play  together, with Mihoshi, or Mii-chan, being extremely fond of astronomy.  After convincing Sakura to join the school's astronomy club, another  girl, Hime Makita, joins the club in hopes of winning over Sakura. The  anime tells the story of the 6 club members as they soar through their  lives, each maturing and changing their outlooks on life", "rate": 70, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Masaya Matsukaze", "Saori Hayami", "Reiko Takagi", "Ami Koshimizu", "Tomoaki Maeno"], "character": ["Nozomu Soma", "Sayo Yarai", "Masashi Edogawa", "Fumie Kotozuka", "Saku Ooyagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38141   Expand At The Mercy of The Sky   (2009) User Score Overview Sakura Ooyagi returns to his old hometown in order to start school  at Sōei High School. On the first day, he runs into an old childhood  friend: a junior named Mihoshi Akeno. As children, the two used to play  together, with Mihoshi, or Mii-chan, being extremely fond of astronomy.  After convincing Sakura to join the school's astronomy club, another  girl, Hime Makita, joins the club in hopes of winning over Sakura. The  anime tells the story of the 6 club members as they soar through their  lives, each maturing and changing their outlooks on life Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaya Matsukaze Nozomu Soma Saori Hayami Sayo Yarai Reiko Takagi Masashi Edogawa Ami Koshimizu Fumie Kotozuka Tomoaki Maeno Saku Ooyagi Full Cast & Crew Last Season Season 1 2009 | 12 Episodes Season 1 of At The Mercy of The Sky premiered on July  7, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on At The Mercy of The Sky. You can help by rating TV shows you've seen. Facts Original Name  宙のまにまに Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 BrerFox m 3 magoozin t 2 tmdb983464 1 littlewolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}