{"link": "https://www.themoviedb.org/tv/78491?language=en", "title": "Your Husband Is Cheating On Us", "resume": "Shining a light on the world of  the urban theater and revealing the show behind the show, producer and director JD Lawrence mounts his new production of the stage play Your Husband Is Cheating On Us, implementing unorthodox creative methods with his cast.", "rate": 85, "genre": ["Reality"], "cast": ["J.D. Lawrence"], "character": ["Director, Executive Producer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78491   Expand Your Husband Is Cheating On Us   (2018) User Score  Play Trailer Overview Shining a light on the world of  the urban theater and revealing the show behind the show, producer and director JD Lawrence mounts his new production of the stage play Your Husband Is Cheating On Us, implementing unorthodox creative methods with his cast. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast J.D. Lawrence Director, Executive Producer Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of Your Husband Is Cheating On Us premiered on April  1, 2018. View All Seasons Social Reviews  1 Discussions  0 d A review by docuseriesCritic  10.0 Written by  docuseriesCritic  on April  7, 2018 Bravo has teamed up with mega producer and playwright JD Lawrence (The Clean Up Woman, Community Service, Rumors, Me & Mrs Jones, Cain and Able) to bring the urban Theatre genre mainstream. JD Lawrence like Tyler Perry has taken the Chitlin Circuit by storm playing multiple charters. Lawrence also like Tyler is now expanding his brand to television and film. Your Husband Is Cheating On Us premiered Sunday between the real housewives franchise Almost reaching  a million viewers and earning a spot on the top 25 original cable programs.  Let me be the first to welcome JD Lawrence to the realty sho...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Your Husband Is Cheating On Us. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.bravotv.com/your-husband-is-cheating-on-us Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors a 12 aditia01 5 DTP134 d 5 docuseriesCritic 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}