{"link": "https://www.themoviedb.org/tv/18862?language=en", "title": "The Aviators", "resume": "The Aviators is an award-winning weekly documentary-lifestyle-science TV series featuring interesting people, the latest aircraft, current technology and fly-in destinations. The show's site describes subject matter as follows: \"We will take you behind the scenes to show you how airline pilots train, how planes are built, and how ATC works. We will profile aviation businesses and showcase aviation products. We will provide safety tips for private and recreational pilots and career tips for professional pilots.\"\nThe Aviators premiered on the Global Television Network on Saturday, September 4, 2010. It could also be seen on CHEK-TV in Canada and is distributed to all 356 Public Broadcasting Stations in the United States for broadcast in numerous markets starting in September 2010. On September 1, 2010 the producers announced that a deal had been signed with Discovery Channel Asia that saw the series broadcast overseas in the spring of 2011.\nIn the first six months after its premiere, the show aired almost 8,000 times across North America - an average of over 40 times a day. The Aviators launched on Hulu in February 2011 and was viewed over 32,000 times in just two weeks. In March 2011 producers announced some changes for season two including the addition of country music singer George Canyon to the cast as a guest host for the season. The current season's premiere date is September 16, 2013. Production for a fifth season has begun, and is planned to air in North America in September 2014.", "rate": 33, "genre": ["Documentary"], "cast": ["Anthony Nalli"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18862   Expand The Aviators   (2010) User Score Overview The Aviators is an award-winning weekly documentary-lifestyle-science TV series featuring interesting people, the latest aircraft, current technology and fly-in destinations. The show's site describes subject matter as follows: \"We will take you behind the scenes to show you how airline pilots train, how planes are built, and how ATC works. We will profile aviation businesses and showcase aviation products. We will provide safety tips for private and recreational pilots and career tips for professional pilots.\" The Aviators premiered on the Global Television Network on Saturday, September 4, 2010. It could also be seen on CHEK-TV in Canada and is distributed to all 356 Public Broadcasting Stations in the United States for broadcast in numerous markets starting in September 2010. On September 1, 2010 the producers announced that a deal had been signed with Discovery Channel Asia that saw the series broadcast overseas in the spring of 2011. In the first six months after its premiere, the show aired almost 8,000 times across North America - an average of over 40 times a day. The Aviators launched on Hulu in February 2011 and was viewed over 32,000 times in just two weeks. In March 2011 producers announced some changes for season two including the addition of country music singer George Canyon to the cast as a guest host for the season. The current season's premiere date is September 16, 2013. Production for a fifth season has begun, and is planned to air in North America in September 2014. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Nalli Himself Full Cast & Crew Current Season Season 7 2017 | 6 Episodes Season 7 of The Aviators premiered on November 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Aviators. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.theaviators.tv/ Genres Documentary Keywords airplane aviation Content Score 43 There's no 'I' in team... Top Contributors 29 Elizabeth Jennings 4 Aty o 4 obishiro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}