{"link": "https://www.themoviedb.org/tv/4999?language=en", "title": "Bob and Margaret", "resume": "Bob and Margaret is a Canadian/UK animated television series that was also shown in the United States and all over the world. The series was produced by Nelvana, a Toronto animation studio, and created by Canadian David Fine and Brit Alison Snowden. The series was based on the Academy Award winning short film Bob's Birthday, featuring the same main characters, which won the Best Animated Short Film Oscar in 1994. The series is one of the few Canadian TV shows to ever have regular American exposure. In Canada, it was the highest rated Canadian made animation series ever when it aired in prime time on Global Television.\nThe show revolved around a married English couple named Bob and Margaret Fish, a middle class 40-ish working couple with no children and two dogs named William and Elizabeth. Bob is a dentist and Margaret is a chiropodist. Bob and Margaret struggle with everyday issues and mid life crisis. Stories often revolve around the mundane, but in a way which is eminently relatable. From the trials of shopping to dealing with friends who annoy them, but owe them a dinner.\nIn the first two seasons, Bob and Margaret lived in England, in the South London community of Balham. For the third and fourth seasons, however, they moved to Toronto, Canada, allowing the writers to explore the humour of culture clash. The move was actually inspired by the realities of funding, with certain Canadian tax benefits dependent on stories actually based in Canada. As such, to keep the series funded, the move was necessary. The creators of the series chose to take an executive role on these latter two seasons, reviewing scripts and consulting, but not involved in the detail they were for the first two seasons. Snowden continued to provide the voice of Margaret, but Bob's voice, originally played by Andy Hamilton, was replaced by Brian George.", "rate": 78, "genre": ["Animation", "Comedy"], "cast": ["Andy Hamilton", "Alison Snowden", "Brian George", "Adrian Truss", "Jayne Eastwood"], "character": ["Bob", "Margaret"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4999   Expand Bob and Margaret   (1998) User Score Overview Bob and Margaret is a Canadian/UK animated television series that was also shown in the United States and all over the world. The series was produced by Nelvana, a Toronto animation studio, and created by Canadian David Fine and Brit Alison Snowden. The series was based on the Academy Award winning short film Bob's Birthday, featuring the same main characters, which won the Best Animated Short Film Oscar in 1994. The series is one of the few Canadian TV shows to ever have regular American exposure. In Canada, it was the highest rated Canadian made animation series ever when it aired in prime time on Global Television. The show revolved around a married English couple named Bob and Margaret Fish, a middle class 40-ish working couple with no children and two dogs named William and Elizabeth. Bob is a dentist and Margaret is a chiropodist. Bob and Margaret struggle with everyday issues and mid life crisis. Stories often revolve around the mundane, but in a way which is eminently relatable. From the trials of shopping to dealing with friends who annoy them, but owe them a dinner. In the first two seasons, Bob and Margaret lived in England, in the South London community of Balham. For the third and fourth seasons, however, they moved to Toronto, Canada, allowing the writers to explore the humour of culture clash. The move was actually inspired by the realities of funding, with certain Canadian tax benefits dependent on stories actually based in Canada. As such, to keep the series funded, the move was necessary. The creators of the series chose to take an executive role on these latter two seasons, reviewing scripts and consulting, but not involved in the detail they were for the first two seasons. Snowden continued to provide the voice of Margaret, but Bob's voice, originally played by Andy Hamilton, was replaced by Brian George. Featured Crew Alison Snowden Creator David Fine Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andy Hamilton Bob Alison Snowden Margaret Brian George Adrian Truss Jayne Eastwood Full Cast & Crew Last Season Season 4 2001 | 13 Episodes Season 4 of Bob and Margaret premiered on September 13, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1987-01-07 Filthy Rich & Catflap 6.7  Facts Status  Ended Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords cartoon british comedy adult animation Content Score 93 Almost there... Top Contributors a 12 alexmate O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}