{"link": "https://www.themoviedb.org/tv/67198?language=en", "title": "Star Trek: Discovery", "resume": "Ten years before Kirk, Spock, and the Enterprise there was Discovery.  Star Trek, one of the most iconic and influential global television franchises, returns 50 years after it first premiered featuring a new ship, new characters and new missions, while embracing the same ideology and hope for the future that inspired a generation of dreamers and doers.", "rate": 69, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Sonequa Martin-Green", "Doug Jones", "Jason Isaacs", "Anthony Rapp", "Mary Wiseman"], "character": ["Michael Burnham", "Saru", "Gabriel Lorca", "Paul Stamets", "Sylvia Tilly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67198   Expand Star Trek: Discovery   (2017) User Score  Play Trailer Overview Ten years before Kirk, Spock, and the Enterprise there was Discovery.  Star Trek, one of the most iconic and influential global television franchises, returns 50 years after it first premiered featuring a new ship, new characters and new missions, while embracing the same ideology and hope for the future that inspired a generation of dreamers and doers. Featured Crew Bryan Fuller Creator Alex Kurtzman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  75 Content Issues  3 Images Backdrops  23 Posters  25 Videos Trailers  4 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sonequa Martin-Green Michael Burnham Doug Jones Saru Jason Isaacs Gabriel Lorca Anthony Rapp Paul Stamets Mary Wiseman Sylvia Tilly Full Cast & Crew Last Season Season 1 2017 | 15 Episodes View All Seasons Social Reviews  2 Discussions  78 C A review by ConradM Written by  ConradM  on April 20, 2018 It's hard/impossible to find an online review of the full season.  The full 15-episode Season 1 is available on Netflix here in Europe. Access in the USA is via other paid services, at least on initial release, but American viewers might be able to catch up with this on Netflix if they travel.  Meanwhile all initial reviews are based on the pilot (episodes 1 and 2 combined).  The pilot attracted good reviews - more than the full season deserves - in part simply from the pleasure of seeing a new Star Trek series on screen.  By the end of Season 1, it feels uneven.  There are some great ideas...  read the rest. Read All Reviews Media Most Popular Videos  4 Backdrops  23 Posters  25 Recommendations   2017-09-10 The Orville 7.2    2017-10-02 The Gifted 7.0    1995-01-16 Star Trek: Voyager 7.8    1987-09-28 Star Trek: The Next Generation 8.2    2017-09-29 Marvel's Inhumans 5.6    2015-12-14 The Expanse 7.5    1993-01-03 Star Trek: Deep Space Nine 7.8    2018-02-02 Altered Carbon 7.9  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/star-trek-discovery/ Genres Sci-Fi & Fantasy Keywords spacecraft space travel alien space opera Content Score 100 Yes! Looking good! Top Contributors 82 Elizabeth Jennings 46 Marso m 16 mcadam6 15 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}