{"link": "https://www.themoviedb.org/tv/18015?language=en", "title": "The Future Is Wild", "resume": "The Future is Wild is an animated children's version of Canadian 2003 joint Animal Planet/ORF and ZDF co-production The Future Is Wild. It was developed by Nelvana Animation, and directed by Mike Fallows, with characters and creatures designed by Brett Jubinville. It is made in CGI animation. The show is a Teletoon Original Production and first aired on Teletoon on June 28, 2010; it made its debut in the US on Discovery Kids on October 13, 2007. It now airs weekday mornings on The Hub. It features four teenagers who study the future of the earth to find a new habitat for humanity, while learning about the futuristic creatures who inhabit it. The show ran for one 26 episode season. It utilizes creatures speculated about in a the original version of The Future Is Wild, albeit with highly fictionalized elements.", "rate": 100, "genre": ["Animation"], "cast": ["Cedric Smith", "Marc Donato"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18015   Expand The Future Is Wild   (2007) User Score Overview The Future is Wild is an animated children's version of Canadian 2003 joint Animal Planet/ORF and ZDF co-production The Future Is Wild. It was developed by Nelvana Animation, and directed by Mike Fallows, with characters and creatures designed by Brett Jubinville. It is made in CGI animation. The show is a Teletoon Original Production and first aired on Teletoon on June 28, 2010; it made its debut in the US on Discovery Kids on October 13, 2007. It now airs weekday mornings on The Hub. It features four teenagers who study the future of the earth to find a new habitat for humanity, while learning about the futuristic creatures who inhabit it. The show ran for one 26 episode season. It utilizes creatures speculated about in a the original version of The Future Is Wild, albeit with highly fictionalized elements. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cedric Smith Marc Donato Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of The Future Is Wild premiered on October 13, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Future Is Wild. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}