{"link": "https://www.themoviedb.org/tv/1571?language=en", "title": "The Legend of Zelda", "resume": "The Legend of Zelda is an American animated series based on the Japanese video game series The Legend of Zelda for the Nintendo Entertainment System. The plot follows the adventures of Link and Princess Zelda as they defend the kingdom of Hyrule from an evil wizard named Ganon. It is heavily based on the first game of the Zelda series, The Legend of Zelda, but includes some references to the second, Zelda II: The Adventure of Link. The show was produced by DIC Entertainment and distributed by Viacom Enterprises in association with Nintendo. It comprises thirteen episodes which first aired in North America from September 8, 1989 to December 1, 1989.", "rate": 47, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure", "Comedy"], "cast": ["Jonathan Potts", "Len Carlson", "Cynthia Preston", "Colin Fox", "Don Francks"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1571   Expand The Legend of Zelda   (1989) User Score Overview The Legend of Zelda is an American animated series based on the Japanese video game series The Legend of Zelda for the Nintendo Entertainment System. The plot follows the adventures of Link and Princess Zelda as they defend the kingdom of Hyrule from an evil wizard named Ganon. It is heavily based on the first game of the Zelda series, The Legend of Zelda, but includes some references to the second, Zelda II: The Adventure of Link. The show was produced by DIC Entertainment and distributed by Viacom Enterprises in association with Nintendo. It comprises thirteen episodes which first aired in North America from September 8, 1989 to December 1, 1989. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Potts Len Carlson Cynthia Preston Colin Fox Don Francks Full Cast & Crew Last Season Season 1 1989 | 13 Episodes Season 1 of The Legend of Zelda premiered on September  8, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Zelda. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  23m, 19m, 15m, 30m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 8 zurman1 3 theramyz V 1 Virulana88 z 1 zzan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}