{"link": "https://www.themoviedb.org/tv/42828?language=en", "title": "Rozen Maiden", "resume": "Jun is a total recluse who won't take a step outside his house and only loves online shopping. When Jun winds up a doll that suddenly appears in his room because of his mail-orders tendencies, he has no idea what he's in for. The doll comes to life and proclaims herself to be 'Shinku'. She later binds Jun to her as a medium, her counterpart, and her magical power source, in an attempt to save his life. And so starts the beginning of a chaotic life for the Sakurada household as more Rozen Maidens arrive on their doorsteps. But what are the Rozen Maidens and why do they exist? And will Jun learn to open up his heart and face his fears? The main characters are: Sakurada Jun - The main lead of the story who has to learn to face his fears, thanks to the arrival of Shinku. The interaction between Jun and Shinku are often funny and at times, touching.", "rate": 70, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Rie Tanaka", "Sakura Nogawa", "Natsuko Kuwatani", "Miyuki Sawashiro", "Asami Sanada"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42828   Expand Rozen Maiden   (2004) User Score Overview Jun is a total recluse who won't take a step outside his house and only loves online shopping. When Jun winds up a doll that suddenly appears in his room because of his mail-orders tendencies, he has no idea what he's in for. The doll comes to life and proclaims herself to be 'Shinku'. She later binds Jun to her as a medium, her counterpart, and her magical power source, in an attempt to save his life. And so starts the beginning of a chaotic life for the Sakurada household as more Rozen Maidens arrive on their doorsteps. But what are the Rozen Maidens and why do they exist? And will Jun learn to open up his heart and face his fears? The main characters are: Sakurada Jun - The main lead of the story who has to learn to face his fears, thanks to the arrival of Shinku. The interaction between Jun and Shinku are often funny and at times, touching. Featured Crew Peach-Pit Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Tanaka Sakura Nogawa Natsuko Kuwatani Miyuki Sawashiro Asami Sanada Full Cast & Crew Last Season Season 3 2006 | 13 Episodes Season 3 of Rozen Maiden premiered on December 22, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rozen Maiden. You can help by rating TV shows you've seen. Facts Original Name  ローゼンメイデン Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.madman.com.au/actions/series.do?method=home&videogramId=14923 Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors J 9 JohnyB0y m 4 magoozin i 3 iviso M 2 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}