{"link": "https://www.themoviedb.org/tv/41684?language=en", "title": "Mid Morning Matters with Alan Partridge", "resume": "Mid Morning Matters is a British mockumentary series written by Steve Coogan, Neil Gibbons, Rob Gibbons and Armando Iannucci, produced by Baby Cow Productions and funded by the British arm of Australian lager company Foster's, starring Coogan as fictional radio DJ Alan Partridge. The first of twelve 15-minute episodes was uploaded to the Foster's Funny website on 5 November 2010, and then available on YouTube. Six 30-minute episodes titled Alan Partridge Mid Morning Matters: Special Edition, edited from the web series, began airing on Sky Atlantic HD in July 2012 as part of a deal between producers Baby Cow and BSkyB. Mid Morning Matters 2 began filming a new six part series in February 2012. It will be shown exclusively on Sky Atlantic in 2013.", "rate": 90, "genre": ["Comedy"], "cast": ["Steve Coogan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41684   Expand Mid Morning Matters with Alan Partridge   (2010) User Score Overview Mid Morning Matters is a British mockumentary series written by Steve Coogan, Neil Gibbons, Rob Gibbons and Armando Iannucci, produced by Baby Cow Productions and funded by the British arm of Australian lager company Foster's, starring Coogan as fictional radio DJ Alan Partridge. The first of twelve 15-minute episodes was uploaded to the Foster's Funny website on 5 November 2010, and then available on YouTube. Six 30-minute episodes titled Alan Partridge Mid Morning Matters: Special Edition, edited from the web series, began airing on Sky Atlantic HD in July 2012 as part of a deal between producers Baby Cow and BSkyB. Mid Morning Matters 2 began filming a new six part series in February 2012. It will be shown exclusively on Sky Atlantic in 2013. Featured Crew Armando Iannucci Creator Steve Coogan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Coogan Full Cast & Crew Last Season Season 1 2010 | 12 Episodes Season 1 of Mid Morning Matters with Alan Partridge premiered on November  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mid Morning Matters with Alan Partridge. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 4 kcdh 3 kuzronk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}