{"link": "https://www.themoviedb.org/tv/38849?language=en", "title": "Loving You a Thousand Times", "resume": "Loving You a Thousand Times is a South Korean television drama starring Lee Soo-kyung, Jung Gyu-woon, Go Eun-mi, Ryu Jin and Lee Si-young. It aired on SBS from August 29, 2009 to March 7, 2010 on Saturdays and Sundays at 20:50 for 55 episodes.", "rate": 80, "genre": ["Drama"], "cast": ["Lee Soo-kyung", "Jung Gyu-woon", "Go Eun-mi", "Ryu Jin", "Park Soo-jin"], "character": ["Go Eun-nim", "Baek Kang-ho", "Lee Sun-young", "Baek Sae-hoon", "Oh Nam Jung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38849   Expand Loving You a Thousand Times   (2009) User Score Overview Loving You a Thousand Times is a South Korean television drama starring Lee Soo-kyung, Jung Gyu-woon, Go Eun-mi, Ryu Jin and Lee Si-young. It aired on SBS from August 29, 2009 to March 7, 2010 on Saturdays and Sundays at 20:50 for 55 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Soo-kyung Go Eun-nim Jung Gyu-woon Baek Kang-ho Go Eun-mi Lee Sun-young Ryu Jin Baek Sae-hoon Park Soo-jin Oh Nam Jung Full Cast & Crew Last Season Season 1 — | 55 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Loving You a Thousand Times. You can help by rating TV shows you've seen. Facts Original Name  천만번 사랑해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/1000/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 38 Maria180493 6 Elizabeth Jennings z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}