{"link": "https://www.themoviedb.org/tv/63945?language=en", "title": "Angel's Revenge", "resume": "Lee Seon-yoo is training to become a nun. Right before she finally gets her wish, she learns that her beloved older sister Jin-yoo has died. Jin-yoo was betrayed and killed by her lover, Jang Tae-jung. Tae-jung, a smart, good-looking man from a humble background, had committed himself to luring and marrying a tycoon's daughter \"against all odds,\" as part of an effort to get him into the upper class of society.\nSeon-yoo then meets Seo Ji-seok, an immature man from a rich family whose sister Ji-hee is married to Tae-jung. Ji-seok is at risk of losing the inherited family business to Tae-jung and Ji-hee, since Ji-seok's mother is the family patriarch's second wife.\nTo take revenge on the man responsible for her sister's death, Seon-yoo gives up her dream of becoming a nun. She marries Ji-seok, and becomes Tae-jung's sister-in-law. Thus, Seon-yoo begins leading a double life: she pretends to be the ideal wife and daughter-in-law in front of the Seo family, and only takes off her mask in front of Tae-jung, proving she can be just as ruthless and vicious as Tae-jung. Seon-yoo wears her angel wings while hiding the dagger of revenge.", "rate": 0, "genre": ["Drama", "Family", "Romance"], "cast": ["Yoon Soy", "Park Jung Chul", "Lee Se-eun", "Lee Eung-kyeong", "Kim Min-Soo"], "character": ["Lee Seon-yoo", "Jang Tae-jung", "Lee Jin-yoo", "Na Dal-nyeo", "Heo Ki-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63945   Expand Angel's Revenge   (2014) User Score Overview Lee Seon-yoo is training to become a nun. Right before she finally gets her wish, she learns that her beloved older sister Jin-yoo has died. Jin-yoo was betrayed and killed by her lover, Jang Tae-jung. Tae-jung, a smart, good-looking man from a humble background, had committed himself to luring and marrying a tycoon's daughter \"against all odds,\" as part of an effort to get him into the upper class of society. Seon-yoo then meets Seo Ji-seok, an immature man from a rich family whose sister Ji-hee is married to Tae-jung. Ji-seok is at risk of losing the inherited family business to Tae-jung and Ji-hee, since Ji-seok's mother is the family patriarch's second wife. To take revenge on the man responsible for her sister's death, Seon-yoo gives up her dream of becoming a nun. She marries Ji-seok, and becomes Tae-jung's sister-in-law. Thus, Seon-yoo begins leading a double life: she pretends to be the ideal wife and daughter-in-law in front of the Seo family, and only takes off her mask in front of Tae-jung, proving she can be just as ruthless and vicious as Tae-jung. Seon-yoo wears her angel wings while hiding the dagger of revenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Soy Lee Seon-yoo Park Jung Chul Jang Tae-jung Lee Se-eun Lee Jin-yoo Lee Eung-kyeong Na Dal-nyeo Kim Min-Soo Heo Ki-jin Full Cast & Crew Last Season Season 1 2014 | 103 Episodes Season 1 of Angel's Revenge premiered on January  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Angel's Revenge. You can help by rating TV shows you've seen. Facts Original Name  천상여자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/skyangel/ Genres Drama Family Romance Keywords korea Content Score 71 Just a little bit more... Top Contributors t 37 tmdb38202327 M 3 Maria180493 TB 1 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}