{"link": "https://www.themoviedb.org/tv/12412?language=en", "title": "The Old Grey Whistle Test", "resume": "The Old Grey Whistle Test is an influential BBC2 television music show that ran from 1971 to 1987. It took over the BBC2 late night slot from \"Disco Two\", which had been running since January 1970, while continuing to feature non-chart music. It was devised by BBC producer Rowan Ayers. According to presenter Bob Harris, the programme derived its name from a Tin Pan Alley phrase from years before. When they got the first pressing of a record they would play it to people they called the old greys—doormen in grey suits. The songs they could remember and whistle, having heard it just once or twice, had passed the old grey whistle test.", "rate": 80, "genre": [], "cast": ["Bob Harris", "Annie Nightingale"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12412   Expand The Old Grey Whistle Test   (1971) User Score Overview The Old Grey Whistle Test is an influential BBC2 television music show that ran from 1971 to 1987. It took over the BBC2 late night slot from \"Disco Two\", which had been running since January 1970, while continuing to feature non-chart music. It was devised by BBC producer Rowan Ayers. According to presenter Bob Harris, the programme derived its name from a Tin Pan Alley phrase from years before. When they got the first pressing of a record they would play it to people they called the old greys—doormen in grey suits. The songs they could remember and whistle, having heard it just once or twice, had passed the old grey whistle test. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Harris Annie Nightingale Full Cast & Crew Last Season Old grey whistle test season 4 1980 | 2 Episodes Season 4 of The Old Grey Whistle Test premiered on August 11, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Old Grey Whistle Test. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 2 lineker 1 st piran  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}