{"link": "https://www.themoviedb.org/tv/73608?language=en", "title": "King is Not Easy", "resume": "Da Xi, a girl who is very good at cooking has only one dream: find a peerless beauty husband. One day she met a Royal Guard, Shao Yong, and fell in love at first sight, so she decides to stay near him and the only way to do it is entering the palace. Da Xi became a maid, only to find themselves fooled, so she decided to escape palace, she ran over the wall, but she met by chance the emperor Ji Man. The emperor thought that she was an assassin, so he tried to stop her escape but instead, an accident occurred: their souls were swapped, she became him, and he became her.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Zhang Yi Jie", "Bai Lu", "Zhao Yi Qin"], "character": ["King Ji Man", "Da Xi", "Shao Yong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73608   Expand King is Not Easy   (2017) User Score Overview Da Xi, a girl who is very good at cooking has only one dream: find a peerless beauty husband. One day she met a Royal Guard, Shao Yong, and fell in love at first sight, so she decides to stay near him and the only way to do it is entering the palace. Da Xi became a maid, only to find themselves fooled, so she decided to escape palace, she ran over the wall, but she met by chance the emperor Ji Man. The emperor thought that she was an assassin, so he tried to stop her escape but instead, an accident occurred: their souls were swapped, she became him, and he became her. Featured Crew Yu Zheng Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhang Yi Jie King Ji Man Bai Lu Da Xi Zhao Yi Qin Shao Yong Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of King is Not Easy premiered on August 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on King is Not Easy. You can help by rating TV shows you've seen. Facts Original Name  大王不容易 Status  Ended Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  30m Homepage  - Genres Comedy Drama Keywords romantic comedy body-swap Content Score 71 Just a little bit more... Top Contributors 25 secret2301 15 sansalayne M 13 Maria180493 3 galactica_j  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}