{
  "link": "https://www.rottentomatoes.com/tv/suits\n",
  "title": "Suits",
  "resume": "In Suits, one of Manhattan's top corporate lawyers (Gabriel Macht) sets out to recruit a new hotshot associate and hires the only guy that impresses him, a brilliant but unmotivated college dropout (Patrick J. Adams). Though he isn't actually a lawyer, this legal prodigy has the book smarts of a Harvard law grad and the street smarts of a hustler. However, in order to serve justice and save their jobs, both these unconventional thinkers must continue the charade.",
  "rate": "90",
  "genre": "Drama",
  "cast": {
    "actor": [
      "Gabriel Macht",
      "Patrick J. Adams",
      "Gina Torres",
      "Meghan Markle",
      "Sarah Rafferty",
      "Rick Hoffman"
    ],
    "character": [
      "Harvey Specter",
      "Mike Ross",
      "Jessica Pearson",
      "Rachel Zane",
      "Donna Paulsen",
      "Louis Litt"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2011 - ) Suits (2011 - ) | 90 % 77 % 90% liked it Critic Consensus: Series Info Creator: Aaron Korsh Starring: Gabriel Macht , Patrick J. Adams , Gina Torres Suits Videos Suits Photos Seasons Suits: Season 36 No Tomatometer score yet... Suits: Season 8 No Tomatometer score yet... Suits: Season 7 Critics Consensus: Suits reaches a conclusion that will surely satisfy its devotees. Suits: Season 6 Critics Consensus: Suits: Season 5 Critics Consensus: Suits: Season 4 Critics Consensus: Suits: Season 3 Critics Consensus: Suits stimulates with drama derived from the strength of its well-developed characters' relationships. Suits: Season 2 Critics Consensus: Suits: Season 1 Critics Consensus: Suits can feel bland and bloated, but flashes of sharp dialogue help bring the show to life. Cast as Harvey Specter as Mike Ross as Jessica Pearson as Rachel Zane as Donna Paulsen as Louis Litt as Jenny Griffith as Trevor as Jack as Daniel Hardman as Cameron Dennis as Ava Hessington as Katrina Bennett as Sean Cahill as Harold as Jeff Malone as Stephen Huntley as Travis Tilden as Scotty as Sheila Sazs as Anita Gibbs as Zoe as District Attorney Wolf as Darby as Paul Porter as Trent Devon as Alex Shelton as Maria as Allison Holt as Alexandra Leeds as Lisa Parker Sainz as Walter Gillis as Henry Gerard as Jimmy as Laura Zane as Tommy Walsh as Gordon Specter as Charles Van Dyke as Nell Sawyer as Quelling as Kyle Durant as Keith Hoyt as Kyle Durant as Eric Woodall as Sarah Hardman as Charles Forstman as Lawrence Kemp as Monica Series Details TV Network: USA Premiere Date: Jun 23, 2011 Genre: Drama Doug Liman , David Bartis , Aaron Korsh , Kevin Bray Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for Suits 10 TV Shows You Should Binge-Watch This July 2018 TV Premiere Dates Calendar 2018 TV Finale Dates Calendar Renewed and Canceled TV Shows 2018 Renewed and Canceled TV Shows 2017 2017 Spring/Summer TV Premiere Dates 9 TV Shows You Should Binge-Watch This July Suits ’ Gabriel Macht Digs Into the Personal Side of Harvey Specter 2016/2017 Winter TV Premiere Dates 2016 Summer TV Premiere Dates 10 TV Shows You Should Binge-Watch This January People’s Choice Awards 2016: Furious 7 and The Big Bang Theory Are Fan Favorites 2016 Winter/Spring TV Premiere Dates People’s Choice Awards Nominations 2016 View All Suits News Discussion Forum Discuss Suits on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}