{
  "link": "https://www.themoviedb.org/tv/72750?language=en",
  "title": "Killing Eve",
  "resume": "A security consultant hunts for a ruthless assassin. Based on the Villanelle novellas by Luke Jennings.",
  "rate": "",
  "genre": [
    "Crime",
    "Drama"
  ],
  "cast": {
    "actor": [
      "Sandra Oh",
      "Jodie Comer",
      "Fiona Shaw",
      "Kim Bodnia",
      "Owen McDonnell"
    ]
  },
  "characters": {
    "characters": [
      "Eve Polastri",
      "Villanelle",
      "Carolyn Martens",
      "Konstantin",
      "Niko Polastri"
    ]
  },
  "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72750   Expand Killing Eve   (2018) User Score  Play Trailer Overview A security consultant hunts for a ruthless assassin. Based on the Villanelle novellas by Luke Jennings. Featured Crew Phoebe Waller-Bridge Creator Rob Williams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sandra Oh Eve Polastri Jodie Comer Villanelle Fiona Shaw Carolyn Martens Kim Bodnia Konstantin Owen McDonnell Niko Polastri Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Killing Eve premiered on April  8, 2018. View All Seasons Social Reviews  2 Discussions  0 A review by offscreenbabble  10.0 Written by  offscreenbabble  on June  1, 2018 One of My Favorite Shows of 2018   The show is great for a number of reasons but the biggest reason is it's character building. The show does a very good job of pulling the viewer in with its aesthetics, locations, and humor but Eve and Villanelle are amazing characters. Ultimately, it is a \"Cat and Mouse\" story that comes across as fresh and new. You will find yourself falling in love with Villanelle and rotting for Eve to catch her.\nListen to our full review on the Offscreen Babble podcast wherever you listen to podcasts. https://itunes.apple.com/us/podcast/ep-5-solo-a-star-wars-...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2018-05-06 Vida 6.4    2018-06-04 Dietland 8.0    2015-04-20 Safe House 6.3    2005-06-05 The Comeback 7.6    2015-11-24 Capital 7.5    2018-04-02 The Crossing 7.8    2018-03-25 Barry 7.2    2018-04-05 Deep State 6.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.bbcamerica.com/shows/killing-eve Genres Crime Drama Keywords based on novel or book psychopath crime psycho killer Content Score 100 Yes! Looking good! Top Contributors t 26 tmdb42368388 Y 12 YJ 9 Elizabeth Jennings C 9 CyberScream  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"
}