{
  "link": "https://www.themoviedb.org/tv/9985?language=en",
  "title": "Dennis, The Menace",
  "resume": "Dennis the Menace is a television series based on the Hank Ketcham comic strip of the same name. Originally sponsored by Kellogg's cereals and Best Foods, Dennis the Menace preceded The Ed Sullivan Show on Sunday evenings on CBS from 1959 to 1963. The series stars Jay North as Dennis Mitchell; Herbert Anderson as his father, Henry; Gloria Henry as his mother, Alice; Joseph Kearns as George Wilson, Gale Gordon as George's brother, John Wilson, and Sylvia Field as George's wife, Martha Wilson. It was produced by Dariell Productions and Screen Gems.",
  "rate": "",
  "genre": [
    "Comedy",
    "Family"
  ],
  "cast": {
    "actor": [
      "Jay North",
      "Joseph Kearns",
      "Gloria Henry",
      "Herbert Anderson",
      "Sylvia Field"
    ]
  },
  "characters": {
    "characters": []
  },
  "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9985   Expand Dennis, The Menace   (1959) User Score Overview Dennis the Menace is a television series based on the Hank Ketcham comic strip of the same name. Originally sponsored by Kellogg's cereals and Best Foods, Dennis the Menace preceded The Ed Sullivan Show on Sunday evenings on CBS from 1959 to 1963. The series stars Jay North as Dennis Mitchell; Herbert Anderson as his father, Henry; Gloria Henry as his mother, Alice; Joseph Kearns as George Wilson, Gale Gordon as George's brother, John Wilson, and Sylvia Field as George's wife, Martha Wilson. It was produced by Dariell Productions and Screen Gems. Featured Crew Marcelo Rodrigues Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay North Joseph Kearns Gloria Henry Herbert Anderson Sylvia Field Full Cast & Crew Last Season Season 4 1962 | 38 Episodes Season 4 of Dennis, The Menace premiered on September 30, 1962. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1969-09-17 The Courtship of Eddie's Father 6.2    1969-09-11 Room 222 5.8    1948-06-20 The Ed Sullivan Show 6.6    1965-09-14 F Troop 6.4    1958-09-24 The Donna Reed Show 6.7    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1961-10-02 Ben Casey 6.5    1961-09-28 Hazel 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.dennistvshow.com Genres Comedy Family Keywords neighbor kids sitcom dennis the menace Content Score 93 Almost there... Top Contributors m 15 marcelo.rodrigues 10 Banana d 6 dennisfan 2 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"
}