{
  "link": "https://www.themoviedb.org/tv/5191?language=en",
  "title": "RoboCop: The Series",
  "resume": "RoboCop: The Series is a 1994 television series based on the film of the same name. It stars Richard Eden as the title character. Made to appeal primarily to children and young teenagers, it lacks the graphic violence that was the hallmark of RoboCop and RoboCop 2. RoboCop has several non-lethal alternatives to killing criminals, which ensures that certain villains can be recurring. The OCP Chairman and his corporation are treated as simply naïve and ignorant, in contrast to their malicious and immoral behavior from the second film onward.",
  "rate": "",
  "genre": [
    "Sci-Fi",
    "Fantasy",
    "Action",
    "Adventure"
  ],
  "cast": {
    "actor": [
      "Richard Eden",
      "Andrea Roth",
      "Susan Roman",
      "Blu Mankuma",
      "Yvette Nipar"
    ]
  },
  "characters": {
    "characters": [
      "Diana Power"
    ]
  },
  "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5191   Expand RoboCop: The Series   (1994) User Score Overview RoboCop: The Series is a 1994 television series based on the film of the same name. It stars Richard Eden as the title character. Made to appeal primarily to children and young teenagers, it lacks the graphic violence that was the hallmark of RoboCop and RoboCop 2. RoboCop has several non-lethal alternatives to killing criminals, which ensures that certain villains can be recurring. The OCP Chairman and his corporation are treated as simply naïve and ignorant, in contrast to their malicious and immoral behavior from the second film onward. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Eden Andrea Roth Diana Power Susan Roman Blu Mankuma Yvette Nipar Full Cast & Crew Last Season Robocop season 1 1994 | 22 Episodes Season 1 of RoboCop: The Series premiered on March 18, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Any Fans of this TV Series? Open 0 by Irina\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on RoboCop: The Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors d 24 denis s 3 speedycars t 3 take-kino A 2 ABR  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"
}