{
  "link": "https://www.rottentomatoes.com/tv/the_originals\n",
  "title": "The Originals",
  "resume": "A spin-off of \"The Vampire Diaries\" focuses on the original vampire family who return to New Orleans to reclaim the city they helped build that is now under the control of a diabolical vampire named Marcel.",
  "rate": "38",
  "genre": "Horror",
  "cast": {
    "actor": [
      "Joseph Morgan",
      "Daniel Gillies",
      "Claire Holt",
      "Phoebe Tonkin",
      "Charles Michael Davis",
      "Daniella Pineda"
    ],
    "character": [
      "Klaus Mikaelson",
      "Elijah",
      "Rebekah",
      "Hayley",
      "Marcel",
      "Sophie"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2013 - ) The Originals (2013 - ) | Tomatometer Not Available... —— 38 % 91% liked it Critic Consensus: Series Info Creator: Julie Plec Starring: Joseph Morgan , Daniel Gillies , Claire Holt Most Recent Episode Aired Wed, Jun 20, 2018 We Have Not Long to Love Next Episode Wed, July 11, 2018 There in the Disappearing Light The Originals Videos The Originals Photos Seasons The Originals: Season 5 No Tomatometer score yet... The Originals: Season 4 No Tomatometer score yet... The Originals: Season 3 No Tomatometer score yet... The Originals: Season 2 No Tomatometer score yet... The Originals: Season 1 Critics Consensus: The Originals may overwhelm casual viewers with its myriad twists and bevy of supernatural beings, but this a sleek, atmospheric Vampire Diaries spinoff with potential. Cast as Klaus Mikaelson as Elijah as Rebekah as Hayley as Marcel as Sophie as Camille as Davina as Cassie/Esther as Vincent/Finn as Kaleb/Kol as Hope Mikaelson as Freya as Jackson as Rebekah as Kol as Mikael as Lucien as Genevieve as Josh as Father Kieran as Dahllia as Aurora as Hope as Lenore as Aiden as Aya as Tristan as Det. Kinney as Sabine as Antoinette as Keelin as Josephine as Monique as Francesca as Mary as Ivy as Finn as Thierry as Gia as Esther as Cortez as Eve as Cary as Stefan Salvatore as Agnes as Francesca as Caroline as Tatia as Esther as Sofya as Diego as Oliver as Matt Donovan as Declan as Roman Series Details TV Network: CW Premiere Date: Oct 3, 2013 Genre: Horror Gina Girolamo , Julie Plec , Leslie Morgenstein Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for The Originals 2018 TV Premiere Dates Calendar Renewed and Canceled TV Shows 2018 15 Memorable Crossover Episodes Ranked Renewed and Canceled TV Shows 2017 2017 Spring/Summer TV Premiere Dates 2016/2017 Winter TV Premiere Dates 2016 Winter/Spring TV Premiere Dates Fall 2015 TV Premiere Dates View All The Originals News Discussion Forum Discuss The Originals on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}