{
  "link": "https://www.rottentomatoes.com/tv/lost_in_space\n",
  "title": "Lost in Space",
  "resume": "A Netflix Original dramatic and modern reimagining of the classic 1960's science fiction series. Set 30 years in the future, colonization in space is now a reality, and the Robinson family is among those tested and selected to make a new life for themselves in a better world. But when the new colonists find themselves abruptly torn off course en route to their new home they must forge new alliances and work together to survive in a dangerous alien environment, lightyears from their original destination.",
  "rate": "68",
  "genre": "Science Fiction & Fantasy",
  "cast": {
    "actor": [
      "Toby Stephens",
      "Molly Parker",
      "Ignacio Serricchio",
      "Taylor Russell",
      "Mina Sundwall",
      "Maxwell Jenkins"
    ],
    "character": [
      "John Robinson",
      "Maureen Robinson",
      "Don West",
      "Judy Robinson",
      "Penny Robinson",
      "Will Robinson"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2018 - ) Lost in Space (2018 - ) | 68 % 50 % 89% want to see Critic Consensus: Series Info Starring: Toby Stephens , Molly Parker , Ignacio Serricchio Lost in Space Videos Lost in Space Photos Seasons Lost in Space: Season 2 No Tomatometer score yet... Lost in Space: Season 1 Critics Consensus: Lost in Space 's production values are ambitious enough to attract sci-fi adventure fans, while the story's large heart adds an emotional anchor to all the deep space derring-do. Cast as John Robinson as Maureen Robinson as Don West as Judy Robinson as Penny Robinson as Will Robinson as Dr. Smith Series Details TV Network: Netflix Genre: Science Fiction & Fantasy Matt Sazama , Burk Sharpless , Kevin Burns , Neil Marshall , Marc Helwig , Zack Estrin Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for Lost in Space 2018 TV Premiere Dates Calendar Rampage Is Exactly What You Think It Is 12 TV Shows You Should Binge-Watch This April View All Lost in Space News Discussion Forum Discuss Lost in Space on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}